

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2019.12) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■ 2019.12.02(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:10 ~ 18:20 ==> 당진행(07:35, 강남T), 종일 비옴, 이상탁 차장 출근(마감, 같이 중식 후 퇴근), 반찬(진미채, 멸치) 가지고 옴
									, 실수로 혈당기 안 가지고 와서 오전 체혈 못 함
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 화면설계서 작성
1. 화면 캡처
2. 상단 메뉴 수정 ==> 완료 @@@
1) 대메뉴 > 메뉴 순으로 변경
2) Div에 배경색 설정 ==> 웹에서 안 먹음(background="url('theme://images/m_ic_title.png') no-repeat 1 60%"로 설정해서 안 먹음
<Div id="div_ComBtn" style="border:1 solid #808080ff ; " taborder="0" top="10" height="40" left="20" right="20"
	background="url('theme://images/m_ic_title.png') no-repeat left 60%">
	<Layouts>
	<Layout>
	<Static id="st_Title" class="title" taborder="1" text="시험 조회 &gt; 원료[공정&gt;고로]" left="20" top="12" width="227" height="20"/>
	</Layout>
	</Layouts>
</Div>
-------------------------------------------------------------------------------------------------------------------
 
// DIV에서 배경색 설정
// this.div_ComBtn.set_background("url('theme://images/m_ic_title.png') no-repeat left 60%"); // 정상적으로 보임 => OK
 
3. 조회만 할 경우 메뉴 공통 파일 제거 ==> 완료 @@@
1) url="com::comBtnR.xfdl" 제거할 것
<Div id="div_ComBtn" style="border:1 solid #808080ff ; " taborder="0" top="10" height="40" left="20" right="20"
url="com::comBtnR.xfdl" background="url('theme://images/m_ic_title.png') no-repeat left 60%">
==============================================================================================================
 
- 모니터 콘센트 위치 변경(10시)
1. LG 모니터 전원이 이상함 ==> 핸드폰 구멍과 위치 바꿈
==============================================================================================================
 
- 투비소프트 nexacro platform 17, XPLATFORM 개발(trial) 라이선스(2달) 적용
1. 메일로 받음
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.02(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 민종근 대리 반차(13시 퇴근)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 화면설계서 작성
1. 화면 캡처(시험분석(ta), KOLAS 시험(tk) ==> 완료 @@@
==============================================================================================================
 
- 개인 PC(TAMA, SP114060256) 암호 변경(3개월 마다 변경해야 함)
1. asas1221@ ---> xxxx3333# ---> qwqw1212![현재]
-----------------------------------------------------------------------------------------------------------------------------
 
- 현대제철 암호 변경(3개월 마다 변경해야 함)
1. HYUNDAISTEEL 로그인: https://hsteelro.hyundai-steel.com, 1521666/2020오*h@, 71스타트![현재]
==============================================================================================================
 
- GQMS 티베로 DB 테이블 스페이스 설정 변경 ==> 완료 @@@
1. TIBERO DB 운영계 이관 전 자신이 개발계에 생성한 테이블과 INDEX(PK 포함)의 테이블 스페이스 나누기
2. 테이블 스페이스
1) 테이블 : TBS_GQ_D_00, INDEX : TamaDBTBS
3. 대상 테이블
TB_GQ_CM_COMFILE: 파일 업로드 정보 TB
TB_GQ_CM_DEPT_CD: 부서코드 TB
TB_KOLAS_NMPR_STAT: KOLAS 인원현황 정보 TB
TB_KOLAS_NMPR_STAT_DTL: KOLAS 인원현황 상세 정보 TB
TB_KOLAS_NMPR_STAT_TEAM: KOLAS 팀 정보 TB
TB_KOLAS_QLTY_DCMN: KOLAS 품질문서 정보 TB
TB_KOLAS_RCGN_ITEM: KOLAS 인정항목 정보 TB
TB_KOLAS_RCGN_PLAN: KOLAS 인정계획 정보 TB
TB_KOLAS_RCGN_STAT: KOLAS 인정현황 정보 TB
TB_KOLAS_TST_SPEC: KOLAS 시험규격 정보 TB
==============================================================================================================
 
- GQMS 티베로 DB 테이블 스페이스 설정 변경 처리
1. 기존 데이타 백업(Tibero DB)
1) DBeaver에서 조회 결과 Grid: 마우스 우 클릭 ==> 데이터 추출: 클릭 ==> Data Transfer: SQL: 선택 ==> 완료(F)
C:\01. TAMA_DATA\02. TAMA Project\2019.09(현대제철 전사 시험관리 Prj)\41. DB query\44. Export SQL\
/TB_GQ_CM_COMFILE_201912021334.sql
-------------------------------------------------------------------------------------------------------------------------
 
-- 인덱스 확인(인덱스 객체 정보 조회) : USER_IND_COLUMNS(인덱스 정보 데이터 딕셔너리 뷰)
SELECT A.TABLE_NAME AS "테이블명", A.INDEX_NAME AS "인덱스명"
			, A.COLUMN_NAME AS "칼럼명", A.COLUMN_POSITION AS "칼럼위치", A.COLUMN_LENGTH AS "칼럼길이"
			, A.*
FROM USER_IND_COLUMNS A
WHERE 1=1
	AND A.TABLE_NAME LIKE '%KOLAS_%' 			-- 테이블명
	-- AND A.INDEX_NAME = 'TB_KOLAS_NMPR_STAT_TEAM_02' 		-- 인덱스명
;
----------------------------------------------------------------------------------------------------
 
-- 1. 테이블 DROP 처리 @@@
DROP TABLE TB_KOLAS_TST_SPEC
;
----------------------------------------------------------------------------------------------------
 
-- 3. 테이블 재생성 @@@
CREATE TABLE TB_KOLAS_TST_SPEC (
	SEQ NUMBER NOT NULL
)
TABLESPACE TBS_GQ_D_00;
 
CREATE UNIQUE INDEX USRGQD.PK_KOLAS_TST_SPEC
ON USRGQD.TB_KOLAS_TST_SPEC
(SEQ)
TABLESPACE TamaDBTBS; 		-- 수정 @@@
 
ALTER TABLE USRGQD.TB_KOLAS_TST_SPEC
ADD CONSTRAINT PK_KOLAS_TST_SPEC PRIMARY KEY(SEQ);
----------------------------------------------------------------------------------------------------
 
-- 4. 테이블 등록 @@@
/TB_KOLAS_TST_SPEC_201912021359.sql 파일 사용
----------------------------------------------------------------------------------------------------
 
-- 5. 테이블 조회 @@@
SELECT A.*
FROM TB_KOLAS_TST_SPEC A
;
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.03(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 회의(14시): 완료보고서 작성 오태범이사가 처리 한다고 진선철 과장에게 말함. 운영 서버 셋팅
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 화면설계서 작성
1. tk(KOLAS 시험) ==> 완료 @@@
01. KOLAS 시험소(/tkKolasTstlab.xfdl): TK11001
02. KOLAS 인정항목(/tkKolasRcgnItem.xfdl): TK11002
03. KOLAS 시험규격(/tkKolasTstSpec.xfdl): TK11003
04. KOLAS 표준(/tkKolasStnd.xfdl): TK11004
05. KOLAS 조직(/tkKolasOrgt.xfdl): TK11005
06. KOLAS 인정현황(/tkKolasRcgnStat.xfdl): TK11006
07. KOLAS 인원현황(tkKolasNmprStat.xfdl): TK11007
08. KOLAS 품질문서(/tkKolasQltyDcmn.xfdl): TK11008
09. KOLAS 인정계획(/tkKolasRcgnPlan.xfdl): TK11009
-----------------------------------------------------------------------------------------------------------------------------
 
- ta (시험분석) ==> 완료 @@@
01. 원료[공정>고로](/taRawMatrShtFurn.xfdl): TK11001
02. 부원료[공정>고로](/taSubRawMatrShtFurn.xfdl): TK11002
03. 부원료(내.외자)[공정>고로](/taSubRawMatrInOutShtFurn.xfdl): TK11003
04. 소결[공정>고로](/taSinterShtFurn.xfdl): TA11105
05. 용강[공정>고로](/taValorShtFurn.xfdl): TA11106 --> 조회 조건: R33007
06. 전기로[공정>전기로](/taElctricOvenElctricOven.xfdl): TA11109 --> 조회 조건 ==> 박판열연: J80138, 특수강: 51. 기본 정보: A105840, 53. 특수강 SLAG: A00002
07. 열연[제품](taEnthuMnfg.xfdl): TA11110 --> 조회 조건 ==> Tab1 시험정보: R33208, Tab2 재질실적: , Tab3 성분실적: R33208
08. 냉연[제품](/taColdHeartedMnfg.xfdl): TA11111 --> 조회 조건 ==> 메인: BAA3084B, Tab1. 기계: BAA3084B, Tab2. 도금: BX52557A, Tab3. 기타: , Tab4. PSA: BAA3084B
09. 후판[제품](/taRearPlateMnfg.xfdl): TA1112--> 조회 조건 ==> Tab1 시험정보: R31359, Tab2 재질실적: , Tab3 성분실적: J78924
10. 특수강[제품](/taSpecialSteelMnfg.xfdl): TA11113 --> 조회 조건 ==> Tab1 시험정보: A154790, Tab2 재질실적: A103650, Tab3 성분실적: A150910
==============================================================================================================
 
- Row Insert 버튼 추가(검토만 할 것)
/***- Grid Top Button Row Insert 버튼 추가[변경일: 2019.12.03(v1.0), by 진태만] --***/
.Button.btn_WF_RowInsert
{
	-nexa-border : 0px none;
	-nexa-icon : url('theme://images/btn_WF_gridCellAdd_P.png');
	-nexa-padding : 0px;
	background : transparent;
	border-radius : 0px;
}
==============================================================================================================
 
- loading 바 수정
1. /environment.xml 파일에서
<Environment themeid="theme::default" onerror="Environment_onerror" httptimeout="600" httpretry="3"
loadingimage="url('theme://images/loading_img2.gif')"> ==> img_loading02.gif ==> loading_img2.gif
==============================================================================================================
 
- 운영서버 셋팅 확인
1. 톰캣 서버 설치되어 있음 ==> apache-tomcat-9.0.8
2. 소스 적용되어 있음
3. 톰캣 서버는 정상적으로 실행됨
1) http://10.10.221.43/ 호출하면 반응이 없음
가. 현상: 10.10.221.43에서 연결을 거부했습니다.
2) http://10.10.221.43:8080 호출하면 정상 연결됨
==> 운영 서버에서 8080 포터에 문제가 있어서 에러가 나는 것으로 추정됩니다. (운영 서버와 개발 서버 소스 똑같이 적용 했습니다.)
==============================================================================================================
 
- /server.xml 파일에서
<Connector port="8080" protocol="HTTP/1.1"
connectionTimeout="20000"
redirectPort="8443" />
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.04(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- KOLAS 인원현황(tkKolasNmprStat.xfdl) 화면 수정
1. 원료[공정>고로](/taRawMatrShtFurn.xfdl) 화면과 유사하게 수정(GROUP BY)
==============================================================================================================
 
- 완료 보고서 샘플 자료 메일 발송
1. 완료 보고서 샘플 자료(모바일 품질검사 Project) 메일로 보냄
2. 오태범 이사(tazan-o@hanmail.net; taebum.oh@gmail.com) 메일로 발송
==============================================================================================================
 
- 개발 서버(web)에 GQMS_Tst 개발 DB(Tibero DB) 설정
1. /u01/webapps/WEB-INF/classes/egovframework/spring/context-datasource.xml
<!-- Tibero DB(GQMS_Tst 개발DB) 설정 추가[변경일: 2019.09.23, by 진태만] -->
<bean id="dataSourceSpied" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
	<property name="driverClassName" value="com.tmax.tibero.jdbc.TbDriver" />
	<property name="url" value="jdbc:tibero:thin:@10.10.180.177:8629:hspngqddb" />
	<property name="username" value="USRGQD"/>
	<property name="password" value="GQDUSR"/>
</bean>
--------------------------------------------------------------------------------------------------------
 
- 운영 서버(web)에 GQMS_Tst 운영 DB(Tibero DB) 설정
1. /u01/webapps/WEB-INF/classes/egovframework/spring/context-datasource.xml
<!-- Tibero DB(GQMS_Tst 운영DB) 설정 추가[변경일: 2019.12.05, by 진태만] -->
<bean id="dataSourceSpied" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
	<property name="driverClassName" value="com.tmax.tibero.jdbc.TbDriver" />
	<property name="url" value="jdbc:tibero:thin:@10.10.221.44:8629:hspngqpdb" />
	<property name="username" value="USRGQP"/>
	<property name="password" value="PQGRSU6!"/>
</bean>
============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.05(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 주간보고서 작성(7시), 개발 서버 소스 반영(8시), 현업 회의(14시), 회식(17시)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- KOLAS 인원현황(tkKolasNmprStat.xfdl) 화면 수정 ==> 완료 @@@
1. 원료[공정>고로](/taRawMatrShtFurn.xfdl) 화면과 유사하게 수정(GROUP BY: 최초 조회시 노 데이타 문제 해결)
1) 데이타 Test
소_김보증, 소_김검증, 소_김분석, 소_김공정, 소_김검사
품_김보증, 품_김검증, 품_김분석, 품_김공정, 품_김검사
1, 2, 3, 4, 5
11, 12, 13, 14, 15
2) TB_KOLAS_NMPR_STAT 테이블 수정: TEAM_T_CD(팀T코드) 칼럼 추가
==============================================================================================================
 
- 완료 보고서 작성
1. 오늘 오태범 이사가 와서 완료 보고서 작성한다고 함: 민종근 대리가 대신 작성한다고 함
==============================================================================================================
 
- Orange_Tibero_Standard(Orange 6.0 for Tibero)
1. 티베로 For Orange CD-Key: 72RLD 5JTQV AGJBV UC6BQ 795JQ
==============================================================================================================
 
- 지아이데이타 현대제철 상주직원(프로젝트인원) 회식
1. 장소: 도드람숯불갈비(당진시 송산면 유곡리 159-7)
2. 인원: 이석부 사장, 오태범 이사 외 20명(황원철 부장, 민종근 대리 불참)
3. 날씨가 추워서 1차(19:30)만 하고 귀가
--------------------------------------------------------------------------------------------------------------------------
 
4. 오이사가 진선철 과장 면담
1) 완료 보고서는 민종근 대리가 작성
2) 이번 프로젝트 12월 말까지 수행하고 철수 ==> 내년 1월 13일(월)부터 당진에서 2~3개월 프로젝트 수행
(내년 GQMS 통합 Prj는 민종근 대리가 PM이 되어서 수행한다고 함)
3) 휴일 근무 내역 오이사에게 메일로 보냄
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.06(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:40 ==> 출근 길 매우 추움, 서울행(19:40 ~ 20:50), 당진T --> 18:05 통근 버스[7번]가 당진T로 출발)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- KOLAS 인원현황(tkKolasNmprStat.xfdl) 화면 분석 및 정리 ==> 완료 @@@
==============================================================================================================
 
- Q-Dir SW 업데이트
1. Q-Dir 7.55 ==> Q-Dir 7.97로 변경
==============================================================================================================
 
- DB 사용권한 일괄신청(이규선 대리가 일괄 신청 함)
HP 번호: 010 3072 0898
email: tamario@hyundai-steel.com
사용 PC의 IP: 10.216.143.133
==============================================================================================================
 
- GQMS_Tst 데이타 분석
1. 총: 2.05GB ==> 일반 첨부파일: 20MB까지 가능, 대용량 첨부: 200MB까 가능(7일 후 자동삭제)
2. GQMS 데이타 ==> 총: 2.71GB
---------------------------------------------------------------------------------------------------------------------------
 
- 데이타 분할 압축 하기(7Zip SW에서)
1. GQMS 폴더: 마우스 우 클릭 --> 7-Zip --> 압축파일에 추가
2. 압축파일에 추가(새창)
1) 압축파일(A): GQMS_Tst.7z 2) 압축파일 형식(F): 7z
3) 압축레벨(F): 가장 느림(정밀하게 압축)4) 볼륨 나누기, 바이트(V): 200M
3. 결과(200M 5개 파일이 생성됨) ==> 테스트
1) GQMS.7z.001, GQMS.7z.002, GQMS.7z.003, GQMS.7z.004, GQMS.7z.005
---------------------------------------------------------------------------------------------------------------------------
 
- 7zip 분할 압축 하는법과 압축풀기
https://extrememanual.net/6778
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.12.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말
08:30 기상 
08:40 조식
09:20 도림천로 도보
10:20 귀가
11:00 서울 가정의학과 의원 방문 ==> 수종 목 감기 진료
11:20 조제(래미안 나나 약국): 수종 감기
12:00 귀가
12:20 중식 
12:50 도림천로 도보
14:00 귀가
14:10 휴식
15:10 집출발(자전거, 수종)
15:30 무지개 실내 놀이터(1시간): 수종
16:30 다이소(구경)
17:00 엘마트(우유)
17:20 석식(떡국, 치즈돈가스): 수종 
18:00 귀가  
18:30 도림천로 도보(수종)
19:40 귀가
21:30 취침 
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2019.12.08(일) 작업 ■■■■■■■■■■■■■■■■■■
-----> 10:00 ~ 17:40 ==> 

- 주말2
08:30 기상 
08:40 조식
09:20 도림천로 도보
10:20 인터넷 서핑 
12:00 중식 
12:20 도림천로 도보
14:20 귀가 ==> 루옌 언니 2명 집에 놀러옴
14:30 다이소(다이소 3D 강화유리 필름(갤럭시 S8) 구입)
14:50 귀가
15:00 다이소 3D 강화유리 필름(갤럭시 S8) 붙이기(화장실에서): 대체로 만족함
15:10 인터넷 서핑
17:30 석식
17:50 도림천로 도보
18:50 귀가
18:50 집출발 ==> 인슐린(1병), 쌀(2통), 손목 패드, 핸드크림, 내복 하의 가지고 감
19:00 대림역(7호선) 도착(지하철[4-4] 탑승)
19:30 고속터미널역 도착  
19:40 강남 터미널(호남선)
19:50 서울 출발
21:20 당진터미널 도착
21:30 31-2번 버스 탑승(10번 송상 방면)
22:00 동곡리 정류장 도착
22:10 귀가
22:30 취침
==============================================================================================================

- 스마트폰 액정필름 쉽게 직접 갈아보자!(다이소 3D 강화유리 필름 후기, 5천원)
https://www.youtube.com/watch?v=TA0OkdvA7vY

- 스마트폰 강화유리 필름 쉽게 붙이는 꿀팁 방출 (feat. 다이소 강화유리필름, 3천원)
https://www.youtube.com/watch?v=xOMUU2Vr558
============================================================================================================== 

■■■■■■■■■■■■■■ 2019.12.09(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 개발 서버 소스 이관(9시), 운영 서버 소스 이관(10-시)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 운영 서버에 소스 이관 ==> 완료 @@@
1. 개발 서버 소스 이관(9시)
2. 운영 서버 소스 이관(10시)
1) 파일첨부 확인
04. KOLAS 표준(/tkKolasStnd.xfdl): TK11004 [/TK11003Mapper.xml] ==> 완료 @@@
06. KOLAS 인정현황(/tkKolasRcgnStat.xfdl): TK11006[/TK12001Mapper.xml] ==> 완료 @@@
08. KOLAS 품질문서(/tkKolasQltyDcmn.xfdl): TK11008 [/TK12003Mapper.xml] ==> 완료 @@@
09. KOLAS 인정계획(/tkKolasRcgnPlan.xfdl): TK11009 [/TK12004Mapper.xml] ==> 완료 @@@
==============================================================================================================

- 열연[제품](taEnthuMnfg.xfdl) 수정
1. 일관 제철 ==> https://pm.hyundai-steel.com/FacadeServlet
1) 품질관리 > 품질판정 > 시험관리 > 재질시험실적상세조회
가. 열연시편번호: K90000101, 열연제품번호 : KK00445808
나. 후판시편번호: K90000101, 후판제품번호 : FC04285902
2) (특)품질관리 > 특수강 품질판정 > 시험관리 > 재질시험실적상세조회
가. 특수강시편번호: R90003402
==============================================================================================================

- 재질시험실적상세조회(/StqltyTstWrModjm_iframe.jsp) 분석
<td class="ht_m">
상세내용
 
<!-- 인장시험 -->
StqltytstWrRecord = ReinRecord.getRecordSet("StqltytstWr"); // 재질시험실적
StqltytstDetInfoRecord = ReinRecord.getRecordSet("StqltytstDetInfo"); // 상세내용
 
for (int ii = 0; ii < StqltytstWrRecord.size(); ii++) {
	JDTORecord inRecord = StqltytstWrRecord.getRecord(ii);
}
==============================================================================================================
 
- 더릭스 기절 마약 매트리스 구입(2번째)
1. 기절 마약매트리스 접이식 토퍼 침대 매트 바닥 3단 수면매트(75cm) | 2..색상선택 / 차콜], 가격: 33,830원
http://www.enuri.com/detail.jsp?modelno=37355254&cate=120216&IsDeliverySum=N
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=2394724102&xzone=order^list&xfrom=order^list
==============================================================================================================

- 10월, 11월 지출결의서 확인
1. 지출금액 총: 835,270원(현금: 595,270, 카드: 240,000원)
2. 식권 확인해보니 2019.11.29(금)에 현대제철 식당 식권 구입(20장 106,000원 했으니 2장은 11월달 것으로 하고 12월말에 결제 올릴께요.
==============================================================================================================

■■■■■■■■■■■■■■ 2019.12.10(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 현업 회의(14시, 박지훈 과장 참석), 지출결의서 검증(김유진 대리한테 데이타 이상하다고 전화 옴)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
==============================================================================================================
 
- 조회 조건 ===> @@@
1. 그 외 Tab 조회 @@@
<option value="1">제품번호</option>
<option value="2" selected>시편번호</option>
-----------------------------------------------------------------------------------------------
 
2. 성분실적 Tab(3번 Tab) 조회 @@@
<option value="1">제품번호</option>
<option value="2">Heat 번호</option>
==============================================================================================================
 
- 운영 서버에 소스 이관 ==> 완료 @@@
1. 개발 서버 소스 이관(10시), 운영 서버 소스 이관(10시)
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.11(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 석식(18:30, 이상탁 차장과 합석: 본인이 AE 프로젝트 인수인계 받는다고 함[AE팀 12월 철수 예정])
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
==============================================================================================================
 
- 현대제철 자산분류
1. PC본체: 자산번호: SP114060256[PC본체 번호](JLLC98CF7A0045F[PC본체 제조번호])
==============================================================================================================
 
- 데이타 분할 압축 하기(7Zip SW에서)
1. eclipse 폴더: 마우스 우 클릭 --> 7-Zip --> 압축파일에 추가[0.98GB]
2. 압축파일에 추가(새창)
1) 압축파일(A): GQMS_Tst.7z 2) 압축파일 형식(F): 7z
3) 압축레벨(F): 가장 느림(정밀하게 압축)4) 볼륨 나누기, 바이트(V): 100M5) 암호 입력: asas1212@
3. 결과(200M 6개 파일이 생성됨) ==> 테스트
1) eclipse.7z.001, eclipse.7z.002, eclipse.7z.003, eclipse.7z.004, eclipse.7z.005, eclipse.7z.006
---------------------------------------------------------------------------------------------------------------------------
 
1. workspace 폴더: 마우스 우 클릭 --> 7-Zip --> 압축파일에 추가[455MB]
2. 압축파일에 추가(새창)
1) 압축파일(A): GQMS_Tst.7z 2) 압축파일 형식(F): 7z
3) 압축레벨(F): 가장 느림(정밀하게 압축)4) 볼륨 나누기, 바이트(V): 100M5) 암호 입력: asas1212@
3. 결과(200M 6개 파일이 생성됨) ==> 테스트
1) workspace.7z.001, workspace.7z.002, workspace.7z.003, workspace.7z.004, workspace.7z.005, workspace.7z.006
---------------------------------------------------------------------------------------------------------------------------
 
- 전체 경로(C:\GQMS_Tst\)
> eclipse: 0.98GB
> java
> jdk1.8.0_211
> jre1.8.0_211
> WAS
> apache-tomcat-8.0.32
> workspace: 455MB
01. GQMS_Tst[바로가기]
02. GQMS_Tst.xprj[바로가기]
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.12(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 주간보고(14시), 프로그램 시연(14:10, 운영 서버)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 열연, 후판[제품](/taSpecialSteelMnfg.xfdl) 화면 재질실적 Tab 수정
1. 열연, 후판[제품](/taSpecialSteelMnfg.xfdl) 화면 통합
function fn_Search()
{
var sNexaMenuId = "BZ10102"; // 메뉴ID(메뉴별 수정 사항)
var sNexaUrl = "ta::taEnthuMnfg.xfdl"; // 넥사 URL(메뉴별 수정 사항) ==> 필수 수정 사항[열연[제품]과 파일 통합
==> 수정[변경일: 2019.12.12(v1.0), by 진태만] @@@
 
var urlPathFull = urlPath +"screenid="+ screenId +"&gv_NexaUrl="+ sNexaUrl +"&gv_NexaMenuId="+ sNexaMenuId;
urlPathFull += "&gv_global1="+ sGlobal1; // gv_global1 셋팅(로그인ID)
// trace("[/taRearPlateMnfg.xfdl] [fn_Search()] ==> [TEST_41] [turlPathFull]"+ urlPathFull );
 
this.WebBrowser.url = urlPathFull;// Browser로 연결
}
==============================================================================================================
 
- 운영 서버에 소스 이관 ==> 완료 @@@
1. 개발 서버 소스 이관(9시)
2. 운영 서버 소스 이관(9시)
==============================================================================================================
 
- GQMS 운영 서버에 소스 이관
1. 이규선 대리가 운영 서버에 잘못 올려서 오후 1시에 도보하고 있는데 전화 옴
1) /biz_intra.xadl 파일에서
function application_onload(obj:Object, e:LoadEventInfo)
{
trace("[/biz_intra.xadl] [Application_onload()] ==> [TEST_01] [GQMS 시스템 구축 Prj] #########] ");
 
// gv_NexaDomain = "http://10.216.143.133:9001"; // Nexacro 도메인 추가(10.216.143.133: 진태만 PC
// gv_NexaDomain = "http://10.10.180.176"; // Nexacro 도메인 global 변수에 추가
gv_NexaDomain = "http://10.10.221.43"; // Nexacro 도메인 global 변수에 추가: 운영 서버
trace("[/biz_intra.xadl] [Application_onload()] ==> [TEST_02] [gv_NexaDomain]"+ gv_NexaDomain);
}
 
2) /default_typedef.xml파일에서
<Service prefixid="tt" type="form" cachelevel="session" url="./tt/" version="0" communicationversion="0"/>
<Service prefixid="tm" type="form" cachelevel="session" url="./tm/" version="0" communicationversion="0"/>
<Service prefixid="tk" type="form" cachelevel="session" url="./tk/" version="0" communicationversion="0"/>
 
3) /dglobalvars.xml
<Variable id="gv_NexaDomain"/><!--// Nexacro 도메인 추가[전사시험관리 메뉴 구축용, 변경일: 2019.10.10(v1.0), by 진태만] //-->
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.13(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 16:00 ==> 서울행(17:00 ~ 19:00), 당진T --> 16:08 버스(31번)가 당진T로 출발)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 조회, 입력, 수정, 삭제 가능한 화면에 차수(이력관리) 관련 작업 ==> 차수 관리
1. 04. KOLAS 표준(/tkKolasStnd.xfdl): TK11004
2. KOLAS 인원현황(tkKolasNmprStat.xfdl) 수정: GROUP BY(가로 정렬)이라 dataRowType 문제 발생
2. 참조: /* 시험분석교육현황(사외교육) 입력 ==> [/TM12009Mapper.xml] [insertTM12009()] */
1) TB_GQ_TST_ANL_EDU_STAT_OUT TB
-----------------------------------------------------------------------------------------------------------------------------
 
-- 차수 분석 @@@ 
1. 등록일 때--> SEQ, RVS_NO[버전순번], FNL_RULE[최종기준], DEL_YN[삭제여부]PRO_NM[과정명]
==> 1, 1, Y, N, 과정명_1
-----------------------------------------------------------------------------------------------------------------------------
 
2. 수정일 때--> SEQ, RVS_NO[버전순번], FNL_RULE[최종기준], DEL_YN[삭제여부]PRO_NM[과정명]
==> 1, 1, N, N, 과정명_1
==> 1, 2, Y, N, 과정명_수정
-----------------------------------------------------------------------------------------------------------------------------
 
3. 삭제일 때--> SEQ, RVS_NO[버전순번], FNL_RULE[최종기준], DEL_YN[삭제여부]PRO_NM[과정명]
==> 1, 1, N, N, 과정명_1
==> 1, 2, Y, Y, 과정명_수정 
==============================================================================================================
 
- 운영 서버에 소스 이관(15:20) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관(9시)
==============================================================================================================
 
- 송년회(20시, (주)지아이데이타)
16:00 퇴근
16:08 버스(31번)가 당진T로 출발: 늦게 출발해서 버스 놓칠 뻔 함
16:42 당진T 도착
17:00 당진T 출발
19:00 강남터미널 도착
19:20 340번 버스 탑승
20:00 선릉역에서 하차
20:10 보노보노 선릉점(지하1층) 도착
20:20 식사 ==> 지아데이타 직원(28명: 여직원 4명): 배인철 차장 참석, 황원철 부장 불참
		==> 김유이 사원(30살, 포항) 같은 고향이라 이야기 많이 함, 건유씨, 근욱씨와 이야가 함
21:40 종료
22:10 맥주집
23:50 종료
24:10 6411번 버스 탑승
01:10 귀가
01:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.12.14(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말
08:30 기상 
08:40 조식
09:00 루옌, 수종 놀러감
09:20 도림천로 도보
10:20 귀가
11:00 인터네 서핑 
12:20 중식 
12:50 도림천로 도보
14:00 귀가
14:10 낮잠
18:00 루옌, 수종 귀가
18:20 도림천로 도보(수종)
19:40 귀가
21:30 취침 
============================================================================================================== 

■■■■■■■■■■■■■■ 2019.12.15(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:10 ~ 21:00 ==> 당진행(07:35, 강남T), 전체 팀원 출근, 중식(13:20, 피자: 오토 에버 진과장이 쏨)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 조회, 입력, 수정, 삭제 가능한 화면에 차수(이력관리) 관련 작업 ==> 차수 관리 ==> 완료 @@@
1. KOLAS 인원현황(tkKolasNmprStat.xfdl) 수정: GROUP BY(가로 정렬)이라 dataRowType 문제 발생
==============================================================================================================
 
- 운영 서버에 소스 이관(12:10) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관(9시)
==============================================================================================================
 
- 전사 로그 개발
/**
* 설명 : 조회버튼 클릭시 이력 저장 ==> // 추가[변경일: 2019.12.15(v1.0), by 진태만]
*/
pForm.gfn_saveLog = function()
{
	trace("[/Transaction.js] [gfn_saveLog()] ==> [TEST_01] [조회버튼 클릭시 이력 저장]");
	 
	var sNexaUiId = "";
	if(nexacro.getApplication().gv_NexaUrl =="") { sNexaUiId = "MainHS"} else { sNexaUiId = nexacro.getApplication().gv_NexaUrl}; // 넥사 URL
	 
	var sArgs= "arg_UI_ID = "+ sNexaUiId/* 화면ID */
	 
	+" arg_MENU = "+ sNexaUiId;
	trace("[/Transaction.js] [gfn_saveLog()] ==> [TEST_41] [sArgs]"+ sArgs );
	 
	var sSvcID = "save";
	var sController = "COM/USELOG/saveList";
	var sInDatasets = "";
	var sOutDatasets = "";
	var sArgument = sArgs;// 파라미터로 보내기
	var sCallbackFunc = "";
	var bAsync = true;
	 
	this.gfn_Transaction( sSvcID, sController, sInDatasets, sOutDatasets, sArgument, sCallbackFunc, bAsync );
}
==============================================================================================================
 
- KOLAS 인원현황(tkKolasNmprStat.xfdl) 수정
1. 팀등록(/tkKolasNmprStatP.xfdl) 화면에서 등록시 에러 발생
1) 현상:
nexacro (155536)> UD 19:58:18:492 [/Validation.js] [gfn_SaveConfirm()] ==> [TEST_21] [저장전 확인창] [objDs.getRowCount()]1
nexacro (155536)> file://C:/GQMS_Tst/workspace/GQMS_Tst/src/main/webapp/GQMS_Tst/nexacro17lib/component/CompBase/FrameBase.js(1003):
Uncaught NativeError: 해당 ID를 갖는 Object 가 존재합니다. id = [saveChk]
2) 원인: 저장시 alert을 2번 뛰움
==============================================================================================================  

- 회의
1. 조회버튼 클릭시 이력 저장을 GQMS에서 하기로 했는데 GQMS_Tst에서 Table 생성해서 햐라고 해서 짜증남
2. 파일 등록 테이블 GQMS 이관 고려해서 다시 개발하라고 함: 시간 많이 걸릴 것 같아서 오태범 이사에게 보고 함
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.16(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 전사 종합 시험관리 시스템 오픈(8시), 숙소 도시가스 점검 에비뉴 관리 소장에게 부탁(15:30)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 전사 로그 개발 ==> 완료 @@@
/* 화면사용이력 정보 조회 ==> [/TK12003Mapper.xml] [selectList()] [2019.12.13, by 진태만] */
SELECT A.*
FROM TB_GQ_CM_UIUSELOG A
;
==============================================================================================================
 
- 운영 서버에 소스 이관(07:10) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- 운영 서버에 소스 이관(09:00) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- DBSAFER AGENT 로그인
1. 1521673/ 71스*트!
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.17(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 출근 시 비 조금 옴, 현대제철 식당 식권 구입(33장 174,900원(장 당: 5,300원), 계좌 이체[농협])
									, 현업 회의(14시), 퇴근할 때 오른쪽 약지, 새끼 발가락 껍질 벗겨짐(운동화 꽉 조임, 당뇨 병원 치료 검토)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 열연, 후판[제품](/taSpecialSteelMnfg.xfdl) 화면 재질실적 Tab 수정==> 완료 @@@
1. 추가 시험(11개 Grid 생성)
==============================================================================================================
 
- 운영계 KOLAS 수정 사항 처리
1. 운영계 KOLAS 수정 (1216).pptx
==============================================================================================================
 
- 운영 서버에 소스 이관(08:40) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- KOLAS 구분 공통코드에 AP, 울산공장, 순천단조 필요없고 연구개발본부가 추가 ==> 완료 @@@
1.
<Col id="MID">KOLAS</Col> <!--// 중분류(그룹코드) 추가 //-->
INSERT INTO TB_GQ_CM_CDITEM (CD_ID,CD_ITEM,CD_CNTS_K,CD_CNTS_E,CD_CNTS_C,GRP_CD,CD_DTL_CONTENTS,
SORT_SEQ,USE_YN,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) VALUES (
'TK001','31','지침 (G)',NULL,NULL,'KOLAS',NULL,1,'Y','1521666','2019-11-26',NULL,NULL);
 
INSERT INTO TB_GQ_CM_CDITEM (CD_ID,CD_ITEM,CD_CNTS_K,CD_CNTS_E,CD_CNTS_C,GRP_CD,CD_DTL_CONTENTS,
SORT_SEQ,USE_YN,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) VALUES (
'TK001','32','요령 (G)',NULL,NULL,'KOLAS',NULL,1,'Y','1521666','2019-11-26',NULL,NULL);
 
INSERT INTO TB_GQ_CM_CDITEM (CD_ID,CD_ITEM,CD_CNTS_K,CD_CNTS_E,CD_CNTS_C,GRP_CD,CD_DTL_CONTENTS,
SORT_SEQ,USE_YN,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) VALUES (
'TK001','33','기술요건 (SR)',NULL,NULL,'KOLAS',NULL,1,'Y','1521666','2019-11-26',NULL,NULL);
 
INSERT INTO TB_GQ_CM_CDITEM (CD_ID,CD_ITEM,CD_CNTS_K,CD_CNTS_E,CD_CNTS_C,GRP_CD,CD_DTL_CONTENTS,
SORT_SEQ,USE_YN,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) VALUES (
'TK001','34','기타',NULL,NULL,'KOLAS',NULL,1,'Y','1521666','2019-11-26',NULL,NULL);
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.18(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
01. 원료, 부원료[공정>고로](/taRawMatrShtFurn.xfdl) 수정 ==> 완료 @@@
1. 공급사 팝업 수정
==============================================================================================================
 
03. 부원료(내.외자)[공정>고로](/taSubRawMatrInOutShtFurn.xfdl) 수정
1. 품명 조회 수정
AND C.EAI_ITEM_NM LIKE '%'||#{ITEMNAME_LOC}||'%' /* 품명(조회조건_2) */
==============================================================================================================
 
- 운영 서버에 소스 이관(08:40) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
04. 소결[공정>고로](/taSinterShtFurn.xfdl) 수정
1. 공장 조회 조건 ==> GA: 1소결, GB: 2소결, GC: 3소결, 전체 --> 7건 조회됨, L3에서 10건 조회됨
/* 소결[공정>고로 정보 조회 ==> [/TA11105Mapper.xml] [selectList()] [2019.11.21, by 진태만] */
SELECT TO_CHAR(TO_DATE(A.IRCK_PTOP_WR_DT), 'YYYY.MM.DD.HH24') AS IRCK_PTOP_WR_DT /* 구분(실적일시) */
				, A.*
FROM TB_GQ_BF_SNTROREQTTSTANLINFO A /* GQ_전사종합시험관리_소결광시험분석 정보 TB */
WHERE 1 = 1
	AND A.PLNT_PROC_GP LIKE '%' || 'GA' || '%' /* 제선공장공정구분(조회조건_1) ==> GA: 1소결, GB: 2소결, GC: 3소결, 전체*/
	AND A.IRCK_PTOP_WR_DT BETWEEN TO_DATE(NVL('20191217', '20000101') || '06' || '0000', 'YYYYMMDDHH24MISS')
	AND TO_DATE(NVL('20191218', '29991231') || '06' || '5959', 'YYYYMMDDHH24MISS') /* 조회년월 일시(조회조건_3) */
ORDER BY A.REG_DDTT
;
==============================================================================================================
 
05. 용강[공정>고로](/taValorShtFurn.xfdl) 수정
1. HEAT번호 : P73134 / 출강목표 : C18150J3FR, 조회되면 안되는 전기로 HEAT번호 : J71016
==============================================================================================================
 
06. 전기로[공정>전기로](/taElctricOvenElctricOven.xfdl) 수정
1. 박판열연 HEAT번호 : J71016 / 출강목표 : A04020WWXX003 / 주문번호 : D180505668-005
2. 특수강 HEAT번호 : A119210 / 출강목표 : C42145LYKR001 / 주문번호 : J190100019 001
==============================================================================================================

■■■■■■■■■■■■■■ 2019.12.19(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 주간보고(14시), 현대제철 부속의원 방문(9시, 발가락 2개 치료): 발가락이 부었고 심각하다고 함[그냥 두면 당뇨성 족부병증
									==> 명성의원(09:30, 박순창씨 차타고 감, 항생제 주사, 1일치 약 처방)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
05. 용강[공정>고로](/taValorShtFurn.xfdl) 수정
1. HEAT번호 : P73134 / 출강목표 : C18150J3FR, 조회되면 안되는 전기로 HEAT번호 : J71016
==============================================================================================================
 
06. 전기로[공정>전기로](/taElctricOvenElctricOven.xfdl) 수정
1. 박판열연 HEAT번호 : J71016 / 출강목표 : A04020WWXX003 / 주문번호 : D180505668-005
2. 특수강 HEAT번호 : A119210 / 출강목표 : C42145LYKR001 / 주문번호 : J190100019 001
==> 조회조건 문제로 강흔 대리에게 메일 보냄
==============================================================================================================
 
- 운영 서버에 소스 이관(10:13) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
03. 부원료(내.외자)[공정>고로](/taSubRawMatrInOutShtFurn.xfdl) 수정
1. 광종 코드 수정: 부원료 광종(석회석, 니켈슬라그)
==============================================================================================================
 
07. 열연[제품](taEnthuMnfg.xfdl) 수정
1. 제품번호(Coil번호): COIL_NO, 시편번호: REAGENT_NO
==============================================================================================================
 
10. 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
1. 제품번호(BUNDLE번호): BNDL_NO, 시편번호: REAGENT_NO
==============================================================================================================
 
-- 파일 업로드 테이블 칼럼 사이즈 늘이기 ==> 완료 @@@
-- 파일 업로드 테이블 칼럼 수정 @@@
ALTER TABLE TB_GQ_CM_COMFILE MODIFY
(
	FSIZE VARCHAR(200) -- 파일크기
	, FNM VARCHAR(200)-- 파일명
	, RFNM VARCHAR(200)-- 실제파일명
);
----------------------------------------------------------------------------------------------------------------
 
- 파일첨부하는 공통 메소드 alert 처리(보류)
1. alert("첨부파일명은 50자를 넘을 수 없습니다");
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.20(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:40 ==> 출근할 때 약간 쌓임, 현대제철 부속의원 방문(08:30, 발가락 2개 치료2)
									, 서울행(19:40 ~ 20:50), 당진T --> 18:05 통근 버스[7번]가 당진T로 출발)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
07. 열연[제품](taEnthuMnfg.xfdl) 수정
1. 제품번호(Coil번호): COIL_NO, 시편번호: REAGENT_NO
==============================================================================================================
 
09. 후판[제품](/taRearPlateMnfg.xfdl) 수정
1. 제품번호(Plate번호): PLATE_NO, 시편번호: REAGENT_NO
==============================================================================================================
 
10. 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
1. 제품번호(BUNDLE번호): BNDL_NO, 시편번호: REAGENT_NO
==============================================================================================================
 
08. 냉연[제품](/taColdHeartedMnfg.xfdl) 수정
1. 데이타 검증 ==> 민대리에게 검증 메일 보냄
순천공장 시편 : AL74772(T) / 코일 : AL74772A
1공장 시편 : BAC6149(B) / 코일 : BAC6149A
==============================================================================================================
 
04. KOLAS 표준(/tkKolasStnd.xfdl) 수정 ==> 완료 @@@
1. KOLAS 표준 콤보 수정
1 시험규격일 경우 기준 시험 규격으로 분류 1 시험규격의 구분항목 (인장시험, 충격시험…)
분류 2에 당진제철소, 인천공장, 포항공장, 연구개발본부
분류 3 추가하여 시험규격의 KS, ISO등 규격
2) KOLAS 경우: 분류 1 지침(G), 요령 (R), 기술요건 (SR), 기타 4종류, 분류 2 따로 구분
없이 전체 나오게 (KOLAS 경우 전체 동일 사용), 분류 3은 KOLAS 한 개만
==============================================================================================================
 
- 운영 서버에 소스 이관(09:54) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.12.21(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말
08:00 기상 
08:20 조식
09:00 도림천로 도보
10:20 귀가
10:30 집출발(자전거)
10:40 하나정형외과의원 방문(처음)  ==> 진료(발가락 다침, 구로동), 주사[15,500원]
11:00 갤S8 핸드폰 케이스(구로동 노점상)[8천원]
11:20 붕어빵(10개, 구로동 노점상)
11:30 귀가
12:20 중식 
12:50 도림천로 도보
14:00 귀가
14:30 낮잠 ==> 수종이와 성탄절 선물사러 승진문구로 가려고 했는데 비와서 못 감(수종이가 말을 안해서 기분 나빴음)
15:00 루옌, 수종 다이소 갔다옴
18:00 기상
18:10 부엌에 있는 밥솥 플러그 고장남(김치 냉장고 안 움직여 플러그 교체 못함: 밥솥 전자레인지 옆으로 옮김)
18:20 석식 
18:50 도림천로 도보(수종)
19:40 귀가
22:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.22(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:10 ~ 21:00 ==> 당진행(07:35, 강남T), 강전관 과장, 박순창씨 출근, 중식(12:15, 동지 팥죽[현대제철 구내식당])
									, 현대제철 부속의원 방문(13:40, 발가락 2개 치료3)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
1. 특수강[제품] 재질실적[Tab2] 조회 수정 ==> GAS시험, JOMINY시험 추가
==============================================================================================================
 
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
1. 특수강[제품] 재질실적[Tab2] 조회 수정 ==> GAS시험, JOMINY시험 추가
2. 특수강[제품] 기본정보[Tab1] 조회
1) GQMS 품질분석 조업data분석에 통합정보조회 보시면 열연, 후판, 특수강 기본정도
==> 통합 정보 조회(특수강) - Heat 정보(/iqItgInfoInqSsHeatInfo.xfdl) 화면 ActiveX로 링크 되어 있음
var SSO = "http://hs.hyundai-steel.com/ev/dangjin/connection_link.jsp"; // Test
==============================================================================================================
 
- 운영 서버에 소스 이관(11:20) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- 운영 서버에 소스 이관(15:20) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.23(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 현대제철 부속의원 방문(08:30, 발가락 2개 치료4)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 파일 첨부(기존 메소드 확인 및 신규 테이블 이관 작업 포함) 분석
==============================================================================================================
 
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정 ==> 완료 @@@
1. 특수강[제품] 재질실적[Tab2] 조회 수정 ==> GAS시험, JOMINY시험 추가
==============================================================================================================
 
- GQMS 테마 파일 에러
1. Z:\99.의사소통\진태만\91. Back up\01. Back up\GQMS\GQMS_11.01\ 폴더 복사해서 GQMS Prj 재설치
==> C:\Program Files (x86)\TOBESOFT\XPLATFORM\9.1\Theme\
2. DBSAFER AGENT 로그인(1521666/71스*트!)을 해야만 GQMS 로그인 가능(eclipse에서 DB 에러가 남)
==============================================================================================================
 
- 열연, 후판[제품](taEnthuMnfg.xfdl) 수정
1. 열연, 후판 기본 정보 Grid 분리
2. 재질실적 Grid 조회 안되는 것 안 보이게 처리 ==> 완료 @@@@
1) 시편번호: P61756111[3건], P61763107[2건], P61737613[3건], P61750116[2건], K624092026[5건], P61749628[1건], K62401111[2건]
, R33208[0건]
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.24(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 현대제철 부속의원 방문(08:30, 발가락 2개 치료5, 체혈: 74)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 특수강[제품](/taSpecialSteelMnfg.xfdl) 수정
1. 재질실적 Grid 조회 안되는 것 안 보이게 처리 ==> 완료 @@@@
1) 시편번호: W90209304
==============================================================================================================
 
- 회의(09:30): 이규선 대리, 민대리, 강과장, 박순창씨
1. 파일 첨부 ==> 강전과 과장이 개발하기로 함
2. 전사 로그 개발
1) 12월 27일(금)까지 개발
==============================================================================================================
 
- 운영 서버에 소스 이관(09:20) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- KOLAS 표준(/tkKolasStnd.xfdl) 수정 ==> 완료 @@@
1. 코라스 구분코드 추가
-- 칼럼 추가 @@@
ALTER TABLE TB_KOLAS_TST_SPEC ADD (
	KOLAS_GUBUN_CD VARCHAR(9) NULL 	-- 코라스 구분코드
)
;
==============================================================================================================
 
- 박수빈 매니저 (당)품질보증팀 통화
1. 041-680-1943
==============================================================================================================
 
- 열연, 후판[제품](taEnthuMnfg.xfdl) 수정
1. 열연, 후판 기본 정보 Grid 화면 수정(Tab2 재질실적 조회 ==> 열연 제품번호: CLT54430, 후판 제품번호: FC17026405)
기본 정보 ==> <Cell edittype="normal" text="제품번호"
2. NO_COLUMN 정리에서 민종근 대리에게 보냄
==============================================================================================================
 
/* 열연, 후판[제품] 재질실적[Tab2] 조회 ==> [/TA11110Mapper.xml] [selectList2()] [2019.10.28, by 진태만] */
SELECT A.*
		, B.*
FROM TB_GQ_QM_STQLTYWR_HRPL A /* 열연/후판 재질시험실적 TB */
		,TB_GQ_QM_STQLTYWR_HRPL2 B/* 열연/후판 재질시험실적2 TB */
,(
	SELECT
			A.REAGENT_NO AS REAGENT_NO -- 시편번호
			,B.REAGENT_PICK_LOC AS REAGENT_PICK_LOC-- 시편채취위치'
	FROM TB_GQ_QM_STQLTYWR_HRPL A /* 열연/후판 재질시험실적 TB */
			,TB_GQ_QM_STQLTYWR_HRPL2 B /* 열연/후판 재질시험실적2 TB */
	WHERE A.REAGENT_NO = B.REAGENT_NO /* 시편번호 */
		AND B.REAGENT_PICK_LOC = B.REAGENT_PICK_LOC /* 시편채취위치 */
		AND A.REAGENT_NO = B.REAGENT_NO /* 사업장코드 */
		AND A.REAGENT_NO = (SELECT REAGENT_NO
	FROM TB_GQ_QM_GDSINFO_HR /* 열연제품정보 TB */
	WHERE 1 = 1
		AND ROWNUM = 1
		AND COIL_NO = 'CLT54430' /* Tab2_1. 열연 제품번호(Coil번호) (조회조건_1) */
	)
) Z
WHERE 1=1
	AND A.REAGENT_NO = B.REAGENT_NO /* 시편번호 */
	AND A.REAGENT_PICK_LOC = B.REAGENT_PICK_LOC /* 시편채취위치 */
	AND A.REAGENT_NO = B.REAGENT_NO /* 사업장코드 */
	AND Z.REAGENT_NO = A.REAGENT_NO
	AND Z.REAGENT_PICK_LOC = A.REAGENT_PICK_LOC
ORDER BY A.REAGENT_PICK_LOC
;
---------------------------------------------------------------------------------------------------------
 
SELECT REAGENT_NO
FROM TB_GQ_QM_GDSINFO_HR /* 열연제품정보 TB */
WHERE 1 = 1
	AND COIL_NO = 'CLT54430' /* Tab2_1. 열연 제품번호(Coil번호) (조회조건_1) */
	-- AND REAGENT_NO = 'K92579701' /* Tab2_1. 열연 제품번호(Coil번호) (조회조건_1) */
;
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.25(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:20 ==> 성탄절(출근, 강과장, 박순창씨 출근), 현대제철 부속의원 방문(08:30, 발가락 2개 치료6)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- KOLAS 표준(/tkKolasStnd.xfdl) 수정 ==> 완료 @@@
1. Grid에서 콤보를 변경하면 Ds(2개)의 내용이 변경되게 처리
/***********************************************************************
* 함수명 : ds_List_oncolumnchanged
* 설명 : 데이터셋의 열(column) 값이 변경된 후에 발생하는 이벤트
***********************************************************************/
this.ds_List_oncolumnchanged = function(obj:Dataset, e:nexacro.DSColChangeEventInfo)
{
	trace("[/tkKolasStnd.xfdl] [ds_List_oncolumnchanged()] ==> [TEST_01] [e.columnid]"+ e.columnid +"[e.row]"+ e.row
	+"[e.oldvalue]"+ e.oldvalue +"[e.newvalue]"+ e.newvalue );
	 
	if(e.columnid == "KOLAS_GUBUN_CD" && e.newvalue == "T" )// 시험규격 이면
	{
		this.ds_TK001_New.filter("");
		this.ds_TK001_New.filter("GRP_CD == 'T'");// 시험규격으로 필터링
	}
	else if(e.columnid == "KOLAS_GUBUN_CD" && e.newvalue== "K")// 시험규격 이면
	{
		this.ds_TK001_New.filter("");
		this.ds_TK001_New.filter("GRP_CD == 'K'"); // KOLAS로 필터링
	}
	//trace("[/tkKolasStnd.xfdl] [grd_List_onexpandup()] ==> [TEST_71] [ds_TK001_New.CNT]"+ this.ds_TK001_New.getRowCount()
	+"[ds_TK001_New.saveXML()] \n"+ this.ds_TK001_New.saveXML() );
};
 
/***************************************************************************
* Even : grd_List_oncellclick
* Desc : Grid 클릭 이벤트
****************************************************************************/
this.grd_List_oncellclick = function(obj:nexacro.Grid,e:nexacro.GridClickEventInfo)
{
	trace("[/tkKolasStnd.xfdl] [grd_List_oncellclick()] ==> [TEST_01] [Head.text]"+ obj.getCellProperty("Head", e.cell, "text") );
	 
	if(obj.getCellProperty("Head", e.cell, "text") == "구분" || obj.getCellProperty("Head", e.cell, "text") == "항목") // 구분, 항목 버튼 클릭 시
	{
		// trace("[/tkKolasStnd.xfdl] [grd_List_oncellclick()] ==> [TEST_01] [ds_List.KOLAS_GUBUN_CD]"+ this.ds_List.getColumn(e.row, "KOLAS_GUBUN_CD") );
		
		if(this.ds_List.getColumn(e.row, "KOLAS_GUBUN_CD") == "T") // 시험규격 이면
		{
			this.ds_TK001_New.filter("");
			this.ds_TK001_New.filter("GRP_CD == 'T'");// 시험규격으로 필터링
		}
		else if(this.ds_List.getColumn(e.row, "KOLAS_GUBUN_CD") == "K" )// 시험규격 이면
		{
			this.ds_TK001_New.filter("");
			this.ds_TK001_New.filter("GRP_CD == 'K'"); // KOLAS로 필터링
		}
	}
};
-----------------------------------------------------------------------------------------------------------------------
 
<Dataset id="ds_TK001_New" reversesubsum="true">
	<ColumnInfo>
	<Column id="GRP_CD" type="STRING" size="256" description="그룹코드"/>
	<Column id="CD_NM" type="STRING" size="32" description="코드명"/>
	<Column id="CD" type="STRING" size="32" description="코드"/>
	<Column id="CD_ID_NM" type="STRING" size="32"/>
	<Column id="CD_ID" type="STRING" size="32"/>
	</ColumnInfo>
	<Rows>
	<Row>
	<Col id="GRP_CD">T</Col>
	<Col id="CD_NM">인장시험기</Col>
	<Col id="CD">1</Col>
	<Col id="CD_ID_NM">시험규격</Col>
	<Col id="CD_ID">TK001</Col>
	</Row>
	<Row>
	<Col id="GRP_CD">T</Col>
	<Col id="CD_NM">충격시험기</Col>
	<Col id="CD">2</Col>
	<Col id="CD_ID_NM">시험규격</Col>
	<Col id="CD_ID">TK001</Col>
	</Row>
	<Row>
	<Col id="GRP_CD">K</Col>
	<Col id="CD">51</Col>
	<Col id="CD_NM">지침 (R)</Col>
	<Col id="CD_ID">TK051</Col>
	<Col id="CD_ID_NM">KOLAS</Col>
	</Row>
	<Row>
	<Col id="GRP_CD">K</Col>
	<Col id="CD">52</Col>
	<Col id="CD_NM">요령 (R)</Col>
	<Col id="CD_ID">TK051</Col>
	<Col id="CD_ID_NM">KOLAS</Col>
	</Row>
	</Rows>
</Dataset>
==============================================================================================================
 
-- 테이블 칼럼 코멘트 조회 @@@@
SELECT A.COLUMN_ID AS 칼럼순서, A.COLUMN_NAME AS "칼럼명(논리)", B.COMMENTS AS "칼럼명(물리)"
		, A.DATA_TYPE ||
		(CASE WHEN DATA_TYPE LIKE '%CHAR%'THEN '(' || DATA_LENGTH || ')'
		WHEN DATA_TYPE = 'NUMBER' AND DATA_PRECISION > 0 AND DATA_SCALE > 0 THEN
		'(' || DATA_PRECISION || ',' || DATA_SCALE || ')'
		WHEN DATA_TYPE = 'NUMBER' AND DATA_PRECISION > 0 THEN '(' || DATA_PRECISION || ')'
		END) AS "데이타 타입" -- DATA_TYPE
		, DECODE(NULLABLE, 'N', 'N') AS "필수 여부" -- NULLABLE
FROM ALL_TAB_COLUMNS A, ALL_COL_COMMENTS B
WHERE A.TABLE_NAME = 'TB_GQ_QM_GDSINFO_HR' /* TB명 */
	AND A.OWNER = B.OWNER
	AND A.TABLE_NAME = B.TABLE_NAME
	AND A.COLUMN_NAME = B.COLUMN_NAME
	-- AND A.COLUMN_NAME = 'COIL_NO' /* 칼럼명(논리) */
	-- AND A.NULLABLE = 'N' /* 필수 여부 */
ORDER BY A.COLUMN_ID
;
----------------------------------------------------------------------------------------------------------------------
 
-- 테이블 DDL 조회 @@@@
SELECT DBMS_METADATA.GET_DDL('TABLE', 'TB_GQ_QM_GDSINFO_HR', 'USRGQD') DDL_QUERY
FROM DUAL
;
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.26(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 주간보고서 작성(8시, 마지막 작성), 현대제철 부속의원 방문(08:30, 발가락 2개 치료7, 의사 진료[새끼 발가락
									검게 변색: 지켜 보자고 함])
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 열연[제품](taEnthuMnfg.xfdl) 수정
1. BAA0164, BAB501B8, BAB5018[실적 Tab: 0건 조회]
==============================================================================================================
 
- 파일첨부하는 공통 메소드 alert 처리 ==> 완료 @@@
/***************************************************************************
* Even : FileUpload_onitemchanged
* Desc : File 변경 이벤트
****************************************************************************/
this.FileUpload_onitemchanged = function(obj:FileUpload, e:nexacro.FileUploadItemChangeEventInfo) {
	//trace("[/comFileUploadM.xfdl] [FileUpload_onitemchanged()] ==> [TEST_01] [file 변경시] [첨부 파일명]"+
	e.newvalue +"[첨부 파일명 글자수]"+ e.newvalue.toString().length );
	 
	var nFileNmLen = e.newvalue.toString().length - 3;// 첨부 파일명 길이
	//trace("[/comFileUploadM.xfdl] [FileUpload_onitemchanged()] ==> [TEST_01] [file 변경시] [nFileNmLen]"+ nFileNmLen );
	 
	if(!this.gfn_IsNull(e.newvalue) && nFileNmLen > 50)// 첨부 파일명 길이가 50자를 넘으면
	{
		this.gfn_Alert("첨부 파일명은 50자를 넘을 수 없습니다");
		return false;
	}
};
==============================================================================================================
 
- KOLAS 인정현황(/tkKolasRcgnStat.xfdl) 수정 ==> 완료 @@@
1. Grid 구분 클릭: KOLAS KOLAS 시험규격(/tkKolasTstSpec.xfdl) 화면 팝업
==============================================================================================================
 
- 메뉴 수정 ==> 완료 @@@
03. 부원료(내.외자)[공정>고로](/taSubRawMatrInOutShtFurn.xfdl): TK11003 ==> 수정(해당 메뉴 삭제)
03. 부원료(내자)[공정>고로](/taSubRawMatrInShtFurn.xfdl): TK11003 ==> 추가
03. 부원료(외자)[공정>고로](/taSubRawMatrOutShtFurn.xfdl): TK11004 ==> 추가
==============================================================================================================
 
- 원료[공정>고로](/taRawMatrShtFurn.xfdl) 수정 ==> 완료 @@@
1. 의뢰일자, 특정 Cell들을 병합(Merge) 수정
/***************************************************************************
* Even : btn_Search_onclick
* Desc : 조회
****************************************************************************/
this.btn_Search_onclick = function()
{
	this.gfn_saveLog();// 화면사용이력 저장 @@@ ===> TEST @@@ ===>
	 
	//var sQUERY = "AND A.CHEM_TST_ITM_CD IN ( 'P183', 'P145', 'C007', 'C027', 'C039', 'C043', 'C047' ) ";
	/* 화학시험항목코드 ==> TEST @@@ [물리 2개, 화학 5개] */
	var sQUERY =" AND A.CHEM_TST_ITM_NM IN ( ' +0.15 mm', 'Al2O3', 'CaO' ) "; /* 화학시험항목코드 ==> TEST @@@ [물리 1개, 화학 2개] */
	// var sQUERY =" AND A.CHEM_TST_ITM_NM IN (' +0.15 mm', ' +9.5 mm', 'Al2O3', 'CaO', 'Cu', 'Fe', 'FeO' ) ";
	/* 화학시험항목코드 ==> TEST @@@ [물리 2개, 화학 5개] */// , 'FeO', 'K2O', 'L.O.I', 'MgO', 'Mn', 'Na2O'
	 
	this.ds_Search.setColumn(0, "CHEM_TST_ITM_CD_TEST", sQUERY ); ///* 화학시험항목코드 ==> TEST @@@ */
	trace("[/taRawMatrShtFurn.xfdl] [btn_Search_onclick()] ==> [TEST_01] [ds_Search.CNT]"+ this.ds_Search.getRowCount()
	+"[ds_Search.saveXML()] \n"+ this.ds_Search.saveXML() );
};
-----------------------------------------------------------------------------------------------------------------------------
 
<select id="selectList" parameterType="java.util.Map" resultType="Map">
/* 원료[공정>고로] 정보 조회 ==> [/TA11101Mapper.xml] [selectList()] [2019.11.12, by 진태만] */
SELECT Z.BUY_GDS_INSP_REQ_DD /* 의뢰일자 */
		, Z.STARTSAIL_HR /* 출항일 */
		, Z.BUY_GDS_INGR_INSP_DD /* 검사완료일 */
FROM (
	/* ; -- ===============================================================================================> */
	SELECT DENSE_RANK() OVER(ORDER BY SUBSTR(A.CHEM_TST_ITM_CD, 0, 1) DESC
		, (SELECT CD_CNTS_K
		FROM TB_GQ_CM_CDITEM CD
		WHERE CD_ID = 'CM024'
		AND CD_ITEM = A.CHEM_TST_ITM_CD)) AS D_RANK /* 화학시험항목코드 RANK */
		, A.CHEM_TST_ITM_CD /* 화학시험항목코드 */	
		, A.CHEM_TST_ITM_NM
		, TRIM(TO_CHAR(A.CHEM_TST_WR, DECODE(A.IG_DIGIT, 0, '999,999,990',
		1, '999,999,990.0',
		2, '999,999,990.00',
		3, '999,999,990.000',
		4, '999,999,990.0000',
		'999,999,990.00'))) AS CHEM_TST_WR /* 화학시험실적치 */
	WHERE A.BIZOFFICE_CD = 'DJ'
		AND A.RAW_INSP_MNBD_GP = 'H'
		AND A.RAW_KND_GP IN ('E01','E02')/* 원료(E01: 철광석, E02: 석탄) */
		<if test=" STARTSAIL_DD_START != '' and STARTSAIL_DD_START != null">
			AND A.BUY_GDS_INSP_REQ_DD BETWEEN TO_DATE(NVL(#{STARTSAIL_DD_START},'20000101')||'000000','YYYYMMDDHH24MISS')
			AND TO_DATE(NVL(#{STARTSAIL_DD_END},'29991231')||'235959','YYYYMMDDHH24MISS')/* 의뢰일자(조회조건_1) */
		</if>
		<if test=" CHEM_TST_ITM_CD_TEST != '' and CHEM_TST_ITM_CD_TEST != null">
			${CHEM_TST_ITM_CD_TEST} /* 화학시험항목코드 ==> TEST @@@ */ /* $ ==> 따옴표로 없이 조회됨 */
		</if>
	ORDER BY SUBSTR(CHEM_TST_ITM_CD, 0, 1) DESC
	/* ; -- ===============================================================================================> */
) M
GROUP BY M.BUY_GDS_INSP_REQ_DD, M.STARTSAIL_HR, M.BUY_GDS_INGR_INSP_DD, M.MOTHERSHIP_NAME
, M.SUPPLIER, M.RAW_SUPC_ITM_PT, M.RAW_USG_GP, M.RAW_USG_GP_NM, M.SUPC_ITM_CD
, M.RAW_SHPLD_QTY, M.BUY_RAW_INSP_WR_DRYQTY
)
SELECT * FROM TEMP_TABLE
UNION ALL
SELECT NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'평균',NULL,NULL, ......
FROM TEMP_TABLE
UNION ALL
SELECT NULL,NULL,NULL,NULL,NULL,NULL,NULL,NULL,'표준편차',NULL,NULL. ;;;;;;;
FROM TEMP_TABLE
) Z
</select>
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.27(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:40 ==> 현대제철 부속의원 방문(08:30, 발가락 2개 치료8, 의사 진료)
									, 서울행(19:40 ~ 20:50), 당진T --> 18:05 통근 버스[7번]가 당진T로 출발)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 전사 로그 개발
<insert id="insertCOMUSELOG" parameterType="java.util.Map">
/* 화면사용이력 저장 ==> [/common_I12.xml] [insertCOMUSELOG()] [2019.12.27, by 진태만] */
INSERT INTO TB_GQ_CM_UIUSELOG (
	DD_REG_SEQ /* SEQ */
	, EMP_NO /* 사번 */
	, UI_ID /* 화면ID */
	, USE_DDTT/* 사용일시 */
	, PROC_GP /* 처리구분 */
	, REGISTER
	, REG_DDTT
	, MODIFIER
	, MOD_DDTT
	) VALUES (
	DD_REG_SEQ.nextval/* SEQ */
	, #{EMP_ID}/* 사번 */
	, #{UI_ID} /* 화면ID */
	, SYSDATE /* 사용일시 */
	, 'R'/* 처리구분 */
	, #{EMP_ID}
	, SYSDATE
	, #{EMP_ID}
	, SYSDATE
)
</insert>
-------------------------------------------------------------------------------------------------------------
 
-- 화면사용이력 정보 조회 @@@
SELECT A.DD_REG_SEQ AS 순번, A.UI_ID AS 화면ID, A.EMP_NO AS 사번, A.USE_DDTT AS 사용일시
, A.*
FROM TB_GQ_CM_UIUSELOG A
ORDER BY A.REG_DDTT DESC
==============================================================================================================
 
- 운영 서버에 소스 이관(11:20) ==> 완료 @@@
1. 개발 서버 소스 이관 ==> 운영 서버 소스 이관
==============================================================================================================
 
- DBeaver SQL 실행
0. Ctrl + Enter: SQL문 실행
1. Ctrl + Alt + Shit + X: Execute Statements In Separate Tabs(멀티 SQL문 실행): SQL문 실행 결과가 Result 탭으로 여러개 생성됨
2. Ctrl + Alt + Shit + C: 로우 건수 조회
3. Ctrl + Alt + Shit + A: 전체 결과 조회
==============================================================================================================
 
- 열연[제품](taEnthuMnfg.xfdl) 수정
1. BAA0164, BAB5018B, BAB5018[실적 Tab: 0건 조회]
1) Tab1 조회 일 경우 /* A. 검색 조건(조회조건_2)이 시편번호 이면 */ /* B. 검색 조건(조회조건_2)이 코일번호 이면 */ 사이에
UNION ALL 추가(ASIS 소스와 맞춤)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.12.28(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말
08:00 기상 
08:20 조식
09:00 도림천로 도보
10:20 귀가
10:30 집출발(자전거): 수종
10:40 서울 가정의학과 의원 방문 ==> 진료(수종 목 감기)
		==> 진료(발가락 다침), 항생제 주사 --> 걷지 말라고 함
11:00 래미안 나나 약국 방문 ==> 조재(발가락 치료, 3일치 약, 수종 감기약)
11:20 엘마트 방문 ==> 밀크 플러스 900ml(우유, 2통): 수종
12:05 귀가
12:20 중식 
13:00 실내 자전거 타기(1시간)
14:00 종료
14:30 집출발(자전거): 수종
14:50 대동초 정류장(507번 버스 탑승)
15:50 광희동 정류장 하차
16:10 승진문구 방문 ==> 3단 전동 지하철 1호선, 2호선(아이다): 수종 장난감(성탄절 선물)[37,800원]
16:30 목욕 타월(동대문 평화시장) 구입[15,000원]
16:50 광희동 정류장(507번 버스 탑승)
18:10 대림역 정류장 하차
18:20 석식(비빕밥, 치즈돈가스): 수종[11,000원] 
18:50 귀가
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
22:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■ 2019.12.30(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 지출결의서 확인(출력), 현대제철 부속의원 방문(08:30, 발가락 2개 치료9, 의사 진료[많이 좋아 졌다고 함])
								, 출입증 확인(오토에버 PM에게 전화, 확인 요청), 강과장 휴가(어머니 퇴원), 중식, 석식 후 헬스장(30분 자전거, 처음)
								, 일부 짐 가지고 퇴근(21시)
								 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
- 냉연[제품](/taColdHeartedMnfg.xfdl) 수정
1. BAA0164, BAB5018B, BAB5018[실적 Tab: 0건 조회]
1) 냉연[제품] 기계시험 조회(Tab1) 에서 시편번호(BAB5018) 조회시 실적 안나옴.
==> 냉연 SM 김창우 과장에게 문의 메일 보냄
==============================================================================================================
 
- GQMS_Tst 서버 세션 연장 ==> 완료 @@@
1. 기존 세션 유지시간 16분에서 120분(2시간)으로 연장
-----------------------------------------------------------------------------------------------------------------------------
 
1. 특정 경우에 타임아웃 설정(어플리케이션에서)
<%
	session.setMaxInactiveInterval(20*60); // 초 단위 ==> 클라이언트가 20분 동안 요청이 없으면 세션 제거
%>
 
2. DD(Deployment Descriptor)에서 전체 세션 타임아웃을 설정(컨테이너에서)
1) /GQMS_Tst/src/main/webapp/WEB-INF/web.xml --> C:\GQMS_Tst\workspace\GQMS_Tst\src\main\webapp\WEB-INF\web.xml
<web-app>
	<session-config>
	<!-- <session-timeout>16</session-timeout> --><!-- 세션 유지 시간 설정: 16분 -->
	<session-timeout>120</session-timeout> <!-- 세션 유지 시간 설정: 120분(2시간): 수정[변경일: 2019.12.30(v1.0), by 진태만] -->
	</session-config>
</web-app>
 
3. 설정하지 않으면 WAS 기본 디폴트 값으로 적용(웹서버에서)
1) /web.xml 파일(/Servers/02_GQMS_Tst Server[9001]-config/web.xml)에서 전체 세션 타임아웃 설정
--> C:\GQMS_Tst\workspace\Servers\02_GQMS_Tst Server[9001]-config\web.xml
<web-app>
	<session-config>
	<session-timeout>30</session-timeout><!-- 전체 세션 타임아웃 설정: 30분(디폴트) -->
	</session-config>
</web-app>
--------------------------------------------------------------------------------------------------------
 
==> 만약 1번과 2번이 적용되어 있다면 1번 방법으로 설정한 값으로 적용
1) 즉, 어플리케이션에서 10분으로 설정을 했다면 컨테이너나 웹서버에서 20 - 30분으로 설정을 해도 아무 소용이 없다는 의미
(우선순위 : 어플리케이션 > 컨테이너 > 웹서버)
==============================================================================================================
 
- GQMS_Tst 소스 정리
1. GQMS_Tst: 2.02GB 파일서버에 올려 놓음
==============================================================================================================
 
- 인수인계(15:20, 회의실)
1. KOLAS 수정 사항 ==> 이규선 대리, 진선철 과장
==============================================================================================================
 
- C:\GQMS_Tst\
01. GQMS_Tst
 
02. GQMS_Tst.xprj
C:\GQMS_Tst\workspace\GQMS_Tst\src\main\nxui\GQMS_Tst\GQMS_Tst.xprj
==============================================================================================================
 
- 02. KOLAS 인정항목(/tkKolasRcgnItem.xfdl) 수정 ==> 완료 @@@
1. 삭제여부, 조회 LIKE
==============================================================================================================
 
03. KOLAS 시험규격(/tkKolasTstSpec.xfdl) 수정 ==> 완료 @@@
04. KOLAS 표준(/tkKolasStnd.xfdl) 수정 ==> 완료 @@@
1. 조회조건 필수 처리
==============================================================================================================
 
06. KOLAS 인정현황(/tkKolasRcgnStat.xfdl): TK11006 ==> 완료 @@@
1. 사업장 구분 Grid 팝업 처리 수정(번호 클릭 후 팝업), 파일첨부
==============================================================================================================
 
09. KOLAS 인정계획(/tkKolasRcgnPlan.xfdl): TK11009 ==> 완료 @@@
1. 연도 콤보(cmb_PreYYYY) ds_PreYYYY 수정 ....-10....2019....+50
==============================================================================================================

- [11번가] 대용량 강냉이(선택: 04_G171_우리식품 강냉이 4kg), 가격: 17,260원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1713816804&xfrom=&xzone=
==============================================================================================================   

■■■■■■■■■■■■■■ 2019.12.31(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:40 ==> 지출결의서 확인(출력), 현대제철 부속의원 방문(08:30, 발가락 2개 치료10), 중식 후 헬스장(30분 자전거)
								, Prj 철수(17:40, 출입증 반납) --> 안전 프로젝트로 짐, 모니터 2대 옮기기(17시), 일부 짐 가지고 퇴근(17:40)
								, 서울행(19:40 ~ 20:50), 당진T --> 18:05 통근 버스[7번]가 당진T로 출발)
 
- 현대제철 전사 종합 시험관리 시스템 구축 Prj[★]
07. KOLAS 인원현황(tkKolasNmprStat.xfdl) 수정 ==> 완료 @@@
1. 팀등록시 부서 조회 팝업
2. 인원현황 저장 확인
-------------------------------------------------------------------------------------------------------------------------
 
-- KOLAS 인원현황 정보 조회 @@@ ==> 완료 @@@
SELECT A.SEQ AS 순번, A.RVS_NO AS 버전순번, A.FNL_RULE AS 최종기준, A.DEL_YN AS DEL_YN, A.TEAM_DATA
FROM TB_KOLAS_NMPR_STAT A
WHERE 1=1
ORDER BY A.SEQ, A.RVS_NO, A.FNL_RULE
;
==============================================================================================================
 
01. KOLAS 시험소(/tkKolasTstlab.xfdl 수정 ==> 완료 @@@
1. 파일 업로드 권한 체크 ==> 시험.검정팀, (당)품질보증팀)만 등록 가능하게 수정
1) gds_UserInfo(GDS)에서 받아온 부서코드(DEPTCD) 이용: 박순창씨 부서코드로 개발 안했다고 함)
==============================================================================================================
 
04. KOLAS 표준(/tkKolasStnd.xfdl) 수정 ==> 완료 @@@
1. 등록 후 파일 업로드 처리: 정상 ==> 첨부 파일(KOLAS 표준_파일 업로드.jpg) 참조
==> 파일 업로드는 Web(HTML5)에서 테스트하기 바람
2. 파업 업로드 쿼리 수정 ==> Sub Query --> Out Jion
==> 이규선 대리에게 메일 보냄
============================================================================================================== 

- JTBC 회원 가입
1. http://onair.jtbc.joins.com ==> tamairo7/20**오*h@
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 