

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2019.06) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2019.06.01(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
07:00 종료
07:10 조식
08:00 도림천로 도보
08:40 귀가
09:20 출발(자전거)
09:40 예스병원(4층)
09:45 진료(우성용 원장) ==> 수술 권유[6월 21일(금)]
10:00 도수 치료(30분 10만원) ==> 등뼈 만지면 아픔
		오십견 운동 소개 해줌  ==> 1. 아령 돌리기, 2. 우산 위아래로 돌리기, 3. 우산 옆 돌리기, 4, 수건 등 뒤로 오르 내리기
10:30 종료
10:40 수술 상담 ==> 입원(1주일), 수술(오른쪽 어깨: 윗자란 제거, 끊어진 인대 연결, 오십견 치료) 총 비용 230만원
11:20 다이소 남구로점 ==> 육각형 아령(약 2 kg) 구입(5천원, 2천원 포인트 사용하여 3천원에 구입)
11:30 종료
11:50 귀가 ==> 루옌 치과에 감
12:00 중식
12:30 도림천로 도보
12:40 귀가
14:00 출발(자전거): 수종
14:10 대림역 12번 출구 정류장
14:20 6511번 버스 탑승
15:00 서울대 정류장 하차
15:10 관악도서관 ==> 수종 혼자 책 읽음
16:00 종료  
16:10 서울대 정류장
16:20 6511번 버스 탑승
17:00 대림역 12번 출구 하차
17:20 다이소 대림2호점 ==> 육각형 아령(약 2 kg) 구입
17:40 귀가
18:00 치킨(갈릭 베이크[10,900원], 맛닭꼬 남구로점[02-866-2292], 포장) ==> 자전거
18:30 귀가
18:40 석식
19:00 도림천로 도보
19:40 귀가
20:40 루옌 귀가
21:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.02(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 72.1kg

- 주말2
04:00 기상
04:10 챔피언스리그 결승 시청(4시, 완다 메트로폴리타노 경기장[스페인 마드리드])   
		==> 토트넘 0:2 리버풀 --> 리버풀 우승(토트넘의 손흥민 골 못 넣음: 2% 부족)
06:00 인터네 서핑 ==> 야구 시청
07:10 조식 
08:00 도림천로 도보 
08:40 귀가
09:10 이발(8천원, [스카이 미용실]: 스포츠 머리, 마음에 듬) 
10:10 다이소 대림2호점 ==> 등산용 알루미늄 지팡이 구입(5천원: 오십견 도수치료용)
10:20 귀가
10:40 눈높이 한글 공부 도와주기(수종)
11:20 염색(루옌이 해줌)
12:00 중식 ==> 루옌(수종) 언니집에 놀러감
12:30 도림천로 도보
13:00 귀가
14:10 인터넷 서핑
15:00 인슐린 펌프 제거 ==>
15:40 집출발(자전거) 
15:50 대림운동장
16:00 축구 게임(은혜교회팀: 어울림팀) ==> 4쿼터 뜀(2시간): 컨디션 별로, 패스 못한다고 지적질 당함.
		==> 심하게 움직이면 어깨 아직도 아픔(왼쪽 어깨)
18:00 종료 
18:20 귀가
18:30 샤워
18:45 인슐린 약 교체(218U, 41U 남음)
18:55 인슐린 펌프 착용 ==> 
19:00 석식
19:28 집출발 ==> 루옌(수종) 귀가
19:40 영림초교 정류장(505번 버스 탑승)
20:20 광명역 도착(약 40분 소요)
20:56 창원행[광명(20:56) -> 창원중앙(23:31), KTX]
23:40 창원중앙역 도착(
24:40 귀가(약 40분 소요)
24:30 취침
==============================================================================================================

- 교체 예정 LG 노트북(김유진 대리에서 요청))
1. 모델명: LG 15UD470-GX50K
2. 사양: RAM 8GB, SSD 256GB
3. LG전자 울트라PC 15UD470-GX50K ==> http://m.enuri.com/short/fpc4b, http://www.enuri.com/detail.jsp?modelno=15112376
==============================================================================================================

- USB 256G 구입 검토
1. 샌디스크 Ultra Dual OTG m3.0 [256G], 가격: 최저가36,190원
http://www.enuri.com/detail.jsp?modelno=20507374&condiDelivery=N
==============================================================================================================

- 폴더 탐색기 개발 검토 
1. 개발 SW(Visual Basic, C#)
-----------------------------------------------------------------------------------------------------------------------------

- C# 기초 - 예제로 배우는 C# 프로그래밍
http://www.csharpstudy.com/csharp/CSharp-Intro.aspx
https://www.youtube.com/channel/UCkIhrkRWbv96DQF9OLs6KYg

1. VisualStudio 2019 무료 버전 Community 버전 설치(Window 무료 개발툴 )
https://sosobaba.tistory.com/221
==============================================================================================================

- 탐색기 대용 프로그램들 :: kadin's blog - 몫 - 티스토리
https://alastheday.tistory.com/32 
1. explorer plusplus ==> https://explorerplusplus.com
2. Q-Dir 7.55(폴더 관리 프로그램) ==> http://www.softwareok.com/?Download=Q-Dir&goto=../Download/Q-Dir_Portable_x64.zip

- C# 윈도우 탐색기
 개발&제작/프로그램[C#] 간단한 유틸을 만들어보자! - [DIY 탐색기] 편 ==> https://iandilib.tistory.com/14
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.03(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 기상 시간 5시 50분으로 조절, 통합 테스트(10시), HSD 엔진 그룹웨어 오픈(9시),
									식권 구입(15시, 새마을금고): 24장(10만 8천원)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
-- 수주등록 및 상세내용(/ORD000050.xml) 수정 ==> 완료 @@@
1. grd_itemList Grid에 칼럼 추가
ds_itemList.setCellData( rowidx , "UAMT_BUY_KRW_H" , uamt_buy_kor);		
// 상위품 구매단가(원화)[구매단가 (원화)[총 구매단가 (원화)] ==> 수정: 2019.06.03, by 진태만 
ds_itemList.setCellData( rowidx , "UAMT_BUY_KOR", uamt_buy_kor_h + uamt_buy_kor_l );		
// 구매단가 (원화)[총 구매단가 (원화)] ==> 수정: 2019.06.03, by 진태만 

var uamt_material_h = scwin.toFiexd(combiz.nvl(ds_itemList.getCellData(rowidx, "UAMT_MATERIAL_H"), 0)*1, 0 );        
// 상위품 구매단가(원화)
var uamt_material_l = scwin.toFiexd(combiz.nvl(ds_itemList.getCellData(rowidx, "UAMT_MATERIAL_L"), 0)*1, 0 );       
 // 하위품 구매단가(원화)  
var iqty = scwin.toFiexd(combiz.nvl(ds_itemList.getCellData(rowidx, "QTY_ORDER"), 0)*1, 0 );   // 수량
ds_itemList.setCellData( rowidx , "UAMT_MATERIAL", uamt_material_h + uamt_material_l );	
// Total Unit Cost(총 재료비 단가[재료비 단가]) = 상위품 Unit cost + 하위품 Unit cost ==> 수정: 2019.06.03, by 진태만 
ds_itemList.setCellData( rowidx , "UAMT_MATERIAL_COST",  scwin.toFiexd(v_uamt_material) * scwin.toFiexd(iqty) );		
// Amount Cost = 총 재료비 단가[재료비 단가]  * 수량 ==> 수정: 2019.06.03, by 진태만 
==============================================================================================================

- Oz Report 개발(개발 서버 이관: 김보훈 대리에게 메일 보냄) ==>   @@@
1. New Packing List 출력물(/INV000030.ozr) 
 1) 2page 이상 출력물 상단 Invoice No. 및 Date 추가 ==> PJT No. : DML0310111
 2) 데이타 2개 이상 일 때 데이터헤더가 다음 페이지에 겹쳐질 때 ==> 데이터 밴드에서 반복 횟수 2로 설정
 ==> Table.ozr, 예정신고.ozr, PSA010100_03.ozr, PSA020500_02.ozr
  ==> 자동크기조정(Notes): 예 ==> Table.ozr,

가. NO_PACK_LIST_02 필드에 셋팅
int Page_Number;
string Data; 
string Data2; 

Page_Number = #OZSystem.Page_Number#; 

if(Page_Number > 1)    	 // 페이지가 1보다 크고 NO_PACK_LIST가 NULL 이면(첫 화면이 아니면)
{
	Data2 = #SQL_M.NO_PACK_LIST#;
}
else		// 페이지가 1보다 적으면
{	 
	Data2 = "";
}
-------------------------------------------------------------------------------------------

나. NO_PACK_LIST_03 필드에 셋팅
setattr("caption", Data2); 

string Data2; 
string Data3; 
 
Data2 = #SQL_M.NO_PACK_LIST_2#;

if(Data2 == "")    	 // NO_PACK_LIST_2가 NULL 이면
{
	Data3 = "";
}
else 
{	 
	Data3 =#SQL_M.NO_PACK_LIST_2#;
}

setattr("caption", Data3);
---------------------------------------------------------------------------------------------------------------------------
 
- Packing List 작성(/INV000110.xml) ==> 완료 @@@ 
1. New Packing List 출력물(/INV000030.ozr)
2. invoice 출력물_Head만 출력(/INV000040_01.ozr)
3. invoice 출력물_Item 포함 출력(/INV000040_02.ozr)
==============================================================================================================
  
- [디자인] 리전을 이용한 데이터밴드에 여러 데이터셋 표현방법
1. https://m.blog.naver.com/PostView.nhn?blogId=davincigo&logNo=60103411896&proxyReferer=https%3A%2F%2Fwww.google.co.kr%2F

- 'study/OZ' 카테고리의 글 목록 :: 뉴비뉴
https://newbiecs.tistory.com/category/study/OZ
==============================================================================================================
  
일수	장수	장당 가격	주 가격
4	8	 4,500 	 36,000 
5	10	 4,500 	 45,000 
3	6	 4,500 	 27,000 
12	24	 13,500 	 108,000 
합계			 180,000 

일수	점심, 저녁	장당 가격	주 가격
12	24	 4,500 	 108,000 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.04(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 주간보고회(10시 ~ 11:30, PI회의실): 취소

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
- Oz Report 개발(개발 서버 이관: 김보훈 대리에게 메일 보냄) ==> 완료 @@@
1. New Packing List 출력물(/INV000030.ozr) 
 1) 수정 요청 사항 처리
==============================================================================================================

- Oz Report 행개수(MaxRows) : 10,  행고정: 예
1. 테이터 밴드(DataBand1) ==> 헤더 고정: 예, 자동 크기 조정: 예 
	>> 데이터 헤더 밴드(DataHeade3) ==> 자동 크기 조정: 아니오 
	>> 테이블(Table_2) ==> 행 개수: 10, 행 고정: 예:, 행 숫자: 예, 제목 소유: 예
----------------------------------------------------------------------------------------------------

- Oz Report 자동크기조정(Notes): 예
1. 테이터 밴드(DataBand3) ==> 헤더 고정: 아니오, 자동 크기 조정: 아니오 
	>> 데이터 헤더 밴드(DataHeade3) ==> 자동 크기 조정: 아니오 
	>> 테이블(Table_4) ==> 행 개수: 0, 행 고정: 아니오:, 행 숫자: 예, 제목 소유: 예, 헤더 고정: 예, 행 높이 조정: 예
==============================================================================================================

- 사용자 매뉴얼 작성 ==> 완료 @@@
9. 기준 이익률 적용 예외품(/INQ000020.xml) 화면 ==> 완료 @@@
10. 견적 담당자 관리(/INQ000030.xml) 화면 ==> 완료 @@@
11. Sales Person 관리(/INQ000300.xml) 화면 ==> 완료 @@@
B. 수주정보
1. 수주등록 및 상세내용(/ORD000050.xml) 화면 ==> 완료 @@@
2. 수주현황(/ORD000100.xml) 화면 ==> 완료 @@@
3. 수주 실적관리(/ORD000110..xml) 화면 ==> 완료 @@@
4. 보발행 현황(/ORD000090.xml) 화면 ==> 완료 @@@
5. 품목별 수주현황(/ORD000140.xml) 화면 ==> 완료 @@@
6. 유상서비스 수주현황(/ORD000160.xml) 화면 ==> 완료 @@@
7. C/S BOM 관리(/ORD010010.xml) 화면
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.06.05(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 도보 출근, HSD 엔진 체육대회(10시 ~ 16:30): 협력사는 정상 근무, 퇴근(17시, 허대리 차)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
- 로그 제거 작업
1. java, .xml 파일에서 로그 제거 ==> 완료 @@@
 1) java 파일에서 ==> logger.info, System.out.println로그 제거
 2) xml 파일에서 ==> console.log 로그 제거
==============================================================================================================

- 메인 이슈
1. C#으로 윈도우 폴더 탐색기 개발
 1) C# 배우기(유투브 동영상)
 1) Q-Dir 7.55(폴더 관리 프로그램)과 유사하게 개발할 것
2. eclipse 셋팅
 1) Spring 셋팅
   가. Mybatis 연동
 2) 전자정부프레임워크 셋팅
  가. Mybatis 연동
==============================================================================================================

- 김보훈 대리에게 6월 19일(수) 철수 확인 요청
1. 6월 6일(목) 근무하고 6월 19일(수) 철수하는 것으로 잠정 합의
2. HSD Batch 서버로 개발한 Batch 프로그램을 김보훈 대리가 tomcat 서버 관리하기가 힘들다고 기존의 WAS(웹로직)에서 운영하기로
결정 했다고 통보 해줌.
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2019.06.06(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:30 ==> 05:55 인슐린 약 교체(228U, 44U 남음), 도보 출퇴근, 현충일(근무)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
- 01. 두산_웹스퀘어 _공통기술 처리(4. 공통 UI 작업)
01. 오류메시지 구체화
- /INQ000150Controller.java 파일에서
@RequestMapping("/inq/pmAllSearch.do")
public ModelAndView pmAllSearch(Map<String, Object> param) throws Exception { 
	System.out.println("[/INQ000150Controller.java] [pmAllSearch()] ==> [TEST_01]" );
 
    WqModel wqModel = new WqModel();
	
	try {  
		List generalList= service.selectInq000150NewGeneral((Map) param.get("ds_input1"));
	
	} catch (Exception ex) {// DB커넥션 없음
		// wqModel.setErrorMsg(WqModel.STATUS_ERROR, ex);
		wqModel.setErrorMsg(WqModel.STATUS_ERROR, "견적작성 정보를 가져오는 도중 오류가 발생하였습니다,", ex);  		
		// 에러 메세지 수정: 2019.06.05, by 진태만 
	}
}
==============================================================================================================

14. 페이징 처리
- 품목별 수주현황(/ORD000140.xml) 화면
1. 페이징 처리(20180101 ~ 20190528)   
 1) 게시판 페이지 처리 기본 과정 (Oracle) ==> https://jeong-pro.tistory.com/88
==============================================================================================================

- Oracle에서 페이징 생각하기 @@@
select B.rum, B.id, B.name, B.content, B.regdate
from
    (select rownum as rnum, A.id, A.name, A.content, A.regdate
    from (
        select id, name, content, regdate
        from board
        order by regdate desc ) A
    where rownum <=20 ) B
where B.rnum >= 11   
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.06.07(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 서울행[마산(18:11) -> 광명(20:44), KTX] 

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
- 01. 두산_웹스퀘어 _공통기술 처리(4. 공통 UI 작업)
14. 페이징 처리 ==> 완료 @@@
- 품목별 수주현황(/ORD000140.xml) 화면
1. 페이징 처리(20180101 ~ 20190528)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.08(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
07:00 종료
07:10 조식
08:00 도림천로 도보
08:40 귀가
09:30 출발(자전거)
09:50 예스병원(4층)
10:08 진료(우성용 원장) ==> 도수 치료 열심히 하라고 함
10:30 도수 치료(30분 10만원) ==> 왼쪽 어깨 집중적으로 치료해줌
11:00 종료
11:20 귀가 ==> 루옌 치과에 감
12:00 중식
12:30 도림천로 도보
12:40 귀가
14:00 출발(자전거): 수종
14:20 마리오 아울렛 1관 3층 > 2관 3층 > 3관 층 > 3관 6층(영풍문고) > 3관 7층(닥터 밸런스(키즈파크), 토이플러스(장난감 샵))
16:00 종료
16:20 구로리 공원(수종)
16:55 종료
17:00 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종
17:30 밀크 플러스 900ml(우유, 4통, [1통 3,330원]): 수종 
18:00 귀가 
18:30 도림천로 도보
19:30 귀가
20:00 낮잠
21:50 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.09(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 72.1kg

- 주말2
05:40 기상
06:00 인터넷 서핑 ==> 야구 시청 
08:10 조식
09:00 도림천로 도보
09:40 귀가
10:00 휴식
12:00 중식
13:00 도림천로 도보
13:50 귀가 
14:00 인터넷 서핑 ==> 축구 안 감(축구 은퇴 고민)
15:50 휴식
17:20 석식
18:00 도림천로 도보
18:40 귀가 ==> 루옌(수종) 귀가
18:50 샤워 
19:30 집출발
19:45 영림초교 정류장 도착
19:57 505번 버스 탑승
20:30 광명역 도착(약 32분 소요)
20:56 창원행[광명(20:56) -> 창원중앙(23:31), KTX]
23:45 창원중앙역 도착
24:30 귀가(약 40분 소요)
24:40 취침
==============================================================================================================
 
- 반바지 구입
1. 축구 반바지(택01) 캡스록 4부 무지: 네이비/110(3XL], 블랙/85(S)), 가격: 15,700원
http://www.enuri.com/detail.jsp?modelno=14113634&cate=&IsDeliverySum=N
http://item.gmarket.co.kr/detailview/item.asp?goodscode=682782971
==============================================================================================================

- 쌀 20kg 구입
18년산 햅쌀 햇빛담은 쌀 20kg, 가격: 44,160원
http://www.enuri.com/detail.jsp?modelno=31088756&cate=15020211&IsDeliverySum=N
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.10(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 05:56 인슐린 약 교체(186U, 44U 남음)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★] 
- 사용자 매뉴얼 작성 ==> 완료 @@@ 
C. Stock 관리
1. Stock Master(/STD000050.xml) 화면
2. Stock 구매 현황(/STD000030.xml) 화면
3. Stock 예약 및 판매 현황(/STD000040.xml) 화면
4. Stock 재고 현황(/STD000060.xml) 화면
5. Stock PJT 등록(/STD000010.xml) 화면
6. Stock 품목 등록(/STD000020.xml) 화면
7. Stock Tracking(/STD000070.xml) 화면
==============================================================================================================

- 01. 두산_웹스퀘어_공통기술 처리(4. 공통 UI 작업)
1. ibiz 실행중 ebiz 접속시 was 세션이 끊어짐 ==> 2개 모두 세션이 끊어짐(Session이 없습니다.)
 1) 1개의 Project에 WAS 서버 1대에 IP Port 2개로 ibiz, ebiz 운영
  가. e-biz.hsdengine.com, i-biz.hsdengine.com ==> IP: 10.100.100.60
==============================================================================================================

- [개발/JSP]세션 시간 변경하기(Session Timeout)
1. 특정 경우에 타임아웃 설정
ex) 클라이언트가 20분동안 요청이 없으면 세션 제거
<%
    session.setMaxInactiveInterval(20*60); // 초 단위
%>

2. DD(Deployment Descriptor)에서 전체 세션 타임아웃을 설정
ex) 클라이언트가 15분동안 요청이 없으면 세션 제거(파일위치 : WEB-INF/web.xml)
  <!-- 세션 유지 시간 지정(단위: 15분) 시작 -->
<web-app>
    <session-config>
        <session-timeout>15</session-timeout>
    </session-config>
</web-app>
<!-- 세션 유지 시간 지정 종료 -->

3. 설정하지 않으면 WAS 기본 디폴트 값으로 적용
ex) Tomcat(conf/web.xml)은 30분입니다.
==============================================================================================================

- Websquare 라이선스 키 등록(Websquare license)
1. eclipse > Help > 웹스퀘어 라이선스 등록 > 라이선스 키(license)
+RmigMkVJOTk5QUxNS0JASEw4ODpJVkU=
s5eX1QnmitPar2MeQDOChp/OYMWH4qwStTzgZSSShfVcfHt7dDxtS9gKpJBtPLPSNG7GOPW
xwUTt8lEG01/5MmM62oqQ9wynbPnbt0=
--------------------------------------------------------------------------------------------------------

2. Loading License. PATH: C:\WS5_SAMPLE\RESOURCE\websquare_home\license\license 파일에 복사, 붙여넣기
+RmigMkVJOTk5QUxNS0JASEw4ODpJVkU=
s5eX1QnmitPar2MeQDOChp/OYMWH4qwStTzgZSSShfVcfHt7dDxtS9gKpJBtPLPSNG7GOPW
xwUTt8lEG01/5MmM62oqQ9wynbPnbt0=
==============================================================================================================

- WebSquare  eclipse 로그 확인
1. /log4j.xml 파일에서
<!-- ROOT -->
<root>
	<level value="INFO" />	<!-- 로깅레벨(FATAL, ERROR, WARN, INFO, DEBUG) ==> 수정: 2019.03.19, by 진태만 // -->
	<appender-ref ref="console" />
</root>
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.06.11(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 주간보고회(10시 ~ 10:30, PI회의실): 마지막 회의

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- 01. 두산_웹스퀘어_공통기술 처리(4. 공통 UI 작업)
1. ibiz 실행중 ebiz 접속시 was 세션이 끊어짐 ==> 2개 모두 세션이 끊어짐(Session이 없습니다.)
 1) 1개의 Project에 WAS 서버 1대에 IP Port 2개로 ibiz, ebiz 운영
  가. e-biz.hsdengine.com, i-biz.hsdengine.com ==> IP: 10.100.100.60
 ==> loginInfo = (String) userInfo.get("I_USER");
loginInfo_2 = (String) userInfo.get("I_USER_2");
String system_gbn = (String) userInfo.getSystemGbn();
request.getSession().invalidate();		// 현재 생성된 세션을 무효화 시킴  ==> TEST @@@ ===> 
--------------------------------------------------------------------------------------------------------------------

userInfo.putAll(userInfoMap); 		// 세션 설정 함수 호출 @@@
System.out.println("[/LoginController.java] [login()] ==> [TEST_51] [세션 설정] [userInfoMap]"+ userInfoMap );  
 
System.out.println("[/CommonSessionCheck.java] [preHandle()] ==> [TEST_31_1] [01. 세션이 존재하면_loginInfo]"+ loginInfo );
userInfo.setUserInfoMap(session);		// 사용자 정보 세션 셋팅 @@@

Map<String, Object> loginInfo = service.selectLoginInfo(userInfo.getUserInfoMap()); 
wqModel.setData("ds_output3", loginInfo);		// 로그인 정보 조회 @@@
System.out.println("[/MainController.java] [selectMainInfo()] ==> [TEST_51] [userInfoMap]"+ loginInfo );  
==============================================================================================================

- 운영자_매뉴얼 작성
1. BIZ_ACC_운영자_매뉴얼_20180205_r2.docx
  1) 5.  시스템 흐름도 ==> 완료 @@@ 
  2) 7.  SESSION ==> 완료 @@@ 
  3) 8.  페이징 ==> 완료 @@@ 
   가. 품목별 수주현황(/ORD000140.xml) 화면
  4) 13.  주요화면 설명
==============================================================================================================

- 충전용 건전지 분석
==============================================================================================================

- 지출결의서_진태만(2019.05_06) 작성
2019.05.31	2019년 05월 지출 결의서	 810,520원
2019.06.30	2019년 06월 지출 결의서	 529,880원
총액		 1,340,400원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.12(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- 운영자_매뉴얼 작성
1. BIZ_ACC_운영자_매뉴얼_20180205_r2.docx
  4) 13.  주요화면 설명
	가. 견적등록(/INQ000110.xml) 화면
	나. 견적작성(/INQ000150.xml) 화면 ==> 완료 @@@ 
	다. 수주등록(/ORD000050.xml) 화면
	라. Order Registration(/ORD000020.xml) 화면  ==> 완료 @@@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.13(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 중식(갈비살 정식[진해 돌산갈비], HSD 엔진IT팀): 최진만 차장, 구윤모 팀장 생일 케익)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- 운영자_매뉴얼 작성
1. BIZ_ACC_운영자_매뉴얼_20180205_r2.docx
  4) 13.  주요화면 설명
	가. 견적등록(/INQ000110.xml) 화면 ==> 완료 @@@
	나. 견적작성(/INQ000150.xml) 화면 ==> 완료 @@@
	다. 수주등록(/ORD000050.xml) 화면 ==> 완료 @@@
	라. Order Registration(/ORD000020.xml) 화면  ==> 완료 @@@
==============================================================================================================

- 01. 두산_웹스퀘어_공통기술 처리(4. 공통 UI 작업)
1. Service 재 활용성 ==> 견적등록/(INQ000110Controller), 견적작성(/INQ000150Controller) Controller 통합(INQ1000000Controller) 
견적등록/INQ000110.xml), 견적작성(/INQ000150.xml)
@RequestMapping("/inq/selectInqCom.do")
public ModelAndView selectInqCom(Map<String, Object> param) throws Exception { 
	System.out.println("[/INQ1000000Controller.java] [selectInqCom()] ==> [TEST_02] [param]"+ param +"[ds_input1]"+ 
		(Map) param.get("ds_input1") );  
	
	Map<String, Object> requestData = (Map) param.get("ds_input1");   // ds_searchDetail Ds   
	String sPrgId  = requestData.get("PRG_ID").toString(); 	 // 프로그램ID 

	WqModel wqModel = new WqModel();
	
	try {			
		wqModel.setData("ds_output1", service.selectInqCom((Map) param.get("ds_input1")));		// 견적 정보 공통 조회
	}
	
	return wqModel.getResult(); 
}

public ModelAndView saveInqCom(Map<String, Object> param) throws Exception { 
	System.out.println("[/INQ1000000Controller.java] [saveInqCom()] ==> [TEST_02] [param]"+ param +"[ds_input1]"+ 
		(Map) param.get("ds_input1") );  
	
	WqModel wqModel = new WqModel();
	 
	try{ 
		wqModel.setData("ds_output1", service.saveInqCom(param) );		// 견적 정보 공통 저장  
	}

	return wqModel.getResult();
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.14(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> HSD 엔진Prj Cut Over(10시), 중식(탕수육, 볶음밥[하림], HSD 엔진IT팀), 서울행[마산(18:11) -> 광명(20:44), KTX] 

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- 01. 두산_웹스퀘어_공통기술 처리(4. 공통 UI 작업) 
- 14. 페이징 처리 ■■■
A. 페이징 처리 처리 전
1. 품목별 수주현황(/ORD000140.xml) 화면에서 조회
 1) 검색 조건: Quot. date: 2018-01-01 ~ 2019-06-14)  ===> 40,036건 조회 됨(16초 걸림 ■■)
B. 페이징 처리 처리 후
1. 품목별 수주현황(/ORD000140.xml) 화면에서 조회
 1) 검색 조건: Quot. date: 2018-01-01 ~ 2019-06-14)  ===> 40,036건 조회 됨(2초 걸림 ■■)
==============================================================================================================

- UserProfileSession 정보 추가
1. /MainController.java 파일에서
wqModel.setData("ds_output6", cmmUserProfileService.getAllMapCMM_USER_PROFILE(userInfo.getiUser()));		
// UserProfileSession 정보 추가: 2019.06.14, by 진태만  
System.out.println("[/MainController.java] [selectMainInfo()] ==> [TEST_51] [UserProfileSession]"+ 
cmmUserProfileService.getAllMapCMM_USER_PROFILE(userInfo.getiUser()) ); 

2. /HomeIBiz.xml파일에서  ==> MainHeader.xml 파일보다 먼저 호출되어서 UserProfileSession 정보 못 받음 @@@
scwin.init = function () {
	console.log("[HomeIBiz.xml] [init()] ==> [TEST_71] [UserProfileSession.HomeBusinessStatusSettings.PROFILE_VALUE]"+ 
		ommon.getSession("UserProfileSession").HomeBusinessStatusSettings.PROFILE_VALUE );
	
	var session_status = common.getSession("UserProfileSession").HomeBusinessStatusSettings;
	var tmp_status = "Y;Y;Y;N;N;N";
	
	if(session_status != null && session_status != undefined && session_status != "") {
		tmp_status = session_status.PROFILE_VALUE;
	}
	biz_status.setUserData("userData1", tmp_status);
	
	scwin.commonFind2();   // TEST @@@ ===>
};

3. /MainHeader.xml 파일에서 
scwin.init = function () {
/**
 * 초기 메인 데이터 로드(메뉴, 메인 레이아웃(기본값))
 */
scwin.commonFind = function() {
	var options = {};
		options["id"] 		 = "selectMainInfo";
		options["action"] 	 = "cmm/selectMainInfo.do";
		options["inDs"] 	 = "";
		options["outDs"] 	 = ds_menu.getID();
		
	var promise = common.promise.execute(scwin, options); 
		promise = promise.then(function(res) {    // 조회 결과 
			common.setSession("UserSession", res["ds_output4"]);  	// 사용자 정보 세션 셋팅 @@@ 	
			common.setSession("UserProfileSession", res["ds_output6"]);  	// UserProfileSession 정보 추가: 2019.06.14, by 진태만
			console.log("\n [/MainHeader.xml] [commonFind()] ==> [TEST_70] [UserProfileSession 정보 @@@]"+ 
				common.getSession("UserProfileSession") );
			console.log("\n [/MainHeader.xml] [commonFind()] ==> [TEST_71] [UserProfileSession.HomeBusinessStatusSettings
				.PROFILE_VALUE]"+ common.getSession("UserProfileSession").HomeBusinessStatusSettings.PROFILE_VALUE ); 
		}
	}
};
==============================================================================================================

- 식권 반품 요청(15시, 새마을금고)
1. 2019.06.14(금) 구내 새마을금고 방문 ==> 82장 369,000원 한꺼번에 마이너스 영수증 발행 한다고 알아보고 다음주 월요일까지 
전화 준다고 함.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.15(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
07:00 종료
07:10 조식
08:00 도림천로 도보
08:40 귀가
10:10 출발(자전거): 수종
10:23 예스병원(4층) 
10:30 도수 치료(30분 10만원) ==> 왼쪽 어깨 집중적으로 치료해줌
11:10 진료(양성석 원장)
11:20 수술 상담2: 수술 후 실밥 풀기 전 2주 동안 목욕 못 함.
11:30 종료
11:40 귀가 ==> 루옌 치과에서 임플란트 넣고 옴(치료 완료)
12:00 중식 ==> 루옌(수종) 언니 집에 놀러감
12:30 도림천로 도보
12:40 귀가
14:00 인터넷 서핑
18:00 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종 
18:30 도림천로 도보
19:30 귀가
19:40 TV 시청
21:00 취침
21:50 루옌(수종) 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.16(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>

- 주말2
01:30 기상
01:40 2019 FIFA U-20 월드컵 결승 시청(우츠 스타디움[폴란드])   
		==> 한국 1:3 우크라이나 --> 우크라이나 우승(이강인 골든볼 수상)
02:50 종료
03:00 취침
06:30 기상 
06:40 조식
07:30 도림천로 도보
08:10 귀가
08:40 집출발
08:55 대림역 --> 합정역 --> 독바위역 1번 출구 --> 북한산 대창 센시티 아파트까지 도보로 이동(15분 걸림)
10:00 연신초교 삼거리: 기남이형 만남(어깨 보조기 얻어옴[10만원 상당])
10:20 연신초교 정류장(7211번 버스 탑승) --> 연신내역 --> 합정역 --> 대림역
11:30 귀가
12:00 중식
12:30 도림천로 도보
12:40 귀가
13:10 집출발(자전거: 수종)
13:30 다이소 남구로 2호점 ==> 가위 구입
13:40 밀크 플러스 900ml(우유, 4통, [1통 3,330원]): 수종
14:00 두암 어린이 공원(수종)
14:20 종료
14:30 귀가
14:40 인터넷 서핑 ==> 축구 안 감(축구 은퇴 고민)
15:50 휴식 
17:00 집출발(자전거: 수종)
17:30 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종
18:00 귀가
18:30 도림천로 도보
19:20 귀가
19:30 집출발
19:45 영림초교 정류장 도착
19:57 505번 버스 탑승
20:30 광명역 도착(약 32분 소요)
20:40 광명역 매표소에서 영수증 출력 요청(출력 완료) ==> 2019년 5월 3일(금) ~ 6월 14일(금)
20:56 창원행[광명(20:56) -> 창원중앙(23:31), KTX]
23:45 창원중앙역 도착
24:30 귀가(약 40분 소요)
24:40 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.06.17(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 06:08 인슐린 약 교체(249U, 29U 남음), HSD 엔진Prj 오픈(8시), 자리 이동(9시~11시, PI팀과 같이 사용)
								   , 식권 반품 요청(15시, 새마을금고): 내일 신한은행 내 계좌로 송금하고 전화 준다고 함(82장, 369,000원)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- HSD 엔진Prj 오픈(8시)
1. 운영 서버 견적/수주 메일자동 발송 시 오류가 발생
 1) /AutoBatchScheduled.java파일에서 autoMailBatchService.imapJob(); 문제 발생
==============================================================================================================
  
- 09. Modal 화면 2개 이상일 경우 정상 적용 여부 ■■■ 
1. 결재현황(/INQ000140.xml) 화면에서 Approve 팝업 테스트
 1) 결재상신 팝업 화면(/Approval_pop.xml) 화면에서 결재자 동명이인 팝업(/Approval_SameName_pop.xml) 화면 호출
==============================================================================================================
  
- BareTail로 유닉스 OS에서 tail 명령어처럼 윈도우 OS에서 문서를 실시간으로 출력해보자
https://moogii.tistory.com/entry/real-time-log-file-monitoring-wtih-baretail
http://www.baremetalsoft.com/
==============================================================================================================
  
- 신입 개발자 & 학생을 위한 Spring MVC Setting ( 1편 ) ==> eclipse spring
https://www.popit.kr/%EC%8B%A0%EC%9E%85-%EA%B0%9C%EB%B0%9C%EC%9E%90-%ED%95%99%EC%83%9D%EC%9D%84-%EC%9C%84%ED%95%9C-spring-mvc-setting-1%ED%8E%B8/
==============================================================================================================
   
- 현관문디지털도어락고장 나눌맨 간단히 9v배터리 하나로 해결
https://www.youtube.com/watch?v=Y53dcsCT76s
https://m.blog.naver.com/PostView.nhn?blogId=dldbq82&logNo=220180668248&proxyReferer=https%3A%2F%2Fwww.google.co.kr%2F
==============================================================================================================
   
- 오태범 이사에게 보고
1. SD 엔진 Stock 운영 시스템 무사히 오픈 했다고 보고
2. 이번주 금요일에 수술한다고 보고
3. 추후 프로젝트 하나 카드로 예정(7월 중순 예정): JAVA, JSP
==> 20시에 진대규 한테 전화옴(외국계 항공사로 이직했다고 함): 항공사 예약 프로그램 수정하는 알바 제안 받음.(리스크 큼, 신중 해야 함)
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2019.06.18(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 주간보고회(10시 ~ 10:30, PI회의실): 이슈 내역 설명(김보훈 대리), 식권 반품 완료(신한은행에 369,000원 입금됨)

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- 공통 UI 작업 검수
1. 김보훈 대리에게 설명 ==> 01. 공통 UI 작업.txt
==============================================================================================================
  
- 운영자_매뉴얼 작성
1. 김보훈 대리에게 설명 ==> 1.BIZ_ACC_운영자_매뉴얼_20180205_r2_02.docx
==============================================================================================================
  
- [이클립스] eclipse에서 Code Template 으로 편하게 주석(Comment)을 넣자
https://zzznara2.tistory.com/75 
/**
 * @Description : 견적 정보 공통 조회
 * 
 * @date 2019. 06. 13
 * @memberOf 
 * @param
 * @returns mv        
 * @author 진태만
 */	
==============================================================================================================
  
- Stock 재고 현황(/STD000060.xml) 페이징 처리
1. 450건 페이징 처리
==============================================================================================================
    
- Modal 화면 2개 이상일 경우 Modaless가 적용 안됨 문의
1. 이성복 수석에게 문의
2. 결재현황(/INQ000140.xml) 화면에서
 scwin.ext_btn_approveT_onclick = function(e) 
{ 
	var options = {
			id : "popup_same_name_user",
			title : "동명 이인 선택_T",
			frameMode : "wframe",
			//type : "iframe",    
			width : "450",
			height : "300", 
			modal : false,	  // 모달 여부(true: Modal, false: Modaless)  ===> 적용 안됨 @@@
			alwaysOnTop : false,  
			dataObject : { 
			},
			closeCallbackFncName : function(res) {  
			}
		};
	 
		$util.openPopup("/decom/cmm/xml/Approval_SameName_pop.xml", options); 
};

<xf:trigger class="btn_comm" ev:onclick="scwin.ext_btn_approveT_onclick" id="trigger1" style="" type="button">
	<xf:label><![CDATA[Approve_T]]></xf:label>
</xf:trigger>
-------------------------------------------------------------------------------------------------------------------------

3. 이성복 수석의 답글 
 1) 두산엔진 김보훈대리에게 원격요청하여 modal true의 경우에 대해 처리하였습니다.
 2) 부모창과 자식창 모두 속성 중에 frameMode: "wframe"로 되어있는부분을 type: "wframe"으로 2개 적용하고 테스트해보니 
	정상동작(부모창 팝업 띄우고 자식 창 띄었을때 부모창이 모달처리되지 않는 현상이 정상동작됨) 확인되었습니다. 
 3) 결재현황(/INQ000140.xml) 화면에서
 scwin.ext_btn_approveT_onclick = function(e) 
{ 
	var options = {
			id : "popup_same_name_user",
			title : "동명 이인 선택_T",
			//frameMode : "wframe",    		// 주석 처리 ==> 추가: 2019.06.19, by 진태만  @@@
			type : "wframe",    					// 수정: 2019.06.19, by 진태만  @@@
			width : "450",
			height : "300", 
			modal : false,	  // 모달 여부(true: Modal, false: Modaless)  ===> 적용 안됨 @@@
			alwaysOnTop : false,  
			dataObject : { 
			},
			closeCallbackFncName : function(res) {  
			}
		};
	 
		$util.openPopup("/decom/cmm/xml/Approval_SameName_pop.xml", options); 
};

<xf:trigger class="btn_comm" ev:onclick="scwin.ext_btn_approveT_onclick" id="trigger1" style="" type="button">
	<xf:label><![CDATA[Approve_T]]></xf:label>
</xf:trigger>
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2019.06.19(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 짐 정리(05:30), 중식(탕수육, 볶음밥[하림], HSD 엔진 IT팀 PI팀), HSD 엔진 Prj 철수(17시, 허대리 차 동승)
								, 숙소에서 짐 이동(17:30), 서울행[창원중앙역(18:23) -> 광명(20:44), KTX]: 캐리어 2개, 백팩 ==> 너무 힘들었음

- HSD 엔진 Stock 운영 시스템 구축 Prj[★]
- Stock 재고 현황(/STD000060.xml) 페이징 처리
1. 450건 페이징 처리, 한 페이지당 보여줄 레코드 갯수(recordSizePerPage) Combo 추가 
[/util.js] [getTimeDiff()] ==> [TEST_91] [시차_결과]16초 [시작일시]20190620094830[종료일시]20190620094846 ==> 
==============================================================================================================
 
14. 페이징 처리
- 품목별 수주현황(/ORD000140.xml) 화면
1. 페이징 처리(20180101 ~ 20190528)   
[/util.js] [getTimeDiff()] ==> [TEST_91] [시차_결과]2초 [시작일시]20190620095004[종료일시]20190620095006 ==> 페이징 정상 적용 ■■■
==============================================================================================================

- 09. Modal 화면 2개 이상일 경우 정상 적용 여부 ■■■ 
1. 결재현황(/INQ000140.xml) 화면에서 결재 상신(/Approval_pop.xml) 화면 팝업
 1) frameMode : "wframe" ==> frameMode : "iframe"로 변경하면 정상 작동됨
2. 결재 상신(/Approval_pop.xml) 화면에서 결재자 동명이인(/Approval_SameName_pop.xml) 화면 팝업
 1) frameMode : "wframe" 에서 modal : true로 해도 Modelss로 작동됨(1번째 창 수정 가능)
==============================================================================================================

- 철수 문서 작성
1. 인수인계서 작성
2. 보안 서약서 작성
3. 출입 카드 반납
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.06.20(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 11:00 ==> 본사 복귀(7시)

- 본사 대기[★]
- 노트북 교체
1. LG 노트북 교체 ==> 노트북 잠금 장치 설치
--------------------------------------------------------------------------------------------------------------------------------

- 교체 예정 LG 노트북 ==> 다음주에 퍼블리셔가 교육 끝나고 교체화기로 함
1. 모델명: LG 15UD470-GX50K
2. 사양: RAM 8GB, SSD 256GB
3. LG전자 울트라PC 15UD470-GX50K ==> http://m.enuri.com/short/fpc4b, http://www.enuri.com/detail.jsp?modelno=15112376
==============================================================================================================
 
- 지출결의서 제출
1. 지출결의서_진태만(2019.05~06).xlsx 점검, 영수증 제출
--------------------------------------------------------------------------------------------------------------------------------

- 지출결의서_진태만(2019.05_06) 작성
2019.05.31	2019년 05월 지출 결의서	 810,520원
2019.06.30	2019년 06월 지출 결의서	 529,880원
총액		 1,340,400원
==============================================================================================================

- 양재 최의원 방문(12시)
1. 당뇨 소모품비 구입 서류 요청, 당화 혈색소 검사, 인슐린 구입(8병)
==============================================================================================================

 - 델 모니터(P2717H) 구입 검토
1. [Dell] DELL 27인치 모니터 P2717H/FULL HD/IPS/피벗 /특가/, 가격: 227,190원
 http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=845839208
--------------------------------------------------------------------------------------------------------------------------------

- 델 모니터(P2717H) 구입(17시, 구로3동) ==> 2018.01.16(화)에 구입
1. [미개봉반품] 델 P2717H 와이드모니터/리퍼, 가격: 248,000원 ==> http://storefarm.naver.com/intrix/products/2040277381
2. 델 모니터 케이블: VGA 케이블, 파워 케이블 2개만 필요함(하지만 보니터에 있는 USB 이용시 USB 케이블 연결해야 함) 
==> 파워 케이블이 해외용이여서 모니터 켜지 못함(다음날 본사가서 받아옴)
3. 드라이버 없이도 조립 가능, 피벗, 엘리베이트 가능 ==> 상태 좋음  
--------------------------------------------------------------------------------------------------------------------------------

- 델 모니터(P2717H) 정보
1. 시리얼 넘버(S/N): CN-0H8W81-WS200-784-AC5B-A00
2. 익스프레스 서비스 코드(Express SVC Code): 14697858494
3. ServiceService Tag): 6R2Q472 
==============================================================================================================
 
 - USB 메모리 256 구입 
1. Sandisk정품 Ultra Fit USB 3.1 CZ430 256GB /130MB/s, 가격: 42,050원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=1478073576
==============================================================================================================
 
- USB 선풍기 구입
1. USB 앤틱 저소음 4인치 탁상용 선풍기 / 360도 / 4인치선풍기. 가격: 6,000원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=587114256
 1) 선풍기 크기 ==> 4인치: 148mm * 148mm *, 6인치: 192mm * 194mm
==============================================================================================================
  
- 입원시 준비물
1. 속옷(2벌), 세면도구(로션, 치약, 칫솔, 비누, 면도기, 빗, 수건 2개, 슬리퍼, 샤워 타월, 물병)
2. 핸드폰 충전기
3. 당뇨 관련 물품 ==> 약(인슐린), 검사 물품, 약 교체 물품
4. 어깨 보조기(루옌한테 가져 올라고 시킬 것)
==============================================================================================================
  
- 예스병원 입원(어깨 수술)[★]
11:20 중식
11:40 퇴근
12:00 도보(역삼동 삼성제일빌딩 --> 양재 최의원
12:30 진료(박황현 원장), 당화혈색소 검사: 5.7% 
		==> 인슐린 8병 구입, 당뇨병환자 소모성 재료 처방전 요청(7월초에 소모품 구입 하라고 함)		
13:30 종료
14:00 6411번 버스 탑승(군인공제회관/타워펠리스 정류장)
15:00 대림역 정류장
15:10 귀가
15:20 짐 정리
15:30 집 출발
16:00 예스병원 4층 ==> 입원 접수
16:10 603호 입원(6층)
16:30 혈액 검사, 소변 검사 ==> 폴대(수액주사, 진통제 주입용) 끌고 다님
17:30 석식 
17:45 도보(빌딩 후문 주차장)
18:30 종료
22:00 혈당 체크: 111U ==> 인슐린 펌프 제거, 금식
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.21(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 예스병원 입원(어깨 수술)[★]
06:40 기상
06:50 세면 
08:37 인슐린 약 교체(238U, 57U 남음)
08:55 이동식 침대로 지하 1층으로 내려감
09:10 지하 1층 수술실 마취 의사가 6층 간호사가 주사액 준비 지시 이행  안했다고 6층으로 다시 보냄 ==> 루옌 도착
11:00 5층에서 마취(목에 마취: 찌릿 함)
11:20 이동식 침대로 지하 1층으로 내려감
11:30 양성석 원장에 오른쪽 어깨에 굳은 부분 떼냄 ==> 수술 시작(수면)
14:00 수술 종료 ==> 어깨 보조기 착용
14:10 6층 입원실(깨어남) ==> 루옌 오줌 받아줌, 어깨 하나도 안 아픔(수술 잘 된 것 같음)
18:00 석식 ==> 루엔 귀가
18:45 도보(빌딩 후문 주차장)
19:30 종료
20:00 루엔, 수종 도착
21:30 루엔, 수종 귀가
22:00 녹두꽃 17회(33회, 34회) 시청 ==> 이전 회 19, 20회까지 시청함
23:00 종료
23:00 취침
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2019.06.22(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 예스병원 입원(어깨 수술)[★]
06:40 기상
06:50 머리 감기(삼푸실에서 비누로 왼손으로 감음)
07:30 조식
08:00 도보(빌딩 후문 주차장)
08:50 종료
09:00 5층 물리치료실 ==> 대기자가 많아서 11시에 오라고 함
11:00 5층 물리치료 ==> 오른 팔 들어 올리는 물리치료(150도) 20분 실시
11:20 종료
12:30 중식 
13:00 MRI 촬영(수술 후 결과 확인): 인슐린 펌프 제거
13:20 종료 ==> 인슐린 펌프 다시 착용
13:30 도보(빌딩 후문 주차장)
14:00 종료
15:00 C#으로 살아남기 동영상 시청
17:30 석식
18:00 도보(빌딩 후문 주차장)
19:00 종료
20:00 루엔, 수종 도착
21:30 루엔, 수종 귀가
22:00 녹두꽃 18회(35회, 36회) 시청
23:00 종료
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.23(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 예스병원 입원(어깨 수술)[★]
06:40 기상
05:20 머리 감기(삼푸실에서 비누로 왼손으로 감음)
05:40 수액 주사, 진통제용 폴대 제거 
07:30 조식
08:00 도보(빌딩 후문 주차장)
08:50 종료
09:00 C#으로 살아남기 동영상 시청
12:30 중식
13:30 도보(빌딩 후문 주차장)
14:00 종료
15:00 C#으로 살아남기 동영상 시청
17:30 석식
18:00 도보(빌딩 후문 주차장)
19:00 종료 
20:00 주사 바늘 빼기
23:00 취침
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2019.06.24(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 예스병원 입원(어깨 수술)[★]
06:40 기상
06:50 머리 감기(삼푸실에서 비누로 왼손으로 감음)
07:30 조식
08:00 도보(빌딩 후문 주차장)
08:50 종료
09:00 5층 물리치료 ==> 오른 팔 들어 올리는 물리치료(150도) 20분 실시
09:20 체혈
10:00 노카다 하다 허리 다친 아저씨 퇴원 ==> 3명 더 입원 함
11:20 종료
12:30 중식 
13:30 도보(빌딩 후문 주차장)
14:00 종료
15:00 C#으로 살아남기 동영상 시청
17:30 석식
18:00 도보(빌딩 후문 주차장)
19:00 종료
23:00 취침
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2019.06.25(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 예스병원 입원(어깨 수술)[★]
06:40 기상
06:50 머리 감기(삼푸실에서 비누로 왼손으로 감음)
07:30 조식
07:50 도보(빌딩 후문 주차장)
08:25 종료
08:30 진료(양성석 원장) ==> 회전근계파열 부분은 미세해서 다듬기만 했다고 함(핵심은 오십견, 충돌증후군 치료) 
		==> 내일 오전 퇴원하기로함
09:00 5층 물리치료 ==> 오른 팔 들어 올리는 물리치료(160도) 20분 실시
09:20 혈액검사, 소변검사 
11:20 종료
12:30 중식 
13:30 도보(빌딩 후문 주차장)
14:00 종료
15:00 C#으로 살아남기 동영상 시청 ==> 종료
17:30 석식
18:00 도보(빌딩 후문 주차장)
19:00 종료
20:00 루엔, 수종 도착 ==> 수종 생일 축하 카드 만들어 옴, 루옌 작은 케익 사옴
21:30 루엔, 수종 귀가 
23:00 취침
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2019.06.26(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 퇴원

- 예스병원 입원(어깨 수술)[★]
06:40 기상
06:30 머리 감기(삼푸실에서 비누로 왼손으로 감음)
06:54 인슐린 약 교체(239U, 22U 남음)
07:30 조식
07:50 도보(빌딩 후문 주차장) 
08:25 종료
08:30 진료(양성석 원장) ==> 6월 28일(금) 17시에 다시 진료 받기로 함
09:00 5층 물리치료 ==> 오른 팔 들어 올리는 물리치료(170도) 20분 실시
09:20 종료
09:30 오른쪽 어깨 상처 소독(방수 테이프 붙여줌: 10분 정도 샤워를 해도 괜찮다고 함)
10:10 4층 원무과 ==> 병원비(오른쪽 어? 수술, 입원비) 납부: 1,889,170원(소견서, 의료비상세내역영수증 받아옴)
10:20 종료
10:50 귀가(도보)
12:00 중식  
13:30 도림천로 도보 
13:30 엘마트 방문 ==> 밀크 플러스 900ml(우유, 2통): 수종
14:30 귀가
14:00 낮잠
17:30 기상
18:00 석식
18:40 도림천로 도보 
19:30 귀가
23:00 취침
==============================================================================================================
   
- 어깨 관절 내시경 퇴원 후 지침
1. 상처부위에 물이 닿지 않도록 주의. 소독은 2~3일에 한번씩 하기
2. 실밥제거는 수술 후 13~14일 사이에 외래 내원 시 제거(근처 병원에서 제거해도 됨)
3. 샤워는 실밥제거 후 2일 이후에 가능(목욕은 한 달 후 에나 가능)
4. 어깨 보조기는 수술 후 1~2주간 착용(침상에서는 제거하고 이동시 착용)
5. 퇴원 후 일상생활에 지장 없지만 2~3개월 간 무리하게 움직이거나 무거운 물건 들지 말 것
6. 퇴원 후 자가운동은 필수(하루 3회 이상, 30분씩)  ==> 전방거상, 외회전, 뒷짐지기
7. 통증은 더 했다 덜했다 할 수 있음
==============================================================================================================
  
- 신한은행 공인인증서 재발급
- 공인인증서 갱신[1년에 한번씩(5월)] ==> 은행용: yessign에서 발급[전용(일반)] @@@
 --> 신한은행 공인인증서 발급/재발급 ==> https://bank.shinhan.com/index.jsp#200101000000
01. 고객정보입력
이용자번호: TAMARIO
주민번호: 720625-1703411
02. 약관동의
03. 공인인증서갱신
고객명: 진태만
출금통장번호:110-437-783130(신한은행)                    통장비밀번호: 5***
04. 갱신완료   ==> s*p***5*1*@
-------------------------------------------------------------------------------------------------

- [신한은행 공인인증서] 스마트폰에서 PC로 복사하는 방법
1. 신한은행 메인 페이지 > 금융서비스 > 스마트뱅킹서비스 > PC → 스마트폰 인증서 복사
http://banking.shinhan.com/sandbox/index.jsp
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2019.06.27(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 11:00 ==> 

- 본사 대기[★]
- 교체한 LG 노트북 정보
1. 모델명: LG 15UD470-GX50K
2. 사양: RAM 8GB, SSD 256GB
3. LG전자 울트라PC 15UD470-GX50K ==> http://m.enuri.com/short/fpc4b, http://www.enuri.com/detail.jsp?modelno=15112376
==============================================================================================================
  
- 교체한 LG 노트북에 Window10(윈도우 10) Pro 설치
1. 김유진 대리에서 회사 USB 빌려서 설치 ==> Window10 정품 인증 안됨( Window10 Pro 정품 인증 처리 완료)
2. PIN  ==> 121212
==============================================================================================================
  
- Window10 Pro 정품 인증 방법
https://wardnam.tistory.com/100
1. 윈도우 점품인증이 확인하기
 1) Window10 Pro에서 왼쪽 아래 ①"돋보기 모양 검색버튼 클릭"  ②"정품인증" 입력 후 엔터"를 클릭  
 2) 윈도우10 점품 인증 되지 않은 분들은 빨간 글씨로 "인증을 받을 수 없습니다" 혹은 "받지 않았습니다" 라고 나옴
2. Window10 Pro 정품 인증 처리
 1) 검색창에 "CMD" 입력하면 "명령 프롬프트"가 검색 > "명령 프롬프트"우클릭해서 "관라자의 권한으로 실행"을 클릭
 2) "명령 프롬프트"에서
Microsoft Windows [Version 10.0.14393]
(c) 2016 Microsoft Corporation. All rights reserved.

C:\Windows\system32> slmgr/ipk W269N-WFGWX-YVC9B-4J6C9-T83GX     ---> 입력 후 엔터 @@@

C:\Windows\system32> slmgr /skms kms.digiboy.ir		---> 입력 후 엔터 @@@

C:\Windows\system32> slmgr /ato		---> 입력 후 엔터 @@@  
==============================================================================================================
  
- Windows 10 USB 부팅 디스크 만들기
1. 윈도우10 ISO 받기(/Win10_1703_Korean_x64.iso)  ==> 
Windows 10 다운로드(https://www.microsoft.com/ko-kr/software-download/windows10)에서 받기
 1) iso 받는 방법: 네이버에서 '윈도우10 다운로드' 조회 > '마이크로소프트에서 PC로 윈도우10 ISO 받기' 클릭
 > AMD 비쉐라 라이젠 사용자 모임 글 참조: http://cafe.naver.com/fx8300/71949
2. Rufus(rufus-2.15p.exe) 다운로드(Portable)  ==> https://www.techspot.com/downloads/6062-rufus.html
 1) rufus-2.15p.exe 실행 > rufus 2.15.1117(Portable) [새창]
  가. 먼저 USB 포터에 USB를 넣을 것
  나. 포맷 옵션: 부팅 가능한 디스크 만들기(ISO 이미지) 클릭 --> /Win10_1703_Korean_x64.iso 선택
  다. 파일 시스템: NTFS
  라. 새 볼률 레이블: 윈도우10 프로K
---------------------------------------------------------------------------------------------------------

- Windows 10 USB 부팅 디스크 다운로드 방법
1. https://www.youtube.com/watch?v=GdsB9mdAqwc
2. https://www.youtube.com/watch?v=zZfxcI5q27Y
3. 마이크로소프트에서 PC로 윈도우10 ISO 받기==> https://www.youtube.com/watch?v=7ttRWUlKkk0  
---------------------------------------------------------------------------------------------------------

- 윈도우10 정품인증
1. http://fatc.club/2017/03/01/173
1. http://charlesdepost.tistory.com/13
==============================================================================================================

- 크롬 폰트 변경  ==> https://rgy0409.tistory.com/2334
1. chrome 웹 스토어에서 Advanced Font Settings > Chrome에 추가 버튼: 클릭
https://chrome.google.com/webstore/detail/advanced-font-settings/caclkomlalccbpcdllchkeecicepbmbm
 1)  확장 프로그램(크롬 오른쪽 상단)에서 font[Advanced Font Settings] > 옵션: 클릭
 2) Advanced Font Settings(새창) ===> chrome-extension://caclkomlalccbpcdllchkeecicepbmbm/options.html
  가. Proportional fonts > Stamdard: 함초롱돋움 ==? 변경  
==============================================================================================================  

- 글꼴 크기, 해상도 설정
1. 내컴퓨터 > 디스플레이 설정(D) > 텍스트, 앱 및 다른 항목의 크기를 변경합니다.: 100%  ==> 설정함
 1) 고급 디스플레이 설정 > 해상도: 1920*1080(권장)  ==> 설정함
==============================================================================================================  

- 한컴오피스 2018 뷰어 (Windows 용) (통합뷰어) 다운로드
https://www.hancom.com/cs_center/csDownload.do  ===> HOffice_2018_Viewer.exe(함초롱돋움 설정됨)
==============================================================================================================  

- 내 Microsoft 계정(마이크로 소프트 계정)
https://account.microsoft.com/?ref=MeControl&lang=ko-KR&partnerId=msn&partnerDomain=www.msn.com&refd=www.msn.com
tamario@naver.com, hp태*16*01@
==============================================================================================================
  
- 아이폰 이어폰 구입
1. [인터파크] APE-100 이어팟 이어폰 마이크이어셋, 3개, 가격: 8,800원
http://www.enuri.com/detail.jsp?modelno=10803752&cate=&IsDeliverySum=N
http://shopping.interpark.com/product/productInfo.do?prdNo=2103466115
==============================================================================================================
  
- [도서] 지식경영 - 다산 정약용
http://www.yes24.com/Product/Goods/2299492?scode=032&OzSrank=1 
==============================================================================================================
  
- PC 조립
http://shop.danawa.com/virtualestimate/?controller=estimateShop&methods=index&marketPlaceSeq=16&fseq=19852486
--------------------------------------------------------------------------------------------------------------------------------

- 델 모니터(P2717H) 구입 예정
1. 델 P2717H 와이드모니터/리퍼, 가격: 223,500원
http://prod.danawa.com/info/?pcode=4375300&keyword=P2717H&cate=112757
http://xn--1-w30fr74e.com/product/productView.php?nProdCode=4375300&service_id=pcdn

- 델 모니터(P2717H) 구입[2018.01.16(화) 리퍼 제품 구입]
1. [미개봉반품] 델 P2717H 와이드모니터/리퍼, 가격: 248,000원 ==> http://storefarm.naver.com/intrix/products/2040277381 
==============================================================================================================

- Windows 10 다운로드 및 설치용 미디어(USB/DVD) 만들기
1. Window 10 Pro 설치
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2019.06.28(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 11:00 ==> 05:40 어깨 자가운동(20분): 실내에서 어깨 보조기 없이 생활

- 본사 대기[★]
- Window10 Pro 재설치
1. LG 노트북(LG 15UD470-GX50K)에 Window10 Pro 재설치
==============================================================================================================
  
- 어깨 수술 진료비 스캔(04:40, 집)
1. 2019년 어깨 치료 자료 스캔
2. 2019.06.21 어깨 수술 자료 스캔
==============================================================================================================
  
- 예스병원 진료(어깨 수술 후)
15:10 퇴근
15:20 선릉역.선정릉정문 정류장
15:35 6411번 버스 탑승
17:06 구로4동 우체국.고대 구로 병원 정문 정류장 하차
17:11 예스병원 4층 접수
17:30 어깨 소독(우성종 원장)
17:35 물리치료(전기 치료, 열 치료)
18:05 종료 ==> 어깨 보조기 다시 착용(안전판을 꺼꾸로 착용 했음)
18:15 다이소 남구로점 ==> 바가지, 도어 고정쇠(말발굽) 구입
18:40 귀가 
19:00 석식 
19:30 도림천로 도보
20:30 종료
21:30 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.29(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
07:00 종료
08:20 조식
09:40 도림천로 도보
10:10 다이소 대림2호점 ==> 9V 망간 건전지(현관문 비상시 열기), 전등 스위치 3구(안방 욕실 전등 스위치)
10:30 귀가 
10:40 어깨 자가운동(30분)
11:10 안방 전등 스위치 수리 ==> 새 것으로 교체
12:00 중식
12:30 도보 ==> 대림운동장에서 물 뜨러 감(물통, 물병 4개)
13:00 귀가
14:10 집출발(수종, 도보)
14:30 대림역 정류장(6411번 버스)
15:10 서울대 정류장
15:20 관악 도서관(1층: 수종 혼자서 책 봄)
16:00 관악 도서관(3층: 소설 구경)
16:20 종료
16:30 서울대 정류장(6511번 버스)
17:30 대림역 정류장
17:40 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종
18:00 종료
18:10 구로리 공원(수종)
19:20 종료 
19:30 귀가
21:15 어깨 자가운동(30분)
20:00 낮잠
21:50 취침(수종)
==============================================================================================================

- 전등 스위치 교체하기 [파인팀]
https://www.youtube.com/watch?v=KoGIGAy-ebg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.06.30(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 72.9kg, 16시 북미 정상 판문점 회동(문재인 대통령, 김정은 위원장, 트럼프 대통령)

- 주말2
05:40 기상
06:00 인터넷 서핑 ==> 야구 시청 
08:10 조식
09:00 도림천로 도보
09:40 귀가
10:00 휴식 
11:24 인슐린 약 교체(269U, 26U 남음)
11:30 어깨 자가운동(30분) ==> 루옌, 수종 놀러감
12:00 중식
13:00 도림천로 도보
13:50 귀가   
14:00 인터넷 서핑 ==> 축구 안 감
14:30 월말 결산
15:50 휴식
18:30 석식
19:00 도림천로 도보
19:50 귀가
20:00 인터넷 서핑
20:08 루옌, 수종 귀가
21:00 어깨 자가운동(30분)
21:30 취침(수종)
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
