

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------// Memo(2018.01) //-------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2018.01.01(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 새해 첫날

- 공휴일  
09:00 기상
12:00 중식 
12:20 루옌, 수종 언니집에 놀러 감
13:00 The K 손해보험 영업지원시스템 소스 정리 작업
17:20 종료
17:40 루옌, 수종 귀가
19:00 석식
23:50 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2018.01.02(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 신한은행 인터넷 예금 가입(신한 S드림 정기예금(온라인특별금리-2), 금리: 2.03%): 계동지점 방문

- The K 손해보험 영업지원시스템 구축 Prj[★]
- MiPlatform 소스 분석
============================================================================================================== 

- Websquare 로컬 서버 라이센스 만료 
1. http://localhDSt:8080/websquare/websquare.do ==> 실행 안됨: 구부장이 박대리에게 요정 
-----------------------------------------------------------------------------------------------

- Websquare license 추가(만료일: 2018.06.30)
1. /cbs/src/main/resources/home_websquare/Iicense/Iicense.xmI 파일에서
Ou3IXNIQzQldBM0FWPzhPV1RRVTFNN0U=
C8Crac51txmm97EjSVaWrHcGzo3jjdHR8JY3/64UB8aYuZqcb2BR()]i7hRmjpf6ksN35JdzY1F6cNA8M9kaDC4Y4I0U+ozdw07sPNHg=
==============================================================================================================

- Miplatform 라이센스 
1. USER: admin
2. COMPANY: admin 
3. KEY: ZlCH9-ZNQ5H-E6E3T-HGHNT-\NA4E(1Year: 2017.10 .01~2018.12.31) 
==============================================================================================================

- MS 워드(ms-word)에서 세로를 가로로 작성하는 법 
1. 홈 > 페이지 레이아웃 > 용지방향 > 세로[Enable], 가로[Enable]: 클릭 ==> 세로로 변경됨 
==============================================================================================================

- MS 워드(ms-word)에서 특수 문자(특수 기호) 삽입 ==> 상자 그리기 기호
1. ↓ ↑ → ← ☎ ★ ● ◆ ◈ ■ ▣ ▲ ▶ ♥ ♠ ㉿  ☞ ☜ Ω ①②③④⑤⑥⑦⑧⑨⑦
==============================================================================================================

- 디버깅(크롬)
1. 크롬 브라우저 > Fl2 > 소스에 debugger; 입력 후 로컬 서버(톰갯) 실행[Fl2 대신 Crl키 + Shift키 +i 누름]
 1) 디버깅시: 왼손 가운데 손가락(중지)을 F9에 넣고 디버깅할 것(약지: F8，검지: F10) 
  
Pause / Continue, F8: 멈춤 / 계속 
Step over, F10: 라인의 함수를 실행한다 
Step into, F11: 실행 라인의 코드에 함수가 있다면 함수 안의 첫 번째 코드로 진입해 들어가 다시 하나씩 라인별 코드를 실행한다. 
Step out, Shift + F11: Step into로 들어온 함수를 끝가지 실행하고 밖으로 나와 해당 함수를 실행한 함수로 돌아간다.  
Toggler breakpoints: 브렉포인트를 끄거나 켤 수 있음(소스 번호에 클릭하여 설정 -> F8 누르면 브렉포인트가 설정됨)
Pause on exception: 자바스크립트에 예외가 발생하면 해당 위치에 브렉포인트를 잡아준다. 
Capture async stack trace: 함수의 비동기 호출을 추적한다. 
==============================================================================================================

if(objld == "A1500_1_1_0") { 	// 13. 위험지역 출국(rad_A1500_1_1_0) radio 이면 
	console.log("[/CBSC129P.xml] [lfn_Search()] ==> [조회 처리] [TEST_30_1] [obj에 Ds 칼럼 담기] [i_번째]"+ i  
	+"[obj.Obj.getValue()]"+ obj.Obj.getValue() );
	debugger; 		// 디버깅 설정_01[/CBSC015M.xml] [lfn_Search()] ==> [조회] [TEST_91]	// TEST @@@ ===> 
}

if(i > 242) { 
	debugger; 	// ==> 최초에 디버깅이 걸리고 F8을 누르면 디버깅이 해제 됨  -> F8 대신 F10 이나 F11을 눌러야 함 @@@ 
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.01.03(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 주간보고서 작성(안해도 됨), 수춘이형에게 전화해서 초기회 탈퇴 결심 통보 함(20시) 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 개인청약설계(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) [M20170221889] 분석
==============================================================================================================
 
- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) ==> 수정 완료, 운영 반영 @@@ 
7. 질병2(가족사랑)[B230_Div7] (/CBSC172S.xml, ssr_sst::B230_Div7 _Pop.xml) [dev: M20180000087] 
 1) 실버보험 고지의무에서 월소득, 임신주 항목이 비활성화 됩니다 ==> 정상[test: M20170221882] 
 2) 추가[실버 건강 상품 추가(2402)]: 2018.01.03, by 진태만 
// if (parent.sGdCd == "2400" II parent.sGdCd == "2401" ) { 	// 실버건강 고혈압, 당뇨병, 임신, 소득: 비활성화 
if (parent.sGdCd == "2400" II parent.sGdCd == "2401" II parent.sGdCd == "2402") {	// 상품이 실버건강 상품이면  
	==> 질의[10.여성임신], 임신주[10.여성임신], 월소득(만원)[14.월소득]이 비활성화 처리  
	
	rad_A1100 _1_1_0.setDisabled(true); 	 	//  질의[10.여성임신]
	edt_A110 1_2_3_0.setDisabled(true); 		// 임신주[10.여성임신]
	medt_A1600_2_3_0.setDisabled(true);   	// 월소득(만원)[14.월소득]
}
============================================================================================================== 

- 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
indata["sGdCd"] = parentTab_Step1.DsWs_PrdAttr.getCeIlData(0, "GdCd"); 	// 상품코드 
- 단체 청약사항입력(/CBSC044S.xml, ssr_pln::B330_Div2.xml) 
indata["sGdCd"] = parentTab_Step1.DsWs_PrdAttr.getCeIIData(0，"GdCd"); 	// 상품코드 
- 연금 청약사항입력(/CBSC077S.xml, sr_pIn::C010_Div2.xmI)	==> 상품코드(sGdCd) 사용 안함 
- 계약상세내역조회(/CBSC028M.xml, psv_ens::D020.xml) 
indata.sGdCd=Ds_CntrDtl.getCeIiData(0, "sGdCd"); 		// 상품코드 2014.11.25 간병보험 적용을 위해 추가 
============================================================================================================== 

- 연금가입설계 2번 화면(/CBSC077S.xml, 55 _pln::C010_Div2.xml) 	==> 상품코드(sGdCd) 사용 안함 
- 진단심사대상조회(/CBSC106M.xml，ssr_sst::B240.xml) 				==> 상품코드(sGdCd) 사용 안함 
- 인수심사결재_인보험(/CBSC158S.xml, uwt_uwm::O210_Div1.xml)	 	==> 상품코드(sGdCd) 사용 안함 
- 인수심사결재_심사이력조회[O210_Pop2] (/CBSC160P.xml, uwt_uwm::O210_Pop2.xml) 	==> 상품코드(sGdCd) 사용 안함 
- 재물청약설계_청약사항입력(/CBSC096S.xml, ssr_pln::B030_Div2.xml) 	==> 상품코드(sGdCd) 사용 안 함
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.04(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:10 ==> 수춘이형에게 초기회 탈퇴 문자 보냄(8시), 22:30 ~ 02:00 ==> eclipse 경로, 메뉴 파일 작업 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 개인청약설계(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) [M20170221889] 분석 
1. 보험료산출Tab(/CBSC016S.xml, ssr_pln::B010_Div1.xml) 
============================================================================================================== 

- ReplaceText: 텍스트 파일 문자열 일괄 변경 프로그램
1. 다운로드 ==> http://www.ecobyte.com/replacetext
2, 사용법 ==> https://DSmanias.com/index.php?document_srl=683632&mid=software
 http://sheehan.tistory.com/368
 http://F10wingtime.tistory.com/entry/여러-문자열-일괄-변경바꾸기-프로그램
http://blog.naver.com/PDStView.nhn?blogId=ncloud24&logNo=221054074230&redirect=Dlog&widgetTypeCall=true
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.05(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 배 탈(중식 대신 죽 먹음), 오후에 피곤해서 계속 잠 만 잠 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 개인청약설계(/CBSC0l5M.xml, 청약메인(ssr_pln::B010.xml)) [M20170221889] 분석 
1.	보험료산출Tab(/CBSC016S.xml, ssr_pln::B010_Div1.xml) 
2.	청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.06(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==>

- 주말
08:00 기상
08:10 The K 손해보험 영업지원시스템 소스 정리 작업
10:30 종료
12:00 중식 
12:20 대림역(6511번 버스, 수종)
13:10 서울대 정류장 도착 
14:30 관악도서관(1층, 수종)
14:40 관악도서관(3층)
15:00 종료
15:30 서울대 정류장 도착 
16:20 대림역(6511번 버스, 수종)
16:40 귀가
19:00 석식
23:50 취침
============================================================================================================== 

- 복사금지 해제(spell)
http://testtest2016.tistory.com/400
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.07(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==>

- 주말
08:00 기상
08:40 루옌 친구 회사(모바일)에 아르바이트 감
08:50 집출발(자전거)
09:00 대동초교 ==> 대호 초기회 축구 구경
10:40 종료
10:40 대동초교 출발(자전거)
10:40 안양천 합수부(한강) ==> 발 시럽고 엉덩이 아픔 
11:20 대림역 ==> 다리에서 쥐가 날려고 함
12:00 중식(짜장면, 곱빼기: 4천원) ==> 남구로 시장 왕짜장 반점
13:20 귀가
14:00 낮잠
16:20 기상 ==> 모르는 핸드폰으로 전화 옴(통화 차단 처리함)
		==> 수종이가 아이패드 유투브 안 나온다고 함(아이툰 문제)
17:00 루옌 귀가
19:00 석식(볏짚 삼겹살: 3인분, 도시락, 공기밥 2): 33,500 ==> 준수네고기 생각
20:00 종료
20:30 다이소 대림점
16:40 귀가
23:50 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.08(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 최종 퇴실(기록 작성)

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 개인청약설계 (/CBSC015 M.xml, 청약메인(ssr_pln::B010.xml)) [M20170221889] 분석 
1.	보험료산출Tab(/CBSC016S.xml, ssr_pln::B010_Div1.xml) 
2.	청약사항입력Tab(/CBSC0l7S.xml, ssr_pln::B010_Div2.xml) 
============================================================================================================== 
 
- Memo 작업
1. Memo(2017.09), Memo(2017.10), Memo(2017.11), Memo(2017.12)
============================================================================================================== 

- OCR 처리 후 Search_Replace Table 작업
°1 	--> 0)
>  		--> > 
l			--> / 
씀			--> 쏨
호|	--> 회
잠석		--> 참석
, 		--> , 
，			--> , 
’			--> '
= =		--> == 
U			--> (/
== > 	 --> ==>
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.09(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 연금청약설계 (/CBSC075M.xml, ssr_pln::CO .... O.xml) [M20180000032] 분석 
1.	보험 료산출Tab(/CBSC076S.xml, ssr_pln::B010_Div1.xml) 
2.	청약사항입력Tab(/CBSC077S.xml, ssr_pln::B010_Div2.xml) 
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.10(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 구부장 은행연합회[ProWeb(티맥스S) -> nexa] 방문(09시), 연세정형외과 전화(토, 10시 진료)
								, 석식(뒷고기, 한미옥 식당: 구부장, 이부장 ==> 구부장이 쏨) 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 파일 업로드, 다운로드 분석 
1. 공지사항[cbso005M] ==> 파일 다운로드 
 1) 공지사항등록(/CBS0006P.xml) ==> 파일 업로드
============================================================================================================== 

- 인수제한사유조회 [B080_Pop] (/CBSC085P.xml, ssr_pln::B080_Pop.xml) ==> 수정 완료, 운영 반영 @@@
1. 피보험자누적한도 조회 버튼 추가 ==> 피보험자 누적[B290_Pop] (/CBSC128P.xml) 
 1) MP 개발 완료: 2018.01.05(금) 한상욱 차장
 2) 소스 적용: 2018.01.08(월)
 3) 개발 완료: 2018.01.09(화)
============================================================================================================== 

- 피보험자 누적 [B290_Pop] (/CBSC128P.xml, ssr_sst::B290_Pop.xml) 
1. 피보험자 주민번호가 2개 일때 에러 발생 ==> sel 칼럼이 체크된 것만 주민번호(1개)만 선택 되도록 수정 처리
wconv.copy(Ds_Pibo, parent_Ds_Pibo); 	// 피보험자 정보 Ds 복사 
wconv.clear(Ds_Pibo ); 		// 피보험자 정보 Ds clear ==> 추가: 2018.01.10, by 진태만 
Ds_Pibo.setRowJSON(0, parent_Ds_Pibo.getRowJSON (nRow)); 		// sel 칼럼이 체크된 것만 복사 
// 추가: 2018.01.10, by 진태만 
// console.log("[/CBSC128P.xml] [init()] ==> [parent_Ds_Pibo_갯수_41]"+  parent_Ds_Pibo.getRowCount()
+"[parent_Ds_Pibo]"+ WebSquare.xml.serialize(parent_Ds_Pibo.getAIIXML()) );
반영 여부 확인 ==> https://sales.thek-portal.com/ui/cbsc/CBSC085P.xml
반영 여부 확인 ==> https://sales.thek-portal.com/ui/cbsc/CBSC128P.xml
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.11(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 중식(닭매운탕, 와룡동 닭매운탕: 구부장, 이부장, 근욱씨) ==> 구부장이 쏨

- The K 손해보험 영업지원시스템 구축 Prj[★]
- 파일 업로드, 다운로드 분석 
1. 공지사항[cbso005M] ==> 파일 다운로드 
 1) 공지사항등록(/CBS0006P.xml) ==> 파일 업로드
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.12(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 강명수 차장 철수(10시) 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- WS5_SAMPLE 분석 
============================================================================================================== 

- PDF 출력
1. ezPDF Editor 3.0 다운로드 ==> http://ginapd.tistory.com/447
2. PDF 변환 프로그램의 최강자 '파인리더14' ==> https://blog.naver.com/retiaocr/221084135096
============================================================================================================== 
 
- Memo 작업(23시 ~ 09시)
1. Memo(2017.09), Memo(2017.10), Memo(2017.11), Memo(2017.12)
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.13(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 철야

- 주말
09:30 집출발(루옌, 수종, 장인)
10:20 연세정형외과의원(구로구청 근처) 도착
10:30 진료(장인 허리 아픔), X-ray 촬영
		==> 허리 인대가 늘어 났다고 함(허리 디스크는 아님) --> http://tip.daum.net/question/50969500 
10:40 종료
11:00 삼성전자서비스 구로 휴대폰센터 방문 ==> 핸드폰(삼성 갤럭시 노트5)에 에러 발생
		"업로드 5회 실패하여 업로드를 중단합니다." --> 수리 기사도 해결 못함
11:40 종료
11:50 구로구청(6511번 버스, 수종)
13:50 서울대 정류장 도착 
13:10 중식(부페, 수종): 관악도서관 1층 식당(2명 6천원)  --> 밥만 먹고 귀가 
14:30 종료
15:00 서울대 정류장 도착 
16:00 대림역(6511번 버스, 수종)
16:10 귀가
19:00 석식
============================================================================================================== 

- Memo 작업(23시 ~ 08시)
1. Memo(2017.09), Memo(2017.10) ==> 작업 완료 @@@
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.14(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 철야

- 주말
09:00 취침
17:20 기상
19:00 석식 
============================================================================================================== 

- Memo 작업(23시 ~ 05시)
1. Memo(2017.11) ==> 작업 완료 @@@
============================================================================================================== 

- 네이버 가계부 flash 에러
1. 현상: 접속하신 기기에서는 플래시(flash)를 지원하지 않아 해당 기능을 이용하실 수 없습니다.
2. 조치: 플래시 플레이어 삭제 후 재설치
 1) 플래시 플레이어 삭제 방법
PC 제어판> 프로그램 추가/제거> Adobe Flash Player와 관련된 프로그램 제거
프로그램 제거가 완료되면 열려 있는 인터넷 익스플로러 창을 모두 종료 후 
프로그램 추가/제거로 접속하여 Adobe Flash Player Active X 항목이 없는지 확인해주세요.
삭제가 완료되었다면, 아래의 링크로 접속하여 플래시를 재 다운로드 하신 뒤 
네이버 가계부로 접속해 보시길 권해드립니다.
플래시 플레이어 다운로드 ==> https://get.adobe.com/flashplayer/?loc=kr
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.15(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==> 대중교통 미세먼지 할인(무료), Memo(2018.01).doc(6P), 기타 자료 출력해서 퇴근

- The K 손해보험 영업지원시스템 구축 Prj[★]
- WS5_SAMPLE 분석 
1. 영업지원S 로그인Ulogin.xml) 사용하여 로그인 처리 ==> 완료 @@@ 
 1) 사번: ipxJogin, PW: ipx_passwd에서 사번: ibx_EmpCd, PW: sct_Password로 변경 
============================================================================================================== 

- 공지사항[CBS0005M] DB 분석 
1. 공지 사항등록(/CBS0006P.xml)
============================================================================================================== 

- 개인 PC 비밀번호 설정(윈도우7 PC에서 사용자계정 변경하는 방법) 
1.	"윈도우 패스워드 설정기간이 90일 지났으니 변경하세요"라는 알람이 뜸 
2.	패스워드 설정 ==> 제어판￦사용자 계정 및 가족 보호￦사용자 계정 > Windows 암호 변경 >  암호 변경 
 1) http://10.1.1.195/cwp/faces/mainFramejsp
 2) educar(사용자) / a*s*l *2@ 			--> 2017.10.21(토) 변경 처리 
 3) educar(사용자) / zx**qw**12**@ 	--> 2018.01.15(월) 변경 처리  
============================================================================================================== 

- 보험계약정보조회[B250_Pop] (/CBSC056P.xml, ssr_pln::B250_Pop.xml) ==> 수정 완료, 운영 반영 @@@ 
1. /CBSC056PController.java 파일에서 CBSC056PContr에er_TEST() 함수에 주민번호 존재==> 함수 제거) 
C:￦TheKStudio￦workspace￦cbs￦target￦classes￦com￦thek￦cbt￦contract￦controller/CBSC056PController.class
============================================================================================================== 
 
- 개인청약사항조회(/CBSC014M.xml, 청약사항조호l(ssr_pln::B120.xml)) ==> 수정 완료, 운영 반영 @@@ 
// medt_Str.setVaIue("6603262-*"); 		// 계약자코드: 주민번호 존재 ==> 제거 
https://sales.thek-portal.com/uifCBSC/CBSC014M.xml 
============================================================================================================== 

- Memo 작업(22시 ~ 01시)
1. Memo(2017.12) 
============================================================================================================== 

 ■■■■■■■■■■■■■■■■■■ 2018.01.16(화) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 델 모니터 구입(17시, 구로3동)

- 웹스퀘어5 퍼블리셔 교육(10시, 인스웨이브) [★] 
2.WebSquare 디자인 기본, 심화 교육 (1일차) 
2.1.웹스퀘어 5 스튜디오 설치 및 소개 
2.2.컴포넌트 분류 및 소개  
2.3.컴포넌트 스타일 변경 
==> tagname: p, span
==> 접근성 프로젝트는 어려움(그 외엔 몇번 해보면 배울 수 있음)
============================================================================================================== 

1. 프로젝트 생성
>> 프로젝트: 마우스 우 클릭 > New > Websquare Project > Project: test 
2. 파일 생성
>> 프로젝트: 마우스 우 클릭 > New > Websquare Page > WebSquare.xml
-------------------------------------------------------------------------------------------------------

- 파일 생성 후 Websquare Studio 멈춤
1. 방화벽 에러로 멈춤
============================================================================================================== 

- Websquare Studio 라이선스(만료일: 2018.02.28)
0JG3vSkw+TjcwU1AxWkFVR0c3UFpPNDE=
N3OhG27O+48zzTnwqdbdbkMDTa7SFnraEMwUpl/GU9kHNphtxqp1FY6gvPVEYc7grwSKfHV
PE6tIN3h9KD3RDIlEfCwBhoEoiLCUxI=45
============================================================================================================== 

- 출석 등록
1. 과정명: 웹스퀘어5 퍼블리셔 과정
2. 일정: 2018.01.16 ~ 2018.01.17
3. 회사명: (주)지아이데이타
4. 프로젝트명: 더케이손해보험 영업관리 시스템 구축
5. 등록키: 0116
==> http://edu.inswave.com/att.do
============================================================================================================== 

- 델 모니터(P2717H) 구입(17시, 구로3동)
1. [미개봉반품] 델 P2717H 와이드모니터/리퍼, 가격: 248,000원 ==> http://storefarm.naver.com/intrix/products/2040277381
2. 델 모니터 케이블: VGA 케이블, 파워 케이블 2개만 필요함(하지만 보니터에 있는 USB 이용시 USB 케이블 연결해야 함) 
==> 파워 케이블이 해외용이여서 모니터 켜지 못함(다음날 본사가서 받아옴)
3. 드라이버 없이도 조립 가능, 피벗, 엘리베이트 가능 ==> 상태 좋음  
-------------------------------------------------------------------------------------------------------

- 델 모니터(P2717H) 정보
1. 시리얼 넘버(S/N): CN-0H8W81-WS200-784-AC5B-A00
2. 익스프레스 서비스 코드(Express SVC Code): 14697858494
3. ServiceService Tag): 6R2Q472 
============================================================================================================== 

- Memo 작업(22시 ~ 01시)
1. Memo(2017.12) ==> 작업 완료 @@@
============================================================================================================== 

- 01. TheK 전환 Prj 작업(22시 ~ 01:40)
1. 01. TheK 전환 Prj( ~ 8P)
============================================================================================================== 

■■■■■■■■■■■■■■■■ 2018.01.17(수) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 11:20 ==> 종료 보고(17시, 종로)

- 웹스퀘어5 퍼블리셔 교육(10시, 인스웨이브) [★] 
3. WebSquare 디자인 실습 교육 (2일차)
 1) 화면 그리기 교육
 2) 실습
---------------------------------------------------------------------------------------------------------

- Snippets(스니핏)
1. 컴포넌트의 단위
2. 참조 ==> UDC
---------------------------------------------------------------------------------------------------------

- URL 설정
>> 프로젝트: 마우스 우 클릭 > Properties of test(새창) > WebSquare > NakformedURL(새창)
1. Preview Info
 1) Preview TYPE: Locla Engine(로컬 설정),  Use Other Web Application Server(서버 설정)
============================================================================================================== 

- 델 모니터(P2717H) 셋팅(11:40 ~ 12:20)
1. 파워 케이블(해외용 케이블이 와서 판매점(인투릭스 시스템 본사)에 다시 가서 받아옴
2. 델 모니터 셋팅 완료(패널 하단에 틈이 벌어진 것 외엔 상태 좋음)
============================================================================================================== 

- 01. TheK 전환 Prj 작업(14시 ~ 18시)
1. 01. TheK 전환 Prj(18P ~ 43P)
============================================================================================================== 

- 종료 보고 회식
18:00 집출발
18:10 대림역(대중교통 미세먼지 할인(무료)) 
19:00 안국역
19:10 재동맷돌순두부(고객(안준영 차장, 김은주 과장), 팀장, 고객PM, PM, 구부장, 이부장, 근욱씨, 오사장)
		==> 삼겹살: 프로젝트 좋게 잘 끝났다고 함(구부장이 칭찬 많이 들음)
22:00 종료FF
22:10 맥주집
23:30 종료
23:40 안국역(지하철에서 졸다가 봉천역까지  갔다가 막차 타고 다시 대림역으로 되돌아옴)
24:30 귀가
23:50 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■ 2018.01.18(목) 작업 ■■■■■■■■■■■■■■■■■
--> 07:00 ~ 20:30 ==> 대중교통 미세먼지 할인(무료) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- WS5_SAMPLE 분석
==============================================================================================================
 
- 더케이손해보험 영업지원시스템 사업 현황
1. 사업명: 영업지원시스템 구축
2. 구축기간: 2017. 07. 10 ~ 2018. 01. 24(계약일로부터 6.5개월)
3. 세부내용: 
 Miplatform을 Websquare으로 전환, sybase DB, Pro works, 퓨전 챠트, 보험청약설계
============================================================================================================== 

- 청약심사대상조회(/CBSC111M.xml, ssr_sst::B160.xml) 수정
1. 대리점일 경우 처리
if (sAgncYn == "Y") {		// 대리점 이면{vsAgncYn: 대리점 여부)
	smask = "######-#******";
	// if (wconv.Length(sInrpsCd) == 10) {	// 피보험자코드가 10 자리 이면 ==> 주석 처리
	if (wconv.length(sInrpsCd) == 10) {	// 피보험자코드가 10 자리 이면
		smask = "###-##-*****";
	}
	return gfn_convert_mask(sInrpsCd, smask);
}	
============================================================================================================== 

■■■■■■■■■■■■■■■■■ 2018.01.19(금) 작업 ■■■■■■■■■■■■■■■■■
--> 07:00 ~ 20:30 ==>  

- 일본 히스콤 H-PLM 전환 Prj[★]
1. XP ==> Nexcro로 전환
2. 2월 8일(목)까지 개발 완료 해야 된다고 함
3. http://www.hiscom21.com
4. 한승완(010-6656-8040, hanaoro@gidata.co.kr) 대리에게 인수인계 받음
============================================================================================================== 

- nexacro 서버 라이센스 에러
1. 현상:
com.nexacro.xapi.license.InvalidLicenseException: License has expired: expireDate=2018-01-01, currentDate=2018-01-20
	at com.nexacro.xapi.license.A.H.I(Unknown Source)  
2. 조치: http://support.tobesoft.co.kr/Next_JSP/nexacroHome/index.html#에서 2달 라이센스 파일
(nexacro14_server_license.xml)을 받아서 eclise에 C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\lib 폴더에 
붙여넣기
==============================================================================================================

- XPLATFORM 소스
C:\00. TAMA Home\02. TAMA Project\2018.01(히스콤 H-PLM 전환 Prj)\projects\workspace\moms_Nexa\src\B-XPLATFORM\moms
============================================================================================================== 

trace("[/form_paging.xfdl] [btn_sel_OnClick()] ==> [TEST_01" ); 
trace("[/TI10302.xfdl] [btn_sel_OnClick()] ==> [url]"+ url +"[url_02]"+ url ); 
==============================================================================================================

- Console 설정(Run/Debug) ==> ecispe에서
1. Standard Out text color: 초록
2. Standard Error text color: 빨간
3. Standard In text color: 노란 
4. Backgroudn color: 검정 
============================================================================================================== 
 
- Notepad++에서 빨간줄 없애는 방법
1. 상단 메뉴창에서 플러그인을 열어준다.    
2. Dspellcheck   
3. Spell Check Document Automaticly: 체크 해제
---------------------------------------------------------------------------------------------------------

- Notepad++에서 타일 설정
상단 메뉴 > 설정(T) > 스타일 설정(새창)
1. 언어: Global Styles
2. 타일: Global override
3. 색상 스타일 
 1) 글자색: black		 		==> 전역 글자색 사용
 2) 배경색: 72, 225, 194	==> 전역 배경색 사용 
4: 글꼴 스타일(글꼴 변경)
 1) 글꼴 이름: 함초롬돋움	 ==> 전역 글꼴 사용
 2) 크기: 10		 			==> 전역  글꼴 크기 사용
 ==>  저장 후 닫기
---------------------------------------------------------------------------------------------------------

- 맘에 드는 폰트 함초롬돋움 + 크롬 글꼴 고정하기 
1. http://eslife.tistory.com/799 
============================================================================================================== 
 
- GIDATA 무선 네트워크 속성(와이파이)
1. 보안 종류(E): WPA2-개인
2. 암호화 유형(N): TKIP
3. 네크워크 보안 키(K): gidata1107
============================================================================================================== 
  
- 네이버 가계부(크롬) 플래시 오류 해결 방법 
1. https://blog.naver.com/knh_0313/221176256898
==>  chrome://settings/content/flash
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.20(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>

- 주말
04:00 기상
05:50 집출발
06:00 대림역(6411번 버스)
07:00 선릉역
07:10 귀가
07:20 일본 히스콤 H-PLM 전환 Prj 분석
12:00 중식(셀러드 김밥, 설렁탕): 청구할 것 
13:00 일본 히스콤 H-PLM 전환 Prj 분석
18:00 퇴근
18:30 석식(참치 김밥, 갈비찜): 청구할 것
19:00 종료
20:00 퇴근
22:50 취침
============================================================================================================== 

- 일본 히스콤 H-PLM 전환 Prj[★]
1. 소스 분석 
============================================================================================================== 

- 일본 히스콤 H-PLM 전환 Prj 서버 실행 방법
A. PC 버전 실행 ■■■
1. Nexcro에서 설정
 1) ADL: moms_Nexa: 마우스 우 클릭 >
Set as Aactive ADL: 클릭
 2) 상단 > Options: 클릭 > Options(새창)
  가. Environment
   ==> General: 클릭
0. Working Folder ==> C:\Users\Administrator\Documents\nexacro\projects
   ==> Build: 클릭 		
1. Generate path ==> C:\projects\workspace\moms_Nexa\WebContent								==>  Runtime 실행[★]
1. Generate path ==> C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa2		==>  서버(Tomcat) 실행 [★]
2. Base Lib Path ==> C:\projects\workspace\moms_Nexa\src\moms_Nexa\nexacro14lib
3. 서버 실행 ★★★
 1) 이클립스에서 Tomcat 서버 실행 
 2) Nexcro에서 Runtime 실행: Ctrl + F5
 3) 웹 서버(Tomcat) 실행: C:\projects\tomcat\apache-tomcat-7.0.64\bin ==> startup.bat: 클릭(서버 실행)
http://192.168.0.30:8080/moms_Nexa2/moms_Nexa/index.html
 ===> 이클립스에서 Tomcat 서버 실행 후 웹 서버(Tomcat)를 실행 하면 Session expired 에러가 남

ping  192.168.0.11 ==> 회사내 서버
ping  192.168.0.17 ==> 옆 HP 노트북(GI/GI)
ping  192.168.0.30 ==> TAMA HP 노트북(GI/GI)
---------------------------------------------------------------------------------------------------------

- eclipse 실행 에러
1. 현상:
  심각: Exception sending context initialized event to listener instance of class org.springframework.web.context.ContextLoaderListener
org.springframework.beans.factory.CannotLoadBeanClassException: Cannot find class [jp.co.hiscom.web.moms.model.ModelScannerConfigurer] for 
bean with name 'jp.co.hiscom.web.moms.model.ModelScannerConfigurer#0' defined in ServletContext resource [/WEB-INF/app-context.xml]; 
nested exception is java.lang.ClassNotFoundException: jp.co.hiscom.web.moms.model.ModelScannerConfigurer
	at org.springframework.beans.factory.support.AbstractBeanFactory.resolveBeanClass(AbstractBeanFactory.java:1262)
	
2. 원인:  빌드 안됨 ==> Project > clean 하면 아래 경로의 class가 삭제됨 
C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\classes\jp\co\hiscom\web\moms\model 
C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\classes
- 오토 빌드 안됨 @@@
C:\00. Back_up\projects\workspace\moms_Nexa\WebContent\WEB-INF\classes
3. 조치: 김현규 부장에게 문의할 것
============================================================================================================== 

- Runtime 실행 에러
1. 현상:
uxs (9852): SE 17:14:57:535 요청한 경로에서 문서를 찾을 수 없습니다.
 주소가 정확한지 확인하고 다시 시도하십시오. 
2. 원인: 
============================================================================================================== 
 
B. Mac ipad용 실행 ■■■
2. Nexcro에서 설정
 1) ADL: moms_Nexa_tab: 마우스 우 클릭 > Set as Aactive ADL: 클릭
 2) 상단 > Options: 클릭 > Options(새창)
  가. Environment
   ==> Build: 클릭
1. Generate path ==> C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa2		==>  ipad용 path 행 [★]
2. Base Lib Path ==> C:\projects\workspace\moms_Nexa\src\moms_Nexa\nexacro14lib
==> “Generate Application” 메뉴 실행
3. 서버 실행 ★★★
 1) 이클립스에서 Tomcat 서버 실행 
  가. Runtime: Ctrl + F5
  나. HTML5 웹: C:\projects\tomcat\apache-tomcat-7.0.64\bin ==> startup.bat: 클릭(서버 실행)
 
4. MAC에서 넥사크로 런처(xcode) 실행 ★★★
5. Mnexacro 소스를 수정 했을 경우 
 1) TypeDefinition의 update를 클릭한 후 상단의 updateurl과  하단의 Archive00.zip 버전을 올려줘야 함
 ==> ios를 실행하기 위해서는  C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa_tab 파일 삭제
 (/nexacro14lib.zip 파일은 절대 삭제 금지)
6. Generate Application 메뉴 실행 
7. Archive > Make Application Archive 메뉴: 선택 > Make Application Archive(새창)
 1) Location
   가. Output Path: C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa_tab
   나. Target Path: C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa2\moms_Nexa
  2) Bootsrap
   가. iOS(체크) > Project URL: http://192.168.0.30:8080/moms_Nexa_tab/   ===> 중요[★]
  3) Files
   가.  Archive00(생성) > mons_Nexa(모든 파일 체크)
8. 파일 생성
 1) C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa_tab 폴더에  5개 파일 생성 확인 
9. Ma에서 Finder -> 다운로드 -> nexa14iOSLanucher -> nexa14iOSLanucher.xcodeproj 실행
 1) nexa14iOSLanucher -> SampleProject -> AppDelegate.m 선택
   가. 소스 내용중 URL 이 아래와 같은지 확인 ==>  “http://192.168.0.30:8080/moms_Nexa_tab/start_ios.json”
10. XCODE 화면 좌측상단 빨/노/녹 아이콘 옆에 있는 시뮬레이터를 ‘iPad Air 2’로 선택
11.  XCODE 화면 좌측상단 빨/노/녹 아이콘 옆에 있는 삼각형의 실행버튼 클릭
============================================================================================================== 

- 웹 서버(Tomcat) 실행 에러
1. 현상:
 1) 웹 서버(Tomcat) 실행 ==> http://192.168.0.30:8080/moms_Nexa2/moms_Nexa/index.html
  2) http://192.168.0.17:8080/moms_Nexa/dispatcher/systemproperty/SystemPropS/getSystemProps net::
  ERR_CONNECTION_REFUSED 	Platform_HTML5.js:3909 SE 16:26:59:706 요청 오류입니다.   
2. 원인: 옆 HP 노트북 IP(192.168.0.17)를 내  HP 노트북 IP(192.168.0.30)변경 했는데로 에러가 안 없어짐 
3. 조치: 일단 옆 HP 노트북(GI/GI)를 사용하여 테스트 할 것
http://192.168.0.17:8080/moms_Nexa2/moms_Nexa/index.html
3. 조치2: Generate path 변경 후 빌드
1. Generate path: C:\projects\tomcat\apache-tomcat-7.0.64\webapps\moms_Nexa2 	==>  서버(Tomcat) 실행 [★]
============================================================================================================== 

- nexacro 서버 라이센스 에러
1. 현상:
com.nexacro.xapi.license.InvalidLicenseException: License has expired: expireDate=2018-01-01, currentDate=2018-01-20
	at com.nexacro.xapi.license.A.H.I(Unknown Source)  
2. 조치: http://support.tobesoft.co.kr/Next_JSP/nexacroHome/index.html#에서 2달 라이센스 파일
(nexacro14_server_license.xml)을 받아서 eclise에 C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\lib 폴더에 
붙여넣기
============================================================================================================== 

- 톰캣 실행시... (startup.bat) 창이 열리다 닫힙니다.
1. 점검: 문제 확인을 위해 cmd 창에서 start.bat 를 실행해본다. 
D:\dev_repacat\server\apache-tomcat-8.0.36\bin> startup.bat 
Neither the JAVA_HOME nor the JRE_HOME environment variable is defined
At least one of these environment variable is needed to run this program
2. 조치: 윈도우 시스템 변수에서 JAVA_HOME 을 설정해준다. 
 1) 설정 > 시스템 > 정보 > 시스템 정보 > 고급 시스템 설정 > 환경변수 
JAVA_HOME ==> C:\projects\jdk1.7.0_51 
 2) 확인: > set JAVA_HOME
============================================================================================================== 

- 모니터 화면 분할 관리 프로그램
1. WinSplit Revolution(윈스플릿 레볼루션) ==> http://090501.tistory.com/83
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.01.21(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==>

- 주말
12:30 기상
12:40 중식 
13:20 대림문화 서관 방문(자전거): 수종
13:40 회원 가입
14:20 구로 도서관 방문(자전거): 수종
15:00 구로리 공원
16:40 종료
16:50 석식(치즈돈까스): 수종
17:40 귀가
18:20 이마트 구로점
18:30 로지텍 무선콤보 MK240 NANO WHITE(키보스, 마우스) ==> 가격: 19,900원(키스킨 없음)
19:00 귀가
23:50 취침
============================================================================================================== 

- 안양 눈썰매장 모바일 티켓 2장 구입
01 눈썰매 +눈놀이장 기준가, 가격: 13,000원(2명), 유효 기간: 2017.12.23 ~2018.02.18
https://search.naver.com/search.naver?where=nexearch&sm=top_hty&fbm=1&ie=utf8&query=MK240+NANO
============================================================================================================== 

- 로지텍 무선콤보 MK240 NANO
1. 이마트 구로점에서 구입, 가격: 19,900원(키스킨 없음)
https://search.naver.com/search.naver?where=nexearch&sm=top_hty&fbm=1&ie=utf8&query=MK240+NANO
============================================================================================================== 

- 영등포 대림문화도서관 방문 ==> 회원 가입
============================================================================================================== 

■■■■■■■■■■■■■■■■■ 2018.01.22(월) 작업 ■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:30 ==>

- 일본 히스콤 H-PLM 전환 Prj[★]
- 일본 고객에게 이메일 보내기
1. ysawada@hiscom.co.jp, twatanabe@hiscom.co.jp, tsugimoto@hiscom.co.jp에게 메일 보내기
============================================================================================================== 

1. No.  64 결함(sei_kiki_irai.xfdl: Tab 스크롤이 발생)
 1) sei_kiki_irai_tab_comment.xfdl
 trace("[/sei_kiki_irai.xfdl] [shu_kosyou_irai_onload()] ==> [TEST_01]" ); 
============================================================================================================== 

1. No. 67 결함(shu_kosyou_irai.xfdl: 날짜 초기화)
(Menu: 4-8)  設置?撤??移動?玉突?交換?績登?[설치.철수.이동.옥돌.교환실적등록]
this.shu_kosyou_irai_onload = function(obj:Form,e:nexacro.LoadEventInfo)
{ 
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [TEST_01]" ); 
	
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [listRow]"+ listRow ); 
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [01. gdsLang, 조회수]"+ application.gdsLang.getRowCount()  
	+"[gdsLang.saveXML()]  \n"+ application.gdsLang.saveXML() ); 	// global gds 메뉴 정보 조회 @@@
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [01. dsParam, 조회수]"+ this.dsParam.getRowCount() 
	+"[dsParam.saveXML()]  \n"+ this.dsParam.saveXML() );  		// gds 조회 @@@
}
============================================================================================================== 

- eclipse 실행 에러
1. 현상:
  심각: Exception sending context initialized event to listener instance of class org.springframework.web.context.ContextLoaderListener
org.springframework.beans.factory.CannotLoadBeanClassException: Cannot find class [jp.co.hiscom.web.moms.model.ModelScannerConfigurer] for 
bean with name 'jp.co.hiscom.web.moms.model.ModelScannerConfigurer#0' defined in ServletContext resource [/WEB-INF/app-context.xml]; 
nested exception is java.lang.ClassNotFoundException: jp.co.hiscom.web.moms.model.ModelScannerConfigurer
	at org.springframework.beans.factory.support.AbstractBeanFactory.resolveBeanClass(AbstractBeanFactory.java:1262)
	
2. 현상2: 빌드 안됨 ==> Project > Clean 하면 아래 경로의 class가 삭제됨 
C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\classes\jp\co\hiscom\web\moms\model 
C:\projects\workspace\moms_Nexa\WebContent\WEB-INF\classes
 
3. 조치: 김현규 부장에게 문의할 것 ==> Clean 일본쪽 소스니깐 절대 건들지 말 것
==> ecipse에서 java 빌드 안됨((주)투비소프트 원격지원 받음)
4. 원인: nexacro14_server_license.xml 파일을 Build Path에 잡으면 안됨
5. 조치2: nexacro14_server_license.xml 파일을 Build Path에서 제외 처리
============================================================================================================== 

- 상품평
http://order.pay.naver.com/purchaseReview/2018011624657101/2018011674291531/premiumReview
============================================================================================================== 

- 장인, 장모 비행기표 예매(23시)
1. 온라인 투어 ==> http://www.onlinetour.co.kr ==> tamario / sspeim8811
2. 비엣젯항공(0925편): 인천[01/25(목) 07:15]  --> 하이퐁[01/25(목) 10:40]
==============================================================================================================    
 
■■■■■■■■■■■■■■■■■ 2018.01.23(화) 작업 ■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:30 ==> H-PLM 회의(20시, 본사, 김현규 부장, 오태범 사장)

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 79 결함(set_wh_setchi_rt.xfdl: 영업소의 중복 검사 에러)
1. (Menu: 4-2) 業者用ル?トスケジュ?ル登?[돌아 가기 루트 일정 등록] 
 this.dsTaishoWhSearch_onvaluechanged = function(obj:Dataset,e:nexacro.DSColChangeEventInfo)
{
	trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_01]" ); 
	trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [e.columnid]"+ e.columnid  ); 
	
	//?象?業所コ?ドの重複チェック
	if (e.columnid != 'WH_CD') {
		//this.dsTaishoWhSearch_onrowsetchanged();   		// 修正[コメントアウト]: 2018.01.23, by JIN TAE MAN ==> 수정 @@@
		return;
	}
 
	var wh_cd = this.dsTaishoWhSearch.getColumn(e.row, 'WH_CD');
	var sagyo_ymd = this.dsTaishoWhSearch.getColumn(e.row, 'SAGYO_YMD');
	
	for(var i = 0; i < this.dsTaishoWhSearch.rowcount; i++){
	  
		var wh_cd_ds = this.dsTaishoWhSearch.getColumn(i, 'WH_CD');
		var sagyo_ymd_ds = this.dsTaishoWhSearch.getColumn(i, 'SAGYO_YMD');
		trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_03] [wh_cd_ds]"+ wh_cd_ds +"[wh_cd]"+ wh_cd
			+"[sagyo_ymd_ds]"+ sagyo_ymd_ds +"[sagyo_ymd]"+ sagyo_ymd
		); 
		
		if (wh_cd_ds == wh_cd && sagyo_ymd_ds == sagyo_ymd) {
			trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_30] [적용] ========> " ); 
			
			obj.setColumn(e.row, 'WH_CD', '');
			this.gfn_message(4032);  	// 通知message == > ?象?業店が重複しています。
			return;
		}
	} 
}	
============================================================================================================== 

-  No. 85 결함(交換?象設定?面(교환대상설정화면) (SET::set_koki_koukan_kanri.xfdl): scroll 발생)
1. 이상 없음
============================================================================================================== 

-  No. 91 결함(修理?績登?[수리 실적 등록]:(SHU::shu_kosyou_sagyo.xfdl): 금액이 설정이 이상함] 
1. 작업 중
============================================================================================================== 

- 웹 로그 설정 방법
1. alert 만 가능 하다고 함  ==> alert("[/set_wh_setchi_rt.xfdl] [form_onload()] ==> [TEST_01]" ); 
============================================================================================================== 

- 오라클 ORA-06552, ORA-06553 오류가 발생 
1. 현상:
SQL Error [6552] [65000]: ORA-06552: PL/SQL: Compilation unit analysis terminated
ORA-06553: PLS-553: ？ ？ ？？ ？？ ？？ ？？？？？
2. 조치: http://reqres.tistory.com/23
http://minich.tistory.com/3
http://joke00.tistory.com/184
http://areumgury.blogspot.kr/2012/11/oracle.html
==============================================================================================================

- Mac에서 단축키
1. command + C ==> 복사,  command + V ==> 붙여넣기,  command + S ==> 저장,  Shift + Caps Lock ==> 대소문자 변환
2. command + Option + Shift + ESC ==> 종료,  command + Option  + ESC ==> 종료[화면 뜸)
3. command + Shift + 3 ==> 전체 화면 캡처 
4. command + Shift + 4 ==> 일부 화면 캡처
==> Finder >  즐겨찾기 > 데스크탑에서 캡처한 이미지 확인할 것
5. 압축: 항목 선택(Shift + 파일들) > Control + 마우스 우 클릭 > 2개의 항목 압축: 클릭 > 아카이브.zip으로 생성됨
https://support.apple.com/kb/PH7330?locale=ko_KR&viewlocale=ko_KR 
==============================================================================================================
 
- 가우스 관련 회의(19시)
1. 참석자: 구부장, 이부장, 오사장, 이석부 사장
==============================================================================================================

- 일본 히스콤 H-PLM 전환 Prj 작업 분량 관련 화상 회의(21시 ~22:30)
1. 참석자: 김현규 부장, 오태범 사장, 일본내 한국 프로젝트 담당자
==============================================================================================================
 
- 회식(21시 ~ 24:30)
1. 참석자: 구부장, 이부장, 이사장, 김현규 부장, 오태범 사장
2. 장소: 제주흑돼지삼겹살
3. 주제: 일본 히스콤 H-PLM 전환 Prj 제대로 안되고 있어서 비용(3천 만원을 못 받을 상황)
		==> 다음주까지 개발 완료하면 하이얏트 호텔 숙박비 지원 해준다고 약속함
4. 2차(호프집): 구부장이 사장님 꼬셔서 돈 5만원 받아냄(나 줌)
==============================================================================================================

■■■■■■■■■■■■■■■■■ 2018.01.24(수) 작업 ■■■■■■■■■■■■■■■■■
---> 07:00 ~ 11:00 ==> The K 손해보험 Prj 철수(11시, 종로)

- The K 손해보험 영업지원시스템 구축 Prj[★]
07:00 출근
09:10 이부장, 구부장 출근
09:30 지하 1층 커피 ?(이부장, 구부장, 근욱씨) ==> 대추차
10:00 더케이 지하 1층 식권(3장) 환불 처리 요청 ==> 통장 사본 달라고 해서 화냄
11:00 짐정리해서 나옴 ==> 정근욱씨 2월부터 SM으로 상주하기 함
11:20 중식(차이나 정식, 메이차이나) ==> LG CNS 강PM이 쏨
12:00 커피(김승준씨가 쏨)
13:00 종로3가역 출발
13:30 영등포시장역 도착
13:40 계피부과 방문(진료, 조제)
14:20 종료
15:00 귀가 
15:00 장인, 장모, 루옌 귀가
15:30 신한은행 ==> 300만원 찾기
16:10 국민은행 ATM ==> 200만원 찾기
16:20 대림3동 어린이집 ==> 수종 찾기
16:40 귀가
18:30 석식
22:50 취침
============================================================================================================== 

- 더케이 지하 1층 식권(3장) 환불 처리(10시)
1. 식권 3장(13,800원)과 영수증을 가지고 환불 요청
 1) 신세계푸드 강혜현 메니저(162926@shinsegae.com)가 신분증과 통장 사본 요구
 2) 집에 와서 신한은행 통장 사본 스캔해서 메일로 보냄 ==> 2~3일 소요 된다고 함
============================================================================================================== 
 
- 피부 치료(13시, 계피부과)
0. 계피부과 진료시간: 수요일 9시 ~ 21시 
2. 다리 치료 ==> 약(디푸코 연고) 구입 
3. 발 치료 ==> 약(박테로신 연고) 구입
============================================================================================================== 

- 2017년 귀속 연말정산
1. (주)소프트원 사업자번호: 220-87-57184  ==>  2017.03.15 ~ 2017.12.31
 1) 소프트원에 전화(02-2093-2050)해서 원천징수영수증 메일로 보내달라고 함
 (사업지원팀 안경모과장이 이메일로 보내줌)
2. (주)지아이데이타 사업자번호: 220-87-57184  ==>  2017.03.15 ~ 2017.12.31 
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■ 2018.01.25(목) 작업 ■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 장인, 장모 베트남 출국

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 67 결함(shu_kosyou_irai.xfdl: 날짜 초기화)
(Menu: 4-8)  設置?撤??移動?玉突?交換?績登?[설치.철수.이동.옥돌.교환실적등록]
this.shu_kosyou_irai_onload = function(obj:Form,e:nexacro.LoadEventInfo)
{ 
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [TEST_01]" ); 
  l] [shu_kosyou_irai_onload()] ==> [listRow]"+ listRow ); 
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [01. gdsLang, 조회수]"+ application.gdsLang.getRowCount()  
	+"[gdsLang.saveXML()]  \n"+ application.gdsLang.saveXML() ); 	// global gds 메뉴 정보 조회 @@@
	trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [01. dsParam, 조회수]"+ this.dsParam.getRowCount() 
	+"[dsParam.saveXML()]  \n"+ this.dsParam.saveXML() );  		// gds 조회 @@@
}
---------------------------------------------------------------------------------------------------

- 요청
No. 67건에 대해서...일본회사가 서버쪽 Java 소스에서...Nexa에서 보내온 파라미터들과 
실행되는 Query 문장을 System.out.println() 문장으로 찍어서 완성된 쿼리문장을 보내 달라고 합니다.
이때 Nexa에서 보내온 파라미터들과 Java 소스에서 받는 변수와의 각 타입들도 파악해서 알려주시면 됩니다.
==> MyBatis 쿼리 로그 출력이 안되어서 처리 못 함
============================================================================================================== 

- No.  79결함(set_wh_setchi_rt.xfdl: 영업소의 중복 검사 에러)
1. (Menu: 4-2) 業者用ル?トスケジュ?ル登?[돌아 가기 루트 일정 등록] 
 this.dsTaishoWhSearch_onvaluechanged = function(obj:Dataset,e:nexacro.DSColChangeEventInfo)
{
	trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_01]" ); 
	trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [e.columnid]"+ e.columnid  ); 
	
	//?象?業所コ?ドの重複チェック
	if (e.columnid != 'WH_CD') {
		//this.dsTaishoWhSearch_onrowsetchanged();   		// 修正[コメントアウト]: 2018.01.23, by JIN TAE MAN ==> 수정 @@@
		return;
	}
 
	var wh_cd = this.dsTaishoWhSearch.getColumn(e.row, 'WH_CD');
	var sagyo_ymd = this.dsTaishoWhSearch.getColumn(e.row, 'SAGYO_YMD');
	
	for(var i = 0; i < this.dsTaishoWhSearch.rowcount; i++){
	  
		var wh_cd_ds = this.dsTaishoWhSearch.getColumn(i, 'WH_CD');
		var sagyo_ymd_ds = this.dsTaishoWhSearch.getColumn(i, 'SAGYO_YMD');	// 修正[コメントアウト]: 2018.01.23, by JIN TAE MAN =
		trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_03] [wh_cd_ds]"+ wh_cd_ds +"[wh_cd]"+ wh_cd
			+"[sagyo_ymd_ds]"+ sagyo_ymd_ds +"[sagyo_ymd]"+ sagyo_ymd
		); 
		
		if (wh_cd_ds == wh_cd && sagyo_ymd_ds == sagyo_ymd) {
			trace("[/set_wh_setchi_rt.xfdl] dsTaishoWhSearch_onvaluechanged()] ==> [TEST_30] [적용] ========> " ); 
			
			obj.setColumn(e.row, 'WH_CD', '');
			this.gfn_message(4032);  	// 通知message == > ?象?業店が重複しています。
			return;
		}
	} 
}	  
============================================================================================================== 

- TOAD 10 설치
1. 정상 설치
--------------------------------------------------------------------------------------------------------------------------

- Oracle Instant Client 이용하여 Toad 사용하기
http://www.hyoyoung.net/88 ==> http://www.oracle.com/technetwork/database/features/instant-client/index-097480.html
1. 32 비트용  Oracle Instant Client(/instantclient-basic-nt-11.2.0.4.0.zip)을 사용할 것
 1) 32 비트용  Oracle Instant Clien를 다운로드하여 instantclient-basic-nt-11.2.0.4.0 폴더 복사
 2) C:\oracle\instantclient_11_2 폴더에 붙여넣기 
 3) 환경 설정
  가. Path: C:\oracle\instantclient_11_2;   				==> 오라클 설치 디렉토리
  나. LS_LANG: KOREAN_KOREA.KO16MSWIN949 	==> 오라클 설치 디렉토리 
  다. TNS_ADMIN: C:\oracle\instantclient_11_2			==> tnsnames.ora 위치(임의 지정)
    ==> Oracle Client 사용 안 해도 됨   
---------------------------------------------------------------------------------------------------------

- 오라클 DB 설정
database.driverClassName=oracle.jdbc.OracleDriver
database.url=jdbc:oracle:thin:@211.52.57.247:1521:GidataDB
database.username=MMS2
database.password=MMS2
---------------------------------------------------------------------------------------------------------

- ORACLE_HOME 설정
1. 설정 > 시스템 > 정보 > 시스템 정보 > 고급 시스템 설정 > 환경변수 
ORACLE_HOME ==> C:\app\Administrator\product\11.2.0\client_1
2. 확인:  C:\> set ORACLE_HOME
============================================================================================================== 

- ecipse에서 java 빌드 안됨((주)투비소프트 원격지원 받음)
1. 현상: ecipse에서 상단 > Project > Build ALL 하면 빌드 안됨(Build Auto로 설정해도 빌드 안됨)
2. 원인: nexacro14_server_license.xml 파일을 Build Path에 잡으면 안됨
3. 조치: nexacro14_server_license.xml 파일을 Build Path에서 제외 처리
============================================================================================================== 

- No. 72 결함
1, 간트차트(set_setchi_schedule.xfdl)  ==> 김현규 부장한테 해결 메일이 옴
============================================================================================================== 

- No. 81 결함
1, 간트차트(set_setchi_schedule.xfdl) ==> 김현규 부장한테 해결 메일이 옴
============================================================================================================== 

- calendar 콤포넌트에 set_value set_text 가 안먹음 
var objDate = new Date(); 
this.Calendar01.set_value(objDate.toString());  		// new Date()로 날짜 객체를 생성하여 string 타입으로 변환하여 처리
alert(this.Calendar00.value); 
==============================================================================================================

- 마이바티스(MyBatis) 쿼리 로그 출력 및 정렬하기  
1. 흔한 개발자의 개발 노트 ==> http://addio3305.tistory.com/66
============================================================================================================== 

- H-PLM 집에서 개인 PC에 셋팅
==============================================================================================================

- 장인, 장모 베트남 출국
02:30 기상 ==> 영하 14도
03:20 카카오택시 승차 ==> 택시비(문영A -> 인천공항): 52,700원[장모님이 냄}
04:00 인천공항 도착
04:20 수하물 수속
05:30 탑승 수속
05:50 장인, 장모와 작별 인사
06:10 인천공항 출발
06:20 인천공항역 출발 
08:10 선릉역 도착 
08:20 삼성제일빌딩 출근
08:30 조식
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■ 2018.01.26(금) 작업 ■■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:30 ==>

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 87 결함(SHU::shu_kosyou_irai.xfdll: 修理依?登?[수리 의뢰 등록](Menu:5-1)) 
-->  radio 박스  에러  ==> 정상임[확인]
==> Mac에서 IPAD용 실행이 안되서 김형규 부장이 16시부터 1시간 동안 전화를 지원 해줬는데 서버 실행 실패
	(한승완 과장이 18시부터  19시까지 지원 해줬는데 서버 실행 실패)
trace("[/shu_kosyou_irai.xfdl] [shu_kosyou_irai_onload()] ==> [폼 로딩] [TEST_01]" ); 
 
trace("[/shu_kosyou_irai.xfdl] [fn_search()] ==>  [버튼 클릭 Event] [TEST_01]" );  

trace("[/shu_kosyou_irai.xfdl] [fn_search()] ==>  [조회] [TEST_01]" );

trace("[/shu_kosyou_irai.xfdl] [fn_callback()] ==> [콜백] [TEST_01] [strSvcId]"+ strSvcId +"[nErrorCode]"+ nErrorCode +"[strErrorMsg]"+ strErrorMsg ); 
trace("[/shu_kosyou_irai.xfdl] [fn_callback()] ==> [콜백] [01. dsParam, 입력Para]"+ this.dsParam.getRowCount() 
	+"[dsParam.saveXML()]  \n"+ this.dsParam.saveXML() );	
trace("[/shu_kosyou_irai.xfdl] [fn_callback()] ==> [콜백] [02. dsRouteSchedule, 결과]"+ this.dsRouteSchedule.getRowCount() 
	+"[dsRouteSchedule.saveXML()]  \n"+ this.dsRouteSchedule.saveXML() ); 
============================================================================================================== 
 
- No. 88 결함(SHU::shu_kosyou_irai.xfdll: 修理依?登?[수리 의뢰 등록](Menu:5-1))
-->  돋보기 아이콘이 표시되지 않음  ==> 정상임[확인]
============================================================================================================== 

- Mac에서 서버 확인 
1. 서버 URL 확인  ===> http://192.168.0.30:8080/moms_Nexa_tab/start_ios.json
2. 서버에서 zip 파일 다운로드 여부 확인  ===>http://192.168.0.30:8080/moms_Nexa_tab/Archive00.xzip
==> Finder >  즐겨찾기 > 다운로드에서 Archive00.xzip 확인할 것
============================================================================================================== 

-  xcode에서 IP 설정(Mac에서)
@implementation AppDelegate
-(NexacroMainViewController*)initMaiznViewController:(NSInteger)nView
{
	// [NexacroResourceManager sharedResourceManager]setBootstrapURL:@"http://192.168.0.30:8080/moms_Nexa_tab/start_ios.json"];  		
	// tama 노트북 @@@	 
	// [[NexacroResourceManager sharedResourceManager]setBootstrapURL:@"http://192.168.0.17:8080/moms_Nexa_tab/start_ios.json"]; 		 
	// gi 노트북[주석 처리] @@@

    return [[AppViewController alloc] initWithLoader:nView];
}
@end
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.27(토) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 22:30 ==> 계피부과 방문(08:25)

- 주말
07:00 기상
07:50 집출발 
08:20 영등포시장역 도착
08:25 계피부과 도착
09:10  진료, 조제
09:15 종료
09:20 영등포시장역 출발
10:00 출근
10:10 일본 히스콤 H-PLM 전환 Prj 소스 수정
22:30 종료
23:40 귀가
23:50 취침
============================================================================================================== 

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 64 결함(整備[정비] >機器整備依?登?[장비정비의뢰등록)] SEI::sei_kiki_irai.xfdl(Menu: 6-1) 
1. Tab 위치가 다름(1번 Tab 기준으로 올릴 것) 
 this.gfn_message(3); 		// ?象デ?タが見つかりませんでした 
 ===> Mac ipad 버전 업그레트 한 후 다시 빌드할 것 ====> @@@@[★★★★★]
============================================================================================================== 

- No. 91 (修理 < 新規?票追加(直接入力)[새 문서 추가 (직접 입력)] SHU::shu_kosyou_sagyo_new.xfdl (Menu: 5-3)
1.  SHU::shu_kosyou_sagyo_tab_sag.xfdl  파일 grdSag Grid에서
<Cell col="6" displaytype="normal" text="bind:SAGYO_KIN" autosizecol="limitmin"/> 가 최초 클릭일 ? 무조건 0을 합산합
 
this.gfn_comTransaction("search" 
		, "DataSrv::shuri/JissekiS/searchList"
		, "dsParam=dsParam"	
		, "dsList=dsList"
		, ""
		, "fn_callback_search");

==> 	@Model(packaze = "shuri", model = "JissekiS")
		     System.out.println("[/ShuriJissekiS.java] [search()] ==> [RouteScheduleMapper.SEARCH]"+ RouteScheduleMapper.SEARCH ); 
============================================================================================================== 

- 일본 고객에게 이메일 보내기(20:20)
1. 처리 건수 5건 엑셀로 보냄
2. 남은 미해결 건수가 5건 확인
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2018.01.28(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==>

- 주말
08:00 기상 
08:10 2017년 연말정산 처리  ==> 국세청 사이트에서 (주)지아이데이타 정보,  정보가 안뜸 
11:30 종료
12:00 중식
12:30 집출발(수종): 자전거
13:00 안양천 눈썰매장 도착 ==> 입장권 구입(16,000원[2명])
13:20 튜빙 눈썰매 타기
13:30 눈썰매 타기
16:00 빙 눈썰매 타기[6번 정보 탐]
16:50 종료 ==> 수종 목장갑이라 손 씨러워 함, 목도리 분실
17:20 귀가
17:30 낮잠 ==> 피곤
20:00 석식
23:50 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.29(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:40 ==>  2017년 연말정산 처리, 구부장, 이부장 철수해서 본사 복귀  

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 64 결함(整備[정비] >機器整備依?登?[장비정비의뢰등록)] SEI::sei_kiki_irai.xfdl(Menu: 6-1)   
1. Tab 위치가 다름(1번 Tab 기준으로 올릴 것) 
 this.gfn_message(3); 		// ?象デ?タが見つかりませんでした 
 ===> Mac ipad 버전 업그레드한 후 다시 빌드할 것 ====> @@@@[★★★★★]

 - /sei_kiki_irai.xfdl 파일에서
<!-- <Div id="divInfo" positionstep="2" position="absolute" left="8" top="96" width="1008" height="621"/> -->
	<!--// 修正: 2018.02.01, by JIN TAE MAN //-->
	<!-- <Div id="divList" positionstep="1" position="absolute" left="8" top="96" width="1008" height="627"/> -->
	<!--// 修正: 2018.02.01, by JIN TAE MAN //-->
	<Div id="divInfo" positionstep="2" position="absolute" left="8" top="70" width="1000" height="645"/>
	<!--// 修正[top="70"]: 2018.02.01, by JIN TAE MAN //-->
	<Div id="divList" positionstep="1" position="absolute" left="8" top="70" width="1008" height="627"/>
	<!--// 修正[top="70"]: 2018.02.01, by JIN TAE MAN //-->
============================================================================================================== 
 
- No. 91 (修理 < 新規?票追加(直接入力)[새 문서 추가 (직접 입력)] SHU::shu_kosyou_sagyo_new.xfdl (Menu: 5-3) ==> 수정 완료 ▲▲▲
1.  SHU::shu_kosyou_sagyo_tab_sag.xfdl  파일 grdSag Grid에서
<Cell col="6" displaytype="normal" text="bind:SAGYO_KIN" autosizecol="limitmin"/> 가 최초 클릭일 ? 무조건 0을 합산합
 
this.gfn_comTransaction("search" 
		, "DataSrv::shuri/JissekiS/searchList"
		, "dsParam=dsParam"	
		, "dsList=dsList"
		, ""
		, "fn_callback_search");

==> 	@Model(packaze = "shuri", model = "JissekiS")
		     System.out.println("[/ShuriJissekiS.java] [search()] ==> [RouteScheduleMapper.SEARCH]"+ RouteScheduleMapper.SEARCH );
 
		packaze = "setchi", model = "RouteScheduleS"
-----------------------------------------------------------------------------------------------------------------------

- grid 속성(:shu_kosyou_sagyo_tab_sag.xfdl  파일에서)
1. autoenter: select
2. autofittype: col
3. autoziebandtype: allband
4. autosizingtype: col에서 none로 변경
==> autosizingtype 속성: 그리드의 행과 열의 크기를 셀의 텍스트나 이미지의 크기에 맞게 자동 조절하는 방식을 설정하는 속성 
============================================================================================================== 

- No. 87(修理依?登?[수리의뢰등록] SHU::shu_kosyou_irai.xfdl(Menu: T_5-2) 
1. 이상 없음
============================================================================================================== 

89	"理依?登?
SHU::shu_kosyou_irai.xfdl
(Menu: 5-1) 
-----------------------------------------------------------------------

- 2017년 연말정산 처리  
1. 소득.세액 공제 자료 조회에서 건강보험, 국민연금 등을 모두를 한번씩 클릭
2. 한번에 내력받기: 클릭 
3. 소득.세액 공제 자료 내려 받기(새창)  
 1) 내려받기: 클릭
4. 진태만(720625)-2017년도자료.pdf 파일을 개인 PC에 저장 
5. 회사 담당자(이동은씨)에게 메일로 보내기 
 1) 진태만(720625)-2017년도자료.pdf  ==> 국세청 편리한 연말정산에서 내려받기함
2) 공제신고서.pdf ==> 국세청 편리한 연말정산에서 내려받기함
 가. 근로소득자 소득공제신고서.hwp 파일 대체(인적공제 요청 정보 포함)
============================================================================================================== 

- 외부메일 가져오기(네이버 메일에서)
1. 외부메일 가져오기: 클릭
2. 직업입력 Tab: 클릭
 1) 계정 선택: 직접입력: mail.gidata.co.kr
 2) 아이디: tamario@gidata.co.kr
 3) 비밀번호: ta***3**
 4) 연결포트: 110
 5) 저장힐 메일함: 새메일함(선택): 01. gidata
==> 저장: 클릭, 외부메일 가져오기 ==> http://asusday.tistory.com/919
==================================================================================================== 

- Mac에서 TAMA HP 노트북 Apache Tomcat/7.0.64 연결 에러 
1. 현상
 1) 사파리에 입력 ==> http://192.168.0.30:8080/
 2) Safari가 http://192.168.0.30'서버에 연결할 수 없기 때문에 에서 '192.168.0.30:8080'페이지를 열 수 없습니다.
2. 원인: Wi-Fi가 iptime으로 잡혀 있어서 나는 에러
3. 조치: 
 1) 메뉴 막대에서 Wi-Fi 아이콘\을 클릭합니다. 
 2) Wi-Fi가 꺼져 있으면 'Wi-Fi 켜기'를 선택합니다.
 3) 목록에서 주변의 Wi-Fi 네트워크를 선택합니다. ==> GIDATA 선택 
==================================================================================================== 

- 일본 고객에게 이메일 받음
1. 36건데 대한 확인 메일 ==> 고객이 화가 많이 났다고 함
==================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2018.01.30(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:40 ==>

- 일본 히스콤 H-PLM 전환 Prj[★]
- No. 88(修理依?登?[수리의뢰등록] SHU::shu_kosyou_irai.xfdl(Menu: T_5-2)  ==> 수정 완료 ▲▲▲
// this.divInfo.Tab.header.btnTrihikisakiCdSearch.style.set_background("@gradation URL('action_search') stretch center middle");
this.divInfo.Tab.header.btnTrihikisakiCdSearch.style.set_background("@gradation URL('Images::action_search.bmp') stretch center middle"); 	
// 修正: 2018.01.30, by JIN TAE MAN 

this.fn_callback_search = function(strSvcId, nErrorCode, strErrorMsg)
{
	//alert("[/shu_kosyou_sagyo.xfdl] [fn_callback_search()] ==> [콜백] [TEST_01] [strSvcId]"+ strSvcId +"[nErrorCode]"+ nErrorCode +"[strErrorMsg]"+ strErrorMsg ); 
 
	if (nErrorCode == 0) {  
		// 테스트 데이타 생성 시작 =============================>  @@@@ 
		this.dsList.clearData();		// 테스트 데이타 생성 ==> 修正: 2018.01.29, by JIN TAE MAN  
		var nRow = this.dsList.addRow();   
		this.dsList.setColumn(nRow, "SHURI_IRAI_NO", "17000019336");
		this.dsList.setColumn(nRow, "UKETSUKE_YMD", "20180110");
		this.dsList.setColumn(nRow, "LOCA_CD", "5821");
		this.dsList.setColumn(nRow, "LOCA_KANJI", "SDM_SRC100"); 
	 
		trace("[/shu_kosyou_sagyo.xfdl] [fn_callback_search()] ==> [콜백] [02. dsList, 결과]"+ this.dsList.getRowCount() 
			+"[dsList.saveXML()]  \n"+ this.dsList.saveXML() ); 
		// 테스트 데이타 생성 끝 ====================================================================================>  @@@@

		if (this.dsList.getRowCount() > 0) { 
			// 테스트 데이타 생성 시작 =============================>  @@@@ 
			this.dsHeader.clearData();	// 테스트 데이타 생성 ==> 修正: 2018.01.29, by JIN TAE MAN  
			var nRow = this.dsHeader.addRow();   
			this.dsHeader.setColumn(nRow, "SHURI_IRAI_NO", "17000019336");
			this.dsHeader.setColumn(nRow, "UKETSUKE_YMD", "20180110");
			this.dsHeader.setColumn(nRow, "LOCA_CD", "5821");
			this.dsHeader.setColumn(nRow, "LOCA_KANJI", "SDM_SRC100");  
			trace("[/shu_kosyou_sagyo.xfdl] [fn_callback_search()] ==> [콜백] [02. dsHeader, 결과]"+ this.dsHeader.getRowCount() 
				+"[dsHeader.saveXML()]  \n"+ this.dsHeader.saveXML() ); 
			// 테스트 데이타 생성 끝 ====================================================================================>  @@@@ 
		} 
	} 
}
============================================================================================================== 

- No. 87 결함(修理依?登?[수리의뢰등록] SHU::shu_kosyou_irai.xfdl(Menu: T_5-2)  ==> 수정 완료 ▲▲▲
1. 파리미터 셋팅시 set_value에서 0을 null 인식 ==> "0"로 변경 처리함
this.fn_initSearchParam = function() {
	//this.divSearch.rdo_mail_status.set_value(0);		// 修正: 2018.01.30, by JIN TAE MAN  
	this.divSearch.rdo_mail_status.set_value("0"); 	// 修正[メ?ル送信?況 ALL(0) ラジオコンボ 設定]: 2018.01.30, by JIN TAE MAN 
}
============================================================================================================== 

- No. 67 결함(設置?撤??移動?玉突?交換?績登?(설치·철수· ·玉突 교환실적등록) SET::set_setchi_jisseki.xfdldl(T: Menu:3-5)  
1. 作業希望日(cal_kibou_ymd_from)을 변경하면 처음 설정된 초기값으로 변경됨
 1) /set_setchi_jisseki.xfdl 파일에서
 <Calendar id="cal_kibou_ymd_from" taborder="9" dateformat="yyyy-MM-dd" position="absolute" left="170" width="100" top="125" 
 height="20" value="null" editformat="yyyy-MM-dd" onkeydown="divSearch_cal_kibou_ymd_from_onkeydown" style="popupsize:216 210;"/>
 <Calendar id="cal_kibou_ymd_to" taborder="10" dateformat="yyyy-MM-dd" position="absolute" left="297" width="100" top="126" 
 height="20" value="null" editformat="yyyy-MM-dd" onkeydown="divSearch_cal_kibou_ymd_to_onkeydown" style="popupsize:216 210;"/>
 
<Col id="G_KIBOU_YMD">作業希望日</Col>
============================================================================================================== 
 
- No. 89 결함(修理?績登?SHU::shu_kosyou_sagyo.xfdl(Menu: T_5-5)  ==> 확인 완료   ▲▲▲
1. [2 단계 번째 화면의 그리드 행을 선택 (탭)도 3 단계 번째로 전환하지 않음]
==> SEARCH_FLG가 false일 ?만 3단계로  이동 가능
this.divList_grdList_oncellclick = function(obj:Grid,e:nexacro.GridClickEventInfo)
{ 
	if (application.gvHybridFlg) {
		alert("[/shu_kosyou_sagyo.xfdl] [divList_grdList_oncellclick()] ==> [Grid 클릭] [TEST_03] [this.SEARCH_FLG]"+ this.SEARCH_FLG.gvHybridFlg );
	
		//if ( this.SEARCH_FLG == false ) {   // 修正[コメントアウト]: 2018.01.30, by JIN TAE MAN 
		if ( this.SEARCH_FLG == "undefined" || this.SEARCH_FLG == false ) {    // 修正: 2018.01.30, by JIN TAE MAN 
			alert("[/shu_kosyou_sagyo.xfdl] [divList_grdList_oncellclick()] ==> [Grid 클릭] [TEST_04] [this.SEARCH_FLG]"+ this.SEARCH_FLG.gvHybridFlg );
	 
			var listKokiCd = this.dsList.getColumn(this.dsList.rowposition, "KOKI_CD");
			var headerKokiCd = this.dsHeader.getColumn(this.dsHeader.rowposition, "KOKI_CD");
 
			if ( listKokiCd != headerKokiCd ) {
				alert("[/shu_kosyou_sagyo.xfdl] [divList_grdList_oncellclick()] ==> [Grid 클릭] [TEST_11] [fn_getDetail]" );
	
				this.fn_getDetail();
			} else {
				alert("[/shu_kosyou_sagyo.xfdl] [divList_grdList_oncellclick()] ==> [Grid 클릭] [TEST_12] [세부 페이지를 표시 ==> this.setStepIndex(2)]");
	
				// 明細ペ?ジを表示
				this.setStepIndex(2);
			}
		}
	}
}
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2018.01.31(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:40 ==>  

- 일본 히스콤 H-PLM 전환 Prj[★]
 - No. 90 결함(修理?績登?)(수리실적등록)) SHU::shu_kosyou_sagyo.xfdl(Menu: T_5-5)  ==>   ▲▲▲
1. [카메라 촬영 후 이미지를 사용하여 썸네일 이미지가 표시되지 않음]

- SU::shu_kosyou_sagyo_tab_photo.xfdl 파일에서
function btnCamera_onclick(obj:Button,  e:ClickEventInfo)
{
	this.parent.parent.parent.divInfo_Tab_tabPhoto_btnCamera_onclick(obj, e);	
}

- SU::shu_kosyou_sagyo.xfdl 파일에서
function divInfo_Tab_tabPhoto_btnCamera_onclick(obj:Button,  e:ClickEventInfo)
{
	// 依?追加かつ、個機コ?ドが未入力、または、マスタに存在しない場合、?理しない
	var kokiCd = this.dsList.getColumn(this.dsList.rowposition, "KOKI_CD");
	if ((this.dsList.getRowType(this.dsList.rowposition) == 2) && (this.gfn_isEmpty(kokiCd))) {
		// 個機コ?ドが不正です。正しいコ?ドを入力してください。
		this.gfn_message(5049);
		return;
	}
	
	this.setWaitCursor(true);
	this.camera.imageheight = application.gvCameraImageHeight;
	this.camera.imagewidth = 0; // imageheightを元に??比が自動設定される
	this.camera.gettype = 1;
	this.camera.takePicture();
}

ここに??のサムネイルが表示されます[여기에 사진의 썸네일이 표시됩니다]
------------------------------------------------------------------------------------------------------------------------

this.fn_callback_search = function(strSvcId, nErrorCode, strErrorMsg)
{
	//alert("[/shu_kosyou_sagyo.xfdl] [fn_callback_search()] ==> [콜백] [TEST_01] [strSvcId]"+ strSvcId +"[nErrorCode]"+ nErrorCode +"[strErrorMsg]"+ strErrorMsg ); 
 
	if (nErrorCode == 0) {  
			// 테스트 데이타 생성 시작 =============================>  @@@@ 
		this.dsList.clearData();		// 테스트 데이타 생성 ==> 修正: 2018.01.29, by JIN TAE MAN  
	 
		var nRow = this.dsList.addRow();    
		this.dsList.setColumn(nRow, "SAGYO_DEN_NO", "1900033471");   		// 작업전표번호  
		this.dsList.setColumn(nRow, "UKETSUKE_YMD", "2018011");
		this.dsList.setColumn(nRow, "SHURI_IRAI_JOKYO_NAME", " TEST_NAM");
		this.dsList.setColumn(nRow, "KOKI_CD", "1760246"); 
		this.dsList.setColumn(nRow, "SAGYOSHA_NAME", "SAGYOSHA_NAME-800200");    // ============>
		this.dsList.setColumn(nRow, "SHURI_IRAI_NO", "170001938");		// 수리의뢰번호 
		this.dsList.setColumn(nRow, "MIKAN_NAME", "");
		this.dsList.setColumn(nRow, "HANBAI_KASHO_KANJI", " HANBAI_KASHO_KANJI");
		this.dsList.setColumn(nRow, "KSY_NAME", "SDM-SRC100"); 
		this.dsList.setColumn(nRow, "SENPO_TANTO_NAME", ""); 
		trace("[/shu_kosyou_sagyo.xfdl] [fn_callback_search()] ==> [콜백] [02. dsList, 결과]"+ this.dsList.getRowCount() 
			+"[dsList.saveXML()]  \n"+ this.dsList.saveXML() ); 
		// 테스트 데이타 생성 끝 ====================================================================================>  @@@@ 
	} 
} 
============================================================================================================== 

 - No. 94 결함(交換予定登?(교환 예정 등록)) SET::set_koki_koukan.xfdl(Menu: T_ 3-10-2)  ==> 수정 완료 [▲▲▲]
1. [교환 예정 등록 화면에서 전환 할 때 검색 처리가 실행되지 않음 (교체 예정 화면에서 전환시 자동으로 검색이 이루어져야 함)]
==> 폼 로딩시 PC의 경우 만 자동 조회 가능 
- 1. /set_schedule_jokyo.xfdl 파일에서
this.set_shedule_jokyo_onload = function(obj:Form,e:nexacro.LoadEventInfo)
{
	alert("[/set_schedule_jokyo.xfdl] [set_shedule_jokyo_onload()] ==> [폼 로딩] [TEST_01]" ); 

	if (!application.gvHybridFlg) { // PCの場合(タブレットは?面レイアウト?更時)
	// ?面遷移判定
	this.fn_judgeTransition();
	}
}
------------------------------------------------------------------------

- 2. 처리(일본에서)
SET(set_schedule_jokyo.xfdl의 기능:this.divSearch_onlayoutchanged내의 
fn_repaireCalendarObj가 정상적으로 동작하지 않고 있습니다. 
606,607행을 주석 처리하면 정상적으로 동작합니다. 
또한 606,607행은 XPLATFORM의 버그 때문에 들어간 처리라서 Nexacro로 해소되고 있다면 코멘트 아웃해도 문제 없습니다.  
this.divSearch_onlayoutchanged = function(obj:Div,e:nexacro.LayoutChangeEventInfo)
{
	//if (application.gvHybridFlg) { 	// 修正[日本でコメントアウトよ]: 2018.01.31 by JIN TAE MAN
		// カレンダ?の幅がおかしくなるため??
		this.fn_repaireCalendarObj(this.divSearch.cal_kibou_ymd_from);
		this.fn_repaireCalendarObj(this.divSearch.cal_kibou_ymd_to);

		// ?面遷移判定
		this.fn_judgeTransition();
	//}
}
------------------------------------------------------------------------------------------------------------------------

// 修正[コメントアウト]: 2018.01.23, by JIN TAE MAN 

- 영업소명 취득(?業所名取得)
1. this.gfn_getMstName("V_M_MMS_WH", ["WH_CD"], [e.postvalue], "WH_NAME", this.divSearch.edt_shiten_name);
============================================================================================================== 
 
- No. 67 결함(設置?撤??移動?玉突?交換?績登?(설치·철수·玉突 교환실적등록) SET::set_setchi_jisseki.xfdldl(T: Menu:3-5)  ==> 수정 완료 [▲▲▲]
1. 作業希望日(cal_kibou_ymd_from)을 변경하면 처음 설정된 초기값으로 변경됨
==>  DATEFORMATt, LOCALE의 바인딩을 제거
 1) /set_setchi_jisseki.xfdl 파일에서 ==> editformat이 yyyy-MM-dd로 설정되어 있음
  <Calendar id="cal_kibou_ymd_from" taborder="9" dateformat="yyyy-MM-dd" position="absolute" left="170" width="100" 
  top="125" height="20" value="null" editformat="yyyy-MM-dd" onkeydown="divSearch_cal_kibou_ymd_from_onkeydown" style="popupsize:216 210;"/>
  
1. 作業希望日(cal_kibou_ymd_from)
<BindItem id="item27" compid="divSearch.cal_kibou_ymd_from" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item28" compid="divSearch.cal_kibou_ymd_from" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item29" compid="divSearch.cal_kibou_ymd_from" propid="locale" datasetid="gdsLang" columnid="LOCALE"/> 
<BindItem id="item27" compid="divSearch.cal_kibou_ymd_to" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item28" compid="divSearch.cal_kibou_ymd_to" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item29" compid="divSearch.cal_kibou_ymd_to" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
2. 作業日(cal_sagyo_ymd_from) 
  <BindItem id="item45" compid="divSearch.cal_sagyo_ymd_from" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
  <BindItem id="item46" compid="divSearch.cal_sagyo_ymd_from" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
  <BindItem id="item47" compid="divSearch.cal_sagyo_ymd_from" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
  <BindItem id="item48" compid="divSearch.cal_sagyo_ymd_to" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
  <BindItem id="item49" compid="divSearch.cal_sagyo_ymd_to" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
  <BindItem id="item50" compid="divSearch.cal_sagyo_ymd_to" propid="locale" datasetid="gdsLang" columnid="LOCALE"/> 
  
  2) /set_setchi_jisseki_tab_kiki_shin_sag.xfdl 파일에서 옴
============================================================================================================== 
 
- /hiscom.xtheme 파일에서 달력 날자 색깔 설정
Calendar>#popupcalendar
{
	daycolor		: #191919ff;
	todaycolor		: yellow;			==> todaycolor		: yellow;
	weekcolor		: #3f3f3fff;
}
============================================================================================================== 

- No. 69 결함(設置業者-部品使用ル?ト設定(설치 업체 - 부품 사용 경로 설정)) SET::set_setchigyo_buhin_wh_rt.xfdl(T: Menu:3-5)  ==> 수정 완료 [▲▲▲]
1. 作業希望日(cal_kibou_ymd_from)을 변경하면 처음 설정된 초기값으로 변경됨
==>  DATEFORMATt, LOCALE의 바인딩을 제거  
 <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
 <BindItem id="item3" compid="divSearch.cal_kibou_ymd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item4" compid="divSearch.cal_kibou_ymd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item5" compid="divSearch.cal_kibou_ymd" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
-->
============================================================================================================== 
 
- No. 74, 결함(修理?績登?(수리 실적 등록)) SHU::shu_kosyou_sagyo.xfdl(Menu: T_5-5)  ==> 수정 완료 [▲▲▲]
1.  날짜 타입이 DATEFORMAT, LOCALE의 바인딩된 거 제거  
 1) SHU::shu_kosyou_sagyo.xfdl 파일에서
<!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
 <BindItem id="item56" compid="divInfo.Tab.tabSagDen.cal_sagyo_ymd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item58" compid="divInfo.Tab.tabSagDen.cal_sagyo_ymd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
-->
<!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
 <BindItem id="item46" compid="divSearch.cal_uketsuke_ymd_from" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item57" compid="divSearch.cal_uketsuke_ymd_from" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
-->
	<!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
<BindItem id="item2" compid="divSearch.cal_uketsuke_ymd_to" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item3" compid="divSearch.cal_uketsuke_ymd_to" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
-->
------------------------------------------------------------------------------------------------------------------------

 1) SHU::shu_kosyou_sagyo_tab_header.xfdl 파일에서
      <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
 <BindItem id="item12" compid="cal_sagyo_ymd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item13" compid="cal_sagyo_ymd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item14" compid="cal_sagyo_ymd" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
-->
 <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
 <BindItem id="item28" compid="cal_sagyo_kanryo_ymd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item30" compid="cal_sagyo_kanryo_ymd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item31" compid="cal_sagyo_kanryo_ymd" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
-->
============================================================================================================== 

- No. 83 결함(設置スケジュ?ル?況(설치 일정 상황) SET::set_schedule_jokyo.xfdl(Menu: T_3-9)   ==> 수정 완료 [▲▲▲]
1. 날짜 타입이 DATEFORMAT, LOCALE의 바인딩된 거 제거 
 1) /set_schedule_jokyo.xfdl 파일에서   
 <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
<BindItem id="item45" compid="divSearch.cal_kibou_ymd_from" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item46" compid="divSearch.cal_kibou_ymd_from" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item47" compid="divSearch.cal_kibou_ymd_from" propid="locale" datasetid="gdsLang" columnid="LOCALE"/> 
<BindItem id="item48" compid="divSearch.cal_kibou_ymd_to" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item49" compid="divSearch.cal_kibou_ymd_to" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
<BindItem id="item50" compid="divSearch.cal_kibou_ymd_to" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
-->
============================================================================================================== 
 
- No. 86 결함(設交換予定登??面(교환 예정 등록) SET::set_koki_koukan.xfdl(Menu: T_3-10-2)   ==> 수정 완료 [▲▲▲]
1. 날짜 타입이 DATEFORMAT, LOCALE의 바인딩된 거 제거 
 1) /set_koki_koukan.xfdl 파일에서  
<!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
  <BindItem id="item39" compid="divSearch.cal_taisho_ym_from" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
  <BindItem id="item10" compid="divSearch.cal_taisho_ym_to" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
-->
============================================================================================================== 
 
- No. 98 결함(修理?況確認(수리 상태 확인) SET::shu_kosyou_irai_jokyo.xfdl(Menu: T_3-10-2)   ==> 수정 완료 [▲▲▲]
1. 날짜 타입이 DATEFORMAT, LOCALE의 바인딩된 거 제거 
 1) /shu_kosyou_irai_jokyo.xfdl 파일에서  
  <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
	<BindItem id="item70" compid="divSearch.calUketsukeYmd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item71" compid="divSearch.calUketsukeYmd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item72" compid="divSearch.calUketsukeYmd" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
	-->
    <!--// 修正[コメントアウト]: 2018.01.31 by JIN TAE MAN
     <BindItem id="item95" compid="divSearch.toCalUketsukeYmd" propid="dateformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item96" compid="divSearch.toCalUketsukeYmd" propid="editformat" datasetid="gdsLang" columnid="DATEFORMAT"/>
      <BindItem id="item97" compid="divSearch.toCalUketsukeYmd" propid="locale" datasetid="gdsLang" columnid="LOCALE"/>
	-->
============================================================================================================== 
 
- No. 99 결함(修理 日報(수리 일보)	SHU::shu_daily_report.xfdl(Menu: T_3-10-2) ==> 수정 완료 [▲▲▲]
1.  부품여부(buhinExistsFlg)가 안보임 
this.fn_setBuhinExistsFlgName = function(buhinExistsFlg)
{
	alert("[/shu_daily_report.xfdl] [fn_setBuhinExistsFlgName()] ==> [TEST_01] [buhinExistsFlg]"+ buhinExistsFlg );  
	// 테스트  ==> 修正: 2018.01.31, by JIN TAE MAN  
	
	if ( buhinExistsFlg == 0 ) {
		return "無";
	} else if ( buhinExistsFlg == 1 ) {
		return "有";
	} else {
		return "";
	}
}
==============================================================================================================  
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+--------------------------------------------------------// End //--------------------------------------------------------+  
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

