

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2018.04) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2018.04.01(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

▦ 축구
10:00 기상
10:30 조식
12:00 중식
12:10 집출발(자전거): 수종 
12:40 구로리 공원(수종)
14:40 엘마트(껌)
14:50 귀가 
15:10 집출발(자전거)
15:30 대림운동장 ==> 게임하고 있었음
--> 도신 전회장님과 수춘이형 봄: 연락 끊어서 미안하다고 사과함
16:30 게임(은혜교회팀: 어울림 ==> 3 쿼터 뜀)
18:00 유소년 코치들하고 운동장 때문에 싸움 ==> 구청에서 관리소장이 직접 옴
18:30 종료
18:40 귀가
20:20 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.02(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 본사 복귀

- 본사 복귀[★]
- 복귀 신고
1. 정현수 차장 퇴사(GIGABYTE 노트북과 HP ProBook 450 G3과 교체함) 
--------------------------------------------------------------------------------------------------------------

- (주)지아이데이타에서 새로 지급받은 GIGABYTE 노트북 정보[2018.04.02(월)] ==> 정현수 차장(퇴사자) 노트북과 교체함
1. 모델명: 3168NGW[GIGABYTE Sabre 15]
2. S/N: 3168NGW 
3. Product:  
4. 지급 받은 일자: 2018.04.02(월) 
5. 기타 사양
제조회사 : GIGABYTE Sabre 15
모델번호 : 3168NGW
RAM : 8GB
HDD : 1TB
SSD : 128GB
==> https://search.naver.com/search.naver?where=nexearch&sm=top_hty&fbm=0&ie=utf8&query=GIGABYTE+Sabre+15  
--------------------------------------------------------------------------------------------------------------

- GIGABYTE Sabre 15 노트북 사양 
1. CPU: 7세대 Intel® Core™ i7-7700HQ @2.80GHz 2.81GHz
2. RAM(메모리): 8GB DDR4 2400 2 slots (Max 32GB)
3. 디스플레이(해상도): 15.6" IPS Full HD 1920x1080 WVA anti-glare display
4. 시스템 메모리: 8GB/16GB DDR4 2400 2 slots (Max 32GB)
5. HDD 용량:  	-1 x 2.5” HDD slot  ==> 1TB(HD)
-1 x M.2 SSD slot (Type 2280, supports NVMe PCIe X4 & SATA)  ==> 128GB SSD
6. OS: Window 10 Home x64 설치됨
7. 칩셋: Mobile Intel® HM175 Express Chipset
8. 비디오 그래픽: Intel® HD Graphics 630(내장)
NVIDIA® GeForce® GTX 1050 Ti GDDR5 4GB /
NVIDIA® GeForce® GTX 1050 GDDR5 2GB
Supports NVIDIA® Optimus™ Technology
9. 오디오  		: 	2 Watt Speaker*2, Dual Array Microphones, 
Sound Blaster™ Cinema 3	\
10. 네트워크 카드: 	LAN:10/100/1000Mbps Ethernet
Wireless LAN: 802.11 ac (a/b/g/n compatible)
Bluetooth: Bluetooth V4.2+ LE 
11. LCD 크기: 	378(W) x 267(D) x 26.9(H)mm
14.9(W) x 10.5(D) x 1.1(H) inch
12. 무게: ~2.5kg (w/6-cell battery)
13. 배터리: Li-ion 6-cell, 4200mAh, 47Wh 
14. I/O 포트: 	1x USB3.1 Gen.2(Type-A), 1x USB3.1 Gen.2(Type-C), 1x USB3.1 Gen.1(Type-A), 1x USB2.0(Type-A), 1x HDMI 1.4, 1x mini DP 
1.3, 1x mini DP 1.2, 1x RJ45, 1x 6-in-1 card reader(SD/Mini SD/SDHC/SDXC/MMC/RS MMC), 1x DC-in jack, 1x Headphone jack
    ==> 모니터용 VGA 케이블 단자 없음
=========================================================================================================

- 문영 APT 관리비 납부(12시, 회사)
1. 12시 20분에 신한은행 신릉금융센터 지점에서 478,070원(2017.12, 2018.01 ~02: 3개월 분) 납부
 1) 신한은행 계좌번호 몰라서 관리소에 전화해서 계좌번호 확인 후 납부함
 2) 신한은행 계좌번호 ==> 신한은행: 140-005-203056, 예금주: 문영 칸타빌레 아파트
==============================================================================================================

- USB3.0 패치 USB 만들기(22시, 집 PC로 만듬)
1. HP 노트북에서 OS 포맷 후 USB에 인식이 안 될 때
 1) USB3.0을 인식하도록 패치 처리
--------------------------------------------------------------------------------------------------------------

- USB3.0 패치 설치 방법[★]
1. USB 3.0 AMD&INTER.zip 파일을 HP 콜센터에서 이메일로 받음
2. USB 3.0 AMD&INTER.zip 파일을 압축 품
3. \USB 3.0 AMD&INTER\WindowsImageTool\WindowsImageTool.exe 더블 클릭
4. GIGABYTE 툴에서 Destination Path(USB Drive)에서 USB를 선택하고 [Start]를 클릭합니다.
5. 진행중…. 
 ==> 참고: 진행 시간이 30-40분정도 걸립니다
6. USB3.0패치가 완료 되면 Complete라고 나옵니다. 
==> 그러면 [Close]를 클릭해서 끄고 USB를 안전하게 분리하면 됩니다.
7. 다시 Windows 7 부팅해서 OS 설치
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.03(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 중식(점심부페: 맥주여행), 중식 신권 구입(11장: 5만 원): 주인이 현금 은행에서 찾아왔다고 12장 줌

- 본사 복귀[★]
- HP ProBook 450 G3 Ghost 백업 복구
1. 복구 실패 ==> 복구 중에 에러뜸
2. 재 시도 ==>  복구 성공(2108년 2월 13일 이전 데이타,  프로그램으로 복원)
 1) 박건유 대리에게 전화해서 내가 썼든 ProBook 450 G3 노트북을 박대리에게 물려 주기로 함(경리에게 확인)
==============================================================================================================

- Ghost 분석
1. Win7GIGABYTE_1804.GHO
- 원키고스트 사용방법
https://www.youtube.com/watch?v=VcsSefYWm2w
- 원키고스트 64비트 사용법 Onekey Ghost
http://blog.daum.net/fulltired/312
==============================================================================================================

- USB3.0 패치 USB 만들기(HP ProBook 450 G3 노트북에서 생성)
1. (주)지아이데이타 회사 경리가 가지고 있는 USB에 USB3.0 패치 USB 만들기
==============================================================================================================

- 모니터에 HDMI 케이블 연결
1. GIGABYTE 노트북에는 VGA 케이블 연결 단자 없음
2. HDMI 케이블 집에서 가지고 와서 연결
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.04(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 중식(점심부페: 맥주여행): 오태범 이사가 쏨

- 본사 복귀[★]
- 은행연합회 소스 백업
1. C:\eGovFrameDev-3.6.0-64bit폴더에 복사
==============================================================================================================

- Fiddler(피들러)사용법
1. Filter 기능
 1) 상단의 Use Filters 체크
 2) Show only the following Hosts: 선택 ==> Hosts 항목에는 트래픽을 볼 사이트의 도메인 기입 
homestead.app
google.com

2. Mark 기능
많은 리퀘스트들 중 의미있는 리퀘스트에 Mark 하는 기능

3. Save 기능
말그대로 저장 기능. 현재 상태를 그대로 저장한다. 물론 마크나 코맨트를 달아놨던 내용이 그대로 저장된다. 분석한 내용을 타인에게 
주거나 까먹지 않게 저장해둘 수 있다. 
[File - Save] 버튼을 통해 저장할 수 있다. 
==> http://nisam.tistory.com/5
==============================================================================================================

- 제주 4.3 사건 완벽 정리
https://www.youtube.com/watch?v=zkX3reQxFJ0

- [설민석 KBS TV 역사특강] 2018 제주 4.3사건 70주년, 우리가 몰랐던 제주 이야기
https://www.youtube.com/watch?v=UMCw0ZgUYms
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.05(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 비, 구종식 부장 은행연합회 철수하고 복사 복귀, 중식(점심부페: 맥주여행): 구부장에게 식권 1장 대여

- 본사 복귀[★]
- 공통 소스 분석
==============================================================================================================

- HP Probook 4530s 노트북(강전관 과정 꺼) 드라이버 설치
1. 드라이버 다운로드 후 설치 
==> https://support.hp.com/kr-ko/drivers/selfservice/hp-probook-4530s-notebook-pc/5060880
---------------------------------------------------------------------------------------------------------------

- 설치된 드라이버 위치
C:\SWSetup 
==============================================================================================================
 
- 갤럭시 S8 데이터 옮기기
1. 갤럭시 S8과 노트북을 전용 케이블(Type-C)로 연결
2. 노트북에서 Galaxy S8이 생성됨
 1) 내 PC\Galaxy S8\Phone\NAVER Cloud 폴더에 살인자의 기억법.2017.mp4 파일을 붙여넣기
==============================================================================================================
 
- 스마트 스위치(핸드폰 기기 변경시 데이타 옮기기)
1. 스마트폰 데이터 옮기기 : 삼성 갤럭시 스마트폰 사용자 스마트 스위치 정말 간단 
https://www.youtube.com/watch?v=MwnVFXhS1rk
==============================================================================================================

- 네이버 클라우드 수정
1. 데이타 보관
2. 영화 파일 보관
http://post.naver.com/viewer/postView.nhn?volumeNo=8691426&memberNo=36210498
==============================================================================================================
 
- 기가바이트 SABRE 15 드라이버, 메뉴얼, 유틸리티 다운로드
https://www.gigabyte.com/us/Laptop/Sabre-15#support-dl
==============================================================================================================

- gigabyte sabre 15 노트북 win7 설치
1. 드라이버 설치
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.06(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==>  

- 본사 복귀[★]
- 공통 소스 분석
1. nexacro_showcase(/nexacro.xprj)
==============================================================================================================

- 박건유 대리에게 은행연합회 게시판 DB 테이블 Script 캡처 요청
UXJP_BBS_POST  					-- 게시물목록 정보 TB 
UXJP_BBS_USER_HIT				-- 게시판 조회수 정보 TB   
UXJP_COMMON_FILE_LIST   	-- 공통 첨부 파일 목록 TB  
TAX_COMM_FILE 					-- 공통 첨부 파일 정보TB  
==============================================================================================================

- 연봉 협상(9시, 회사)
1. 지아이데이타 재입사( 2017.03.16)
2. 사장 면담: 부장급은 55가 최대라고 함(4월 급여에 성의를 표한다고 함)
-------------------------------------------------------------------------------------------------------

- 퇴직 연금 확인(18시, 회사)
1.  (주)지아이데이타 김유진 대리에서 카톡 보내서 확인 ==> 확인서 받을 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

- 주말
10:00 기상
10:30 조식(빵, 과일 사라다)
12:30 집출발(루옌, 수종) ==> 바람이 많이 불어서 무척 추움
12:40 대림역(지하철) 출발
13:10 대공원역 도착
13:20 서울대공원 매표소(응아 부부, 프엉 부부 만남)
13:30 코끼리 열차(3인: 루옌, 수종): 2,700원
13:40 서울대공원 동물원(3인: 루옌, 수종): 12,000원 ==> 종민씨 추워서 차에 들어 감
13:45 서울대공원 동물원 관람 ==> 음료수, 과자, 풍선
15:00 종료
15:10 추워서 식사 안하고 각자 헤어짐
15:20 석식(KFC 패밀리 세트): 루옌, 수종: 18,000원
16:00 종료
16:10 대공원역 출발
17:10 대림역 도착
17:20 귀가
17:30 낮잠
20:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.08(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

▦ 축구
10:00 기상
10:30 조식
12:00 중식 ==> 루옌 혼자 벚꽃 구경감
15:00 집출발(자전거) ==> 비옴(수중전)
15:20 다이소 대림점 ==> Type C USB 케이블 2개 구입: 길이(22cm)가 너무 짧음(반품할 것)
15:40 대림운동장 
16:00 게임(은혜교회팀: 어울림 ==> 3 쿼터 뜀): 비 그침
17:00 비 옴 ==> 비 맞고 게임함
18:30 종료
18:40 귀가 ==> 옷, 축구화 다 젖음
19:30 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.09(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 구종식 부장 은행연합회 재투입(산출물 작업): 나보고 UI공통 교육하라고 해서 거절함

- 본사 복귀[★]
- 공통 소스 분석
1. nexacro_showcase(/nexacro.xprj)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.10(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 은행연합회 방문(산출물 작업)

- 본사 복귀[★]
- 공통 소스 분석
1. nexacro_showcase(/nexacro.xprj)
==============================================================================================================

- 은행연합회 방문(산출물 작업)
10:30 이석부 사장 만남(연봉 3% 인상, 다음주 월요일부터 현대제철 AP 품질관리 시스템 구축 Prj 투입 예정[5개월])
11:20 종료
11:30 중식(한식 부페)
13:00 퇴근
13:20 472번 버스(선릉역 정류장)
14:00 은행연합회 앞(구부장 만남: 은행연합회 교육, 블록체인 검수 문제로 스트레스 많이 받았 있음)  
14:30 은행연합회 15층 6회의실 ==> 박건유 대리 노트북으로 UI공통 산출물 작업 
17:30 석식(김치찌개: 예지식당 -> 김범준 차장)
18:30 UI공통 산출물 작업
20:00 UI공통 산출물 작업 종료 ==> 오이사가 내일 UI공통 교육 한다고 함(내일 휴가 간다고 함)
20:20 종료
20:25 퇴근
21:20 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.11(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 휴가(오이사가 전화해서 내일 현대제철 울산공장 방문 같이 가자고 함)

- 휴가
17:00 수종이 데리려 감(대동초교 병설유치원, 자전거)
17:20 놀이터(대동초교 근처 놀이터):  수종 친구 영진이
18:20 석식(치즈돈가스, 돌솥: 수종)
18:50 수종 친구랑 놈
19:50 귀가
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.04.12(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 현대제철 울산공장 방문

- 본사 복귀[★]
- 현대제철 울산공장 방문
05:00 기상
05:05 챔피언스리그 8강 2차 전[2018.04.05(목)] ==> 레알 바르셀로나 0[4]: 3[4] AS로마): AS로마 4강 진출
06:50 집출발
07:00 오태범 이사 만남(대림역 1번 출구)
==> 이정훈 차장(010-5019-3050)
07:10 서울 출발(오태범 이사 운전)
12:20 현대제철 울산공장 도착
12:30 중식(찌개): 3명
13:20 현대제철 울산공장 방문 재신청(오이사)
13:50 회의(현대제철 울산공장 4층 회의실)
- System 7 교육 ((주)이맥스정보기술 손부장, 여홍구 상무[분석, 설계 담당자], 여성구 사장)
15:20 현대제철 울산공장 견학
14:20 종료
14:25 현대제철 울산공장 출발
18:30 석식(떡라면: 문경 휴게소) ==> 이정훈 차장이 운전
21:20 건대입구역 도착
22:00 귀가(오이사 차)
23:40 취침
==============================================================================================================

- 현대제철 프로젝트 회의 내용
1. 담당자: 이성탁 차장(현대 오토에버), 김동학 차장(현대제철 현업), 김선균 과장(현대제철 현업) 
2. (주)이맥스정보기술 여홍구 상무[분석, 설계 담당자]가 설계서를 제대로 작성해줘야 함
  1) System 7가 패키지이기 때문에 산출물이 없다고 함 ==> VB .NET 소스는 공개 해준다고 함
3. PM의 역할이 중요함 ==> 고객 요구사항이 모호, 이해 당사자가 많음
4. 전자결재 시스템을 러프하게 개발할 것을 요구
  1) 현대제철 그룹웨어 시스템의 전자결재 시스템과 연계까지 검토하라고 함(협의 후 확정이 필요)
5. 초기에 기초코드를 우선 개발할 것을 요구
  1) 전체 화면, 디자인을 확정하고 컨펌 받는 것이 우선이라 판단됨
6. Tomcat(Window 기반)으로 웹서버 설정하라고 함
  1) 고객이 FSP 서버를 구입을 했기 때문에 FSP 서버로 셋팅하면 문제가 없다고 함
  2) 고객은 UI공통과 서버 공통(AA)의 역할을 구분 못하고 같이 하라고 함
7. 리포트 문제(리포트 툴 구매 안함)
  1) AS-IS는 엑셀로 샘플 만들어서 DATA를 뿌려주면서 리포트가 생성된다고 함(20 여종)
  2) TO-BE는 JAVA로 개발하면 되는 지 확인 필요
8. 파일 FTP 전송 처리
  1) AS-IS는 Binary 형태로 DB에 저장(용량이 너무 커짐)
  2) TO-BE는 파일을 FTP로 전송하여 Storage에 저장할 예정
  3) JAVA로 FTP에 직접 파일을 업로드 ==> http://blog.naver.com/famlilia/100043795115
9. 기타 사항
  1) 개발 기간: 8개월(10월 15일 오픈 예정, 12월 15일 철수)
  2) 프로젝트 장소: 현대제철 예산공장 1공장 중회의실
  3) 해상도 문제는 다음주 월요일 디자이너와 같이 참석해서 회의하기 함
  4) 영등포역에서 삽교역까지 무궁화호 운행(8,400원)
--------------------------------------------------------------------------------------------------------------

- System 7
1. (주)이맥스정보기술의 패키지 프로그램(AS-IS)
2. VB .NET 프로그램(IIS, MS-SQL DB ==> 티베로 DB로 전환해야 함)
--------------------------------------------------------------------------------------------------------------

- FSP 서버
http://www.softzam.com/sub1_1.jsp, tamario12 / hp수*16*1@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.13(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 ==> 은행연합회 최종 철수(18시, 구부장 외)

- 본사 복귀[★]
- 공통 소스 분석
1. nexacro_showcase(/nexacro.xprj)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.14(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

- 주말
10:00 기상
10:30 조식
12:00 중식
12:10 집출발(수종)
12:20 대림역 정류장(6511번 버스: 수종): 비 조금 옴
13:20 서울대 정류장 도착
13:50 관악문화도서관 1층
14:40 관악문화도서관 3층
15:20 관악문화도서관 식당(정식 부페[4천 5백원]: 수종[2천원])
16:10 종료
17:10 대림역 정류장 도착
17:20 수미집 근처 골목: 수종 친구들이 같이 놈
18:40 종료
18:50 귀가
19:30 석식(라면)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.15(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

▦ 축구
10:00 기상
10:30 조식
12:00 중식 ==> 루옌 혼자 외출. 축구 회비(3월, 4월: 은혜교회팀) 송금
15:00 집출발(자전거)
15:40 대림운동장 
16:00 게임(은혜교회팀: 어울림 ==> 3 쿼터 뜀)
18:10 종료
18:30 귀가
19:10 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.16(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:30 ~ 18:00 ==> 

- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 현대제철 AP 품질관리 시스템 구축 Prj 첫날
05:45 기상
06:10 대림역 정류자(6411번 버스)
07:10 본사 도착
07:40 파견 짐 정리(모니터, 노트북) ==> 짐 3개(모니터 박스, 캐리어, 가방)
08:00 오이사, 이정훈 차장 도착 ==> 이정훈 차장 축구 하다가 무릎 다침
08:10 본사 출발
09:30 화성휴게소 ==> 공준구 PM(BMW 520 운전, 처가댁이 예산) 만남
10:30 현대제철 1공장(심원개발) 도착 ==> 황미숙 팀장(디자이너) 만남
--> 현대제철 1공장(심원개발): 충남 예산군 삽교읍 산단1길 131
10:40 경비실에서 임시 출입증 받음(핸드폰 스티커 부착)
10:50 프로젝트 관련 회의 ==> 심정보 부장(현대 오토에버), 최진기 차장, 여홍구 상무(분석, 설계) 참석
--> 킥오프: 다음주 월, 화 : 
--> WBS, 사업수행계획서: 이번주 까지
--> FSP 서버 셋팅: 이번주 수요일에 소프트잼에서 방문해서 서버 셋팅하고 교육 해준다고 함
--> 1공장 1층 식당 사용 가능(중식, 석식: 4천원)
11:40 공장 출발: 오이사 차
12:00 원룸 구하기 ==> 부동산뉴스 김정태 대표(010-6705-9998, 041-338-6699)
--> 휴먼스빌 406호[충남 예산군 삽교읍 두리학교길 2] ==> 6440 0339* 123*
--> 월 35만원(보증금 3백 만원에 계약): 이석부 사장이 보증금 6백만원 묶여서 화냈다고 함
13:00 중식(어죽: 대흥식당): 오이사, 이차장, 공PM, 황팀장
13:40 커피?
14:30 현대제철 1공장(심원개발) 도착 
16:00 프로젝트룸 자리 배치 ==> 랜선 연결
16:30 프로젝트 관련 회의 ==> 이상탁 차장(오토에버) 설명 
--> 출퇴근 시간: 8 ~18 ==> 금요일은 17시 퇴근 가능
17:30 종료
17:50 퇴근 ==> 공준구 PM 장모님집에 귀가
18:20 귀가 ==> 오이사가 황팀장과 운전해서 서울로 감(오이사 식대로 2만원 주고 감)
18:00 짐정리 
18:20 석식(떡볶이, 김밥: 반찬 가게): 이차장
18:40 쇼핑(농협 하나로 마트)
19:40 숙소 귀가
24:00 취침
==============================================================================================================

- 현대제철 프로젝트 회의 내용[2018.04.16(월) 16:30]
1. 참석: 심정보 부장(현대 오토에버), 이성탁 차장(현대 오토에버), 여홍구 상무(분석, 설계), 공준구 PM, 황팀장
2. Chart 개발
  1) 현재 사용하고 있는 rMate차트가 HTML5용 인지 확인 필요 ==> HTML5용 맞음
3. 공정별 품질 데이터 수집 내역
 1) LV2에서 MES 시스템 전송
4. AS-IS에 메일링 시스템은 미존재
 1) AS-IS에 SMS 시스템은 존재
5. 우선 순위에 따른 순차적 오픈 검토
 1) 시스템 신뢰도를 떨어뜨릴 수 있음
 2) 전체 시스템이 유기적으로 연관이 되어 있어서 작업 공수가 2 ~ 3배로 들어갈 수도 있음
==============================================================================================================

- 프로젝트 파견 준비물[2018.04.16(월)] 
A. 개발 사무실에서 필요한 물품
1. 노트북 장비
 1) 노트북, 노트북 받침대, USB 키보드 세트, 마우스(예비), 마우스 패드, 모니터, 부팅 USB, USB
2. 기타
 1) 핸드폰 충전기, 이어폰, USB 선풍기, 슬리퍼, 칫솔, 치약, 우산, 컵, 수첩, 구두컵
==============================================================================================================

- 프로젝트 파견 지방 출장시 준비물
A. 숙소에서 필요한 물품
1. 옷
 1) Y셔츠 2벌, 체육복(상하), 반팔 T-셔츠, 양발 4벌, 수건 2개
2. 새면 도구
 1) 칫솔, 치약, 떼 타올, 면도기, 비누, 빛, 남성 크림, 과도(칼), 컵
3. 기타
 1) 침낭, 베게, 우산, 샌들, 옷걸이(4개), 핸드폰 충전기, 빚자루, 방석, 커피 포터
------------------------------------------------------------------------------------

B. 개발 사무실에서 필요한 물품
1. 노트북 장비
 1) 노트북, USB 키보드 세트, 마우스(예비), 키보드, 부팅CD, USB
2. 기타
 1) 핸드폰 충전기, 이어폰, USB 선풍기, 슬리퍼, 칫솔, 치약, 우산, 컵, 수첩
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.17(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:30 ==> 이정훈 차장 무릎 치료하러 서울에 감(07:30)

- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- PC 환경 셋팅
1. 기본 프로그램 설치
 1) 
==============================================================================================================

- 개발 환경 셋팅
1. JDK 설치
 1) jdk-8u112-windows-x64.exe 서버에 설치됨[64 비트]
 2) jdk-8u112-windows-i586.exe ==> http://www.filesetups.com/windows/browsers/java-runtime-environment-8.0-update-112-32-bit 
==============================================================================================================

- 서버 IP
개발계 IP: 10.10.180.91
운영계#1  IP: 10.10.221.91
운영계#2  IP: 서버 구성 중이라 나중에 결정됨.
==============================================================================================================

- nexacro14_client_license.xml
<?xml version="1.0" encoding="utf-8"?>
<license version="1.0">
<product>
<name>nexacro&#32;platform</name>
<version>14</version>
<function>Windows,&#32;WindowsRT,&#32;MAC</function>
</product>
<customer>
<name>자동차부품_생산/품질_모니터링_시스템</name>
<developerCount>0</developerCount>
<rootDomain>10.10.221.91,10.10.180.91</rootDomain>
<targetPlatform>Runtime,HTML5</targetPlatform>
</customer>
<date>
<activation>2016-12-29</activation>
<term>0</term>
</date>
<key>SV97W8UEUF1VH57ADTXHQZ7ACQJ4DF6C9</key>
</license>
----------------------------------------------------------------------------------------

- nexacro14_client_license.xml
<?xml version="1.0" encoding="utf-8"?>
<license version="1.0">
<product>
<name>nexacro&#32;platform</name>
<version>14</version>
<function>Windows,&#32;WindowsRT,&#32;MAC</function>
</product>
<customer>
<name>자동차부품_생산/품질_모니터링_시스템</name>
<coreCount>4</coreCount>
<ipAddress>10.10.221.91,10.10.180.91</ipAddress>
<targetPlatform>Runtime,HTML5</targetPlatform>
</customer>
<date>
<activation>2016-12-29</activation>
<term>0</term>
</date>
<key>5PGKUCR3RKEBMP3UEJFXMMSRHRUU12KC5</key>
</license>
==============================================================================================================

- 현대제철 AP 품질관리 시스템 구축 Prj 와이파이 연결(컴퓨터 셋팅하는 최영석[예산공장 OA 담당자] 과장이 해줌)
1.  simwon1 / simwon007
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.18(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:30 ==> 이정훈 차장 다시 출근(07:30, 다음주 무릎(십자 인대) 수술해야 한다고 함): 철수(10:30) --> PM이 태워줌
							--> 김동학 차장(현대제철 현업) 첫 출근, 숙소에서 걸어서 첫 출근(40분 걸림)
							--> 석식(짬뽕, 탕수육: 여상무, 공준구 PM -> 공PM이 쏨)  

- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- FSP 개발 서버 셋팅(소프트잼[http://www.softzam.com] 담당자)
1. 담당자(소프트잼 정재훈 사원: 010-2923-9318, kkam15@softzam.com) 방문(면담: 13시 ~),  개발, 운영 서버 셋팅
2. 로컬에 설치
 1) 개발툴 설치(FSP 서버 admin 연결) ==> SQLMAP 작성  --> fsp / fsp  --> http://10.10.180.91:8080
  가. http://www.softzam.com/fspxe
  나. ds_server = ds_local(좌 <- 우)		// inDs(S <- I)
  다. ds_local =  ds_server(좌 <- 우)		// outDs(S <- I)
----------------------------------------------------------------------------------------

- FSP server 교육자료  
1. FSPserver 참고자료 사이트 ==> https://softzam.atlassian.net/wiki/spaces/svrdoc/overview
==============================================================================================================

- 프로젝트 소스 파일 백업
1. 사업장에 노트북 들고가서 외장하드로 백업(8.38GB) ==> 최영석 과장
==============================================================================================================

- DB 정보  ==> APQMS
AP품질관리시스템 개발기(티베로)
IP: 10.10.180.175
PORT: 8639
ID: QMSMGR / QMSMGR
SID: HSMESDEV
==============================================================================================================

- Nexacro14 신규템플릿 소스 셋팅
1. 소스 위치: 전자정부프레임워크 ==> http://www.egovframe.go.kr/cop/bbs/selectBoardArticle.do?nttId=912&bbsId=BBSMSTR_000000000006&menu=7
2. 로컬셋팅 에러
nexacro generator (27180): [Fail] Failed Copy File... : D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\nxui\nexacro14lib\framework\SystemBase_Runtime.js
nexacro generator (27180): [Fail] Failed Copy File... : D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\nxui\nexacro14lib\framework\Platform_Runtime.js
==============================================================================================================

- 테베로 DB 엑셀
1. http://bluepeter.tistory.com/47
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.04.19(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 숙소에서 걸어서  출근(32분 걸림), 사업장 선 정리 완료, 정수기 재 설치(고장 아니라고 함)
, 엄마 기독병원에 입원(깁스한 손목이 문제 생김: 내일 수술한다고 함)

- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- FSP 로컬 서버 셋팅 
1. java 없이 세팅할 것
2. nexacro 환경 설정
 1) General ==> C:\APQMS\workspace\ap_qms\src\main
 2) Buld
  가. General Path[결과물]: C:\APQMS\workspace\ap_qms\src\main\webapp
  나. Base Lib Path: C:\APQMS\workspace\ap_qms\src\main\nxui\nexacro14lib
==============================================================================================================

- FSP 서버 분석
1. FSPserver 개발 방법
 1) FSPserver를 이용한 개발은 SQLMAP을 중심으로 개발
 2) Java를 이용하여 직접 코딩하는 경우와 그렇지 않은 2가지의 개발 방법 사용
 3) Java를 코딩 없이 처리 가능한 Client는 MiPlatform, XPLATFORM, nexacro platform, html 이 가능
2. UI 공통 스크립트
 가. UI가 투비소프트의 nexacro일 경우 FSPserver와 연동하기 위해 필요한 스크립트 
 나. 자바 코딩을 하지 않을 경우에 사용하는 SQLMAP에 대한 처리를 요청하는 함수 및 서버와 통신을 담당하는 함수 등으로 구성  
==============================================================================================================
 
- LS_QMS_DEMO 설치
1. D:\LS_QMS_DEMO\System7.Load (2).exe: 더블 클릭 --> admin / qwer@123
==============================================================================================================

- DBeaver DB에서 Tibero DB 연결 방법
1. http://gubok.tistory.com/476
-------------------------------------------------------------------------------

- DBeaver DB에서 Tibero JDBC 설정
1. Settings
 1) Driver Name: Tibero											2) Driver Type: Generic
 3) Class Name: com.tmax.tibero.jdbc.TbDriver 
 4) URL Template: jdbc:tibero:thin:@{host}[:{port}]:{database}
 5) Driver Name: 8629
 6) Libaries: D:\01. TAMA_DATA\51. TAMA SW\개발 환경\3.Tibero클라이언트설치\tibero6-jdbc.jar
--------------------------------------------------------------------------------------------------------------

- DBeaver DB에서 Tibero 연결
1. Create new connection
 1) Tibero 선택 => Nexnt >
2. Generic JDBC Connection Settings
 1) General
    가. JDBC URL: jdbc:tibero:thin:@10.10.180.175:8639:HSMESDEV
나. HOST: 10.10.180.175							다. PORT: 8639
라. Databse/Schema: HSMESDEV
마. User Name: QMSMGR
바. Password: QMSMGR 
--------------------------------------------------------------------------------------------------------------

- 현대제철 Prj DB 정보  ==> APQMS
AP품질관리시스템 개발기(티베로)
IP: 10.10.180.175
PORT: 8639
ID: QMSMGR, / QMSMGR
SID: HSMESDEV 
--------------------------------------------------------------------------------------------------------------

- 티맥스 티베로 다운로드
1. 기술 정보 ==> https://technet.tmaxsoft.com, tamario@naver.com/ tama339 
2. tibero6-jdbc.jar 다운로드 ==> https://technet.tmaxsoft.com/ko/front/support/qna/viewQna.do?board_seq=CUST-20160921-000007
==============================================================================================================

- Nexacro14 신규템플릿 서버 셋팅
0. 소스 위치: 전자정부프레임워크 ==> http://www.egovframe.go.kr/cop/bbs/selectBoardArticle.do?nttId=912&bbsId=BBSMSTR_000000000006&menu=7
1. 표준프레임웍3.2 개발자 개발 환경 설치
2. eGovFrame-3.2.7z 파일을 다운로드
 1) eGovFrame-3.2.7z 파일을 복사하여 D:\eGovFrame-3.2 폴더에 붙여넣기
91. 자료(Nexacro14 신규템플릿)
apache-tomcat7
eclipse
jdk1.7.0_21
maven
mysql-5.6.21
workspace
00. Nexacro14 신규템플릿 정보.txt
01. Nexacro14 신규템플릿_eclipse.exe 파일 설정 ==> D:\eGovFrame-3.2\eclipse\eclipse.exe -vm 
D:\eGovFrame-3.2\jdk1.7.0_21\bin\javaw.exe -data D:\eGovFrame-3.2\workspace
 2) nexacro 환경 설정
 1) D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\nxui\nxui.xprj   ==> 더블 클릭
 2) General 환경 설정
  가. General ==> D:\eGovFrame-3.2\workspace\nexacroplatform\src\main
 3) Buld 환경 설정
  가. General Path[결과물]: D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\webapp
  나. Base Lib Path: D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\nxui\nexacro14lib
 3) General Application  ==> 더블 클릭
 4) D:\eGovFrame-3.2\workspace\nexacroplatform\src\main\webapp\nxui폴더에 생성 ==> HTML5 소스가 생성됨
3. Maven 환경 설정
 1) D:/eGovFrame-3.2/maven/settings.xml 파일의 localRepository 항목의 값을 다음과 같이 수정
4. JDK 설치  
 1)  01. Nexacro14 신규템플릿_eclipse.exe 파일에 설정
==> D:\eGovFrame-3.2\eclipse\eclipse.exe -vm D:\eGovFrame-3.2\jdk1.7.0_21\bin\javaw.exe -data D:\eGovFrame-3.2\workspace
5. MySQL 설치
 1) 00. mysql- DB 서버 실행 [★].bat ==> 더블 클릭
6. nexacroplatform 프로젝트 임포트 및 환경 설정
==> D:\eGovFrame-3.2\workspace\nexacroplatform
7. Apache-Tomcat 서버 설치 
 1) 톰캣오류 
   가. 현상: The specified Tomcat installation directory does not exist.
   나. 조치: Windows -> Preferences -> Server -> Runtime Environments -> 서버선택 -> Edit
-> Tomcat installation directory에서 톰캣 경로 변경  ==> D:\eGovFrame-3.2\apache-tomcat7
  2) eclipse 실행 에러
   가. 현상: The archive: C:/eGovFrame-3.2/apache-tomcat7/bin/tomcat-juli.jar which is referenced by the classpath, does not exist.
   나. 조치: Server에서 tomcat를 선택하고 더블 클릭 > open launch configuration 클릭 > Edit launch configuration properties(새창) 
> Classpath 변경 --> tomcat-juli.jar ==> D:\eGovFrame-3.2\apache-tomcat7, bootstrap.jar ==> D:\eGovFrame-3.2\apache-tomcat7
 3) CATALINA_HOME 설정 ==> D:\eGovFrame-3.2\apache-tomcat7 
8. 브라우저 실행
 1) 프로젝트 마우스 우클릭 후 “Run As > Maven Install” 을 선택한다
 2) 브라우저 실행 ==> http://localhost/nxui/index.html
9. 설정 후 D:\eGovFrame-3.2 파일 용랑 ==> 2.75GB
==============================================================================================================

- eclipse 에러
1. 현상: Could not write metadata for '/RemoteSystemsTempFiles'.
D:\eGovFrame-3.2\workspace\.metadata\.plugins\org.eclipse.core.resources\.projects\RemoteSystemsTempFiles
\.markers.snap (지정된 경로를 찾을 수 없습니다)
2. 조치: D:\eGovFrame-3.2\workspace 폴더에 하위에 RemoteSystemsTempFiles 폴더 삭제
 http://smartjuho.tistory.com/entry/%EC%9D%B4%ED%81%B4%EB%A6%BD%EC%8A%A4-Remote-System
 -%EC%97%90%EC%84%9C-%EC%BD%94%EB%93%9C-%EC%96%B4%EC%8B%9C%EC%8A%A4%ED%8A%B8-%EB%B0%9B%EA%B8%B0
1) .project 파일에서
<?xml version="1.0" encoding="UTF-8"?>
<projectDescription>
<name>RemoteSystemsTempFiles</name>
<comment></comment>
<projects>
</projects>
<buildSpec>
</buildSpec>
<natures>
<nature>org.eclipse.wst.jsdt.core.jsNature</nature> 
<nature>org.eclipse.php.core.PHPNature</nature> 
</natures>
</projectDescription>
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.04.20(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:40 ~ 19:50 ==> 엄마 손목 수술(10시, 포항 기독병원), 서울행(20:12 ~ 22:07, 삽교역 -> 영등포역)

- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- FSP 로컬 서버 셋팅
1. java 없이 세팅할 것
2. nexacro 환경 설정
 1) General ==> D:\QMS\APQMS\workspace\APQMS\src\main
 2) Buld
  가. General Path[결과물]: D:\QMS\APQMS\workspace\APQMS\src\main\webapp
  나. Base Lib Path: D:\QMS\APQMS\workspace\APQMS\src\main\APQMS\nexacro14lib
==============================================================================================================

- FSP 서버 분석
1. FSPserver 개발 방법
 1) FSPserver를 이용한 개발은 SQLMAP을 중심으로 개발
 2) Java를 이용하여 직접 코딩하는 경우와 그렇지 않은 2가지의 개발 방법 사용
 3) Java를 코딩 없이 처리 가능한 Client는 MiPlatform, XPLATFORM, nexacro platform, html 이 가능
2. UI 공통 스크립트
 가. UI가 투비소프트의 nexacro일 경우 FSPserver와 연동하기 위해 필요한 스크립트 
 나. 자바 코딩을 하지 않을 경우에 사용하는 SQLMAP에 대한 처리를 요청하는 함수 및 서버와 통신을 담당하는 함수 등으로 구성  
==============================================================================================================
 
- 소프트잼 원격지원(Remote Call)  
1. http://113366.com ==>  정재훈 대리가 지원 해줌
2. FSP 로컬 서버 셋팅 ==> 1차 해결 
-------------------------------------------------------------------------------------------

- 원격지원(Remote Call) 정보
1. RemoteCall5.0-agent-ko-KR.exe ==> http://auto-download.com/download/get/dIiJF9jpba/remotecall5_0-agent-ko-kr_exe.html
http://www.remotecall.net/contents/ko/guide/guide_usingmethod.asp
==============================================================================================================
 
- Tomcat 실행 에러[apache-tomcat-8 서버 포터 변경]
1. 현상: D:\QMS\APQMS\workspace\APQMS\src\main\webapp\ 변경 후 에러 발생
 2018-04-20 16:03:09 Commons Daemon procrun stdout initialized
2018/04/20 16:03:11,SYSTEM_INFO,[SVCL_00005]ServiceURL was set up : file:/D:/QMS/APQMS/workspace/APQMS/src/main/webapp/WEB-INF/fsp/conf/service.xml
2018/04/20 16:08:38,SYSTEM_ERROR,[SVC__00058]Exception occurred in stop() processing of Service "FSPManager#DatasourceJndiFinder"
javax.naming.OperationNotSupportedException: Context is read only
2. 조치: http://localhost/APQMS/index.html로 설정
3. 원인: 8080 포터 문제[80 포터로 변경] --> C:\Program Files\Apache Software Foundation\Tomcat 8.5\conf\server.xml 파일에서
  <Service name="Catalina">  	
<!--// 수정[apache-tomcat 기본 포터 설정]: 2018.04.20, by 진태만 //-->
    <Connector port="80" protocol="HTTP/1.1"
               connectionTimeout="20000"
               redirectPort="8443" />
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.21(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

- 주말
10:00 기상
10:20 문서 작업 ==> Nexacro14 신규템플릿 황미숙(hmssii@naver.com) 팀장에게 메일로 발송
12:00 중식
13:00 집출발(수종)
13:20 대림역 정류장(6511번 버스: 수종)
14:00 봉원중 정류장 도착
14:15 어린왕자 키즈카페 서울대입구역점[서울시 관악구 관악로 203 엔젤빌딩]
16:10 종료
16:40 봉천중앙시장 정류장 도착(6511번 버스: 수종) 
17:10 대림역 정류장 도착 
17:20 귀가
17:30 대림역(지하철)
==> 황미숙(hmssii@naver.com) 팀장과 공통 표준에 대해 이야기함
18:10 을지로 3가역 도착(지하철)
18:20 동강나루 식당(매운탕: 태용, 현용, 호수 만남)
20:10 종료
20:20 당구(현용: 1등, 내: 2등[당구비: 8천원], 3등(호수: 2차 내기), 태용(1차 쏨)
21:10 종료
21:20 골뱅이 식당(호수가 쏨)
23:10 종료
23:50 귀가
02:00 취침
==============================================================================================================
 
- 어린왕자 키즈카페
1. 입장료: 만 천원 ==> 놀이(2시간): 7천원, 음료(아메리카노 커피): 4천원
2. 아이스크림: 3천원 ==> 총 만 4천원 지불
==============================================================================================================
 
- DBeaver import
https://github.com/dbeaver/dbeaver/issues/722

- Tibero Excel Data import
http://bluepeter.tistory.com/47

- MSSQL vs Tibero 타입/함수 비교 
https://m.blog.naver.com/PostView.nhn?blogId=miraeku00&logNo=30158061931&proxyReferer=https%3A%2F%2Fwww.google.co.kr%2F
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.04.22(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

▦ 축구
09:00 기상
09:30 조식
10:30 집출발(자전거, 수종) ==> 다이소 대림2호점(욕실화, 떼 타올 구입) 
11:00 귀가  --> 비옴
12:00 중식(김밥)
15:00 집출발(자전거) --> 비옴
15:20 다이소 남구로시장점 ==> 빚자루 셋트 구입
15:50 대림운동장 
16:00 게임(은혜교회팀: 어울림 ==> 4 쿼터 뜀): 비옴
==> 컨디션 아주 좋았음(예산에서 걸어서 출퇴근 효과로 예상됨)
18:30 종료
18:40 귀가 ==> 옷, 축구화 다 젖음
19:30 석식
21:30 취침(루옌: 오랜만에 관계)
==> 루옌, 수종 5월 26일(토)에 베트남 1달간 간다고 함: 항공권 알아볼 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.23(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 ==> 예산행(05:43 ~ 07:35 , 영등포역 -> 삽교역): 비옴, 황원철 부장(PL: 010 9078 7066) 투입,  공준구PM 철수
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★] 
- UI 공통 일정 계획 문서 작성
1. UI공통 WBS[S-18-0829-01-WBS_v1.00-QMS방법론(UI공통).xlsx] 작성하여 여홍구 상무(PM)에게 메일 보냄
==============================================================================================================

- 현대제철 Prj 킥오프(13:30, 예산)
1. 4/23(화), 예산공장 현대제철 3층 대회의실(심원개발 예산2공장)
2. AP품질보증팀장 주관, 관련 현대제철/심원개발 인원 참여
3. 여홍구 상무 발표 ==> 무사히 끝났다고 함
--------------------------------------------------------------------------------------------------

- 현대제철 Prj 킥오프 회식(18:30 ~ 22:00)
1. 1차 삽교읍 고기 식당: 오태범 이사, 황원철 부장, 여홍구 상무, 이상탁 차장(현대 오토에버) ==> 오태범 이사가 쏨
 1) 공준구PM 철수 확정(업무 부담으로 철수한다고 함: 개발자 총 3명 더 투입하기로 함)
 2) 여홍구 상무 PM 임명(분석, 설계 업무 포함, 노무현 대통령 시절 기재부 장관상 받았다고 함)
 3) 김동학 차장 불참, 심정보 차장 불참 ==> 불미스런 사건(하청에 갑질)이 발생한 이후로 조심하고 있다고 함
 4) 리포리 툴 구입: Ubi Report(유비 리포트: 이번 프로젝트에서는 무료로 사용 가능)
2. 2차 삽교읍 호프집(투다리): 오태범 이사, 황원철 부장, 여홍구 상무, 이상탁 차장(현대 오토에버) ==> 이상탁 차장이 쏨
==============================================================================================================

- 현대하이스코 울산 통합MES 개발 환경 설정
1. C:\HUMES,  1515533, xlrxkr!17(틱탁!17) 
--------------------------------------------------------------------------------------------------

<!-- HSMESDEV(Tibero) DB  -->
<Resource name="MESJNDI" auth="Container"                                                    
  type="javax.sql.DataSource" driverClassName="com.tmax.tibero.jdbc.TbDriver"
  url="jdbc:tibero:thin:@10.10.180.175:8639:HSMESDEV"
  username="QMSMGR" password="QMSMGR" maxActive="3" maxIdle="3"
  maxWait="-1" />
 
2018/04/23 11:55:11,SYSTEM_INFO,[SUIA_00004]Execute rollback called from "10.245.178.43" [Time : 2018/04/23 11:55:11].
2018/04/23 11:55:11,SYSTEM_ERROR,[SUIA_00003]It failed to execute action method called from "10.245.178.43".
com.sz.lang.ServiceException: NamingException key is MESJNDI


2018. 4. 23 오후 1:32:15 org.apache.catalina.startup.TldConfig execute
정보: At least one JAR was scanned for TLDs yet contained no TLDs. Enable debug logging for this logger for a 
complete list of JARs that were scanned but no TLDs were found in them. Skipping unneeded JARs during scanning 
can improve startup time and JSP compilation time.
2018. 4. 23 오후 1:32:15 org.apache.catalina.core.NamingContextListener addResource
경고: Failed to register in JMX: javax.naming.NamingException: Could not create resource factory instance [Root 
exception is java.lang.ClassNotFoundException: org.apache.tomcat.dbcp.dbcp2.BasicDataSourceFactory]
2018. 4. 23 오후 1:32:15 org.apache.tomcat.websocket.server.WsSci onStartup
정보: JSR 356 WebSocket (Java WebSocket 1.1) support is not available when running on Java 6. To suppress this 
message, run Tomcat on Java 7, remove the WebSocket JARs from $CATALINA_HOME/lib or add the WebSocket JARs to 
the tomcat.util.scan.DefaultJarScanner.jarsToSkip property in $CATALINA_BASE/conf/catalina.properties. Note that the 
deprecated Tomcat 7 WebSocket API will be available. 
2018/04/23 13:32:15,SYSTEM_INFO,[SVCL_00005]ServiceURL was set up : file:/C:/HUMES/workspace/HUMES/WebContent
/WEB-INF/fsp/conf/service.xml
==============================================================================================================

- 루옌, 수종 베트남 여행
1. 5월 26일(토) 출발
 1) 다음주 1주동안 현장 학습 처리 가능
 2) 6월달 한달 결석 ==> 급식비만 내면 됨
2. 처가 체류기간 만료: 5월 27일 출국 ==> 한달 후 다시 입국 가능(아이가 7살까지 가능)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.24(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00 ==> 출근(여상무님 차), 노트북 가져옴(데이타 소스 이관), 자리 이동(공준구PM 자리로 옮김)
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 현대하이스코 울산 통합MES 분석
 1) 이상탁 차장이 현대하이스코 소스(XPLATFORM)을 기준하여 UI 공통 개발하라고 함
 2) 여홍구 상무님(PM), 오태범 이사도 그렇게 하라고 함
 3) 공통 데이타
가. 현대하이스코 DB 사용(Tibero DB)
나. 기준, 기초, 업무 데이타 ==> system7 패키지 프로그램 DB(MS-SQL)을 전환해서 사용
 4) 해상도 ==> 1280, 984
--------------------------------------------------------------------------------------------------------------

- clipse 실행 에러
An internal error occurred during: "JSP Index Manager: Processing Resource Events".
java.lang.NullPointerException

- clipse 실행 에러
1. 현상1:
경고: Failed to register in JMX: javax.naming.NamingException: Could not create resource factory instance 
[Root exception is java.lang.ClassNotFoundException: org.apache.tomcat.dbcp.dbcp2.BasicDataSourceFactory] 
1. 현상2: 
경고: Failed to register in JMX: javax.naming.NamingException: Could not create resource factory instance 
[Root exception is java.lang.ClassNotFoundException: org.apache.tomcat.dbcp.dbcp2.BasicDataSourceFactory]
2. 조치: /context.xml 파일에서 factory 추가 ==> http://diaryofgreen.tistory.com/113
<Context reloadable="true">
<!-- HSMESDEV(Tibero DB) -->
<Resource name="MESJNDI" auth="Container"                                                    
type="javax.sql.DataSource" driverClassName="com.tmax.tibero.jdbc.TbDriver"
url="jdbc:tibero:thin:@10.10.111.112:8629:MESPRD"
username="MESAPUSER" password="rhehghk!mes" maxActive="3" maxIdle="3"
maxWait="-1"  factory="org.apache.tomcat.dbcp.dbcp.BasicDataSourceFactory" />
</Context>
==============================================================================================================

- 넥사크로 client 라이센스(client_license) 설정
1. *.xadl(/APQMS.xadl) 파일에서
 licenseurl=..\..\..\..\..\..\..\01. TAMA_DATA\51. TAMA SW\개발환경\4.넥사크로설치\넥사크로라이센스\nexacro14_client_license.xml" 
==============================================================================================================

- 프린터 출력 가능
1. IP: 10.245.178.45
2. 프린터명: FX ApeosPort-IV C3371 PCL 6
3. 구성(탭) > 인증 > 인증(C): 작업 소유자명 지정(Y): 작업 소유자명 입력 --> 사용자 ID 지정(E): 1519927(확인: 클릭)
4. 프린터 앞에서 ==>  개인프린트(클릭) > 인증(클릭) > 등록사용자: 1519927(다음: 클릭) > 등록사용자: 1519927(확정: 클릭)
==============================================================================================================

- 항공권 구입[베트남 방문(07:15, 루옌)
. 웹투어 --> http://www2.webtour.com/GMypage/index.asp, tamario2 / hp수*16*1@
1. 비엣젯항공(0925편): 인천[05/26(토) 07:15]  ==> 하이퐁[05/26(토) 10:00], 일반석 2석 OK    
2. 비엣젯항공(0926편): 하이퐁[06/23(토) 23:30]  ==> 인천[06/24(일) 06:15], 일반석 2석 OK  
 1) 항공료: 580,200원[웹투어]  --> 578,200원(할인) 
 2)  신한은행(예금주: 웹투어_항공권)으로 송금할 것) ==> 오늘 13시까지 결제할 것
-----------------------------------------------------------------------------------------------

- 항공권 구입
1. 익스피디아(결제: 해외 신용카드) ==> https://www.expedia.co.kr, tamario@naver.com / hp수*16*1@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.25(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:30 ==> 주간보고서 작성,  지아이데이타 사업자등록증 팩스로 받을 것(식대 정산, Fax: 041-338-9128): 완료
								, 내포신도시 드라이브(내포신도시 -> 덕산: 여상무, 황부장, 커피?: 황부장이 쏨)
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 현대하이스코 울산 통합MES 분석
1. xplatform 소스를 Nexacro 소스로 변환 시도 ==> 수정할 것이 너무 많음
2. Nexacro14 신규템플릿(Nexacro 소스) 기준으로 사용하여 FSP 서버 연동(with java)하는 것이 효율적이라 판단됨
==============================================================================================================

<!--// 추가[Y or N 로컬에서 실행하는 여부]: 2018.04.20, by 진태만 //-->
<Variable id="GV_ISLOCAL" initval="Y"/>
<!--// 추가[서버와 통신 장애 발생시 HTTP 코드 저장]: 2018.04.20, by 진태만 //-->
<Variable id="GV_HTTPCODE"/>
==============================================================================================================
  
- S-18-0829-01-WBS_v1.00-QMS방법론(UI공통)
업무 Task																기간																		시작												종료											가중치								진행율		진척도
1 개발 환경 구축												18 일[=SUM(F7)]												2018-04-16 (월)	[=MIN(G7:G10)]			2018-05-11 (금)[=MAX(H7:H10)]		100.0%												27.8%[=IF(K7>100%,"ERROR",SUM(K7))
1.1 프로젝트 환경설정									18 일[=SUM(F8:F10)]											2018-04-16 (월)[=MIN(G8:G9)]			2018-05-11 (금)	[=MAX(H8:H10)]	100.0%[=$I$6*F7/$F$6]					27.8%[=SUM(K8:K9)]
1.1.1 개발툴(Nexacro) 설치 및 UI환경구성	5 일[=NETWORKDAYS(G8,H8,holidays!A:A)]		2018-04-16 (월)									2018-04-20 (금)								27.8%[=$I$6*F8/$F$6]		100.0%		27.8%[=I8*J8]
1.1.2 프로젝트 개발 환경 셋팅 					9 일[=NETWORKDAYS(G9,H9,holidays!A:A)]		2018-04-23 (월)									2018-05-04 (금)								50.0%[=$I$6*F9/$F$6]						0.0%[=I9*J9]
1.1.3 디자인, 퍼블리싱 적용 완료				4 일[=NETWORKDAYS(G10,H10,holidays!A:A)]	2018-05-08 (화)									2018-05-11 (금)								22.2%[=$I$6*F10/$F$6]					0.0%[=I10*J10]

2 개발 표준안 작성											5 일[=SUM(F12)]												2018-05-14 (월)[=MIN(G12:G13)]			2018-05-18 (금))[=MAX(G12:G13)]	100.0%												0.0%[=IF(K11>100%,"ERROR",SUM(K11))]
2.1 Global 및 Form 변수 								5 일[=SUM(F13:F13)]											2018-05-14 (월)[=MIN(G13:G13)]		 	2018-05-18 (금))[=MAX(G13:G13)]	27.8%[=$I$6*F12/$F$6]					0.0%[=SUM(K13:K13)]
2.1.1 Global 및 Form  								5 일[=NETWORKDAYS(G13,H13,holidays!A:A)		2018-05-14 (월)									2018-05-18 (금)								27.8%[=$I$6*F13/$F$6]					0.0%[=I13*J13]
--------------------------------------------------------------------------------------------------------------

- WBS(UI공통) 칼럼 서식 설정
1. 기간 칼럼 ==> 셀 서식(F) [새창]
 1) 범주(C): 사용자 지정
 2) 형식(T): 0" 일"
2. 시작일 칼럼  ==> 셀 서식(F) [새창]
 1) 범주(C): 사용자 지정
 2) 형식(T): yyyy-mm-dd (aaa)
3. 진척도 칼럼  ==> 셀 서식(F) [새창]
 1) 범주(C): 백분율
 2) 형식(T): 소수 자릿수(D): 1
4. holidays[탭]
 A 칼럼  ==> 셀 서식(F) [새창]
 1) 범주(C): 날짜
 2) 형식(T): *2011-03-14 
==============================================================================================================

- 수종 비자 신청(22시, 숙소)
1. 15일 이상 체류시 체류기간 연장 혹은 새로운 비자를 발급 받아야 합니다.
2. 베트남 비자 발급받는 방법은 크게 3가지 입니다.
 1) 베트남 대사관 비자: 베트남 대사관에 직접 찾아가서 신청 / 7만원 정도
 2.) 도착 비자 (여행사를 통해 비자 신청해야 함): 여행사를 통해 신청 / 2-3만원 정도 (+베트남에 도착해서 수수료 $2
 더 내야함 = 총 5만원 정도) 
 3.) E-비자: 인터넷으로 신청 / $25(약 3만원) ==> 해외 신용 카드나 베트남 신용 카드로 결제 해야됨  
  가. 베트남 비자 발급 사이트 --> http://snowballsb.tistory.com/m/1  
  나. 베트남 전자비자 발급 방법 A to Z --> http://snowballsb.tistory.com/m/1
--------------------------------------------------------------------------------------------------------------

- 비자 발급 승인 여부 조회 ==> https://evisa.xuatnhapcanh.gov.vn/en_US/tra-cuu-ho-so
1. 로그인 정보(신청자 개인 정보)
- Registration code: E180425KORM4939118482
- Email: tamario@naver.com
- Date of birth (DD/MM/YYYY): 24/09/2013
- Passport number: M49391184
- Nationality: Korea (South)
- Applying date: 25/04/2018
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.26(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00 ==> 주간보고(사업장),  엄마 손목 수술 후 퇴원(12시, 포항 기독병원)
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 현대제철 AP 품질관리 시스템  로컬 개발 환경 구축
1. Nexacro14 신규템플릿(Nexacro 소스) 기준으로 사용하여 FSP 서버 연동(with java)하는 것이 효율적이라 판단됨
2. 웹 프로젝트 생성(eclpse에서)
 1) /APQMS  ==> D:\QMS\APQMS\workspace\APQMS
 http://localhost:9080/ ==> http://localhost:80/ 
SystemBase_HTML5.js:7733 POST http://localhost/APQMS/svc_dev::XMain 404 (Not Found)
 
uxs (16200): [/sz_fsp_xp.js] [fsp_callService()] ==> [서버 호출] [TEST_91] [param]fn_callback&false&find&false&1234[serverUrl]
svc_dev::XMain[inData]ds_cond=ds_cond fsp_ds_cmd=fsp_ds_cmd[outData]ds_result=ds_result fsp_ds_cmd=fsp_ds_cmd[arg]
fsp_action="xDefaultAction" fsp_cmd="execute" EMP_ID='dev'  fsp_logId="\"10.245.178.43\""[isHttpAsync]true

[/sz_fsp_nx.xjs] [fsp_callService()] ==> [서버 호출] [TEST_91] [param]fn_callback&false&find&1234[serverUrl]svc_dev::XMain
[inData]ds_cond=ds_cond fsp_ds_cmd=fsp_ds_cmd[outData]ds_result=ds_result fsp_ds_cmd=fsp_ds_cmd[arg]fsp_action
="xDefaultAction" fsp_cmd="execute" undefined fsp_logId=all[isHttpAsync]true[options.nDataType]0[options.bCompress]false

[serverUrl]svc_dev::XMain 
==============================================================================================================

- Nexacro 프로젝트(/nxui.xprj)가 XPlatform로 열림
1. Nexacro 소스 파일은 *.xprj 파일을 더블 클릭해서 열것(/APQMS.xprj --> /APQMS.xprj[★])
2. XPLATFORM 소스 파일은 *.xadl 파일을 더블 클릭해서 열것(/humes.xadl --> /humes.xadl[★]) 
IBK_ORMS.xadl[★]
PYMS.xadl[★]
NH_FIRE.xadl[★]
xui.xprj[★] 
==============================================================================================================

- UI공통 산출물
1. 개발표준 가이드_v1.0.docx
2. 개발_가이드_v1.00.doc
2. 개발자 환경설정 가이드.pptx
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.27(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00 ==> FSP 서버 교육(14시, 예산), 서울행(20:12 ~ 22:07, 삽교역 -> 영등포역)
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 현대제철 AP 품질관리 시스템  로컬 개발 환경 구축
1. 로그인 화면 개발 
 1) nexacro URL 설정 
1. 현상: nexacro._getProtocol is not a function
2. 원인: svc_dev을 설정 안 해줘서 나는 현상
 1) svcurl ==> http://localhost:80/  
---------------------------------------------------------------------------------------------------------------

- 설정
http://localhost/NMain  ==> nexacro: NMain
<Root xmlns="http://www.nexacro.com/platform/dataset" ver="5000">
<Parameters>
<Parameter id="errorSqlCode" type="string"/>
<Parameter id="errorSqlStatus" type="string"/>
<Parameter id="ErrorCode" type="int">-999999999</Parameter>
<Parameter id="ErrorMsg" type="string">Request argument[ fsp_action ] is not found.</Parameter>
</Parameters>
</Root>
==============================================================================================================

- eclipse에서 주석 한글 깨짐
1. 현상: //  * div 李쎌?
2. 조치: Preferences > General > Workspace > Text file encoding
 1) Inherited from container(MS949) --> Other(선택): UTF-8로 변경 --> OK버튼 클릭
==============================================================================================================

- 개발서버 원격 연결
1. HI_TAM4.0 설치 ==> https://10.10.111.232/
2. HI_TAM4.0 로그인 ==> 1519927, / a*as1212@ --> 아이핀 로그인: tamario /
3. 프로토콜 연결 설정
 1) DeviceTree > Server ? 1.파주IDC > 울산공장관리 > 자동차부품 품질 모니터링 AP1_개발계
 2) DeviceTree > Server ? 1.파주IDC > 울산공장관리 > 자동차부품 품질 모니터링 AP1_개발계
==============================================================================================================

- xplatform에서 nexacro로 전환((java에서)
1. /SY_LoginAction.java 파일에서 
public void login(BusinessContext ctx) throws Exception {
System.out.println("[/SY_LoginAction.java] [login()] ==> [로그인 처리] [TEST_01]" );

HyscoCommonXplatformIF service = (HyscoCommonXplatformIF)ServiceManagerFactory.getServiceObject(getBizServiceName());

DataSet oCondDs = (DataSet)ctx.getInputObject("ds_cond");

if( oCondDs != null && oCondDs.getRowCount() > 0 ) { 
if(fSSO == null) { 	// SSO가 아니면 
//MES사용자정보체크 20150530 by lst
PasswordEncrypt pwEnc = new PasswordEncrypt();

oCondDs.set(0, "ENC_PASSWORD", pwEnc.makeSHA256AndBase64(sPassword));		// 비밀번호 암호화
 
ctx.addOutput("ds_result", service.search("sy:SY_UserInfoInq_S01", oCondDs));		// 사용자정보가져오기[sql 요청 객체] 호출
}		
}		
}

1. /SY_LoginAction.java 파일에서
public void login(BusinessContext ctx) throws Exception {
System.out.println("[/SY_LoginAction.java] [login()] ==> [로그인 처리] [TEST_01]" );

HyscoCommonXplatformIF service = (HyscoCommonXplatformIF)ServiceManagerFactory.getServiceObject(getBizServiceName());

DataSet oCondDs = (DataSet)ctx.getInputObject("ds_cond");

if( oCondDs != null && oCondDs.getRowCount() > 0 ) { 
if(fSSO == null) { 	// SSO가 아니면
//MES사용자정보체크 20150530 by lst
PasswordEncrypt pwEnc = new PasswordEncrypt();

oCondDs.set(0, "ENC_PASSWORD", pwEnc.makeSHA256AndBase64(sPassword));		// 비밀번호 암호화
 
ctx.addOutput("ds_result", service.search("sy:SY_UserInfoInq_S01", oCondDs));		// 사용자정보가져오기[sql 요청 객체] 호출
}		
}	

2. /HyscoCommonXplatformService.java  파일에서	
// import com.tobesoft.xplatform.data.DataSet;		/ /xplatform 에서
import com.nexacro.xapi.data.DataSet;				// nexacro 에서

public DataSet search(String queryId, DataSet inDs) throws Exception {

// SqlExecutor sqlExecutor = SqlMapFactoryHelper.makeSqlExecutor(getConnection(), SqlMapFactoryHelper.XDATASET);		// executor 생성(xplatform 에서)
// DataSetSqlRequest sqlRequest = SqlMapFactoryHelper.makeXDataSetSqlRequest(queryId);												 // xplatform 에서
SqlExecutor sqlExecutor = SqlMapFactoryHelper.makeSqlExecutor(getConnection(), SqlMapFactoryHelper.NEXACRO);			// executor 생성(nexacro 에서)
DataSetSqlRequest sqlRequest = SqlMapFactoryHelper.makeDataSetSqlRequest(queryId, SqlMapFactoryHelper.NEXACRO);	 // nexacro 에서

if( inDs != null ) {
sqlRequest.addParamObject(sqlRequest.getInputName(), inDs);
}

return (DataSet)sqlExecutor.query(sqlRequest).getResultObject();
}
--------------------------------------------------------------------------------------------------------------
 
- 서비스 설정 (/service.xml 파일에서)
<!--// SY_Login Action: 추가[로그인 처리]: 2018.04.27, by 진태만 // -->
<service name="SY_LoginAction" code="com.hysco.mes.sy.action.SY_LoginAction">
<attribute name="BizServiceName">HyscoCommonXplatformService</attribute>
<attribute name="ResourceFactoryServiceName">#DefaultConnectionFactory</attribute>
<attribute name="SystemLoggerServiceName">#DebugLogService</attribute>
<depends>DebugLogService</depends>
<depends>DefaultConnectionFactory</depends>
</service>

<!--// HyscoCommonXplatformService service: 추가[로그인 처리]: 2018.04.27, by 진태만 // -->
<service name="HyscoCommonXplatformService" code="com.hysco.mes.common.xplatform.service.HyscoCommonXplatformService">
<attribute name="JournalMode">false</attribute>
<attribute name="ResourceFactoryServiceName">#DefaultConnectionFactory</attribute>
<attribute name="SystemLoggerServiceName">#DebugLogService</attribute>
<depends>DebugLogService</depends>
<depends>DefaultConnectionFactory</depends>
</service>		
--------------------------------------------------------------------------------------------------------------
 
- 서비스 설정 (/sqlmap_config.xml 파일에서)
<?xml version="1.0" encoding="utf-8" standalone="no"?>
<sqlmap-config>
<reload>true</reload>
<monitoring>true</monitoring>
<level>100</level>

<groups>
<group name="default">
<level>100</level>
<monitoring>true</monitoring>
<reload>true</reload>
<description/>
</group>

<group name="cm">
      <reload>true</reload>
      <monitoring>true</monitoring>
      <level>0</level>      
    <description><![CDATA[공통관리]]></description>
    </group>
    
  <group name="sy">
      <reload>true</reload>
      <monitoring>true</monitoring>
      <level>0</level>      
    <description><![CDATA[시스템관리]]></description>
    </group>
  </groups> 
</sqlmap-config> 
==============================================================================================================
 
- 지오영 프로젝트 셋팅
1. FSP 서버 교육(14시, 예산): 소프트잼 김용호(H: 010-8533-6598) 사장이 직접와서 java 서버 셋팅해줌
2. 지오영 프로젝트 소스 셋팅(오라클 DB라 셋팅 못함: 참고만 할 것)
3. 경로 
 1) GEOYONG ==> D:\QMS\GEOYONG
2) eclipse 바로가기 설정
 가. D:\QMS\GEOYONG\eclipse\eclipse.exe -vm D:\QMS\GEOYONG\jdk1.6.0_45\bin\javaw.exe -data D:\QMS\GEOYONG\workspace
==============================================================================================================
 
- 남북 정상회담(10:30, 판문점)
1. 남측 문재인 대통령, 북측 김정은 위원장
2. 4·27 판문점 선언: 양 정상은 이 선언을 통해 핵 없는 한반도 실현, 연내 종전 선언, 남북공동연락사무소 개성 설치, 이산가족 상봉 
등을 천명하였다.
==============================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.28(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

- 주말
10:00 기상
10:20 웹서핑
12:00 중식
13:10 집출발(자전거): 수종 
13:20 구로리 공원(수종) ==> 수종이  어린이집 친구 정성은 만남
15:10 엘마트(껌)
15:50 귀가 
16:30 낮잠
21:20 기상 
21:30 석식
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2018.04.29(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==>  

▦ 축구
09:00 기상
09:30 조식
11:30 집출발(자전거, 수종) ==> 다이소 대림2호점(빚), 청정원 카놀라유(웰빙 식용유. 250ml, 2통)) ==> 엘마트
12:00 귀가
12:00 중식(카레 덮밥)
15:30 집출발(자전거)
15:50 대림운동장 
16:10 게임(은혜교회팀: 어울림) ==> 4 쿼터 뜀: 컨디션 별로
18:00 종료
18:20 귀가 ==> 루옌, 수종 이마트에 갔다 옴
19:30 석식
21:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2018.04.30(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 ==> 예산행(05:43 ~ 07:35 , 영등포역 -> 삽교역)
  
- 현대제철 AP 품질관리 시스템 구축 Prj [★]
- 로그인 화면(/login.xfdl) 개발
==============================================================================================================

- Nexacro14 신규템플릿 분석
1. 로그인 화면(/login.xfdl), 프레임 분석
==============================================================================================================

- 로그인, 보안 셋팅 처리
1. 로그인 처리
2. SSO연동
3. 암호화 방식
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 


