 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2015.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2015.01.01(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 신정(공휴일)

▦ 조기축구
06:50 기상(영하 9도)
07:20 국민은행 봉천동지점 앞(태훈이형 차) 
07:50 신구초등학교 
08:20 숏게임
11:20 종료
12:40 중식(문경새재: 갈비탕): 만원 냄 
13:00 귀가
18:00 석식
19:00 새해 맞이 파티(루옌, 수종) ==> 미니 생과일 생크림 케익
23:00 취침
==============================================================================================================

[2015년 을미년(乙未年) 신년 목표]
0. 정말 열심히 살자 ==>必死則生 必生則死
1. 장기적인 일자리 구하기
 1) 장기적인 관점에서 일자리 고민
2. 행복한 가정 만들기
 1) 아들 잘 돌보기
 2) 아내 행복하게 하기
4. 아들 교육에 최선을 다함
-------------------------------------------------------------------------------------------------------

[2015년 을미년(乙未年) 결산] 
1. 
==============================================================================================================

[진수종 성장 상황: 2014년 2015.01.01(월) 현재]

1. 체중: 12.3kg
2. 키: 90cm
3. 이빨(윗니: 3개, 아랫니: 2개)
4. 잘 걸어 다님.
5. 옹아리 많이 함 ==> 엄마, 아빠 수준의 말 밖에 못 함	
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.02(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================

- 건강보험 확인 
13:00 중식
15:00 집출발
16:00 국민건강보험공단 관악지사 방문(서울시 관악구 남부순환로 1485 7층, 난곡 사거리 근처)
16:20 PCA 보험 중도인출 신청 => 추임순 FC에게 전화 -> PCA 콜센터(1588-4300) 전화해서 신청함
16:40 국민건강보험 지역 가입자에 임의 가입자(2년간 4만원대 보험료) 재신청 ==> 공차장 회사에서 직장 가입자 자격 
취득 취소 신청을 안했다고 함 --> 공차장에게 전화 --> 장인, 장모 건강 보험에 못 올림
17:20 귀가
18:00 석식
18:00 공차장에게 전화옴 ==> 직장 가입자 자격 취득 취소 신청을 했다고 함 ==> 장인, 장모 외국인등록증 복사해서 
메일로 보내면 건강 보험에 등재해 준다고 함
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.03(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 
 
- 주말 
09:00 기상
09:10 TV 시청
11:00 중식
18:00 석식
20:00 집출발 
20:10 지하철(서울대입구역 <-> 신도림역): 장인 모시기
21:10 귀가 
22:00 맥주(장인)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.04(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  

▦ 조기축구  
06:50 기상
07:20 국민은행 봉천동지점 앞(태훈이형 차) 
07:50 신구초등학교 
08:20 숏게임
09:20 게임
10:00 태훈이형 장인 기일이여서 차 가지고 일찍 감
10:30 종료
11:30 중식(돌솥: 문경새재): 만원 냄
13:20 종료
14:20 귀가(정홍이가 차로 사당역까지 태워 줌) ==> 사당역에서 도보로 귀가
15:10 목욕(관악24시 불가마 사우나): 장인
16:40 귀가
19:00 석식
19:30 공차장에게 전화 : 장인, 장모 외국인등록증 복사해서 메일로 보냄 ==> 내일 오전에  건강 보험에 등재해달라고 요청함
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.05(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================

- 장인어른 종기 수술 
08:00 기상
08:30 조식
09:20 공차장에게 전화 옴 ==>건강보험공단 직원에게 연락해서 장인, 장모 건강보험 등재 했다고 함(2시간 후에 전산 반영)
09:40 라임피부과 방문
09:50 진료(장인 오른쪽 귀 뒷쪽 종기): 큰 병원 가서 진료하라고 함 ==> 건강보험 전산 등록 안되어 공짜로 해줌
10:20 택시(봉천동 -> 보라매 병원): 택시비: 4,400원
10:30 보라매 병원 도착(사람 많음)
11:00 접수 => 이빈인후과(2층) 간호사가 수요일 정영호 교수에게 진료 받으라고 함 ==> 예약 안하고 옴(T: 1577-0075)
11:20 택시(보라매 병원 -> 봉천동)
11:30 접수(강남고려병원)
13:00 중식(순대국2, 황태해장국: 할매순대국(봉천점)): 루옌, 장인
13:20 진료(일반외과, 임선구 의사): 장인 오른쪽 귀 뒷쪽 종기 수술 결정 ==> 장인 회사에 부장한테 전화해서 수술 때문에
        내일 오후에 출근 한다고 함
14:10 체크카드 재발급(SC은행): 유효기간 만료
15:10 수술(일반외과, 임선구 의사) ==> 57,100원
15:40 조제(장인 종기 수술): 동보당약국
16:00 종료
16:10 (주)아리츠 이윤지 과장에게 전화 옴(SC은행 제안: HTML5, CSS3 사용 -> 사실상 힘듬)
17:00 귀가
16:30 석식
23:00 취침
==============================================================================================================

- 장인, 장모 건강보험 재등록(10시)
1. 공차장에게 전화: 장인, 장모 외국인등록증 복사해서 메일로 보냄
2. 공차장이 건강보험공단 직원에게 장인, 장모 외국인등록증을 팩스 보내서 재등록 신청
3. 일반 병의원은 2시간 후에 전산 등록됨
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.06(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================
- 장인어른 종기 수술2 
08:00 기상
10:30 중식
13:10 접수(강남고려병원)
13:30 진료(일반외과, 임선구 의사): 장인 오른쪽 귀 뒷쪽 종기 수술 결과 확인 ==> 10일 후에 실밥 풀라고 함 
13:50 붕대, 밴드(장인 종기 수술): 동보당약국
14:00 장인 공장으로 감 ==> 루옌 신도역까지 배웅
14:10 수납(강남고려병원)
14:20 귀가
16:30 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.07(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 이발, 염색

- 취업활동 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.08(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>

- 취업활동 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.09(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 명동 구경

- 취업활동 @@@
============================================================================================================== 
- 명동 구경
08:00 기상
11:30 중식
13:00 은행 방문(1. 처가 통장 내역 확인)
 가) 처가 통장에서 루옌 국민은행 체크 카드 교통비가 빠져나감 ==> 수정 요청함
13:20 종료
13:40 서울대입구역
15:00 지하철(서울대입구역 -> 을지로입구역): 명동
15:40 남대문 시장 ==> 여행용 캐리어 20인치(기내용 캐리어): 5만원
18:00 석식(돈까스, 남산왕돈까스): 루옌
18:50 명동역
20:10 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.10(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

- 취업활동 @@@
==============================================================================================================
- 루옌 친구에게 송금
1. 만 8천원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.11(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  

▦ 조기축구  
06:50 기상
07:10 국민은행 봉천동지점 앞(태훈이형 차) 
07:40 신구초등학교 
08:20 숏게임
09:20 게임(현대 조기회: 10만원 찬조) ==> 2015년 신사 FC 집행부 소개
11:00 태훈이형 일찍 감
11:30 종료
11:30 중식(돌솥: 문경새재): 조기회에서 쏨
13:20 종료
14:20 당구장
17:20 귀가(루옌 친구집에 놀러 감)
20:30 루옌 귀가
23:00 취침
==============================================================================================================

- 015년 신사 FC 집행부 소개
회장: 구창원
부회장: 권영석, 이승렬, 이치근, 김효순
총무: 이병규
재무: 엄기용
부총무: 신정욱
홍보: 진태만
감독: 안병춘
코치: 김태훈, 서정홍
감사: 최영희
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.12(월) 작업 ■■■■■■■■■■■■■■■ \
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.13(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 공형근 차장 만남

- 취업활동 @@@
==============================================================================================================

- 공형근 차장 만남
08:10 기상 
10:30 조식
11:30 루옌 언니 만남(다오: 쌀국수 먹고 옴)
11:40 (주)아이엘포유 양난희 대리한테 전화 옴 ==> 삼성전기 프로젝트 제안(투입된 개발자 보안 사고로 대체자 찾음) 
        --> 다른 개발자가 투입되었다고 함
14:20 루옌 귀가
16:00 집출발
16:30 핸드폰 케이스(갤럭시 노트2, 2개 5천원): 대림역 노점상
17:00 공형근 차장 만남
17:10 파리바게뜨 ==> B2B 쇼핑몰에 대해 제안(월 500, 6개월 개발): 수락함 --> 그쪽에서 단가 협상이 잘되면 1월말에
        개발 시작할 수 있다고 함
18:00 종료
19:00 귀가
20:30 중식
01:00 취침
==============================================================================================================

- Microsoft Office 2010 Professional Plus KMS 인증툴 사용법 
1. K.J_110125.exe 파일 다운로드
2. K.J_110125.exe 파일 더블 클릭
3. MS Activator - KJ(새창)
 1) 오피스 KMS 인증(클릭)
4. Dos창에서 아래 내용이 뜸  

 Microsoft (R) Windows Software Licensing.
Copyright (C) Microsoft Corporation. All rights reserved.
=========================================================

Remove KMS host name (sets port to default).
      status: OK

Old KMS Server data deleted from the registry.
      status: OK

Key Management Service machine name set to Localhost successfully.
      status: OK

Please wait. Executing activation requests...
      status: OK

---Processing--------------------------
---------------------------------------
SKU ID: 6f327760-8c5c-417c-9b61-836a98287e0c
LICENSE NAME: Office 14, OfficeProPlus-KMS_Client edition
LICENSE DESCRIPTION: Office 14, VOLUME_KMSCLIENT channel
LICENSE STATUS:  ---LICENSED---
ERROR CODE: 0 as licensed
Last 5 characters of installed product key: H3GVB
REMAINING GRACE: 180 days  (259200 minute(s) before expiring)
---------------------------------------
---------------------------------------
---Exiting-----------------------------

Press any key to exit...

5. MS Office 2010  다시 실행 시키면 성공
==============================================================================================================
 
- 장롱 12자 구입   ==> 완료
가구스토리/2015신상품/12자장롱, S-다이아(웬지화이트, +14만), 총 가격: 771,500원 ==> http://auction.kr/iAgWy8j
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A542846755&frm3=V2
규빅손잡이/즐보석장식/180도 경첩/일체형북박이(서랍형), 제품사이즈: W3440*D640*H2100
==> S-다이아(웬지화이트) 선택 ==> 541,500원(기본), 140,000(웬지화이트), 90,000(택배비), 771,500원(총 가격)
==============================================================================================================
  
01. 분유 구입  ==> 완료
1. 임페리얼 드림 XO World Class 4단계 800g 남양유업, 가격:  56,910원(갠당 18,970원), G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=613441229 
 
02. 기저귀 구입  ==> 완료
1.[하기스] 보송보송팬티 기저귀 5단계(31px4팩), 가격: 35,900원(개당 363원), G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=634386936&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.14(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
1. 삼성전자 빌링 운영 프로젝트 인터뷰
 1) 장소: 송파구 신천동 푸르지오월드마크 102동 502호
 2) 일시: 1월 14일 오전 11시 30분
 3) 결과: 4명 면접(한 명 합격) ==> 빌링 경험자와 삼성 SDS 직원 아는 사람이 많음(떨어짐)
==============================================================================================================

- 마미떼 700자동 흔들 아기침대, 가격: 178,720원(모빌추가: 198,620원)
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=15000858
==============================================================================================================

- 네이버 검색광고 문의 방법(주남이형에게 상담해 줌)
1. 070-8227-7372로 전화하면 네이버 검색광고 담당 김경돈 과장이 전화 받음. 
2. 네이버 검색광고 파워링크 올리는 방법 문의.
3. 검색어를 포항 장성동 세탁소로 하면 한달에 100원인지 확인.
4. 송금 계좌번호 문의.
---------------------------------------------------------------------------------------------

- 네이버 검색광고 비용
http://blog.naver.com/grang21/220054116058
http://blog.daum.net/1150kjs1/15097512
---------------------------------------------------------------------------------------------
- 후이즈(도메인, 웹호스팅) ==> 년, 총 30여 만 원  http://cs.whois.co.kr
1. 홈페이지 무료 제작
---------------------------------------------------------------------------------------------

- 가비아(도메인, 웹호스팅) ==> 년, 총 15여 만 원  https://webhosting.gabia.com/service
---------------------------------------------------------------------------------------------

- 도메인
1. 도메인 사용료(1년: 22,000원 ==> 11,000원
2. 웹호스팅 사용료(1년: 22,000원 ==> 11,000원
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.15(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@ 
==============================================================================================================

- 대림3동 어린이집 방문(13시)
1. 수종 3월 16일(월)부터 다니기로 잠정 합의
==============================================================================================================

- 쇼핑몰 개발 일정 산정
1. 일정 산정하여 공차장에게 메일로 보냄
==============================================================================================================

- 귀화시험 서적
1. 귀화시험 한 번에 통과하기!: 합격의 공식, 귀화문제연구소 편저 | 시대교육, 가격: 12,600원
http://www.yes24.com/24/goods/15345290?scode=032&OzSrank=1

2. 2015 귀화시험 한번에 통과하기: 알짜만 담았다!, 귀화문제연구소 편저 | 시대교육, 가격: 12,600원  ==> 절판됨
http://www.yes24.com/24/goods/11297961?scode=032&OzSrank=5
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.16(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@ 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.17(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@ 
==============================================================================================================

- 아기침대팝니다,(서울대입구역 근처)
http://cafe.naver.com/joonggonara/248724228
가로: 100cm, 세로: 165cm, 높이: 90cm 입니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.18(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  

▦ 조기축구  
06:50 기상
07:10 국민은행 봉천동지점 앞(태훈이형 차) 
07:40 신구초등학교 
08:20 숏게임
09:20 게임(현대 조기회)
11:20 종료
11:30 중식(국밥: 뚝심한우): 만원 냄 ==> 문경새재 폐업함
12:20 종료
13:00 귀가(장인 어른 병원 갈려고 집에 옴)
18:20 중식(순대국, 황태 해장국): 할매순대국(봉천점) ==> 장인, 루옌 얼큰 순대 시켜 놓고 안 먹음
19:00 귀가
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.19(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================

- 장인어른 종기 수술 실밥 제거
08:00 기상
09:30 접수(강남고려병원) ==> 외과 13:30에 한다고 함
10:10 진료(손장원정형외과) ==> 장인어른 종기 수술 후에 실밥 품(5,600원)
10:30 접수(수종 발 바닥에 가시 박힘, 강남고려병원 정형외과) ==> 진료(발 바닥이 아프면 병원 다시 오라고 함(5,900원)
11:10 귀가
11:30 중식
12:00 장인 공장으로 감 ==> 루옌 신도역까지 배웅
16:30 석식
23:00 취침
==============================================================================================================

- 이사시 자동이체 해지(새문빌라)
1. 상하수도 요금  ==> 서울시 E-TAX에서 자동이체됨  ==> https://etax.seoul.go.kr/new_index.html 에서 해지 처리함
2. 전기세 ==> 서울도시가스 KB국민카드에서 자동이체됨  ==> https://card.kbcard.com/CXPPPZQ00043.cm 에서
(국민카드 > 서비스 > 자동납부 서비스 > 전기요금자동납부) 해지 처리함
 1) 한전 고객 번호: 0148579080
3. 도시 가스 ==> 서울도시가스 KB국민카드에서 자동이체됨 ==> https://www.seoulgas.co.kr/front/payment/autoChangeList.do
에서 해지 처리함
4. 관리비 ==> SC은행에서 자동이체됨 ==> https://www.standardchartered.co.kr/np/kr/Intro7.jsp 에서 해지 처리함
----------------------------------------------------------------------------------------------------------

- 상하수도 요금 자동이체 신청[2013.11.21(목)]  
1. 납부자번호(자동납부번호): 036964464, 수용가명: 추연대외1인   
2. 서울시 E-TAX에서: https://utax.seoul.go.kr ==> 짝수 월 말일에 자동이체 됨  
==============================================================================================================

http://www.giro.or.kr/index.giro
==============================================================================================================

- 대전행 기자표 예매 
01.24(토) 11:52 ==> 무궁화호 1403호: 광명역(11:52) --> 서대전역(13:40), 가격: 10,200원 ==> 루옌, 수종
01.25(일) 15:04 ==> 무궁화호 1424호: 서대전역(15:04) --> 영등포역(16:51), 가격: 10,200원 ==> 루옌, 수종
----------------------------------------------------------------------------------------------------------
 
- 대전행 기차 경로
1. 영등포역(무궁화호) -> 서대전역 -> 도보(15분) -> 오룡역(3번 출구) -> 시청역(5번 출구) -> 도보(5분) 
-> 베이비엔젤 대전점(도착)
----------------------------------------------------------------------------------------------------------

- 뎁 아들 돌잔치(15시)
1. 일시: 2015년 1월 24일(일) 15시 30분
2. 장소: 베이비 엔젤(데전시 서구 둔산동 1475 9층)
3. 기타: 부주 10만원할 것  ==> 김근호(김표성, 윤민주)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.20(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
==============================================================================================================

- 설날 귀성(KTX, 19:30) 차표 예매
1. 2월 18(토) 11:16 ==> KTX 135열차, 입석: 광명역 (11:16) --> 동대구역(11:16), 가격: 34,300원 ==> 토욜에 예매할 것
- 설날 귀경 고속버스 예약: 완료
2015.02.21(토) 01:00  포항 -> 서울, 심야 우등, 천일고속 6번: 34,900원
==============================================================================================================

- 입국 일정 변경(http://www.onlinetour.co.kr)
[전자 항공권 번호] / [탑승자명] / [당시의 예약번호] / [변경일정] / [현지연락처]
[7385286782086] / [DINHTHI/LUYEN] / [PWJNSI / 1G] / [3월17일(화) VN414편 하노이 - 인천 / 1035출발 - 1630도착] / [84-01699477751]
[7385286782089] / [JIN/SOOJONG] / [PWJNSI / 1G] / [3월17일(화) VN414편 하노이 - 인천 / 1035출발 - 1630도착] / [84-01699477751]
[7384758968630] / [LETHI/NHOI] / [5NKQK2 / 1G] / 3월17일(화) VN414편 하노이 - 인천 / 1035출발 - 1630도착] / [84-01699477751]
==============================================================================================================

- 집 프린터(삼성 프린터 CLX-3175K) 출력 확인 
1. 주민등록 등본 출력 여부 확인 ==> 출력 가능(확인)
2. 가족관계 증명서 출력 여부 확인
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.21(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 루옌, 수종 다오집에 놀러감(10 ~ 17시), 고등학교 동기 만남

- 취업활동 @@@
==============================================================================================================

- 고등학교 동기 만남
19:00 석식
21:50 김태훈 휴대폰으로 전화 옴
22:10 5515번 버스(봉원중 -> 노량진)
22:30 신한은행 노량진 지점 지하 1층 당구장(태훈, 동판, 정근, 성우) ==> 박성우가 포항에서 아들 병원 온다고 왔다고 함
23:10 술집(정근이가 쏨)
01:00 종료
01:30 정근이 차로 귀가함
01:40 귀가
02:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.22(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 조기회 집행부 회의(19;30, 효순형네(19 ~ 23시)

- 취업활동 @@@
==============================================================================================================

- PCA 보험 중도인출 신청(2번째신청)    
접수번호	청구사유	접수일자	처리상태  처리일자 피보험자 상품명					증권번호		지급금  
1280223 중도인출(변액) 2013.02.25 처리완료 2013.02.27 진태만 (무) PCA드림링크Ⅱ ******9123		13,770,000원[세문빌라 전세]
1697581 중도인출(변액) 2015.01.02 처리완료 2015.01.07 진태만	(무) PCA드림링크Ⅱ ******9123		9,100,000원   
1713772 중도인출(변액) 2015.01.22 신규접수				진태만	(무) PCA드림링크Ⅱ ******9123		3,650,000원    
  
1697583 중도인출(변액) 2015.01.02 처리완료 2015.01.07 진태만	(무)프리미어VULIII ******9866		20,000,000원 
1713769 중도인출(변액) 2015.01.22 신규접수				진태만	(무)프리미어VULIII ******9866		12,180,000원  
==> 총 금액: 44,930,000원
1. https://www.pcakorea.co.kr ==> PCA e-Desk > 지급서비스 > 중도인출금 신청
==============================================================================================================
 
- 조기회 집행부 회의
18:20 아시안컵 축구(한국 2:0 우즈벡)
18:20 집출발
19:20 효순이형 가게(부옹성(5434-1778): 서울 강남구 신사동 590-12)
20:00 회의(정홍이 병춘이형 불참)
21:30 종료
22:00 구창원 회장 차로 이수역까지 옴
22:30 5524번 버스
23:00 귀가
01:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.23(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 아이폰 4S 중고 구입(12만원, 양재역 직구, 010-3007-4563)

- 취업활동 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.24(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 루옌 친구 돌잔치
06:00 기상
06:10 5524번 버스
07:20 신구초등학교 
08:00 숏게임
08:30 숏게임
09:00 종료
09:20 5524번 버스
10:00 귀가
10:10 조식
10:40 집출발
11:30 영등포역 도착 => 설 차표(입석) 예매 --> 취소 함(400원)
11:52 영등포역 출발(루옌, 수종)
13:40 서대전역 도착
14:30 베이비엔젤 대전점 도착(서대전역 -> 오룡역 -> 시청역)
15:00 베이비 엔젤 입장
15:30 중식 ==> 수종 너무 좋아함
16:30 돌잔치 행사(뎁: 루옌 친구)
17:00 종료
17:40 뎁 집으로 이동(4층 빌라) ==> 수종 자동차 장남감 좋아함[뎁 시어머니가 부동산 월세 사업한다고 함)
19:40 맥주(지갑 화장실에 빠트림) ==> 포항 어머니가 아버지 허리 아프다고 함(월요일에 수술 예정)
23:00 종료
24:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.25(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 루옌 친구 돌잔치2
06:00 기상
10:10 조식
10:40 TV 시청
13:30 중식
14:10 뎁 집 출발
14:40 서대전역 도착
15:04 서대전역 출발
16:44 영등포역 도착(서울에 비 조금 내림)
17:20 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.26(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 아버지 허리 아파서 포항 세명기독병원 입원(요양등급 신청할 것)

- 취업활동 @@@
==============================================================================================================

- 선불폰 충전 확인 요청 @@@ 
1) 입금자명: 진태만, 선불폰번호: 010-2696-1964(장인 폰), 충전카드 종류: KTF 충전카드 20,000원
2) 무통장 입금 ==> 계좌번호 : 국민은행 603701-04-029740 (김동한)
==============================================================================================================

- 서울도시가스 전출입 서비스(예약) 신청
https://www.seoulgas.co.kr/front/customer/reserveInOut.do
https://www.seoulgas.co.kr/front/mypage/minwon_list.do?currentPage=1
==============================================================================================================

- 장기요양인정 신청
http://www.nhis.or.kr/menu/retriveMenuSet.xx?menuId=B3200
1. 대리인 신청: 대리인은 신청인과 주민등록상 동일세대로 구성된 직계존비속이거나 동일 건강보험증상 가입자 또는 
피부양자인 경우에 한하여 신청할 수 있습니다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.27(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- 취업활동 @@@
1. 위쉬정보 정직원 면접
 1) 장소: 위쉬정보기술(주) 02-2103-2460, 대표이사: 이종수
     서울시 구로구 구로동 222-7번지 코오롱디지털타워 빌란트 A동 311호, wishit.co.kr
 2) 일시: 1월 26일 오전9시 30분
 3) 결과: 정직원 연봉 45,000만원 제안, 프리랜서 470만원에 하기로 함(한국타이어 내일 면접) 
	==> 민동에 최현석형이 인사팀장으로 있어서 이 형이	민동 김형욱이형[포스코 1차 밴드 이사] 소개 시켜 줌
==============================================================================================================

- WindowsUpdate 오류
"WindowsUpdate_800B0100" "WindowsUpdate_dt000"에 대한 0개 결과
http://support.microsoft.com/kb/961411/ko
==============================================================================================================

- 아이폰 동영상 넣기(동영상 인코딩) // MP4 만들기
1. http://blog.naver.com/dboyis/220195029382
==============================================================================================================

- 인감증명서 발급
- 인감증명서 발급(10시, 주민센터)
1. 인감증명서 발급(10시, 주민센터)  ==> 인터넷으로 발급 받을 수 있도록 처리
2. 본인서명 사실확인서 발급(인감증명서과 같은 효과)
3. 전자본인서명 확인서 신청 ==> 한번 주민센터를 방문하셔서 인감증명서를 발급받으시고, 차후에 인터넷으로 발급
받을 수 있게 신청을 해두시면  인터넷을통해 인감증명서 인터넷발급을 이용할 수 있습니다.
(공공 부분에서는 인정, 은행, 일반 기업에서는 인정 안 해줌)

지금 사용되고 있는 인감증명서의 문제점들을 보안해서 <본인서명사실확인서> 라는
제도가 만들어졌는데요. 궁금해 하시는 부분가운데 효력이 있는가 없는가 입니다.
이 둘은 모두 동일한 효력을 가지고 있으니 안심하셔도 됩니다.
본인서명확인서의경우 신분증만 지참해서 주민센터(동사무소) 방문하신뒤에 이름을 정자로
서명하시면 바로 발급이 됩니다. 또한 1회 이렇게 신청을 해두시게 되면
인터넷으로도 발급이 가능해요.!!
---------------------------------------------------------------------------------------
  
- 전자본인서명 확인서 발급
1. 행정기관 및 공공기관 제출용도로만 사용 가능
(민간기업) 및 개인 간 거래 시에는 본인서명사실확인서를 이용
http://www.minwon.go.kr/minwon/AA040_elec_self_cnfirm_guide.jsp
==============================================================================================================

- 갤럭시 노트 2 와이파이 속도 간단 개선 방법
1. 갤투는 기본적으로 "와이파이 절전 모드"가 켜져 있음
2. 전화번호 입력창에 "*#0011#"을 입력 
3. 핸드폰 하단의 홈키 왼쪽 메뉴키를 누름
4. 위와같이 띄는 창에서 WiFi를 누룸
5. ping test 위에 "켜짐."라고 써진 걸 눌러 "꺼짐"으로 누룸
==> 차고로 한번 해제하고 디바이스를 껏다 켰을 경우 다시 켜짐으로 다시금 꺼줘야하는 번거로움이 있음
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.28(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>   

- 면접(14시, 한국타이어) 
1. 한국타이어 면접
 1) 장소: 한국타이어 빌딩(서울 강남구 테헤란로 133: 역삼역 4번출구 직진 150미터)
 2) 일시: 1월 27일 14시
 3) 결과: 엠프론티어 안창주 팀장(010-3395-1708) ==> 월 470에 PM 하라고 함
==============================================================================================================

- 현욱이형 만남(18:30, 강남 포스코)
1. 인사 청탁(김현욱이형[010-4808-3448]: 포스코 1차 밴드 이사라고 함)
2. 최현석형[010-4499-9239]과 같이 만남
3. 3월달부터 연뵹 5천에 현욱이형 회사(포스코 1차 밴더)에 정규직으로 입사하기로 함
4. 막걸리(전선생==> 현욱이형, 현석이형): 20시에 종료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.29(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 문영 APT 방문, 다오 딸 돌잔치

- 쌀 구입 ==> 완료
1) 라이스그린 2014 당진 해돋이쌀[20kg]. 가격: 37,900원, 옥션
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A112811957&frm3=V2
==============================================================================================================

- 전자레인지 구입
1) 동양 매직 GRA-C2100R(N), 가격: 339,000원(이마트 가격: 구입), 가격: 284,990원(G마켓 가격)
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=616944241&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.01.30(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 문영 APT로 이사

- 문영 APT로 이사
08:00 기상(새문빌라 301호)
08:10 이사짐 센터(신사 익스프레스: 병규형)에서 옴
08:20 이사 시작(맞은편 집에서 사다리차로 먼저 이사함 ==> 우리는 이사짐만 싸고 기다림)
08:40 병규형이 사다리차 가지고 옴
11:00 서울도시가스는 기사가 방문해서 정산 ==>78,970원 납부(2014.12.16 ~ 2015.01.29)
       ==> 2015.01 63,610원 신용카드로 빠져나감(이중 납부: 환불 신청할 것) -> 사용계약번호: 60036-24035
11:20 새문빌라 주인 도착(전기요금, 수도요금, 가스요금 이사정산: 고객번호 몰라서 주소로 처리) 
		==> 총 5만원 주인에게 줌, 현관문 카드키 다음에 갖다 주기로 함
		==> 전세금 받음: 1억 7천 5백(천 만원 수표: 17장, 백 만원 수표: 5장 받음) ==> 총 1억 9천 5백
12:00 종료
12:10 골목길에 좁아서 이삿짐차(2.5톤)가 이웃집 건물에 충동할 뻔 함
12:30 문영 APT 1806호 도착 ==> 전 세입자(010-8873-7056)에게 현관문 삼성 도어락 구입(3만원)
		 ==> 장롱(12자, 4개)이 먼저 도착해서 짐 내리고 있었음 ==> 다음에 이사할 때는 이삿짐이 5톤이 아니라 6톤 예상
13:10 LG 부동산(김선자: 846-7000)에서 전세 잔금 처리
		==> 주인에게 전세 잔금 2억 3천(천 만원 수표: 22장, 백 만원 수표: 10장 줌) ==> 총 전세금 2억 5천(계약금 2천)
13:40 문영 APT 관리실 방문(입주자 카드 작성, 지하 주차장키 2개 받음, 음식물 쓰레기 카드 받음, 
		중앙 출입문 키 받음, 카드 안 받음)
13:50 부동산 수수료 정산 ==> 대운부동산 안병열, 75만원 계좌이체
	장롱 배송비(9만원) 계좌이체
13:30 이삿짐 내리기
17:00 종료(이사짐 수수료 105만원 지불)
17:10 KT기사 방문(인터넷, IPTV 설치[Sky 라이프 안테나 설치]) ==> 너무 오래 걸림
19:30 종료
19:40 석식(라면)
20:00 짐정리 
24:00 취침
==============================================================================================================

- 전기요금, 수도요금, 가스요금 이사정산[새문빌라 301호] 
1. 도시가스 확인 전화
 1) 서울도시가스는 기사가 방문해서 정산 ==>78,970원 납부(2014.12.16 ~ 2015.01.29)
 2) 새문빌라 기존 호스비 3만 6천원 주인에게 받음[이사오면서 내가 구입한 것] 
2. 전기 확인 전화
 1) 국번없이 123번으로 거시고, 숫자를 알려주시면 요금을 알려 줌 ==>계량기 숫자: 4362.6: 43,630원
3. 상하수도 확인 전화
 1) 서울이면 02-120에 2번 수도 상담원과 통화해서 검침 숫자를 알려주면 요금을 알려 줌 ==>계량기 숫자: 243: 22,230원
 2) 2014.12.23 ~ 12.31: 33,570원 납부할 것(완료) ==>고객번호: 03696446, 자동납부번호: 036964464, 수용가명: 추연대외1인
4. 관리비 2만원
==> 총 5만원 주인에게 줌
-------------------------------------------------------------------------------------------------------

- 전기요금, 수도요금, 가스요금 이사정산[문영 APT 1806호]
1. 도시가스 설치
 1) 시공비:15,000원, 휴즈코크: 10,000원, 일반호스: 10,000원 ==> 35,000원[(주)중앙아전도시가스, 안순철
 2) 명의변경: 1588-5788
 3) 전자레인지 구입(동양 매직 GRA-C2100R(N)): 이마트 구로점에서 배달해줌, 가스 설치까지 해줌
 4) 이전 주인이 2015.01.27까지 사용하고 정산함 ==> 180,110원(2015.01.06 ~ 2015.01.27)
2. 문영 APT 대문 열쇠(중고) 구입(전 세입자): 3만원
3. 장롱 배송비: 9만원
4. 부동산 수수료 정산 ==> 대운부동산 안병열, 75만원 계좌이체
==============================================================================================================

- 이사시 준비할 것
1. 문영 APT 관리실에서 받은 것(지하 주차장키 2개 받음, 음식물 쓰레기 카드 받음, 중앙 출입문 키 받음)
2.  서울도시가스 전출입 서비스(예약) 신청
 1) 서울도시가스는 기사가 방문해서 정산
3. 종량제 봉투 100L
---------------------------------------------------------------------------------------------------------

- 서울도시가스 전출입 서비스(예약) 신청
https://www.seoulgas.co.kr/front/customer/reserveInOut.do
https://www.seoulgas.co.kr/front/mypage/minwon_list.do?currentPage=1
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.01.31(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 집정리

- 집정리
09:00 기상(문영 APT 1806호)
10:00 내방 정리 
11:10 진료(수종 감기): 구로연세의원 
12:00 중식
13:00 짐정리
19:00 석식
20:00 짐정리
24:00 취침
==============================================================================================================

- 강력회전식엠케이파워세탁탈수청소기[ 파워I-01:멀티매직그린통1+대1+걸레4+2장]: 인터파크
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=016001&sc.prdNo=1091390932
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■