 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2015.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2015.05.01(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 노동절, 포항행

- 주말 
05:20 기상
06:30 지하철(대림역 <-> 신사역)
06:40 신구초등학교
06:50 숏게임
08:00 종료
10:00 귀가
10:20 택배(꽃 재료, 루옌 친구): 5.2kg(택배비 6천원)
11:00 집출발
11:20 대림역(2호선, 2-3) -> 신도림역(1호선 환승) -> 서울역(하차): 40분, 13,3km, 11,500원
12:10 서울역
13:00 서울 출발(포항행 KTX: 처음 탐)
15:40 포항역(달전) 도착
15:50 택시
16:20 포항집 도착(택시비 만원 나옴) ==> 다음부터 우현동으로 돌아가 올 것
16:30 용돈(부모님, 어버이날) 30만원 송금, 처가에서 아버지 아프다고 20만원 부주함
17:00 진료(이현철의원): 루옌 감기
19:00 석식
00:00 취침
==============================================================================================================

- 2015년 5월 포항행 예매
1. 2015.05.01(금) 13:00 ~ 15:35, 서울 -> 포항, KTX 산천 807(17호차 5A, 5B), 52,600원(루옌 포함: 105,200원)
2. 2015.05.03(일) 17:00 ~ 19:36, 포항 -> 서울, KTX 산천 812(8호차 11A, 11B), 50,000원(루옌 포함: 100,000원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.02(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 포항집

- 포항집 
09:00 기상(어버니 부산 여행 감)
10:00 조식
11:00 영일대 해수욕장 구경(수종 물에 빠짐)
12:00 종료
12:00 약(오현당약국): 수종 등 다침
16:00 트레일러 완구세트: 다이소 포항 두호점 
20:30 큰누나 제사 준비해서 옴
20:40 석식
21:30 어머니 귀가
22:50 할아버지 제사(수종이도 같이 절 함) ==> 든든함
23:10 종료
00:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.03(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 포항집

- 일요일 
09:00 기상(비 조금 옴)
10:00 조식
11:00 수종 안고 리플러스 왔다 갔다 함
13:00 권투 시청(메이웨더, 파퀴아오) ==> 메이메워더 3:0 판정승
14:00 이발(큰누나) --> 수종이 머리도 깍아 줌
15:20 루옌 토와집에 갔다 옴
16:00 중식
16:30 매형 차탐
16:50 포항역 도착
17:00 포항 출발(수종 기차에서 잠)
17:00 포항 출발
19:20 광명역에서 내림
19:40 광명역 지하철(20:20에 지하철 운행 된다고 해서 KTX 다시 탐)
20:20 서울역 도착
21:20 귀가
22:00 석식(라면)
00:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.04(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 회사 임시 휴일(출근, 이석부 사장만 출근함)

- NX WAS, MySQL로 개발
1. WAS. DB 변경(NX WAS. MySQL)
 1 Nexacro Crome, IE 디버깅 ==> 브라우즈 + F12번 클릭 
http://localhost/nxui/loginCheck.do 
http://localhost/nxui/index.html
==============================================================================================================

- WAS 환경 설정
C:\eGovFrame-3.2\workspace\nexacroplatform\src\main\resources\egovframework\spring

1. /context-datasource.xml 파일에서 
<!-- mysql -->
    <bean id="dataSource" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
        <property name="driverClassName" value="com.mysql.jdbc.Driver"/>
        <property name="url" value="jdbc:mysql://localhost:3306/test"/>
        <property name="username" value="nexacro"/>
        <property name="password" value="nexacro"/>
    </bean>
-----------------------------------------------------------------------------------------------------

2. /context-sqlMap.xml 파일에서 
<!-- SqlMap setup for iBATIS Database Layer -->
<bean id="sqlMapClient" class="org.springframework.orm.ibatis.SqlMapClientFactoryBean">
<property name="configLocation" value="classpath:/egovframework/sqlmap/rte/sql-map-config.xml"/>
<property name="dataSource" ref="dataSource"/>
<!-- property name="mappingLocations" value="classpath:/egovframework/sqlmap/rte/sample/*.xml" /-->
</bean> 
==============================================================================================================

trLogin : function(obj,sSvcId,id,pw,bprogress)
{
 if(Eco.isEmpty(pw))
{ 
Ex.core.showMsg(obj,"alert","root_unknown","Please enter Login Password","","error","","");
return;
return;
}

var sSvcID        = sSvcId;
var sController   = "loginCheck.do";
var sInDatasets   = "";
var sOutDatasets  = "gds_userInfo=gds_userInfo gds_menu=gds_menu gds_message=gds_message gds_gridInfo
=gds_gridInfo gds_config=gds_config gds_task=gds_task";
var sArgs = "";

sArgs += Ex.util.setParam("V_USER_ID",id);
sArgs += Ex.util.setParam("V_USER_PWD",pw);

Ex.core.tran(obj,sSvcID, sController, sInDatasets, sOutDatasets, sArgs,"gfn_loginCallBack",bprogress); 
}
==============================================================================================================

- MySQL 대여(조은도서관)
1. My first MySQL & PHP programming    ==> http://book.naver.com/bookdb/book_detail.nhn?bid=7524159
2. 성공적인 웹 프로그래밍 PHP와 MySQL  ==> http://book.naver.com/bookdb/book_detail.nhn?bid=6050404
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.05(화) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 어린이날, 결혼 2주년

▦ 조기축구
05:00 기상
05:10 MySQL 책 공부
06:50 지하철(대림역 <-> 신사역)
07:40 신구초등학교
07:20 숏게임(경기 중)
08:00 숏게임 투입(어린이날이라 일찍 시작함)
08:50 종료(어린이날이라 일찍 옴)
09:00 태훈이형 차
09:20 상도역
10:00 대림역
10:20 귀가
10:40 중식(라면)
11:00 진료(명소아과의원): 수종 감기
11:40 집출발(자전거: 루옌, 수종)
11:50 보라매 공원(사람들 많이 놀러 나옴)
11:55 풍선 선물 받음
12:20 과자, 음료, 뻔데기: 보라매 공원
12:40 귀가
13:40 루옌 친구 만나러 나감
14:20 수종 낮잠(많이 울다가 잠)
14:40 낮잠
17:20 기상
17:45 수종 기상
18:10 루옌 귀가
18:20 집출발
18:40 석식(돈페 구로점[돈까스 부페], 석식: 10,800원): 루옌, 수종
19:40 종료
20:20 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.06(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30 ==>

- Xplatform 표준(tamaPrj) 개발
1. tamaPrj 셋팅(MySQL DB 사용)
==============================================================================================================

- Ecplise에서 MySQL 연동 
http://blog.naver.com/dnaodtjs/70184350174 
C:\Program Files (x86)\MySQL\MySQL Connector J폴더에 mysql-connector-java-5.1.35-bin.jar 파일 복사하여
아래 폴더에 붙여 넣기
C:\eduPrj\mid\apache-tomcat-7.0.53\lib
C:\Program Files\Java\jdk1.6.0_45\jre 
--------------------------------------------------------------------------------------------------------

- MySQL 연결(71. nxui_NX)
1. Connction type: TCP
2. Host: localhost
3. User: nexacro
4. Password: nexacro
5. Database: test
6. Post: 3306 
==============================================================================================================

- MySQL 접속하기[명령 프롬프트(cmd)에서실행 하기] 
C:\Users\TAMA> cd C:\eGovFrame-3.2\mysql-5.6.21\bin 
C:\eGovFrame-3.2\mysql-5.6.21\bin> mysql -u nexacro -p test    --> mysql -u 사용자명 -p 데이터베이스이름 @@@
Enter password: *******
Welcome to the MySQL monitor.  Commands end with ; or \g.
Your MySQL connection id is 16
Server version: 5.6.21-log MySQL Community Server (GPL)

Copyright (c) 2000, 2014, Oracle and/or its affiliates. All rights reserved.

Oracle is a registered trademark of Oracle Corporation and/or its
affiliates. Other names may be trademarks of their respective
owners.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

mysql>
--------------------------------------------------------------------------------------------------------

- gidata MySQL 접속 에러[명령 프롬프트(cmd)에서실행 하기] 
http://blog.naver.com/otnz_onen/220260207060
C:\Users\TAMA> cd C:\eGovFrame-3.2\mysql-5.6.21\bin 
C:\eGovFrame-3.2\mysql-5.6.21\bin> mysql -h 211.234.111.5 -u gidata -p gidata
--> mysql  -h[host IP, 옵션] -u [사용자명] -p [데이터베이스이름]  ==> gidata1472  @@@
Enter password: **********
ERROR 1045 (28000): Access denied for user 'gidata'@'localhost' (using password:
 YES) 
==============================================================================================================

- MySQL 접속 에러
1. 현상: Client character set 'utf8' --> server character set 'euck'
Devart.Data.MySql.InvalidCharsetException
Client character set 'utf8' is different from server character set 'euckr'.
Stack Trace:
   위치: Devart.Data.MySql.MySqlConnection.o()
   위치: Devart.Data.MySql.MySqlConnection.n()
   위치: Devart.Data.MySql.MySqlConnection.m()
   위치: Devart.Data.MySql.MySqlConnection.Open()
   위치: Quest.Toad.Db.Connection.OpenConnection(IDbConnection connection)
   위치: Quest.Toad.MySQL.MySQLConnection.OpenConnection(IDbConnection connection)
   위치: Quest.Toad.Db.Connection.AllocConnection()
   위치: Quest.Toad.Db.Connection.Connect(Boolean notify)
   위치: Quest.Toad.Db.Provider.BackgroundConnector.CreateBackgroundConnection()
2. 원인: server 의 언어셋은 euckr인데 연결하려는 클라이언트의 언어셋은 utf-8이네요  
3. 조치: 클라이언트의 언어셋을 euckr로 맞춰주세요. 
http://blog.daum.net/_blog/BlogTypeView.do?blogid=0Qlcg&articleno=44&categoryId=0
=========================================================================================================

- 한글개발환경(euckr)일 경우 my.ini 설정 
C:\Windows 밑에 my.ini 파일 생성 ==> C:\eGovFrame-3.2\mysql-5.6.21 폴더에도 수정할 것
[mysql]   
default-character-set = euckr  

[mysqld] 
#character-set-client-handshake=FALSE  
#init_connect="SET collation_connection = euckr_korean_ci"  
#init_connect="SET NAMES euckr"  
#default-character-set = euckr  
character-set-server = euckr  
collation-server = euckr_korean_ci  

[client] 
default-character-set = euckr

[mysqldump]    
default-character-set = euckr  

http://www.welog.co.kr/gbbs/bbs/board.php?bo_table=mysql&wr_id=133
==============================================================================================================

- MySQL character 확인 방법
1. MySQL for Toad에서
show variables like 'c%'   -- MySql 캐릭터셋을 확인 
2. 터미널에서
C:\Users\TAMA> cd C:\eGovFrame-3.2\mysql-5.6.21\bin 
C:\eGovFrame-3.2\mysql-5.6.21\bin> mysql
mysql> status
--------------------------------------------------------------------------

- MySQL character utf8로 변경(C:\eGovFrame-3.2\mysql-5.6.21/my.ini 파일에서)
[client]
default-character-set=utf8

[mysqld]
character-set-server=utf8
collation-server=utf8_general_ci
init_connect=SET collation_connection=utf8_general_ci
init_connect=SET NAMES utf8

character-set-client-handshake = FALSE
skip-character-set-client-handshake

[mysql]
default-character-set=utf8
------------------------------------------------------------------------------------------------------
 
- MySQL의 한글 입력 문제 처리
1. 특정 DB를 생성할 때 한글을 사용할 수 있도록 하려면 아래와 같이 DB 수정
ALTER DATABASE test DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci ;
------------------------------------------------------------------------------------------------------
 
- MySQL에서 INSTR 함수 에러
MySQL Database Error: Incorrect parameter count in the call to native function 'INSTR'
==============================================================================================================

- MySQL용 아이피 확인 ==> 호스팅 업체에서 나의 아이피(211.52.57.163)에 대해서 권한을 줘야 처리가 됨
http://hanbiro.com/ip.php ==> 나의 아이피: 211.52.57.163
==============================================================================================================

- phpMyAdmin(웹에서 MySQL 수행) ==> 호스팅 업체에서 나의 아이피 대해서 권한을 줘야 접속 가능
http://weblog7.hanbiro.com/myadmin  --> gidata/gidata1472
==============================================================================================================

- XPlatform 라이센스
1. http://support.tobesoft.co.kr/Support/index.html ==> Downloads > 체험판: Products: XPlatform(선택)
==============================================================================================================

- 지오닉스 자전거
http://deal.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=452871911
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=168419494
==============================================================================================================

- 종합소득세 신고(2011년 귀속 종합소득세)
1. 종합소득세 신고서 작성(2012.05.02 ~ 12)
 1) 홈텍스(http://www.hometax.go.kr)에서 온라인 작성 ===>  tamario/s*j**8*1
 2) 00. 종합소득세 신고(2011_05)(2010년 귀속).xls, 00. 종합소득세 신고(2011_05)(2010년 귀속).xls 파일 작성
2. 종합소득세 신고서 신고서 제출성(2012.05.20)
 1) 홈텍스(http://www.hometax.go.kr)에서 신고서 보내기
--------------------------------------------------------------------------------------------------

- 종합소득세 신고대행 절차 안내>
1. 수수료입금 -> 수임동의 -> 자료전송-> 신고완료  
=========================================================================================================

- 2015년 5월 종합소득세 세무대행 준비사항  
(1) 2014년 귀속분 본인의 수입금액 집계(국세청 홈택스에서 확인 가능)  
① 2014년 귀속분 사업소득(3.3%), 근로소득, 기타소득 원천징수영수증 : 홈택스에서 발급
② 2014년 귀속분 본인명의 사업자등록증이 있는 경우 : 부가가치세 신고서 및 부속서류
③ 이자, 배당소득 등이 연간 2천만원이 넘는 경우 금융소득 내역서 : 금융기간에 문의  
* 원천징수영수증은 홈택스에서 본인이 직접 확인 가능(화면을 캡쳐해서 파일전송)
  (방법은 저희 사무실 카카오톡 또는 블로그를 참고하시기 바랍니다) 
 
(2) 부양가족 소득공제 내용(작년에 의뢰하신 분은 변동사항만 적어주세요)  
 ① 본인 이름, 주민번호, 주민등본상 주소, 장애인 여부(장애인 공제 때문임)
 ② 부양가족: 이름, 주민번호, 주민등본상 주소, 장애인 여부(장애인 공제 때문임)
  - 부모(배우자측 포함): 1954.12.31이전 출생이면서 연간소득 100만원 이하
  - 자식, 형제자매(배우자측 포함): 1994.1.1이후 출생이면서 연간소득 100만원 이하
  
(3) 본인의 필요경비 내역(파일이나 캡쳐한 자료를 이메일로 보내주세요)  
 ① 연말정산간소화 PDF파일
 - PDF 파일 다운 경로: 홈택스 -> 조회/발급 -> 연말정산간소화 -> 소득,세액공제 조회발급 -
 > 지출 모든 항목 조회 -> ‘조회한 항목 한번에 PDF로 다운로드’ -> 이메일로 PDF 파일 전송
   (자세한 방법은 저희 사무실 카카오톡 또는 블로그를 참고하시기 바랍니다)
 ② 본인명의 환급 계좌정보, 본인 핸드폰번호
 ③ 기부금영수증(종교단체 또는 지정기부금 단체)
 ④ 기타 자료: 자동차보험증권, 차량리스료 상환스케줄

위 (1)~(3)의 내용을 준비한 후 PFD파일과 캡쳐한 사진을 아래 이메일 또는 카톡으로 보내주시면, 확인후 연락드리겠습니다.
 
- 이 메 일 : semu3456@naver.com
- 전화번호 : 1600-8434 / 010-3115-9450
* 입금계좌 : 하나은행 591-910287-17507 예금주: 인화세무회계 
 
(4) 입금이 확인되면 수임동의 요청 및 신고서 작업이 시작되고, 개별 안내해 드립니다 

(5) 세무대행 수수료(부가세 별도)  
  - 수입금액 5,000 만원 이상인 분은 복식부기를 추천합니다  
 * 입금계좌 : 하나은행 591-910287-17507 예금주 : 인화세무회계
==============================================================================================================

- 나눔인들 만남(노량진역, 19시 30분)
18:30 퇴근
18:50 선정릉역
19:10 노량진역(1호선 2번 출구: 서울시 동자구 노량진동 112)
19:30 현용 만남
19:50 노량진 수산시장(수산호관 지하1층) ==> 모둠회(임, 진, 황 분빠이)
20:00 송재욱, 호수 도착 ==> 송재욱이 6월달에 파키스탄 3년 파견 간다고 함
22:00 종료
23:00 당구장(현용: 120, 임모: 150, 내: 80)  ==> 내가 1등, 현용 꼴찌
24:00 종료  ==> 송재욱이 귀가
24:30 포장마차 
02:00 종료
02:10 택시(대림역> 신도림역): 호수가 쏨
02:30 귀가
02:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.07(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>

- Xplatform 표준(tamaPrj) 개발
1. tamaPrj 셋팅(MySQL DB 사용)
==============================================================================================================

- PHP 로그 
<? 
//print("PHP is Fun!");
print ("
 [/board_2.php] ==> [TEST_01]
" );  
print ("
 [/list_2.php] ==> [total_page]$total_page" );
print ("
 [/list_2.php] ==> [page]$page" );
?>
==============================================================================================================
  
- 주)지아이데이타 홈페이지 게시판 테스트
http://gidata.co.kr/page/target.php?theme=board_2
==============================================================================================================

- (주)지아이데이타 인력 프로파일 메일 발송
1. 김찬영 부장, 진태만 차장, 최수호 과장 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.08(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 오후에 회사 출근(통장 개설)

- Xplatform 표준(tamaPrj) 개발
1. tamaPrj 셋팅(MySQL DB 사용)
==============================================================================================================

- Mysql DB Export/Import 하기
http://blog.naver.com/l77jk/220345161984
http://erm00.blog.me/220319572615
==============================================================================================================

- 2015년 종합소득세 신고(2014년 귀속) 수임 요청
1. 인화세무회계에 복식부기 148,000원 하나은행으로 송금
2. 2015년 종합소득세 신고 자료 메일(semu3456@naver.com)로 전송
==============================================================================================================

- 종합소득세 신고 문의
홈택스에서 신고하신거 같습니다.
홈택스 메뉴에 신고를 취소하는 메뉴가 있습니다.
[세금신고,신고분납부] -> [세금삭제요청서]
"세금삭제요청서"를 제출 하시면 되고 처리기간이 조금 필요하지만
신고서접수가 취소되게 되어있습니다.
==============================================================================================================

- [국민은행] KB국민행복적금  중도 해지[루옌]   ==> 2015.05.08(금) 가입  @@@
1. 계좌번호: 037403-04-029055(03740304029055)
2. 금리: 연 7.5% 수익(기본: 4.5% + 우대: 3%) , 봉천동 지점
3. 계약금액: 6,146,250(세전),       4. 계약금액: 6,177,911원(실수령액)
5. 계약기간: 1년(월 50만원, 25일 자동이체됨)
6. 만기일: 2015.05.25(월) ==> 중도해지로 인해 4만 원 정도 손해 봄
=========================================================================================================

- [국민은행] KB국민행복적금  재가입[루옌]   ==> 2015.05.08(금) 가입  @@@
1. 계좌번호: 037403-04-029055 
2. 금리: 연 7.5% 수익(기본: 4.5% + 우대: 3%) , 구로 지점
3. 계약금액: 6,146,250(세전 ),       4. 계약금액: 6,205,647(실수령액)
5. 계약기간: 1년(월 50만원, 25일 자동이체됨)
6. 만기일: 2016.05.25(월)
==============================================================================================================

- [신한은행] 신한 새희망 적금[루옌]   ==> 2015.05.08(금) 가입  @@@
1. 계좌번호: 230-138-820348(230138820348) 
2. 금리: 연 6% 수익, 구로 지점
3. 계약금액: 7,200,000원(원금)
4. 계약기간: 3년(월20만원, 25일 자동이체됨)
5. 만기일: 2018.05.25(월)
==============================================================================================================

- 포항 Prj 투입(9시, 공통, 포항)
1. 광명 선재(포항) - XPlatform 공통(2개월 예정)
 1) 위치: 포스코 LED(포항시 남구 장흥동 1873)
 2) 5월 프로젝트 시작, 8월 오픈
2. 손효석 부장(010-3805-7079) - 아토스 
==============================================================================================================

- 포항 파견(파견지 출퇴근) 
1. 포항집 -> 두호주민센터(105번) -> 죽도시장(107번) -> 공단정수장(하차) -> 포스코LED: 1시간 4분, 15.3km, 11,500원 
2. 포스코LE -> 공단정수장(107번) -> 죽도시장(107번, 105번) -> 국립수산물품질관리(하차) -> 포항집: 1시간, 14km, 11,500원 
=========================================================================================================

- 포항 201번 버스
신설 210번 노선은 양덕을 출발하여 KTX포항역을
경유해서 구룡포까지 빠르게 연결하는 좌석버스 노선입니다. 첫차가 새벽 06시,막차가 22시에 양덕차고지를
출발하며 1일 8회 배차간격은 120분입니다.
#양덕차고지출발~HCN경북방송~두호초등학교~우창동주민센터~KTX포항역~사격장~남부육교~KT포항지사
~포스코본사~해군항공역사관~포항공항~구룡포환승센터를 운행합니다.
요금은 좌석버스가 1500원으로 책정 
==============================================================================================================

- 기차 승차권 반환 수수료
http://www.letskorail.com/ebizcom/cs/guide/guide/guide01.do
1. 당일 ~ 1시간 전: 400원
2. 1시간 경과 후 ~ 출발시각 전: 10% 
3. 기타: 기차 예약은 열차출발 1개월 전 07시부터 가능 ==>  2015.06.15(월)부터 할인승차권 예매할 것[368,200원 예상]
=========================================================================================================

- 고속버스 취소 수수료
http://www.kobus.co.kr/web/03_reservation/reservation01.jsp
1. 예약/예매 후 출발일 1일 전일부터 차량출발 전까지: 승차권 요금의 10%
2. 예예약/예매하신 사항에 대해 출발시각까지 발권, 취소, 홈티켓 미발행 시
예약/예매 승차권에 대해 부도처리 됨 : 승차권 요금의 20%
=========================================================================================================

- 2015년 5월 포항행 예매
1. 2015.05.11(월) 05:31 ~ 07:40, 광명 -> 포항, KTX 산천 801(15호차 11A), 47,900원 
=========================================================================================================

- 택시비
1. 대림역 -> 광명역(택시비): 12,700원[34분]
2. 대림역 -> 서울역(택시비): 12,100원[32분] 
==============================================================================================================
	
- 4월 밤비니 실내놀이터 견학비 송금
1. 신한 은행, 계좌번호: 100-023-855255, 예금주: 대림3동 어린이집, 14,000원
==============================================================================================================

- 동영상 인코딩(휴대폰에서 사용할 수 있는 동영상 변경, 동영상 변환) 
1. 인코딩 프로그램(다음 팟인코더 v 2.0 BETA)을 이용 wmv 파일을 avi 파일로 변환 후 재생 
2. 사용 방법 
 1) 인코딩 > 불러오기(클릭): 파일 선택 ==> 00-1.성조.wmv 
 2) 휴대기기용 > 삼성(인코딩 옵션) > 삼성 P3 VBR(AVI): 선택 
 3) 인코딩(틀릭) ===> 00-1.성조.avi 
 http://cafe.daum.net/namanel/Smrs/43?q=%B4%D9%C0%BD%20%C6%CC%C0%CE%C4%DA%B4%F5&re=1
 http://blog.naver.com/PostView.nhn?blogId=qdongwoo&jumpingVid=81D10132EF0583C77E3DE96899B34C5B1A23&logNo=220327487896
==============================================================================================================

- 삼성전자 서비스
http://www.samsungsvc.co.kr/member/memberLogin.do --> tamario@naver.com/hp수*1*!*
========================================================================================================= 
 
- Kies 프로그램 다운 및 설치 방법(삼성 휴대폰 연결 프로그램)
http://www.3366.co.kr/online/downLoadMain.do#none
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.09(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 루옌 생일

- 주말 
05:20 기상
06:30 지하철(대림역 <-> 신사역)
06:40 신구초등학교
06:50 숏게임
08:45 종료
10:00 귀가(루옌하고 싸워서 밥 달라고 못함)
11:20 샤워
11:40 집출발
12:20 대림역(2호선, 2-3) -> 숭실대입구역
12:45 숭실대 미래관
13:00 사회통합프로그램 사전평가신청(필기)
13:10 중식(볶음밥[3,500원]: 숭실대 입구 분식점)
14:00 사회통합프로그램 사전평가신청(면접): 수종이하고 먼저 집에 옴
15:00 문영APT 놀이터(수종이 잘 놈)
16:00 귀가
16:20 루옌 귀가(화 많이 풀림)
17:00 장보기(남구로시장): 루옌 생일 잔치 장보기
18:30 석식(철판볶음밥, 냉면): 유가네 닭볶음
19:30 종료
19:50 귀가
21:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.10(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 
 
- 일요일 
06:20 기상
06:30 지하철(대림역 <-> 신사역)
07:10 신구초등학교
07:50 게임
08:45 종료
09:10 대치유수지(강남 면허시험장 근처)
10:00 서울시민리그(신사 1: 4 청담)
10:20 후반전 교체 투입(제일 잘 했다고 함: 시합용) 
	==> 참석한 회원 모두 후반에 시합 뜀(전반전에 베스트가 3:0으로 짐, 후반 5명 교체)
11:00 종료
11:40 중식(불고기: 뚝심한우[맛있음]): 조기회에서 쏨
13:40 종료
14:20 귀가
14:30 루옌 생일 잔치(베트남 언니, 친구 모두 11명 옴)
17:00 종료
17:30 부부 관계
20:00 석식
00:00 취침
==============================================================================================================

- 자전거 구입(루옌 생일 선물)
[지오닉스] 대나무바구니/7단/여성용자전거/26인치/클래식자전거, 가격:115,800원, G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=209577257
==============================================================================================================

- 자전거 구입 해줌
[액사이더] 2014 마로 PRO 16 중산물산(16형, 흰색), 가격: 260,700원(86,900원 3대): G마켓 --> 돈 송금 받을 것
 1) 주문 택배 주소: 경기도 광명시 소하동 1104-1, 고영주(남편)
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=209577257
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.11(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 포스로 야드관리시스템 Prj : 포항 출발(04시)

- 포스로 야드관리시스템 Prj 
1. IP 주소(포스로 야드관리시스템 Prj ) 
IP 주소: 192.168.151.242, GW: 192.168.151.1
SM: 255.255.255.0, DNS: 204.246.184.194 
----------------------------------------------------------------

- 파일 서버
\\192.168.151.252 developer, ict1#
==============================================================================================================

- 포스로 야드관리시스템 Prj (8월 1일 오픈)
1. PM: 구철수 부장(010-2228-8249, 포스코ICT), PM: 손효석 부장(010-3805-7079, 아토스)
  1) PL: 최규만 차장(010-2330-4236, 아토스) 
2. 디자인: 서광언 팀장(010-2330-4236), 이영웅 차장(010-9927-2052, 투비소프트) 
3. 포스코(정직원)
 1) 윤상락 총괄(010-4515-4061), 김수진 주무
4. 사업장 주소: 경북 포항시 남구 장흥동 1873 포스코 ICT(동국제강 포항 공장 근처)
==============================================================================================================

- 요구 사항(PM)
1. login 시 session 서버로 전달
2. 메뉴, 즐겨찾기 설정 기능
3. 공통함수(Null 체크, Excel 저장 등), 공통 메시지 창(경고, 확인 등)
4. 버튼 및 아이콘 디자인 시안에 대로 구현
5. main- popup, main - main 등 window 간의 인자 전달
6. memo 기능
==============================================================================================================

- Eclipse Workspace 설정(변경)
1. Eclipse 메뉴창의 [File] - [Switch Workspace] - [Other]를 선택 --> workspace: C:\eclipse\workspace
==============================================================================================================

- 여관 구하기
1. 모텔 아이 606호[문덕, T)054-293-4417] 포항시 남구 오천읍 문덕리 343-2
 1) 1달 40만원에 계약(간의 영수증 14장 끊어 갈 것)
==============================================================================================================

- 서울행[2015.05.15(금)] KTX 예매
1. 2015.05.15(금) 18:50 ~ 21:18, 포항 -> 광명, KTX 산천 814(6호차 9A), 50,400원 
==============================================================================================================

- 포스로 야드관리시스템 Prj 
1. tamaPrj 생성 --> /FabPsnMstReg.xfdl 테스트
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.12(화) 작업 ■■■■■■■■■■■■■■■
---> 08:50 ~ 20:40 ==> 

- 포스로 야드관리시스템 Prj 
1. tamaPrj 생성 --> /FabPsnMstReg.xfdl 테스트
==============================================================================================================

- GRID 공통 기능 ==> 이 영웅 차장(디자이너)가 현업과 협의해서 나온 결론
1. 틀 고정(수평: 단축키)
2. 소팅(정렬): 작은 팝업
3. 상태 표시(수정, 추가): 첫 행 칼럼 1개 추가
--------------------------------------------------------------------------------------------------

- 달력 컴퍼넌트 생성(디자이너가 만들 예정)
==============================================================================================================

- TEST 테이블(Oracle Dual과 유사)
select instr('123456', '12') , instr('title','2') from TB_EMP_INFO ;
==============================================================================================================
  
- MYSQL에서 문자열 합치기와 문자열 추출하기  
select CONCAT(E.HP, '-') AS DDD from TB_EMP_INFO E; 
-------------------------------------------------------------------------------------------------------

-- 401. 인사 마스터 목록 조회  @@@   	 					
SELECT E.*, '' as CHK, SUBSTR(E.RESNO, 0, 6) as RESNO_1, SUBSTR(E.RESNO, 7, 14) as RESNO_2    	
			, substring_index(E.HP, '-', 1) as HP_1 		
			, substring(E.HP, 5, 4) as HP_2					
			, substring(E.HP, 10, 4) as HP_3  					
			, substring_index(E.TEL, '-', 1) as TEL_1		
			, substring(E.TEL, 5, 4)  AS TEL_2  				
			, substring(E.TEL, 10, 4) AS TEL_3				
			, SUBSTR(E.POST_NO, 0, 3) as POST_NO_1, SUBSTR(E.POST_NO, 5, 8) as POST_NO_2											
FROM TB_EMP_INFO E   
==============================================================================================================

- Excel 출력처리
function lfn_excelClick()
{	
	gfn_ExportExcel(gdEmailSmsSendList, "coEmailSmsSendList", "coEmailSmsSendListFile", true);
}
==============================================================================================================

- message alert 처리
gfn_message('test message');

/login.xfdl 파일에서
function lfn_onload(obj:Form, e:LoadEventInfo)
{  
	trace("[/login.xfdl] [lfn_onload()] ==> [TEST_01] [gv_UserId]"+ gv_UserId ); 
	
	gfn_MsgAlert('test message');
	gfn_MsgConfirm('test를 계속 진행하시겠습니까?');

	if(gfn_MsgConfirm(gds_MsgList.getColumn(gds_MsgList.findRow("MSG_CD", "MSG00016"),"MULTI_NM"))) 	
	// MSG00016: 변경된 데이터가 존재합니다. 무시하시겠습니까?  --> gds_MsgList 데이타 셋에 MSG00016 코드 등록
	{
		trace("[/login.xfdl] [lfn_onload()] ==> [예(클릭) --> 중지]" ); 
		return true;  // 예(클릭) --> 중지
	}
	else 
	{
		trace("[/login.xfdl] [lfn_onload()] ==> [아니오(클릭) --> 계속]" ); 
		//return false;	 // 아니오(클릭) --> 계속
	}
}

/commsg_script.xjs 파일에서
 function gfn_MsgConfirm(sMsg)
{
	//trace("[/commsg_script.xjs] [gfn_MsgConfirm()] ==> [sMsg]"+ sMsg );
 
	if (gfn_transNullToEmpty(sMsg) == "") 
	{
		return;
	}
	var sRetVal;
	var objArg = new Object(); 
	objArg.sMsg = sMsg;
	
	sRetVal = gfn_OpenPopup("ShowConfig","co_coa_code::CoaPopupConfirm.xfdl", objArg, -1 ,-1, 400, 190, false);

	return sRetVal;
}

/comutil_script.xjs 파일에서
function gfn_OpenPopup(strPopId,strUrl,strArgument,nLeft,nTop,nWidth,nHeight,isModeless)
{
	if (strUrl == null || strUrl == "")	return;
	if (strArgument == null)	strArgument	= "";
	if (nLeft == null)			nLeft		= -1;
	if (nTop == null)			nTop		= -1;
	
	var rtn;
	
	rtn = gfn_Dialog(strPopId, nLeft, nTop, nWidth, nHeight,strUrl,false,strArgument,isModeless,true,true);
	
	if (rtn == "undefined" || rtn == null || rtn == ""){
		return "";
	}
	
	return rtn;
}

function gfn_Dialog(dialog_id, nLeft, nTop, nWidth, nHeight, stFormURL, bShowTitle, strArgument, isModeless, isLayered, bAutoSize)
{
	trace("[/comutil_script.xjs] [gfn_Dialog()] ==> [TEST_01] [dialog_id]"+ dialog_id +"[stFormURL]"+ stFormURL +"[strArgument]"+ strArgument ); 
	
	if (bShowTitle == null)		bShowTitle	= true;
	if (strArgument == null)	strArgument	= "";
	if (isModeless == null)		isModeless	= false;
	if (isLayered == null)		isLayered	= true;
	if (bAutoSize == null)		bAutoSize 	= true;
 
	if (isModeless == true) {	  // Modeles 이면
		return newChild.showModeless(objParentFrame, strArgument);
	} else {   // 모달 이면
		return newChild.showModal(objParentFrame, strArgument);
	}
}
 
/CoaPopConfirm.xfdl 파일에서
function CmConfirmPop_onload(obj:Form, e:LoadEventInfo)
{  
	trace("[/CoaPopConfirm.xfdl] [CmConfirmPop_onload()] ==> [TEST_01] [sMsg]"+ sMsg );
	 
	gfn_setMultiDic(this);
	divMsg.stMsg.text = sMsg.replace( "\\n", String.fromCharCode(13) + String.fromCharCode(10) );
} 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.13(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 처음 도보로 출근(문덕 아이호텔 -> 포스코 ICT: 40분 걸림)

- 포스로 야드관리시스템 Prj 
1. 즐겨찾기 설정 기능(/COMC0106_P050.xfdl)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.14(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00 ==>  

- 포스로 야드관리시스템 Prj 
1. 즐겨찾기 설정 기능	
==============================================================================================================

- 스포츠 센달(크래킹 센달) 구입
1. 트렉스타 레저타임 마린(MARINE) 스포츠 샌들, 가격: 36,430원 --> 구입
http://itempage3.auction.co.kr/BrandDetailView.aspx?ItemNo=A727752746&frm3=V2

2, [페이퍼플레인] 스포츠샌들_PP1158 (다크그레이) 페이퍼플레인, 가격: 34,800원
http://itempage3.auction.co.kr/BrandDetailView.aspx?ItemNo=A723288159&frm3=V2
==============================================================================================================
 
- 옷(반팔 티: 루옌, 수종): 응아에게 구입
1. 농협 352-0710-5069-13, 예금주: DINH TH NGA, 2만 2천원 송금함
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.15(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 서울행(17:20 ~ 22:00): 17시에 회사에서 나올 것

- 포스로 야드관리시스템 Prj 
1. XPlatform_개발_가이드 작성 
 1) PYMS 테스트
http://localhost:8080//test.jsp
 2) PYMS 테스트2
http://localhost:8080/sample-xplatform/xplatform.mvc?ServiceName=sample-xplat1-service&find=1
==============================================================================================================

- eclipse 톰캣 설정
http://ismydream.tistory.com/16
-----------------------------------------------------------------------

- Eclipse JavaPrject 를 Dynamic Web Prject 로 변경
http://egloos.zum.com/elindreams/v/927473  
http://devday.tistory.com/2035 
1. 프로젝트 선택 -> [Properties] -> [Prject Facets] --> [Convert to faceted form...]: 클릭 
> [Dynamic Web Module]: 체크  
 1) Further configuration available...]을 클릭(아랫 부분)
    가. Web Module
1. Context root: /
2. Content directory: WebContents 
   나. [Generate web.xml deployment descriptor]를 체크 ==> [Apply] 버튼: 클릭 
==> WebContent 디렉토리가 생성된다.
-----------------------------------------------------------------------

1. /org.eclipse.wst.common.component 파일에서
<?xml version="1.0" encoding="UTF-8"?><Prject-modules id="moduleCoreId" Prject-version="1.5.0">
    <wb-module deploy-name="PYMS">
        <wb-resource deploy-path="/" source-path="/WebContent" tag="defaultRootSource"/>
        <wb-resource deploy-path="/WEB-INF/classes" source-path="/src"/>
        <property name="context-root" value="PYMS"/>
        <property name="java-output-path" value="/PYMS/classes"/>
    </wb-module>
</Prject-modules> 
----------------------------------------------------------------------- 

- Eclipse Workspace 설정(변경)
1. Eclipse 메뉴창의 [File] - [Switch Workspace] - [Other]를 선택 --> workspace: C:\eclipse\workspace 
-----------------------------------------------------------------------

- eclipse(이클립스) 설정
1. eclipse 줄번호 설정  
 1) Window[상단 메뉴] > Preferences[새창] 에서, General > Editors > Text Editors에서 "Show line numbers"를 체크  
2. eclipse font 설정  
 1) Window[상단 메뉴] > Preferences[새창] 에서, General > Appearence > Color and Fonf > Basic  
> Tet Font ==> Edit > 글꼴[새창]: "돋움", "10"(설정)  
3. Debug 모두 배경색 변경
  1) Window > Preferences[새창] 에서, Run/Debug > Console(클릭): Background color: 배경색 
   가. 배경색(1. 녹색(R, G. B): 86, 78, 194, 2. 연하늘색(R, G. B): 236, 255, 255, 3. 진하늘색(R, G. B): 232, 242, 254)   
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.05.16(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>

- 주말
08:20 기상
08:30 자전거 조립
10:00 조식(라면)
11:00 치과(루옌 어금니, 진료): 수플러스 치과  ==> 루옌 왼쪽 아랫 어금니 썩어서 덮어씌워야 한다고 함
  --> 어금니 크라운 금 40% 40만원이라 함
11:30 자전거 유아 안장(루옌 자전거)
11:50 자전거 조립(루옌 자전거) ==> 루옌 자전거 장바구니 너트가 없다고 판단해서 조립비 1만원 줌
12:20 귀가
14:00 중식
15:00 낮잠
17:00 기상
17:30 집출발
17:40 을지로입구역
18:40 조계사(루옌, 수종)
19:10 연등행사 구경
19:20 석식(불고기 정식, 추풍령 등갈비[779-5718]) ==> 음식에서 어금니가 보철이 나와서 난동 부림
 (알고 보니 내 어금니 였음)  ==> 주인 어금니 버렸다고 함
19:50 종료
20:10 명동
21:10 귀가
00:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.17(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

▦ 조기축구
06:30 기상
06:50 지하철(대림역 <-> 신사역)
07:45 신구초등학교
08:20 게임
09:00 게임(골기퍼 봄)
10:30 종료
11:30 중식(놀부보쌈, 부대찌게): 병규형이 인터넷 송금 해줬다고 밥값 대신 내줌
12:30 종료
12:40 정홍이차
13:00 사당역
14:00 귀가
15:00 낮잠
17:20 기상
17:30 나들이(루옌, 처음으로 자전가 타고 나들이)
17:50 도림천 산책로(쑥고개 근처)
19:00 귀가
20:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.18(월) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 19:30 ==>  

- 포스로 야드관리시스템 Prj 
1. XPlatform_개발_가이드 작성 
 1) PYMS 테스트
http://localhost:8080//test.jsp
 2) PYMS 테스트2
http://localhost:8080/sample-xplatform/xplatform.mvc?ServiceName=sample-xplat1-service&find=1
==============================================================================================================

- java.lang.ClassNotFoundException 에러
1. 현상: 오늘의 포스트는 java.lang.NoClassDefFoundError 입니다. 
java.lang.ClassNotFoundException: com.poscoict.glueframework.xplatform.web.GlueXplatformAdaptor
2. 원인: 해당 에러의 내용은 클래스를 못찾았다는 의미인데요. 
3. 해결책:
 1) 해당 프로젝트의 Properties를 열어서 Java Builld Path를 선택 - path 설정
 2) Prject-Clean 후 다시 빌드 하면 에러가 해결된다. 
==> D:\eclipse\workspace\PYMS\WebContents\WEB-INF\lib폴더에 glue 관련 jar 파일 넣어 놓고 빌드
==============================================================================================================

- 보안 설정
1. 작업그룹명: (P)PC외주개발실
2. 컴푸터명: 진태만-개발
3. CMOS Booting Password: 설정(F2)  ==> asas1212
4. Windows Loing Password 설정
 1) poscoict 계정 로그인  ==> tamario / asas1212
5. 화면보호기 설정(15분 이내)
6. V3 환경 정의 ==> 실시간 감시 Check
 1) http://203.238.192.66
-------------------------------------------------------------------------------------------------------

- 개인용 PC 보안(부팅 password 설정 및 화면보호기 설정) 방법
Ⅰ. Booting Password는 반드시 설정하여 사용한다. 현재 부팅시 되어 암호가 되어 있지 않으면 
설정하여 주십시요.

<설정 방법 > 
① 컴퓨터를 부팅하고 빠른 속도로 Del 키를 누르면 CMOS-SetUp 화면으로 들어갑니다.(삼성컴퓨터는 F2 키)  
(* 이때 컴퓨터에 전원이 켜지는 순간부터 빠른 속도로 여러번 누릅니다. 그래야 setup화면으로 들어갑니다) 
② <Set Password>를 선택하여 password를 설정합니다.
(*삼성컴퓨터는 [보안]-[관리자 비밀번호설정]에서 password를 입력합니다.)
③ Save & Exit Setup 메뉴를 선택하여 Y가 선택되어진 상태에서 엔터키를 치면 됩니다.
(*삼성컴퓨터는 [종료]-[변경된 내용을 저장한 후 종료]를 선택하면 됩니다)

Ⅱ. 화면 보호기의 암호 설정 
가. <windows98 설정방법>
바탕 화면 - 마우스 오른쪽 버튼 - 등록 정보 - 화면보호기-화면보호기(s) 중 하나 선택- &#8414; 암호 사용란에 
∨(체크) -암호변경 클릭한후 암호입력- 입력 대기시간 5분- 확인
(화면보호기의 대기시간은 10분을 넘지않도록 하십시오)
나. <windows xp 설정방법>
1. 로그온 비밀번호 설정
① 작업표시줄의 [시작]-[제어판]-[사용자 계정]으로 들어 갑니다.
② 화면 중에 [계정변경]을 선택하고 [사용할 컴퓨터 이름]은 [컴퓨터 관리자]를 선택합니다.
③ [암호만들기]에서 [새암호입력]-[확인하기위해 다시 새암호 입력]에 암호를 입력합니다. 암호힌트는 
입력하지 않아도 됩니다. (*암호는 잊어버리면 안됩니다)
==============================================================================================================

- 이클립스 디컴파일러(JAD) 설정하기
http://lovelyjk.tistory.com/72
http://ggobugi.tistory.com/archive/20130514
==============================================================================================================

- Eclipse Decompiler(JadClipse) 설치 방법(http://chogoon.tistory.com/39) 
1. jad.exe 다운로드 ==> C:\eclipse\jad.exe 붙여넣기 
 http://www.varaneckas.com/jad 
2. net.sf.jadclipse_x.x.x.jar (현재 3.3.0 버전이 최신) 
 http://sourceforge.net/Prjects/jadclipse 
3. C:\eclipse\plugins폴더 안으로 net.sf.jadclipse_3.3.0.jar 파일을 붙여넣기 
4. jad 설정(Window > Preferences > Java > JadClipse 클릭 > JadClipse(새창)) 
Path to decompliler: C:\eclipse\jad.exe(변경) 
Derectory for temporary files: C:\Users\TAMA\.net.sf.jadclipse(임시파일을 보관하는 위치, 변경 가능) 
Reuse code buffer 체크 ===> Apply(OK 클릭) 
5. eclipse 를 다시 시작한다.  
6. 상단메뉴의 window > Preferences > General > Editors > File Associations 를 열면 우측화면에 파일 확장자에 따른 실행 
프로그램을 등록할 수 있는 기능을 찾을 수 있다. 
 1) File types에서 *.class 를 선택하거나 없으면 Add 버튼을 눌러 *.class 를 등록한다. 
 2) *.class 선택후 아래 창의 Associated editors 에서 JadClipse Class File Viewer 를 선택한 후 우측의 default 버튼을 
눌러 기본으로 등록한다. 
 3) File types(*.class) ==> Associated editors(JadClipse Class File Viewer: default) 
 4) File types(*.class without source) ==> Associated editors(JadClipse Class File Viewer: default)[추가할 것] 
7. OK 를 눌러 종료한 후 열고자하는 클래스를 ctrl+왼쪽마우스클릭하여 열면 .java 없이 .class 만 있는 파일들도 
자동으로 디컴파일되어 소스를 확인 할 수 있다. 
==============================================================================================================

- 이클립스 디컴파일러(JAD) 설정하기
http://lovelyjk.tistory.com/72
http://ggobugi.tistory.com/archive/20130514
==============================================================================================================

- 식대 송금(안 하기로 함): 어금니 버렸다고 함
1. 국민은행: 011-21-0558-543, 예금주: 
==============================================================================================================

- 루옌 사회통합프로그램 사전 평가 결과
1. 등급: 중급1로 나옴(48점: 평가 점수)
2. 중급 교육 신청
 1. (사)한국다문화센터(서울특별시 중구 중림로2길 21 더플레이스 충정로 B108, T)02-737-0467)
  가. 과정 기간: 2015.06.02 ~ 2015.08.21[여름방학 : 7/27,28,31 교재구입비 7천원(현금만 가능/현금영수증 불가)] 
==============================================================================================================

- 흙 구입
1. 마사토 대용량 23kg /배양토/★ 흙사랑(최고급배양토)35리터, 가격: 7,500원
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=016001&sc.prdNo=1734615445
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.19(화) 작업 ■■■■■■■■■■■■■■■
---> 06:00 ~ 21:00 ==>  

- 포스로 야드관리시스템 Prj 
1. 메뉴 링크 개발
==============================================================================================================

- XPlatform 에러
1. 현상: OwnerFrame이 (ChildFrame)인 경우에는 show함수를 사용할수 없습니다. 
2. 원인: MDIForms이 FrameSet이 아니라 ChildFrame이므로 formnul: Frame::WorkFrame.xfdl로 표현해야 함 
3. 조치: ChildFrame로 만들고 싶으면  MDIForms이을 FrameSet으로 변경해야 함
==============================================================================================================

- DB query 경로
D:\Tama_Prject\01. DB query
==============================================================================================================

- eclipse에서 tomcat 두개의 포트 실행하기
http://www.howspace.kr/gbs/bbs/board.php?bo_table=gr2_10_data&wr_id=88
 <Service name="Catalina">
    <Connector 
        port="8080"
        redirectPort="8443"
        minSpareThreads="25"
        connectionTimeout="20000"
        maxThreads="500"
        maxSpareThreads="75">
    </Connector>
    <Connector
        port="8009"
        redirectPort="8443"
        protocol="AJP/1.3">
    </Connector>
    <Engine
        defaultHost="localhost"
        name="Catalina">
      <Realm className="org.apache.catalina.realm.UserDatabaseRealm"/>
      <Host
          appBase="webapps"
          name="localhost">
      </Host>
    </Engine>
  </Service>

  <Service name="Catalina2">
    <Connector
        port="9080"
        redirectPort="9444"
        minSpareThreads="25"
        connectionTimeout="20000"
        maxThreads="500"
        maxSpareThreads="75">
    </Connector>
    <Connector
        port="8010"
        redirectPort="9443"
        protocol="AJP/1.3">
    </Connector>
    <Engine
        defaultHost="localhost"
        name="Catalina2">
      <Realm className="org.apache.catalina.realm.UserDatabaseRealm"/>
      <Host
          appBase="webapps"
          name="localhost">
      </Host>
    </Engine>
  </Service> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.20(수) 작업 ■■■■■■■■■■■■■■■
---> 06:00 ~ 21:00 ==> 속이 안 좋아 저녁 식사 안 함

- 포스로 야드관리시스템 Prj 
1. XPlatform_개발 glue 개발(최 차장이 하고 있음) ==> 디자인 1차 완료(적용)
==============================================================================================================

- MS-SQL 연결
1. 서버(s): 192.168.151.252, PYMS_USR / pyms1#
==============================================================================================================

- glue 분석[Glue Framework Arch’ ]
1. /emptest.xfdl 파일에서
function btn_searchSmlp_onclick(obj:Button,  e:ClickEventInfo)
{
	var sSvcID			= "find"; 
	var sTargetUrl 		= "http://localhost:8080/PYMS/handle.do?ServiceName=sample-service&findx";   
	var sInDatasets  	= "ds_cond=ds_cond";
	var sOutDatasets 	= "ds_result=ds_result";
	var sArgument 		= "";
	var sCallbackFunc    = "fn_CallBack"; 
	trace("[/emptest.xfdl] [btn_searchSmlp_onclick()] ==> [sSvcID]"+ sSvcID +"[sTargetUrl]"+ sTargetUrl 
	+"[sInDatasets]"+ sInDatasets +"[sOutDatasets]"+ sOutDatasets +"[sArgument]"+ sArgument +"[sCallbackFunc]"+ sCallbackFunc ); 
			
	transaction(sSvcID, sTargetUrl, sInDatasets, sOutDatasets, sArgument, sCallbackFunc); 
}

2. /model/sample.glue_uml_ad  파일에서
1. Aivity Setting
1) Name: Searchxplatform
2) Properties
 가. class: com.poscoict.glueframework.biz.activity.xplatform.GlueXPlatSearch
 나. dao: pyms_dao
 다. sql-key(ID): SELECT.SELECTXXX
 라. param-count: 0
 마. result-key: ds_result

3. /PYMS/src/service/sample-service.xml  파일에서
<?xml version="1.0" encoding="UTF-8"?>
<service name="sample-service" initial="ResultKey List" xmlns="http://www.poscoict.com/glueframework/service">
    <transaction-manager id="pyms-tx" commit="true"/> 
    <activity name="Searchxplatform" class="com.poscoict.glueframework.biz.activity.xplatform.GlueXPlatSearch">
        <transition name="success" value="end"/>
        <property name="sql-key" value="SELECT.SELECTXXX"/>
        <property name="result-key" value="ds_result"/>
        <property name="dao" value="pyms_dao"/>
        <property name="param-count" value="0"/>
    </activity>
</service> 
4. /model/sample.glue_uml_ad  파일에서
1) 수정 후 Generate Service 해주고 서버 재시작할 것

5. Query List 생성 ==> /PYMS/src/query/sample-query.glue_sql
==============================================================================================================

- glue 에러
com.poscoict.glueframework.GlueException: Glue Service XML File[/D:/eclipse/mid/tomcat/wtpwebapps
/PYMS/WEB-INF/classes/service/sample-service.xml] Validation Fail!! ERROR = [D:\eclipse\mid\tomcat\
wtpwebapps\PYMS\WEB-INF\classes\service\sample-service.xml:10:5: error: cvc-complex-type.2.3: 
Element 'service@http://www.poscoict.com/glueframework/service' with element-only content type cannot have text content.]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.21(목) 작업 ■■■■■■■■■■■■■■■
---> 06:15 ~ 21:00 ==> 포항 Prj 회식(19시)

- 포스로 야드관리시스템 Prj 
1. XPlatform_개발(glue 개발) ==> 완료
==============================================================================================================

- 오라클 연결 에러
1. 현상
C:\Users\TAMA> lsnrctl services 
(DESCRIPTION=(ADDRESS=(PROTOCOL=IPC)(KEY=EXTPROC1521)))에 연결되었습니다
TNS-12541: TNS:리스너가 없습니다.
 TNS-12560: TNS:프로토콜 어댑터 오류
  TNS-00511: 리스너가 없습니다.
   64-bit Windows Error: 2: No such file or directory
(DESCRIPTION=(ADDRESS=(PROTOCOL=TCP)(HOST=TAMA-PC)(PORT=1521)))에 연결되었습니다

TNS-12545: 대상 호스트 또는 개체가 존재하지 않아 연결에 실패했습니다
 TNS-12560: TNS:프로토콜 어댑터 오류
  TNS-00515: 대상 호스트 또는 개체가 존재하지 않아 연결에 실패했습니다
   64-bit Windows Error: 1004: Unknown error
2. 원인: PC명을 변경해서 나는 에러
3. 조치
1) /listener.ora 파일에서
HOST = TAMA-PC ===> HOST = 진태만-개발
==============================================================================================================

- WAS 서버에서 XPlatform으로 임의 변수 넘기는 방법(XPlatform에서)
1. /FabPsnMstReg.xfdl 파일에서
 /*-----------------------------------------------------------------------------------------------
 * fn_Search : 인사 마스터 목록 조회
 *----------------------------------------------------------------------------------------------*/
function fn_Search()
{	 
	DS_EMP_INFO.clearData();	
	searchControl();
 
	var strSvcID = "SEARCH_PSN_INQ";   
	var strURL          = "http://127.0.0.1:9080/JSP_TAMA/tamaPrj.jsp";
	var strInDatasets   = ""; 
	var strOutDatasets  = "DS_EMP_INFO=DS_EMP_INFO"
	var strArgument  	= "_sqlName='SEARCH_PSN_INQ' " // 연결할 DB sql 명: SEARCH_PSN_INQ
					+"ncTrId=GABPSNR_pSearchPsnInq";
	var strCallbackFunc = "fn_SearchCallBack";  
	 
	gfn_Transaction(strSvcID, strURL, strInDatasets, strOutDatasets, strArgument);
}

var outVar_sSuc; 
function gfn_CallBack(svcID, errorCode, errorMsg) 
{
	trace("[/comsvc_script.xjs] [gfn_CallBack()] ==> [outVar_sSuc]"+ outVar_sSuc +"[svcID]"+ svcID +"[errorCode]"+ errorCode +"[sErrorMsg]"+ errorMsg ); 
}
---------------------------------------------------------------------------------------------------------------------------------------------------------

2. /tamaPrj.jsp 파일에서
<% 
	PlatformData o_xpData = new PlatformData();  	// PlatformData 

	int nErrorCode = 0; 
	int nCount = 0; 
	int row = 0; 
	String sSuc = "N";
	String strErrorMsg = "START";
	String strCharset = "euc-kr";
	
	/*********************************************************
     * request로 들어온 내용을 parsing하여
     * input variable list, input dataset list에 저장한다. 
     *********************************************************/
    PlatformRequest platformRequest = new PlatformRequest(request.getInputStream(), PlatformType.CONTENT_TYPE_XML, strCharset);
    platformRequest.receiveData();
    PlatformData inPD = platformRequest.getData();

    VariableList    inVariableList  = inPD.getVariableList();
    DataSetList     inDataSetList   = inPD.getDataSetList();
	String in_var1 = request.getParameter("in_var1");   // base_sewon_tr.jsp?in_var1=2 인 경우
	
	try {	
	  	/******* JDBC Connection *******/
		Connection conn = null;
		Statement  stmt = null;
		ResultSet  rs   = null;
		  
		Class.forName("oracle.jdbc.driver.OracleDriver");
		  
		// 오라클DB에 연결_01[Local DB 서버] 
 		conn = DriverManager.getConnection("jdbc:oracle:thin:@127.0.0.1:1521:TamaDB", "tamario", "tama339");     	// ==> 접속 TEST[Local DB 서버]
 		System.out.println("[/tamaPrj.jsp] [test_02] [Local DB 서버에(127.0.0.1) 커넥션 성공 !!!!]");  
		stmt = conn.createStatement();
	    
		/***********  SQL ************/ 
		String SQL="SELECT E.*, '' as CHK, SUBSTR(E.RESNO, 0, 6) as RESNO_1, SUBSTR(E.RESNO, 7, 14) as RESNO_2 ";   
		SQL = SQL +"		, TRIM(SUBSTR(E.HP,  1,  INSTR(E.HP||'-','-',1,1) -INSTR('-'|| E.HP,'-',1,1))) as HP_1 "  ; 
		SQL = SQL +"	 	, TRIM(SUBSTR(E.HP,  INSTR('-'|| E.HP,'-',1,2),  INSTR( E.HP||'-','-',1,2) -INSTR('-'|| E.HP,'-',1,2))) as HP_2 "  ; 
		SQL = SQL +"	    , TRIM(SUBSTR(E.HP,  INSTR('-'|| E.HP,'-',1,3),  INSTR( E.HP||'-','-',1,3) -INSTR('-'|| E.HP,'-',1,3)))  as HP_3 "  ;  
		SQL = SQL +"		, TRIM(SUBSTR(E.TEL,  1,  INSTR( E.TEL ||'-','-',1,1) -INSTR('-'|| E.TEL,'-',1,1))) as TEL_1 "  ; 
		SQL = SQL +"		, TRIM(SUBSTR(E.TEL,  INSTR('-'|| E.TEL,'-',1,2),  INSTR(E.TEL||'-','-',1,2) -INSTR('-'|| E.TEL,'-',1,2))) as TEL_2 "  ; 
		SQL = SQL +"		, TRIM(SUBSTR(E.TEL,  INSTR('-'|| E.TEL,'-',1,3),  INSTR(E.TEL||'-','-',1,3) -INSTR('-'|| E.TEL,'-',1,3)))  as TEL_3"  ;  
		SQL = SQL +"		, SUBSTR(E.POST_NO, 0, 3) as POST_NO_1, SUBSTR(E.POST_NO, 5, 8) as POST_NO_2 "  ;  
		SQL = SQL +" FROM TB_EMP_INFO E"  ;   
		    System.out.println("[/tamaPrj.jsp] [SQL]"+ SQL); 
		    rs = stmt.executeQuery(SQL); 
	   
		    o_xpData.addDataSet(Rs2Ds(rs,"DS_EMP_INFO"));  	// DataSet-->PlatformData 
		   
		nErrorCode = 0;
		strErrorMsg = "SUCC"; 
		sSuc = "Y";
		nCount = 99;
		//System.out.println("[/tamaPrj.jsp] [USR_NO]"+ rs.getString("USR_NO") +"[USER_PWD]"+ rs.getString("USER_PWD") +"[USR_NM]"+ rs.getString("USR_NM")  );
		  
		/******** JDBC Close ********/
		 if ( stmt != null ) try { stmt.close(); } catch (Exception e) {nErrorCode = -1; strErrorMsg = e.getMessage();}
		 if ( conn != null ) try { conn.close(); } catch (Exception e) {nErrorCode = -1; strErrorMsg = e.getMessage();}
				
	} catch (Throwable th) {
		nErrorCode = -1;
		strErrorMsg = th.getMessage();
	}
	
	// VariableList 
	VariableList varList = o_xpData.getVariableList();
	
	nCount = 9;  // TEST ===> @@@
			
	/********* 변수를 VariableList에 추가 ************/
	varList.add("ErrorCode", nErrorCode);
	varList.add("ErrorMsg", strErrorMsg);
	varList.add("out_var", nCount);  // 서버에서 넘기는 임의 변수
	varList.add("outVar_sSuc", sSuc);  		// 서버에서 넘기는 임의 변수 
	System.out.println("[/JSP_TAMA/tamaPrj.jspp] [nErrorCode]"+ nErrorCode +"[strErrorMsg]"+ strErrorMsg +"[outVar_nCount]"+ nCount +"[sSuc]"+ sSuc);
	 
	// HttpPlatformResponse
	HttpPlatformResponse pRes = new HttpPlatformResponse(response, PlatformType.CONTENT_TYPE_XML, "UTF-8");
	pRes.setData(o_xpData);
	
	// send data
	pRes.sendData(); 
%> 
==============================================================================================================

- 메모 샘플
D:\03. Program\71. Nexacro\40. Nexacro 자료\[2014.06] 유코카캐리어스\03_Prject\XP_SRC_0617
==============================================================================================================

- 델 노트북 무선 점검(21시)
1. http://www.dell.com/support/home/kr/ko/krdhs1/?c=kr&l=ko&s=dhs&~ck=mn
2. Studio XPS 1645 (Late 2009)  
 1) 서비스 태그: BNYGBN1, 익스프레스 서비스 코드: 25393196269  
-----------------------------------------------------------------------------------------------------

- 델 노트북 무선 랜 설정 에러
1. 현상: 무선 네트워크 연결시 연결되어 있지 않음 ==> 무선 기능이 꺼져 있습니다.
 1) 델 대표전화: 080-850-5050 
  2) 무선 랜 드라이버: Dell Wireless WLAN 1397 Half MiniCard

2. 조치: 델 노트북 무선 꺼저 있는 상태 조치
 1) 제어판 실행 후 시스템 및 보안 > 시스템 항목에 장치 관리자에 진입하여 네트워크 어댑터 항목에 무선 네트워크 장치가 있는지 확인 후 
항목 중에 !나 ? 등으로 빨간색이나 노란색 아이콘이 표시 된다면 R228550.exe 파일 다운로드 받아서 설치
- Dell Wireless WLAN 1520 Half MiniCard Driver  
http://downloads.dell.com/FOLDER90837M/2/R228550.exe  
 2) 제어판-네트워크 및 인터넷 > 네트워크 및 공유 센터에 진입 후 왼쪽 메뉴에 어댑터 설정 변경을 클릭합니다.  
무선 영역 연결이나 무선 네트워크 연결에 빨간색으로 X 표시가 되어있다면 마우스 오른쪽을 클릭하여 사용을 클릭합니다. 
==> 델 노트북 오른쪽 위 와이파이 불 들어온 부분을 꼭 누르면 무선 켜기, 꺼기가 가능 함(무션 켜기 성공 ==> 해결됨)
==============================================================================================================

- Dell A/S 센타
http://www.dell.com/support/home/kr/ko/krdhs1/product-support/servicetag/BNYGBN1/drivers?detect=y]

- Dell A/S 센타 로그인(tamario@naver.com / sspeim8811)  
==============================================================================================================

- 포항 Prj 회식(19시)
18:00 퇴근
18:30 하누야 효자점(효자 SK 뷰 근처)
18:40 회식(포스코 ICT, 유징테크) ==> 등심(13,000원)
20:30 종료
21:00 당구장(이영우 차장(200), 김휘진 사원(80), 내가 2등 함)
22:00 종료 
22:30 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.22(금) 작업 ■■■■■■■■■■■■■■■
---> 06:10 ~ 17:00 ==> 이영웅 차장 철수(14시), 서울행(17시 퇴근할 할 것)

- 포스로 야드관리시스템 Prj 
1. Frame 다시 나누기 ==> WorkFrameSet 추가
<VFrameSet id="VFrameSet2" separatesize="33,*">
	<Frames>
		<ChildFrame id="TabFrame" showtitlebar="false" formurl="Frame::TabFrame.xfdl" dragmovetype="none"/>
		<FrameSet id="WorkFrameSet" style="background:turquoise;"> <Frames>
		<ChildFrame id="WorkMain" showtitlebar="true" dragmovetype="none" 
		onactivate="mainframe_VFrameSet_HFrameSet_VFrameSet2_WorkFrameSet_WorkMain_onactivate"
		formurl="Frame::WorkFrame.xfdl" position="absolute 0 0 962 606"/>
		</Frames>
		</FrameSet>
	</Frames>
</VFrameSet>
==============================================================================================================

- 새창 띄우기 수정
1. /LeftFrame.xfdl 파일에서
function openTabPage(nRow)
{ 
	trace("[/LeftFrame.xfdl] [openTabPage)] ==> [TEST_01] [nRow]"+ nRow );  
	gfn_ChkOpenMenu(gds_menu.getColumn((nRow, "prgID"), gds_menu);  // 메뉴 클릭시 업무화면 호출 
} 
==============================================================================================================

- (주)투비소프트 디자이너
1. 전진희 과장(010-7160-7245)
==============================================================================================================
 
- 축구화 
1. 모렐리아 네오 MD (P1GA141345) 미즈노/축구화 (P1GA141345), 가격: 151,350원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1123678501&NaPm=ct=
i9ysdi4g|ci=39a5f56d800beeded24b2f6a3d812c6b04c35a10|tr=slsl|sn=17703|hk=b66ba61ac2aa1dedebffdc696470df5953a07628
2. 모렐리아 네오 MD (P1GA141345) 미즈노/축구화 (P1GA141345), 가격: 151,350원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1123678501&NaPm=ct=
i9ysdi4g|ci=39a5f56d800beeded24b2f6a3d812c6b04c35a10|tr=slsl|sn=17703|hk=b66ba61ac2aa1dedebffdc696470df5953a07628
3. 모렐리아 네오 믹스(141345) /미즈노축구화 풋살화 [P1GC141345], 가격: 180,2653원
http://shinsegaemall.ssg.com/item/itemView01.ssg?itemId=1000009920173&siteNo=6004&ckwhere=s_enuri 
4. 미즈노 모렐리아 네오 JPN(P1GA151045)축구화, 가격: 191,150원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1248024412&NaPm=ct=
i9yshze0|ci=aef76d3cba1d65e960d394a5c715eb8c22fc5462|tr=sl|sn=17703|hk=a04b48cca46df5f8ae9e5cef38be3194bdffebfb
5. 미즈노 모렐리아네오 일본산 오리지날 천연캥거루가죽, 가격: 217,550원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B241877041&frm3=V2
6. 나이키 머큐리얼 빅토리5 CR HG-V 축구화(684872-003), 가격: 79,540원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=673860866&GoodsSale=Y&jaehuid=200002673
9. 축구화 카페
http://cafe.naver.com/sportshaus/21990
==============================================================================================================

- 유디치과의원 신림점
1. 어금니 크라운 가격: 40kg 금(30만원: 업계 최소 수준)
http://blog.naver.com/ji0381/220187575019
http://www.udh.co.kr/03_sub/3c_1p_sub01.asp
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.23(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>

- 주말
08:20 기상
09:30 조식
10:00 진료(명소아과의원): 수종 감기
11:00 종료
11:30 쇼핑(다이소) 
12:30 종료
12:40 중식(라면)
13:10 웹서핑
16:00 집출발(대림역 -> 홍대입구역(경의선 환승) -> 풍산역(1번 출구) -> 저동 고교 -> 응아집
17:30 응아집 도착(빵 사감, 새우 얻어 먹음)
18:00 진료(3층 응아 시아버지집) ==> 루옌 어금니(아말감으로 하기로 함) , 나(어금니 2개 금니로 브릿지로 하기로 함)
	--> ? 가격: 58만원(3개)  ==> 보철 만듬(다음주 토요일에 완료 예정)
18:40 종료
20:10 종민씨 도착
20:30 고기집(갈비살) ==> 종민씨가 쏨(9만원 가량 나왔다고 함)
22:00 종료
22:30 풍산역
23:00 홍대입구역(신도림역이 종점인 막차를 잘못 탐)
23:30 신도림역
24:00 대림역(수종 많이 보챔)
24:15 귀가
00:00 취침
==============================================================================================================

-  마우스 구입
1. LG전자 OPTICLA MINI XM-1300 화이트 유선마우스, 가격: 6,500원 [구입]
http://nshopping.naver.com/price/detail.php?cat_id=01010402&nv_mid=115640  
2. LG전자 옵티컬 미니 마우스 1000DPI 광마우스, 가격: 13,900원 [참조]
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&firpg=01&sc.prdNo=3323423467&sc.dispNo=016001&sc.dispNo=016001
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.24(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

▦ 조기축구
06:00 기상
06:20 버스(대림역 <-> 학동역)
07:20 신구초등학교
07:30 게임
09:00 게임
10:15 종료
11:30 중식(놀부보쌈, 부대찌게): 구창원 회장님이 쏨
12:40 종료
12:50 영태형 차
13:00 학동역
14:00 귀가
15:00 낮잠
17:20 기상
17:30 쇼핑(남구로 시장)
19:00 귀가
20:00 석식(닭고개 2마리)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.25(월) 작업 ■■■■■■■■■■■■■■■ \
---> 09:00 ~ 19:30 ==> 석가탄신일

- 주말
07:00 기상 
09:00 조식(빵)
10:00 진료(명소아과의원): 루옌, 수종 감기
12:00 귀가
12:30 중식(라면) 
13:10 웹서핑
17:30 쇼핑(이마트) ==> 나이키 축구화 구경
19:00 석식(양푼이 커플 세트, 푸드맥스): 이마트 구로점 3층
20:10 종료 
20:30 귀가
00:00 포스로 야드관리시스템 Pro 소스 분석
==============================================================================================================

- 2015년(20143년 귀속) 종합소득세 신고확인 ==> 인화 세무회계에서 2014-05-08 신고함
종합소득세	지방소득세		환급(납부)예상액
-3,068,3675		-306,8368 			-3,375,203원(환급 받을 예상액)
==> 종합소득세 환급: 6월 말, 지방세 환급: 7월 말
--------------------------------------------------------------------------------------------------------

- 홈텍스 로그인(국세청)
https://www.hometax.go.kr, tamario / hptnwhd12!@
==============================================================================================================

- 루옌 이메일 만듬
1. 네이버 메일 ==> vnluyen@naver.com, vnluyen/ lulu339!@
2. 다음 메일 ==> vnluyen@daumn.net, vnluyen/ lulu339!@ 
------------------------------------------------------------------------------------

- 루옌 아이핀 발급(i-pin)  ==> 실패
1. vnluyen94/ lulu339!@
2. 발급기관: 한국신용평가정보 
3. 아이핀 신원 확인(본인 휴대폰 아님)
==============================================================================================================

- 수종 장난감 구입
1. 리락 쿠마 점보 놀이터 세트, 가격: 99,000원
http://www.wemakeprice.com/deal/adeal/457501
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.05.26(화) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 ==>

- 포스로 야드관리시스템 Prj 
1. XPlatform_개발(glue 개발) ==> 완료
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■