

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2020.09) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2020.09.01(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 21:00 ==> 야근(21시까지, 석식: 개발팀[구종식 부장이 쏨: 법인 카드]), 도보(청계천 ~ 동대문: 50분 걸림)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장: j간편통장 9개 TASK생성
==============================================================================================================

- 개발 관련 회의(09:30, 회의실, 개발팀)
1. 상품(j간편통장) 1본 개발
 1) 본인인증, 비대면 인증, 고객 등록, 계좌 등록 ==> 9월 11일(금)까지  
==============================================================================================================

- SBS 비밀번호 수정[2020.09.01(화)]
1. https://www.sbs.co.kr, tamario3, 202*오*h@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.02(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 21:00 ==> 2020년 추석 승차권 예매(7시: 1주일 연기), 중식(11:40, 편의점 김밥[혈당:131mg/dl 나옴]), 오전, 오후에 비(우산)
								, 주간보고(8주차)서 작성(14시), 개인 개발 일정 등록  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 TASK_PROCESS 생성     
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.03(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 21:00 ==>

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 계좌 TASK_PROCESS 생성
==============================================================================================================

- 전문 xTouch 관리자 화면에서 전문 등록(박소영 계장에게 요청해서 처리)
1. 회원가입_TASK_PROCESS_정의.xlsx ==> 전문 등록관리, 서비스 등록관리
==============================================================================================================

- j간편통장 정의
1 : 2020년 12월 10일에 신규 생성될 입출금 계좌): 기존 회원 미보유
2. 회원 가입시 계좌 등록은 j간편통장(디폴트)으로 등록
 1) 기존 회원은 상품몰에서 j간편통장 등록 가능
3. 기타
 1) 로그인시 계좌 인증 화면에서 개인이 보유하고 있는 계좌 인증(여러 개 있으면 선택 가능)
  가. 계좌 인증 실패시 회원 가입 화면으로 이동
  나. 기존 회원 중 j간편통장을 미보유한 고객이 계속 생길 수 있음
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.03(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 오전, 오후에 비(우산, 태풍 '마이삭' 4시에 남해안 상륙), 모니터 제부은행에서 추가로 제공 받음(김준 대리)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 TASK_PROCESS 생성
==============================================================================================================

- 개발 관련 회의(10:30, 회의실, 개발팀)
1. pub_file_list.xml 파일에서 아래 내용 작성
 1) 프로그램ID: /com/TD0010/TD0010_01_s1.xml
 2) 개발담당자: 진태만부장
 3) 개발시작일: 09.01
2. j간편통장 PROCESS 확인
 1) 17시에 확인 예정 ==> 다움주까지 j간편통장 개발 완료하라고 함(본인인증, 비대면 인증, 고객 등록, 계좌 등록 처리)
3. 기획 설계서 문제
 1) 설계서 문서 내용이 모호하다고 함(특히, 대출 관련 문서)
 2) 구종식 부장이 이광철 이사에게 심각하게 문제 제기 ==> 문제있는 내용은 이광철 이사에게 직접 메신저로 보내라고 함)
 가. 구종식 부장 기획 때문에 스트레스 많이 받음
==============================================================================================================

- 이광철 이사 주간보고서 작성 간섭
1. 개발자가 직접 작성한 주간보고서 개인별로 불러서 내용, 일정 확인: 구부장에 불만 제기 했다고 함(한혜연 부장도 열받아 함)
==============================================================================================================

- j간편통장 PROCESS 확인(20시)
1. 개발팀과 j간편통장 xTouch 내용 분석, 토론
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.04(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 14:20 ==> 16:40 대동초 돌봄 교실(수종 데리고 옴, 자전거에 태워 옴), 19:20 루옌(수종) 언니집에 놀러감(자고 옴)
								, 실내 자전거 타기(19:20 육룡이 나르샤[50회, 마지막회] 시청)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 TASK_PROCESS 생성
1. class 설정(switch와 유사)
==============================================================================================================
 
- 긴급 퇴근(14:20)
1. 제주은행 6층 건물에 직원 아들이 어린이집에서 코로나19 양성 판정을 받아서 빌딩 전체 방역 실시(긴급 퇴근)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.05(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==>  

- 주말[★]
08:00 기상
08:10 조식
08:30 실내 자전거 타기(SBS 뿌리깊은 나무[1회] 시청)
09:30 종료
10:10 집출발(자전거)
10:20 서울 가정의학과 의원 방문 ==> 진료(뒷통수 돌기 생김): 의사가 무좀이라고 진단함 
10:30 래미안 나나 약국 방문 ==> 조재(뒷통수 돌기[라미실 크림 1%]), 조재(코, 귀 염증[삼아 리도 멕스 크림) 추가 구입])
10:40 귀가 
12:00 중식
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑 
18:10 석식  
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
20:40 루옌 귀가
22:30 샤워 ==> 체중: 74.6kg
22:58 인슐린 약 교체(275U, 21U 남음)  
22:20 취침
==============================================================================================================
  
- 금융인증서 분석
1. 금융결제원 김근옥[Keunok Kim] ==> https://youtu.be/m0vHnMB8JFE
==============================================================================================================

- CLASS 설정 @@@
1. /header.xml 에서  
<script type="javascript" lazy="false"><![CDATA[ 
/**
 * 화면 초기 로딩시 수행 스크립트
 */
scwin.onpageload = function() {
	console.log("[/header.xml] [onpageload()] ==> [TEST_01_7] [Head 화면 로딩...@@@]");
 
	$(".notice").hide();		// notice Group 안보이기
	console.log("[/header.xml] [onpageload()] ==> [TEST_41] ");
	
//		$(".notice").show();		// notice Group 보이기 
//		$(".notice").css({ "opacity" : "0" }).animate({ bottom : "46px", "opacity" : "1" }, 1000);
	console.log("[/header.xml] [onpageload()] ==> [TEST_43] ");
	
	//notice_Info.addClass("success");		// noticeInfo Group에 'success' Class 추가  ==> 배경색: 초록색
	// ==> ERROR메뉴정보 조회도중 오류가 발생하였습니다.  tbx_status
	
	// notice_Info.addClass("warning");		// noticeInfo Group에 'warning' Class 추가  ==> 배경색: 노란색
	// ==> ERROR메뉴정보 조회도중 오류가 발생하였습니다. 
	//console.log("[/header.xml] [onpageload()] ==> [TEST_51] [notice_Info]"+ notice_Info );
	
	console.log("[/header.xml] [onpageload()] ==> [TEST_91] ");
};
]]></script>

</head>
	<body ev:onpageload="scwin.onpageload" ev:onpageunload="scwin.onpageunload"> 
		<xf:group id="grp_Notice" style="" class="notice">		<!--// class명 notice ■■■ //-->
			<xf:group id="notice_Info" style="" class="info">	<!--// group ID notice_Info ■■■ //-->
				<w2:span id="tbx_status" style="font-weight: bold;text-transform: uppercase;" label="ERROR"></w2:span>
				<w2:textbox id="tbx_message" style="display:inline;" label="메뉴정보 조회도중 오류가 발생하였습니다."></w2:textbox>
				<w2:anchor id="btn_NotiClose" style="position:absolute; right:10px; top:10px; font-size: 15px;	font-weight: bold;	
				text-shadow: 0 1px 0 #fff;	opacity: .3;line-height: 15px;" outerDiv="false"
					ev:onclick="scwin.btn_NotiClose_onclick">
					<xf:label><![CDATA[x]]></xf:label>
				</w2:anchor>
				<w2:anchor id="btn_notiMore" outerDiv="false"
					style="position:absolute; right:23px; top:12px; font-size: 15px;	font-weight: bold;	text-shadow: 0 1px 0 #fff;	opacity: .3;	
					font-family: inherit;line-height: 15px;" ev:onclick="scwin.btn_notiMore_onclick">
					<xf:label><![CDATA[+]]></xf:label>
				</w2:anchor>
				<xf:textarea id="txa_messageDetail" style="width: 99%;height:200px;margin:10px 0;color:red;display:none;"></xf:textarea>
			</xf:group>
		</xf:group>
	</body>
</html>
------------------------------------------------------------------------------------------------------------------------------

2. /main.css 에서  
.notice {
	color: #333;
	/*padding: 5px 10px;*/
	position: absolute;
	/* top: -50px; 
	left: 50%;
	margin-left: -25%;
	*/
	bottom:-42px;
	left:235px;
	width: 50%;
	min-height: 30px;
	/*background: rgba(10,10,10,0.5);*/
	background: rgba(250,250,250,0.97);
	border: 0px solid #333;
	border-bottom-right-radius: 5px;
	border-bottom-left-radius: 5px;
	z-index: 9998;
	font-size:11px;
	color: #555;
	overflow: hidden;
	word-break: break-word; 
}
  
.notice .info{
	padding: 8px 30px 10px 36px;
	/* padding-right: 10px; */
	border-bottom-right-radius: 5px;
	border-bottom-left-radius: 5px;
	background:#d4edf9 url('/cm/images/notice/notice.png') no-repeat 10px 10px;
	border:1px solid #b0eaf4;
}

.notice .error{
	background: #f7dddd url('/cm/images/notice/error.png') no-repeat 10px 10px;
	border: 1px solid #f2c9d0;	
}

.notice .warning{
	background:#fcf9e1 url('/cm/images/notice/warning.png') no-repeat 10px 10px;
		border:1px solid #fdecc8;   
}

.notice .success{
	background: #daf3d6 url('/cm/images/notice/success.png') no-repeat 10px 10px;
	border: 1px solid #d0ecc3;	
}
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.06(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2, 장례1[★]
07:40 기상
08:00 조식
08:20 실내 자전거 타기
08:30 아버지 부고(집에서 지병으로 사망) 누나에게 전화와서 받음
09:20 종료
09:30 인터넷 서핑
11:40 중식 
12:05 집출발(루옌, 수종): 구두 가지고 감 
12:10 대림역 -> 서울역
12:45 서울역 도착
12:50 KTX 탑승 ==> 갤럭시 탭을 내 핸드폰 연결해서 수종이 사용(갤럭시 S8에서 모바일 핫스팟 설정 후 연결함)
13:00 서울 출발(루옌, 수종): 코로나19 때문에 승객 거의 없음
15:30 포항역 도착 ==> 2시간 30분 걸림
16:00 택시(포항역 --> 포항시민장례식장): 카드로 계산(9,500원) 
16:10 포항시민장례식장 도착 ==> 2호실 진덕근(85세): 어머니, 큰누나, 매형 만남[권태정 조문하고 갔다고 함]
16:20 상복으로 갈아 입음
17:30 작은 누나, 매형, 은아, 령경이 도착
17:40 작은 아버지, 외가에 아버지 부고 알림, 이재하에게 전화(군산에 산다고 함)
18:00 석식
18:20 승표, 봉춘이 조문 ==> 득우회 부의금 개인적으로 받음: 50만원
19:20 나눔 회원(정근이형, 일남, 광석, 현용, 호수, 상환, 상환 처) 조문
20:00 최광영(창맥, 포항 경찰) 조문
21:00 나눔 회원(송재욱) 조문
24:00 취침(상복 입고 접견실 바닥에 매트리스 깔고 잠: 보일러 틀어서 더움)
==============================================================================================================
 
- 아버지 3일장
1. 35제 안 함 ==> 절에 모신다고 함(매년 절에서 제사 지냄)
==========================================================================================================

- 아버지 부고
https://www.funein.com/bugo/funeral/9288
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.07(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 휴가(부친상), 수종 다니는 영웅 태권도 1주일 추가 휴관

- 장례2 
07:40 기상 ==> 태풍 '마이삭'으로 인해 비, 바람이 거셈: 일시 정전 사고 발생
				==> 포항계(득우회)에서 조화 보냄, 지아데이타에서 조화 보냄 --> 풍산 금속에서 조화 2개 보냄
08:00 조식
09:00 입관 ==> 아버지 관에 넣음
10:00 비그침 
10:30 작은 아버지 조문
11:30 성희 이모 조문
12:00 중식
13:00 재하 고모, 재경이 조문
13:30 큰매형 작은 형님 서울에서 조문하러 옴
14:30 타오(루옌 사촌 동생) 남편 조문
16:00 지아데이타 이석부 사장, 오태범 이사님 조문(서울에서 차타고 옴: 3시간 10분 걸림)
16:30 판섭이 고모, 고모부, 동욱이 고모부 조문
18:00 석식
18:10 주남이형, 정철이 조문
18:30 외가집 식구들 조문
18:40 현노, 일현이 조문
18:20 택이형 조문
19:10 병오, 병일, 병엽, 일생이 아제 조문
21:30 종욱이 아제, 숙모 조문
23:00 택이형하고 매형들하고 같이 술 한잔 함(맥주): 택이형 많이 마심, 루옌 문제 협의(수신 제가...인내)  
24:00 부주 정리, 장례식 정산(나는 부주가 많이 들어와서 돈 안 냄)
03:00 취침 
==============================================================================================================

- 부의금 결산 		
NO	금액	 
어머니 부의금	 4,350,000원
진태만 부의금	 710,000원
진기숙 부의금	 2,100,000원
총 금액	 7,160,000원 	
---------------------------------------------------------------------------------------------------------------------

- 장례식 총 결산 			
NO	내용	금액	 
1	장례용품	 5,976,900원 	
2	별도 현금 계산	 1,385,000원 	
3	별도 현금 계산3	 200,000원	
총 금액		 7,561,900 ==> 4명(엄마 포함)이서 나누어서 납입함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 휴가(부친상), 2020년 추석 승차권 예매(7시: 포기함[이번 추석에 고향 안감])

- 장례3
06:50 기상
07:00 제사
07:40 조식
08:50 발인 ==> 수종이 아버지 영정 사진 들고 앞장 섬(든든함: 내 인생에서 최고 성공작 ==> 앞으로 가 더 문제: 잘 키워야 함)
09:15 영구차에 탑승 
09:40 포항시민화장장 도착
10:00 화장
10:10 화장 제사 ==> 화장 전 노자돈 10만원 시주
11:00 화장 완료 ==> 아버지 유골 함에 넣음(양이 작음)
11:50 포항시민장례식장 도착
12:00 환복 ==> 상복 반납
12:10 큰 매형 차에 탐
12:30 귀가 ==> 어머니, 만주 고모, 루옌은 집에 남음 
		==> 포항 어머니가 아버지상 후 집에 혼자 있는 루옌한테 수종이 버리고 집 나간다고 했다고 욕하고 도둑년이고 했다고 함
		1) 장인, 장모 욕도 했다며 절대 내하고 같이 못 산다고 함 
12:50 큰 누나 차에 탐 ==> 작은 누나, 택이형: 루옌 문제 상의함(답이 없음)
13:50 진전 저수지 도착 ==> 진전 고향 마을: 포항시 남구 오천읍 진전리 산 38-5
		 --> 진전 초교: 포항시 남구 오천읍 진전리 169-2(천지암 삼거리에서 왼쪽 길)
13:55 아버지 유골 저수지 앞에 뿌리기
14:00 종료
14:40 환여 횟집 ==> 물회(큰 누나게 쏨)
15:10 귀가
18:20 낮잠
18:30 집출발 ==> 큰 누나 차
19:00 석식(수가성 쌍용점): 낚지 비빕밥, 순두부: 작음 누나가 쏨
		==> 큰 누나네 귀가 --> 양반 다리를 하고 앉아 있어서 다리가 아파서 절도 제대로 못하고 누나들이 다리 절며 걷는다고 걱정함
20:30 귀가
20:30 도보(포항집 --> 환여동)
23:00 취침
==============================================================================================================

- 갈평 외가댁 --> 진전 고향 마을 
1. http://kko.to/wo8NwycYp
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.09(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 휴가(부친상)

- 장례4
07:00 기상
07:30 조식  
08:00 작은 누나네 귀가 ==> 비옴
08:20 엄마 수종이 인사 안 했다고 엄청 화내고 루옌한테도 화냄
11:00 엄마 귀가
11:30 중식 
11:50 집출발(루옌, 수종) ==> 비 그침
11:55 집택시(포항집 --> 포항역): 카드로 계산(7,200원) 
12:15 포항역 도착
12:35 포항 출발(루옌, 수종): 서울행[포항(12:35) -> 서울(15:05), KTX]: 루옌, 수종(마일리지: 13,100원 사용)
16:00 서울역 도착 ==> 2시간 30분 걸림 
16:10 서울역 -> 대림역
16:50 귀가 ==> 루옌한테 고생했다고 10만원 줌
		 ==> 최진호형(고향 선배 ==> 득우회) 5만원 신한은행 계좌로 받음
17:00 인터넷 서핑
18:00 석식
18:20 도림천 도보
19:20 귀가
19:30 인터넷 서핑
23:00 루옌한테 엄마한테 욕먹었다고 들음: 사과함
23:50 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.10(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 휴가(부친상)

- 휴가4
07:00 기상
07:40 조식  
08:00 실내 자전거 타기
09:00 종료
10:10 조문 감사 문자 보내기 처리 ==> 1. 네이버 주소록에서 1_1. 조문, 1_2. 부의 폴더 만들기
		2. 네이버 주소록(앱)에서 주소록 삭제 후 가져오기 처리
11:55 중식 
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑 
16:20 집출발(자전거)
16:30 0910_당뇨 소모품 큰누나에게 보냄(혈당지: 100개[3만원] 상당)
16:40 대동초 돌봄 교실(수종 데리고 옴, 자전거에 태워 옴) ==> 돌봄 선생님한테 내일은 혼자 하교 시키라고 요청함
16:50 귀가 
18:10 석식  
18:30 실내 자전거 타기
19:40 인터넷 서핑 
22:20 취침
==============================================================================================================
 
- 당뇨 소포품 택배 보내기(큰누나 경주)
1. 경북 포항시 북구 중앙로419번길 16 대동상가 109호 꾀꼬리미용실(우현동 104-7 번지)
==============================================================================================================

1. 조문 감사 문자 보내기
- 조문객 용
■ 삼가 감사 인사를 드립니다. ■
지난 저희 아버님 장례에 바쁘신 와중에 찾아주셔서 따뜻한 조문의 부의를 베풀어 주신 은혜 진심으로 감사 드립니다.
덕분에 저희 아버님 잘 모셨습니다.
직접 찾아뵙고 인사드리지 못하는 점 너그럽게 이해 바라며, 다시한번 감사 인사를 전합니다.
아울러 귀댁에 애경사가 있을때에 알려주시면 함께 기쁨과 슬픔을 나눌 기회로 삼아 정중히 찾아뵐 것을 약속드리며 늘 하시는 일 잘 되기를 기원합니다.
진태만 배상
-------------------------------------------------------------------------------------------------------------------------------

- 부의객 용 
■ 삼가 감사 인사를 드립니다. ■
지난 저희 아버님 장례에 바쁘신 와중에 따뜻한 부의를 베풀어 주신 은혜 진심으로 감사 드립니다.
덕분에 저희 아버님 잘 모셨습니다.
직접 찾아뵙고 인사드리지 못하는 점 너그럽게 이해 바라며, 다시한번 감사 인사를 전합니다.
아울러 귀댁에 애경사가 있을때에 알려주시면 함께 기쁨과 슬픔을 나눌 기회로 삼아 정중히 찾아뵐 것을 약속드리며 늘 하시는 일 잘 되기를 기원합니다.
진태만 배상
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.11(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 자리 이동(12:40, 한혜숙 부장과 자리 바꿈: 구종식 부장 요청), 커피(14시, 이윤석 차장)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 전문 연결
02. 본인인증(TZ0010, 01) 분석
08. 입출금 계좌 등록(TD0030, 01) 처리
==============================================================================================================

- 입출금 계좌 등록(TD0030, 01) 전문 요청 서비스 에러
1. 현상:
TASK_TD0030_00001, ERROR: {ERR_CDOE=E, ERR_MSG=비대면실명인증방식 틀림, 콜센터에 연락하세요.}
==============================================================================================================

- pub_file_list.xml 파일 연결 에러
0. http://locahost:9080//websquare.html?w2xPath=/ui/pub/pub_file_list.xml
1. 현상: ERR_CODE, "E", "ERR_MSG:, "페이지를 찾을수 없습니다.", "OUT_DATA", "", "CryptoYN":"", "RTN_CODE":"404", "RTN_MSG":"페이지를
찾을수 없습니다."
2. 원인: pub_file_list는 자체 websquare 엔진에서 설정
3. 조치: websquare 엔진에서 설정
 1) jWEB Project(마우스 우 클릭 --> Propertites) ==> Propertites for jWEB(새창)
	가. Websquare(왼쪽 메뉴) ==> Preview Settings ==> Preview Settings(새창)
	==> 1. Preview Type: Local Engine		--> 체크 처리 @@@
	==> 2. Websquare Entry Point: HTTP://$(f_server}/websquare 	--> Disabled 처리됨
 2) 테스트 결과 ==> http://127.0.0.1:3158/websquare/websquare.html?w2Config=/.settings/config.xml&w2xPath=/ui/WF/WF001M.xml
==============================================================================================================

- 부의금 받음(09시)
1. 지아데이타 직원 부의금 받음(구종식 부장, 이경일 부장, 박찬형 대리, 박건유 대리, 김유이 대리): 총 25만원
2. 인스웨이브 이광철 이사 부의금 5만원 받음: 총 10만원
3. 제주은행 김준 대리 부의금 5만원 받음
==============================================================================================================

- 개발 관련 회의(09:30, 회의실, 개발팀)
1. pub_file_list.xml  파일에서 아래 내용 작성 및 매일 파일 Update, Commit할 것
 1) 프로그램ID: /com/TD0010/TD0010_01_s1.xml
 2) 개발담당자: 진태만부장
 3) 개발시작일: 09.01
2. 개발 일정 등록(오늘까지)'
3. 전문 등록 수정
 1) SEQ: 1 --> 01
==============================================================================================================

- 한혜숙 부장과 기획팀, 이광철 이사 다툼
17:30 이광철 이사가 한혜숙 부장과 기획팀 회의실로 부름
17:35 한혜숙 부장과 기획팀과 대출 관련 기획 내용이 부실하다고 서로 다툼
17:45 이광철 이사가 "너희들이 지금 머하는고 있는 거야?"라며 소리 지름 ==> 한혜숙 부장이 "나이 40 먹고 이런 반말을 듣는 것은
        처음이야, 나는 철수할거다"라고 하면 회의실 나옴 ==> 한혜숙 부장 자리에 와서 팀원들 다 있는데서 소리 치르면 난동 부림
		==> 구종식 부장이 한혜숙 부장 데리고 나가서 따로 이야기 함 ==> 한혜숙 부장 자기는 그만 두겠다고 하고 퇴근 함
18:30 퇴근
18:40 식당(족발 세트, 석식): 구종식 부장, 이경일 부장, 박찬형 대리, 박건유 대리, 김유이 대리, 이윤석 차장 ==> 한혜숙 부장이 평소에
        까칠해서 구종식 부장도 힘들었고 김유이 대리고 힘들었다고 함
19:20 종료
20:00 퇴근
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.12(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 비 조금 옴

- 주말[★]
08:00 기상
08:10 조식
08:30 실내 자전거 타기
09:30 종료 
10:40 귀가 
12:00 중식
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑
14:40 집출발(수종)
15:00 대동초 정류장(507번 버스 탑승): 수종 ==> 어른 1명, 어린이 1명: 1,650원(처음 결재)
15:50 광희동 정류장(동대문) 하차 ==> 비 조금 옴(우산)
16:20 승진 완구 ==> KTX 산천 고속열차(정경)[18,200원], 너프 엘리트-스트롱암(A0710(모아비)[12,375원] ==> 수종 생일 선물
16:50 우산(동대문 시장) [10,000원] 
17:00 (주)다이소 동대문점 ==> 투명 OPP 테이프(48mm*70m(보급형)[1,000원] 
17:20 광희동 정류장(507번 버스 탑승): 수종
18:20 대동초 정류장 하차
18:30 귀가
18:45 석식  
19:00 실내 자전거 타기
20:00 종료
20:00 인터넷 서핑 
22:00 샤워 ==> 체중: 75.1kg
23:10 루옌 귀가
23:27 인슐린 약 교체(276U, 21U 남음)
23:50 취침
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2020.09.13(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==>  

- 주말2[★]
08:00 기상
08:10 조식
08:30 실내 자전거 타기(거실 걷기): 고관절이 아파서 거실 걷기로 전환
09:30 종료
11:40 루옌 놀러 감
12:00 중식
12:30 거실 걷기
13:30 종료
13:40 인터넷 서핑
18:00 루옌 귀가
18:10 석식
18:40 거실 걷기
19:40 종료
19:40 인터넷 서핑
22:20 취침
==============================================================================================================
 
- 구글(google) 비밀번호 변경 
1. https://accounts.google.com, taemario@gmail.com, 202*오십h@
==============================================================================================================

- 금융인증서 분석
1. 2020 09 03 금융인증 SDK 업무요건정의서 0 11[Keunok Kim]
https://www.youtube.com/watch?v=m0vHnMB8JFE&feature=youtu.be&ab_channel=KeunokKim
==============================================================================================================

- 성공한 사람들의 시간관리 방법 | 독일 사람들의 시간관리법
https://www.youtube.com/watch?v=qkctJP7JzXo&ab_channel=%EC%A7%80%EC%8B%9D%ED%95%9C%EC%9E%94
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.14(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 한혜숙 부장 철수(10시, 구부장이 대출 업무 내가 맡아 달라고 요청함), 석식(19시, 과자[초코바]: 구부장이 18시에 퇴근)
								  : 코로나19 2.5단계에서 2단계로 완화(당구장 영업 재개, 수종 태권도 2주만에 다시 다님), 이윤석 차장 투입(09.07(월))
								
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 전문 연결
1. 08. 입출금 계좌 등록(TD0030, 01) 처리
==============================================================================================================

- pub_file_list.xml 파일에서 개발 이력 추가 및 Update, Commit 처리
 1) 프로그램ID: /com/TD0010/TD0010_01_s1.xml
 2) 개발담당자: 진태만부장
 3) 개발시작일: 09.01
--------------------------------------------------------------------------------------------------------------

- pub_file_list.xml 파일 수정
<w2:row>
	<col1><![CDATA[공통]]></col1>
	<col2><![CDATA[회원가입]]></col2>
	<col3><![CDATA[입출금 계좌 신청]]></col3>
	<col4><![CDATA[약관 동의]]></col4>
	<col5><![CDATA[/ui/pub/xm/Z00001-13.xml]]></col5>
	<col6><![CDATA[09.09]]></col6>
	<col7><![CDATA[Y]]></col7>
	<col8><![CDATA[송하은]]></col8>
	<col9><![CDATA[Z00001-13]]></col9>  <!--// 9. 퍼블 ID //-->
	<col10><![CDATA[/ui/com/TD0020/TD0020_01_s1.xml]]></col10>	<!--// 10. 프로그램 ID 추가[2020.09.14, by 진태만] //-->
 	<col11><![CDATA[진태만부장]]></col11>	<!--// 11. 개발 담당자 //-->
	<col12><![CDATA[09.11]]></col12>	<!--// 12. 개발 시작일 //-->
</w2:row>
==============================================================================================================

- 개발 관련 회의(10:50, 회의실, 개발팀)
1. J간편통장 프로세스 개발 확인 ==> 이번주까지 모두 마무리할 것(구부장)
 1) 본인 인증: 완료
 2) 비대면 인증: 개발 중(이윤석 차장)
 3) 고객 정보 등록: 개발 중(박찬영 대리)
 4) 입출금 계좌 등록: 개발 중(진태만 부장)
2. 개발 일정 등록(오늘까지)
3. META 정보 사용(xTouch 관리자에서 TASK 관리 ==> META 정보(팝업)에서 등록할 것
 1) IN DATA, META DATA COMMON DATA ==> 확인: TASK관리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.15(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 구부장과 회의(09시: 내가 대출 업무 맡겠다고 먼저 말함), 석식(19시, 개발팀, 김정렬 부장(허민준 대리와 신한
								  금융 그룹에서 Prj 수행 중)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- j간편통장 전문 연결
1. 08. 입출금 계좌 등록(TD0030, 01) 처리
==============================================================================================================

- 대출 관련 회의(10:00, 회의실, 개발팀, 김혜임 차장 발표)
1. 엘리트론, 슬기로운 직장인 대출(신용 대출)
 1) 한도 조회(비회원도 가능) ==> 유효 기간(1일)
 2) 대출 신청
 3) 대출 실행 ==> App으로 이동(협의 필요)
 4) 슬기로운 직장인 대출: 기획 안됨
2. 예금담보대출, 제주 CAR 드림 대출(신차), 제주 Car드림 전환대출(신차/중고차), 제주 CAR 드림 대출(신차-카드결제방식)
	, 제주 CAR 드림 대출(중고차)
 1) 한도 조회(비회원도 가능) ==> 유효 기간(1일)
 2) 예금담보대출(회원 만 신청 가능) ==> 대출 신청까지 진행
 3) 제주 CAR 드림 대출(4개) ==> 한도조회까지 진행
3. JJB 가맹점 우대론(SOHO대출) 
 1) 기획 안됨 
4. 대출 신청 조회/실행 ==> 김은진 과장 발표
 1) 대상: 엘리트론, 슬기로운 직장인 대출(신용 대출)
 2) 전자 서식(약관)
5. 원리금 상환 ==> 이진영 차장 발표
 1) 원금 납입: 중도 상환 수수료 존재 안함
 2) 이자 납입 후 원금 납입 가능: 현재 납입해야 할 이자가 표기 안됨 
==============================================================================================================

- 화면 높이기
1. TZ0010_01.s1.xml 파일 참조
com.bottom.init();
==============================================================================================================

- eclipse에서 SVN 충돌시 조치
1. eclipse에서 충돌한 로컬 파일(예: TZ0010_01.s1.xml --> 빨간색) 백업
2. SVN: Override and Update 처리
3. eclipse에서 백업한 파일(/TZ0010_01.s1.xml)과 서버에서 Update한 파일을 비교하여 추가된 부분만 복사, 붙여넣기 처리
4. SVN: 수정한 파일(/TZ0010_01.s1.xml)을 Commit 처리 
==============================================================================================================

- SVN 공동으로 Commit 겹치는문제 해결법
1. Override and Update는 내것 (local) 다 무시하고 그냥 서버에 있는 모든 내용을 내 저장소에 덮는 것이다. 
 1) 이것은 내가 작업하는데 수정 못할 정도로 망쳤을 때 복구할 수 있는 기능이다. 
출처: https://pjh3749.tistory.com/49 [JayTech의 기술 블로그]'
-----------------------------------------------------------------------------------------------------------------------------------

- Subclipse(SVN)에서 충돌(conflict)이 일어나는 경우 해결법
출처: https://donxu.tistory.com/entry/SubclipseSVN에서-충돌conflict이-일어나는-경우-해결법 [위슈의 마법 세상]

- SVN 강좌2
https://www.youtube.com/watch?v=rQxOjdeRFjo&ab_channel=CMK

- TortoiseSVN 협업 [생활코딩]
https://www.youtube.com/watch?v=e2EhgDN0AHM&ab_channel=%EC%83%9D%ED%99%9C%EC%BD%94%EB%94%A9
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 주간보고(11주차)서 작성(14시), 오후에 비 약간 내림

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 07. 상품 가입 이용 약관(TD0020, 01) 처리
- 08. 고객 정보 등록(TZ0080, 01) 이용 약관 화면 개발
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.17(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 피자 파티(15:00, 이광철 이사가 쏨): 석식 안함(19시, 과자로 대체)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 09. 입출금 계좌 등록(TD0030, 01) 화면 전문 개발
1. 전문(2322) 비대면 이여서 에러 발생
 1) 원인: 비대면 인증 후 신규 고객이 입출금 계좌를 신청해야 등록이 됨
 scwin.fn_callService(TASK_TD0030_00001");			// 09. 입출금 계좌 등록 전문 호출
 
// 전문 호출 서비스
scwin.fn_callService = function(svID) 
(
	gcm.log("[/TD0030_01.s1.xml] [fn_callService()] ==> [TEST_01] [전문_★★_호출] [svID]"+ svID );
	
	var set_JSON = "";
	
	set_JSON = {
		"ufcRiNmCtcWayCd": "2";		// 1. 비대면실명인증 방식 코드(1: 영상통화 이증, 2: 타행계좌 인증, 3: 당행계좌 인증)
		"sujCd": "01";							// 2. 과목코드(01:보통예금, 02:저축예금)
	};
);
==============================================================================================================

- UI단 에러
1. 현상: wfm_xtouch_main_ui 설정 오류
2. 조치: 해당 xml 자체 에러 ==> xml 파일 수정할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.18(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 구부장, 이경일 부장, 이윤석 차장 제주행(09시, 제주은행 이윤석 차장과 개발과 협의 문제로 회의 감), 문영 APT
								   주인한테 전호 옴(13시, 10월말에 이산 온다고 함(계약금 송금 해준다고 해서 거부: 부동산과 대화 한다고 선언함)
								   , 삼성 갤럭시S8 핸드폰 케이스 교체(22시, 상환이가 선물로 준 것), 석식(18:40, 돌솥(8천, 원당 감자탕: 청구할 것)

- j간편통장 전문 연결
- 제주 CAR드림 대출(신차) (PL0004) 개발
1. 한도 조회
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.19(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 

- 주말[★]
08:00 기상
08:10 조식
08:30 실내 자전거 타기
09:30 종료  
09:40 인터넷 서핑
10:35 집출발(자전거)
10:50 서울 좋은 치과의원: 방문 만 함
11:00 희망 치과(수종): 구강 검사(X-ray): 상태 아주 좋다고 함
11:10 (주)다이소 대림2호점 ==> 3단 우산, 과자, 투명 OPP 테이프(48mm*70m(보급형) [1,000원]  
11:10 귀가
12:00 중식
12:30 실내 자전거 타기
13:30 종료 
13:40 인터넷 서핑
16:00 루옌 놀러 감 
18:10 석식
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
22:00 샤워 ==> 체중: 74.4kg
23:10 루옌 귀가
22:58 인슐린 약 교체(269U, 21U 남음)
23:50 취침
02:20 루옌 귀가 ==> 내가 잠깨서 작은 방으로 옮김
==============================================================================================================

- 다문화 연구 학교 평가 설문 작성 ==> 완료 @@@
1. 2020학년도 다문화연구학교 운영 평가를 위한 설문지 입니다. 더 나은 학교 운영을 위해 9/20(일요일) 까지 학생/학부모 설문을 완료해주시면 '
감사하겠습니다.  (e학습터에서 실시 혹은 아래 링크 클릭)
학부모용: http://naver.me/G6Ywfag3
학생용: http://naver.me/IgtZwb3i
==============================================================================================================

- 서울좋은치과의원: 방문 만 함
https://place.map.kakao.com/10485979
==============================================================================================================
 
- 금융 읽어주는 여자 천덩이[대출, 집구입]
https://www.youtube.com/channel/UCVqtfuvKbb5bZYcxrZ1pzJw
==============================================================================================================

- 휴대폰을 깨끗이 쓰는법은 보호필름을 벗기는것이다.
https://www.youtube.com/watch?v=XycsDqpahCc&ab_channel=정승제사생팬
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.20(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==>  

- 주말2[★]
09:09 기상
09:15 조식
09:30 실내 자전거 타기
10:30 종료 
10:40 인터넷 서핑 
12:00 중식
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
14:00 루옌(수종) 놀러 감
18:10 석식
18:40 실내 자전거 타기
19:40 종료
20:10 루옌(수종) 귀가
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.21(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 이경일 부장이 서비스등록관리 테이블(전문) 삭제(20시, 디시 수기로 복귀함), 삼성 갤럭시 S8 핸드폰 액정 필름 제거
								   , 가죽 케이스 교체(상환이가 선물한 거: 새 것 같아서 기분 좋음), 박소영 계장 외조모상(4일 휴가)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 예금담보대출(PL0004) PPROCESS 생성
1. xtouch 관리자 화면 ==> 프로세스관리 ==> 예금담보대출(PL0004) PPROCESS 생성 ==> 완료 @@@
==============================================================================================================

- 전문 호출 에러
1. 현상: PROXY 통신 오류
TASK_TZ0010_00001, ERROR: {ERR_CDOE=E, ERR_MSG=ROXY 통신 오류, RTN_CDOE=-9999, RTN_MSG=ROXY 통신 오류}
2. 원인: 서버가 다운되었거나 소스가 변경됨
3. 조치
 1) SVN에서 소스 싱크 맞춤 ==> 충돌 제거
 2) 서버 재시작
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.22(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 엘리트론(PL0001) (신용 대출) PPROCESS 생성
1. 총 15개 TASK ==> 완료 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.23(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 21:00 ==> 주간보고(12주차)서 작성(14시)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주 CAR드림 대출(신차) (PL0004) 개발
1. TASK_TL00030_00001: 대출 신청 내역 조회
 1) MFSV_9003: 01. 정보계 연결 거래 관리(01. 정보계 호출 전 호출) 전문 ==> 성공 @@@
 2) TXSV_040: 02. 대출 신청 내역 조회(정보계: 턱시도) ==> 실패(이경일 부장이 이유석 과장에게 요청) @@@ 
==============================================================================================================

- 전문 수정(정보계)
1. 속성영문명 수정
 1) 소스 보고 지정하여 등록할 것
2. FML ID 수정
 1) 속성영문명 --> ML ID로 변경
3. 전문등록관리에서 수정할 것 ==> 예상한도(2191) 참조하여 수정할 것
==============================================================================================================

- 정보계 턱시도 통신을 위한 프로그램 처리
1. EdwCn.java
==============================================================================================================

- 필수 DB 암호화 처리해야 할 칼럼
1. 주민번호, 비?먼호, 전화번호, 주소, 메일 주소
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.24(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:40 ==> 수종이 생일(21시, 케익, 선물(추가로 줌: 다이소 장난감(KTX): 집에 있는 것(반품할 것))

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주 CAR드림 대출(신차) (PL0004) 개발
1. TASK_TL00030_00001: 대출 신청 내역 조회
==============================================================================================================

- viewport 설정
1. websquare.xml 파일 열기
2. jWEB 프로젝트: 마우스 추 클릭 ==> Propertites ==> Propertites for jWEB(새창)
 1) Websquare(왼쪽 메뉴) ==> Engine Modification
  ==> 1. Engine Resource: websquare.xml --> 선택 @@@
  ==> Apply and Close
==============================================================================================================

- Class 보이기, 안 보이기 처리
<script type="text/javascript" lazy="false"><![CDATA[ 
	// 초기 스크립트 수행 함수 정의
	scwin.onpageload = function() { 
		console.log("[/TL00010_01_s1.xml] [onpageload()] ==> [TEST_01] [프로세스 관리 화면 로딩...@@@]" ); 
		
		grp_yearPay.addClass("on"); 	// grp_yearPay Group 안에 있는 Class 보이기
		// grp_chgLn.removeClass("on"); 	// grp_chgLn Group 안에 있는 Class 보이기
		// $[".hide_box"].addClass("on"); 	//hide_box Class 보이기
		
		ipt_name.focus(); 	// 성명 Focus 처리
	}; 
]]></script>

<xf:group id="grp_yearPay" class="hide_box">
	<xf:group class="form_ipt" id="">
		<xf:group class="lable_box" id="">
			<w2:textbox tagname="label" label="연소득"></w2:textbox>
		</xf:group>
	</xf:group>
</xf:group> 
==============================================================================================================

- 개발 관련 회의(10:50, 회의실, 개발팀)
1. 전문 MCI로 전달 요청(이광철 이사)
 1) 우리 업무가 아니라고 분명히 선을 그으라고 구종식 부장이 이광철 이사에게 전달
2. 개발 진척 미진한 문제(심각하게 진도 안 나가고 있음)
 1) 개발 전문 요청을 하면 현업이 빠르게 처리 안해줌: 강력하게 요청할 것(그래도 답이 없을 것 같음)
 2) 개발자 업무 TASK_PROCESS로 작성할 것
==============================================================================================================

- 대출 프로세스 시연(13시, 내자리, 김혜임 차장, 구종식 부장)
1. 대출 프로세스 3개 흘러 보기
01-1. 제주 CAR 드림 대출(PL0004) [담보 대출] 프로세스
01-2. 예금담보대출(PL0003) [담보 대출] 프로세스
02. 엘리트론(PL0002) [신용 대출] 프로세스
2. 문제점
 1) [공통] 본인 인증 비밀번호 뒷자리 체크: 암호화 처리
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.25(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 박소영 계장 출근(9시, 외조모상 후 출근)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주 CAR드림 대출(신차) (PL0004) 개발
1. TASK_TL00030_00001: 대출 신청 내역 조회
==============================================================================================================
 
- 박소영 계장 PC에 jWEB 설정
1. j간편통장 설정
==============================================================================================================
 
- j간편통장 전문 연결
1. 08. 입출금 계좌 등록(TD0030, 01) 처리
 1) 전문 연결 에러 ==> 
==============================================================================================================
 
- 제주 CAR 드림 대출(PL0004) [담보 대출] 프로세스
TZ0001: 01. [공통] 상품 가입 안내
TL0010: 02. 본인 확인[대출]
TL0020: 03. 만 19세 이상 확인_S
TZ0010: 04. [공통] 휴대폰 본인 인증 
TL0030: 05. 대출 신청 내역 조회_S
TL0040: 06. 약관 및 동의서[대출]
TL0050: 07. 전자서명[대출]
TL0060: 08. 금융인증서 인증[대출]
TL0070: 09. 스크래핑[대출]
TL0080: 10. 대출한도 조회 결과[대출]
TL0090: 11. 앱 연계[대출] ■
----------------------------------------------------------------------------------------------------------------------------------

- 예금담보대출(PL0003) [담보 대출] 프로세스
TZ0001: 01. [공통] 상품 가입 안내
TL0010: 02. 본인 확인[대출]
TL0020: 03. 만 19세 이상 확인_S
TZ0010: 04. [공통] 휴대폰 본인 인증 
TL0030: 05. 대출 신청 내역 조회_S
TL0040: 06. 약관 및 동의서[대출]
TL0050: 07. 전자서명[대출]
TL0060: 08. 금융인증서 인증[대출]
TL0070: 09. 스크래핑[대출]
TL0080: 10. 대출한도 조회 결과[대출]
TL0090: 11. 앱 연계[대출] ■
----------------------------------------------------------------------------------------------------------------------------------

- 엘리트론(PL0002) [신용 대출] 프로세스
TZ0001: 01. [공통] 상품 가입 안내 
TL0010: 02. 본인 확인[대출]
TL0020: 03. 만 19세 이상 확인_S
TZ0010: 04. [공통] 휴대폰 본인 인증 
TL0030: 05. 대출 신청 내역 조회_S
TL0040: 06. 직장정보 입력[신용 대출]
TL0150: 07. 약관 및 동의서[신용 대출]
TL0050: 08. 전자서명[대출] 
TL0060: 09. 금융인증서 인증[대출]
TL0070: 10. 스크래핑[대출]
TL0160: 11. 대출한도 조회 결과[신용 대출]
TL0170: 12. 고객 정보 확인[신용 대출]
TL0180: 12. 예삼금리 확인[신용 대출]
TL0190: 14. 신청정보 입력[신용 대출]
TL0200: 15. 대출신청 결과[신용 대출] ■
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.26(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 

- 주말[★]
09:50 기상
10:10 조식
10:20 실내 자전거 타기
10:30 종료  
10:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료 
13:40 인터넷 서핑
18:10 석식
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
22:00 샤워 ==> 체중: 74.9kg 
22:52 인슐린 약 교체(277U, 14U 남음) 
23:40 취침
==============================================================================================================

- 윈도우10 잠금화면 없애기(해제 방법)
https://rgy0409.tistory.com/3194	
1. 윈도우키 + R을 누르고 실행창 뛰움 ==> 열기: gpedit.msc 입력
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.27(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==>  

- 주말2[★]
09:10 기상
09:15 조식
08:30 실내 자전거 타기(SBS 뿌리깊은 나무[24회: 마지막회] 시청)
10:30 종료 
10:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기(SBS 뿌리깊은 나무[25회: 요점 정리] 시청)
13:30 종료
13:40 인터넷 서핑
17:20 루옌 놀러감
18:10 석식
18:40 실내 자전거 타기(SBS 뿌리깊은 나무[26회: 요점 정리2] 시청)
19:40 종료
22:20 루옌 귀가
23:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2020.09.28(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 기획 김혜임 차장 철수(16시), 수신 개발자 면접(17시, 구종식 부장: 개발자(TO-BE 공통] 10월 7일(수)부터 출근 예정)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★] 
- 제주 CAR드림 대출(신차) 개발
- 대출 신청 내역 조회 전문(TASK_TD0030_00001) 호울 전문_★★_호출 에러 ==> 정보계 호출 예러(이유석 과장과 처음으로 전화 통화)
1. 현상:
var inputData = {		// IN_META_INFO 등록[전문] (서비스 등록 관리 화면에서) @@@@
	"clnCcd": "1", 					// 1. 고객구분코드(1:당행고객, 2:당행미등록 고객)
	"hdpN": "01088521469", 		// 2. 휴대폰번호
	"ctsCcd": "1", 					// 3. 인증서구분코드(1:당행인증서 보유, 2:타행인증서 보유)
	"ctcMtCd": "1", 					// 4. 인증서방법코드(1:당행인증서 인증, 2:타행인증서 인증, 3:타행계좌 인증)
	"seiAcN": "0102690087", 	// 5. 가상계좌번호
};
	
com.exeService(
	{
		"ServiceID": "TASK_TD0030_00001",
		"URL": "_XTOUCH_INTERFACE_",
		"CryptoYN": "N",
		"mode": "",
		"NOW_TASK_INFO": scwin.nowTaskInfo
	},											/ Sub Info(1. ServiceID, 2. URL: 호출할 URL, 3. CryptoYN: 암호 적용여부) ■■	
	inputData,							// 전송할 INPUT 데이타 ■■	
	scwin.service_callback			// 결과 콜백 함수 ■■	
	};	
};

##### END : TASK_TD0030_00001, ERRRO : {ERR_CODE=E, ERR_MSG=Unknown reason, OUT_DATA=, CryptoYN=, RTN_CDOE=-9999M
, RTN_MSG=Exception rollback 오류, OUT_DATA=}
==============================================================================================================
 
- pub_file_list.xml 파일 수정
<col9><![CDATA[Z00001]]></col9>	<!--// 9. 퍼블 ID  //-->
<col10><![CDATA[/ui/com/TD0020/TD0020_01_s1.xml]]></col10>	<!--// 10. 프로그램 ID 추가(2020.09.28, by 진태만]  //-->
<col11><![CDATA[Z00001]]></col11>	<!--// 11. 개발담당자 //-->
<col12><![CDATA[09.28]]></col12>	<!--// 12. 개발시작일 //--> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.09.29(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 15시에 개발팀 모두 퇴근(추석 연휴 전날), 루옌(수종) 언니집에 가서 자고 온다고 전화 옴(16시)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주 CAR드림 대출(신차) 개발
- 대출 신청 내역 조회 전문(TASK_TD0030_00001) 호울 전문_★★_호출 에러
==> 전문 호출 성공(16:20 이유석 과장이 다시 전화로 요청해서 해결)
==============================================================================================================
 
- 개발자 고객번호 이유석 과장에서 전달
1. 고객번호: 0466 61438(0046661438), 고객명: 진태만
2. 고객번호: 0005901057, 고객명: 박소영 ==> 대출에서 사용 못 함
==============================================================================================================
 
- 주민등록 유효설 체크 개발
scwin.btn_confirm_onclick = function(e) {
	gcm.log("[/TD0010_01_s2.xml] [btn_confirm_onclick()] ==> [TEST_01] [확인 버튼 클릭 이벤트] [ibx_name]"+ ibx_name.getValue() );
	
	scwin.fn_callService("TASK_TZ0010_00004");		// 주민등록 유효설 체크 전문 호출
}
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.09.30(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 추석 연휴(정상 출근): 출근 시 제주은행 6층 보안 해제 뒤 출입문 키 못 염(탕비실에서 열쇠 찾아서 문 염(8시)
								, 중식(11:30, 편의점 깁밥 컵라면), 석식(17:40, 오징어 돌솥[원당 감자탕]: 식사 후 비 많이 와서 맞음[명동역 내부에서 걷기]
								, 루옌(수종) 언니집에 가서 자고 귀가(21:50)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주 CAR드림 대출(신차) 개발
- 07. 스크래핑[대출] (TL00070) 화면 개발
==============================================================================================================

- 연소득 숫자를 한글 변환 처리
<script type="javascript" lazy="false"><![CDATA[ 
	// 연소득 금액 입력 이벤트
	scwin.ibx_salary_onkeyup = function(e) {
		// gcm.log("[/TL00010_01_s2.xml] [btn_confirm_onclick()] ==> [TEST_01] [확인 버튼 클릭 이벤트] [ibx_name]"+ ibx_name.getValue() );
		gcm.log("[/TL00010_01_s2.xml] [ibx_salary_onkeyup()] ==> [TEST_01] [연소득 금액 입력 이벤트]" );
		
		scwin.chgSalayhNum2Kor();		// 연소득 숫자를 한글 변환 처리
	};
	
	// 연소득 금액 blur 처리 이벤트
	scwin.ibx_salary_onblur = function(e) {
		gcm.log("[/TL00010_01_s2.xml] [ibx_salary_onblur()] ==> [TEST_01] [연소득 금액 blur 처리 이벤트]" );
		
		scwin.chgSalayhNum2Kor();		// 연소득 숫자를 한글 변환 처리
	};
	
	// 연소득 숫자를 한글 변환 처리
	scwin.chgSalayhNum2Kor = function(e) {
		gcm.log("[/TL00010_01_s2.xml] [chgSalayhNum2Kor()] ==> [TEST_01] [연소득 숫자를 한글 변환 처리]" );
		
		var sSalary = ibx_salary.getValue();		// 연소득
		gcm.log("[/TL00010_01_s2.xml] [chgSalayhNum2Kor()] ==> [TEST_02] [sSalary.length]"+ sSalary.length );
		
		if(sSalary.length > 0 && sSalary == 0) {
			sSalary.setValue("");		// 연소득
			return;
		}
		
		if(sSalary.length ==10) {
			com.alert("연소득을 넣을 수 있는 최대 자리 수 입니다.");
			return;
		}
		
		if(sSalary == "") {
			com.alert("만 원");		// 연소득(한글)
			return;
		}
		
		sSalary = sSalary + "0000";	// 연소득(만원 추가)
		
		var sSalaryKor = com.numberKor(sSalary).replace("만원", " 만원");	// 금액 한글 표기 포맷 처리
		
		ibx_SalaryKor.setValue(sSalaryKor.toLocaleString());	// 연소득(한글) ■ 
		gcm.log("[/TL00010_01_s2.xml] [chgSalayhNum2Kor()] ==> [TEST_52] [ibx_SalaryKor]"+ ibx_SalaryKor.getValue() );
	}; 	
]]></script>

<script type="javascript" lazy="false"><![CDATA[ 
	// 금액 한글 표기 포맷
	com.numberKor = function(val) {
		gcm.log("[/com.js] [numberKor()] ==> [TEST_01] [val]"+ val +"[sSalary.length]"+ sSalary.length );
		
		var numKor = new Arry("", "일", "이", "삼", "사", "오", "육", "칠", "팔", "구", "십");		// 숫자 문자
		var danKor = new Arry("", "십", "백", "천", "", "십", "백", "천", "", "십", "백", "천", "", "십", "백", "천");		// 만위 문자열		
		var reslult = "";
		val += "";
		
		if(val && !isNaN(val)) {
			for(var i=0; i<val.length; i++) 
			{
				var str = "";
				var num = numKor[val.charAt(val.length - (i+1))];
				
				if(num !="") str += num + danKor[i];			// 숫자가 0인 경우, 텍스를 표현하지 않음
				gcm.log("[/com.js] [numberKor()] ==> [TEST_51] [i_번째]"+ i +"[num]"+ num +"[danKor[i]]"+ danKor[i]  +"[str]"+ str );
				
				// 금액 단위(억, 조) 수정[2020.09.30, by 진태만]
				if(i == 8 || i ==12)		
				{
					if(i == 8) str += "억";
					if(i == 12) str += "조";
					result = str;					
				}
				else
				{
					if(i == 4) str += "만";
					result = str + result;
				}
				
			}	// end fo for()
			
			result = result + "원";  
		}
		
		return result;			
	};	
]]></script>

<xf:input id ="ibx_salary" ev:onfocus= "" adjustMaxLenth="false": displayFormat="#,####" dataType="numberKor maxlength="10"
	allowChar="0-9" ev:onblur="scwin.ibx_salary_onblur " ev:onkeyup="scwin.ibx_salary_onkeyup "> <!// 연소득(숫자)  //-->
</xf:input> 
<xf:textbox id ="ibx_salaryKor" lable= "만원" class="txt guide tar"/> <!// 연소득(한글)  //--> 
==============================================================================================================

- jWeb Prj 샘플 분석
01. xTouch Prj 분석.txt
02. xTouch Prj 샘플 분석.txt
51. jWeb 전문 분석(XTOUCH).txt
53. jWeb 전문 분석(NO-XTOUCH).txtt
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
