 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2020.05) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2020.05.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 노동절(공휴일)

- 노동절[★]
07:00 기상
07:40 조식
08:00 실내 자전거 자전거 타기 ==> [드라마] 해신 장보고, 40부 시청(핸드폰으로)
08:50 종료
08:55 은영이, 은영이 엄마 나감
09:00 집출발(자전거: 수종)
09:10 대동초 돌봄교실(수종이 등교 시킴)
09:20 엘마트 ==> 밀크 플러스 900ml(우유, 4통) 구입
09:30 귀가
10:00 인터넷 서핑
12:00 루옌 친구랑 같이 놀러 감
12:10 중식
12:30 실내 자전거 타기
13:30 종료
14:00 인터넷 서핑
17:50 집출발(자전거)
18:00 영웅 태권도(이호정 사범: 수종이 데리고 옴)
18:10 귀가
18:20 석식 
19:00 실내 자전거 타기
20:00 종료 
20:10 인터넷 서핑
23:00 취침
============================================================================================================== 

- 토렌트의 원리 예능 설명 (feat.P2P, torrent)
https://www.youtube.com/watch?v=9KeJR6vSnw4 
==============================================================================================================
 
- 라스트 패스 비밀번호 변경[2020.05.01(금)]
1. https://lastpass.com/?ac=1&from_uri=/otp.php --> tamario@naver.com, 20*0오십h@
==============================================================================================================

- 마이크로소프트 엣지 브라우저 설치
1. chrominum(크로미움) 기반, Window 7용 설치(사용 제한이 존재함) ==> https://www.microsoft.com/ko-kr/edg 

- 윈도우 10의 유용한 기능, 엣지 브라우저 활용하기
https://www.youtube.com/watch?v=tctpW12QxAA
==============================================================================================================
 
- 가장 먼저 배우면 좋은 코딩/프로그래밍 언어[알고리즘 투게더 with 거니]
https://www.youtube.com/watch?v=d9RqiaILIh0

- 29살의 C언어 with 거니 [Chapter#1 - 헬로우 월드] [알고리즘 투게더 with 거니]
https://www.youtube.com/watch?v=ojRgaakck_o
==============================================================================================================

- 로컬 서버 이름 수정 ==> 완료 @@@
1. NoxMatRetMot Prj ==> HSCM Prj
 1) File > Switch Workspace ==> Other: 클릭 ==> Workspace Launcher(새창)
  가. Workspace: C:\NoxMatRetMot\workspace  --> C:\HSCM\workspace  ==> 에러가 발생하면 아래 Import로 HSCM 설정 사용할 것
C:\NoxMatRetMot ==> 2.02GB
C:\HSCM ==> 2.02GB

- Import로 HSCM 설정(이클립스에서)
1. 이클립스 왼쪽의 목록 나오는 부분 빈곳에 오른쪽 마우스 클릭 
2. Import ==> Import ==>  Import(새창)
 1) General ==> Existing Project into Workspace: 클릭 --> Next: 클릭
3. Select root directory: C:\HSCM\workspace": 선택 --> Finish: 클릭
==============================================================================================================
 
- HSCM Prj 셋팅
0. 기존 NoxMatRetMot Prj에서 HSCM Prj로 변경 
A. Nexacro 환경 설정
1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창)
  1) Project
    가. General ==> Base Lib Path: C:\HSCM\workspace\HSCM\src\main\nxui\HSCM\nexacro17lib
    나. Generate ==> Generate Path: C:\HSCM\workspace\HSCM\src\main\webapp\HSCM
    다. Deploy ==> Deploy Path: 사용 안함
  2) Environment
   가. General ==> Working Folder: C:\HSCM\workspace\HSCM\src\main
  ===> Applicatin: 클릭    
---------------------------------------------------------------------------------------------------------------------------
 
- Java Build Path(기존 NoxMatRetMot Prj 소스로 HSCM Prj로 변경)
1. JRE System Library 변경
 1) eclipse ==> Properties ==> java Build Path ==> JRE System Library: 더블 클릭 ==>JRE System Library(새창)
  가. Alternate JRE --> Intalled JREs 버튼: 클릭 ==> Intalled JREs(새창) --> Edit 버튼: 클릭 ==> Intalled Definition(새창)
 나. JREs Home: C:\HSCM\eclipse(변경) --> Finish 버튼: 클릭
==> 출처: https://yongtech.tistory.com/98 [용테크의 포켓머니]
---------------------------------------------------------------------------------------------------------------------------
 
2. Maven Dependencies
 1) maven이 설치 되어 있는 경로의 conf 폴더 아래 setting.xml 파일을 열어 <localRepository>경로</localRepository> 를 수정
- / NoxMatRetMot/mavenRepository/settings.xml 파일에서 
<localRepository>C:\NoxMatRetMot\workspace\NoxMatRetMot\mavenRepository\</localRepository>
==>   <localRepository>C:\HSCM\workspace\HSCM\mavenRepository\</localRepository>
<localRepository>C:\HSCM\workspace\HSCM\mavenRepository\</localRepository>
 
 2) window -> preferences -> maven -> user Setttings 의 user Settings의 부분의 경로를 변경된 settings.xml 로 잡아준다.
user Setttings : C:\NoxMatRetMot\workspace\NoxMatRetMot\mavenRepository\settings.xml
==> user Setttings : C:\HSCM\workspace\HSCM\mavenRepository\settings.xml
 
 3) Local Reository: C:\HSCM\workspace\HSCM\mavenRepository  ---> 변경되었는 지 확인할 것 @@@
 
 4) 이클립스 재 실행 한 프로젝트를 생성하여 maven의 경로를 확인
==> 출처: https://developstory.tistory.com/9 [DevelopStory] 
 
3. Maven Active Maven Profile 변경
1) eclipse ==> HSCM: 마우스 우 클릭 ==> Properties for HSCM(새창) 
 가. Active Maven Profile: C:\HSCM\workspace\HSCM\mavenRepository
 C:\HSCM\workspace\HSCM\mavenRepository
==> 확인: e eclipse ==> HSCM: 마우스 우 클릭 ==> Properties for HSCM(새창) ==> Java Build Path ==> Library(탭)
===> Maven Dependencies: 파일들의 경로가 C:\HSCM\workspace\HSCM\mavenRepository로 변경 되었는지 확인할 것 @@@
---------------------------------------------------------------------------------------------------------------------------
 
- Server classpath 변경
1. Servers ==> 01_HSCM Server[8080]: 더블 클릭 ==> Overview(화면)
 1) Open launch configuration: 클릭 ===> Edit launch configuration properites(새창)
1. Arguments(탭) ==> VM arguments:
-Dcatalina.base="C:\HSCM\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp2" -Dcatalina.home="C:\HSCM\WAS\apache-tomcat-8.0.32" 
-Dwtp.deploy="C:\HSCM\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp2\wtpwebapps" -Djava.endorsed.dirs="C:\HSCM\WAS\apache-tomcat-8.0.32\endorsed" 
2. Classpath(탭) ==> User Entries:
 1) C:/HSCM/WAS/apache-tomcat-8.0.32/bin/bootstrap.jar
 1) C:/HSCM/WAS/apache-tomcat-8.0.32/bin/tomcat-juli.jar
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
07:30 기상
08:10 조식
08:30 실내 자전거 타기: 작은 방에서
09:30 종료
10:00 인터넷 서핑 ==> 사랑의 불시착 정리 --> https://www.youtube.com/watch?v=MRXvIddWt2E
12:10 중식 
12:30 실내 자전거 타기
13:30 종료
13:30 루옌, 수종 놀러감(자고 옴)
14:00 인터넷 서핑 
18:20 석식 
18:30 실내 자전거 타기(1시간) 
19:30 종료 
19:40 TV 시청
22:30 취침
==============================================================================================================

- Frame Title Bar 수정 ==> 완료 @@@
1. /HSCM.xadl 파일에서
 <?xml version="1.0" encoding="utf-8"?>
<ADL version="2.0">
  <Application id="HSCM" screenid="ScreenDeskTop,ScreenMobileLarge" onerror="Application_onerror" 
		onload="Application_onload" onbeforeexit="Application_onbeforeexit">
    <Layout>
      <MainFrame id="MainFrame" showtitlebar="true" showstatusbar="false" width="1800" height="994" 
		showcascadetitletext="false" titletext="HSCM" showtitleicon="false" cursor="default">
		/* showtitlebar: 제목 바 보이기 */
	</MainFrame>
    </Layout>
  </Application>
</ADL>
----------------------------------------------------------------------------------------------------------------------------

2. /theme.xcss 파일에서
/**********************TitleBar***********************************************/
.TitleBarControl  		/*  Title Bar 수정[변경일: 2020.05.02(v1.0), by 진태만]  */
{
	font 			: 14px "HDharmony M","HDharmony","맑은 고딕";
	color 			: #ffffff;
	background 		: #1596b9;
	-nexa-padding 		: 0px 0px 0px 10px;
}
.TitleBarControl .minbutton		/* 최소 버튼 */
{
	-nexa-border : 0px none;
	-nexa-icon : URL("theme://img/Titlebar_btn_min_N.png");
	-nexa-padding : 0px 0px 3px 0px;
	-nexa-text-align : center;
	-nexa-vertical-align : bottom;
	background : transparent;
	border-radius : 0px;
} 
.TitleBarControl .minbutton[status=mouseover]		/* 최소 버튼 mouseover */
{
	background : #595f62;
}
.TitleBarControl .minbutton[userstatus=pushed]			/* 최소 버튼 pushed */
{
	-nexa-icon : URL("theme://img/Titlebar_btn_min_P.png");
	background : #ffffff;
}
.TitleBarControl .minbutton[status=disabled]				/* 최소 버튼 disabled */
{
	-nexa-icon : URL("theme://img/Titlebar_btn_min_D.png");
}
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말2[★]
07:30 기상
08:05 조식
08:30 실내 자전거 타기 ==> [드라마] 해신 장보고, 46부 시청(핸드폰으로)
09:30 종료 
12:10 중식
12:30 실내 자전거 타기
13:30 종료
14:00 인터넷 서핑 ==> Local Repository 수정
18:20 석식 
18:30 실내 자전거 타기
19:30 종료  
20:10 샤워
20:36 인슐린 약 교체(265U, 12U 남음)  
20:40 인터넷 서핑  
21:00 루옌, 수종 귀가(민속촌 갔다 왔다고 함)
22:30 취침
==============================================================================================================

- [Maven] Maven 이란? (정의, 예제)
https://goddaehee.tistory.com/199

- 메이븐(Maven) 강의 1강 - 메이븐(Maven)이란?[뉴렉처]
https://www.youtube.com/watch?v=VAp0n9DmeEA

- 메이븐(Maven) 강의 9강 - 서블릿/JSP 라이브러리 설정하기[뉴렉처]
https://www.youtube.com/watch?v=vlIGi0hG_n4

- Maven Repository: Search/Browse/Explore
https://mvnrepository.com/

- 메이븐(Maven) 강의 11강 - 라이브러리 인덱싱 검색
1. Rebuild Index
2. dependency 추가 방법
 1) pom.xml 파일 ==> Dependencies 탭 --> Add 버튼 클릭 ==> Select Dependency(새창)
  가. Enter groupId, artifactId or ...:: tomcat  --> 입력 ==> 선택
https://www.youtube.com/watch?v=GWrjJ3gzM7g

- 메이븐(Maven) 강의 12강 - mvn install : 내가 만든 라이브러리 설치하기
https://www.youtube.com/watch?v=2fyQm_gfnHk
==============================================================================================================
 
- 걸어서 세계속으로 - 걸어서 평양속으로 (2018.09.15 방송)
https://www.youtube.com/watch?v=KaVY6qOjr2o

- [KBS스페셜] 평양 2박3일, 남북정상회담 동행기[2018. 9. 22]
https://www.youtube.com/watch?v=w5LTj3WhiR0 
==============================================================================================================
 
- Local Repository 수정(eclipse에서)
1. Window ==> Prefernces(새창) 
 1) Maven - User settings - Local Repository 
   가. Resore Default: 클릭  --> User Settings: C:\Users\Administrator\.m2\repository로 변경 됨
   나. User Settings: C:\Users\Administrator\.m2\repository로 변경 ==> OK: 클릭
   다. HSCM: 우클릭 ==> Maven ==> Update Project(Alt + F5): 클릭 ==> Update Maven Project(새창) ==> OK: 클릭
   라. HSCM: 우클릭 ==> BuildPath > Configure Build Path > Libraries(탭) > Maven Dependencies: 클릭 
    가) *.jar 파일 경로 확인
-------------------------------------------------------------------------------------------------------------------------------

2. localRepository 경로 수정(C:\HSCM\workspace\HSCM\mavenRepository\settings.xml 파일에서)
<localRepository>C:\GQMS_Tst\workspace\GQMS_Tst\mavenRepository\</localRepository>
==> <localRepository>C:\HSCM\workspace\HSCM\mavenRepository\</localRepository> 로 변경 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 징검다리 휴일(회사에서 임시로 휴일로 지정)

- 징검다리 휴일[★]
07:00 기상
07:30 조식
07:50 실내 자전거 자전거 타기 ==> [드라마] 해신 장보고, 49부 시청(핸드폰으로)
08:50 종료 
09:10 집출발(자전거: 수종)
09:20 대동초 돌봄교실(수종이 등교 시킴)
09:30 귀가
09:40 인터넷 서핑
12:00 루옌 친구랑 같이 놀러 감
12:10 중식
12:30 실내 자전거 타기
13:30 종료
14:00 인터넷 서핑
16:00 집출발(자전거)
16:10 대동초 돌봄교실(수종이 데리고 옴)
16:30 GS25 대림역점 ==> GS25 교통 카드(2천 5백원, 초등생, 수종), 충전(만원)
16:40 이발(스카이 미용실, 수종)
17:10 이마트 구로점 ==> 슈퍼 베네노 RC(자동차 장난감: 수종) 구입
17:40 귀가
18:20 석식 
19:00 실내 자전거 타기 ==> [드라마] 해신 장보고, 51부 시청(마지막회)
20:00 종료 
20:10 인터넷 서핑
23:00 취침
============================================================================================================== 
 
- EBS 다큐프라임 자본주의 제1부 돈은 빚이다(EBS 다큐)
https://www.youtube.com/watch?v=0LYMTsj_eqc

- 자본주의 제3부 금융지능은 있는가(EBS 다큐)
1. 은행, 펀드, 보험 ==> https://www.youtube.com/watch?v=Iu-w6STAz64

- EBS 다큐프라임 자본주의 제5부 국가는 무엇을 해야하는가(EBS 다큐)
https://www.youtube.com/watch?v=-E9nCQbHRPM
1. 케인즈: 거시 경제학, 하이에크: 신자유주의  ===> 아담 스미스: 보이지 않는 손(국부론) ==> 복지 자본주의(북유럽)
============================================================================================================== 

- KT 알뜰폰 롯데카드(제휴카드) 할부 위약금 문의(11:35)
1. 롯데카드에 직접 전화함 ==> 위약금 없다고 함
==============================================================================================================

- 갤럭시 S8_64G5(SM-G950B 휴대폰 USIM 정보
1. SIM 정보(SIM 카드 앱에서)
SIM Card information - SIM Card serial number (ICCID): 8982301217000258548
 1) 유심칩 모델코드: 12170
 2) 유심칩 일련번호: 00258548F 
==> https://blog.naver.com/mcmlss/221484394161
2. 구입한 SIM에서
 1) 바코드: 8982 3012 1700 0258 5489
 2) PUK(유심일련번호): 26864155  
======================================================================================================

- 유심(USIM) 요금제
1. The 착한 데이터 11GB(현대카드 월 70만원 사용시 월 요금 만 3천원),  LGU+ 요금제 신청: 1855-1140
http://direct.lghellovision.net/usim/usimView.do?pgNum=0201&reqPaymentCode=PDLB000041&reqTelecom=LGU&reqUstiType=LTE&reqDateName=00

- LG G8 ThinQ(U+LM-G820N)
1. 판매가: 0원, 2년 약정, The 착한 데이터 11GB(현대카드 월 70만원 사용시 월 요금 4만 5천원대)
http://direct.lghellovision.net/phone/detail.do?idx=327&pgNum=0101
======================================================================================================

- 슈퍼 베네노 RC(자동차 장난감: 수종) 구입
1. 이마트 구로점, 가격: 29,800원
http://www.enuri.com/detail.jsp?similar=Y&IsDeliverySum=N&cate=&modelno=40654223
https://blog.naver.com/realdata/221790693649
======================================================================================================
 
- 초등학생 교통카드 만들기 
1, GS25 티머니 교통 카드 구입(수종) ==> 카드: 2,500원, 충전: 10,000원
https://blog.naver.com/heoheoya/221478468240
https://blog.naver.com/envelope1218/221771341786
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 어린이날(공휴일), 체중: 73kg

- 어린이날[★]
07:00 기상
08:05 조식
08:30 실내 자전거 자전거 타기 ==> 뉴스 시청 
09:30 종료
08:50 종료 
10:30 집출발(자전거: 수종)
10:40 이마트 구로점 ==> 아이비전 X-SHOT 엑셀 클레이 타겟 샷건(장난감: 수종) 구입
11:00 다이소 구로 디지털 2호점 ==> 도어 고정쇠(말발굽), 내방에 설치) 구입, 리튬 이온 버튼 셀 2P/SET(체중계용) 구입
11:20 귀가
11:30 사격 놀이 ==> 수종이랑 장난감 총으로 사격 놀이 함
12:10 중식
12:30 실내 자전거 타기 ==> [228회] 역사저널 그날 시청[아나키스트, 그들의 독립운동] 
13:30 종료 
14:00 인터넷 서핑
17:40 집출발(자전거)
18:00 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 10,900원) 구입 
18:10 귀가
18:20 석식 
19:00 실내 자전거 타기 ==> [229회] 역사저널 그날 시청[유네스코 세계 문화유산, 서원] 
20:00 종료 
20:10 인터넷 서핑 
22:00 가계부 월말 결산
23:00 취침 
============================================================================================================== 
 
- 아이비전 X-SHOT 엑셀 클레이 타겟 샷건(장난감: 수종) 구입
1. 이마트 구로점, 가격: 27,800원
http://www.enuri.com/detail.jsp?modelno=38390140&cate=&IsDeliverySum=N
============================================================================================================== 
 
- VPN과 프록시의 원리 및 실전 사용법 예제 - [高지식] 거니
1. VPN(Virtual Private Network)은 인터넷망을 전용선처럼 사용할 수 있도록 특수 통신체계와 암호화기법을 제공하는 서비스로 기업 
본사와 지사 또는 지사 간에 전용망을 설치한 것과 같은 효과를 거둘 수 있으며, 기존 사설망의 고비용 부담을 해소하기 위해 사용
https://www.youtube.com/watch?v=hjRQzHeirw8
============================================================================================================== 

- 블루투스 동글이 연결 pc사용법
1. 다이소에서 TG 동글이 5천원, Bluetooth 4.0(Bluetooth 5.0: 최신)
https://blog.naver.com/snszmstktma/221827133775
============================================================================================================== 

- 유용한 컴퓨터 단축키들의 효능 및 실전 사용법 - [高지식]
1. DirectX 진단 도구 단축키: dxdiag
2. 윈도우 창 정렬
 1) 윈도우키 + 방향키 왼쪽 = 창 왼쪽으로 옮기면서 전체화면의 50%로 조정
 2) 윈도우키 + 방향키 우측 = 창 우측으로 올기면서 전체화면의 50% 영역으로 조정
3. 윈도우키 + Tab: 현재 작업하고 있는 모든 화면
https://www.youtube.com/watch?v=aEi_WVtfmnI
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 본사 출근(3, 4월 지출결의서 제출[출력, 744,060원 청구]), 중식(백반 정식[7천 원], 구종식 부장, 송금준 부장
									, 이석부 사장이 쏨), 하루 종일 왼쪽 허벅지에 통증 발생해서 도보에 불편(21시: 신신파스 붙임: 많이 좋아짐)

- 본사 복귀(지아이데이타)[★]
- 본사 노트북( GIDATA-LENO-0001: GIDATA 본사(LENOVO 노트북_0001)) 사용
1. 현대제철 재택근무 VPN 연결 불가
 1) HDsteel_BIGIPEdgeClient.exe 설치 --> 1521666 / asas1212!
============================================================================================================== 

- 건강보험공단 강남동부지사 방문(10:15)
1. 수일몰(http://sooilmall.com)에서 2020.04.09 구입한 물건 인정 안 해줌
 1) 처방전을 2020.04.11 받았기 때문에 그날 이후 구입한 물건만 인정 해줌
 ==> 수일몰 고객 상담팀에 전화(02-572-8864)해서 현금 영수증 오늘 날짜로 끊은 것을 택배로 받기로 함
    택배비 2,500원 송금[519725-01-010488, 국민은행, 예금주: 염윤희])
 2) 건강보험공단 강남동부지사(서울 강남구 테헤란로 328 6층)
=============================================================================================================

- 190412 당뇨병 소모성재료 청구하기[2019.04.12]
https://blog.naver.com/kns8901/221511890440
============================================================================================================== 
 
- 윈도우(Window) 7 정품인증 확인 방법 2020.04.17.
http://blog.daum.net/_blog/BlogTypeView.do?blogid=0S6v4&articleno=352&_bloghome_menu=recenttext
============================================================================================================== 
 
- 윈도우7 터치패드(touch pad) 끄는법(레노버 노트북)
1. Fn + F6
https://mudnji.tistory.com/620
============================================================================================================== 
   
- ex builder6 분석
1. nexacro로 유사한 HTML5 기반 툴:  ex builder6: http://www.exbuilder6.co.kr 
 1) 토마토 시스템 ==> https://techdom.tomatosystem.co.kr/p/00019/#topmenu, tamario@naver / 202*오*h@
============================================================================================================== 

- 오태범 이사에게 전화
1. 조만간 현대제철 안전Prj 재투입(1달 예상)
2. (주) 이노 액티브에 있는 현대제철 원격VPN을 이용하여 당진에 있는 내 노트북 eclipse 셋팅 수정 ==> 내일 (주) 이노 액티브 방문하여
   지원해줄 것 ==> (주)이노 액티브 본사에서 현대제철 VPN 연결이 안된다고 문자 옴(18시): 내일 본사 출근할 것
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 왼쪽 허벅지에 통증 거의 없음(어제 침대에서 취침), 중식(설렁탕: [7천 원], 구종식 부장, 오태범 이사
									, 이석부 사장이 쏨: 중식 전에 인슐린 펌프 밧데리 방전: 중식 전에 주입 못 함)

- 본사 복귀(지아이데이타)[★]
- 본사 노트북 사용
1. 현대제철 재택근무 VPN 연결 불가
 1) HDsteel_BIGIPEdgeClient.exe 설치 --> 1521666 / asas1212!
============================================================================================================== 

- [현대 제철] 안전관리 Prj 투입
1. 운영중인 XP Prj 추가 개발, 2주(05.11 ~ 5.29), 오이사가 다음주부터 출근하라고 함
===========================================================================================================

- 원격 데스크톱 연결 제어 프로그램으로 간단하게 해보자. 
1. chrome 원격 데스크톱
https://blog.naver.com/qbxlvnf11/221737130573
============================================================================================================== 
 
- 2019년 최신 컴퓨터 조립 강좌 풀버전
https://www.youtube.com/watch?v=HgqA8cS2GnU

- AMD FX8300 누드 테스트[씨디맨]
https://www.youtube.com/watch?v=0xYyLt6kSe8

- 컴퓨터 조립 동영상 인텔 카비레이크 #2 오픈테스트 주요부품 조립[씨디맨]
https://www.youtube.com/watch?v=LhwA5yaCVlA
===========================================================================================================

- LG 헬로모바일 알뜰폰 요금 약정 시작(2년 만기)
[헬로모바일]The 착한 데이터 10GB 월정액 60,390원
재약정시 30%할인요금 -18,117원, 월청구금액: 42,273원
==> 롯데 카드(제휴 카드) 월 70만원 사용시 2만원 할인, 월 30만원 사용시 만 7천원 할인
==> 전화(T: 114)로 처리함
===========================================================================================================

- 서울시 재난긴급생활비 신청방법 기준 조건 정리
 http://blog.naver.com/lightsout/221917582215
============================================================================================================== 
 
- 프로 야구 하이라이트 - KBO ==> 77. 야구Hi
https://www.koreabaseball.com/KboTv/Highlight/List.aspx
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2020.05.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 어버이날, 휴가, 밤부터 비

- 휴가
07:00 기상
07:13 조식
07:50 실내 자전거 자전거 타기 ==> [731회] 생로병사의 비밀 [걸음아 나 살려라 ‘10cm 더’ - 1편 기적의 걷기] 시청 
08:50 종료 
10:10 집출발(자전거)
10:40 건강보험공단 관악지사 방문(서울특별시 관악구 보라매로3길 23 대교 타워 13층 --> 보험급여1팀)
		==> 요양비지급청구서(당뇨병소모성재료) 작성(2020년 04월 2장): 접수 ==> 여직원이 당뇨병 환자 소모성 재료 처방전 문서에서
		처방 품목에 인슐린 펌프용 주사기, 인슐린 펌프용 주사 바늘이 없다고(이전 문서)라고 다시 발행한 내과에 가서 신규 문서로
		다시 출력해 오라고 함
11:00 참좋은 내과 방문: 줄 서서 진료 보라고 해서 열받음(처음 내가 방문할 때 인슐린 펌르용 처방전을 떼 달라고 분명히 이야기 했는데 
    잘못 발행했다고 짜증을 냄) --> 원장이 기존 문서에 처방 품목 볼펜으로 작성하고 도장 찍어 줌 ==> 다시는 참좋은 내과 가지 말 것
11:10 수선 가게(7부 바지 고무줄 작업 비용 6천원: 안 하기로 함)
11:45 건강보험공단 관악지사 재방문 ==> 요양비지급청구서(당뇨병소모성재료) 작성(2020년 04월 2장): 접수 ==> 완료
12:10 귀가
12:15 중식
12:30 실내 자전거 타 기 ==> [730회] 생로병사의 비밀 [바꿔야 산다 '습관혁명'] 시청
13:30 종료 
14:00 인터넷 서핑
17:00 집출발(자전거)
17:10 다이소 대림2호점 방문 ==> 방석 구입 
17:50 영웅 태권도(이충현 관장: 수종이 데리고 옴)
18:10 귀가
18:20 석식 
19:00 실내 자전거 타기 ==> [728회] 생로병사의 비밀 [당뇨와의 전쟁] 시청
20:00 종료 
20:10 인터넷 서핑  
20:55 포항 부모님과 화상통화(어버이날 용돈 30만원 송금): 수종
23:00 취침
============================================================================================================== 

 - 당뇨 소모품비 제출(10시, 건강보험공단)
1. 건강보험공단 관악지사 방문(서울특별시 관악구 보라매로3길 23 대교 타워 13층 --> 보험급여1팀)
==> 요양비지급청구서(당뇨병소모성재료) 작성(2020년 04월 2장): 접수 ==> 여직원이 당뇨병 환자 소모성 재료 처방전 문서에서
처방 품목에 인슐린 펌프용 주사기, 인슐린 펌프용 주사 바늘이 없다고(이전 문서)라고 다시 발행한 내과에 가서 신규 문서로
다시 출력해 오라고 함
2. 참좋은 내과 방문: 줄 서서 진료 보라고 해서 열받음(처음 내가 방문할 때 인슐린 펌르용 처방전을 떼 달라고 분명히 이야기 했는데 
    잘못 발행했다고 짜증을 냄) --> 원장이 기존 문서에 처방 품목 볼펜으로 작성하고 도장 찍어 줌 ==> 다시는  참좋은 내과 가지 말 것
3. 건강보험공단 관악지사 재방문 
==> 요양비지급청구서(당뇨병소모성재료) 작성(2020년 04월 2장): 접수 ==> 완료 @@@ 
============================================================================================================== 

- 당뇨 소모품비 구입 및 신청 방법
1. 내과에 방문하여 당뇨병 환자 소모성 재료 처방전 발급 받을 것
==> 처방 품목에 인슐린 펌프용 주사기, 인슐린 펌프용 주사 바늘 있는지 확인
2. 소모성 재료 구입
 1) 다나메티칼: 슈퍼라인-ST[바늘 길이: 6.5mm], 다나 3cc 주사기(다나 플러스, 다나 용) ==> 오프라인 또는 수일몰에서 구입
 2) 쌍봉 의료기: 스트립지(케어센스N 혈당지) ==> 카카오톡이용하여 송금, 택배로 물건 받기
3. 요양비지급청구서(당뇨병소모성재료_진태만).hwp 작성
 1) 이름과 사인만 할 것
4. 건강보험공단에 제출
 1) 당뇨 소모품비 신청 기간: 3년
============================================================================================================== 

- 서울시 재난긴급생활 신청(20시, 숙소)
1. 서울시 재난긴급생활비 신청방법 기준 조건 정리
 1) 3인 가족 기준: 2020년 3월 소득(세전: 420만원) 3,870,577원이 이하 여야 신청 가능 ==> 자격이 안됨
 https://blog.naver.com/worldbest85/221900954909
 http://blog.naver.com/lightsout/221917582215 
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2020.05.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 루옌 생일, 하루 종일 비

- 주말[★]
07:30 기상
08:10 조식
08:30 실내 자전거 타기 ==> [231회] 역사저널 그날[군국주의의 광기 - 731부대와 마루타] 시청, [드라마 1회] 김과장 시청
09:30 종료
10:00 인터넷 서핑 
12:10 중식 
12:30 실내 자전거 타기 ==> 드라마 [2회] 김과장 시청
13:30 종료 
14:00 인터넷 서핑  
13:30 루옌 친구들 집에 놀러감
16:00 루옌 친구들이랑 놀러감
17:20 귀가 
18:10 귀가
18:20 석식 
18:30 실내 자전거 타기 ==> 드라마 [3회] 김과장 시청
19:30 종료 
19:40 TV 시청
22:30 취침
==============================================================================================================

- 황현필 한국사
https://www.youtube.com/channel/UCRPRCmoQrbQ2qef7HpHz6GA/videos
==============================================================================================================
 
- [G마켓] 보아스몰 마카로니 대용량 강냉이, 05_맛강냉이 5kg(+4,400원), 가격: 19,320원
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=731236368&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

- 인터넷 펌방지 해제하기
1. Chrom(크롬)에서
 1) Shift + Ctrl + I ==> F1 ==> Preferences(새창) 
   ▶ Preferences -> Debugger -> Disable JavaScript: 체크 ==> 펌방지 해제
2. Microsoft Edge(엣지)에서
 1)  F12  ==> 요소 Tab ==> 복사하고자 하는 본문내용 클릭하면 문단단위로 선택되며 도구DOM탐색기 부분에  해당부분에 HTML
 형태로 나타나면 마우스 우클릭해서 복사하면됨 ==> https://blog.naver.com/khg8864/221792508625
==============================================================================================================

- 인터넷 펌방지 해제하기(크로미움에서)
1. 아래와 같이 크롬을 실행한후 우측 메뉴(점3개)를 누른후 [도구 더보기] - [확장 프로그램]에 들어갑니다. 
2. 확장 프로그램에 들어가면 이미 설치된 확장 프로그램(플러그인) 목록이 보입니다. 
새로운 확장프로그램을 설치하기 위해 좌측 하단의 "Chrome웹 스토어 열기"를 클릭합니다.  
3. 좌측 상단의 검색창에 "Drag free" 를 입력하여 검색합니다. 
그러면 우측에 커다란 검정색 아래방향 화살표 아이콘의 확장 프로그램이 보여집니다. 
우측의 "Chrome에 추가' 버튼을 클릭합니다.  
확장 프로그램 설치가 완료되면 우측 상단에 "화살표" 모양의 아이콘이 생성됩니다.  
이제부터는 마우스 드래그가 되지 않거나, 마우스 우클릭이 방지된 사이트에서 
간단하게 단축키인 "Alt+1" 를 입력. ==> Drag free가 피그툴박스(pig toolbox) 대체함
1) 출처: https://kmsds.tistory.com/188 [부자되세요] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말2[★]
07:30 기상
08:05 조식
08:30 실내 자전거 타기 ==> 드라마 [4회] 김과장 시청
09:30 종료 
12:10 집출발(도보, 루옌, 수종)
12:30 중식(김치찌게, 삼겹살, 햄[해남 식당]: 루옌, 수종)
13:00 귀가
13:10 다이소 대림2호점 방문 ==> 고급 테두리 정사각대 나무 마작 방석(5천원), 봉지집게 3P(2천원) 구입 
13:20 파리바게뜨 대림역 방문 ==> 러브러브 초코 케익(18.000원) 구입 
13:30 엘마트 방문 ==> 방석 구입 
13:40 귀가
14:45 실내 자전거 타기 ==> 드라마 [5회] 김과장 시청
15:00 루옌, 수종 보라매 공원에 놀러감
14:40 종료
14:00 인터넷 서핑 ==>  
15:50 갤럭시 S8 액정 보호 필름[LCD 보호필름, www.jhjh.kr] 붙이기 ==> 스틱으로 세게 밀면서 붙여서 스크래치 남 
17:00 석식
17:20 실내 자전거 타기 ==> 드라마 [7회] 김과장 시청 
18:20 종료
19:00 집출발
19:10 대림역(7호선) 도착(지하철[4-4] 탑승)
19:40 고속터미널역 도착 
19:50 서울 출발
21:00 당진터미널 도착
21:30 32-1번 버스 승차
22:00 동곡리 정류장 도착
22:10 귀가(현대 에비뉴 202호[숙소])
22:15 빨래
22:30 샤워
22:50 인슐린 약 교체(265U, 12U 남음)
23:30 취침
==============================================================================================================

- 크롬 새로고침
1. 크롬 강력 새로고침 단축키: Ctrl + Shift + R
2. 크롬 일반 새로고침 단축키: Ctrl + R(F5와 같은 기능)
http://blog.naver.com/PostView.nhn?blogId=withcar24&logNo=221155956289
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 현대제철 안전관리 Prj 투입, 현대제철 식당 식권 구입(10시, 20장 108,000원(장 당: 5,400원), 계좌 이체[농협])		
								  --> 영수증 못 받음(댜음날 가서 받아옴), 이창영 사원에서 모니터 반입증 받아서 책상에 보관함
								  
- 현대제철 Safety Keeper Prj[★]
1. 현대제철 유해화학물질 MAP 구축 Prj에 사용했든 삼성 노트북(DN119100022, sd*d12**!) 출입증 계속 사용
   ==> 자리 이동(안전관리 Prj 팀 김현규 부장 자리로 이동함)
==============================================================================================================

- HI-TAM4.0(HI Ware) 로그인 비번 변경
1. HI-TAM4.0(HI Ware) 로그인 ==> 1521666/a123456! --> asas1212!(pw 변경)
 1) 아이핀: tamario /hp수*!6**@, 2차, hp수*!6*1
 2) 전사종합시험관리(GQS_Tst) 개발 서버 ==> /u01/infra/webapps/ 
============================================================================================================== 

- 개발 소스 서버 반영 완료
1. Z:\4.구현\99. Nexacro\00. 개발 소스 서버 반영 요청\2020.05.11_0848_[완료_05.11_11.41]
2. 소스 서버 반영 담당자 변경 메일 보냄
 1) (주)지아이데이타 김태완 과장, 김영재 대리가 하게된다고 통보함
==============================================================================================================

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(13:30, 회의실)
1. 현업 담당자: 유태경 책임(기술 안전팀 1515030), 이선빈 주임(유양SNG, 1515030)
2. 수정 사항 협의 ==> 이선빈 주임이 상세하게 정리한 파일(.ppt)을 메일로 보내 준다고 함 
01. 위험기계기구 등록 및 사양 조회 ==> 관리번호 새로 생성(기존 시설번호에 번호 부여)
02. 부적합 LIST
03. 자율검사 현황
04. 자율검사 집계표
05. 특정 제조시설 ==> 가스용(참조)
3. 유태경 책임(기술 안전팀)과 5월 29일(금)까지 개발 완료하기로 잠정 합의함
 1) 유태경 책임이 다른 업무하지 말고 5월말에 무조건 끝내라고 요구함
4. 매일 14시에 회의: 이선빈 주임(유양SNG)과 합의
============================================================================================================== 

- 현대제철 Safety Keeper 소스 설치
1. 소스 위치: Workspace_gqms.zip ==> 김영재 대리 노트북 \\10.216.139.194, HDS/123
2. XPLATFORM9.1_SetupEngine 설치: XPLATFORM9.1_SetupEngine.exe 더블 클릭
============================================================================================================== 
 
- XPLATFORM 9.1 환결 설정
1. jdk1.7.0으로 설치: jdk-7u80-windows-x64.exe 더블 클릭 
 1) C:\Program Files\Java\jdk1.7.0_80 폴더를 복사하여 D:\GQMS_HS\java\jdk1.7.0_80에 붙여넣기
 2) D:\GQMS_HS\eclipse\eclipse.ini 파일에서 아래 설정
 --vm
D:\GQMS_HS\java\jdk1.7.0_80\bin\javaw.exe

2. .dll 파일 복사
 1) D:\GQMS_HS\Workspace_gqms\GQMS_HS\WebContent\xp\install\Component폴더에서 ExtCommon.dll, XExtAPI.dll
	, XPush.dll, XSQLite.dll, XWrapComp.dll 파일을 복사하여 C:\Windows\System32, C:\Windows\SysWOW64 폴더에 붙여넣기
	==> (주)지아이데이타 김태완 과장, 김영재 대리가 도와 줌
============================================================================================================== 

- DB 연결
<!-- 제철 운영DB(개발과 동일. 추후 수정?) -->
<Resource name="GQMS_PROD" auth="Container"
	  type="javax.sql.DataSource" driverClassName="oracle.jdbc.OracleDriver"
	  url="jdbc:oracle:thin:@10.216.133.53:1521:MASDB"
	  username="USRGQA" password="GQMSDB" maxActive="20" maxIdle="10"
	  maxWait="-1" />
username="USRSHA" password="shausrdb"  ==> 운영DB
username="USRSHD" password="shdusrdb" ==> 개발DB
============================================================================================================== 

- 개발, 운영 서버 소스 반영
1. (주)나린시스템 장민철 대리(SM)에게 요청할 것
============================================================================================================== 

- 현대제철 Safety Keeper 운영
 "C:\Program Files (x86)\TOBESOFT\XPLATFORM\9.1\XPlatform.exe"  -K 'biz_she_dev_HS'  -X 'http://gqms.hyundai-steel.com/xp/she.xadl'
 
- 현대제철 Safety Keeper 개발
"C:\Program Files (x86)\TOBESOFT\XPLATFORM\9.1\XPlatform.exe" -K 'biz_she_dev_HS'  -X 'http://gqmsdev.hyundai-steel.com/xp/she.xadl' 
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>

- 현대제철 Safety Keeper Prj[★]
- eclipse 실행 에러
1. 현상:
The specified Tomcat installation directory does not exist.
2. 원인: Tomcat 버전이 틀림
3. 조치: D:\GQMS_HS\WAS\apache-tomcat-6.0.26\apache-tomcat-6.0.26 폴더 생성
==============================================================================================================

- Safety Keeper 시작 에러
1. 현상: 
uxs (168424): application onerror : 404
uxs (168424): Error: URL (null) 을 로딩하는데 다음과같은 http 또는  socket 에러코드 404로 실패하였습니다.
2. 원인: /GQMS_HS ==> / 로 제거함
3. 조치: / ==> /GQMS_HS 로 원상 복귀 시킴
==============================================================================================================
 
- 현대제철 유해화학물질 MAP 구축 Prj 운영 서버 반영 확인
1. 회의(13)때 운영 서버에 있는 소스 UserDAO.class가 개발 서버 DB 연결이 되어 있어서 난리남
 ==> 내가 UserDAO.class 다시 빌드해서 운영 서버에 올림(김민평 부장이 고마워 함)
============================================================================================================== 

- JAVA 디컴파일러 설치
1. jd-gui.exe 설치
============================================================================================================== 
 
- Report Designer 5.0 설치
1. 출력 툴: Report Designer 5.0 설치
============================================================================================================== 

- 메뉴 설정 
SELECT AG.UI_ID, AG.ACL_INQ, AG.ACL_REG, AG.ACL_MOD, AG.ACL_DEL
FROM TB_GQ_CM_ACLGRPUIINFO AG		/* 권한그룹화면정보 TB */  
		, TB_GQ_CM_USERINFO US		/* 사용자정보 TB */  
WHERE US.EMP_NO     = '1521666'   -- 사번(1521666, 이선빈 주임: 1515030, 장민철 대리: 1417994)
AND US.ACL_GRP_CD = AG.ACL_GRP_CD 
;

SELECT AU.*
			FROM TB_GQ_CM_ACLUSERUIINFO AU		/* 권한사용자화면정보 TB */  
WHERE AU.EMP_NO = '1515030'  		-- 사번(1521666, 이선빈 주임: 1515030, 장민철 대리: 1417994)
;

-- 권한그룹코드 수정 @@@
UPDATE TB_GQ_CM_USERINFO US   		/* 사용자정보 TB */  
SET   US.ACL_GRP_CD  = 'PRIV_TEST'      -- 권한그룹코드(PAR_DJ, PRIV_TEST)
WHERE US.EMP_NO     = '1521666'    -- 사번(1521666, 이선빈 주임: 1515030, 장민철 대리: 1417994)
;

INSERT INTO TB_GQ_CM_ACLUSERUIINFO (EMP_NO,UI_ID,ACL_INQ,ACL_REG,ACL_MOD,ACL_DEL,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) 
	VALUES ('1521666','SAFC0200','Y','Y','Y','Y','서해은',TIMESTAMP '2018-10-02 10:47:51.000000',NULL,NULL);
INSERT INTO TB_GQ_CM_ACLUSERUIINFO (EMP_NO,UI_ID,ACL_INQ,ACL_REG,ACL_MOD,ACL_DEL,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) 
	VALUES ('1521666','SAFD0020','Y','Y','Y','Y','서해은',TIMESTAMP '2018-10-02 11:16:07.000000',NULL,NULL);
INSERT INTO TB_GQ_CM_ACLUSERUIINFO (EMP_NO,UI_ID,ACL_INQ,ACL_REG,ACL_MOD,ACL_DEL,REGISTER,REG_DDTT,MODIFIER,MOD_DDTT) 
	VALUES ('1521666','SAFE0010','Y','Y','Y','Y','서해은',TIMESTAMP '2018-10-02 11:16:07.000000',NULL,NULL);
;
============================================================================================================== 

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14: 내 자리)
1. 현업 담당자: 이선빈 주임(유양SNG, 1515030)
2. 개발 화면 설명(이선빈 주임)
01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl)
==> 9개 화면 생성
==> 이미지(팝업: 등록, 삭제) --> 안전점검 결과등록(/SMS9336M_P1.xfdl) 참조
==> 위험기계기구 등록(팝업) 화면 ==> 9개
==> 출력(Report Designer 5.0 설치) ==> 9개
============================================================================================================== 
 
-- 시설설비 조회  @@@ 
SELECT A.MGR_NO_N AS 관리번호(신규), A.MGR_NO AS 공관리번호(관리번호_구), A.ERP_CODE AS 구관리번호(관리번호)
			, A.*
FROM SMT_FCEQ_MSTR A	/* 시설설비 TB */
WHERE 1 = 1
   AND A.FCEQ_KIND_ID = '1'  	/* 설비종류번호 */ 
ORDER BY A.PRCS_ID ASC, A.MGR_NO DESC
;
--------------------------------------------------------------------------------------------------------------------------

-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD ( 
	MGR_NO_N VARCHAR2(25)		/* 관리번호(신규) */
)
;

COMMENT ON COLUMN SMT_FCEQ_MSTR.MGR_NO_N IS '관리번호';
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>

- 현대제철 Safety Keeper Prj[★] 
- 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 수정
1. 공단관리번호(MGR_NO_N) 새로 생성(기존 시설번호에 번호 부여)
/* 설비종류번호(1:산업안전용기[3,575건] 2:크레인[2,763건], 3:프레스[48건], 4:전단기[39건], 5:국소배기장치[15건]
			 , 6:원신기[0건], 7:화학설비[0건], 8:건조설비[0건], 9:리프트[1건]], 10:곤돌라[1건]
			 , 11:안전밸브[0건], 12:에너지압력용기[0건], 13:산업용로봇[1건], 14:컨베이어[1건] */
/* 설비종류번호(1:산업안전압력용기, 2:크레인, 3:프레스, 4:전단기, 5:국소배기장, 9:리프트, 10:곤돌라, 13:산업용로봇, 14:컨베이어 */ 
============================================================================================================== 
 
-- 시설설비 조회  @@@ 
SELECT A.MGR_NO_N AS 공단관리번호, A.MGR_NO AS 관리번호_구,  A.ERP_CODE AS 구관리번호
			, (SELECT CD_CNTS_K FROM TB_GQ_CM_CDITEM WHERE CD_ID='SP220' 
				AND CD_ITEM = (SELECT GRP_CD FROM TB_GQ_CM_CDITEM WHERE CD_ID='SP221' AND CD_ITEM=A.PRCS_ID)) AS 공장 
			, (SELECT CD_CNTS_K FROM TB_GQ_CM_CDITEM WHERE CD_ID='SP222' AND CD_ITEM = A.FCEQ_KIND_ID) AS 품목
			, A.LOCA_DSCR AS 설치장소
			, A.*
FROM SMT_FCEQ_MSTR A	/* 시설설비 TB */
WHERE 1 = 1
   AND A.FCEQ_KIND_ID = '3'  	/* 설비종류번호(1:산업안전압력용기, 2:전단기, 3:프레스, 4:전단기, 5:국소배기장치) */ 
   -- AND A.MGR_NO_N IS NOT NULL	/* 공단관리번호가 존재하는 것 */ 
ORDER BY A.MGR_NO -- ASC, A.MGR_NO DESC
-- ORDER BY A.PRCS_ID ASC, A.MGR_NO DESC
;   

-- 시설설비 정보 수정  @@@
UPDATE SMT_FCEQ_MSTR A /* 시설설비 TB */
SET A.MGR_NO_N = NULL /* 관리번호 널 처리 ==> TEST 후 복구 */ 
WHERE 1=1
	AND A.FCEQ_KIND_ID = 3	/* 설비종류번호 */
	AND A.MGR_NO_N IS NOT NULL /* 공단관리번호가 존재하는 것 **/
;  
-------------------------------------------------------------------------------------------------------------

/* 시설설비 정보 수정 ==> [/TK11001Mapper.xml] [updatePgm()] [2020.05.12, by 진태만] */
UPDATE SMT_FCEQ_MSTR A		/* 시설설비 TB */
SET A.MGR_NO_N = #{MGR_NO_New}		/* 공단관리번호 */   
		, A.UEMP_NAME = #{GET_EMPID}	/* 최종수정자 */   
		, A.UDEPT_NAME = SYSDATE			/* 최종수정일 */   
WHERE A.MGR_NO = #{MGR_NO}			/* 관리번호_구 */ 
	AND A.FCEQ_KIND_ID = #{FCEQ_KIND_ID}		/* 설비종류번호 */ 
	AND A.MGR_NO_N IS NULL		/* 관리번호가 존재지 않는 것 */  
; 
============================================================================================================== 

- Oracle SQL SQLDEVELOPER 설치
1. sqldeveloper-19.2.1.247.2212-x64 설치
============================================================================================================== 
  
- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14시, 회의실)
1. 개발 범위
 1) 엑셀 등록
 2) 집계표
 3) 결함 등록 
2. 기타
 1) 레프트(출력)는 SM이 작성한다고 함(최정호 대리 확인) 
==> Master 스케줄 제출(이번주까지 작성): 최정호 대리가 무조건 5월말까지 끝내라고 함(주말에 나와서 일하라고 함)
--> 오이사에게 보고함(열 받아 함): 5월 말에 무조건 철수 하라고 함
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 중식(복어국[흥부와], 박민형 PM님이 쏨, 안전관리Prj팀)

- 현대제철 Safety Keeper Prj[★] 
- 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 수정
1. Grid 생성: 설비종류번호(1:산업안전압력용기)
function form_onload(obj:Form, e:LoadEventInfo)
{
	trace("[/SP6111M.xfdl] [form_onload()] ==> [TEST_01]"); 
	
	// 종류 코드 조회
	fn_GetEshGbnCodes();
}

/****************************************************************
* 종류 콤보 서비스 호출
******************************************************************/
function fn_GetEshGbnCodes() {
	application.usewaitcursor = false;
	
	fsp_clear();	//초기화
	var args = "arg_esh_gbn="+cmb_eshGbn.value;
	fsp_addSearch("she/ep/ep002:ep002_S02", false);
	
	// 서버 호출 
	fsp_callService(""
		,""
		,"ds_cond2=ds_fceq_mstr_cond"	//inDs
		,"ds_fceq_type=ds_list2"	//outDs
		,args
		,"fn_fspCallback"
		,false
		,false
		,true
		,"esh_gbn_select");
}

function fn_fspCallback(ErrorCode, ErrorMsg, svrId) { 
	if(svrId == "SEARCH") {
        fn_draw();	// Grid 다시 그리기 함수 호출
	}	
}

function fn_draw() {
	trace("[/SP6111M.xfdl] [fn_draw()] ==> [TEST_01] [Grid 다시 그리기] [cmb_eshGbn.value]"+ cmb_eshGbn.value ); 
	
	var v_Formats = "";

	if(cmb_eshGbn.value == "1" || cmb_eshGbn.value == "12")  	// 설비종류번호(1:산업안전용기, 12:에너지압력용기) 
	{
		v_Formats = '        <Formats>\n';
		v_Formats += '          <Format id="default">\n';
		v_Formats += '            <Columns>\n';
		v_Formats += '              <Column size="40"/>\n';		// 1. No. 
		v_Formats += '              <Column size="120"/>\n';		// 사업장명
		v_Formats += '              <Column size="120"/>\n';		// 공단관리번호
		v_Formats += '            </Columns>\n';
		v_Formats += '            <Rows>\n';
		v_Formats += '              <Row size="24" band="head"/>\n';
		v_Formats += '              <Row size="45" band="head"/>\n';
		v_Formats += '              <Row size="31"/>\n';
		v_Formats += '            </Rows>\n';
		v_Formats += '            <Band id="head">\n';
		v_Formats += '              <Cell rowspan="2" text="No"/>\n';		// 1. No. 
		v_Formats += '              <Cell col="1" rowspan="2" text="사업장명"/>\n'; 	// 사업장명
		v_Formats += '              <Cell col="2" rowspan="2" text="공단관리번호"/>\n'; 	// 공단관리번호 칼럼 수정[변경일: 2020.05.13, by 진태만]
		v_Formats += '            </Band>\n';
		v_Formats += '            <Band id="body">\n';
		v_Formats += '              <Cell displaytype="text" expr="expr:currow + 1"/>\n'; 	// 1. No. 
		v_Formats += '              <Cell col="1" displaytype="text" text="bind:COMP_NAME" suppress="0" suppressalign="middle,over"/>\n';		// 사업장명
		v_Formats += '              <Cell col="2" displaytype="text" text="bind:MGR_NO_N" suppress="0" suppressalign="middle,over"/>\n';			// 공단관리번호 칼럼 
		v_Formats += '            </Band>\n';
		v_Formats += '          </Format>\n';
		v_Formats += '        </Formats>\n';
	}
}
 
<Grid id="grdList" taborder="1" useinputpanel="false" position="absolute 10 154 991 568" anchor="all" 
	binddataset="ds_fceq_mstr" onrbuttonup="grdList_onrbuttonup" oncelldblclick="grdList_oncelldblclick">
	<Formats/>
</Grid>
============================================================================================================== 

- 유해위험기계기구/가스설비 등록(팝업)(/SP6111M_D2_01.xfdl) 수정
1. 칼럼 추가
============================================================================================================== 

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14: 내 자리)
1. 현업 담당자: 이선빈 주임(유양SNG, 1515030) 외 1명
2. 주요 내용 
- 검사대상 Grid 추가(/SAFD0021.xfdl 화면) 요청
 1) 박민형 PM에게 보고: 일단 추가 요구 사항은 수용하기 어렵다고 함(개발 완료 후 논의 하자고 함)
- 관리번호 명칭 변경
1. 관리번호 ==> 신규
2. 구관리번호 ==> 공단관리번호 --> 공단관리번호(구관리번호)
3. 관리번호 ==> 구관리번호  --> 구관리번호(관리번호)
----------------------------------------------------------------------------------------------------- 

- 검사유효기간
1. 검사유효기간2  ===> 1년검사유효기간(검사유효기간1 기준) 수정 가능.
2. 검사일자(당일): 변경...검사유효기간1 같이 변경....  ==> 
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 비(하루 종일), 서울행(15:20 ~ 17:10):  박민형PM 차 얻어 탐(총 4명) --> 16:30 T석수역(1호선) 2번 출구
									--> 16:40 대림역 --> 21:00 귀가

- 현대제철 Safety Keeper Prj[★] 
- 유해위험기계기구/가스설비 등록(팝업)(/SP6111M_D2_01.xfdl) 수정 ==> 완료
1. 칼럼 추가, 데이타 수정 처리, 화면 조회
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD ( 
	INSP_DATE  VARCHAR2(10)		/* 검사일자 */
	, SPECVL_DT_FR VARCHAR2(10)	 /* 검사유효기간1 */
	, SPECVL_DT_TO VARCHAR2(10)	 /* 검사유효기간2 */
	, INSP_EMP_ID VARCHAR2(30)	 	/* 검사원 사번 */
	, INSP_EMP_NM VARCHAR2(30)	/* 검사원 */
	, NEW_YN VARCHAR2(1)			/* 신규 여부 */
	, GENJDGM VARCHAR2(1)			/* 종합판정 */
	, DEMOLISH_TRASH_REG VARCHAR2(2)	/* 철거/휴지/등록 */
	, SPEC_ITEM_N VARCHAR2(2)	/* 품목 */
	, SPEC_SORT VARCHAR2(1)		/* 종류 */
	, SPEC_SHAPE VARCHAR2(1)	/* 형태 */
	, SPEC_INDEX VARCHAR2(1)		/* 지수 */ 
 	, SPEC_ITEM61_NUM VARCHAR2(20)					/* 동체 측정두께 */
	, SPEC_ITEM61_TEXT_UNIT VARCHAR2(200)		/* 동체 측정두께_TXT */
	, SPEC_ITEM62_NUM VARCHAR2(20)					/* 경판 측정두께 */
	, SPEC_ITEM62_TEXT_UNIT VARCHAR2(200)		/* 경판 측정두께_TXT */
	, USE_EQUIP VARCHAR2(1)		/* 활용장비 */
);
 
COMMENT ON COLUMN SMT_FCEQ_MSTR.INSP_DATE IS '검사일자';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPECVL_DT_FR IS '검사유효기간1';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPECVL_DT_TO IS '검사유효기간2';
COMMENT ON COLUMN SMT_FCEQ_MSTR.INSP_EMP_ID IS '검사원';
COMMENT ON COLUMN SMT_FCEQ_MSTR.INSP_EMP_NM IS '검사원 사번';
COMMENT ON COLUMN SMT_FCEQ_MSTR.NEW_YN IS '신규 여부';
COMMENT ON COLUMN SMT_FCEQ_MSTR.GENJDGM IS '종합판정';
COMMENT ON COLUMN SMT_FCEQ_MSTR.DEMOLISH_TRASH_REG IS ' 철거/휴지/등록';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_ITEM_N IS '품목';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_SORT IS '종류';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_SHAPE IS '형태';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_INDEX IS '지수';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_ITEM61_NUM IS '동체 측정두께';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_ITEM61_TEXT_UNIT IS '동체 측정두께_TXT ';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_INDEX IS '지수';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_ITEM62_NUM IS '동체 측정두께';
COMMENT ON COLUMN SMT_FCEQ_MSTR.SPEC_ITEM62_TEXT_UNIT IS '동체 측정두께_TXT ';
COMMENT ON COLUMN SMT_FCEQ_MSTR.USE_EQUIP IS '활용장비';
============================================================================================================== 

- Master 스케줄 작성(13시)
1. 개발 범위
 1) 엑셀 등록
 2) 집계표
 3) 결함 등록 
2. 기타 
==> Master 스케줄 제출(이번주까지 작성): 최정호 대리에게 메일로 보낼 것
============================================================================================================== 

- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. Grid 수정: 설비종류번호(1:산업안전용기) ==> 완료 @@@
2. Grid 수정: 설비종류번호(3:프레스)
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>  일요 근무, 중식(부대찌게[노가네 부대찌게], 안전관리Prj팀, 장민철 대리(SM), 박민형 PM님이 쏨)
								  , Safety Keeper Prj 개발했든 개발자가 금, 토, 일 출근해서 통계, 이메일 수정 처리함
								  
- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
2. Grid 수정: 설비종류번호(3:프레스) ==> 완료 @@@
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD (   
	 SPEC_SORT_03 VARCHAR2(1)		/* 종류(3:프레스) */
	, SPEC_SPEC VARCHAR2(1)	/* 주요 구조부 규격 및 형식(3:프레스) */
	, SETUP_SPOT VARCHAR2(1)		/* 설치 위치(3:프레스) */ 
	, SPEC_ITEM63_NUM VARCHAR2(20)					/* 절연저항(3:프레스) */
	, SPEC_ITEM63_TEXT_UNIT VARCHAR2(200)		/* 절연저항_단위(㏁)(3:프레스) */
); 
==============================================================================================================
 
 - 검사유효기간2 재설정*1년 후 보다 하루 전으로 설정) 
/***************************************************************************
* Even   : fn_resetSpecvl_dt
* Desc   : 검사유효기간2 재설정 
****************************************************************************/
fn_resetSpecvl_dt = function()
{ 
	//trace("[/SP6111M_D2_04.xfdl] [fn_resetSpecvl_dt()] ==> [TEST_01] [검사유효기간2 재설정]" );
	 
	var cal_ReqDate1 = cal_specvl_dt_fr.value;	// 검사유효기간1
	//trace("[/SP6111M_D2_01.xfdl] [fn_resetSpecvl_dt()] ==> [TEST_02] [cal_ReqDate1]"+cal_ReqDate1 );  
 
	var sTodayNexYear = gfn_getLastMonth(cal_ReqDate1, 12);		// 오늘 보다 1년 후 
	var sTodayPrvDay = gfn_getDate(sTodayNexYear, -1);		//  1년 후 보다 하루 전
	//trace("[/SP6111M_D2_01.xfdl] [fn_resetSpecvl_dt()] ==> [TEST_53] [sTodayPrvDay]"+ sTodayPrvDay);  
 
	cal_specvl_dt_to.value = sTodayPrvDay;		// 검사유효기간2 
	trace("[/SP6111M_D2_04.xfdl] [fn_resetSpecvl_dt()] ==> [TEST_91] [검사유효기간1]"+ cal_specvl_dt_fr.value +"[검사유효기간2]"+ cal_specvl_dt_to.value );  
}; 
==============================================================================================================

- windows 에서 8080 port 사용하는 프로세스 kill 하기 
C:\Users\Administrator>netstat -a -o -n  
프로토콜 로컬 주소 외부 주소 상태 PID 
 TCP    0.0.0.0:8080           0.0.0.0:0              LISTENING       30780
  
C:\Users\Administrator>taskkill /F /PID 31724 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> Safety Keeper Prj 그랜드 오픈, (주)이노 액티브 직원들 출근 안 함(VPN으로 재택 근무), 오후에 비(17시, 퇴근할때 우산)

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. 위험기계기구 등록 INSERT 수정 ==> 완료 @@@
/* 기계기구 등록 ==> [/sp6111M_I01.xml] [insert()] [2020.05.14, by 진태만] */
INSERT INTO SMT_FCEQ_MSTR( 		/* 시설설비 TB */
	RLT_LAW 
	, MGR_NO_N 	/* 관리번호_신규 칼럼 추가[변경일: 2020.05.13, by 진태만] */
	, SPEC_ITEM63_NUM 		/* 절연저항(3:프레스) 추가[변경일:2020.05.17, by 진태만] */
	, SPEC_ITEM63_TEXT_UNIT	/* 절연저항_단위(㏁)(3:프레스) 추가[변경일:2020.05.17, by 진태만] */ 
) VALUES (
	#RLT_LAW#
	, #MGR_NO_N#			/* 관리번호_신규 추가[변경일:2020.05.15, by 진태만] */
	, #SPEC_ITEM63_NUM#	/* 절연저항(3:프레스) 추가[변경일:2020.05.17, by 진태만] */
	, #SPEC_ITEM63_TEXT_UNIT#	/* 절연저항_단위(3:프레스) 추가[변경일:2020.05.17, by 진태만] */
}
==============================================================================================================

- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. Grid 수정: 설비종류번호(4:전단기) ==> 04. 전단기 팝업 화면(/SP6111M_D2_05.xldl)   ==> 완료 @@@ 
==============================================================================================================
 
- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(15:40, 내자리)
1. 현업 담당자: 최정호 대리기술 안전팀 1515030), 이선빈 주임(유양SNG, 1515030)
2. 합의 사항 ==> 
 1) 이선빈 주임이 산업안전용기 팝업 화면(/SP6111M_D2_01.xldl)에서 검사대상 Grid를 추가하기를 요구
==> 내가 9개 폼을 합치라면 Script로 Grid를 재조합해야 하기 때문에 시간이 많이 필요하다고 주장함
--> 산업안전 압력용기 보고서 조회 화면(/SAFD0021.xldl) 에서 위험기계기구 검사항목.xlsx 기준으로 검사항목 정보 삽입(폼 9개) 하기로 합의 함
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 오전에 비(6시, 출근때 우산), (주)이노 액티브 직원들 철수(15시), 현대제철에서 안해준 프로그램 있다고 검수 
								거부 전화가 박민형 PM한테 왔다고 함(17시, PM 생각은 사소한 거 몇개 안 해줬다고 우긴다고 생각함)

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정  
1. Grid 수정: 설비종류번호(9:리프트) ==> 06. 리프트 팝업 화면(/SP6111M_D2_10.xldl) [9:리프트] ==> 완료 @@@
1. Grid 수정: 설비종류번호(10:곤돌라) ==> 07. 곤돌라 팝업 화면(/SP6111M_D2_11.xldl) [10:곤돌라] ==> 완료 @@@ 
==============================================================================================================

- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. Grid 수정: 설비종류번호(9:리프트) ==> 06. 리프트 팝업 화면(/SP6111M_D2_10.xldl) ==> 완료 @@@ 
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD (      
 	SPEC_SORT_09 VARCHAR2(1)		/* 종류(9:리프트) */ 
);  
==============================================================================================================

- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. Grid 수정: 설비종류번호(9:리프트) ==> 07. 곤돌라 팝업 화면(/SP6111M_D2_11.xldl) [10:곤돌라]  
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD (
 	SPEC_SORT_10 VARCHAR2(1)		/* 종류(10:곤돌라) */
	, SPEC_ITEM64_NUM VARCHAR2(20)					/* 접지저항(10:곤돌라) */
	, SPEC_ITEM64_TEXT_UNIT VARCHAR2(200)		/* 접지저항_단위(㏁)(10:곤돌라) */ 
);  
==============================================================================================================

- XPLATFORM9.1 폰트 변경
1. 함초롤 돋움 안됨 ==> Lucida Console로 변경 --> MS Gothic으로 다시 변경
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 루옌한테 전화 옴(9시, 은영이 엄마(언니) 2주간 수종방에서 숙박), 수종 선생님한테 문자옴(15시, 서류 작성
								  , 수종이 매일 체온 측정 후 결과 보내야 함)

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정   
1. Grid 수정: 설비종류번호([5:국소배기장치) ==> 05. 국소배기장치 팝업 화면(/SP6111M_D2_06.xldl) [5:국소배기장치] ==> 완료 @@@
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD (        
SPEC_SORT_03 VARCHAR2(1)		/* 종류(3:프레스) */
	, SPEC_SPEC VARCHAR2(1)	/* 주요 구조부 규격 및 형식(3:프레스) */
	SPEC_ITEM65_NUM VARCHAR(20)		/* 기준치(m/s)(5:국소배기장치) */ 
	, SPEC_ITEM65_TEXT_UNIT VARCHAR2(200)		/* 기준치_단위(5:국소배기장치) */ 
	, SPEC_ITEM66_NUM VARCHAR2(20)		/* 측정치(5:국소배기장치) */ 
	, SPEC_ITEM66_TEXT_UNIT VARCHAR2(200)		/* 측정치_단위(5:국소배기장치) */   
);   
==============================================================================================================

1. Grid 수정: 설비종류번호(14:컨베이어) ==> 컨베이어 팝업 화면(/SP6111M_D2_13.xldl) [14:컨베이어] ==> 완료 @@@
-- 칼럼 추가 @@@ 
ALTER TABLE SMT_FCEQ_MSTR ADD (         
	SPEC_ITEM67_NUM VARCHAR2(20)		/* 사용전압(14:컨베이어) */    
	, SPEC_ITEM68_NUM VARCHAR2(20)		/* 구동부 전동기 정격 출력 합(Kw)((14:컨베이어) */ 
);  
==============================================================================================================

1. Grid 수정: 설비종류번호(13:산업용로봇) ==> 산업용로봇 팝업 화면(/SP6111M_D2_12.xldl) [13:산업용로봇] ==> 완료 @@@
-- 칼럼 추가 @@@
ALTER TABLE SMT_FCEQ_MSTR ADD (         
	SPEC_ITEM69_NUM VARCHAR2(20)		/* 셀 위치(13:산업용로봇) */     
); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정    
1. Grid 수정: 설비종류번호(2:크레인) ==> 크레인 팝업 화면(/SP6111M_D2_02.xldl) [2:크레인] ==> 완료 @@@
-- 칼럼 추가 @@@ 
ALTER TABLE SMT_FCEQ_MSTR ADD (        
	SPEC_SORT_02 VARCHAR2(1)		/* 종류(2:크레인) */      
	, MANUFAC_WAY_02 VARCHAR2(1)		/* 조작방식(2:크레인) */      
	-- , SPEC_ITEM69_NUM VARCHAR2(20)				/* 주권 측정지름[와이어 로프](2:크레인) */    -- 중복 등록 @@@
	, SPEC_ITEM69_TEXT_UNIT VARCHAR2(200)		/* 주권 측정지름_단위(와이어 로프](2:크레인) */    
	, SPEC_ITEM70_NUM VARCHAR2(20)					/* 보권1 측정지름(와이어 로프](2:크레인) */    
	, SPEC_ITEM70_TEXT_UNIT VARCHAR2(20)		/* 보권1 측정지름_단위(와이어 로프](2:크레인) */    
	, SPEC_ITEM71_NUM VARCHAR2(20)					/* 보권2 측정지름(와이어 로프](2:크레인) */    
	, SPEC_ITEM71_TEXT_UNIT VARCHAR2(20)		/* 보권2 측정지름_단위(와이어 로프](2:크레인) */     
	, SPEC_ITEM72_NUM VARCHAR2(20)					/* 주권 측정지름[체인](2:크레인) */    
	, SPEC_ITEM72_TEXT_UNIT VARCHAR2(200)		/* 주권 측정지름_단위(체인](2:크레인) */    
	, SPEC_ITEM73_NUM VARCHAR2(20)					/* 보권 측정지름(체인](2:크레인) */    
	, SPEC_ITEM73_TEXT_UNIT VARCHAR2(200)		/* 보권 측정지름_단위(체인](2:크레인) */    
);  
==============================================================================================================
  
- 자율검사 집계표 화면(/SAFC0200.xldl) 분석
-- 가스점검 관리 정보 조회  @@@ 
SELECT   A.JDG_CD AS 판정코드  		/*  판정코드(01: 양호, 02: 불량) */
			, A.*     --  SELECT COUNT(*) AS 조회수
FROM TB_SAF_INSP010 A	/* 가스점검 관리 TB */  
; 
==============================================================================================================

- 빈 줄 제거(노트 패드 플러스[Notepad++ 에서)
1. 파일 열기 ==> T_01.txt(테스트 파일) ==> T_01.txt 파일에서 내용 선택(포커스 맞추기: 전체 선택 안 해도 됨)
2. 상단(Notepad++ 에서) ==> 편집(E) ==> 줄단위 편집 ==> 빈 줄 제거(공백 문자 포함)
==============================================================================================================
 
- Hyundai steelro(스틸로), 메신저 로그인 비밀번호 변경
1. 아이디(사번): 1521666, as**12*2! --> qw**12*2@ 
==============================================================================================================
 
- 삼성 노트북 암호(비밀번호) 변경
1. DN119100022, sd*d12**! --> qw**12*2@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 현대제철 안전관리 Prj 투입, 현대제철 식당 식권 구입(10시, 16장 86,400원(장 당: 5,400원), 계좌 이체[농협]) 
								, 현대제철 Safety Keeper Prj 2주 연기(오태범 이사와 박민형PM이 현업 담당자 만나서 잠정 합의 했다고 함)
									
- 현대제철 Safety Keeper Prj[★]
- 01. 산업안전 압력용기 보고서 조회 화면(/SAFD0021.xldl) 분석
- 09. 컨베이어 보고서 조회 화면(/SAFD0101.xldl) 분석 
==============================================================================================================

- 산업안전용기 팝업 화면(/SP6111M_D2_01.xldl) [1:압력용기] 수정
1. 필수항목(검사항목: 기존 존재) Ds 추가 ==> 완료 @@@  
==============================================================================================================
 
- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14:00, 내자리)
1. 현업 담당자: 이선빈 주임(유양SNG, 1515030)
2. 합의 사항 ==> 
 1) 유해위험기계기구/가스설비 등록 화면에서
1. 기존 정보(기존)
2. 제원(기존)
3. 검사이력(기존)
4. 검사대상(신규)
 1) 2020.1.16 개선보고서 ==> 1. 압력용기.xlsx 
5. 필수항목(검사항목: 기존 존재)
6. 도면/사진
 1) 설비종류번호(13:산업용로봇, 14:컨베이어) 일 경우만 사용)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 주말 근무, 김영재 대리 출근(10시, 프리랜서)
									
- 현대제철 Safety Keeper Prj[★]
- 산업안전용기 팝업 화면(/SP6111M_D2_01.xldl) [1:압력용기] 수정
3. 검사대상 Ds(ds_inspTrgtRst: 검사대상 결과 Ds) 추가
-- 칼럼 추가 @@@ 
ALTER TABLE TB_SAF_INSP030 ADD (        
	INSP_YN VARCHAR2(2)   /* 검사여부  */    
); 

-- 칼럼 추가 @@@ 
ALTER TABLE TB_SAF_INSP020 ADD (        
	INSP_YN VARCHAR2(2)   /* 검사여부  */    
); 
==============================================================================================================
 
- 에디터 플러스 v5.0 설치(사업장 노트북)
1. epp500p0777_0621.exe 파일 다운 받아서 설치(30일 평가판)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:25 ~ 21:00 ==> 주말 근무2, 출근시 비옴(06:20, 신발, 옷 다 젖음), 김영재 대리 출근(10시, 프리랜서)
									
- 현대제철 Safety Keeper Prj[★]
- 결함등록 팝업 화면(/SAFG0010.xldl)  
 1) 위험기계기구리스트.xlsx 파일 기준으로 부적합 입력: 폼(9개) 수정 
==============================================================================================================

/* 공통코드조회 ==> [/SAFG0010_S02.xml] [select()] [2020.05.24, by 진태만] */
SELECT  CD_ID, CD_ITEM, CD_CNTS_K 
FROM TB_GQ_CM_CDITEM
WHERE 1=1
	AND CD_ID   = 'GA204'		 /* 결함유형 */  --> 결함븐류(대분류): GA204, 결함븐류(소분류): 4개 칼럼 추가(GA480: ds_480)
	-- AND CRP_CD  = '03'
	-- AND CD_ITEM = '31'
	AND USE_YN  = 'Y'
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 발 뒤꿈치 상처(어제 비오는 날 양말 안 신고 신발 신어서 상처남: 15시에 현대제철 부속의원가서 바세린 받아옴)

- 현대제철 Safety Keeper Prj[★]
- 결함등록 팝업 화면(/SAFG0010.xldl)  
 1) 위험기계기구리스트.xlsx 파일 기준으로 부적합 입력: 폼(9개) 수정 
-- 칼럼 추가 @@@  ==?
ALTER TABLE TB_SAF_INSP050 ADD (        /* 결함 관리 TB */
	FLAW_CD_L VARCHAR2(2)   	/* 결함분류(대분류) */
	, FLAW_CD_S VARCHAR2(2)   	/* 결함분류d(소분류) */
	, FLAW_TP	VARCHAR2(2)		/* 결함형태  */
	, ACT_TMPN VARCHAR2(2)   		/* 조치시점  */
);  

-- 칼럼 추가 @@@ 
ALTER TABLE TB_SAF_INSP020 ADD (        /* 가스시설 점검결과 TB */
	INSP_YN 	VARCHAR2(1)   		/* 검사여부(사용 안함) */   -- APPL_FLAG: 적용구분: 사용 중
);  

-- 칼럼 추가 @@@ 
ALTER TABLE TB_SAF_INSP030 ADD (        /* 점검기준 관리 TB */
	INSP_YN 	VARCHAR2(1)   		/* 검사여부(사용 안함) */   -- APPL_FLAG: 적용구분: 사용 중
);  
-----------------------------------------------------------------------------------------------------------------------------

1. Check Box 처리 
function chk_type_01_onclick(obj:CheckBox,  e:ClickEventInfo)
{
	//trace("[/SAFG0010.xfdl] [chk_type_01_onclick()] ==> [TEST_01] [결함형태_01_체크박스 클릭 이벤트] " );  
	
	fn_chk_type(21); 
}

function fn_chk_type(sFirstRg)
{
	//trace("[/SAFG0010.xfdl] [fn_chk_type()] ==> [TEST_01] [sFirstRg]"+ sFirstRg +"[chk_type_01.value]"+ 
		chk_type_01.value +"chk_type_02.value]"+ chk_type_02.value +"[chk_type_03.value]"+ chk_type_03.value );  
 
	if(chk_type_01.value == "Y" && sFirstRg == 21)	// 결함형태_01이 체크 이면
	{
		chk_type_02.value = "N"; 	// 결함형태_02 
		chk_type_03.value = "N"; 	// 결함형태_03  
	}
	if(chk_type_02.value == "Y" && sFirstRg == 22)	// 결함형태_02이 체크 이면
	{
		chk_type_01.value = "N"; 	// 결함형태_02 
		chk_type_03.value = "N"; 	// 결함형태_03  
	}
	if(chk_type_03.value == "Y" && sFirstRg == 23)	// 결함형태_02이 체크 이면
	{
		chk_type_01.value = "N"; 	// 결함형태_02 
		chk_type_02.value = "N"; 	// 결함형태_03 
	} 
}
==============================================================================================================

- 산업안전용기 팝업 화면(/SP6111M_D2_01.xldl) [1:압력용기] 수정
1. 검사대상 Ds(ds_inspTrgtRst: 검사대상 결과 Ds) 수정
1. 여러 Check Box를 하나만 체크하게 처리(Grid에서)	
function grdInspTrgt_oncellclick(obj:Grid, e:GridClickEventInfo)
{
	trace("[/SP6111M_D2_01.xfdl] [grdInspTrgt_oncellclick()] ==> [TEST_01] [검사대상 Grid 클릭 이벤트] [e.row]"+ e.row +"[e.col]"+ e.col 
		+"[INSP_YN_Y_01]"+ ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_01") +"[INSP_YN_N_01]"+ ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_01"));  
 
	if(e.col == 2) 	// 검사여부_Y_01 이면
	{
		var sINSP_YN_Y_01 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_01");	// 검사여부_Y_01
		var sINSP_YN_Y_02 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_02"); 	// 검사여부_Y_02
	} 
	if(e.col == 3) 	// 검사여부_N_01 이면
	{
		var sINSP_YN_N_01 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_01");	// 검사여부_N_01
		var sINSP_YN_N_02 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_02"); 	// 검사여부_N_02
	}
	 
	if(sINSP_YN_Y_01 == 1)	// 검사여부_Y_01를 클릭했으면
	(
		ds_inspTrgtRst.setColumn(e.row, "INSP_YN_N_01", 0);			// 검사여부_N_01 체크박스를 널처리
	}
	if(sINSP_YN_Y_02 == 1)	// 검사여부_Y_02를 클릭했으면
	(
		ds_inspTrgtRst.setColumn(e.row, "INSP_YN_N_02", 0);			// 검사여부_N_02 체크박스를 널처리
	} 
 }
==============================================================================================================

- 여러 Check Box 하나만 체크하게 처리
1. 2개의 Check Box를 하나만 체크하게 처리(Grid에서)	
function grdInspTrgt_oncellclick(obj:Grid, e:GridClickEventInfo)
{
	trace("[/SP6111M_D2_01.xfdl] [grdInspTrgt_oncellclick()] ==> [TEST_01] [검사대상 Grid 클릭 이벤트] [e.row]"+ e.row +"[e.col]"+ e.col 
		+"[INSP_YN_Y_01]"+ ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_01") +"[INSP_YN_N_01]"+ ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_01"));  
 
	if(e.col == 2) 	// 검사여부_Y_01 이면
	{
		var sINSP_YN_Y_01 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_01");	// 검사여부_Y_01
		var sINSP_YN_Y_02 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_Y_02"); 	// 검사여부_Y_02
	} 
	if(e.col == 3) 	// 검사여부_N_01 이면
	{
		var sINSP_YN_N_01 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_01");	// 검사여부_N_01
		var sINSP_YN_N_02 = ds_inspTrgtRst.getColumn(e.row, "INSP_YN_N_02"); 	// 검사여부_N_02
	}
	 
	if(sINSP_YN_Y_01 == 1)	// 검사여부_Y_01를 클릭했으면
	(
		ds_inspTrgtRst.setColumn(e.row, "INSP_YN_N_01", 0);			// 검사여부_N_01 체크박스를 널처리
	}
	if(sINSP_YN_Y_02 == 1)	// 검사여부_Y_02를 클릭했으면
	(
		ds_inspTrgtRst.setColumn(e.row, "INSP_YN_N_02", 0);			// 검사여부_N_02 체크박스를 널처리
	} 
 }
==============================================================================================================

- 세로 Ds을 가로로 나열하기
/***************************************************************************
 * Even   : fn_searchInspItem
 * Desc   :  필수항목(검사항목) 조회
 ****************************************************************************/ 
function fn_searchInspItem()
{ 
	trace("[/SP6111_D2_01.xfdl] [fn_searchInspItem()] ==> [TEST_01] [필수항목(검사항목) 조회]" );
		
	var inDs = "";
	var outDs = "ds_base=ds_base ds_list=ds_InspItem";   // ds_InspItem
	var args = ""; 
	var isErrorNotCall = false;
	var isNotShow = false;
	var isSync = true;
	var svrId = "searchInspItem";
 
	args	+=	"FCEQ_MSTR_ID="		+ P_FCEQ_MSTR_ID;	// 설비번호ID
	args	+=	" GAS_GR_TP="		+ wrapQuote(lv_gasGrTp);	// 가스 대구분
	args	+=	" GAS_MD_TP="		+ wrapQuote(lv_gasMdTp); 	// 가스 중구분
	trace("[/SP6111_D2_01.xfdl] [fn_searchInspItem()] ==> [TEST_03] [args]"+ args );
	
	fsp_addSearch("she/gas/safd:SAFD0021_S01", true); 
	fsp_addSearch("she/gas/safd:SAFD0021_S02", false);	// 산업안전 압력용기 보고서 점검목록 조회[필수항목(검사항목) 조회]
 
	// 서버 호출 
	fsp_callService(""
	               ,""
	               ,inDs
	               ,outDs
	               ,args
	               ,"fn_fspCallback"
	               ,isErrorNotCall
	               ,isNotShow
	               ,isSync
	               ,svrId);
}
 
/***************************************************************************
 * Even   : fn_fspCallback
 * Desc   : 콜백 처리
 ****************************************************************************/  
function fn_fspCallback(ErrorCode, ErrorMsg, svrId) {
	trace("[/SP6111M_D2_01.xfdl] [fn_fspCallback()] ==> [콜백] [TEST_01] [svrId]"+ svrId +"[ErrorCode]"+ ErrorCode +"[ErrorMsg]"+ ErrorMsg); 
 
	if(svrId == "searchInspItem")		// 필수항목(검사항목) 조회 성공이면 
	{  
		fn_resetInspTrgtRstDs();   // 검사대상 결과 Ds 재정열 추가[변경일: 2020.05.25, by 진태만] 
	}
 }

/***************************************************************************
 * Even   : fn_resetInspTrgtRstDs
 * Desc   : 사대상 결과 Ds 재정열(조회할 때)
 ****************************************************************************/  
function fn_resetInspTrgtRstDs()
{ 
	trace("[/SP6111M_D2_01.xfdl] [fn_resetInspTrgtRstDs()] ==> [TEST_01] [검사대상 결과 Ds 재정열(조회할 때)]");	
	
	for(var i = 0; i < ds_list.rowcount-1; i++) 
	{	 
		var sInum = "0"+ (i+1);   
		if(i> 8) sInum = ""+ (i+1);
		
		trace("[/SP6111M_D2_01.xfdl] [fn_resetInspTrgtRstDs()] ==> [TEST_51] [i_번째]"+ i +"[sInum]"+ sInum +"[ds_list.APPL_FLAG]"+ 
		ds_list.getColumn(i, "APPL_FLAG") );
		
		var nRow = ds_inspTrgtRst.addRow();
		
		ds_inspTrgtRst.setColumn(0, "ESH_LAW_CD_"+ sInum, ds_list.getColumn(i, "ESH_LAW_CD"));	// 1. 조항_01
		ds_inspTrgtRst.setColumn(0, "INSP_TP_"+ sInum, ds_list.getColumn(i, "INSP_TP"));		// 2. 검사항목_01 
		
		if(ds_list.getColumn(i, "APPL_FLAG") == "1" || ds_list.getColumn(i, "APPL_FLAG") == "Y")	// 검사여부_적용(적용구분)_01 체크가 되었으면
		{  
			ds_inspTrgtRst.setColumn(0, "INSP_YN_Y_"+ sInum, "1");		// 3. 검사여부_적용_Y_01  ==> Ds을 가로로 나열 @@@@
			ds_inspTrgtRst.setColumn(0, "INSP_YN_N_"+ sInum, "0");		// 3. 검사여부_적용_N_01
		} 
		else
		{
			ds_inspTrgtRst.setColumn(0, "INSP_YN_Y_"+ sInum, "0");		// 3. 검사여부_적용_Y_01
			ds_inspTrgtRst.setColumn(0, "INSP_YN_N_"+ sInum, "0");		// 3. 검사여부_적용_N_01  
		}  
	} 	// end of for() 
	trace("[/SP6111M_D2_01.xfdl] [fn_resetInspTrgtRstDs()] ==> [TEST_92] [검사대상 결과 Ds_조회수]"+ ds_inspTrgtRst.rowcount 
	+"[ds_inspTrgtRst.saveXML()]"+ ds_inspTrgtRst.saveXML() ); 
}

<Dataset id="ds_inspTrgtRst" firefirstcount="0" firenextcount="0" useclientlayout="false" updatecontrol="true" enableevent="true" 
loadkeymode="keep" loadfiltermode="keep" reversesubsum="false">
<!--// 검사대상 결과 Ds 추가[공통_03] 추가[변경일:2020.05.14, by 진태만] //-->
<ColumnInfo> 
	<Column id="ESH_LAW_CD_01" type="STRING" size="256"/>	<!--// 1. 조항_01 @@@  //-->
	<Column id="INSP_TP_01" type="STRING" size="256"/>	<!--// 2. 검사항목_01 //-->
	<Column id="INSP_YN_Y_01" type="STRING" size="256"/>	<!--// 3. 검사여부_적용_01 //-->
	<Column id="INSP_YN_N_01" type="STRING" size="256"/>	<!--// 3. 검사여부_적용_01 //-->
	<Column id="ESH_LAW_CD_02" type="STRING" size="256"/>	<!--// 1. 조항_02 @@@  //-->
	<Column id="INSP_TP_02" type="STRING" size="256"/>	<!--// 2. 검사항목_02 //-->
	<Column id="INSP_YN_Y_02" type="STRING" size="256"/>	<!--// 3. 검사여부_적용_02 //-->
	<Column id="INSP_YN_N_02" type="STRING" size="256"/>	<!--// 3. 검사여부_적용_02 //--> 
</ColumnInfo>
</Dataset>
==============================================================================================================

- 가로Ds을 세로로 나열하기
/***************************************************************************
 * Even   : fn_resetInspItemDs
 * Desc   : 필수항목 Ds 재정열(저장할 때)
 ****************************************************************************/  
function fn_resetInspItemDs()
{
	trace("[/SP6111M_D2_01.xfdl] [fn_resetInspItemDs()] ==> [TEST_01] [필수항목 Ds 재정열(저장할 때)]"); 
	
	for(var i = 0; i < ds_list.rowcount; i++) 
	{		 		
		var sInum = "0"+ (i+1); 
		if(i> 8) sInum = ""+ (i+1);  
		trace("[/SP6111M_D2_01.xfdl] [fn_resetInspItemDs()] ==> [TEST_41] [i_번째]"+ i +"[sInum]"+ sInum +"[조항]"+ 
			ds_list.getColumn(i, "ESH_LAW_CD") +"[조항_2]"+ ds_inspTrgtRst.getColumn(0, "ESH_LAW_CD_"+ sInum) 
			+"[검사항목]"+ ds_list.getColumn(i, "INSP_TP")    
	 
		if(ds_list.getColumn(i, "ESH_LAW_CD") == ds_inspTrgtRst.getColumn(0, "ESH_LAW_CD_"+ sInum))		// 조항이 같으면 
		{  1
			if(ds_inspTrgtRst.getColumn(0, "INSP_YN_Y_"+ sInum) == 1)		//조항이 1 이면(체크)
			{   
				ds_list.setColumn(i, "APPL_FLAG", "1");		// 3. 검사여부_적용(적용구분)
			} 
			else
			{ 
				ds_list.setColumn(i, "APPL_FLAG", "0");		// 3. 검사여부_적용(적용구분)
			} 
		}
	} 	// end of for() 
	trace("[/SP6111M_D2_01.xfdl] [fn_resetInspItemDs()] ==> [TEST_92] [필수항목과 Ds_조회수]"+ ds_list.rowcount 
	+"[ds_list.saveXML()]"+ ds_list.saveXML() ); 
}
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>  

- 현대제철 Safety Keeper Prj[★]
- 결함등록 팝업 화면(/SAFG0010.xldl)  
1) 결함분류(소분류) Ds 추가
-- 칼럼 추가 @@@ 
ALTER TABLE TB_SAF_INSP050 ADD (        /* 결함 관리 TB */
	FLAW_CD_L VARCHAR2(2)   		/* 결함분류(대분류) */
	, FLAW_CD_S VARCHAR2(2)   		/* 결함분류(소분류) */
);   
==============================================================================================================

- XPLATFORM9.1 폰트 변경
1. MS Gothic ==> > Lucida Sans Typewriter로 다시 변경(최종 변경: 그나마 볼만 함 --> 함초롬 돋움이 최고)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.05.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:30 ==> 박민형 PM 현대제철 기술팀장 만남(10시, 계속 검수 거부한다고 함)

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
1. 결함등록시 팝업 에러 수정
2. 01. 산업안전용기 팝업 화면(/SP6111M_D2_01.xldl) [1:압력용기] 공통 적용 ==> 완료 @@@ 
06. 리프트 팝업 화면(/SP6111M_D2_10.xldl) [9:리프트] 공통 적용 ==> 완료 @@@  
-- 칼럼 추가 @@@ 
ALTER TABLE SMT_FCEQ_MSTR ADD (       
	TREAT_MATTER VARCHAR2(2)   		/*  취급물질(5:국소배기장치)  */ 
);  
==============================================================================================================

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14시, 내자리)
1. 현업 담당자: 유태경 책임(기술 안전팀 1515030)
2. 개발 진행 상황 확인( 위험기계기구 등록 화면 2개 완성
==> 내일까지 개발 완료
3. 05.29(금) 14시에 회의할 때 시연하기로 함
============================================================================================================== 

- script 종료 처리
/* ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// script 종료 //---------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ */

<!--// ■■■■■■■■■■■■■■ // Dataset 시작 // ■■■■■■■■■■■■■■■■■■ //-->
<Dataset id="ds_combo" firefirstcount="0" firenextcount="0" useclientlayout="false" updatecontrol="true" enableevent="true"
 loadkeymode="keep" loadfiltermode="keep" reversesubsum="false">
<!--// 공통 콤보 Ds 추가[공통코드 조회_00] [변경일:2020.05.14, by 진태만] @@@@@ ■■■ //-->
	<ColumnInfo>
		<Column id="CD_KND" type="STRING" size="256"/>
		<Column id="DS_NM" type="STRING" size="256"/>
		<Column id="CODENM" type="STRING" size="256"/>
		<Column id="ALLGB" type="STRING" size="256"/>
	<Row>
		<Col id="ALLGB">선택</Col>
		<Col id="CD_KND">SP259</Col>
		<Col id="DS_NM">ds_259</Col>
	</Row>
	<Row>
		<Col id="ALLGB">선택</Col>
		<Col id="CD_KND">SP260</Col>
		<Col id="DS_NM">ds_260</Col>
	</Row>
	</Rows>
</Dataset>
<!--// ■■■■■■■■■■■■■■ // Dataset 종료 // ■■■■■■■■■■■■■■■■■■ //-->
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2020.05.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 박민형 PM 현대제철 기술팀장과 관련 부서장 회의(16시, ?까지  검수 거부했다고 함), Safety Keeper Prj팀 회식(18시
								, 나는 내일 개발 완료 때문에 불참함), 사무실 에러컨 정상 가동(내가 약간 손 봄)

- 현대제철 Safety Keeper Prj[★]
- 01. 위험기계기구 등록 및 사양 조회(/SP6111M.xfdl) 화면 수정
05. 국소배기장치 팝업 화면(/SP6111M_D2_06.xldl) [5:국소배기장치] ==> 완료 @@@
07. 곤돌라 팝업 화면(/SP6111M_D2_11.xldl) [10:곤돌라] ==> 완료 @@@
 1) 검사대상 Grid(grdInspTrgt) 30형으로 변경(총 28건)
08. 산업용로봇 팝업 화면(/SP6111M_D2_12.xldl) [13:산업용로봇] ==> 완료 @@@
 1) 검사대상 Grid(grdInspTrgt) 45형으로 변경(총 33건)
 2) 도면/사진 Grid 추가 
09. 컨베이어 팝업 화면(/SP6111M_D2_13.xldl) [14:컨베이어] ==> 완료 @@@
 1) 검사대상 Grid(grdInspTrgt) 45형으로 변경(총 35건)
 2) 도면/사진 Grid 추가   
02. 크레인 팝업 화면(/SP6111M_D2_02.xldl) [2:크레인] ==> 완료 @@@
 1) 지브크레인: 검사대상 Grid(grdInspTrgt) 60형으로 변경(총 46건)
 2) 크레인/호이스트(D): 검사대상 Grid(grdInspTrgt) 60형으로 변경(총 47건) 
03. 프레스 팝업 화면(/SP6111M_D2_04.xldl) [3:프레스] ==> 완료 @@@
  1) 검사대상 Grid(grdInspTrgt) 30형으로 변경(총 23건) 
04. 전단기 팝업 화면(/SP6111M_D2_05.xldl) [4:전단기,스] ==> 완료 @@@
  1) 검사대상 Grid(grdInspTrgt) 30형으로 변경(총 23건)  
==============================================================================================================

- 파일 업로드 안됨
1. 로컬, 개발 서버에서 에러가 남
 /* 결함 정보 신규등록 ==> [/SAFG0010_U01.xml] [insert()] [2020.05.22, by 진태만] */
UPDATE  TB_SAF_INSP050  		/* 결함 관리 TB */
SET UPDATE_USER_ID   = '1521666'
      , UPDATE_PROGRAM_ID= 'SAFG0010'
      , UPDATE_TIME      = SYSDATE 
      , ACT_DATE         = '20200524'
      , ATTACH_FILE_CNTS1= java.io.ByteArrayInputStream@4c07acb1    ---. ATTACH_FILE_CNTS1 필드 데이타 타입이 BLOB 저장
      , ATTACH_FILE_NM1  = '00_1. NM_TEST.jpg' 
      , FLAW_CD_L  = '01' 		/* 결함분류(대분류) 추가[변경일: 2020.05.24, by 진태만] */ 
      , FLAW_CD_S  = '3' 		/* 결함분류(소분류) 추가[변경일: 2020.05.24, by 진태만] */ 
  	  , FLAW_TP  = '03' 		/* 결함형태 칼럼 추가[변경일: 2020.05.24, by 진태만] */
  	  , ACT_TMPN  = '04' 		/* 조치시점 추가[변경일: 2020.05.24, by 진태만] */ 
WHERE 1=1
	AND INSP_ID = '10444815'		/* 점검ID */
	AND INSP_CD = NVL('A00001', INSP_CD)	/* 검사코드 */
;
에러 내용: java.sql.SQLException: ORA-01460: 요구된 변환은 실행될 수 없습니다
==============================================================================================================

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(13:00, 회의실)
1. 현업 담당자: 이선빈 주임(유양SNG, 14:00)
2. 크레인, 프레스/전단기 관련 협의 ==> 프레스/전단기는 기존대로 가기로 함 
 02. 크레인 팝업 화면(/SP6111M_D2_02.xldl) [2:크레인] ==> 완료 @@@
 1) 지브크레인: 검사대상 Grid(grdInspTrgt) 60형으로 변경(총 46건)
 2) 크레인/호이스트: 검사대상 Grid(grdInspTrgt) 60형으로 변경(총 47건) 
 03. 프레스 팝업 화면(/SP6111M_D2_04.xldl) [3:프레스] ==> 완료 @@@
  1) 검사대상 Grid(grdInspTrgt) 30형으로 변경(총 23건) 
04. 전단기 팝업 화면(/SP6111M_D2_05.xldl) [4:전단기,스] ==> 완료 @@@
  1) 검사대상 Grid(grdInspTrgt) 30형으로 변경(총 23건)   
============================================================================================================== 

- 콤보박스에 널이면 체크박스 해제 처리(Grid에서)
1. displaytype ==> expr:INSP_YN_N_47 ==null || INSP_YN_N_47=='' ? '': 'checkbox'
2. edittype ==> expr:INSP_YN_N_47 ==null || INSP_YN_N_47=='' ? '': 'checkbox'  
============================================================================================================== 

- 콤보 조회 에러
1. 에러 내용: Duplicate name: ds_InspItem
2. 조치: fsp_clear();	//초기화 ==> 사용할 것
/***************************************************************************
 * Even   : fn_searchInspItem
 * Desc   : 필수항목(검사항목) 조회
 ****************************************************************************/ 
function fn_searchInspItem()
{  
	fsp_clear();	// fsp 초기화
	var inDs = "";
	var outDs = "ds_base=ds_base ds_list=ds_InspItem"; 
	var args = ""; 
	var isErrorNotCall = false;
	var isNotShow = false;
	var isSync = true;
	var svrId = "searchInspItem";
 
	args	+=	"FCEQ_MSTR_ID="		+ P_FCEQ_MSTR_ID;	// 설비번호ID
	args	+=	" GAS_GR_TP="		+ wrapQuote(lv_gasGrTp);	// 가스 대구분
	args	+=	" GAS_MD_TP="		+ wrapQuote(lv_gasMdTp); 	// 가스 중구분
	trace("[/SP6111_D2_01.xfdl] [fn_searchInspItem()] ==> [TEST_03] [args]"+ args );
	
	fsp_addSearch("she/gas/safd:SAFD0021_S01", true); 
	fsp_addSearch("she/gas/safd:SAFD0021_S02", false);	// 산업안전 압력용기 보고서 점검목록 조회[필수항목(검사항목) 조회]
 
	// 서버 호출 
	//fsp_callService(""   // TEST @@@ ===>
	fsp_callServiceWC(""   // 로딩 바 호출
	               ,""
	               ,inDs
	               ,outDs
	               ,args
	               ,"fn_fspCallback"
	               ,isErrorNotCall
	               ,isNotShow
	               ,isSync
	               ,svrId);
}
============================================================================================================== 
   
■■■■■■■■■■■■■■■■■■ 2020.05.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00 ==> 박민형PM 공식적으로 철수(18시, Safety Keeper Prj 현업이 1달 무료로 재계약 제안)
								, 박민형PM 차 얻어 탐(총 4명) --> 20:00 석수역(1호선) 2번 출구 --> 20:20 대림역(7호선) --> 20:30 귀가

- 현대제철 Safety Keeper Prj[★]
- 시연 준비관련 소스 수정
==============================================================================================================

- 결함등록 팝업 화면(/SAFG0010.xldl)  
1. 기존 확인일자 -> 검사일자(INSP_DATE) / 조치일자(ACT_DATE)로 수정
=============================================================================================================식

- 유해위험기계기구 키퍼 개선 관련 개발 관련 회의(14:00, 회의실)
1. 현업 담당자: 유태경 책임(기술 안전팀 1515030), 이선빈 주임(유양SNG, 1515030), 김도련, 박민형PM
2. 개발 완료 건 시연
 1) 신규 등록에서 에러가 발생 ==> A.MGR_NO_N(관리번호_신규) 번호 발생: 공장 + 품목 + 마지막 번호
3. 다음주 월요일 14시에 다시 시연 하기로 함
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.05.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
07:30 기상
08:00 조식
08:30 실내 자전거 타기  
09:30 종료
10:00 인터넷 서핑  
12:00 중식
12:30 실내 자전거 타기  
13:15 종료 
12:20 인터넷 서핑 
14:00 낮잠
13:30 루옌 놀러감
16:10  기상
17:00 집출발(자전거:수종)
17:20 모닝 아트(대동초 앞 문구점): 물총 장난감(수종, 만원): 롯데카드 긴급 재난 지원금 처음 사용
17:40 소금 창고(남구로시장): 여름용 와이셔츠(하늘색, 25, 800원), 일반 와이셔츠(푸른 줄색, 만 9천원) ==> 41,600원(4천원 할인)
17:50 치킨(오순살 참치 치킨[14,900원: 수종이가 아무 싫어함], 맛닭꼬 남구로점[02-866-2292], 포장): 롯데카드 긴급 재난 지원금 사용
19:30 귀가
18:10 석식
18:30 실내 자전거 타기
19:30 종료
19:40 인터넷 서핑
21:00 5가계부 월말 결산
21:10 샤워 ==> 체중: 73.6kg
21:36 인슐린 약 교체(280U, 28U 남음)
21:50 루옌 귀가
22:00 취침
==============================================================================================================

- loading 바 수정(Nexacro에서)
1. /environment.xml 파일에서
<Environment themeid="theme::default" onerror="Environment_onerror" httptimeout="600" httpretry="3"
loadingimage="url('theme://images/loading_img2.gif')"> ==> img_loading02.gif ==> loading_img2.gif
==============================================================================================================

- XLauncher에서 loading image
XLauncher.loadingimage = "d:\\loading.bmp"
XLauncher.loadingimage = "http://localhost/loading.bmp"
==============================================================================================================

- 버튼 클릭시 커서(로딩바) 활성화 보이기
function Button00_onclick(obj:Button,  e:ClickEventInfo)
{
	this.setWaitCursor(true);		// 커서(로딩바) 활성화
	this.setTimer( 0, 5000 );		// 5초 동안 돌기
}
==============================================================================================================

- FSP 서버 기술지원(소프트잼)
1. http://www.softzam.com:8080/download.html, tamario12 / hp수*16*1@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.05.31(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:50 ==> 03:40 기상, 05:25 강남 고속터미널역 하자, 당진행(07:00, 강남T), 07:15 당진터미널 도착, 07:25 31-2번 버스. 탑승
							 --> 쌀, 반찬(진미채, 콩) 가지고 옴 

- 현대제철 Safety Keeper Prj[★]
- 컨베이어 팝업 화면(/SP6111M_D2_13.xldl) [14:컨베이어] 화면 수정
1. 신규 등록 ==> A.MGR_NO_N(관리번호_신규) 번호 발생: 품목 + 마지막 번호
/* 관리번호(신규) 생성 ==> [/sp6111M_K02.xml] [select()] [2020.05.19, by 진태만] */
SELECT  SUBSTR(MAX(MGR_NO_N),1,5) || TRIM(TO_CHAR(TO_NUMBER(SUBSTR(MAX(MGR_NO_N),6,8)+1),'0000')) AS MGR_NO_N  		
				/* 관리번호(신규) */ 
--  SUBSTR(MAX(MGR_NO_N),1,5) MGR_NO_01, SUBSTR(MAX(MGR_NO_N), 6, 8) AS T_01
	, TO_NUMBER(SUBSTR(MAX(MGR_NO_N),6,8)+1) AS T_02, TO_CHAR(TO_NUMBER(SUBSTR(MAX(MGR_NO_N),6,8)+1),'0000') AS T_03
FROM SMT_FCEQ_MSTR		/* 시설설비 TB */ 
WHERE 1=1
    AND PRCS_ID = 'DJ111'		/* 공장공정ID */  ---> 제거
	AND FCEQ_KIND_ID='14'	/* 설비종류번호 */
;
==============================================================================================================

- 자율검사 집계표 화면(/SAFC0200.xldl)  
1. 공장: 당진제철소  ==> 1열연  ==> 1열연
==> 집계표 정보 수정
==> 신규 등록시 TB_SAF_INSP010(가스점검 관리 TB)를 처리 안해서 문제가 생김: 측시 추가함
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
