

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2010.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2010.01.01(금) 작업 ■■■■■■■■■■■■■■■■
---> 10:30 ~ 01:00 

- PS 22 Study
- SF 마인드맵 작성, SF 총정리 
==============================================================================================================

■ 합격을 위한 단기 전략 수립 
Ⅰ. 현 상태 분석 

Ⅱ. 합격을 위한 단기 전략 수립 
  가. 정신력 향상을 위한 전략 
  나. 필합격 정신 배양 전략 

Ⅲ. 합격을 위한 단기 세부 실천 계획 
  가. 기출문제, 모의고사 분석 
  나. 모의 테스트 실시(10점, 20점 문제)

Ⅳ. 합격을 위한 단기 전략 수립 
==============================================================================================================

- 모범 답안   
==> Anti Forensic(완료), DLP(Data Leakage Prevention)(완료), SQL Injection, VPN(IPSec, SSL, MPLS), RMS,  
PDOS, Active Honeypot, MFA, Mobile Security 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- PS 22 Study
- 심화 학습(인포레버 회의실: Vision실)  ==> 백종규님, 이주일님 참석(홍완표님 15:00에 옴, 박희찬님 포기 선언) 
1. 발표: Cobit, COSO(백종규님): 11:00 ~ 16:00, IT Governance(이주일님): 17:00 ~ 01:00,  
            Anti Forensic, DLP(Data Loss Prevention): 19:00 ~ 22:30 

■ COSO 프레임워크 
Ⅰ. Biz compliance 대응을 위한 내부 통제 Framework COSO 프레임워크 
  - 다양한 기업 compliance에 대응하여 효과적인 기업 내부 통제를 수행하기 위한 전사적 통제 프레임워크 
Ⅱ. COSO 프레임워크와 세부 내역 
  가. COSO 프레임워크 
  나. 5 컴포넌트 세부 내역 
   - Monitoring, I&C, CIA, Risk, Control/Entity 

■ Cobit 
Ⅰ. 효율적 IT 통제/관리를 위한 프레임워크 Cobit 
  - ITEA/ISACA에서 정의한 효율적 IT Governance 구현을 위한 공개 표준 프레임워크 
Ⅱ. Cobit 큐브와 핵심 프로세스 
  가. Cobit 큐브 
  나. Cobit의 핵심 프로세스 

■ IT Governance 
Ⅰ. 비즈니스 IT Align을 위한 지배구조 IT Governace 
  - Biz의 IT 의존도 심화,  IT Compliance 대응, IT 투자 투명성 확보[Biz 환경의 변화] ===> IT Governace 
    ==> 비즈니스 Risk 완화, IT를 통한 이익 창출, IT 투자 효율적 관리[적용 효과] 
  - Biz와 IT 연계를 통한 기업 가치 제고와 효과적인 투자를 위한 재배구조 
Ⅱ. IT Governance 구성개념 
  가. IT Governance 구성 개념도 
  - Biz 전략에 따른 라이프 사이트 관점의 IT 운영 
  나. IT Governance의 구성요소 
  - 전략적 연계(EAP), 가치전달(BPM, ERP, SCM), 위험관리(BCP/DR), 자원관리(ITAM, ITSM), 성과측정(BSC) 
Ⅲ. Biz/IT 통제 프레임워크 연계 방안 
- Audit(Cobit 1.0) ==> Control(Cobit 2.0) ==> Management(Cobit 3.0) ==> Government: 지배(Cobit 4.0)  
Ⅳ. EA와 연계된 IT Governance 
EA(DA, TA, AA, BA) <===> 전략적 연계, 가치전달, 위험관리, 자원관리, 성과측정 
==============================================================================================================

- Digital Forensic Research Center in Korea University 
http://forensic.korea.ac.kr/research/conference.php 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- PS 22 Study
- 심화 학습(인포레버 회의실: Dream실)  ==> 백종규님, 이주일님 참석(홍완표님 11:00에 옴) 
1. 발표: IT Governance(다시 정리): 10:00 ~ 12:00, Active Honeypot(백종규님): 13:00 ~ 14:00, 
    비버깅 & 뮤테이션(이주일님): 14:00 ~ 18:00, S/W 재사용(이주일님): 18:40 ~ 20:00, 
    UX(이주일님): 20:00 ~ 21:00   ===> 점심 내가 쏨(21,500원) 
==============================================================================================================

- MSN(hotmail) 
*@*.*/ssj**88*, *@*.*/ssj**88* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 23:30 

- PS 22 Study
- 수치해석, 확률통계(안지현 기술사 자료) 정리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 01:00 

- PS 22 Study
- 총 정리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- PS 22 Study
- 총 정리 
==============================================================================================================

- 심화 학습(SPNS 뜰(신촌역 6번 출구 근처) 회의실)  ==> 백종규님, 이주일님, 홍완표님 참석(엄기호님 포기 선언) 
1. 발표: P3P(백종규님): 19:30 ~ 21:30, SAML(홍완표님): 21:30 ~ 22:30 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2010.01.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 02:00 

- PS 22 Study
- 총 정리(SE, DB) 
==============================================================================================================

- 달력 만들기(TAMA's HouseK_Book 소스 이용하여 만듬) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- PS 22 Study
- 총 정리(CA, NW, SF) 
==============================================================================================================

- STOCKS 
월(2,800), 화(2,970), 수(3,200), 목(3,190), 금(3,250) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 23:00 

- PS 22 11
ㅁ기타 
08:40: 학원 도착 
10:00 ~ 12:20: 보안 프레임워크 마인드맵 그리기(발표) 
12:30 ~ 13:10: 점심 식사 
13:20 ~ 15:00: 1교시 모의고사(8문제 적음: 27.0점)  
15:20 ~ 17:00: 2교시 모의고사(3문제 적음: 36점) ==> 평균: 31.5 점 
17:20 ~ 20:00: 200분 모의 고사 평가 
			1. 10점 문제: 동일한 패턴, 기술적이지 않음, 2단락 작음 
			2. 25점 문제: 물어본 것 안씀, 문제 이해를 못함, 목차 못 잡음 
ㅁ소감 및 의지 
	-  좀 더 전투적으로 답안을 작성하자. 열심히 더 열심히 하자.  
ㅁ총 학습시간: 11시간 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.10(일) 작업 ■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- 기술사 실전T(54회)  
- 54회 모의고사 실시(동국대학교): 아침에 시험 푸는 연습 많이 하자. 현실 인정하자(2~30점대 실력)  
----------------------------------------------------------------------------------------------------------------------------- 

ㅁ기타    
08:20: 동국대 혜화관 5층 도착 
09:00 ~ 10:40: 1교시(6문제 품: 점) --> 이주일님, 백종규님, 홍완표님 
11:00 ~ 12:40: 2교시(1문제 품: 점) 
12:40 ~ 13:40: 점심 시간(학원에서 김밥 줌 ==> 4명이서 김밥 7개 받아서 라면이랑 같이 먹음 => 1개 집으로 가지고옴) 
13:40 ~ 15:20: 3교시(1문제 품: 점) 
15:40 ~ 17:30: 4교시(1문제 품: 점)(포기하고 20분 일찍 나옴) ==> 평균: 10점 
			 ==> 총 시험 시간: 6시간 40분  
ㅁ소감 및 의지 
  - 2, 3, 4교시 문제 머리도 아프고 목차도 못잡고 해서 포기 함. 대책이 필요  
ㅁ총 학습시간: 8시간 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 01:00 

- PS 22 Study
- 공부 안 함 
==============================================================================================================

- 책상, 의자 주문, 가스레인지(2만 6천 3백원, 설치비 2만 8천원) 
==============================================================================================================

- KT COOK TV(IPTV 또는 케이블 TV) 
- 2011.02.01에 3년 약정 추진 고민 할 것: 라이트+스탠다드(105개 채널 + VOD7만여편) 
http://www.kt-megapass.kr/qooktvsky.htm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 02:00 

- PS 22 Study
- 공부 안 함 
==============================================================================================================

- 이력서 작성, 취업 알아보기 
==============================================================================================================

- TAMA's HouseK_Book 수정(TAMA 가계부 보고서 상세 화면 추가, 회원관리 추가) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:30 ~ 23:30 

- PS 22 Study
- 공부 안 함 
==============================================================================================================

- 전세금 반환 
개정된 임대차 보호법에는 임차인은 언제든지 계약해지의 통고를 할 수 있습니다. 이때 계약해지의 효력은  
주택임대차보호법의 개정으로 인하여 3월이 경과하여야 발생합니다.  
3개월전부터 계약해지 통지를 하였다면 통보만료일이 되면 다음 세입자와 상관없이 주인이 보증금을 반환하여  
주어야 합니다 
일단 임대보증금반환청구소송을 하시기 전에 지금까지의 경위를 기재한 후 언제까지 보증금을 반환하여 달라는  
내용으로 내용증명우편을 임대인에게 발송하여 보십시오. 이후 지정기일에 보증금을 반환하지않으면  1. 주민 
등록등본  2. 임대차계약서 사본  3. 등기부등본 4. 내용증명우편 사본5. 임대보증금반환청구소장 2부를 법원에 
제출하시면 됩니다.   
임대보증금반환청구소장은  2000만원이하의 보증금인 경우에는 법원에 소액심판청구서 양식이 비치되어 있으면   
2000만원 이상인 경우에는 일반적인 소장에 이를 기재하시면 됩니다. 아울러 임대보증금반환청구소송과 동시에  
주인이 부동산을 임의처분하거나 더 이상의 근저당권을 설정하지 못하도록 부동산가압류도 동시에 하시는 것이 
좋습니다.  

다음 세입자와 상관없이 기간이 만료되면 집주인은 보증금을 반환할 의무가 있습니다. 하지만 대부분 집주인들이  
만료기간이 되어도 다음 세입자가 들어오면 주겠다고 하거나 아쉬울것 없다는 생각에 그냥 안주고 버팁니다.  
하지만 집주인과 협의를 해서 나가시고 돈도 받으시고 하는게 가장 빠르고 좋은방법입니다만 세입자 입장에서는  
마냥 기다릴수만은 없는 노릇이기에 법적인 절차를 통해서라도 받을수 있는 방법을 생각해 보셔야 합니다. 
1) 계약기간 만료 최소 1개월 전에는 집주인에게 내용증명(우체국에 신청)으로 계약만료와 함께 이사하겠다는 의사를  
분명히 통보를 합니다. 왜냐하면 들었으면서도 나중에 못 들었다고도 하는 경우 많기 때문에 법에 공개적으로 만료되어  
나가겠다고 하는 통보이기 때문에 집주인이 받으면 좋겠지만 못 받아도 상관없습니다. 
2) 계약만료일이 지나면 바로 그 다음날 법원으로 가서 임차권등기를 신청합니다. 임차권등기명령은 임대차 종료 후  
보증금을 반환받지 못한 임차인이 법원에 임차권등기명령을 신청함으로써 대항력과 우선변제권을 상실하지 않게  
보장하기 위한 제도입니다. 따라서 보증금을 못받은 경우에 피치못할 사정으로 주소를 옮겨야 한다면 임차권등기명령을  
신청해야 합니다. 
3) 약 2주 후면 임차권등기가 실제로 등기소에 설정되었는지 확인하고 임차권이 설정되었다면 가까운 지방법원에  
'전세금 반환소송'을 신청합니다. 모르시면 법원에 가셔도 법무사들에게 무료상담도 가능하니 법원에 가보세요. 
4) 만일 그럼에도 돈을 안주면 바로 경매신청하여 배당을 받거나 세입자가 사고 싶으면 참여해도 됩니다. 
==============================================================================================================

- TAMA's HouseK_Book 수정(TAMA 관리자 화면 추가) 
==============================================================================================================

- 설 기차 예매(인터넷) 못 함(늦잠 잠) 
1. 2010.01.13(수) 06:00 ~ 08:00  ===> KTX 패밀리 체크 카드(철도회원) ==> 카드번호: 0550566830/0**9 
http://www.korail.com/bt/pr11100/w_pr11110.html  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:20 ~ 23:30 

- PS 22 Study
- 공부 안 함 
==============================================================================================================

-  이사짐 싸기 
1. 사무용품(1박스) 
2. 욕실용품(1박스) 
3. 내실용품(1박스) 
4. 식기류(1박스) 
5. 주방용품(1박스)   
6. 옷(여행용 가방: 큰 거)(차 앞좌석) 
7. 책(여행용 가방: 작은 거) 
8. 주방용품2(1박스)  
9. 신발류(1박스) 
10. 전자레인지(1박스)  
11. 기타(1박스)  
12. 기타(등산 가방: 작은 거 2개)    
13. 컴퓨터(차 앞좌석) 
14. 컴퓨터 모니터(차 앞좌석) 
15. 장식용 서랍: 3개(차 뒷좌석) 
16. 장식용 서랍(플라스틱): 1개(차 뒷좌석) 
17. 양복 4벌(차 뒷좌석): 2벌 포항 
18. Y샤츠 긴팔, 짧은팔(차 뒷좌석) 
19. 선풍기(큰거, 작은 거)(차 앞좌석) 
20. 이불2개, 매트2개, 베게1개(차 트렁크) 
21. 판상(차 트렁크) 
22. 행거(차 트렁크) 
23. 쌀통(차 트렁크) 
24. 세제(1통) 
25. 라디오(1박스) 
26. 거울다이: 조립 나무(차 트렁크) 
==============================================================================================================

- 처리해야 할 돈 
1. 전세금 5천 2백[3천(주인집에서 받을 것), 2천 2백(은행에서 찾을 것)  ===> 계약금 3백 지급함]: 인터넷 뱅킹   
2. 이사시 소요 현금 
 1) 부동산 수수료: 22만원(행운 부동산) 
 2) 가스레인지(설치비 2만 8천원) 
 3) 삼겹살 파티(10만원)  ====> 총 35만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:10 ~ 01:00 

- PS 22 Study
- 공부 안 함 
==============================================================================================================

- 이사짐 싸기 

19:00 박스에 이사짐 싸기(박스 10개 소요, 노끈이 부족 함)  
01:00 종료 
01:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 01:00  --> 이사 

- 이사하기
08:00 기상 
08:10 조식(라면 2개) 
09:00 주인(여정자 한솔B/D 7층)집에 가서 전세금 미지급금 천 5백 만원 지불 각서 받기(3천만원은 받음) 
09:30 새집 도착(전  세입자 김경진씨 이사갈 준비하고 있음): 서울시 관악구 봉천동 106번지 23호 14통 5반 101호 
        - 서울 관악구 봉천동 106-23 101호(덕적8길 6-4) 
10:00 행운 부동산 도착(김경진씨(전 세입자), 임대인: 정평순(*): 이체 카드 없어서 이체 불가능) 
        - 제일은행(179-20-160578 예금주: 정평순)  ==> 1년치 수도세 완납(월 5천 --> 6만원: 2011.02.15) 
10:30 한솔 B/D가서 전세금 천 2백 인터넷 이체하려가 불능(1일 한도 초과): 자가용으로 2차 이사짐 옮김 
11:00 제일은행에서 2백만원 무통장 입금(수수료 천 5백원) 
12:00 2차 이사짐 내림(차가 후진하다가 어름에 때문에 빠짐: 택시 기사 아저씨가 도와줌) 
12:30 5천 만원 송금 완료(1일 천 만원씩 5백만원까지 이체 가능), 3차 이사짐 옮김 
13:30 3차 이사짐 내림 
15:30 4차 이사짐 옮김(박스 3개 다시 풀어서 옮김, 모든 짐 옮김) 
16:30 4차 이사짐 내림(전 세입자(김경진씨)가 냉장고, 세탁기, 침대, 가스레인지, 커텐, 거울 주고 감) 
17:00 이사짐 정리(의자 택배 받음) 
18:00 한솔 B/D에서 가서 1회용 가스레인지 찾아 옴, 집들이 장봄(삼겹살, 상추, 소주 5병, 맥주 1.5L 1개, 귤 2천원) 
20:20 임모, 현용 옴(2백 7천원 상당 참치캔 선물 받음) 
20:30 삼겹살 파티 
01:30 종료(임모 집에 가고 현용 자고 감) 
01:50 취침    
==============================================================================================================

-  이사짐 분류 
1. 사무용품(1박스) 
2. 욕실용품(1박스) 
3. 내실용품(1박스) 
4. 식기류(1박스) 
5. 주방용품(1박스)   
6. 옷(여행용 가방: 큰 거) 
7. 책(여행용 가방: 작은 거)  
8. 주방용품2(1박스)  
9. 신발류(1박스)  
10. 전자레인지 
11. 기타(1박스)  
12. 기타    
13. 컴퓨터 
14. 컴퓨터 모니터 
15. 장식용 서랍: 3개 
16. 장식용 서랍(플라스틱): 1개 
17. 양복 4벌( 
18. Y샤츠 긴팔, 짧은팔 
19. 선풍기(큰거, 작은 거) 
20. 이불2개, 매트2개, 베게1개 
21. 판상 
22. 행거 
23. 쌀통 
24. 세제 
25. 라디오 
26. 거울다이: 조립 나무 
==============================================================================================================

- 세금계산 
1. 전기요금(3031) 2009년 12월분(11.15 ~ 12.14: 17,060원, 156kWh), 2010년 01월분(12.15 ~ 01.16: 27,140원, 219kWh) --> 총: 44,200원 
  공급자 등록번호: 108-82-03419, 전자납부번호(고객번호): 01-1851-3698(* 정점섭) ==> 매월 말일 납부 
  자동이체 신청(www.kepco.co.kr) --> 완료 
  TV 수신료 부가 취소 신청(완료): KBS 수신료 콜센터(1588-1801): 2천 5백원 
2. 도시가스(0962)  61,810원 ===> 총: 106,010원(전 세입자(김경진씨)로 부터 받음) 
  고객번호: 20020619-000304(20020619000304) , 서울도시가스: 02)810-8000, 도시가스 점검원: 김복자(*) 
  자동이체 신청(www.giro.or.kr, 지로번호:) 
==============================================================================================================

- 90회 기술사 시험 필기시험 검정접수 
원서접수 홈페이지: www.Q-net.or.kr 
--------------------------------------------------------------------------------------------------------------------------------

- 90회 기술사 시험 일정(2010년 02월 07(일)) 
필기시험 검정접수(1.15～1.21) 
필기 시험(2월 7일) 
필기시헙 합격자 발표(3.26)
면접시험 원서접수(3.29～4.1) 
면접시험 시험(4.24～5.6) 
합격자 발표(5.14) 
==============================================================================================================

- STOCKS 
월(2,800), 화(2,970), 수(3,200), 목(2,970), 금(3,000) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.16(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:30 ~ 20:00 

- 이사 정리하기
09:00 기상 
09:30 현용 배웅(국민은행 가서 돈 찾아 옴)  
10:30 행운 부동산에서 부동산 중계 수수료 22만원 계산 
11:00 파워컴 이전 설치 다음주 월요일 예정, 책상 다음주 화요일쯤 도착, 행거 반품할 예정 
12:00 이사짐 정리(책상과 행거 때문에 제대로 정리가 안됨) 
18:00 봉천 중앙시장 옆 가게(시계 구매: 만 9천원) 
20:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:10 ~ 01:00 

- PS 22 Study
ㅁ기타 
08:10: 학원 도착 
- 백종규님, 이주일님 참석(홍완표님 10:30에 옴), 최기술사님(내가 나와서 기뻐함) 
1. 마인드맵 그리기: 13:00 ~ 16:00 SE,16:00 ~ 18:00 ES, 18:30 ~ 19:30 석식, 20:00 ~ 21:30 DB 
2. 숙제: 10점 문제 답안 작성, 25점 문제 목차 잡기, 89회, 87회, 86회, 84회 
2. GIS 강의(최기선 기술사) 
 - www.gsion.com   desunny/9530  
ㅁ소감 및 의지 
  - 열심히 더 열심히 하자.
ㅁ총 학습시간: 12시간 
==============================================================================================================

- 옥션 물건 구매 
프리메이드 FR-888S 센스 렌지대 32,800원 
제주도 세콤달콤 감귤 10Kg  6,800원 
(오뚜기)김치라면 40개1박스(80개) 38,000원 
초코파이 정(192입 6개:개당 188원) 100,800원 
바른글씨 교재 150,000원 
==============================================================================================================

- 반품 관련(행거 반품 요청) 
전자상거래로 구입시에는 청약철회 기간이 7일 이내로써 이 기간 내에는 반품이 가능하다. 
1월 4일 물건을 주문하고 출장 때문에 집에 없었는데 1월 14일 이사한다고 집에 와 보니 집앞에 물건이 와 있었어요. 
택배 하시는 분이 문자나 전화도 주지 않고 주인도 없는 집에 그냥 놓고 가면 어떻하나요? 실제로 제가 물건은 받고 
확인을 한 날짜는 7일이 안되니 반품을 요청 합니다. 
처리 부탁 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00 

- PS 22 Study
- 2010년 자동차세 1년치 납부(10%DC) 
납세번호: 6205751-10106001-2010013-5021547, 세목: 자동차세 자동차, 납부금액: 133,770원 
- 2010년 자동차 보험료 
그린화재(김태희: *) 제일은행: 47116046-024494  280,800원 
대물배상: 1사고당 3억원 한도, 물적할증기준: 200만원 
기간: 2010.02.10 ~ 2011.02.09 
==============================================================================================================

- LG 파워콤 재설치 
김종덕(개통팀 02)1644-1799, *): 13시에 옴 
빨래(온수에서 냉수로 호스 바꿈: 물 바다) 
==============================================================================================================

- 주소 변경: 동양종금, 제일은행, 국민은행(creditbank.co.kr), 대한생명(creditbank.co.kr), 매트라이프, PCA생명 
신한카드(creditbank.co.kr), LG텔레콤(creditbank.co.kr), SHOW(creditbank.co.kr), 프라임 저축은행 
==============================================================================================================

- 설 명절 예매 
1. 설 버스 예매(포항 --> 서울) 32,300원 
2. 철도 예매(서울 --> 동대구): http://www.korail.com/2007/index.jsp  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.19(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 01:00 

- PS 22 Study
- 업무 
전입 신고, 확정일자 받기 ==> 문태용 주민번호: 710315-10  
왕자 행거 반품 배송비 입금계좌 국민은행: 235-01-00000 왕자NHC  5천원 
==============================================================================================================

- 지도 
낙성대역 5번 출구(관악중)에서 400M --> 훌라라 참숯 바베큐와 SK 셀프 주유소 사이로 우회전 --> IGA mart(지남)  
--> 오른쪽 녹색 컨테이너, 현석 하이츠 길로 우회전(까치공원 1길) --> 50M 정면 청색 대문: 까치공원 1길 8번(우회전) 
--> 까만 대문 첫번째집(101호) 
==============================================================================================================

- 바른글씨 동영상 시청 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30  --> 집들이(태용: 밀대 청소기(만 9천원) 선물 받음) 

- PS 22 Study
- Windows Live ID 계정 소유자 확인 요청 
지원 티켓 번호: 22985492  ====> MSN(hotmail): *@*.*/ssj**88* 
==============================================================================================================

- 책상(KGB 택배) 송장번호: 4453880690 
https://www.kgbls.co.kr/sub5/trace.asp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.21(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:30 ~ 02:00  --> 책상 도착(17:30) 

- PS 22 Study
- 바른글씨 연습(1주 2회 ~ 3회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:30 

- PS 22 Study
- 제90회 정보관리 출제예상 오브젝트(GIS), 강사: 장중훈 기술사 
==============================================================================================================

- STOCKS 
월(3,035), 화(3,015), 수(3,100), 목(3,045), 금(3,000) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.23(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 01:00 --> 집중모의고사 

- PS 22 13
ㅁ기타 
07:30: 학원 도착 
- 이주일님 참석(백종규님, 홍완표님 10:00에 옴), 최기술사님(12:40에 같이 점심 식사) 
1. 집중 모의고사: 10:30 ~ 12:10 10점 모의고사(17점),14:20 ~ 15:10 25점 모의고사(22점),  
                          17:20 ~ 19:10 10점 모의고사(17점), 20:00 ~ 22:30 25점 목차 잡기 ===> 평균: 18.7점  
ㅁ소감 및 의지 
  - 시험 성적 낫다고 기술사한테 개망신 당함. 더 열심히 하자. 
ㅁ총 학습시간: 13시간 
==============================================================================================================

- 바른글씨 연습(1주 4회 ~ 5회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.24(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 01:00 --> 집중모의고사2, PS 22 마지막날 

[PS 22 14] 

ㅁ기타 
07:40: 학원 도착 
- 이주일님 참석(백종규님, 홍완표님 10:00에 옴), 최기술사님(12:40에 같이 점심 식사) 
1. 집중 모의고사: 10:30 ~ 12:10 10점 모의고사(14점),14:20 ~ 19:00 25점 목차 잡기 모의고사(86회 기출문제), 
  19:00 ~ 19:20 PS 22 마무리 

ㅁ소감 및 의지 
  - 시험 성적 낫다고 기술사한테 개망신 당함(홍대리랑 같이 당함), 목차는 괜찮다고 함. 잘 참음..오늘을 잊지 말자. 

ㅁ총 학습시간: 13시간 
==============================================================================================================

- 바른글씨 연습(1주 6회 ===> 1주차 첨삭지도 올림) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 00:30 

- PS 22 Study
- 총 정리 
==============================================================================================================

- start UML: 분석 설계 툴 
StarUML 5.0 사용자 가이드(http://staruml.sourceforge.net/docs/user-guide(ko)/toc.html) 
StarUML 5.0 개발자 가이드(http://staruml.sourceforge.net/docs/developer-guide(ko)/toc.html) 
OPEN API(http://staruml.sourceforge.net/docs/api-doc/index.html) 
==============================================================================================================

- 옥션 이머니 비밀번호: ssj**8*3 
==============================================================================================================

- 취업 준비 
보고정보시스템(주), 보험업무(운영)  
드림아이텍(주), CJ 제일제당 java 쇼핑몰, 경력 5년이상 운영인력 중급이상 구함 
==============================================================================================================

- 공차장 회사 
(주)에스이랩: 서울시 강남구 논현동 66-3 진영빌딩 5층(http://www.spweather.com) 
==============================================================================================================

- 바른글씨 연습(2주 7회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 00:30 

- PS 22 Study
- 89회 10점 답안, 25점 목차 잡기 
==============================================================================================================

- 삼성 레이저젯 잉크 카트리지(CF-5100D3) ==> 삼성 레이저 프린터(ML-4300i) 
==============================================================================================================

- SE 서적 구매 
소프트웨어 공학 4차 개정판, 저자: 최은만, 가격: 23,750원(5% 할인)  
http://www.yes24.com/24/goods/2813570?scode=032&srank=1 
==============================================================================================================

- 편의점 택배(http://cvsnet.co.kr) 
GS25 봉천낙성대점(02-886-5082): 집 근처(봉천동 106-23 101호) 
==============================================================================================================

- 바른글씨 연습(2주 8회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 00:30  --> 태용, 임모 만남(낙성대 집근처: 조식(태용 쏨), 당구 내기(1등, 임모 꼴찌), 동동주(태용 쏨)) 

- PS 22 Study
- 89회 10점 답안, 25점 목차 잡기 
==============================================================================================================

- 취업 준비 
코바아이티(주), 증권사SM, 재무관리IFRS 
보고정보시스템(주), 손해보험 SM(그룹웨어) 
리더스아이(주), 은행 전산시스템 운영 
==============================================================================================================

- 미니 키보드  
GP-K7000 큐센 컴팩트 미니 키보드10,200원(키이에스탑: 용산구 원효로2가 61-22 기린빌딩 2층 남정새싹 3길) 
- 미니 마우스  
LG XM-110(블랙) 9,200원(키이에스탑: 용산구 한강로2가 나진상가 19동 나열 301호) 
==============================================================================================================

- 바른글씨 연습(2주 9회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:20 ~ 00:00 

- PS 22 Study
- 89회 10점 답안, 25점 목차 잡기 
- 54회 실전테스트 동영상 정취 
==============================================================================================================

- 바른글씨 연습(2주 10회) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 00:00 

- PS 22 Study
- 89회 10점 답안, 25점 목차 잡기 
==============================================================================================================

- 바른글씨 연습(2주 11회, 12회 ===> 2주차 첨삭지도 올림) 
==============================================================================================================

- STOCKS 
월(2,960), 화(2,975), 수(2,945), 목(2,900), 금(2,935) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:10 ~ 00:00 --> 조기 축구(숏게임 1:0 승) 

- PS 22 Study
- 심화 학습(을지로 입구역 복창 빌딩 2층 LG CNS 프로젝트 사무실)  ==> 홍완표님, 백종규님, 이주일님 참석 
1. 기존 PS 22 모의고사 문제를 다시 분석(10:10 ~ 19:30, 중식, 음료수, 과자: 백종규님이 쏨) 

■ XRX(Xform, REST and Xquery) 
Ⅰ. XRX의 개요 
  - xForms, REST, Xquery 를 근간으로 application data를 web client와 web 서버에 동시에 xml 포맷으로 저장하여  
  데이터 포맷 간의 전송을 필요로 하지 않는W3C 표준 기반의 Web Appication Architecture 
Ⅱ. XRX의 처리 프로세스와 요소별 기술 
  가. XRX의 처리 프로세스 
  나. XRX의 요소 별 기술 
Ⅲ. XRX의 활용 확보 방안  

■ UX(User Experience) 
Ⅰ. 사용자-정보시스템간 Interface 최적화를 위한 UX(User Experience) 
Ⅱ. UX의 구축절차 및 구성요소 
  가. UX 구축절차 
  나. UX 구성요소 
Ⅲ. UX 연구분야 및 적용사례 

■ Smart Grid 
Ⅰ. 에너지 절약형 전력망 구현을 위한 Smart Grid 
- 기존 전력망 비즈니스구조에 정보통신기술을 접목하여 공급자와 소비자간에 양방향으로 실시간 정보를  
교환함으로써 에너지 효율을 최적화한 지능형 전력망 
==============================================================================================================

- 프린터 설정  
Canon MF 3200 시리즈  ==> 프린터 IP: \\192.168.100.12 ---> LG CNS 프로젝트 사무실 
xplorer2 --> http://www.zabkat.com/x2down.htm 
==============================================================================================================

- 노트케이스 델타6 비밀번호 변경 방법 
1. 신규제품의 비밀버호는 0000으로 설정되어 있음  
2. 0000으로 다일얼을 설정한 후 잠금버튼이 움직이는지 확인 
3. 비빌번호 변경버튼을 꾹 눌러서 고정시켜 줌 
4. 비빌번호 변경번호를 꽉 누른 상태에서 자신이 원하는 비빌번호를 설정 
5. 비밀번호가 변경버튼을 놓으면 이제 새로운 비밀번호로 설정이 완료됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2010.01.31(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

▦조기축구 
06:30 기상(차가지고 감) 
07:00 세차(클로바 세차장): 3천원(바닥 미끄러워서 기둥에 막음) 
07:50 숏게임(1:1 무승부)  
09:00 게임(3:1 패) 
10:00 게임(5:5 무승부) 
11:50 종료 
11:30 중식(식당: 만원씩 거두움) 
12:00 당구장 
14:00 종료 
15:30 귀가 
24:00 취침 
==============================================================================================================

- LG 맵버쉽 카드 신청 
1. GS 25 15% DC 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■