

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.09) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.09.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 진수종  코로나 19 확진(11:50, 최준호 내과의원)

- 자체 휴가[★]
- [나도 코딩] 파이썬 - 업무자동화(RPA) 엑셀 자동화(openpyxl) 수강
- 파이썬 코딩 무료 강의 (활용편4) - 업무자동화(RPA), 이제는 일하는 척(?)만 하세요
https://www.youtube.com/watch?v=exgO1LFl9x8&list=PLMsa_0kAjjrd8hYYCwbAuDsXZmHpqHvlV&index=7
============================================================================================================== 

- 자산 검증 파일(/ast_vrfc.py) 개발
============================================================================================================== 

- 신한은행 비밀번호 설정
1. https://bank.shinhan.com, tamario/as**12**!! 
============================================================================================================== 

- 자체 휴가[★]
05:05 기상
05:10 조식
05:30 도보(도림 도보교 => 도림천 => 신대방역 ==> 구로디지털단지역 ==> 신대방역) 
07:05 귀가
07:40 인터넷 서핑
11:00 남부초 보건 교사에게 수종이 열나고 아프다는 전화 받음: 하교 시키라고 요청함
11:20 수종 귀가
11:40 최준호 내과의원 방문 ==> 진료(수종 코로나 검사[신속 항온 검사: 2만원): 코로나 확진: 25,100원) 
11:50 조제(2,800원)
12:10 CU 신림 4동점 방문
12:00 중식 ==> 크림 가둑 유부 초밥2(수종: 3,700원), 치킨 마요 덮밥2(3,900원) 구입
12:30 귀가
12:35 실내 도보
13:20 종료
13:40 인터넷 서핑
13:50 수종 집에서 쉼
17:20 CU 신림 4동점 방문 ==> 편의점 도시락(수종: 4,900원) 구입
17:30 석식(편의점 도시락(수종))
17:50 종료 
18:10 실내 보도
19:20 종료 ==> 창맥, 대학 동기 만남(19시, 수향가 사당 직영점): 불참(수종 코로나 확진 떄문)
20:00 인터넷 서핑 
22:00 취침
============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.09.02(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:06 기상
06:30 조식(돈까스 2개), 수종: 도시락
06:50 도보(도림 도보교 => 도림천 => 신대방역 ==> 구로디지털단지역 ==> 신대방역) 
08:14 종료
08:50 샤워(찬물)
09:00 인터넷 서핑 ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 웹 자동화 수강 
11:30 중식(수종 편의점 도시락)
12:45 실내 도보
14:00 종료  
13:20 인터넷 서핑
17:30 석식(수종 편의점 도시락)
17:45 실내 도보
19:00 종료 ==> 수종 건강 많이 좋아 짐
19:40 인터넷 서핑
22:30 취침
===============================================================================================================

- 나도 코딩] 파이썬 - 업무자동화(RPA) 웹 자동화 
1. xPath: XML문장 속의 요소, 속성 등을 지정하기 위한 언어
 1) 네이버 로그인 버튼 ==> https://www.naver.com 에서
  가. full xPath(전체 경로)
/html/body/div[2]/div[2]/div/div[2]/div/div[1]/div[1]/div/a
  나. xPath
//*[@id="account"]/div/a		--->  지금 있는 위치에서 모든 하위 메뉴에서 id가 account인 것 조회
===============================================================================================================

- 프로야구 예매17시, 잠실 야구장)
1. 프로야구 예매[23. 09.09(토) 17:00,  삼성: 두산 잠실 경기  경기(3루 블루석 115블럭 9열 109, 115블럭 9열 110, 2매:46,000원)]
https://ticket.interpark.com/Contents/Sports/GoodsInfo?SportsCode=07001&TeamCode=PB004
-------------------------------------------------------------------------------------------------------------------------

01. 예약번호: T2277384800 ~ T2277384801(총 2매)
02. 이용일: 2023년 09월 09일 (토) | 17시 00분
03. 장소: 잠실 야구장
04. 좌석: 3루 블루석 115블럭 9열 109, 115블럭 9열 110
==========================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.09.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:24 기상(보슬비 내림) ==> 수종 건강 많이 좋아 짐
06:34 조식(돈까스 1개, 수종 편의점 도시락)
06:57 실내 도보
08:20 종료
09:10 인터넷 서핑
10:30 잡코리아(https://www.jobkorea.co.kr) 이력서 업데이트 
11:30 중식(짜장 라면, 수종 편의점 도시락)
11:45 실내 도보
11:55 수종 엄마집에 놀러감
13:05 종료
13:25 집 출발(자전거)
13:35 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(2,280원) ==> 총: 14,080원) 구입
13:45 귀가
13:20 인터넷 서핑 
17:30 석식: 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 집 출발
17:50 도보(도림 도보교 => 서울대 벤처타운역(반환점) ==> 도림천) 
19:15 귀가 ==> 수종 귀가 
20:00 청소(청소기, 밀대)
20:40 샤워(찬물: 체중: 67.8kg ==> BMI: 23.32(과체중))
21:00 인터넷 서핑
22:30 취침
==============================================================================================================

- 카카오 통합 아이디(다음, 카카오톡에서 사용) [23.09.03(일)]
1. https://mail.daum.net, tamario@kakao.com/as**12**!!
==============================================================================================================

- 고용보험 실업급여 수급 조건, 기준 확인
https://m.blog.naver.com/ekdud0706/223104580369?isInf=true
1. 근로자임을 증명할 수 있는 자료
 1) 급여를 확인할 수 있는 통장사본
 2) 명세서
 3) 출퇴근기록부
 4) 업무지시 관련 내용 (주고받은 카톡, 이메일, 녹취 내용 등)
 ==> 사실상 실업 급여 신청 불가: 포기
==============================================================================================================

- (주)휴먼인러브 이력서 보냄(22시)
1. 별첨1-공통이력서양식(진태만).doc
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.09.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 수종 자전거 수리(13시)

- 면접[★]
05:00 기상
05:10 조식
05:30 도보(도림 도보교 => 도림천 => 신대방역 ==> 구로디지털단지역 ==> 신대방역) 
07:05 귀가
07:10 샤워(찬물)
08:00 인터넷 서핑
08:30 파이썬 셀레니움4 분석
11:30 중식
11:45 집 출발(수종 자전거: 끌고 감[뒷바퀴 빵구 의심])
12:04 신림 자전거 수리 센터 방문 ==> 점심 시간 문 닫음, 뒷바퀴 바람 넣고 옴
12:15 귀가
12:25 실내 도보 
12:50 종료
12:55 집 출발
13:19 신대방역 -> 영등포 구청역 -> 발산역 -> LG 사이언스 파크
14:01 LG 이노텍(E3) 도착
14:20 면접(1층 로비) ==> 곽동태 부장(2명이서 기획, 개발, 개발자가 개발 포기해서 새로운 개발자 면접보고 있음, 9, 10월[2개월] 동안 개발 
		완료 --> 개발 환경 열악)
15:06 종료
15:10 발산역 -> 영등포 구청역 -> 신대방역
16:20 귀가
16:20 인터넷 서핑
==============================================================================================================

- 면접(4:20, 마곡 이노텍)
프로젝트 :엘지이노텍 (주) 본사_G mobile 고도화(OS최적화, 개인 맞춤형 서비스, 사용성 개선)_HR 서비스
장소 : 마곡 LG  이노텍(LG 이노텍(E3) 1층 로비)
기간 : 즉시 ~ 12월
기술 : java
등급 : 고급
인원 : 1명
---------------------------------------------------------------------------------------------

금일 : 오후 2시 30분
장소 : 마곡 이노텍 1층
담당자 : 곽동태 부장(010-4520-4752)
==============================================================================================================

- 자체 휴가[★]
- 셀레니움4 예제(/3_selenium_V4.py) 분석
============================================================================================================== 

- 파이썬 셀레니움4 최신버전 find_element 사용법 마스터
https://www.youtube.com/watch?v=qhy8I4ChCuw

pip install webdriver					# 웹드라이버 설치
pip install webdriver_manager 		# 웹드라이버 매니저 설치
============================================================================================================== 

- 셀레니움4 예제(/3_selenium_V4.py)
print(" [@_T] ■■■ [/3_selenium4.py] ==> [T_01] ■■■■■■ [######################### [셀레니움4 TEST Start] #########################] ■■■■■■ ")

options = Options() 
options.add_experimental_option("detach", True)  # 브라우저 바로 닫힘 방지
options.add_experimental_option("excludeSwitches", ["enable-logging"])  # 불필요한 메시지 제거 

service = Service(ChromeDriverManager().install())
driver = webdriver.Chrome(service=service, options=options)

url = "https://naver.com"

driver.find_element(By.XPATH, '//*[@name="query"]').send_keys("에스파")     # 검색어 input에 '에스파'라는 키 입력
time.sleep(2)   # 5초 대기
print(" [@_T] ■■■ [/3_selenium4.py] ==> [T_03]" )

driver.find_element(By.XPATH, '//*[@id="sform"]/fieldset/button').click()    # 검색 button에 클릭
time.sleep(5)   # 5초 대기
print(" [@_T] ■■■ [/3_selenium4.py] ==> [T_04]" ) 
============================================================================================================== 

- 셀레니움3 예제([/3_selenium.py]
print(" [@_T] ■■■ [/3_selenium.py] ==> [T_01] ■■■■■■ [######################### [selenium TEST Start] #########################] ■■■■■■ ")

#browser = webdriver.Chrome('./chromedriver.exe')
browser = webdriver.Chrome()
print(" [@_T] ■■■ [/3_selenium.py] ==> [T_02]" ) 

# 네이버 이동
browser.get('http://naver.com')
print(" [@_T] ■■■ [/3_selenium.py] ==> [T_03]" ) 

# 카페 메뉴 찾기
elem = browser.find_element_by_link_text('카페')    # //*[@id="shortcutArea"]/ul/li[2]/a/span[1]  ===> 에러 발생 ■■■■■■
# AttributeError: 'WebDriver' object has no attribute 'find_element_by_link_text'
============================================================================================================== 

- 파이썬 셀레니움(selenium) 크롬드라이버 자동 설치, 업데이트 패키지 webdriver_manager 사용법
https://blog.naver.com/kimflstudio/222873926593

- 파이썬 셀레니움으로 웹사이트 화면 조작하는 방법(태그 변경) 
https://blog.naver.com/kimflstudio/223134200633

- [Python/Selenium] 파이썬 동적 웹크롤링_selenium으로 화면 조작하기(ft.버튼 클릭, 키 입력, 스크롤 내리기)
https://coding-kindergarten.tistory.com/151

1. 클릭 : .click( )  ==> Kyes.ENTER, Keys.RETURN
2,. 키 입력: .send_keys( )
============================================================================================================== 

- Python 모듈 목록 확인
$ pip list
Package            Version
------------------ ------------------
attrs                            23.1.0
certifi                           2023.7.22
cffi                               1.15.1
selenium                      4.12.0
webdriver-manager     4.0.0
------------------------------------------------------------------------

$  pip show selenium		# selenium 버전 확인

$  pip install -upgrade selenium	# selenium 버전 업그레이드
============================================================================================================== 

- 미래에셋 증권 로그인[23.09.04(월)]
https://securities.miraeasset.com --> tamario / as**tt12**!!
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.09.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 김일기 부장한테 전화옴(08:10, 집): 어제 면접본 곽동태 부장(김일기 부장 선배)이 전화와서 내에 대해서 물어 
							봤다고 함, (주)예술과 기술 유승현 전무 전화(13:30, KT Prj(넥사크로, 750), 분당 정자역)

- 자체 휴가[★]
- 셀레니움4 예제 분석
4_iframe_V4
11_wait_V4
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.09.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> LG 이노텍 프로젝트 탈락 통보 받음(10:40, 집)

- 자체 휴가[★]
- 셀레니움4 예제 분석
11_wait_V4
==============================================================================================================
 
- 셀레니움4 예제(/3_selenium_V4.py) 수정
url = "https://naver.com"       # 네이버 주소
browser.get(url)

print(" [@_T] ■■■ [/3_selenium_V4.py] ==> [T_13] [CSS_SELECTOR 갯수 ■■■]"+ str(len(navs)) )  	#  ■■■

i = 0

for nav in navs: 
	# print("[@_T] ■■■ [/3_selenium_V4.py] ==> [T_51] [nav_번째]"+ str(i) +"[outerHTML]"+ nav.get_attribute("outerHTML") ) 	#  ■■■
    print("[@_T] ■■■ [/3_selenium_V4.py] ==> [T_51] [nav_번째]"+ str(i) +"[nav CSS text]"+ nav.text.replace("\n", "") )		#  ■■■
    print()
    i = i + 1
==============================================================================================================
 
- selenium no such 에러
1. 현상: Message: no such element: Unable to locate element:
2. 원인: 내가 지정한 element(css_selector = rogA2c)의 값을 못 찾을 경우 발행하는 에러
3. 조치: 
------------------------------------------------------------------------------------------------------ 

- 셀레니움 에러
https://zeuskwon-ds.tistory.com/67>
==============================================================================================================

- selenium stale 에러
1. 현상:  Message: stale element reference: element is not attached to the page document
2. 원인: 그 요소가 html? 문서에 없는데 그걸 긁으려 한다고 에러를 보내는 것이다.
즉, selenium으로 웹페이지가 너무 빨리 넘아가서 그렇다!
3. 조치: 이게 driver.implicit_wait(1) 이런 식으로 대기시간을 주면 되는 줄 알았다.
time.sleep(5)     # 5초 대기
==============================================================================================================

- 프로그램 동산
https://www.youtube.com/@programgarden/playlists
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.09.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>  

- 자체 휴가[★]
- 30만원 짜리 외주 프로그램 만들기 - 파이썬으로 네이버 쇼핑 크롤링하기 1편 (ft. 셀레니움 selenium) [스타트 코딩]
https://www.youtube.com/watch?v=ZHx6oATaI28&list=PLNO7MWpu0eeUFdGMirV8_EkiLETqj8xA4&index=10

- 30만원 외주 프로그램 만들기 - 파이썬 웹 크롤링 셀레니움 Selenium 강의 2편(ft. 스크래핑 결과 csv 파일 저장하기) [스타트 코딩]
https://www.youtube.com/watch?v=qRU94vtUb7c&list=PLNO7MWpu0eeUFdGMirV8_EkiLETqj8xA4&index=9
1. 52. shopping Mall.py  --> 52. shopping Mall Data.csv
==============================================================================================================
 
- 네이버 증권 주식 금융 데이터 크롤링 하는법 간단정리!! (1편 실시간 주가 정보) [스타트 코딩]
https://www.youtube.com/watch?v=QlgQ_CCCWXM&list=PLNO7MWpu0eeUFdGMirV8_EkiLETqj8xA4&index=6

- 파이썬 엑셀 다루기 - 불러오기 읽기 쓰기 저장 한방에 총 정리!!! (2편 실시간 주가 정보 저장하기) [스타트 코딩]
https://www.youtube.com/watch?v=hS54Ex0D1CI&list=PLNO7MWpu0eeUFdGMirV8_EkiLETqj8xA4&index=7
1. 53. stock.py  --> 53. stock Data.xlsx
2. ast_vrfc.py  --> 01. 자산 검증(23.09)_rslt.xlsx   ==> 완료[♥♡]
==============================================================================================================
  
- SK이노베이션8R 신주인수권증서 상장 / 8월 25일 상장 / 1차발행가액 158,900원 / 최대주주 SK의 유상증자 청약 참여여부
https://www.youtube.com/watch?app=desktop&v=1_9ihS_D0fw
==============================================================================================================

- 프로필 메일로 보냄(15시, 집)
1. 메일(insa@wisest.co.kr) 보냄
[잡코리아] [오후 12:53] [잡코리아] ㈜와이즈서텍에서 포지션 제안 도착
■ 기업명 : ㈜와이즈서텍 
■ 응답 만료일: 2023년 09월 12일
■ 제안 포지션: ≪≪ 현대해상 ≫≫ 프로젝트 SI 참여인원 구인의 건
■ 제안내용 상세보기: http://joburl.kr/cHnYn 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2023.09.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>  

- 자체 휴가[★]
- 파이썬 엑셀 다루기 - 불러오기 읽기 쓰기 저장 한방에 총 정리!!! (2편 실시간 주가 정보 저장하기) [스타트 코딩]
https://www.youtube.com/watch?v=hS54Ex0D1CI&list=PLNO7MWpu0eeUFdGMirV8_EkiLETqj8xA4&index=7 
==============================================================================================================
 
- KT 면접(13:20)
진태만 차장님 KT 인터뷰 일정 입니다.
1. 일시 : 9월8일 금  오후1시20분
2. 장소 : 분당 정자동 KT본사 1층 안내데스크앞에서 저한테 전화 부탁드립니다
==============================================================================================================







 ==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 