

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.08) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.08.01(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 농협 바우처 고도화 Prj 투입[★]
04:50 기상
04:55 조식
05:30 집 출발(자전거) => 도림천 => 신림역 => 문래동 사거리 => 경인로 89길 => 김안과 병원 => 영등포 경찰서 사거리
06:30 KnK 디지털타워 도착
06:35 KnK 디지털타워 앞 도보
06:50 KnK 디지털타워 12층에서 도보
08:10 종료
08:20 이디야커피 영등포 knk점 방문 ==> (주) 한국 U2W 최원섭 대리 만남: 계약서 작성(월 800)
		==> 22년 7월부터 비정규직 고용, 산재보험 의무화됨(개인 사업자로 전환하면 안 내도 됨: 고민할 것)
08:40 (주) 한국 U2W 이종호 부장 만남
09:10 KnK 디지털타워 15층으로 이동 ==> (주)웹시 PM과 인사, 여가 개발자 (68년생), 김수환 주인((주) 한국 U2W 정직원)
10:10 이디야커피 영등포 knk점 방문 ==> 커피 개발자 2명( 부장, 김수환 주임: 11,300원: 내가 쏨)
10:40 종료
11:30 태양 생고기 방문 ==> 중식(닭도리탕): 개발자 2명(정운선 부장, 김수환 주임: 7,000원[더치 페이])
12:10 종료
12:15 롯데 마트 맥스 영등포점 방문 ==> 수영복 구경
12:50 귀사
13:00 PC 셋팅 ==> 외부 환경 IP 안 나옴
18:00 퇴근(자전거)
18:40 귀가
18:45 석식
19:00 수종 휴가 간다고 엄마집으로 감(용돈 만원 줌)
19:05 실내 도보
20:00 종료
20:30 샤워 
20:45 인터넷 서핑
22:30 취침 
============================================================================================================== 

- 경기도, 과기부 주관 ‘2022년 취약계층 비대면 라이프케어 플랫폼 구축 공모’ 선정 
https://www.lawissue.co.kr/
==============================================================================================================

- 농식품바우처 - 농식품바우처란? 
- https://www.at.or.kr/fooddream/M000000039/content/view.do\\\

- [농식품] 바우처카드
- http://mafra.nhdream.co.kr/
==============================================================================================================

- 금융만을 위한 젝스 프레임워크(Jexframework) : 웹캐시
- http://korea-sw-eng.blogspot.com/2016/06/jexframework.html
==============================================================================================================

- 웹캐시 회원 가입(농협P)
https://bizplayflow.flow.team/corpsignup.act# --> tamario@naver.com/ asas**12!!
==============================================================================================================

- 현미 쌀 주문[23.08.01(화)]
- 가가호호종합미곡처리장 2020 농사꾼 양심쌀 현미 20kg [1개], 가격: 40,480원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B492924502&frm3=V2
https://www.enuri.com/detail.jsp?modelno=55784927
==============================================================================================================

- 검은 콩 구입[23.08.01(화)]
1. 논앤 밭위드 햇곡 서리태 국산 4kg [1개], 가격: 27,820원 
https://item.gmarket.co.kr/Item?goodscode=2767738337
https://www.enuri.com/detail.jsp?modelno=101866102
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.02(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- 농협 바우처 고도화 Prj[★]
- PC 세팅
1. 외부 PC IP 부여 받음
 1) 권한 여부 안됨 ==> bizplay/ bizplay123!
==============================================================================================================

- 셀 대용량 파일 업로드 개선 분석(김기덕(부장, PL, 농협 바우처P))
1. alert 대신 로그로 표시(DB 생명P 참조)
--------------------------------------------------------------------------------------------------------------------------

- rMate Grid
1. API, Manual
https://demo.riamore.net/HTML5demo/grid/index.html
------------------------------------------------------------------------------------------------

2. 기술 문의
http://www.riamore.net/bbsNew/boards/tech
==============================================================================================================

- 교육(15:30, 김기덕(부장, PL, 농협 바우처P)
1. 농협 바우처 고도화 Prj에 대한 설명
 1) 체계가 안 잡혀 있음: 협업, SM 도움 받기 힘듬
==============================================================================================================

- 커피 타임(16시, 20층 커피샵: 김기덕 부장이 쏨)
1. 프로젝트 전반에 대한 담소
==============================================================================================================

- 비플 제로페이 앱 설치(20시, 집)
http://www.riamore.net/bbsNew/boards/tech
1. 결제 방식: 계좌 연계(신한은행 계좌)
==> CU 모바일 금액권 3만원권(28,800원) 구입(중식 김밥 구입에 활용할 것)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.03(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- 농협 바우처 고도화 Prj[★]
- 주간 회의(10시, 20층 카페): 이종호(부장, PM), 김기덕호(부장, PL), 정운선(부장, 개발), 윤중호(대리, API), 김수환(주임, 개발)
1. WBS 이번주까지 완료 예정(이종호 부장)
2. 다음주 부터 개발 시작
==============================================================================================================

- 개발 환경 설정(김수환 주임이 도와 줌)
1. VOUCHE(개발, AS-IS), Life care) eclipse 설치
2. DB 설지: DB Safer 권한이 안 나와서 DB 사용 불가
==============================================================================================================

- 개발 소스 분석
1. VOUCHE(개발, AS-IS), Life care)
 1) 개발 관련 주석 전혀 없음
==============================================================================================================

-  파일 탐색기 폴더명(23.08.13)
2. D:\01. TAMA_DATA
	■ ==> 01. TAMA Work
		==> 01. Memo
			==> Memo(23년).sql
			==> Memo(2023.08)
			==> T_01.sql		 
		==> 01. Memo Gita Back_up
			==> [★] WA(23.08)
			==> Memo(2022.07)_특수 문자.sql
			==> Memo(2023.07)_샘플.sql		 
		==> 02. Saving_21C
		==> 40. 업무
		==> 41. 회사 업무		 
	■ ==> 02. TAMA Project
		==> 23.04(LG U+ CRM_PDA 현행화 Prj) [41. JAVA T ■]
		==> 23.08(농협 바우처 고도화 Prj) [41. JAVA T ■]	 
	■ ==> 51. TAMA SW
		==> 01. 기본 프로그램
		==> 02. 개발용 프로그램
		==> 03. 추가 프로그램 
	■ ==> 99. Back up_■
		==> 08.14
		==> 2023.08
		==> 9000. 반영 소스(배포)_◀
			==> 08.14
			==> 2023.08
==============================================================================================================

- Tiles 분석
1. 이전 프로젝트 소스 참고
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.04(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- 농협 바우처 고도화 Prj[★]
- 소스 분석
1. 로그인 flow 분석
==============================================================================================================

- node Safer 연결 
1. node Safer 연결 성공(01. 바우처 개발 서버)
2. DB Safer 연결 권한 요청 중(02. Life Care 개발 서버)
==============================================================================================================

- 운영 사이트
01. 바우처(운영S) (전자 바우처 카드 시스템)
www.allvoucher.co.kr/integAdmin/login.jsp  --> admin/nacf120
-------------------------------------------------------------------------------------------

01. 바우처(개발S)
dev-admin.nhdream.co.kr/integAdmin/login.jsp  --> admin/hana119
-------------------------------------------------------------------------------------------

02. Life Care(아동급식 지원 관리자 화면)
https://www.gg.go.kr/bogdream/security/loginProc --> admin/Admin1@
==============================================================================================================

- mybatis package mapper 주석 분석
1. 
-------------------------------------------------------------------------------------------

- Tiles 분석
1. 이전 프로젝트 소스 참고
----------------------------------------------------------------------

- [자바 웹을 다루는 기술] 27.6 타일즈 사용하기
https://www.youtube.com/watch?v=s0TPYUIYo1k
============================================================================================================

- 우드웰 스토리 서랍형 듀얼 모니터 받침대 MT-01, 모니터 받침대, 가격: 3 ,200원
https://www.coupang.com/vp/products/6183775991
============================================================================================================

- 쇼핑
18:00 퇴근(자전거: KnK 지식 센터 15층)
18:40 귀가(수종 휴가 갔다가 귀가)
18:50 집 출발(자전거)
18:55 GS25 신림 석류점 방문 ==> 치킨 도시락(6천원) 구입
19:00 석식(수종)
19:10 실내 도보 
20:00 종료
20:30 집 출발(자전거: 수종) 
20:45 이마트 구로점 방문 ==> 1. 윌스 우드 배트(소, 16,800원), 2. 노 브랜드 쌀밥 한공기(3개,  2,850원)
		3. 노 브랜드 오징어 덮밥(2개,  5,160원) , 4. NB) 모짜치즈볼 380kg(5,280원)   ===> 총: 30,090원
		==> 비플 제로페이 앱으로이미트 모바일 금액권 3만원권(29,100원), 모바일 금액권 5천원권(4,900원) 구입하여 사용(이마트에서는
		결제시 제로파이 결제가 아니라 상품권 결제로 처리해야 함)
21:20 귀가
21:30 샤워
22:00 취침
===============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.05(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:23 기상
06:30 조식(수종: 돈까스 3개, 모짜치즈볼 380kg, 만두 2개)
06:58 집 출발(자전거: 수종, 반팔, 반 바지)
06:10 보라매 공원 도착
06:53 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구): 새로 산 야구 방망이 사용, PT 병으로 라인 긋기
07:45 종료
07:20 물통에 떠 옴(보라매 공원 놀이터)
07:55 귀가
08:20 샤워(찬물)
09:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 실내 도보
12:55 종료 
13:00 수종 귀가
13:20 인터넷 서핑
17:30 석식(수종)
17:45 실내 도보 
19:10 종료
21:20 인터넷 서핑
22:30 취침
===============================================================================================================

- 김치 냉장고 구입(포항집) ==> 총 합계: 777,980원
1. LG전자 디오스 김치톡톡 K227S122 (2023년형) (퓨어), 가격: 652,000원
https://www.tmon.co.kr/deal/20922565434
https://prod.danawa.com/info/?pcode=20363696
============================================================================================================
 
- 전자 레인지 구입(포항집)
1. LG전자 전자레인지 터치식 23L(MW23GD), 가격: 125,980원
http://www.tmon.co.kr/deal/15109118614
https://prod.danawa.com/info/?pcode=4627655 
 
- LG 스마트 인버터 전자레인지 MW23GD(언박싱X내돈내산)
https://www.youtube.com/watch?v=bR1MDZNoBXU

- 전자 레인지 추천 그리고 구매요령 / 가성비 20l, 23l 대용량 제품 비교 / 삼성 엘지 쿠쿠 sk매직 쿠잉전자레인지
https://www.youtube.com/watch?v=VXQbKbvU91w
============================================================================================================

- TAMARIO T 스토리
https://tamario.tistory.com/manage/posts?category=1277649, tamario.tistory.com/
-------------------------------------------------------------------------------------------------------------

- TAMARIO 블로그
https://blog.naver.com/tamario
===============================================================================================================

- 알뜰폰 Hub
https://www.mvnohub.kr/user/prdt/TblUserMadePrdtUsimList.do
https://www.mvnohub.kr/user/prdt/TblUserPrdtPriUsimDetail_tobe.do
===============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.07(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:35 기상
06:54 조식(수종: 오징어 덮밥, 딝강정(중))
07:15 실내 도보(폭염 특보)
08:30 종료
08:50 샤워(찬물)
09:00 인터넷 서핑
10:10 집 출발(자전거: 수종, 반팔, 반 바지)
10:20 진로 마트 방문 ==> 오뚜기 짜슐랭(멀티 5개): 짜장 라면 ==> 총: 3,980원 구입 
10:30 보라매 공원 도착 
10:35 물통에 떠 옴(보라매 공원 놀이터)
10:40 귀가
10:00 인터넷 서핑
11:30 중식(짜슐랭 짜장 라면 3개): 수종
11:45 실내 도보
12:55 종료
13:20 인터넷 서핑
15:50 소나기 잠시 내림
17:30 석식(수종: 오징어 덮밥)
17:50 실내 도보
18:40 종료
20:03 청소(청소기, 밀대)
20:30 샤워(찬물: 체중: 69.4kg ==> BMI: 24.01(과체중))
20:50 인터넷 서핑
22:30 취침
===============================================================================================================
 
- 폴더 또는 해당 폴더에 포함되어 있는 파일이 다른 프로그램에서 열려 있으므로 작업을 완료할 수 없습니다
https://jinibh.tistory.com/entry/%ED%8F%B4%EB%8D%94-%EB%98%90%EB%8A%94-%ED%95%B4%EB%8B%B9-%ED%8F%B4%EB%8D%94%EC%97%90-%ED%8F%AC%ED%95%A8%EB%90%98%EC%96%B4-%EC%9E%88%EB%8A%94-%ED%8C%8C%EC%9D%BC%EC%9D%B4-%EB%8B%A4%EB%A5%B8-%ED%94%84%EB%A1%9C%EA%B7%B8%EB%9E%A8%EC%97%90%EC%84%9C-%EC%97%B4%EB%A0%A4-%EC%9E%88%EC%9C%BC%EB%AF%80%EB%A1%9C-%EC%9E%91%EC%97%85%EC%9D%84-%EC%99%84%EB%A3%8C%ED%95%A0-%EC%88%98-%EC%97%86%EC%8A%B5%EB%8B%88%EB%8B%A4#recentEntries
1. 리소스 모니터 --> CPU(Tab) --> 연결된 핸들: 조회: 클릭
===============================================================================================================

- 짜파게티 vs 짜슐랭 : 짜장라면계 새내기와 노장의 대담 [면식학개론 4장]
https://www.youtube.com/watch?v=62d9nF3RLHE
===============================================================================================================

- 컴퓨터의 전원버튼을 책상위에 만들어보기
https://www.youtube.com/watch?v=zRhyG0ROQSI
===============================================================================================================

- 프리랜서vs사업자, 어떤게 세금 덜 내나요?
https://www.youtube.com/watch?v=hTcA0RHo3Jo

- 3.3% 프리랜서 VS 개인 사업자 뭐가 더 유리할까? feat. 이세연 대표
https://www.youtube.com/watch?v=aEp4Z1CSxdA
0. 노란 우산 공제
1. 사업자 등록시 단점, 세금 게산서 발행(1, 7월 부가세 신고)
2. 사업자 등록시 장점
 1) 창업 감면
 2) 부가세 공제(부가세: 보통 10%)
 3) 사업용 카드 등록
 5) 직원 채용
  가. 건강보험은 지역가입자로 등록됨
==> 프리랜서 소득이 정기적으로 고액 발생하면 사업자를 내는 거 유리(소득 비 정기적, 2천 4백 미만이면 프리랜서 유리)
===============================================================================================================

- 5분이면 끝! PC와 핸드폰으로 사업자등록 신청하는 방법ㅣ스마트스토어ep.1
https://www.youtube.com/watch?v=LTRlnKujBDo
1, 상호: (주) 태마 이노션
2. 일반 과세(세금 계산서 밣생 가능[대부분 업체에서 요구])
3. 사업자 명의 통장 개설: 은행에서 개설: 사업용 인증서(전자 세금계산서 인증서: 4,400원)
4. 현금 영수증 가맹점 등록
5. 사업용 신용카드 발급 
-------------------------------------------------------------------------------------------------

- 사업자등록 전 반드시 확인해야 하는 필수 영상 ! 확인 없이 사업자등록하면 반드시 후회 ~
https://www.youtube.com/watch?v=rn_7O-Kojf4
1. 창업 지역
2. 간이과세, 일반과세
-------------------------------------------------------------------------------------------------

- 프리랜서 개발자 이런분은 개인사업자 등록하세요
https://www.youtube.com/watch?v=SEQM9N06ztU

- 개인사업자의 모든것 (생기초부터~30분이상의 영상김 주의 )
https://www.youtube.com/watch?v=tEzsl6RdcxI
===============================================================================================================

- 절전모드 설정하기, 해제하기
https://www.youtube.com/watch?v=8YLII-mTMx0
----------------------------------------------------------------------------------------------------------------

- 윈도우 10 컴퓨터 종료, 다시 시작, 절전모드, 최대절전모드 바탕 화면에 바로 가기 만들기
https://www.youtube.com/watch?v=1-zVMj4YqtM

1. 최대 절전
powercfg -h on
rundll32.exe powrprof.dll,SetSuspendState 0,1,0

2. 절전
powercfg -h off
rundll32.exe powrprof.dll,SetSuspendState 0,1,0

3. 시스템종료
shutdown.exe -s -t 00

4. 재시작
shutdown.exe -r -t 00 
===============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.07(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 정운선 부장  감리사 교육(1주일), 김수환 주임 휴가, 롯데 빅 마트 방문(12:00, 수영복 구입), 퇴근할 때 비(18시, 우산, 자전거)

- 농협 바우처 고도화 Prj[★]
- 샘플 소스 작성
1. 수급자 관리/meaTrptMng.jsp)
============================================================================================================

- Giid 분석
01. 바우처 사이트: rMate Giid: 유료 버전 사용
51. Life Care: 사이트 IB Sheet 사용
============================================================================================================

- 정전(12:50)
1. 5분 후 다지 복구 --> 메인 단말은 Node Safer 연결 안됨(인터넷 불가) --> 10분 후 해결됨
============================================================================================================

- 플로우(flow) - 대한민국 NO.1 업무용 협업툴
https://flow.team/signin.act, tamario@naver.com, as**12**!!
==============================================================================================================
 
- SW 요청
1. 최서영(주임): Q-Dir, 노트 패드++, VS Cdoe
============================================================================================================ 

- 우드웰 스토리 서랍형 듀얼 모니터 받침대 MT-01, 모니터 받침대, 가격: 32,000원  ==> 주문 고민할 것
https://www.coupang.com/vp/products/6183775991
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.08(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 개발 일정_이종호_05 파일 받음(일정_이종호_05.xlsx), 오태윤 대리에서 스타벅스 머그잔 선물 받음

- 농협 바우처 고도화 Prj[★]
- rMate Grid 샘플 소스 작성
1. 수급자 관리/meaTrptMng.jsp)
 1) 조회 단에서 API 미 존재로 조회 불가
2. 공지 사항 목록(/gongiList.jsp)
============================================================================================================

- ] rMateGrid SyntaxError: invalid syntax 발생 글 작성(21:20, 집]
http://www.riamore.net/bbsNew/boards/tech/52245?sPeriod=&sStartdt=&sEnddt=&sQueryField=T&sQuery=&anonymousPassword=asas1212!!
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.09(수) 작업 ■■■■■■■■■■■■■■`■■■■  
---> 08:00 ~ 18:00 ==> 출근할 떄 도보(05:30, 1시간 20분 소요[비 조금 옴: 상의 비옷, 반바지], 태풍 카눈 북상[21시 서울 통과)
								, 커피(10:30, 오태윤 대리, 위 카페(KnK 타워 20층)), 퇴근할 때 버스(18:05, 신화변원[6514번 버스])

- 농협 바우처 고도화 Prj[★]
- 대시보드(/dashboard) 개발
1. 메뉴(/.Menu.js) 개발
 1) 왼쪽 메뉴 개발
============================================================================================================
 
 - 주간 보고(09:25, 사무실)
 1. 이종호(부장, PM,)이 김수환(주임)에게 개발 일정 때문에 화냄
 ============================================================================================================
  
  - 자바스크립트 DIV 보이기, 숨기기(토글)
 https://m.blog.naver.com/shinekjm/221250995363
 ============================================================================================================

 1. 일반적인 방법
<script> 
$(document).ready(function() {  
	document.getElementById("test").style.display = "none";   ==> 숨기기
	document.getElementById("test").style.display = "block";  ==> 보이기
});
</script> 

<html> 
	<div id ="test" style ="display:none">   : 숨기기 
	<div id ="test" style ="display:block">  : 보이기 
</html> 
-----------------------------------------------------------------------------------------------------------

2. jquery를 이용한 방법
<script> 
	$(document).ready(function() {
		$("#test").hide();   ==> 숨기기 #test=id일경우 .test=class일 경우
		$("#test").show();  ==> 보이기
	});
</script>
 ============================================================================================================

- [서울시] 2023년 08월 주민세(개인분) (정기분) 납부
1.  [카카오페이] [오후 9:07] 납부가 완료되었어요.
- 청구서명 : 2023년 08월 주민세(개인분)
- 납부일시 : 2023.08.10 21:07
- 결제금액: 5,200원(일시불)
- 납부수단 : 현대카드
===============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.11(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 출근할 떄 도보(05:30, 1시간 20분 소요[비 옴: 상의 비옷, 반바지], 퇴근(도보, 비 조금 옴)

- 농협 바우처 고도화 Prj[★]
- 즐겨찾기 등록(/bmb/vucmypg/bkmklng) 개발
1. TB 미 존재: 보류
============================================================================================================
 
- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 팝업: layer 팝업 사용
2. 세션 미 존재(오태윤 대리에게 문의)
 1) 관리자 TB 기준으로 다 생성 해야 함
============================================================================================================

- JSTL변수 ${}를 JSP에서 사용 
<c:set var="webId" value="${_sessionVO.webId}"/>
<% -- <c:out value="${_sessionVO.webId}"/>  --%>
<%

 	out.println("<br><br>[/myinfo.jsp] [마이페이지 화면] [T_01] ■■■■■■ <br><br");   
	out.println("<br><br>[/myinfo.jsp] [웹ID] ■■■■■■ ()]"+ (String)pageContext.getAttribute("webId") );   
%> 

<c:set var="sessionVO_2" value="${_sessionVO}"/> 
<%
 
	out.println("<br><br>[/myinfo.jsp] [로그인 화면] [T_01] ■■■■■■ [세션 정보]"+ (String)pageContext.getAttribute("sessionVO_2") );   
%> 
============================================================================================================

- 원도우 팝업 
lunction goCrdLossReg() {	// 카드분실신고 원도우 팝업 함수
	console.log("/header.jsp] [goCrdLossReg()] [카드분실신고 원도우 팝업] [T_01]");
 
	var winWidth = 810;
	var winHeight =  350;
	var winX = (window.screen.width / 2) - (winWidth / 2);
	var winY = (window.screen.height / 2) - (winHeight / 2);
	var url = '/view/bfnb/mypage/pwdConNrm.popup'; 		// 마이페이지 확인 화면(원도우 팝업) ■■■ 
	var name = 'crdLossReg'; 
	var option ="width ="+ winWidth +",  height= +" winHeight +", left= +" winX +", top= +" winY +", scrollbars=yes, statusbars=yes";
	
	window.open(url, name, option); 
}
============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.12(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:52 기상
07:05 조식(수종: 돈가스 4개)
07:20 실내 도보 
08:10 종료
08:11 집 출발(자전거: 수종, 반팔, 반 바지)
08:20 보라매 공원 도착
08:22 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구)
08:52 종료
08:55 물통에 떠 옴(보라매 공원 놀이터)
09:03 귀가
09:20 샤워(찬물)
09:30 인터넷 서핑
10:40 수종 센터로 감
11:30 중식
11:45 실내 도보
12:55 종료 
13:20 인터넷 서핑
15:25 수종 엄마집에 놀러 감
17:30 석식
17:45 실내 도보 
19:10 종료
20:00 다이소 보라매점 방문 ==> 1. 오렌지 파워 다용도 세정제(600 ml, 2천원), 2. 360도 스마트폰 거치대(2천원)
20:30 보라매점 공원 방문 ==> 쓰레기
21:00 귀가
21:20 인터넷 서핑
23:00 취침
===============================================================================================================

- OCR 처리(이미지를 문자 인식 변환) [23.08.12(토)]
A. Office Lens 핸드폰에 설치 및 OCR(핸드폰에서)
1. Office Lens 어플 실행
 1) 이미지 촬영 ==> 완료
 2) 제목: 00. OB 작업(Unix 명령어)
 3) 저장 위치: 갤러리, PDF: 체크 ==> 저장
 4) 00. OB 작업(Unix 명령어).pdf로 저장됨
 ----------------------------------------------------------------------------------------------------
 
B. pdf 파일 다운로드(PC에서)
1. ALPDF_OCR_Plugin30.exe SW 설치
2. 알 PDFSW 실행
 1) 도구(op 메뉴) > 문자인식(OCR) 
 2) 문자인식(OCR) (새창)
  가. 스캔 옵션
   가) 이미지에서 검색 가능한 텍스로 스캔: 체크 ==> 적용
   나. 00. OB 작업(Unix 명령어)_OCR.pdf 파일로 변환됨
    가) 텍스트 이미지 변환 마우스: 선택
    나) 모두 선택: Ctl + A 
    다) 텍스트 복사: Ctl + C
    라) 붙여넣기: Ctl + V 
==============================================================================================================

- 이미지파일을 검색가능한 PDF문서로 만들기
https://www.youtube.com/watch?v=RFpDQ9w1hRY
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.13(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:35 기상
06:54 조식(수종: 오징어 덮밥, 딝강정(중))
07:15 실내 도보(폭염 특보)
08:30 종료
08:50 샤워(찬물)
09:00 인터넷 서핑
10:10 집 출발(자전거: 수종, 반팔, 반 바지)
10:20 진로 마트 방문 ==> 오뚜기 짜슐랭(멀티 5개): 짜장 라면 ==> 총: 3,980원 구입 
10:30 보라매 공원 도착 
10:35 물통에 떠 옴(보라매 공원 놀이터)
10:40 귀가
10:00 인터넷 서핑
11:30 중식(짜슐랭 짜장 라면 3개): 수종
11:45 실내 도보
13:00 종료 
14:10 수종 귀가
14:15 집 출발(자전거)
14:20 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(1,830원) ==> 총: 13,630원) 구입
14:30 귀가
14:30 인터넷 서핑
17:30 석식(수종): 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
18:40 종료
20:03 청소(청소기, 밀대)
20:30 샤워(찬물: 체중: 69.5kg ==> BMI: 24.01(과체중))
20:50 인터넷 서핑
22:30 취침
==============================================================================================================

- 자전거 탈 때 엉덩이가 아픈 이유와 해결방법 | 안장통 완벽 해결
https://www.youtube.com/watch?v=p0luvg2v1Ls

- 인터넷으로 구매한 안장 교체하는 방법 알려드립니다! 
https://www.youtube.com/watch?v=Jv_J9SzUEvQ
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.14(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 성인 수경(수종 선물: 롯데 빅 마트: 13,000원) 구입

- 농협 바우처 고도화 Prj[★]
- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 세션 정보 수정(프로시저 수정)
==============================================================================================================

- 프로시저 분석@@@ 
- 이것이 오라클 이다 - 10장 1교시 : [Oracle] 저장 프로시저 개념과 형식, 파라미터, PL/SQL 변수[한빛미디어]
https://www.youtube.com/watch?v=ba_mUEJ4qtw&t=4s

- 이것이 오라클이다 - 10장 2교시 : [Oracle] 저장 프로시저 실습, 저장 프로시저 특징
https://www.youtube.com/watch?v=PB6i20Fwas8 
==============================================================================================================

- DBeaver 실행 쿼리 히스토리 보기
https://meyouus.tistory.com/200
==============================================================================================================

- 경기도 포천 글램핑 파인벨리 3호점 목살바베큐&군고구마
https://www.youtube.com/watch?v=fP4FQrG-3aE

- 포천 글램핑 3곳 추천 | 캠핑 초보도 가볍게 떠날 수 있는 서울 근교 글램핑장! 파인벨리 글램핑
https://www.youtube.com/watch?v=JH4wD_F4oX4
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.15(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 공복절[★]
05:56 기상
06:10 조식(수종: 돈가스 3개) 
06:40 집 출발(자전거: 수종, 반팔, 반 바지)
06:50 보라매 공원 도착
06:55 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구): 실외형 물퐁 배너 홈플레이트 앞에 거치
07:27 종료
07:30 물통에 떠 옴(보라매 공원 놀이터)
07:40 귀가
08:20 샤워(찬물)
08:30 인터넷 서핑
11:30 중식(수종: 짜장 라면 2개)
11:45 실내 도보
12:40 종료 
12:50 집 출발(도보: 수종[백팩 2개(세면 도구, 수영 복, 옷, 갤럭시 탭, 충전기 등)])
13:00 은천 지역 아동 센터 도착 ==> 정여정 실장 만남(회비 2만원 납부)
13:10 버스 탑승, 출발
14:40 포천 파인벨리 글램핑 3호점 도착 ===> 숙소(P4)에 집 풀기(김민주 선생 가이드해 줌)
		==> 에어컨, TV, 침대, 냉장고 --> 전자레인지는 공동 사용
15:00 포천 글램핑장 수영장 도착 ==> 수영(자유형, 다이빙): 수종이는 친구(최현빈)와 수영하고 잘 놈
14:20 종료
14:30 숙소에서 쉼(TV 시청)
18:00 고기 굽기 ==> 냉동 삼겹살이라 해동해서 숯불에 굽는데 연기 엄청 남(졍여정 실장이 와서 걱정하고 감)
18:20 석식(수종): 냉동 삼겹살, 음료수 3개, 콜라 2개, 햄 2개, 버섯 야채, 김치 등 제공해 줌
18:50 실내 도보 
20:00 레크레이션 ==> 글램핑장 중앙 마당([사회: 청소년부 담당 김철호 선생], 숨은 그림 찾기, 인물 이름 맞추기 등)
		 --> 수종 발표 잘 함
21:10 종료(컵라면 2개, 얼굴 팩 3개 받아 옴)
21:20 만화 영화 시청 ==> 종료하고 숙소로 들어옴
21:30 샤워
21:40 인터넷 셔핑 ==> 갤럭시 탭으로 검색
22:30 수종 귀가(샤워)
23:00 취침
===============================================================================================================

- 소스 트리
1. 제거(Remove) : 해당 파일을 삭제
2. 폐기(Discard) : 내가 변경한 내용을 처음으로 되돌리는 것

- 소스트리 완벽분해 가이드 (2) Revision - Discard, Reset, Revert
https://devlog-h.tistory.com/9
---------------------------------------------------------------------------------------------------------------------

- GIT2 - SourceTree 버전관리편[생활 코딩]
https://www.youtube.com/watch?v=VeQDmXjbHtQ&list=PLuHgQVnccGMCejd1l8C8oyZSYQDtkMRAg&index=1

- IT2 - SourceTree 버전관리 - 5. 하나의 버전, 여러개의 파일[생활 코딩] ==> 소스 트리
https://www.youtube.com/watch?v=GVODc41QZWw&list=PLuHgQVnccGMCejd1l8C8oyZSYQDtkMRAg&index=6
===============================================================================================================

- [투수 레슨] 선출처럼 "슬라이더" 를 던지는 방법 자세히 알아봅시다!! SCTP
https://www.youtube.com/watch?v=jd2Ys2lntW8
===============================================================================================================

- 완벽하게 삼겹살 굽는 법 : MT, 캠핑, 팬션, 워크샵 필수 시청[숯불]
https://www.youtube.com/watch?v=hkpl35WQAX4
1. 종이컵에 휴지넣고 식용유 좔좔 파이어 => 숯하고 부비부비  => 숯 흰색 되면 준비 끝
2. 고기 굽기전, 호일 물그릇 꽉꽉 채워서 깔고 그위에 그릴 크기 잘 맞춰서 얹혀 놓아 1차 그릴위에 흰숯 놓고 그위 추가 그릴 놓음
3. 2차 그릴 위에 고기 놓고 굽기시작.  굽는중 연기 나기 시작하면 호일 접시로 고기를 덮어 버림 
4. 고기 표면이 심하게 타지만 않을 정도로 익힘 정도 확인하다가 조금씩 잘라보면서 고기 단면에서 핑크빛이 없어졌을때 빼냄 
===============================================================================================================

- 꽁꽁 얼어붙은 냉동고기, 생고기처럼 맛있게 해동하는 법! @생방송 투데이 1945회 20170824
https://www.youtube.com/watch?v=Rz6EwCTl45k
1. 알루미늄 냄비에 따듯한 물을 부은 후 고기를 5분 동안 놔 두면 해동이 됨

- [냉동육 해동 대결] 편의점 1+1 9,900원 부채살 스테이크 실험(6분 해동)
https://www.youtube.com/watch?v=bFC1BNb8Ugg
===============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 공복절[★]
06:51 기상
07:08 조식(수종[컵밥], 컵라면, 삼겹살 남은 것, 햄) ==> 컵밥 2개 제공 받음
07:30 도보(샤인힐 앞 나무 그늘)
08:56 종료
09:11 샤워
09:30 인터넷 셔핑 ==> 갤럭시 탭으로 검색
09:50 수종 샤워
09:50 짐 정리
10:00 보물 찾기
10:30 글램핑장 중앙 마당([사회: 청소년부 담당 김철호 선생], 보물 찾기 시상 --> 수종 보물 찾기 성공해서 비누 받음
11:05 포천 글램핑장 추천 파인벨리 글램핑 3호점 출발 ===> 도보
11:13 버스 탑승, 출발
12:58 평안도 식당 도착
13:10 중식(수종[냉면], 떡 만두 국)
13:37 종료
14:00 귀가
14:06 실내 도보
15:05 종료
15:20 인터넷 서핑 ==> 갤럭시 탭
17:30 석식(수종[컵밥], 컵라면, 햄)
17:50 집 출발(자전거: 수종, 반팔, 반 바지)
18:00 보라매 공원 도착
18:05 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구): 슬라이더 처음 던짐, 구경꾼이 수비수로 같이 참여 함
18:55 종료 
19:05 귀가
19:20 빨래
19:30 샤워(찬물) 
20:30 수종 T셔츠 접은 후 수건으로 감싸서 발로 밟아서 펴기
20:00 인터넷 서핑
22:30 취침
===============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.08.17(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 김수환 주임 철수(18시)

- 농협 바우처 고도화 Prj[★]
- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 세션 정보 수정(프로시저 수정)
2. Oracle SQL Developer으로 함수나 프로시저 실행시 디버깅 요청
 1) Oracle SQL Developer 설치
 2) IP가 방화벽에 막혀사 사용 불가 ==> 오태윤 대리가 DBeaver에서 디버깅 없이 그냥 실행하하고 함
==============================================================================================================
 
 - Oracle SQL Developer으로 함수나 프로시저 실행시 디버깅하기!!
https://m.cafe.daum.net/SWShin/O5y1/33 
 ==============================================================================================================
 
- Oracle] DBeaver 에서는 프로시저를 어떻게 실행시킬까?
https://boomrabbit.tistory.com/237

CREATE OR REPLACE PROCEDURE TEST03(
    IN_USER_ID IN MEMBER.USERID%TYPE,			-- // IN 변수 선언
    OUT_USER_ID OUT MEMBER.USERID%TYPE		-- // OUT 변수 선언
) AS 
--    V_USER_ID varchar2(20);
BEGIN
    SELECT T1.USERID 
    INTO OUT_USER_ID
    FROM MEMBER T1
    WHERE T1.USERID = IN_USER_ID;

--    DBMS_OUTPUT.PUT_LINE('USER_ID : ' || V_USER_ID);
END;
---------------------------------------------------------------------------------------------

DECLARE
    I_USER_ID varchar2(20);		-- // IN 변수 선언
    O_USER_ID varchar2(20);		-- // OUT 변수 선언
BEGIN
    I_USER_ID := 'LSG';

    TEST03(I_USER_ID, O_USER_ID);			-- // 조회
    DBMS_OUTPUT.PUT_LINE('O_USER_ID : ' || O_USER_ID);    
END;

--출력
--O_USER_ID : LSG
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.08.17(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 이종호 책임에게 주말 근무 요청(17:00, 식대[만원 한도] 청구 허락 받음), 자리 이동(17:30, 김수환 주임 자리)

- 농협 바우처 고도화 Prj[★]
- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 조회, 저장 완료
 1) 세부 사항 주말에 완료할 것
============================================================================================================

- 주간 보고
1. 금주(2023. 08월 3주차) 작업분
  1) 대시보드
  2) 회원정보수정
  3) 전체메뉴/즐겨찾기 등록

2. 차주(2023. 08월 4주차) 작업예정
  1) 치료영역조회(거래관리 > 거래조회)
  2) 대상자종합관리(거래관리 > 거래조회)
  3) 기본정보 수정(거래관리 > 거래조회)
  4) 재발급 등록(거래관리 > 거래조회)  
============================================================================================================
 
 - [ORACLE] ORA-00933 SQL command not properly ended 오류 해결
 https://alisyabob.tistory.com/91
- 에러 해결 방법
1. 띄어쓰기 확인
2. 콤마 제대로 썻는지 확인 -> 콤마 위치 확인!!
3. WHERE, FROM 등을 제대로 썻는지 확인 -> WHERE, FROM 위치 확인!!
4. 괄호 확인 -> 괄호 제대로 열고 닫혔는지 확인!!
5. 오타 확인하기
6. spring mybatis에서 세미콜론(;) 있는지 확인 -> 같이 복사가 됐는지 확인!
 ============================================================================================================

- 개구리 개구리 인형 봉제 인형 커밋, 수종 선물, 가격: 17,000원
https://item.gmarket.co.kr/Item?goodsCode=2638469085
============================================================================================================
 
■■■■■■■■■■■■■ 2023.08.19(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주말 근무

- 농협 바우처 고도화 Prj[★]
- 즐겨찾기 등록(/bmb/vucmypg/bkmklng) 개발
1. 즐겨찾기 TB 칼럼 2개 타입이 틀림
2. 기존 GET 방식 ==> POST 방식으로 변경해야 함
============================================================================================================
 
- 주말[★]
05:23 기상
06:20 조식(수종: 돈가스 2개)
06:34 집 출발(자전거: 수종, 반팔, 반 바지)
06:45 보라매 공원 도착 ==> 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구)
07:20 종료
07:20 물통에 떠 옴(보라매 공원 놀이터)
07:25 귀가 
07:30 집 출발(자전거: 반 바지): 안 씻고 감
08:05 출근
08:30 업무
11:20 중식(편의점 도시락, 컵밥 --> 9,600원: CU KT 지식 센터점): 청구할 것
11:45 도보 ==> 롯데 빅 마트
12:55 종료 
13:10 업무
18:00 퇴근
18:05 집 출발(자전거: 반 바지)
18:40 귀가
18:45 석식(수종: 컵밥): 밥, 돈가스
19:05 실내 도보 
20:00 종료
20:20 인터넷 서핑
22:20 취침
===============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.20(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 주말 근무

- 농협 바우처 고도화 Prj[★]
- 대시보드(/dashboard) 개발
1. 1차 개발 완료
============================================================================================================
 
- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 1차 개발 완료
============================================================================================================

- 주말2[★]
05:20 기상
05:52 조식(돈가스: 남은 거)
05:20 집 출발(자전거: 반 바지): 안 씻고 감
06:00 출근
07:10 업무
08:05 수종 엄마집에 놀러감
11:20 중식(편의점 도시락, 짜파구리(3개) --> 7,800원: CU KT 지식 센터점): 청구할 것
11:45 도보 ==> 롯데 빅 마트
12:55 종료
13:10 업무
17:30 퇴근
17:35 집 출발(자전거: 반 바지)
18:05 귀가
18:15 석식(짜파구리: 매움)
18:27 실내 도보
19:18 종료
20:05 수종 귀가
20:10 청소(청소기, 밀대)
20:35 샤워(찬물: 체중: 68.5kg ==> BMI: 23.7(과체중))
20:50 인터넷 서핑
21:20  경비 처리 요청: (주) 한국 U2W 최원섭 대리에 영수증 캡처해서 메일 보냄
		1. 월 말에 일괄적으로 처리되며, 익월 20일쯤 지급될 예정
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■ 2023.08.21(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 도시 가스 점검(18:30, 집)

- 농협 바우처 고도화 Prj[★] 
- 즐겨찾기 등록(/bmb/vucmypg/bkmklng) 화면 개발
1. 기존 GET 방식 개발하기로 함 ==> 이종호 부장 학인해줌
==============================================================================================================

- [Oracle] 오라클 MERGE INTO 사용법 & 노하우 정리
https://gent.tistory.com/406

MERGE INTO TB_MARK AS A 	 --// TB_MARK(변경할 테이블)
USING DUAL		--// DUAL(비교할테이블)
   ON (A.MANGRL_NO = '999999'	--// 관리자 번호
		AND A.PGM_ID = 'MMM'	--// PGM_ID
	)
 WHEN MATCHED THEN	// 01. 조건을 만족할 경우 ■■■
	UPDATE  
	SET A.PGM_ID = 'MMM'	--// PGM_ID
 WHEN NOT MATCHED THEN		// 02. 조건을 만족 안 경우 ■■■
	INSERT (A.EMPNO, A.ENAME, A.DEPTNO)
	VALUES (7788, 'SCOTT', 20)
	;
-----------------------------------------------------------
 
- MERGE문 사용법(DUAL, UPDATE와 INSERT를 한번에)
https://quiz12.tistory.com/114

MERGE INTO TB_MARK AS A // TB_MARK(변경할 테이블)
USING (SELECT 1 AS DUAL) AS B  // DUAL(비교할테이블)
   ON (A.DEPTNO = 50)
 WHEN MATCHED THEN 	// 01. 조건을 만족할 경우 ■■■
   UPDATE
   SET A.DNAME = 'IT'
		, A.LOC = 'SOUTHLAKE'
 WHEN NOT MATCHED THEN 	// 02. 조건을 만족 안 경우 ■■■
   INSERT(DEPTNO, DNAME, LOC) 
   VALUES
   (50
	, 'IT'
	, 'SOUTHLAKE'
	) 
;
--------------------------------------------------------------------------------------------------------

- ORA-00990 에러 발생
https://www.oraexcel.com/database-oracle-19cR1-ORA-00990/lang-ko

데이터베이스: 19c 출시 1
오류 코드: ORA-00990
설명: 권한이 부적합합니다
원인: 오브젝트 특권 또는 비 MAC 시스템 특권이 프로 시저에 부여되었습니다.
조치: PROCEDURE 절을 사용하여 MAC 권한 만 부여하십시오.
==============================================================================================================

- 대상자종합관리(/bmb/vucmypg/main.jsp) 화면 개발
1. 화면, 소스 배치
============================================================================================================

- [jQuery] Div 숨기기 보이기 CSS 컨트롤
https://wecanit.tistory.com/89

1. Show, Hide
보이기 : $("영역").show();
숨기기 : $("영역").hide(); 
2. CSS 컨트롤 (display)
$("영역").css('display', 'none');
$("영역").css('display', 'block');
3. CSS 컨트롤(visibility)
$("영역").css('visibility', 'hidden');
$("영역").css('visibility', 'visible');
============================================================================================================

- 코맥스 비디오폰 세대 음량 설정(현아트빌 비디오폰)
https://www.youtube.com/watch?app=desktop&v=G_w8cRKTUAA
============================================================================================================

 ■■■■■■■■■■■■■ 2023.08.22(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 20:30 ==> 수도 검침 --> 2023년 06월지침[2023.08.22(화)]: 0657 / 사용량 4㎥, 야근( ~ 20:30, 청구할 것): 퇴근 전에 소나기

- 농협 바우처 고도화 Prj[★]
- 개발 서버에 소스 반영
1. 반영 화면
 1) 대시보드, 2) 회원정보수정, 3) 전체메뉴/즐겨찾기 등록, 4) 세션 처리 소스 반영
==============================================================================================================

- 개발 서버에서 단위 테스트
1. 에러 많이 지적 받음: 이종호 부장, 김기덕 부장
==============================================================================================================

- 회원정보수정(/bmb/vucmypg/bkmklng) 개발
1. 수정 사항 수정
==============================================================================================================

- Grid 변경 결정
1. 비즈플레이(주)가 rMate Grid에서 IB SHEET로 변경한다고 결정함
 1) 사유:  rMate Grid SW 비용이 휠씬 비싸다고 함 ==> 희 소식
==============================================================================================================
 
- 피팅 혼자서도 할수있을까?
https://www.youtube.com/watch?v=YIrYmh1nSXg
==============================================================================================================
 
- 모바일 금액권 5만원권(28,000)원 구입
1. 비플 제로페이 앱으로 CU 모바일 금액권 5만원권(28,000)원 구입: CU 편의점 중식용
==============================================================================================================

■■■■■■■■■■■■■ 2023.08.23(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 20:30 ==> 출근시 보슬비(05:20, 도림천 출입 통제)), 남부초 개학(09시, 진수종 4학년), 야근( ~ 20:30, 청구할 것, 영등포역으로 자전거 운전):

- 농협 바우처 고도화 Prj[★]
- 
==============================================================================================================

- [Javascript] 패턴형식 정규식 체크하기(전화번호, 이메일)
https://redcow77.tistory.com/641

// 패턴 정규표현식
// 전화번호 정규식표현식
var telRegex1 = /\d{3}-\d{4}-\d{4}/; 
//(\d는 숫자를 의미하고, {} 숫자갯수를 의미합니다.)

// 휴대폰 정규식표현식
var telRegex2 = /^01([0|1|6|7|8|9])-?([0-9]{3,4})-?([0-9]{4})$/;

// 이메일 정규식표현식
var emailRegex = /^[0-9a-zA-Z]([-_\.]?[0-9a-zA-Z])*@[0-9a-zA-Z]([-_\.]?[0-9a-zA-Z])*\.[a-zA-Z]{2,3}$/;

// 소수점 정규표현식(x.x.xxxx)
var verRegex = /^([0-9]{1})*\.([0-9]{1})*\.([0-9]{4})$/;
--------------------------------------------------------------------------------------------

console.log(telRegex1.test('010-1111-2222'));
console.log(telRegex2.test('00-11-2222'));
console.log(emailRegex.test('aaa@naver.com')); 
console.log(verRegex.test('3.5.1111')); 
==============================================================================================================

■■■■■■■■■■■■■ 2023.08.24(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 출근시 보슬비(05:20, 도림천 출입 통제:난간 넘다가 넢어져 바지 젖음)

- 농협 바우처 고도화 Prj[★]
- 개발 서버에 소스 반영
1. 반영 화면
 1) 회원정보수정, 2) 전체메뉴/즐겨찾기 등록 소스 반영
==============================================================================================================

- 2023 추석 기차표 예매(09시, 회사)
https://korailtalk.co.kr/748
1, 8/29(화)	09:00~15:00
2. 특별대수송기 간 : 2023.9.27(수) ~ 10.3(화), 7일간
1) 23년 추석은 9월 29일(금)입니다.
==============================================================================================================

■■■■■■■■■■■■■ 2023.08.25(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- 농협 바우처 고도화 Prj[★]
- 개발 서버에 소스 반영
1. 회원정보수정 소스 반영
==============================================================================================================

- 윈도우 10 비멀번호 변경'
1. [Windows Key] + [I]를 눌러 WIndows 설정창에 들어간 뒤 계정 버튼을 누름
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.26(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:23 기상
06:30 조식(수종: 돈까스 3개, 모짜치즈볼 380kg, 만두 2개)
06:58 집 출발(자전거: 수종, 반팔, 반 바지)
06:10 보라매 공원 도착
06:53 수종이랑 보라매 공원 운동장에서 야구(타격, 수종 투구): 새로 산 야구 방망이 사용, PT 병으로 라인 긋기
07:45 종료
07:20 물통에 떠 옴(보라매 공원 놀이터)
07:55 귀가
08:20 샤워(찬물)
09:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 실내 도보
12:55 종료 
13:00 수종 귀가
13:20 인터넷 서핑
17:30 석식(수종)
17:45 실내 도보 
19:10 종료
21:20 인터넷 서핑
22:30 취침
===============================================================================================================
 
■■■■■■■■■■■■■■■■■■■■■■■ 2023.08.27(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:35 기상
06:54 조식(수종: 오징어 덮밥, 딝강정(중))
07:15 실내 도보(폭염 특보)
08:30 종료
08:50 샤워(찬물)
09:00 인터넷 서핑
10:10 집 출발(자전거: 수종, 반팔, 반 바지)
10:20 진로 마트 방문 ==> 오뚜기 짜슐랭(멀티 5개): 짜장 라면 ==> 총: 3,980원 구입 
10:30 보라매 공원 도착 
10:35 물통에 떠 옴(보라매 공원 놀이터)
10:40 귀가
10:00 인터넷 서핑
11:30 중식(짜슐랭 짜장 라면 3개): 수종
11:45 실내 도보
12:55 종료
13:20 인터넷 서핑
15:50 소나기 잠시 내림
17:30 석식(수종: 오징어 덮밥)
17:50 실내 도보
18:40 종료
20:03 청소(청소기, 밀대)
20:30 샤워(찬물: 체중: 69.4kg ==> BMI: 24.01(과체중))
20:50 인터넷 서핑
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■ 2023.08.28(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- 농협 바우처 고도화 Prj[★]
- 개발 서버에 소스 반영
1. 회원정보수정 소스 반영
==============================================================================================================


 
 
 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 