 

- 정보처리기사 - 디버깅은 미친짓이다
https://www.youtube.com/watch?v=F0GVdNN08eY
==============================================================================================================
==============================================================================================================

 
- 크롬 개발자 도구 - 자바스크립트 디버깅[생활코딩]
https://www.youtube.com/watch?v=ZdBv8h5Jteo 

- 크롬 개발자 도구 2 - 엘리먼츠[생활코딩]
https://www.youtube.com/watch?v=9fkLXo-ALc0

- 크롬 개발자 도구 5 - sources(디버깅) [생활코딩]
https://www.youtube.com/watch?v=L52UucF_y0U&t=5s
==============================================================================================================

- 크롬 개발자 도구 - 리모트 디버깅 (1/2)
https://www.youtube.com/watch?v=cJGJNP-0HJM
==============================================================================================================
  

- track1 03. 지적 프로그래밍을 위한 넓고 얇은 습관/ 카카오 서지연[한빛미디어]
https://www.youtube.com/watch?v=aP9mhLBJMLw
==============================================================================================================
 
 
 