

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.08.01(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 12:00 ~ 20:40 
   
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. 서버에서 재고 DATA(jego.mdb)파일 PDA로 보내기 
2. PDA에서 재고 조회, 실재고 수량 등록(T_GEGO_ITEM_DTL, T_GEGO_LOCATION) 
3. PDA에서 로케이션별 바코드 DATA 서버로 전송 
4. 서버에서 DATA 받아서 로케이션별 txt 파일 생성(ex)501-D.txt) 
5. 통합에 로케이션별 파일(.txt) 등록 
6. PDA에서 로케이션별 실재고 수량 DATA 서버로 전송(T_GEGO_LOCATION) 
-------------------------------------------------------------------------------------------------------------- 

T_GEGO_ITEM_DTL: 재고 실사 상세 정보 Table 
T_GEGO_LOCATION: 재고 로케이션 정보 Table 
==============================================================================================================

-- 위치별 상품 정보 입력 @@@@@@@@@@@@@ 
SELECT 
  T_STOCK_INQUIRY_TEMP.COMPANY_CD, 
  T_STOCK_INQUIRY_TEMP.MERCHANT_CD, 
  T_STOCK_INQUIRY_TEMP.INQUIRY_DT, 
  T_STOCK_INQUIRY_TEMP.INQUIRY_NO, 
  T_STOCK_INQUIRY_TEMP.ITEM_CD, 
  T_STOCK_INQUIRY_TEMP.LOCATION_CD, 
  T_STOCK_INQUIRY_TEMP.LOCATION_SEQ, 
  T_STOCK_INQUIRY_TEMP.LOCATION_NM, 
  T_STOCK_INQUIRY_TEMP.BARCODE, 
  QTY, 
  T_STOCK_INQUIRY_TEMP.INQUIRY1_QTY, 
  (CASE 
  WHEN AA.STOCK_INPUT_STS = '01' OR AA.STOCK_INPUT_STS = '02' THEN 0 
  WHEN AA.STOCK_INPUT_STS = '03' THEN 0 
  ELSE INQUIRY2_QTY 
  END) INQUIRY2_QTY, 
  (CASE 
  WHEN AA.STOCK_INPUT_STS = '01' OR AA.STOCK_INPUT_STS = '02' THEN 0 
  WHEN AA.STOCK_INPUT_STS = '03' OR AA.STOCK_INPUT_STS = '04' THEN 0 
  WHEN AA.STOCK_INPUT_STS = '05' THEN 0 
  ELSE INQUIRY3_QTY 
  END) INQUIRY3_QTY, 
  T_STOCK_INQUIRY_TEMP.IN_USER_ID1, 
  T_STOCK_INQUIRY_TEMP.IN_USER_ID2, 
  T_STOCK_INQUIRY_TEMP.IN_USER_ID3, 
  T_STOCK_INQUIRY_TEMP.REG_ID, 
  T_STOCK_INQUIRY_TEMP.REG_IP, 
  T_STOCK_INQUIRY_TEMP.REG_DT, 
  T_STOCK_INQUIRY_TEMP.UP_ID, 
  T_STOCK_INQUIRY_TEMP.UP_DT, 
  T_ITEM.ITEM_NM, 
  T_ITEM.DEPART1_CD, 
  (SELECT DEPART1_NM FROM T_DEPART1 
   WHERE COMPANY_CD = T_ITEM.COMPANY_CD AND DEPART1_CD = T_ITEM.DEPART1_CD) AS DEPART1_NM, 
  T_ITEM.MODEL_NM, 
  T_ITEM.UNIT_CD, 
  (SELECT CODE_NM FROM T_BASECODE 
   WHERE GROUP_ID = ' + CodeConstants.UNIT_CD + ' AND CODE = T_ITEM.UNIT_CD ) AS UNIT_CD_NM, 
  T_ITEM.ITEM_SPEC, 
  T_ITEM.MFG_NM 
FROM T_STOCK_INQUIRY_TEMP, T_ITEM, 
   ( 
    SELECT * FROM T_STOCK_INQUIRY_LOCATION 
    WHERE COMPANY_CD = '01' 
    AND MERCHANT_CD = '0001' 
    AND INQUIRY_DT = '20040728' 
    AND INQUIRY_NO = '00001' 
    AND LOCATION_CD = '501-D' 
   ) AA 
WHERE T_STOCK_INQUIRY_TEMP.COMPANY_CD = T_ITEM.COMPANY_CD 
      AND T_STOCK_INQUIRY_TEMP.ITEM_CD = T_ITEM.ITEM_CD 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.02(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 
   
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. 서버에서 재고 DATA(jego.mdb)파일 PDA로 보내기 
2. PDA에서 재고 조회, 실재고 수량 등록(T_GEGO_ITEM_DTL, T_GEGO_LOCATION) 
3. PDA에서  재고실사 마스타  Table(T_STOCK_INQUIRY) 등록 
4. PDA에서 로케이션별 바코드 DATA 서버로 전송 
5. 서버에서 DATA 받아서 T_STOCK_INQUIRY, T_STOCK_INQUIRY_DTL  
   T_STOCK_INQUIRY_TEMP 등록 
6. T_STOCK_INQUIRY_DTL 실재 수량 수정  
7. PDA에서 T_GEGO_LOCATION 테이블 삭제 
-------------------------------------------------------------------------------------------------------------- 

T_GEGO_ITEM_DTL: 재고 실사 상세 정보 Table 
T_GEGO_LOCATION: 재고 로케이션 정보 Table 
==============================================================================================================

dlog("[temStockMgrBean.java]:[getStockInquiryTempList()]"+ SQL); 
dlog("[temStockMgrBean.java]:[p_company_cd]"+ (String)inputHash.get("p_company_cd") +"[p_inquiry_no]"+ (String)inputHash.get("p_inquiry_no") + 
"[p_inquiry_dt]"+ (String)inputHash.get("p_inquiry_dt")); 
==============================================================================================================

권용현 GM  011-817-2245 053)744-1388 *@*.* 
조항래 회원 4539341297617920 CVS:515 5580 3good/570513 
*-1463214 2006/12 rea5005/jo1300 
----------------------------------------- 

- 한미VISA카드 결제 안 됨 =====> 안심 결제 
신용카드 번호, 유효기간 확인 
CAVV 오류(인증오류) 에러 ==========>  
한미은행 카드는 안심클릭시 결제금액이 0으로 들어가면 에러가 남 
--------------------------------------------------------------------------------------------------------------- 
  
- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ID: ith3597 pass: 3597 02)2187-2778 윤정호 ---> 526-8328 안창석 
R&F ==> ID: its2023 pass: its2023 ID: itp3596 pass: 3596   
==============================================================================================================

State 속성(Winsock 컨트롤) 
sckClosed 0 기본 값. 닫혀 있음  
sckOpen 1 열려 있음  
sckListening 2 수신 대기 중  
sckConnectionPending 3 연결 보류 중  
sckResolvingHost 4 호스트 고정 중  
sckHostResolved 5 호스트 고정 완료  
sckConnecting 6 연결 중  
sckConnected 7 연결 완료  
sckClosing 8 피어가 연결을 닫고 있음  
sckError 9 오류  

여기서 수신 대기중은 서버측에서 클라이언트를 기다릴때 이런 상태가 됩니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.03(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 
   
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. 서버에서 재고 DATA(jego.mdb)파일 PDA로 보내기 
2. PDA에서 재고 조회, 실재고 수량 등록(T_GEGO_ITEM_DTL, T_GEGO_LOCATION) 
3. PDA에서  재고실사 마스타  Table(T_STOCK_INQUIRY) 등록 
4. PDA에서 로케이션별 바코드 DATA 서버로 전송 
5. 서버에서 DATA 받아서 실사일자(INQUIRY_DT), 실사번호(INQUIRY_NO)별 
T_STOCK_INQUIRY, T_STOCK_INQUIRY_TEMP 생성  
6. PDA에서 T_GEGO_LOCATION 테이블 삭제 
-------------------------------------------------------------------------------------------------------------- 

T_GEGO_ITEM_DTL: 재고 실사 상세 정보 Table 
T_GEGO_LOCATION: 재고 로케이션 정보 Table 
==============================================================================================================

- 오라클 에러 
ORA-00947: not enough values  ==> 컬럼 수가 안 맞아서 나는 에러 
==============================================================================================================

- 기초재고작성(/BizMgr/ItemStockMgr/stockInquiryP.jsp) 
p_REG_UP_DT = Format(Now(), "YYYY-MM-DD HH:MM:SS")  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.04(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 
   
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. Grid 바코드와 입력한 바코드가 중복 입력 안됨 
2. 로케이션 정보 Table(T_LOCATION) 생성: 로케이션별 조회를 위해(GROUP BY 불가능) 
3. 로케이션 정보 삭제(Grid 선택시 삭제) 
==============================================================================================================

- 여름 휴가 2004.08.18(수) ~ 21(토) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.08.05(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 
   
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0 
==============================================================================================================

- 폼 닫기(Form_Activate()로 처리) 
Public Const WM_CLOSE = &H10 
Public Declare Function SendMessage Lib "Coredll" Alias "SendMessageW" (ByVal hwnd As Long, ByVal wMsg As Long, 
ByVal wParam As Long, lParam As Long) As Long  

Public Sub Unload(frmObj As Form) 
    Call SendMessage(frmObj.hwnd, WM_CLOSE, 0, 0) 
End Sub  
==============================================================================================================

- 데이타 전체 삭제 @@@@@@@@@@@@@@@@@@@@@ 
'데이터베이스 연결  ===========> 
Set Dbcon = CreateObject("ADOCE.Connection.3.1") 
Set rs = CreateObject("ADOCE.Recordset.3.1") 
Dbcon.Open "data source=" & Datafile_path   'DB 파일 경로 

SQL = "SELECT * FROM T_GEGO_LOCATION "    '재고 로케이션 정보 Table  =========> 
SQL = SQL & " WHERE LOCATION <>''"  
rs.Open SQL, Dbcon, adOpenKeyset, adLockOptimistic 

If Not rs.EOF Then  '데이타가 존재하면 
Do While Not rs.EOF 
    rs.Delete 
    DEL_done = "모두" 
    MsgBox "로케이션에 해당하는 바코드를 삭제 했습니다. " 
rs.MoveNext 
Loop 

rs.Close 
Set rs = Nothing 
End If 
==============================================================================================================

- // 재고조사시 일마감 작업을 선 수행한다. ====> 
CLOSESQL = "" 
CLOSESQL = "SELECT PKG_SUBUL_MAGAM.DAY_SUBUL_MAGAM ( '01', '9001',TO_CHAR(SYSDATE, 'YYYYMMDD') ) AS RET_TEXT FROM DUAL " 
Debug.Print "[Inquiry_Insert_UP()]:[CLOSESQL]" & CLOSESQL 
Set RS = Conn.Execute(CLOSESQL) 
====================================================== 


-  PKG_SUBUL_MAGAM.DAY_SUBUL_MAGAM 에서 @@@@@@@@@ 
 일별 수불장 시행 일자 VAR_SUBUL_DATE = '20040805' 
실재 크론잡 시행 일자(매일 2시 1분) VAR_SUBUL_DATE = '20040806' 

 --마감일자가 오늘날짜이면 상품의 현재고 UPDATE 
#DAY_SUBUL_MAGAM ( '01', '9001',TO_CHAR(SYSDATE, 'YYYYMMDD') ),   ==========> 수동 조회 
DAY_SUBUL_MAGAM('01', '0002', TO_CHAR(SYSDATE -1, 'YYYYMMDD'))  ==========> cron_job 
'IF TO_CHAR(SYSDATE - 1, 'YYYYMMDD') = VAR_SUBUL_DATE THEN 
'IF VAR_SUBUL_DATE >= TO_CHAR(SYSDATE - 1, 'YYYYMMDD')  THEN   '오늘날짜로 잡아야 함  ==========> 
UPDATE T_MERCHANT_ITEM A SET NOW_STOCK = 
     NVL( 
       ( 
SELECT JEGO_QTY --조정 수량 
FROM T_DAY_SUBUL  
WHERE  
COMPANY_CD = VAR_COMPANY_CD AND  
MERCHANT_CD = VAR_MERCHANT_CD AND 
SUBUL_DATE = VAR_SUBUL_DATE AND  
ITEM_CD = A.ITEM_CD 
  ), 0 
) 
      WHERE 
      COMPANY_CD = VAR_COMPANY_CD AND  
      MERCHANT_CD = VAR_MERCHANT_CD; 

END IF; 
==============================================================================================================

-- 일별 수불장 장부 재고의 합 조회 @@@@@@@@@@@ 
SELECT SUM(A.NOW_STOCK) 
FROM T_MERCHANT_ITEM A,  T_DAY_SUBUL B 
WHERE A.COMPANY_CD = B.COMPANY_CD 
      AND A.MERCHANT_CD = B.MERCHANT_CD 
      AND A.ITEM_CD = B.ITEM_CD 
      AND A.COMPANY_CD =  '01' 
      AND B.SUBUL_DATE =  '20040804'; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.06(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 
   
- 쇼핑몰 수정
- 결제 루트 수정 
신용카드 결제 수정(데이타 저장 후 결제) 
ORDER_STS: 주문상태(02: 접수취소) 
==============================================================================================================

- 한미 카드, 공인 인증서 서비스 중지 공지 
/order/orderPutP_1.jsp ==> /popup/popup_card_stop_alert.html 
==============================================================================================================

- 결제: 일을 처리하여 끝을 냄. 2. 증권 또는 대금의 수불(受拂)에 의하여 매매 당사자 간의 거래 관계를 끝냄 
납품 대금의 결제 ./어음의 결제 . ...(신용카드 결제) 
 결재: 상관이 부하가 제출한 의안을 헤아려 승인함 
==============================================================================================================

수고많으십니다~ 다름이 아니라  이번에 개편된 노블레스몰에 
b2b건으로 문의드립니다~ 

- b2b 중 자동차보험 견적을 의뢰하기위해 로그인할려는데 
로그인시 등록되지않는 id , 아이디 분실시 id분실 이용하라는  
문구뜨고 아이디 등록할려면  이미 가입된 주민번호라고뜨고  
가입안되었습니다~  id분실하여 찾기해도 실행이 안되네요~ 
성함: 윤 숙  *  
아이디: 584006   주민번호: 520000-0 

=====> E-비즈메카에 문의 
==============================================================================================================

- TM에서 인터팍스 삭제 
10년 후 한국 ==> 공병호 해냄 출판사  만원 
==============================================================================================================

- [개인 컴퓨터 HDD 용량] 
C:\  40GB D:\  40GB E:\  20GB 
이동 HDD 용량 40GB 
[회사 컴퓨터 HDD 용량] 
C:\  80GB 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.07(토) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 19:00 
   
- 쇼핑몰 수정
- 신용카드 결제 순서 분석 
문서 작성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.09(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 
   
- 쇼핑몰 수정
- 신용카드 결제 순서 수정  
 주문상태(00: 카드주문전) 
 01000120040808 00001 
==============================================================================================================

- 팬티엄에서 Oracle 패치 
case1. 
오라클에서 패치를 받아서 해결하는 방법( 해보지 않아서 잘 모르겠음) 
case2. 
1. 디렉토리를 하나 만들어서 설치 CD를 하드디스크로 몽땅 카피한다. 
2. 카피된 내용중에 symcjit.dll파일을 찾기로 찾는다. 
3. 위 파일의 파일명을 적당히 다른이름으로 바꾼다.(아무 이름이나...) 
4. /O8iNT816/install/win32/setup.exe를 실행하여 설치한다. 
==============================================================================================================

- 식사 배달(식사주문) 
오센드: 745-5565 청우: 745-6055 
매일반점: 751-5404 미도반점: 755-7524 대흥각: 753-3988 춘천각: 752-5100 
와인 삽겹살집  053)743-4442 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.08.10(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:40 
   
- 쇼핑몰 수정
- 신용카드 결제 순서 수정
 주문상태(00: 카드주문전) 
 01000120040808 00001 
==============================================================================================================

- 재고 조정 등록(/BizMgr/ItemStockMgr/stockAdjustMainP.jsp) 
00148347 
p_adjust_dt: 조정일자 p_adjust_cl_dt: 재고조정분류 코드    
==============================================================================================================

- 월별 매출 분석 
/MLM관리/분석관리/수당기준매장별매출  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.11(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 
   
- PDA 서버 설치
- '6' 런타임 오류 발생 오버플로 
- '56' 런타임 오류 발생 파일을 찾을 수가 없습니다.         /adoliltr.dll 
==============================================================================================================

그냥 간단하게 timer를 돌렸습니다.. 
버퍼에 데이터가 쌓이면 무조건 갖고와서 화면에 뿌리고 
파일로 저장하고...  
그러니까 데이터가 무사히 잘 저장되더군요.... 
한번 알려주신 방법으로도 해봐야겠어요 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.12(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 23:00 
   
- PDA 서버 설치
- mdb에서 cdb 전환 에러
Public Declare Function DESKTOPTODEVICE Lib "c:\program files\Microsoft ActiveSync\adofiltr.dll" _ 
(ByVal desktoplocn As String, _ 
ByVal tablelist As String, _ 
ByVal sync As Boolean, _ 
ByVal overwrite As Integer, _ 
ByVal devicelocn As String) As Long  

result = DESKTOPTODEVICE("d:\kyh\test\nwind.mdb", _ 
        "", False, True, "\Storage Card\Map\Facilities\nwind.cdb") 

If result <> 0 Then MsgBox "An error occurred transferring the data"  

이렇게 하면 PC의 MDB파일이 PDA로 잘 복사되고 PDA에서 ado로도 잘 읽힙니다. 
==============================================================================================================

엑티브 싱크 다시 깔고 PDA와 PC를 아무리 껏다 켜고 해도 싱크가 걸리질 않네요,,, 
어떻게 해야 하죠?? 
iPaq을 크래들에 꼽으면 하드워어 분리 꺼내기 아이콘이 시작 표시줄에 표시가 되긴 하는데요,,, 
엑티브 싱크가 인식을 못하네요,,, 
제발 방법좀,,,  
-------------------------------------------------------------------------------------------------------------------

크래들에 꽂았다가 뺐다가 자주하시죠? 
어떤 사람의 말을 인용하면 크래들에 볼록튀어 나온부분하고 PDA하고 계속 꽂았다 뽑았다하면  
마모가 생긴다고 하네요.. ㅡㅡ? 
사실인지 아닌지는 그 회사에 문의를 안해봐서 잘 모르고요... 
암튼... 저도 자주 그런 현상이 생기는데... 
분리 꺼내기 아이콘이 생기면 크래들에서 다시 뽑았다가 다시한번 꽉(!!) 꽂아 보세요.. ㅡㅡ; 
전 이렇게 해결했습니다. 좀 무식하죠 ^^; 
헉 그러고 보니 나도 나중에 저런현상이 생기는건 아닌지.. 나도 iPaq 제품인데.. ㅡ.ㅡ? 
암튼 참고도 안되는 잡담거리였습니다. ^^; 
-------------------------------------------------------------------------------------------------------------------

으흐,,, 역시 안되는군요,,, ㅡㅡ;; 
결국 A/S 받아왔구요,,, 
메인 보드 이상이랍니다,,, ㅡㅡ 
혹시 이런일 생기시면 보드 쪽 이상인지 A/S 받아 보세요,, 
==============================================================================================================

TAMA 컴퓨터 드라이버 
- Intel(R) PRO/100 VE 
- RADEON 9200 
- Sound MAX Intergrated Digital Audio 
==============================================================================================================

액티브 싱크 프로그램은 "c:\program files\Microsoft ActiveSync\adofiltr.dll" 에 설치가 분명히 되어 있고요. 
C:\Program Files\PDA\TEST_File 디렉토리에 TEST.mdb 파일이 분명히 존재 합니다. 
만약 TEST_22.mdb라고 파일 경로를 바꾸면 파일이 존재하지 않는다고 에러가 뜹니다. 
도저히 이해가 안 되는 군요. 
 ==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.13(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 08:00 
   
- PDA 서버 설치
- mdb에서 cdb 전환 에러 
서버 PC에서 Active Sync 설치시 동기화를 잡을 때 MS Access 파일 동기화를 꼭 시켜 줘야 함. 
==============================================================================================================

- 소켓 통신 데이타 전송 에러 
많은 통신 데이타를 한꺼번에 보내지 못 함 
--> 하나씩 끊어서 보내야 함 
==============================================================================================================

TCP/IP의 특성입니다.. 
그런경우 때문에.. 패킷을 보낼때.... 패킷앞에 미리 정의해놓은 헤더를 붙여서 같이 보내는데요.. 
길이 + 내용 
이런식으로 보냅니다.. 

물론 이것도 연속적으로 보내면 받는 입장에서..는 
길이 
내용+길이 
내용 
이런식으로 받아질 수도 있습니다.. 

때문에 받는 쪽에서는 일단 데이타를 받자마자 처리하지 마시고... 
임시로 버퍼에 저장하셨다가.. 
헤더(길이) 읽고, 그만큼의 내용을 읽고...처리하는 방식을 권장합니다.. 
==============================================================================================================

이곳 자료실,강좌와 팁인지 모르겠는데.. 
그곳에 winsock  control에 관한 강좌에서 그부분에 대해서  
언급하고 있습니다.한번 찾아보세요.. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.14(토) 작업 ■■■■■■■■■■■■■■■■
---> 00:00 ~ 19:30 
   
- PDA 수정
- 소켓 통신 데이타 전송 에러(WinSock1.SendData) 
많은 통신 데이타를 한꺼번에 보내지 못 함 
--> 하나씩 끊어서 보내야 함 
==============================================================================================================

- 반품접수에서 물품회수완료(22)  ===> 반품 접수 상태(23)  
<반품번호 : 00426> 환불금계산 완료 상태 
20040813, 김영기, 010001 20040813 00409, 20040813 

- 반품관리/반품회수취소 
미회수버튼을 누르면 
반품상태가 물품회수 대기(21) 에서 물품회수완료(22) 으로 변경 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.08.15(일) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 19:30 
   
- PDA 수정
- 소켓 통신 데이타 전송 에러(WinSock1.SendData) 
많은 통신 데이타를 한꺼번에 보내지 못 함 
--> 하나씩 끊어서 보내야 함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.16(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 
   
- 쇼핑몰 수정
- 신용카드 결제 순서 수정 
주문상태(00: 카드승인오류) 
01000120040808 00001 
==============================================================================================================

- 행번호 표시 
JAVA/모양(N)/편집기--> 행번호 표시(E) 체크 
==============================================================================================================

- 'PDA==> PC로 데이타 전송 
Public Declare Function DEVICETODESKTOP  Lib "c:\program files\Microsoft ActiveSync\adofiltr.dll" _ 
(ByVal desktoplocn As String, _ 
  ByVal tablelist As String, _ 
  ByVal sync As Boolean, _ 
  ByVal overwrite As Integer, _ 
  ByVal devicelocn As String) As Long 

'파일 전송 시작(PDA로 파일(jego.cdb) ==> PC의 MDB파일(jego_done.mdb)로 복사)  
 result = DEVICETODESKTOP(App.Path & "\Jego_File\jego_done.mdb", _ 
            "T_GEGO_LOCATION..", False, True, "\My Documents\jego.cdb")  
==============================================================================================================

- http://i3shop.webhard.co.kr 
id:i3shop pw:9111 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.17(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 
   
- 쇼핑몰 수정
- 신용카드 결제 순서 수정 
주문상태(00: 카드승인오류)  ===> (03: 결제완료) 
------------------------------------------------------------------------------------------------------------- 

- 결제 실서버 등록 
/bean/CartBean.java 
/ejb/OrderSvc/OrderSvcBean.java 
 ==============================================================================================================
  
- 주문 내역 조회 수정 
http://int.i3shop.com/BizMgr/SaleMgr/WebOrderMgr/orderP.jsp 
/SaleMgr/SaleMgrBean.java 
WSQL += "\n AND ORDER_STS <>'00'  \n"; //주문상태가 카드승인 오류(00)가 아닌 것 
==============================================================================================================

SELECT * FROM T_BASECODE 
      WHERE GROUP_ID = 'G378' 
ORDER BY CODE; 

UPDATE T_BASECODE 
SET CODE_NM ='기타' 
WHERE CODE ='00' 
 AND GROUP_ID= 'G377' 
------------------------------------------------------------------------------------------------------------- 

G377 00 카드승인오류 
G377 01 호스팅비결제 
G377 02 임의등록 
G377 03 이벤트 
G377 04 회원요청 
==============================================================================================================

-- 주문 내역 조회 @@@@@@@@@@@@@@ 
SELECT ORDER_STS 
FROM T_ORDER 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040830' 
  AND ORDER_NO= '00281' 
  --AND MEM_ID ='yhs0814' 
  --AND ORDER_STS = '20' 
  ; --//주문상태(반품신청:21, 반품접수:22, 반품신청취소:20, 물품회수완료:23) 
---------------------------------------------------  COMMIT 

-- 주문 내역 수정  @@@@@@@@@@@@@@ 
--UPDATE T_ORDER 
SET ORDER_STS = '21'       -- 주문상태(반품신청:21) 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040830' 
  AND ORDER_NO= '00281'; 
------------------------------------------------------------------------------------------------------  COMMIT 

-- 주문 내역 수정  @@@@@@@@@@@@@@ 
--UPDATE T_ORDER 
SET ORDER_TP = '03'       -- 주문유형(01:정상주문, 03:반품주문) 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040830' 
  AND ORDER_NO= '00281'; 
==============================================================================================================COMMIT 

-- 주문상세 내역 조회 @@@@@@@@@@@@@@ 
SELECT * 
FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040830' 
  AND ORDER_NO= '00281'; 
  --AND SHIP_STS = '20'; --//배송상태(주문접수:01, 배송대기:02, 배송중:03, 물품회수대기:21, 물품회수완료:22) 
---------------------------------------------------  COMMIT 

-- 주문상세 내역 수정  @@@@@@@@@@@@@@ 
--UPDATE T_ORDER_DTL 
SET SHIP_STS = '21'  --물품회수대기:21로 수정 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040830' 
  AND ORDER_NO= '00281'; 
==============================================================================================================

- vip71 김영기 
반품주문(ORDER_TP:03)(물품회수완료:23) ==> 010001 20040813 00409 
--> 정상주문(ORDER_TP:01)(배송완료:23) ==> 010001 20040813 00409  
반품주문(ORDER_TP:03)(환불금계산완료:24) ==> 010001 20040813 00426 ==> 010001 20040813 00409  
------------------------------------------------------------------------------------------------------------------------------   

이경숙 / i100421  
정상주문(ORDER_TP:01)(배송완료:09) ==> 010001 20040813 00213 
반품주문(ORDER_TP:01)(환불완료:29:) ==> 01000120040810 00321  ==> 010001 20040813 00213 
==============================================================================================================

010001 20040813 00409 
원주문번호 ↑ 이주문번호 맞구요..,  
처음 진주씨가 반품접수 한 반품번호가 있구요.., 
이반품번호를 취소하고 다시 반품접수를 해서 또다른반품번호가 있습니다~ 

그럼 원래 주문번호1건, 반품번호 2건 있어야 됩니다~ 
그리고 0426번이 반품번호는 맞는데,  이분은 카드로만 결제하셨는데, 현금 + 카드결제건으로 되어있네요~ 
그러니 다른반품건으로 처리되어야 되는게 맞습니다~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.23(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:50 
   
- 정수기 개발
-  210.123.133.12(sa/project) 
==============================================================================================================

- 발주정보 조회 
SELECT   * 
FROM  T_ORDER 
ORDER BY ORDER_NO DESC 
---------------------------------------------------------------------------------------------------------- 

T_ORDER: 발주정보 T_ORDER_PRODUCT: 발주제품 정보 
T_PRODUCT_MODULE: 제품단위 모듈 T_PRODUCT_HISTORY: 제품 HISTORY 
T_PRODUCT: 제품 T_ENTERPRISE: 거래처 정보 
T_RECEIPT: 수주정보 T_RECEIPT_DTL: 수주 상세정보 
T_DELIVERY: 출고 정보 T_DELIVERY_DTL: 출고 상세정보 
T_IN_PO: 입고 발주 정보 T_IN_PO_DTL: 입고 발주 상세정보 
T_ENTER: 입고 정보 T_ENTER_DTL: 입고 상세정보 
T_CODE: 코드 마스타 T_CODE_GROUP: 코드구분 마스타 
==============================================================================================================

- 이미지 서버 다운(210.123.133.104) 
KIDC 조병창씨 연락 
(053)241-8587 * 
==============================================================================================================

SELECT * FROM T_MEMBER WHERE MEM_ID = 'sea1509'; 

UPDATE T_MEMBER SET CDBUY_CD ='00'  --// CD 구매 안 한 걸로 수정 
WHERE MEM_ID = 'test01'; 
==============================================================================================================
  
* 주문자 정보: 김자영 /sea1509 
- 2004/08/22  010001-2004082200220  110만원  카드승인오류   ====> 사용한도 초과 
==============================================================================================================

- 결제 방법 코드 
01: 현금(01:주문접수) 
02: 카드(00:카드승인오류 --> 03:결제완료) 
03: 현금+카드 시제정보 2개 
(01:주문접수 --> 03:결제완료)  ===> 현금이 입금 되어야 통합에서 결제완료(03) 처리됨 
04: RM머니 
==============================================================================================================

String p_re_category_cd = (request.getParameter("p_re_category_cd")== null) ? "": request.getParameter("p_re_category_cd"); 
 
// 00143123 ->노블레스 CD 아이템 number 
if (flag_item_cd.equals("00143123")) { 
if(p_ar_way_cd.equals("02")) {  //카드결제(02:카드) 이면  ================= 
noblesseCD_flag = "N"; 
} else { 
noblesseCD_flag = "Y"; 
}  
} 
==============================================================================================================

VB 의 String 은 이진 데이터 버퍼로 사용하실 수 없습니다. 
오로지 문자열의 저장과 표현의 용도로만 사용하셔야 합니다. 
이유는 유니코드와 아스키코드의 자동 전환 때문입니다.  

VB 의 String 은 기본적으로 유니코드로 저장되며 파일 저장이나 소켓통신에서는 아스키코드로 전환되어 전달됩니다. 
만약에 바이트 배열로 송신한 이진 데이터를 문자열로 수신한다면 이진 데이터가 아스키코드로 인식되어 문자열로 전환됩니다. 
이 과정에서 데이터가 유실됩니다. 이 유실 과정은 직접 테스트 해보시는게 이해가 빠릅니다.  
따라서 이진 데이터를 정확히 송수신하기 위해서는 송신측도 수신측도 모두 바이트 배열을 사용해야 합니다.  

그리고 추가적으로. 
보여주신 소스코드는 보낸 데이터가 보낸 크기 그대로 수신된다는 전제하에 작성되어 있는것 같습니다. 
TCP 통신에서는 데이터의 무결성과 순서는 보장되지만 전송단위는 보장되지 않습니다.  
따라서 100 바이트를 3번 보내면 100, 100, 100 으로 도착되는게 아니라 300 으로 한꺼번에 도착될 수도 있고  
200, 100 으로도, 100, 200 으로도 도착됩니다. 심지어는 250, 50 과 같이 하나의 단위도 나뉘어 도착될 수 있습니다. 
이러한 상황을 고려하지 않는다면 처리부에서 데이터를 잘못 처리하게 됩니다. 

위 두가지 사항에 맞춰 프로토콜을 다시 설계하셔야 할것 같습니다.  
송신부에서는 이진 데이터를 바이트 배열로 전송해야 하며 패킷의 종료를 종료문자가  
아닌 패킷 크기를 넣어 구분하시는게 좋습니다. 수신부에서는 바이트 배열로 수신하면서  
전달받은 패킷 크기만큼의 데이터를 받고나서 패킷을 처리하도록 구문을 바꿔야 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.24(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 
   
- 통합 수정
- 업체 코드 변경 
미르소프트(00068: B0000068) --> (주)인트레이드(45136: B0000516) 
------------------------------------------------------------------------------------------------------------------- 

- /기초코드관리/영업관리기초코드/거래처코드/거래처관리  
/BizMgr/VendorMgr/vendorP.jsp 
------------------------------------------------------------------------------------------------------------------- 

SELECT *  
FROM T_ENTERPRISE 
WHERE ENTR_NO = '00068' 
------------------------------------------------------------------------------------------------------------------- 

- SEQ_NO 자동 증가 
((SELECT COUNT(SEQ_NO) FROM T_MERCHANT_ITEM_RSV) + ROWNUM) AS SEQ_NO, 
------------------------------------------------------------------------------------------------------------------- 

- /본부영업관리/상품마스타/상품마스타관리(구버젼) 
/BizMgr/ItemMgr/itemP.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.25(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 
   
- 쇼핑몰 수정
- 노블레스CD 주문 수정 에러 
1. 카드결제한 모든 주문(T_ORDER)에 CDBUY_YN, CD_KEY 삽입됨 
2. 회원멤버정보(T_MEMBER)에 CDBUY_CD = '01'로 수정됨 
------------------------------------------------------------------------------------------------------------------- 

- 노블레스CD 주문 수정  @@@@@@@@@@@@@@@@@ 
UPDATE T_ORDER T 
SET T.CDBUY_YN = '', T.CD_KEY = '' 
WHERE (T.ORDER_DT, T.ORDER_NO) 
  IN (SELECT A.ORDER_DT, A.ORDER_NO 
      FROM T_ORDER A, T_ORDER_DTL B 
      WHERE A.COMPANY_CD = B.COMPANY_CD 
        AND A.MERCHANT_CD = B.MERCHANT_CD 
        AND A.ORDER_NO = B.ORDER_NO 
        AND A.ORDER_DT = B.ORDER_DT 
        AND A.COMPANY_CD = '01' 
       AND A.MERCHANT_CD = '0001' 
       AND A.ORDER_DT >='20040823' 
       AND A.ORDER_DT <='20040825' 
       AND A.ORDER_STS ='03' 
       AND B.ITEM_CD <>'00143123'    --노블레스CD:00143123 
       AND A.CDBUY_YN = 'Y'); 
------------------------------------------------------------------------------------------------------------------- \

FORALL i IN 1 .. 300 
       INSERT INTO my_table (x, y) 
        VALUES('20040506', i); 
COMMIT; 
==============================================================================================================

- 신용카드 결제 순서 수정 
 주문상태(00: 카드승인오류)  ===> (03: 결제완료)  
==============================================================================================================

- 티지 (I-yes 서울, I-yes 인천) 
https://npg.tgcorp.com/mdbop/login.jsp  
ID: i3shop9032 pass: i3shop9001 김응주 02)3438-3564 
==============================================================================================================

- 기타 카드 제외 
public Hashtable addOrderInfo_TG(Hashtable appHash) throws Err { 

} 
==============================================================================================================

- 출고상태(01:주문접수 03:포장중 06:배송중) 
==============================================================================================================

- 주문자 : 황선옥(07sunok) 
주문번호 : 01000120040825 00325(12개월LG) - 카드승인취소된 상태 
               로 주문정보내역<시제정보>에는 결제 내역이 없음 
               0100012004082500349(일시불LG)   ===> 정상 
확인 부탁 드립니다. 
---------------------------------------------------------------------------------------------------------------- 

이 주문자 카드 결제 기록은 남아 있습니다. 
하지만 배송내역, 시제 정보는 남아 있지 않습니다. 
제가 생각 하건데 주문량이 77개로 많은 상황에서 저장시 오류로 인해서 
에러가 나면서 주문 결제는 되고 나머지 정보는 기록이 안 된 것 으로 
판단 됩니다. 
==============================================================================================================

- 이미지 서버 다운(210.123.133.104) 
2번 다운(이미지 서버 불안- 서버로서 성능 미비) 
KIDC 연락처 053)241-18587 
--- 이미지 서버 교체(.104 --> .107)==> 포맷 후 재 설치(Win2000) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.26(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 
   
- 쇼핑몰 수정
- 노블레스CD 주문 수정 
문제: CDBUY_CD(02 --> 01) 변경된 경우 
CDBUY_CD  시디 구매여부(00: 미신청 01:신청 02 : 설치 완료) 
---------------------------------------------------------------------------------------------------------------- 

20040826 일(3개) 
01000120040826 00170   --> NO 
김미숙 mi1221 01 
01000120040826 00172 
한인선 his7941 01 
01000120040826 00196   --> 반품 
- 예임숙 cc5555 02  
01000120040826 00218 
---------------------------------------------------------------------------------------------------------------- 

20040825일(7개) 
01000120040825 00361 
이관영 vip417 02 01 
01000120040825 00419   --> NO 
정홍형 jung64 02 01  
01000120040825 00421 
정홍형 jung64 02 01  
01000120040825 00445 
권창훈 ch153 02 01 
01000120040825 00476 
안영희 anne76 02 01 
01000120040825 00501 
조홍삼 hongg333 02 
01000120040825 00271 
임승숙 lss58 02 01 
---------------------------------------------------------------------------------------------------------------- 

20040824일(8개) 
01000120040824 00380  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00382  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00384  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00386  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00393  --> NO(T_STOREOUT 없음) 
안영희 anne76 02 01 
01000120040824 00519  --> NO(T_STOREOUT 없음) 
김기찬 kkc1004 02 01 
01000120040824 00523 --> NO(T_STOREOUT 없음) 
김기찬 kkc1004 02 01 
---------------------------------------------------------------------------------------------------------------- 
  
20040824일(4개) ==> 현금 
01000120040824 00381  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00384  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01 
01000120040824 00393  --> NO(T_STOREOUT 없음) 
박춘숙 skl06 02 01  
01000120040824 00417 
이유석 bmw3696 02 01 
---------------------------------------------------------------------------------------------------------------- 

20040823일(1개) 
01000120040823 00595  --> NO(T_STOREOUT 없음) 
박진열 jinyulp 02 01 
==============================================================================================================

- 협력업체 엑셀 파일 수정 
/ToExcel.jsp 에서 @@@@@@@@ 
---------------------------------------------------------------------------------------------------------------- 

<%@ page language="java" contentType="application/vnd.ms-excel;charset=euc-kr" %> 
<META HTTP-EQUIV=Content-Type CONTENT="text/html; charset=KSC5601">  
==============================================================================================================
  
- 대금정산 
http://support.i3shop.com/VendorMgr/SettleInfo/storeOutDtlP.jsp 
==============================================================================================================

- 업체코드 변경 
미르소프트(00068: B0000068) --> (주)인트레이드(45136: B0000516) 
ORA-00957: duplicate column name  ====> 칼럼 2개 중복 사용 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.27(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 
   
- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제로 변경 
index.jsp --> /order/orderPutP_2_TG.jsp 
dbpath.jsp --> /order/orderPut_3_TG.jsp   --------> addOrderInfo_TG() 
redirpath.jsp --> /order/orderPutP_4.jsp 
---------------------------------------------------------------------------------------------------------------- 

3.2. DBPATH 
DBPATH 페이지는 결제 결과를 전달받아 가맹점 DataBase에 저장하는 페이지 입니다. 
모든 결과값은 POST 방식으로 전달되며, 전달되는 parameter로 지정되어 있지 않은 값은 전달되지 않습니다. 
==============================================================================================================

3.3. REDIRPATH 
MSTR2만 전달 됩니다. MSTR2는 가맹점에서 임의로 설정하여 사용 할 수 있는 PARAMETER입니다.   
==============================================================================================================

- 티지 (I-yes 서울, I-yes 인천) 
https://npg.tgcorp.com/mdbop/login.jsp 
ID: i3shop9032 pass: i3shop9001 김응주 대리 02)3438-3564  
==============================================================================================================

- CCDOME 포트 수정 
C:\orion_ccdom\config\ccdom-web-site.xml 에서 @@@@@@@@@@ 
---------------------------------------------------------------------------------------------------------------- 

<web-site host="[ALL]" port="5001" display-name="CcdomWeb"> 
---> <web-site host="[ALL]" port="80" display-name="CcdomWeb">로 변경 
==============================================================================================================

C:\orion_ccdom\config\server.xml 에서 ccdom-web-site.xml 지정 
==============================================================================================================

- 신용카드사 직거래 조사  
가맹점 등록 방법 문의 
1. 국민카드 1588-1688  국민은행02) 2073-2385~6 
PG사를 통해서만 가능(회사 규정) 
---------------------------------------------------------------------------------------------------------------- 

2. BC카드 1566-4500 ==> 053)250-3525 
통신 판매업은 직거래 안함 
PG사를 통해서만 가능  
---------------------------------------------------------------------------------------------------------------- 

3. LG카드 1544-7000 
직거래(PG사 통해서 연결): NICE에 수수료 안 줌 
보증금 2억 
---------------------------------------------------------------------------------------------------------------- 

4. 삼성카드 1588-8700 
직거래 해지(2003년 말) 
카드 승인 취소가 많아서 해지됨    
==============================================================================================================

- 반품(테트스시 배송 데이타 삭제 안 함) 
2004082300564 
----------------------------------------------------------------------------------------------------------------

검품이 안된답니다.. 
0100012004082400271   ---------> 배송완료 
==============================================================================================================

- 무료회원 매출 조회 오류 
원인: 무료회원 매출 조회에서 주문상태를 신용카드오류(주문상태(00:카드승인오류)) 데이타 같이 가져옴 
※ 고객정보: 이명희 lmh68 A,M(MLM관리/회원정보관리/리셀러 상세 정보 수정--> ccdom바로가기) 
 010001 *, 2004082700067 
http://clover.i3shop.cc/admin/salemgr/myFreeSaleP.jsp
dlog("[temStockMgrBean.java]:[getStockInquiryTempList()]: [SQL]====> \n "+ SQL); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.28(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:30 
   
- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제로 변경 
/orderPutP_2_TG.jsp --> /orderPut_3_TG.jsp : addOrderInfo_TG():카드 정보 저장 안 함 
(주문정보, 배송정보 저장) 
--> /orderPut_TG_index.jsp  -->  
/orderPut_TG_dbpath.jsp : 카드 정보 저장, T_ORDER에서 ORDER_STS =01 로 수정 
(시제정보, 포인트정보, 쿠폰정보, 한정판매 상품인 경우(재고 마이너스)) 
/redirpath.jsp --> /order/orderPut, P_4.jsp 
---------------------------------------------------------------------------------------------------------------

index.jsp --> /order/orderPutP_2_TG.jsp 
dbpath.jsp --> /order/orderPut_3_TG.jsp   --------> addOrderInfo_TG() 
redirpath.jsp --> /order/orderPutP_4.jsp 
------------------------------------------------------------- 
  
//포인트정보 입력 
addSalePoint(inputHash); 
//사이버머니 정보 입력 
addSalePointCyberM(inputHash); 
//쿠폰정보 입력 
updateCoupon(inputHash); 
//매출정보 입력 
callSaleMgr(inputHash); 
//한정판매 상품인 경우(재고 마이너스) 
updateLimitSaleQty(inputHash); 
//결과화면을 보여주기 위한 정보 
 retHash.put("ordHash",inputHash); 
==============================================================================================================

3.2. DBPATH 
DBPATH 페이지는 결제 결과를 전달받아 가맹점 DataBase에 저장하는 페이지 입니다. 
모든 결과값은 POST 방식으로 전달되며, 전달되는 parameter로 지정되어 있지 않은 값은 전달되지 않습니다. 
==============================================================================================================

3.3. REDIRPATH 
MSTR2만 전달 됩니다. MSTR2는 가맹점에서 임의로 설정하여 사용 할 수 있는 PARAMETER입니다.   
==============================================================================================================

- 티지 (I-yes 서울, I-yes 인천) 
https://npg.tgcorp.com/mdbop/login.jsp 
ID: i3shop9032 pass: i3shop9001 김응주 대리 02)3438-3564
==============================================================================================================

[p_company_cd]-->0001[p_merchant_cd]-->0001[p_order_dt]-->20040829[p_order_no]-->00171[p_ar_way_cd_5]-->20 
[p_ar_amt]-->45000[p_ar_end_amt]-->45000[p_ar_bank_entr_cd]-->[p_ar_dt]-->20040829[p_ar_person_nm_10]--> 

[p_ar_bank_account]-->[p_card_app_tp]-->[p_extension_day]-->[p_card_no]-->1234234234[p_pg_entr_no_15]--> 
[p_card_fee_rate]-->[p_card_fee]-->[p_approval_no]-->[p_pgtr_no]-->[p_approval_msg_20]--> 

[p_cancel_old_dt]-->[p_quota_month]-->일시불[p_trade_dt_tm]-->[p_ar_sts]-->21[p_approval_code_25]--> 
[p_memo_desc]-->[p_reg_id]-->test01[p_reg_ip]-->210.123.133.31[p_ar_bank_entr_no]-->[p_pg_order_dt_30]--> 
[p_terminal_no]-->[p_isp_yn_32]-->N 
==============================================================================================================

NSERT INTO T_AR(COMPANY_CD,MERCHANT_CD, ORDER_NO,ORDER_DT,AR_WAY_CD, 
AR_AMT, AR_END_AMT,AR_BANK_ENTR_CD,  AR_DT,AR_PERSON_NM, 
AR_BANK_ACCOUNT, CARD_APP_TP,EXTENSION_DAY,CARD_NO,PG_ENTR_NO, 
CARD_FEE_RATE, CARD_FEE,APPROVAL_NO,PGTR_NO,APPROVAL_MSG, 
CANCEL_OLD_DT, QUOTA_MONTH,TRADE_DT_TM,AR_STS,APPROVAL_CODE, 
MEMO_DESC,REG_ID,REG_IP,AR_BANK_ENTR_NO,REG_DT,PG_ORDER_DT, 
TERMINAL_NO, ISP_YN) 
VALUES( '01', '0001', '01', '00171', '20040829', '20', 
45000, 45000, '', '', '20040829', '', 
'', '', '', '', '1234234234', '',    
0, 0, '', '', '', '', 
'', '일시불', '', '', '21', '', 
'', 'test01', '210.123.133.31', SYSDATE, '', 
 '', 'N') 
----------------------------------------------------------------------------------------------------------------- 

AR_AMT NUMBER 
AR_END_AMT NUMBER 
CARD_FEE_RATE NUMBER 
CARD_FEE NUMBER 

java.sql.SQLException: ORA-01401: inserted value too large for column 
==============================================================================================================

dlog("[AccMgrBean.java]:[updateBuyingRemittance()]: [SQL]====> \n "+ SQL); 

dlog("[AccMgrBean.java]::[updateBuyingRemittance()]::[p_company_cd]-->"+getData("p_company_cd",irowHash) +"" + 
"[p_merchant_cd]-->"+ getData("p_merchant_cd",irowHash) +"[p_storeout_dt]-->"+ getData("p_storeout_dt",irowHash) +"" + 
"[p_seq_no]-->"+ getData("p_seq_no",irowHash) +"[p_magamtype]-->"+ getData("p_magamtype",irowHash) +"" + 
"[p_meip_gubun]-->"+ getData("p_meip_gubun",irowHash) +"[p_entr_no]-->"+ getData("p_entr_no",irowHash) +"" + 
"[p_settle_yn]-->"+ getData("p_settle_yn",irowHash)+"[p_settle_dt]-->"+ getData("p_settle_dt",irowHash)); 
==============================================================================================================

SELECT * FROM T_ART 
WHERE ORDER_DT ='200408028' 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.08.29(일) 작업 ■■■■■■■■■■■■■■■■
---> 14:00 ~ 21:00 
   
- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제로 변경 
/orderPutP_2_TG.jsp --> /orderPut_3_TG.jsp : addOrderInfo_TG():카드 정보 저장 안 함 
(주문정보, 배송정보 저장) 
--> /orderPut_TG_index.jsp  -->  
/orderPut_TG_dbpath.jsp : 카드 정보 저장, T_ORDER에서 ORDER_STS =01 로 수정 
(시제정보, 포인트정보, 쿠폰정보, 한정판매 상품인 경우(재고 마이너스)) 
/redirpath.jsp --> /order/orderPut, P_4.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 
   
- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제로 변경
/orderPutP_2_TG.jsp에서 @@@@@@@@@ 
try { 
//주문을 넣는다. 
retHash = (Hashtable)cart.addOrderInfo_tgisp_1(request); //1단계:주문번호, 주문정보 분리, PG정보  
} 
==============================================================================================================

/CartBean.java에서 @@@@@@@@@ 
public Hashtable addOrderInfo_tgisp_1(HttpServletRequest req) throws Err {  
	ordInfoHash = makeInputHash(req,5); //5=주문정보입력정보를 분석한다 
} 

public Hashtable makeInputHash (HttpServletRequest req, int type) throws Err {  
	if (type==5) { //주문입력 최종단계 정보를 분리  
	orderHash = makeOrderMasterValue_2(req);	// 주문마스타 정보 분리
	} 
} 
==============================================================================================================

- /orderPutP_2_TG.jsp에서 @@@@@@@@@   
function generate_info() {		// 결제하기 
	payform =document.ordFrm; 
	var p_mem_nm = payform.p_mem_nm.value; 
	var p_hphon = payform.p_hphon.value; 
	var senddata = ""; 

	// input 주문정보, 결재 정보 보내기 
	var senddata = "MSTR="+ p_mem_nm +""+ p_hphon;  
	alert("[generate_info()]: [senddata]"+ senddata); 

	TG_PAY = window.open("","TG_PAY", "resizable=yes, width=390, height=360"); 
	TG_PAY.focus(); 
	payform.target="TG_PAY"; 
	payform.action="https://npg.tgcorp.com/dlp/start.jsp"+ "?" + senddata;   
} 
==============================================================================================================

--> /orderPut_3_TG.jsp : addOrderInfo_TG():카드 정보 저장 안 함 
--> /order/orderPut, P_4.jsp 
==============================================================================================================

- 주문번호: 0100012004082300580 
주문자: 김현 수령자: 김현 
부탁드립니다... 
==============================================================================================================
   
- 104 서버 다운 
OS 부팅 안 됨  
i3.1004.cc, www.i3shop.com 
==============================================================================================================

- 누드 세일 오류 
http://test.mart.cc/display/big/bigctg.jsp?p_store_cd=S001&p_category_cd=000000000&p_display_cd=01  
getMDCategoryItemListForMain 
==============================================================================================================

// TGCORP ISP카드결제일 경우를 위해서 ordInfoHash를 저장 
setOrdInfoHash(ordInfoHash); 
==============================================================================================================
 
if (getReqData("p_amt",req,4)==null) {  // 주문금액 
_errflag = true; 
_errstr += " [주문금액] " ; 
} else { 
ordHash.put("p_amt",getReqData("p_amt",req,4)); 
} 
//배송비 
if (getReqData("p_ship_charge",req,4)==null) { 
_errflag = true; 
_errstr += " [배송비] " ; 
} else { 
ordHash.put("p_ship_charge",getReqData("p_ship_charge",req,4)); 
} 
//비즈센타코드 
if (getReqData("p_bizcenter_cd",req,4)==null) { 
_errflag = true; 
_errstr += " [비즈센터코드] " ; 
} else { 
ordHash.put("p_bizcenter_cd",getReqData("p_bizcenter_cd",req,4)); 
} 
//비즈그룹 
if (getReqData("p_bizgroup_cd",req,4)==null) { 
ordHash.put("p_bizgroup_cd",""); 
} else { 
ordHash.put("p_bizgroup_cd",getReqData("p_bizgroup_cd",req,4)); 
} 

//리셀러ID 
if (getReqData("p_reseller_id",req,4)==null getReqData("p_reseller_id",req,4)==null) { 
_errflag = true; 
_errstr += " [쇼핑몰관리자ID] " ; 
} else { 
ordHash.put("p_reseller_id",getReqData("p_reseller_id",req,4)); 
} 
//리셀러명 
if (getReqData("p_reseller_nm",req,4)==null getReqData("p_reseller_nm",req,4)==null) { 
_errflag = true; 
_errstr += " [쇼핑몰관리자명] " ; 
} else { 
ordHash.put("p_reseller_nm",getReqData("p_reseller_nm",req,4)); 
} 
//리셀러번호 
if (getReqData("p_reseller_no",req,4)==null getReqData("p_reseller_no",req,4)==null) { 
_errflag = true; 
_errstr += " [쇼핑몰관리자번호] " ; 
} else { 
ordHash.put("p_reseller_no",getReqData("p_reseller_no",req,4)); 
}  
//도메인명 
if (getReqData("p_domain_nm",req,4)==null getReqData("p_domain_nm",req,4)==null) { 
_errflag = true; 
_errstr += " [도메인명] " ; 
} else { 
ordHash.put("p_domain_nm",getReqData("p_domain_nm",req,4)); 
} 
//도메인번호 
if (getReqData("p_domain_no",req,4)==null getReqData("p_domain_no",req,4)==null) { 
_errflag = true; 
_errstr += " [도메인번호] " ; 
} else { 
ordHash.put("p_domain_no",getReqData("p_domain_no",req,4)); 
} 
//수령지우편번호 
if (getReqData("p_zip_no1",req,4)==null  getReqData("p_zip_no2",req,4)==null) { 
_errflag = true; 
_errstr += " [수령지우편번호] " ; 
} else { 
ordHash.put("p_zip_no",getReqData("p_zip_no1",req,4)+getReqData("p_zip_no2",req,4)); 
} 
//수령지고정주소 
if (getReqData("p_fix_addr",req,4)==null) { 
_errflag = true; 
_errstr += " [수령지주소1] " ; 
} else { 
ordHash.put("p_fix_addr",getReqData("p_fix_addr",req,4)); 
} 
//수령지상세주소 
if (getReqData("p_dtl_addr",req,4)==null) { 
_errflag = true; 
_errstr += " [수령지주소2] " ; 
} else { 
ordHash.put("p_dtl_addr",getReqData("p_dtl_addr",req,4)); 
} 
//수령자명 
if (getReqData("p_receiver_nm",req,4)==null) { 
_errflag = true; 
_errstr += " [수령인명] " ; 
} else { 
ordHash.put("p_receiver_nm",getReqData("p_receiver_nm",req,4)); 
} 
==============================================================================================================

박성도 
0100012004082300596 
0596 
AND ORDER_DT ='20040823' 
AND ORDER_NO ='00596' 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.08.31(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:30 
   
- 쇼핑몰 수정
반품관리/반품신청서작성(배송수수료 제어) 
-자사상품이 3만원 보다 적으면 배송 수수료 3천원 Alert 

반품관리/반품신청서 작성 
/BizMgr/SaleMgr/WebOrderMgr/returnItemReqEditP.jsp 
/orderItemDetailTotal_PriceB.jsp  ====> 반품상품정보 조회(jsp에서 SQL 쿼리 통제)  

반품관리/반품 신청 관리 
/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp 
/returnItemOrderEditP.jsp 
==============================================================================================================

dlog("[AccMgrBean.java]:[updateBuyingRemittance()]: [SQL]====> \n "+ SQL); 

System.out.println("[orderItemDetailB.jsp]:[p_total_price]"+ p_total_price); 
dlog("[SaleMgrBean.java]:[getReturnAvailItemByOrder()]: [sql]====> \n "+ sql); 
dlog("[SaleMgrBean.java]::[getReturnAvailItemByOrder()]:[p_company_cd]-->"+ p_company_cd +"" + 
"[p_merchant_cd]-->"+ p_merchant_cd +"[p_order_dt]"+ p_order_dt  +"[p_order_no]"+ p_order_no); 
==============================================================================================================

- 오한성   ohs19 
원 주문번호: 010001 20040830 00412  --> 00417 
==============================================================================================================

- LG모바일 서버 개발
- 공지사항 리스트 요청(/mobile/noticelist.jsp) 
http://landmark.town.cc/mobile/noticelist.jsp?from=0&count=10 
==============================================================================================================

- 공지사항 게시판
/MainMgr/i3NoticeBoard/i3NoticeListP.jsp   ---> getI3NoticeList() 
==============================================================================================================

- 매출자료 출력 쿼리 작성 
매출자료 
==============================================================================================================

A 상품군(100만원 ~ 129만원) 
1. 장외산삼 129만원 
2. 액상초유 129만원 
3. CookSet 129만원 

B 상품군(50만원 ~ 99만원) 
1. 골프채 75만원 
2. 클렌스Set 97만원 
3. SQIN세트 79만원 
4. GI발란스 55만원 

C 상품군(50만원 이하) 
1. 에스칼 22만원 
2. 홍삼진액 36만원 
3. 베스토마산 39만원 
4. 코트랑 24만원 
5. 토종산삼 24만원 
6. 라이크마토 44만원 
7. 씰업 48만원 
==============================================================================================================

- 구매한도 510만원 에서 상품구매 
A상품군과 B상품군은 오르지 하나만 구매 가능 
A상품군과 B상품군은 1대1일 대응........... 
그러니깐 A상품군에서 장외산삼 하나만 샀다면 있고 B상품군에서 골프채도 하나만 
살 수 있다. 
나머지 C상품군에서 상품을 구매해서 510만원 채움 
그러면 경우의 수가 몇개나 나오노? 
답변 부탁한다. 
그럼 수고. 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
