

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.05.03(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 비 

- 통합 수정
주간업무 보고서 개발 
- OZ 출력 
- 주차 등록 
- 업무구분명 등록 
- 협력업체 대금정산 오류 점검 수정 
==============================================================================================================
  
쇼핑몰 김정배[(주)모션위즈] B0087207/87207 
쇼핑몰 서진석[프라이스데이] B0000602/pr55036 
쇼핑몰 김관수[(주)씨앤씨클럽] B0000404/4926 
임영택[Ace inc] B0000286/4166 
문극현[유한킴벌리] 31666/1666 
김창근[SK(주)] B0000587/4762 
김종문[대백유통] B0000046/4888 
물류 김한연[중외휴먼택] B0000511/3532 
마트 김관수[(주)씨앤씨클럽] B0000404/4926   
==============================================================================================================

- 한일극장   아카데미 중앙시네마(예약: 5/5 14:30) 
만경관 롯데시네마 메가박스 씨네아시아 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.04(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 24:00 ==> 구름많음 

- 통합 수정
주간업무 보고서 개발  
- EJB 변경(GitaMgr  --> ReportMgr) 
- 실서버 등록 

제한수량 상품 등록 
- 매입가 수정  
==============================================================================================================

 String p_user_id = (String)sessHash.get("USER_ID");   //회원ID 
==============================================================================================================

- 싸이월드 홈페이지 
http://cyworld.nate.com/tamario  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.05.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 13:30 ==> 맑음 
  
- 통합 수정
- 협력업체 대금정산 오류 점검 수정(ReportMgr) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.05.06(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 22:00 ==> 맑음 

- 통합 수정
수기 주문 등록 
- 로그인 
(/BizMgr/SaleMgr/WebOrderMgr/directOrderLoginP.jsp) 
통합 login kiho0709/0709 29788 회원NO(수기 주문 등록 login) --> kiho0709.nara.cc 
==============================================================================================================
  
- 리스트  
(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=584314&p_domain_nm=tamario.i3shop.cc
&p_mem_id=tamario26&p_mem_nm=진태만) 
==============================================================================================================
  
- 장바구니 담기 
cartWin = window.open("<%=p_domain_nm%>/customer/loginP.jsp?p_user_id=<%=p_user_id%>&p_user_passwd=
<%=p_user_passwd%>&p_logingbn_cd=1&p_mno=<%=p_mno%>">http://<%=p_domain_nm%>/customer/loginP.jsp?
p_user_id=<%=p_user_id%>&p_user_passwd=<%=p_user_passwd%>&p_logingbn_cd=1&p_mno=<%=p_mno%>"
,"cart_win","left=10000,toolbar=no,status=no,resizable=no,scrollbars=yes,width=1024,height=800"); 
frm.action = "<%=p_domain_nm%>/cart/cartPut.jsp">http://<%=p_domain_nm%>/cart/cartPut.jsp"; 
alert("장바구니 담기에 시행 중........... ");  //submit 폼일 때는 cartWin이 안 먹고 frm.action만 먹음(중간에 alert 해줘야 함) 
frm.target = "cart_win";         
frm.submit(); 
clearForm();  
==============================================================================================================
  
- 점별 상품 정보 조회--> 모델명 11000R(대웅 홍삼 중탕기) 
(/BizMgr/SaleMgr/WebOrderMgr/searchToDirectOrderItemP.jsp) --> searchTodirectOrderItemB.jsp  
==============================================================================================================
  
- 유형선택(searchToDirectOrderItemTpP.jsp) 
<script language="javascript"> 
	var qusetionConfirm = confirm("등록된 유형이 없습니다! 기본상품을 추가하시겠습니까?"); 
	if(qusetionConfirm) { 
	On_Change(""); 
	} else { 
	parent.location.href="./searchToDirectOrderF.jsp"; 
	} 
</script>  
================================================================================================== 

dlog("[ItemWebMgrBean.java]::[getItemList()]::[findCond]"+ findCond); 
dlog("[ItemWebMgrBean.java]::[getItemList()]::[SQL]===>\n"+ SQL); 
dlog("[AccMgrBean.java]::[updateBuyingRemittance()]::[p_company_cd]-->"+ p_company_cd +"" + 
   "[p_merchant_cd]-->"+ p_merchant_cd +"[p_from_date]-->"+ p_from_date +"" + 
   "[p_to_date]-->"+ p_to_date +"[p_store_cd_매입구분]-->"+ p_store_cd +"" + 
   "[p_entr_no]-->"+ p_entr_no +"[p_entr_no]-->"+p_entr_no +"" + 
   "[p_tax_yn_부가세]-->"+ p_tax_yn +"[p_bill_collect_yn]-->"+ p_bill_collect_yn); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:35 ~ 19:00 ==> 맑음 

- 통합 수정
주간업무 보고서 수정 
- 주간업무 보고서 등록(업무구분명) 
http://www.entoi.com/onbi 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.08(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:35 ~ 20:30 약간 흐림 

- 통합 수정
- 영업마감 조회 불능 
사고: DEPART별매출조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleTotal.jsp) 
오프라인(동대구지점) 영업마감(2004.05.06) 안 돌아갔음  
해결책: 통합마감(/BizMgr/ReportMgr/closingP.jsp) 
DEPART별 마감(T_CLOSE_DEPART)이 돌려줌 
DB 패키지에서 ===> PKG_DAYOFCLOSE.FINALYDAY_TYPE_INSERT 
==============================================================================================================

--기획전 당첨자 리스트 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
SELECT DISTINCT A.MEM_ID AS 주문자ID, 
   A.MEM_NM AS 주문자명, 
   A.RECEIVER_NM AS 수령자명, 
  (A.COMPANY_CD  A.MERCHANT_CD A.ORDER_DT  A.ORDER_NO) AS 주문번호,  
   A.RECEIVER_PHONE AS 주문자_전화번호, 
   A.RECEIVER_HP AS 휴대폰번호, 
   A.AMT AS 주문금액, 
   A.FIX_ADDR  A.DTL_ADDR AS 주문자_주소,  
       A.SELLING_DT  AS 구매일자 
FROM T_ORDER A, T_ORDER_DTL B, T_CATEGORY_ITEM C 
WHERE A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001'  
AND A.ORDER_TP = '01'        --주문형태(정상) 
AND A.SELLING_DT >= '20040407'   --구매일자(20040407) 
AND A.SELLING_DT <= '20040506'  --구매일자 
AND C.STORE_CD = 'S063'   --매장코드(S063:기획매장) 
AND C.CATEGORY_CD = 'V01010101'  --카테고리코드(V01000000:엘지생활건강 왕대박) 
AND A.AMT >= '30000'  --1회 구매금액이 3만원 이상인 것 
AND A.COMPANY_CD = B.COMPANY_CD 
AND A.MERCHANT_CD = B.MERCHANT_CD 
AND B.ITEM_CD = C.ITEM_CD 
AND A.ORDER_DT = B.ORDER_DT 
AND A.ORDER_NO = B.ORDER_NO 
ORDER BY SELLING_DT, A.MEM_ID 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.09(일) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 18:30 ==> 비 

- MLM 분석
- MLM 시스템 구성  
  운영DB 서버(.110)   승급/수당 서버(.101)     
--------------------------------------------------------------------------------------------------------------------------

<----> ActiveX 클라이언트(일괄처리 미처리분 처리요청) 
Batch 클라이언트   <---->  승급/수당 서버 데몬  <----> ActiveX 클라이언트(일괄처리 미처리분 처리요청) 
<----> ActiveX 클라이언트(일괄처리 미처리분 처리요청) 
운영 DB   <---->     승급/수당 DB   <----> ActiveX 클라이언트(일괄처리 미처리분 처리요청) 
<----> ActiveX 클라이언트(일괄처리 미처리분 처리요청) 
--------------------------------------------------------------------------------------------------------------------------

운영DB 서버(.110)에서 cron_job으로 매일 03:03 승급/수당 처리(AutoExec.jar): 현재 불가능 
==============================================================================================================

#---  수당/승급 DB서버 TNS 연결 DB 환경( I3SHOP/I3SHOP)  ========================== 
I3SHOP = 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST = 211.233.5.101)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SERVICE_NAME = I3SHOP) 
    ) 
  )  
 ) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 ==> 잔뜩 흐림 

- 통합 수정
- 통합마감 
1. 온라인 주문 마감(T_CLOSE_SALE): 10 2. 상품별 마감(T_CLOSE_ITEM): 01 
3. 카테고리별 마감(T_CLOSE_CATEGORY): 02 4. 업체별 마감(T_CLOSE_ENTR): 03 
5. DEPART별 마감(T_CLOSE_DEPART): 04 6. 비즈센타별 마감(T_CLOSE_BIZ): 05 
8. 통합 매출 마감(T_CLOSE_TOT): 07 
==============================================================================================================

- 협력업체/배송등록(/VendorMgr/ShipMgr/storeOutP.jsp) 
 쇼핑몰 김정배[(주)모션위즈] B0087207/87207 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 ==> 맑음 

- 통합 수정
-- 기획전 당첨자 리스트 조회 
-- 거래처 송금 관리 
전체 선택 수정 
==============================================================================================================

- 물류 - 백환일 주임(bhi/1234) 
FTP 설치 - 콜센타 
==============================================================================================================

http://support.microsoft.com/default.aspx?scid=kb;ko;177078&FR=1&PA=1&SD=HSCH 
http://www.ntfaq.co.kr/bbs/content.asp?tname=ntfaq_winxp_board&pid=1295&page=1&keyword=공유&choice=title 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 ==> 비 

- 통합 수정
- 수불장 수정(BizMgr/ReportMgr/reciveAndPayP.jsp) 
(SUBUL_YEAR >= '2004' AND SUBUL_MONTH >= '05' AND SUBUL_DAY>= '01')  
--> (SUBUL_DAY  SUBUL_MONTH  SUBUL_DAY >= '20040411') 
수불장 index 점검 
==============================================================================================================

- 반품관리 수정 
1. 반품신청서작성(/BizMgr/SaleMgr/WebOrderMgr/returnItemReqEditP.jsp) 
--> 주문번호(/BizMgr/common/popup/popOrderP.jsp) 
2. 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
==============================================================================================================

[메세지] 
Remote Method 호출 에러입니다. 
java.rmi.ServerError: Error occurred in server thread; nested exception is: 
        java.lang.OutOfMemoryError 
===> 대용량 DB호출 에러(데이타가 보통 만개가 넘을 때: 실제 1000개 내외) 
 쿼리문에 WHERE  ROWNUM < 1001로 해결 
------------------------------------------------------------------------------------------------------------- 

- 물류 - 조의재 대리(euijae1970/700420), 백환일 주임(bhi/1234) 
==============================================================================================================

- 주문집계표조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderTotalList.jsp) 엑셀 수정 
==============================================================================================================

- CVS접속 방법 
1. Eclipse 실행  --> 2. CVS 저장소 탐색 3. 신규/저장소 위치 
4. 호스트: 210.123.133.56  저장소 경로: /cvs_root 
    사용자: tamario 암호: tama12
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.13(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:10 ~ 23:00 ==> 맑음 

- 통합 수정
--수불장 수정(BizMgr/ReportMgr/reciveAndPayP.jsp)  
--점별(마트(0002), 물류(9001)) '20030101' ~  '20040511'  
-- 수불장 조회(이전 것) 
SELECT * FROM T_DAY_SUBUL 
WHERE MERCHANT_CD = '0002'    --점별(마트(0002), 물류(9001)) 
AND (SUBUL_DATE >= '20030101' AND SUBUL_DATE <= '20040511')   
AND (SUBUL_YEAR >= '2003' AND SUBUL_MONTH >= '01' AND SUBUL_DAY >= '01') 
AND (SUBUL_YEAR <= '2004' AND SUBUL_MONTH <= '05' AND SUBUL_DAY <= '11')  
문제점: 날짜 정확히 안 나옴(20040428 ~ 20040502) 
-------------------------------------------------------------------------------------------------------------- 
  
--수불장 조회 
SELECT * FROM T_DAY_SUBUL 
WHERE MERCHANT_CD = '0002'    --점별(마트(0002), 물류(9001)) 
AND (SUBUL_DATE >= '20030101' AND SUBUL_DATE <= '20040511')   
AND (SUBUL_YEAR  SUBUL_MONTH  SUBUL_DAY >= '20030101') 
AND (SUBUL_YEAR  SUBUL_MONTH  SUBUL_DAY <= '20040511')  

SUBUL_YEAR,  SUBUL_MONTH, SUBUL_DAY 인덱스 필드를 변형시키면 인덱스 활용을 못한다 
개선: 인덱스 새로 설정 
CREATE INDEX T_DAY_SUBUL_IDX ON T_DAY_SUBUL(SUBUL_YEAR  SUBUL_MONTH  SUBUL_DAY)  
SELECT * FROM user_indexes WHERE table_name ='T_DAY_SUBUL'; 
--------------------------------------------------------------------------------------------------------------------------- 
  
-- 인덱스 삭제 
Drop index IDX_T_DAY_SUBUL1 
Drop index IDX_T_DAY_SUBUL1 including contents; 
Drop index  XPK_T_DAY_SUBUL including CASCADE CONSTRAINTS ;  
==================================================================================================================

 2004.05.13 11:00 
--물류(9001) ==> (신규 속도(INDEX날짜 결합): 3분 09초, 이전 속도(INDEX날짜): 1분 51초, 최초 속도: 5분 08초) 
--마트(0002) ==> (신규 속도(INDEX날짜 결합): 3분 59초, 이전 속도(INDEX날짜): 3분 17초, 최초 속도: 4분 03초) 

 2004.05.13 22:40 
--물류(9001) ==> (신규 속도(INDEX날짜 결합): 25초) 
--마트(0002) ==> (신규 속도(INDEX날짜 결합): 55초) 

 2004.05.14 08:00 
--물류(9001) ==> (신규 속도(INDEX날짜 결합): 1분 24초) 
--마트(0002) ==> (신규 속도(INDEX날짜 결합): 9분 01초) 
==============================================================================================================

- 각 dept별 SKU 출력(Skit Unit: 현재 판매되고 있는 상품) 
1. 상품 마스터 에서 ==> USE_YN=Y 
2. 점별 마스터 에서 ==> 온라인점 판매상태 =Active 
3. 전시관리 에서 ==>  카테고리 세 = Y 
카테고리 연결상품 = 만료일자가 현재보다 크거나 같아야 한다. 
==================================================================================================================
  
-- 각 dept별 SKU 조회(ACTIVE인  것만) @@@@@@@@@@@ 
SELECT --A.DEPART1_CD,  
   (SELECT DEPART1_NM FROM T_DEPART1 WHERE COMPANY_CD = A.COMPANY_CD AND DEPART1_CD = A.DEPART1_CD) AS DEP_명, 
   --A.SALE_STS_CL, 
   --(SELECT CODE_NM FROM T_BASECODE WHERE GROUP_ID = 'G134' AND CODE = A.SALE_STS_CL) AS 판매상태구분, 
   A.SALE_STS_CL_SUM AS ACTIVE_상품수   --판매상태구분의 합 
FROM( 
SELECT M.COMPANY_CD      
   ,I.DEPART1_CD 
   ,SUM(I.DEPART1_CD) SALE_STS_CL_SUM --판매상태구분의 합 
       ,M.SALE_STS_CL    --판매상태구분(01: ACTIVE, 05: DELETE)      
FROM T_MERCHANT_ITEM M, 
(SELECT T_ITEM.*, T_DEPART1.USER_ID              
FROM T_ITEM, T_DEPART1     
WHERE T_ITEM.COMPANY_CD = T_DEPART1.COMPANY_CD               
   AND T_ITEM.DEPART1_CD = T_DEPART1.DEPART1_CD                  
   AND T_ITEM.COMPANY_CD = '01') I  
WHERE M.COMPANY_CD = I.COMPANY_CD      
  AND M.ITEM_CD = I.ITEM_CD    
  AND M.COMPANY_CD = '01'   
  AND M.SALE_STS_CL = '01' --판매상태구분이 ACTIVE인 것 
GROUP BY M.COMPANY_CD, I.DEPART1_CD, M.SALE_STS_CL 
) A 
ORDER BY DEP_명 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 

- 통합 수정
장바구니 담기(/cart/cartPut.jsp), 바로구매(/order/rnf/checkRnFSes.jsp) 
장바구니 담기, 바로구매에서 한정수량 체크 
상품주문(결재완료) 후 한정수량 감소 
-------------------------------------------------------------------------------------------------------------- 

-- 한정 수량 제한(장바구니) 
SELECT ITEM_CD, LIMIT_SALE_YN, LIMIT_SALE_QTY FROM T_MERCHANT_ITEM 
LIMIT_SALE_YN: 한정판매여부 LIMIT_SALE_QTY: 한정판매수량  ===> T_MERCHANT_ITEM: 점별 상품 정보TB 
==================================================================================================================

-- 제한 수량 제한(장바구니) 
SELECT ITEM_CD, SALE_MAX_QTY FROM T_BUYLIMITCOUNT 
SALE_MAX_QTY: 최대구매가능 수량  ===> T_BUYLIMITCOUNT: 구매제한 상품 정보TB 
==================================================================================================================

-- 구매 한정 수량(전체) 정보 조회 @@@@@@@@@@@@@   
SELECT ITEM_CD, LIMIT_SALE_QTY  
FROM T_MERCHANT_ITEM 
WHERE COMPANY_CD ='01' 
AND MERCHANT_CD = '0001'  --점코드? 
AND ITEM_CD = '00147268'  --상품코드 
AND LIMIT_SALE_YN ='Y'    --한정판매 여부 
--==============================================================================================================

- 주문관리 수정 
- 주문접수한 상품 일정기간(15일) 후 주문취소 개발 
주문접수(일정기간(15일) 지난 뒤  -----> 주문 취소(한정 수량 증가)): SP로 Cron_job 활용 
==============================================================================================================

dlog("[ItemMgrBean.java]::[getMerchantItemDetail()]::[p_company_cd]"+ (String)inputHash.get("p_company_cd") +"" + 
"[p_merchant_cd(점명)]"+ (String)inputHash.get("p_merchant_cd")+"[p_item_cd]"+(String)inputHash.get("p_item_cd"));  
dlog("[ItemMgrBean.java]::[getMerchantItemDetail()]:[SQL]===>\n"+ SQL);  
==================================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.05.15(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 18:00 흐림 

- 통합 수정
 야유회 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.17(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 22:00 ==> 맑음  

- 협력업체 수정
- 마트 관련 거래처에 영업 중지건 공지  
T_ENTERPRISE_FOR_MART 
MS-SQL DB 210.123.133.121 sa/project 
------------------------------------------------------------------------------------------------------  
  
-- SK 글로벌(00002 B0000002/8015) 대백유통(00046 B0000046/4888)             ==========> 마트 관련 거래처 
-- 모션위즈(45086 B0087207/87207) 프라이스데이(00002 B0000602/pr55036) 
-- (주)씨앤씨클럽(45086 B0000404/4926) Ace inc(00002 B0000286/4166) 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 ==> 맑음 

- 통합 수정
-- 구매 한정 수량 초과여부 확인 
==================================================================================================================

- 장바구니 담기(/cart/cartGetP.jsp), 바로구매(/order/rnf/checkRnFSes.jsp) 
00011134: 스템 스페셜 
장바구니 담기, 바로구매에서 한정수량 체크 
상품주문(결재완료) 후 한정수량 감소 

- 주문작성(orderPutP_2.jsp) --> orderPut_3.jsp  --> 주문확인(orderPutP_4.jsp) 
==================================================================================================================

/orderPut_3.jsp 에서  
try {  
//주문을 넣는다. 
retHash = (Hashtable)cart.addOrderInfo(request); //4=주문을 넣자  
} 
=================================================================================================================

/CartBean.java 에서 @@@@@@@@  
public Hashtable addOrderInfo(HttpServletRequest req) throws Err { //주문을 입력한다. 

//주문입력 (최종) 
retHash = ordsvc.addOrderInfo(ordInfoHash); 
} 
=================================================================================================================

/OrderSvcBean.java 에서 @@@@@@@@  
public Hashtable addOrderInfo(Hashtable inputHash) throws Err { //주문 정보 입력 

//모든 주문정보 완성 
try { 
//조회해서 입력해야되는 정보 및 계산되어야 하는항목의 값을 계산한다. 
makeAllOrderInfo(inputHash); 

//R&F주문인 경우 수량이 2개이상인 경우 별도의 레코드로 입력될 수 있도록 
//Vector의 Row를 펼친다.(하나의 상품은 하나의 레코드로 만든다)  
makeMultiRowRnFItem(inputHash); 

//주문마스타입력 
retHash = addOrderMaster(inputHash); 

//주문상세정보 입력 
addOrderItem(inputHash); 

//결제정보 입력       ====================================> 
addOrderAr(inputHash); 

//포인트정보 입력 
addSalePoint(inputHash); 

//쿠폰정보 입력 
updateCoupon(inputHash); 

//매출정보 입력 
callSaleMgr(inputHash); 

//한정판매 상품인 경우 재고 마이너스 =============> 
updateLimitSaleQty(inputHash); 

//결과화면을 보여주기 위한 정보 
retHash.put("ordHash",inputHash); 
} 
} 

public Hashtable updateLimitSaleQty(Hashtable inputHash) throws Err { //한정판매 상품이 주문된 경우 한정수량을 조정 

//한정판매 상품 재고조정 
String SQL = "" ; 
SQL +="UPDATE T_MERCHANT_ITEM " + 
" SET LIMIT_SALE_QTY = LIMIT_SALE_QTY - ? " + 
" WHERE COMPANY_CD = ? " + 
" AND MERCHANT_CD = ? " + 
" AND ITEM_CD = ? " ; 

/*================================================*/ 
// DB 파라미터 설정 
Vector param = new Vector(); 

//주문상품정보 
Vector p_itemVec = (Vector)inputHash.get("p_itemVec"); 

for(int i = 0; i < p_itemVec.size(); i++) { 
ParamType rowparam = new ParamType(); 
Hashtable rowHash = (Hashtable)p_itemVec.elementAt(i); 
String p_limit_sale_yn = getData("p_limit_sale_yn",rowHash); 

//한정판매상품인경우만 수행한다 
if(p_limit_sale_yn.equals("Y")){ 
rowparam.put(1,getData("p_qty",rowHash),Code.DB_LONG); 
rowparam.put(2,p_company_cd,Code.DB_VARCHAR); 
rowparam.put(3,p_merchant_cd,Code.DB_VARCHAR); 
rowparam.put(4,getData("p_item_cd",rowHash),Code.DB_VARCHAR); 

param.addElement(rowparam); 
} 
} 

//데이터 호출 입력값을 저장한다. 
Hashtable _qryhash = new Hashtable(); 
_qryhash.put("SQL",SQL); 
_qryhash.put("param",param); 

/*==================================================*/ 
// 리턴 데이터를 저장한다. 
Hashtable retHash = null; 

try{ 
//한정판매상품재고조정 
if(param.size() > 0) 
retHash = setMMData(_qryhash); 
}  
return retHash; 
}//End of updateLimitSaleQty() 
=================================================================================================================

- 주문관리/입금 확인 
http://int.i3shop.com/BizMgr/SaleMgr/WebOrderMgr/standByReceiptsP.jsp 
400905999999709 
9410472589785100 
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.19(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 ==> 맑음 

- 통합 수정
- 입금확인 수정 
은행 입금 대기 주문 내역 조회(T_ORDER A, T_ORDER_DTL B, T_AR C) 
==================================================================================================================

- 구매 한정 수량 초과여부 확인(신용카드) 
VISA(안심), ISP, 기타 ===> VAN사 
 주문작성(orderPutP_2.jsp) --> orderPut_3.jsp  --> 주문확인(orderPutP_4.jsp) 
==================================================================================================================

/orderPutP_2.jsp 에서 @@@@@@@@ 
<script language="JavaScript"> 
<!-- 
//------------------------------------------------------------------------------------------------------ --------------------- 
// 입력 체크 및 금액 셋팅 / ISP, 안심클릭 인증 함수  
//------------------------------------------------------------------------------------------------------ --------------------- 
function confirmFld(frm) { 

if (clickflag) { 
return; 
} else { 
clickflag = true; 
msg.innerHTML = "<font color=red>결제 처리중입니다. 잠시만 기다려 주십시요.</font>"; 
} 

   var arwaycd = "<%= disp_ar_way_cd%>";   //결제방법 

 //나이스정보통신 ISP결제 외부플러그인 함수 호출 --------------------- 
 //ISP인증 체크 ------------------------------------------------------ 
 if (arwaycd=="05"  arwaycd=="06") { 

    frm.KVP_PRICE.value = SelectNum(frm.p_ar_amt_cd.value); 
    if (MakePayMessage(frm) == true) { 
       frm.submit(); 
        
    } else { 
       alert("지불에 실패하였습니다."); 
       clickflag = false; 
       msg.innerHTML = btnViewStr; 
    } 
 } 

 //나이스정보통신 안심클릭 인증절차 수행----------------------------------------- 
 //XPayMPIProcess(몰코드, 몰이름, 카드번호, 유효(년), 유효(월), 금액, 할부, 설명); 
 else if (arwaycd=="09"  arwaycd=="10") {  
    XPayMPIProcess("2101", "NICE", frm.p_card_no.value,  frm.p_extension_day1.value, frm.p_extension_day2.value, 
    frm.p_amt_cd.value, frm.p_quota_month.value, ""); 
 }   
//------------------------------------------------------------------- 
 // JSP전이 : 입력체크 및 금액확인 / ISP인증 완료 및 결제 진행 
 //------------------------------------------------------------------- 
 else { 
    frm.submit(); 
 } 
 } 
==================================================================================================================

- 주문 접수 취소(R&F, pmh19) 
http://210.123.133.31:5001/BizMgr/SaleMgr/WebOrderMgr/orderCancelP.jsp  
==================================================================================================================

- 주문 접수 취소  -->  환불처리(카드): 카드 + 현금 
주문자 : 김종숙 
원주문번호 : 0100012004050700088 
반품주문번호: 0100012004051700611 
금액 : 200,000원 

SELECT ORDER_NO, ORDER_DT, ORDER_STS 
FROM T_ORDER 
WHERE COMPANY_CD ='01' 
AND MERCHANT_CD ='0001' 
AND ORDER_DT ='20040507' 
AND ORDER_NO ='00088' 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 
  
- 통합 수정
- 구매 한정 수량 초과여부 확인(신용카드) 
VISA(안심): 결제방법(arwaycd)이  05, 06 인 것 
ISP: 결제방법(arwaycd)이  09, 10 인 것 
기타 카드: 결제방법(arwaycd)이  02, 03 인 것 
OFFLINE신용카드: 결제방법(arwaycd)이  07, 08인 것 
-------------------------------------------------------------------------------------------------------------------------- 

//disp_ar_way_cd-------output--- 
//01=현금결제             (단독) 
//02=카드결제             (단독) ==========> 
//03=현금+카드            (복합) ==========> 
//04=R&F머니              (단독) 
//05=ISP결제              (단독) ==========> 
//06=현금+ISP결제         (복합) ==========> 
//07=OFFLINE신용카드      (단독) ==========> 
//08=현금+OFFLINE신용카드 (복합) ==========> 
//09=안심클릭             (단독) ==========> 
//10=현금+안심클릭        (복합) ==========> 
//------------------------------------------------------------------------------------------------------ 

- 장바구니 담기(/cart/cartPut.jsp): DB상품과 개별 상품 
바로구매(/order/rnf/checkRnFSes.jsp): DB상품과 장바구니에 담긴 상품 비교 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 
  
- 통합 수정
-- 구매 한정 수량 초과여부 확인(신용카드) 
VISA(안심): 결제방법(arwaycd)이  05, 06 인 것 
ISP: 결제방법(arwaycd)이  09, 10 인 것 
기타 카드: 결제방법(arwaycd)이  02, 03 인 것 
OFFLINE신용카드: 결제방법(arwaycd)이  07, 08인 것 
==================================================================================================================

- 카드 결재 후 삭제  -- 9410468398418016 
T_ORDER 상태: 접수취소(RDER_STS ='00') T_ORDER_DTL 
T_STOREOUT: 삭제 T_STOREOUT_DL: 삭제 
System.out.println("[getBuyingRemittanceMListB.jsp]::[p_order_no]"+ getData("p_order_no",inputHash));  
==================================================================================================================

 SELECT * FROM T_STOREOUT_DTL 
WHERE COMPANY_CD ='01' 
AND MERCHANT_CD = '0001' 
AND STOREOUT_DT ='20040522' 
--AND STOREOUT_NO ='00007'  
AND REG_ID = 'test01' 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.22(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 17:30 ==> 맑음 
  
- 통합 수정
- 구매 한정 수량 초과여부 확인 
실서버 등록(111, 112, 113)  
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 
  
- 통합 수정
- 출고상세정보 입력 
-- 주문접수한 상품 15일후 주문취소 SP 개발 
--> 주문취소(한정수량 증가) 
==================================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.05.25(화)) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 
  
- 통합 수정
- 출고상세정보 입력 
- 주문접수한 상품 15일후 주문취소 SP 개발 
 --> 주문취소(한정수량 증가) 
==================================================================================================================

UPDATE T_ORDER SET ORDER_STS ='00' 
SELECT *  
FROM T_ORDER A 
UPDATE T_ORDER  
SET ORDER_STS ='02' -- 접수취소 
	WHERE  A.COMPANY_CD = '01'  
	AND A.MERCHANT_CD = '0001' --협력업체분만 처리 
	AND ORDER_STS ='01' --주문접수 
	AND ORDER_DT >= TO_CHAR(SYSDATE - 16, 'YYYYMMDD') 
--==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 ==> 맑음 
  
- 통합 수정
- 출고상세정보 입력 
- 주문접수한 상품 15일후 주문취소 SP 개발 
 --> 주문취소(한정수량 증가)  
- 주문 접수 취소(/BizMgr/SaleMgr/WebOrderMgr/orderCancelP.jsp) 
--> 접수취소(한정수량 증가) 
==================================================================================================================

dlog("[SaleMgrBean.java]::[cancelOrderByMoneyOnly()]::[p_company_cd]"+ p_company_cd +"" + 
"[p_merchant_cd]"+ p_merchant_cd +"[p_up_id]"+ p_up_id +"[p_up_ip]"+ p_up_ip +"" + 
"[p_order_dt]"+ p_order_dt +"[p_order_no]"+ p_order_no); 
dlog("[SaleMgrBean.java]::[cancelOrderByMoneyOnly()]:[SQL]===>\n"+ sql); 
==================================================================================================================

- PDA 관련 프로그램 구현 정보 조사 
1. PDA 제품모델명  
PA960(유니텍) 
2. 개발 툴 
MS WIN CE for VB toolkt: OCX, Library 많이 제공 -> EVB의 발전된 형태 
판매사(청우하이테크)에 프로그램 요청(라이센스 문제) 
3. 서버 데몬 구성 
MLM서버 데몬과 유사하게 구성 
4. 바코드 스캔 
샘플 프로그램 요청(EVB용) 
5. 기타 
프로그램 상담: 김경민 주임 * 
기타 상담: 정성욱 053-626-4164/ * 
c.f)트리톤(사이버뱅크:조립품) 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 흐림 
  
- 통합 수정
- 주문 접수 취소(/BizMgr/SaleMgr/WebOrderMgr/orderCancelP.jsp) 
--> 접수취소(한정수량 증가) 
==================================================================================================================

- 수불장 출력 
물류L&B상품(2004년 1월 ~ 4월) 
물류R&F상품(2004년 1월 ~ 4월) 
마트상품(2004년 1월 ~ 4월) 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 16:00 ==> 맑음 
  
- 통합 수정
- 주문 접수 취소(/BizMgr/SaleMgr/WebOrderMgr/orderCancelP.jsp) 
--> 접수취소(한정수량 증가) 
- 주문배송조회(쇼핑몰)(/inquiry/orderMasterP.jsp?p_page=1&p_order_dt=20040514&p_order_no=00478) 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.05.31(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 06:50 ~ 23:00 ==> 오전에 비온 후 갬 
  
- 통합 수정
- 주문접수한 상품 15일후 주문취소 SP 수정 
http://ddlchigi.ce.ro/ 
http://ybstar.ly.to/ ==> 무료 영화 
http://qemaxmania.com/movie_own_japan.htm 
http://Yejinassi.com 
--------------------------- 
http://sex-ampm.com/ 
--------------------------- 
http://sexymax.ce.ro/ 
http://www.sexcoree.com/  
http://erozn.com/new/pages/realmovie1.php  
 http://www.5000sex.com/?intro=C 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■