

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.07) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.07.01(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 구름 

- 쇼핑몰 수정
- 명품관 최종 수정 
==============================================================================================================

-- 하위 카테고리 상품정보 조회 @@@@@@@@@@@@@   ========> 브랜드 SHOP 이면 (DKNY) 
SELECT CATEGORY_CD, CATEGORY1_NM 
FROM T_CATEGORY  
WHERE COMPANY_CD = '01' 
 AND STORE_CD = 'S063'    --매장코드(S001:L&B매장) 
 AND USE_YN = 'Y'        --사용여부 
 AND PCATEGORY_CD like 'T32011300%'      --상위카테고리코드 
==============================================================================================================
 
-- 하위 카테고리 상품정보 조회 @@@@@@@@@@@@@    ========> 아이템 SHOP 이면(지갑/키홀더) 
SELECT CATEGORY_CD, CATEGORY1_NM 
FROM T_CATEGORY  
WHERE COMPANY_CD = '01' 
 AND STORE_CD = 'S063'    --매장코드(S001:L&B매장) 
 AND USE_YN = 'Y'        --사용여부 
 AND PCATEGORY_CD like 'T32020200%'      --상위카테고리코드 
==============================================================================================================

-- 테스트 쇼핑몰 (.55) 재시작 
[root@testCcdom DisplaySvc]# cd /  
[root@testCcdom /]# cd /opt/WebSphere/AppServer/bin/ 
[root@testCcdom bin]# ./wscp.sh  
wscp> ApplicationServer list 
{/Node:testCcdom/ApplicationServer:Default Server/} 
wscp> ApplicationServer stop {/Node:testCcdom/ApplicationServer:Default Server/} 
wscp> ApplicationServer start {/Node:testCcdom/ApplicationServer:Default Server/} 
==============================================================================================================

-- 테스트 쇼핑몰 (.55) 재시작 로그 보기 
[root@testCcdom root]# cd /home 
[root@testCcdom home]# cd /opt/WebSphere/AppServer/logs/ 
[root@testCcdom logs]# ls -a 
[root@testCcdom logs]# tail -f Default_Server_stdout.log 
==============================================================================================================

- 반품관리 점검
환불처리(카드) 
http://210.123.133.31:5001/System/AclMgr/Refund/refundForCardMainP.jsp 
주문번호: 0100012004020900700 
주문번호: 0100012004062900629 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.02(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 08:00 ==> 철야(비옴)

- 쇼핑몰 수정
- 반품관리 점검
환불처리(카드) 
http://210.123.133.31:5001/System/AclMgr/Refund/refundForCardMainP.jsp 
--------------------------------------------------------------------------------------------------------------------------

- 주문번호: 0100012004020900700 
T_AR 
ORDER_NO = '00700', ORDER_DT = '20040209', AR_STS = '21' --결제상태(20:카드취소예정, 21:카드승인) 
ORDER_NO = '00162', ORDER_DT = '20040628', AR_STS = '20' --결제상태(20:카드취소예정, 21:카드승인) 
==============================================================================================================

-- 0100012003110100385   0100012003110100143   0100012003103100840   0100012003103100347   0100012003103100282    
-- 0100012003100601092   0100012003100601068   0100012004021000028   0100012004021000027   0100012004020900727 
-- 0100012004020900700 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.03(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  비 

- 쇼핑몰 수정
- 결제 수정 
안심클릭 신용카드(LG) - TG CORP 결제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:10 ~ 23:30 ==> 맑음 

- 쇼핑몰 수정
- 안심클릭,  ISP 결제 
결제하기(orderPutP_1.jsp)  --> 주문서 작성(orderPutP_2.jsp)   
--> 주문 저장(orderPut_3.jsp) --> 주문확인(orderPutP_4.jsp) 
------------------------------------------------------------------------------------------------------------------- 

- 안심클릭 신용카드(LG) 결제 ========> 정확함 
결제하기(orderPutP_1.jsp)  --> 주문서 작성(orderPutP_2_TG.jsp)   
--> 주문 저장(orderPut_3_TG.jsp) --> 주문확인(orderPutP_4.jsp) 
-------------------------------------------------------------------------------------------------------------------

- 안심클릭 신용카드(LG) 결제 
결제하기(orderPutP_1.jsp)  --> 주문서 작성(orderPutP_2_TG.jsp)   
--> 창 띄우기(orderPut_3_TG1.jsp) --> 주문확인(orderPut_3_TG2.jsp) 
--> 주문확인(orderPutP_4.jsp) 
==============================================================================================================

// String p_re_category_cd = (request.getParameter("p_re_category_cd")== null) ? "": request.getParameter("p_re_category_cd"); 
out.println("[/order/orderPut_3_TG2.jsp]::[domain]"+ domain +"<br>"); 
 
- 티지(I-yes 서울, I-yes 인천)  
https://npg.tgcorp.com/mdbop/login.jsp  
ID: i3shop9032 pass: i3shop9001 02-2187-2778 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.07.06(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 ==> 맑음 

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 ========> 정확함 
결제하기(orderPutP_1.jsp)  --> 주문서 작성(orderPutP_2_TG.jsp)   
--> 주문 저장(orderPut_3_TG.jsp) --> 주문확인(orderPutP_4.jsp) 
==============================================================================================================

<%--####################### //    HIDDEN값 설정      //// ############################## --%>   
<input type='text' name='MxID' value='<%=mxid%>'> 
<input type='text' name='MxOTP' value='<%=mxotp%>'> 
<input type='text' name='MxIssueNO' value='<%=mxissueno%>'> 
<input type='text' name='MxIssueDate' value='<%=mxissuedate%>'> 
<input type='text' name='Amount' value='<%=amount%>'> 
<input type='text' name='URL' value='<%=url%>'> 
<input type='text' name='DLPDir' value='<%=redirpath%>'> 
<input type='text' name='DLPFile' value='/auready.jsp'> 
<input type='text' name='URL_1' value='support.nbluepay.com'>  
<input type='text' name='DBPATH' value='/sc/test/dbpath.jsp'> 
<input type='text' name='REDIRPATH' value='<%=redirpath%>'> 
<input type='text' name='Smode' value='3001'>  
<input type='text' value=Amount name=ItemType> 
<input type='text' value=1 name=ItemCount>  
<input type='text' value=1 name=VERSION>  
<input type='text' value=support_centar_test name=MSTR>  
<input type='text' value=testcorp  name=CcOwnerName>  
<input type='text' value=test_product name=CcProdDesc>    
<%--################################################################################### --%>   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.07(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:10 ~ 00:00 ==> 철야(비옴)

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 ========> 정확함 
결제하기(/order/orderPutP_1.jsp)  --> 주문서 작성(/order/orderPutP_2_TG.jsp)   
DBPATH    ===> 주문 저장(/order/dbpath.jsp) 
REDIRPATH  ===> 주문확인(/order/orderPutP_4.jsp) 
-------------------------------------------------------------------------------------------------------------------

- 기술지원 02)3438-3564 김응주 *@*.* 
고객지원 02)3438-3556/3557 *@*.* 
==============================================================================================================

- 명품관 추가 수정
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.07.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 00:00 ~ 23:00 ==> 구름 

- 쇼핑몰 수정
- 명품관 오픈 
==============================================================================================================

- 안심클릭 신용카드(LG) 결제 
orderPutP_2_TG.jsp 에서 @@@@@@@@ ------------------------------- 

<%-- 장바구니 리스트 보이기 --%> 
<jsp:include page="/order/cartListDispS.jsp" flush="true" /> 

<%-- 고객정보 보이기 --%> 
<jsp:include page="/order/orderMemInfoDispS2.jsp" flush="true" /> 

<%-- 결제정보 입력 --%> 
<%@ include file="/order/arInputS.jsp" %> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 
  -----------------------------------------------------------------------------------------------------------------------

-- TGCORP 결제인 경우([/CallExternalSystemBean.java]:[getPGEntrInfo()]) 
1. 기타 카드이고 ISP가 아닌 국민카드 
2. 기타 카드이고 비즈센터가 (I-yes 서울, I-yes 인천) 인 경우(p_bizcenter_cd: B037, B025) 
-----------------------------------------------------------------------------------------------------------------------

-- NICEPAY 결제인 경우([/CallExternalSystemBean.java]:[getPGEntrInfo()]) 
1. 안심클릭 결제 여부(LG카드이고 R&F주문) 
NICE_TID_3=2023 로 보냄 
2. 안심클릭 결제 여부(LG카드 외 카드이고 R&F주문) 
NICE_TID_1=3596 로 보냄 
-----------------------------------------------------------------------------------------------------------------------

- p_order_dtl_tp_cd: 주문발생 상세유형 코드(일반(01) 혹은 R&F(02)) 
TERMINAL_NO: 단말기번호 
MXOTP: 가맹점 OTP 
---------------------------------------------------------------- 

<====== 단말기번호 ======> 
#real info #오픈전에 절대로 열지 말것 
TGCORP_TID_1=i3shop9031 -- R&F 
TGCORP_TID_2=i3shop9032 
TGCORP_TID_3=i3shop9033 

#real info #오픈전에 절대로 열지 말것 
NICE_TID_1=3596 -- R&F 
NICE_TID_2=3597 
NICE_TID_3=2023 
---------------------------------------------------------------- 

-- 카드BIN정보로 카드사를 조회 
SELECT * FROM T_CARD_BIN 
WHERE CARD_BIN LIKE '400910%' 
AND ROWNUM = 1 
-----------------------------------------------------------------------------------------------------------------------

BILL.billlog("[/CallExternalSystemBean.java]:[getPGEntrInfo()]:[ISP 카드결제 방식을 사용함 !!! 종료]"); 
==============================================================================================================

- 티지 (I-yes 서울, I-yes 인천) 
https://npg.tgcorp.com/mdbop/login.jsp  
ID: i3shop9032 pass: i3shop9001 9410468398418016 
==============================================================================================================
 
- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama339 
200902/9597 
CVC: 891 
640712 - 1703812 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.10(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 14:00 ==> 흐린 후 가끔 소나기 

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ID: ith3597 pass: 3597 02-2187-2778 
R&F ==> ID: its2023 pass: its2023 
--------------------------------------------------------------------------------------- 

- 티지 (I-yes 서울, I-yes 인천)  
https://npg.tgcorp.com/mdbop/login.jsp  
ID: i3shop9032 pass: i3shop9001 kvp 02-871-6622 
==============================================================================================================

- 리셀러 어드민(PV, VB 수정) 
PV, VB --> real PV, real VB 
==============================================================================================================

- 보안관련 책
강유의 해킹 & 보안 노하우(강유,정수현 공저/에이콘출판사 2003년 04월/35,000원) 
==============================================================================================================

- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/339 9410468398418016   
200902/9597 
CVC: 891 
640712 - 1703812 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:30 ==> 흐림 

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제  
기술지원 02)3438-3564 *@*.* 
==============================================================================================================

/order/orderPutP_2.jsp 에서 --------------------- 인증 하기 ==========>  
<script language="JavaScript"> 
	sendMPI( 대표가맹점 ID, 가맹점 상호, 카드번호, 통화, 유효기간, 할부개월수, 금액,  리턴 URL); 
</script> 
==============================================================================================================

/CardPayForVISA.java 에서 --------------------- 승인 하기 ==========>  (지원 안 함)   
public Hashtable approvalTGCORP_VISA(Hashtable arHash, Hashtable inputHash) throws Err { 
} 
==============================================================================================================

/CartBean.java 에서  @@@@@@@@@  
public Hashtable addOrderInfo(HttpServletRequest req) throws Err { 

// 주문입력 (최종) 
retHash = ordsvc.addOrderInfo(ordInfoHash); 
} 
==============================================================================================================

/OrderSvcBean.java 에서  @@@@@@@@@ 
public Hashtable addOrderInfo(HttpServletRequest req) throws Err { 

//조회해서 입력해야되는 정보 및 계산되어야 하는항목의 값을 계산한다. 
makeAllOrderInfo(inputHash); 

//R&F주문인 경우 수량이 2개이상인 경우 별도의 레코드로 입력될 수 있도록 
//Vector의 Row를 펼친다.(하나의 상품은 하나의 레코드로 만든다)   
makeMultiRowRnFItem(inputHash); 

//주문마스타입력 
retHash = addOrderMaster(inputHash); 

//주문상세정보 입력 
addOrderItem(inputHash); 

//결제정보 입력         =======================> 
addOrderAr(inputHash); 

//포인트정보 입력 
addSalePoint(inputHash); 

//사이버머니 정보 입력 
addSalePointCyberM(inputHash); 

//쿠폰정보 입력 
updateCoupon(inputHash); 

//매출정보 입력(결제완료된 주문에 대해서 출고지시):  카드 or 포인트 일때 ===> T_STOREOUT, T_STOREOUT_DTL 
callSaleMgr(inputHash); 

//한정판매 상품인 경우(재고 마이너스) 
updateLimitSaleQty(inputHash); 
} 
==============================================================================================================

ntln("[/order/return.jsp]:[resCode] "+ resCode +"[resMsg]"+ resMsg +"[txNO]"+ txNO +"[XID]"+ XID + 
"[CAVV]"+ CAVV +"[ECI]"+ ECI +"[AppNO]"+ AppNO +"[AppTime]"+ AppTime +"[CardAppCode]"+ CardAppCode + 
"[AppMsg]"+ AppMsg +"[AppIssCode]"+ AppIssCode +"[AppIssName]"+ AppIssName + 
"[AppAcqCode]"+ AppAcqCode +"[AppAcqName]"+ AppAcqName +"[CcMemberNO]"+ CcMemberNO); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:30 ==> 맑음 

- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 
안심 LG카드만 창 띄울 수 없음(창이 띄면서 3개 선택 창 나옴) =========> 잠정 보류 
-------------------------------------------------------------------------------------------------------------------

- 신용카드 결제 수정(데이타 저장 후 결제) 
ORDER_STS: 주문상태(02: 접수취소) 
==============================================================================================================

- 발주내역 엑셀 수정 
http://210.123.133.31/VendorMgr/PoState/orderDtlP.jsp 

- 대금정산 
http://210.123.133.31/VendorMgr/SettleInfo/storeOutDtlP.jsp 
==============================================================================================================

- 배송 검수(점포영업관리/배송관리)에서 거래처번호를 잘못 등록 했을 때   
SELECT * FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_NO ='00692' 
AND ORDER_DT ='20040712' 

UDPATE T_ORDER_DTL 
SET  ENTR_NO = '00117',  -- 거래처번호 수정 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_NO ='00692' 
AND ORDER_DT ='20040712' 

UDPATE T_STOREOUT 
SET ENTR_NO = '00117',  -- 거래처번호 수정 
WHERE COMPANY_CD = '01' 
AND RECV_MERCHANT_CD = '0001' 
AND RECV_NO ='00692' 
AND RECV_DT ='20040712' 
---------------------------------------------------------------------------------------------------------- 

UDPATE T_STOREOUT 
SET  STOREOUT_END_DT = '20040713',  -- 출고완료 일자 
STOREOUT_STS = '09'  -- 배송완료 
WHERE COMPANY_CD = '01' 
AND RECV_MERCHANT_CD = '0001' 
AND RECV_NO ='00692' 
AND RECV_DT ='20040712' 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 비 
  
- PDA 수정
- 소켓 통신 문제 \
A. 서버에서 : 바이트형으로 보내기  @@@@@@@@@@@
Dim sendPacket() As Byte 
ReDim sendPacket(50)      '배열을 초기화 
WinSock1.SendData sendPacket 
----------------------------------------------------------------------------------------------------------- 

B. 클라이언트에서 : 바이트형으로 받기  @@@@@@@@@@@
WinSock1.GetData 함수의 2번째 인자에  
vbByte + vbArray 이렇게 넣어 주면 바이트형 배열로 받는다고 하네요.. 

WinSock1.GetData rbuff 
txtRecData = txtRecData & rbuff & vbCrLf 
TotBytes = TotBytes + bytesTotal 
==============================================================================================================

packet = StrConv("C600" & DELI & imageSize & DELI & Trim(txtDefaultFold.Text) & Mid(txtFileNameBu.Text, 
InStrRev(txtFileNameBu.Text, "\") + 1, Len(txtFileNameBu.Text)), vbFromUnicode) 

If UBound(packet) > 0 And Winsock.State = sckConnected Then 

Winsock.SendData packet 
DoEvents  
End If 
==============================================================================================================

Private Sub Winsock1_DataArrival(ByVal bytesTotal As Long)  
	Dim Down As String 
	Dim Num As Integer 

	Winsock1.GetData Down 
	Label1.Caption = Down 
	Text1.Text = Label1.Caption 
	Num = Len(Down) - 2 
	With MSFlexGrid1 
	Dim I As Integer 
	.Rows = .Rows + 1 
	I = .Rows - 1 
	     
	.TextMatrix(I, 0) = Down 
	End With 

End Sub 
==============================================================================================================
 
http://www.devbuzz.com/search/search_index_server.asp  
PC에서 아예 MultiByteToWideChar를 사용해서 UNICODE를 전송하든가, 아니면 PDA에서 ASCII로 받든 데이터를 
MultiByteToWideChar를 써서 UNICODE로 전환 후에 사용하는 방법입니다.  

또는, CSocketFile과 CArchive를 쓰시면 어러한 코드 전환을 신경쓰지 않고 코딩하실 수 있습니다. 
CArchive라는 Class에서 알아서 해당 코드로 전환을 해주기 때문입니다. 
==============================================================================================================

- PDA에서 DB연동 프로그램 @@@@@@@@@@@ 
1. Oracle 9i lite  
상용 툴로서 별도 라이센스 구입을 하셔야 합니다.. 
개발기간을 상당히 단축할 수 있는 놈이죠..! 
2. DB Server Application 
중간에서 PDA 와의 Socket통신값으로 DB를 쿼리하여 다시 PDA에게 결과값을 return해주는 방법으로 제작하셔야 합니다 
일반적은 DB검색 프로그램에 Socket통신 모듈 붙어서 PDA와 통신하는거라고 보시면 간단하게(?) 개념을 잡으실수 있을겁니다
3. PDA Local DB 
재고관리처럼 엄청난(?)양의 DB라면은 이 방법은 솔직히 권하고 싶지 않은(?) 방법중의 하나군요..;; 
모든 작업은 PDA의 Local DB에서처리되고 PC와 Sync되었을때 해당정보를 업뎃 하는 방법으로 구현됩니다..... 
==============================================================================================================

1. 한번에 보낼수 있는 최대 길이가 얼마인지 궁금하네요.  
소켓에서 하나의 패킷이 보내질때는 IP에 의해서 보집니다..  
그래서 소켓에서 한번에 보낼수 있는 최대 사이즈는 IP 최대사이즈로 보낼수 있습니다.. 그 사이즈는 64k로 알고 있습니다.. 
그러나.. 보통 소켓을 열때 tcp로 열기 때문에 아주 큰 사이즈의 데이터라도 tcp계층(트랜포트계층)에서 ip 사이즈에 맞게  
나누어서 보내지고 받는쪽에서 알아서 합쳐집니다(나누어서 오기도합.. ^^;;;)...  하지만 너무 큰 사이즈를 보내면  
에러  발생율(tcp패킷의 checksum으로 확인)이 높아져서 효율이 떨어집니다..  
제가 알기로는 1k에서 5k정도로 최대 사이즈를 잡는것이 좋을거 같네요...  
한번에 보낼수 있는 최대 사이즈는 님이 직접 테스트를 통해서 가장 효율적이라고 생각하는것을 정하는것이 좋습니다... 

2. 문자열말고 배열이나... 다른 형식으로는 통신이 가능한지요. 
2. vc에서는 구조체를 만들어서 데이터를 보내지만 vb에서는 그렇게는 못하고 구조체를 만들어서 보낼때 바이트형 배열로 
전환하던지  아예 바이트형에 넣고 보내는걸로 알고 있습니다..  

Dim sendPacket() As Byte 
ReDim sendPacket(50)      '배열을 초기화 
...  sendPacket에 데이터를 넣어줌.. 
WinSock1.SendData sendPacket 

받을때는  
WinSock1.GetData 함수의 2번째 인자에  
vbByte + vbArray 이렇게 넣어 주면 바이트형 배열로 받는다고 하네요.. 
==============================================================================================================

글 쓰신 내용을 보니까 winsock통신아니고 mscomm을 사용하신거  
보니까 시리얼통신을 사용 하시는거 같은데 socket통신에서는  
파일의 구분자(STX,ETX)를 첨가하여 소켓 컨트롤을 통해 송수신을 합니다. 
님께서 고민하시는 부분은 시리얼 통신이라는 생각이 듭니다. 
도움이 되었으면 합니다. 

보낼때 반드시 Timedelay를 어느정도 시켜줘야 데이터가 연속적으로  
보내어 집니다.(serial통신을 할 경우 꼭 사용하는 것이 좋습니다.) 

Public Sub Send_Data(s_dat As String) 
    Dim i As Integer 
    For i = 1 To Len(s_dat) 
       MSCom.Output = Mid(s_dat, i, 1) 
       TimeDelay (0.001) 
    Next i 
End Sub 

Public Sub TimeDelay(dt!) 
    Dim dt1! 
    Dim dt2! 
    Dim dt3! 
    dt1! = Timer 
    Do 
       dt2! = Timer 
       dt3! = dt2! - dt1! 
       If dt3! < 0 Then dt3! = dt3! + 86400! 
    Loop Until dt3! >= dt!   
End Sub 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:15 ~ 23:00 ==> 비 
  
- PDA 수정
- 소켓 통신 문제 
A. 서버에서 : 바이트형으로 보내기  @@@@@@@@@@@ 
Dim sendPacket() As Byte 
ReDim sendPacket(50)      '배열을 초기화   
WinSock1.SendData sendPacket 
----------------------------------------------------------- 

B. 클라이언트에서 : 바이트형으로 받기  @@@@@@@@@@@ 
WinSock1.GetData 함수의 2번째 인자에  
vbByte + vbArray 이렇게 넣어 주면 바이트형 배열로 받는다고 하네요.. 

WinSock1.GetData rbuff 
txtRecData = txtRecData & rbuff & vbCrLf 
TotBytes = TotBytes + bytesTotal 
==============================================================================================================

A. 접속 일 때   @@@@@@@@@@@ 
1. 클라이언트에서 
Private Sub cmdStart_Click() 
'// 서버에 접속 시도 
  Winsock1.Connect     
End Sub 
--------------------------------------------------------------------------------------------------------- 

2. 서버에서 
'// 청취중에 클라이언트가 연결을 시도하는 경우 서버에서 
'// 아래와 같은 이벤트가 발생한다. 
Private Sub Winsock1_ConnectionRequest(ByVal requestID As Long) 
    Lst소켓상태.AddItem "Socket1에 연결 요청이 들어옮"      
    '// 서버는 청취중이므로 청취를 종료한다. 
    Winsock1.Close      
    '// 해당 요청ID를 접수하여 연결을 허용한다. 
    Winsock1.Accept requestID   
End Sub 
==============================================================================================================

B. 전송 일 때   @@@@@@@@@@@ 
1. 클라이언트에서 
Private Sub cmdSendMessage_Click() 
	If Winsock1.State = sckConnected Then     
		Label1.Caption = "서버와 접속 이 완료 되었습니다" 
		S_Data = "SearchBarcode" & Chr(27) & "shaker" & Chr(28) & "shaker"     '전송할 DATA ==================> 
		S_Data_Count = CheckSendData(S_Data) '총 Byte 수 

		Call Send_Data_Socket(S_Data, S_Data_Count) 
		Label1.Caption = "로그인정보를 인증중입니다"  
	End If 
     
End Sub 

Private Sub Send_Data_Socket(ByVal str As String, ByVal S_Count As Long)  
	 '132 byte 보다 작다면 자리수를 맞춘다 
	 If LenB(str) < 264 Then 
	    str = str & AscLeft(Space(132 - (LenB(str) / 2)), 132 - (LenB(str) / 2)) 
	 End If 

	If Winsock1.State = sckConnected Then     '소켓이 살아 있다면 
	Winsock1.SendData str  
	End If 
End Sub 
 ----------------------------------------------------------- 

2. 서버에서 
'// 클라이언트가 보낸 데이터를 받았을 때 발생하는 이벤트 
Private Sub Winsock1_DataArrival(ByVal bytesTotal As Long) 
    Dim sData               As String 
     
    '// 받은 자료를 vbString 즉 유니코드롤 컨버팅해서 받는다. 
    Winsock1.GetData sData, vbString, bytesTotal      
    '// 받은 자료의 내용을 상태 리스트에 Display한다. 
    Lst소켓상태.AddItem "받은 자료    : " & sData 
    Lst소켓상태.AddItem "받은자료길이 : " & bytesTotal 
    '// 잘 받았다는 메세지를 아래와 같이 보내본다. 
    Winsock1.SendData "서버가 수신한 데이터가 다음과 같습니다. : " & sData      
    소켓상태알림 
End Sub 
==============================================================================================================

Check_Member_LoginData = Trim(RS(1)) & "§" & Trim(RS(2)) & "§" & Trim(RS(3)) & "§" & Trim(RS(4)) & _ 
                                           "§" & Trim(RS(5)) & "§" & Trim(RS(6)) & "§" & Trim(RS(7))   
SendData = Check_Member_LoginData(Word(R_Doc, 2), Word(R_Doc, 3)) 

'클라이언트 로 로그인 성공 했다고 보내고 
Call Socket_Send_Data(index, "ː0ː" & "$login" & "§" & "Loginok" & "§" & SendData) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.16(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 ==> 흐림 
  
- PDA 수정
- 소켓 통신 문제 
A. 서버에서  @@@@@@@@@@@   
WinSock1.SendData str   ===========> string형식으로 보냄 
--------------------------------------------------------------------------------------- 

B. 클라이언트에서 : 바이트형으로 받기  @@@@@@@@@@@ 
WinSock1.GetData 함수의 2번째 인자에  
vbByte + vbArray 이렇게 넣어 주면 바이트형 배열로 받는다고 하네요.. 
WinSock1.GetData rbuff 
txtRecData = txtRecData & rbuff & vbCrLf 
TotBytes = TotBytes + bytesTotal 
==============================================================================================================

- PDA 분석
- 황영주 주임 *  
WinSock1.SendData str   ===========> string형식으로 보냄 
소켓통한 데이터 전송은 Serialize하게 이루어집니다. 변수의 값을 넘기던 데이터역할을 하는 
문자열을 넘기든 간에 그 자료들은 모두 문자열로 처리되어 전송되게 됩니다. 구분을 해주는 것은 
프로그램을 작성하는 개발자의 몫이죠. 특별한 전송방법이나 구분 방법이 있는 것은 아닙니다. 
==============================================================================================================

- 도원텔레콤 T)767-5555 FAX)768-2676 
김대훈 대리  
기존 AP 샘플 2대(1대 추가: 업무협조전 작성)  ==> 도원 AP 재고 40대 
==============================================================================================================

- 안심클릭 신용카드(LG) 결제 
1. 안심클릭 LG카드이면 
R&F주문 --> 2023(특약) L&B주문 --> 3597 
2. 안심클릭 카드이면 
R&F주문 --> 3596 L&B주문 --> 3597 
-------------------------------------------------------------------------------------------------------------- 

1. 안심클릭 LG카드이면 =============> 변경: LG카드이면 무조건 20203(특약)으로 이동 
R&F주문 --> 2023(특약) L&B주문 --> 2023(특약) 
2. 안심클릭 카드이면 
R&F주문 --> 3596 L&B주문 --> 3597 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
L&B ==> ID: ith3597 pass: 3597 02-2187-2778 
R&F ==> ID: its2023 pass: its2023 
==============================================================================================================

- bean 폴더 모두 디버깅 
[i3shop@testCcdom bean]$ ./build.sh1 CallExternalSystemBeanForWeb 
http://test.mart.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T04061509&p_item_cd=00144740&p_display_cd=01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.18(일) 작업 ■■■■■■■■■■■■■■■■
---> 10:30 ~ 20:00 ==> 맑음 
  
- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 실서버 적용 
1. 안심클릭 LG카드이면 =============> 변경: LG카드이면 무조건 20203(특약)으로 이동 
R&F주문 --> 2023(특약) L&B주문 --> 2023(특약) 
2. 안심클릭 카드이면 
R&F주문 --> 3596 L&B주문 --> 3597 
==============================================================================================================

- 포항 집(등기부 등본) 
포항시 북구 두호동 1030-13 우광맨션 나동 102호 
윤인수  PH)016-674-3001 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.19(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 05:00 ==> 철야(맑음) 
  
- 쇼핑몰 수정
- 안심클릭 신용카드(LG) 결제 
==============================================================================================================

- 신용카드 로그 보기 
[i3shop@iiishop_ccdom2 i3shop]$ cd log/web  
[i3shop@iiishop_ccdom2 web]$ ls  
127.0.0.1_80_debug_20040710  127.0.0.1_80_debug_20040717  127.0.0.1_80_err_20040711  127.0.0.1_80_err_20040718  
bill_log_20040712  bill_log_20040719 
127.0.0.1_80_debug_20040711  127.0.0.1_80_debug_20040718  127.0.0.1_80_err_20040712  127.0.0.1_80_err_20040719  
bill_log_20040713  incepg 
127.0.0.1_80_debug_20040712  127.0.0.1_80_debug_20040719  127.0.0.1_80_err_20040713  bill_log_20040707          
bill_log_20040714  nicepg 
127.0.0.1_80_debug_20040713  127.0.0.1_80_err_20040707      127.0.0.1_80_err_20040714  bill_log_20040708          
bill_log_20040715  
[i3shop@iiishop_ccdom2 web]$ vi bill_log_20040718 
==============================================================================================================

- 반품접수에서 물품회수완료(22)  ===> 반품 접수 상태(23)  
주문번호 : 010001 20040716 00007 0100012004071600007 
반품번호 : 010001 20040719 00347 0100012004071900347  

- 반품관리/반품회수취소 
미회수버튼을 누르면 
반품상태가 물품회수 대기(21) 에서 물품회수완료(22) 으로 변경 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.21(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 ==> 맑음 
  
- PDA 수정
- Inventory Ver 1.0 
PDA 소켓 통신, Oracle DB 조회 
==============================================================================================================

- Inventory Ver 2.0 
소켓 통신, mdb파일 가져오기(Oracle에서 조회된 것), Cleint 내부에서 access DB 사용 
==============================================================================================================

- 현재 PDA 
소켓 통신, .txt파일 가져오기(Oracle에서 조회된 것),  
Cleint 내부에서 .txt -> .cdb로 전환, access DB 사용 
-------------------------------------------------------------------------------------------------------------- 

- Inventory Ver.01 
소켓 통신, Oracle DB 조회 
AP IP 설정 
MAC ADDRESS: 00904B080F86 
\WINDOWS\Airoent Client Utility 에서 SSID: I3SHOP3 설정 
IP: 210.123.133.25 
-------------------------------------------------------------------------------------------------------------- 

- 액티브 싱크 연결 오류 
Connection Not Valid 

제어판 -> 통신  
장치이름: WinCE 
연결방법: USB to PC 
-------------------------------------------------------------------------------------------------------------- 

- Unable to launch 
1. Utiliy/Boot 재 부팅 
2. CISCO 프로그램 재 설치 
3. \WINDOWS\Airoent Client Utility를 클릭하여 SSID: I3SHOP3 설정 
==============================================================================================================
 
- 자인물류 방문 
---> 11:00 ~ 15:00 
- AP 교환(도원텔레콤) ==> 호진씨 차로 감(점심 제공) 
- 자인물류에서 테스트 
==============================================================================================================

- 수도 검침 
수용가 번호: 100-1950 
동명: 신천4동 461-4 
담당자 HP)*  Tel)951-0091  953-0091 
-------------------------------------------------------------------------------------------------------------- 

- 수도꼭지 수리 
몽끼(5,500원), 수도꼭지(3,400원) 구매 
==============================================================================================================

- E-Mart 구매 필요 물건 
구두, 지갑 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.07.22(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:15 ~ 23:00 ==> 맑음 
  
- PDA 수정
- Inventory Ver 1.0 
소켓 통신, Oracle DB 조회 
==============================================================================================================

1. 조회 
2. 저장(실제 수량 UPDATE) 
00011014§(청정원 매운맛 본카레 100g)카레§8§0§ * 실제 개수 --> 8개  
00133893§(코카콜라캔250ml)§0§0§8801094013004 실제 개수 --> 0개 
-------------------------------------------------------------------------------------------------------------- 

result = Split(R_Doc, "& Chr(27) &")   '줄 수 짜르기 
Type mismatch 에러 발생  ==>  result 타입 오류 
Dim result() As String  --> Dim result로 변경 
==============================================================================================================
  
- 필터 교환방법 추가 
/display/com/itemDetaiInfoP.jsp 
 http://i3.1004.cc/i3shop/52in01.htm 
세디멘트필터(1차)+프리카본필터(2차): item_cd: 00142158 
항균/UF중공사막필터(3차) ): item_cd: 00142159  
포스트카본필터(4차)+ 항균카트리지: item_cd: 00142160 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.07.23(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==> 맑음 
  
- PDA 수정
- IN_Inspection Ver 1.0  ==> 입고 검품 
소켓 통신, Oracle DB 조회 
---------------------------------------------------------------------------------------------------------------

- 점포영업관리/재고 실사서 작성 
(BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
BizMgr/ItemStockMgr/stockInquiryInputP.jsp  --> stockInquiryInitS.jsp 저장 
T_STOCK_INQUIRY_DTL:  초기화 시점의 재고관리 상품을 재고실사정보에 저장  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.24(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 ==> 맑음 
  
- PDA 수정
- IN_Inspection Ver 1.0  ==> 입고 검품 완료 
소켓 통신, Oracle DB 조회
W/S: 발주시참조판매주_WS 
STS: 판매상태 
---------------------------------------------------------------------------------------------------------------

- 재고조사(수정): Inventory Ver 2.0  
Timer를 통해 1초마다 인증(클라이언트)  --> 인증 성공여부(서버) 
--> 파일 송신 요청(클라이언트)  --> 파일 보내 달라는 요청(서버) 
--> 파일 수신을 위한 소켓(tcpsocket) 준비(클라이언트)  --> 파일 전송 시작(tcpsocket) (서버): PDA.mdb 파일 생성 
--> mdb 파일 전송(tcpsocket) (서버)--> mdb 파일 수신(tcpsocket)(클라이언트)  
---------------------------------------------------------------------------------------------------------------

- 재고조사(기존) 
Timer를 통해 1초마다 인증(클라이언트)  --> 인증 성공여부(서버) 
--> 파일 송신 요청(클라이언트)  --> 파일 보내 달라는 요청(서버) 
--> 파일 수신을 위한 소켓(tcpsocket) 준비(클라이언트)  --> 파일 전송 시작(tcpsocket) (서버): PDA.mdb 파일 생성 
-->  pda.txt 파일 열기(tcpsocket)(클라이언트) --> 데이타 수신(tcpsocket)(클라이언트) 
-->  TXT 파일을 CDB 로 전환(클라이언트)  
==============================================================================================================

-- 파일 전송 시작(PC의 MDB파일(PDA.mdb)이 PDA로 파일(jego.cdb)복사) 
Public Declare Function DESKTOPTODEVICE Lib "c:\program files\Microsoft ActiveSync\adofiltr.dll" _ 
(ByVal desktoplocn As String, _ 
ByVal tablelist As String, _ 
ByVal sync As Boolean, _ 
ByVal overwrite As Integer, _ 
ByVal devicelocn As String) As Long 

'result = DESKTOPTODEVICE("d:\kyh\test\nwind.mdb", "", False, True, "\Storage Card\Map\Facilities\nwind.cdb") 
result = DESKTOPTODEVICE("C:\TAMA_DATA\My_DOCUMENT\My_Company\i3shop\PDA\재고관리 Ver 2.0\서버\PDA.mdb", 
"", False, True, "\My Documents\jego.cdb") 

If result <> 0 Then 
Debug.Print "[tcpSocket_ConnectionRequest()]:[An error occurred transferring the data]" 
Else 
Debug.Print "[tcpSocket_ConnectionRequest()]:[파일 전송 성공]" 
End If 

이렇게 하면 PC의 MDB파일이 PDA로 잘 복사되고 PDA에서 ado로도 잘 읽힙니다. 
==============================================================================================================

- Workspace 오류 
사용자정의형식이 정의되어 있지 않다고 합니다  
Dim wrkDefault As Workspace 
Dim TempDb As Database  
프로젝트 - 참조 라는 메뉴가 있습니다. 
참조로 들어가셔서 Microsoft DAO 3.51 Object Libray 를 선택해 주시면 됩니다. 
==============================================================================================================

반품접수에서 물품회수완료(22)  ===> 반품 접수 상태(23) 

원주문번호 : 010001 20040720 00431 0100012004072000431 
반품   번호 : 010001 20040724 00134 0100012004072400134 
---------------------------------------------------------------------------------------------------------------

--반품 내역 조회 @@@@@@@@@@@@@@ 
SELECT * 
FROM T_ORDER 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040724' 
  AND ORDER_NO= '00134'; 
  --AND ORDER_STS = '20'; --//주문상태(반품신청:21, 반품접수:22, 반품신청취소:20, 물품회수완료:23) 
---------------------------------------------------  COMMIT 

--반품 내역 수정  @@@@@@@@@@@@@@ 
--UPDATE T_ORDER 
SET ORDER_STS = '22'            --반품신청취소:20로 수정 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040724' 
  AND ORDER_NO= '00134'; 
==============================================================================================================

--반품 내역 조회 @@@@@@@@@@@@@@ 
SELECT * 
FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040724' 
  AND ORDER_NO= '00134'; 
  --AND SHIP_STS = '20'; --//배송상태(주문접수:01, 배송대기:02, 배송중:03, 물품회수대기:21, 물품회수완료:22) 
---------------------------------------------------  COMMIT 

--반품 내역 수정  @@@@@@@@@@@@@@ 
--UPDATE T_ORDER_DTL 
SET SHIP_STS = '21'  --물품회수대기:21로 수정 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '0001' 
  AND ORDER_DT = '20040724' 
  AND ORDER_NO= '00134';  
==============================================================================================================

임세환 회원 email 안됨 
(한 동안 사용안 함: 계정 등록이 잘못된 ID) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 ==> 맑음 
  
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0 
1. 서버 에서 
Oracle DB 조회 --> PDA.mdb 파일 생성 --> PDA.mdb 파일 전송 
->  PDA.mdb 파일 받음 --> T_MERCHANT_ITEM 파일 갱신(Oracle DB에서) 
실제수량(S_Count) -> 장부 수량(Now_Stock),  위치정보(LOCATION) 갱신 
2. 클라이언트 에서 
PDA.cdb 파일 생성 --> 저장  
T_GEGO_ITEM 테이블에 저장 
- 실제수량(S_Count),  위치정보(LOCATION) 갱신 
->  PDA.mdb 파일 전송 
---------------------------------------------------------------------------------------------------------------

T_MERCHANT_ITEM 테이블에서 LOCATION1(위치 정보) 필드 이용 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.27(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 
  
- PDA 수정
- 입고 검품 검품장 설치 
---------------------------------------------------------------------------------------------------------------

- 프로그램 설치 
1. Active Sync 설치
2. AP Manager 설치
3. Oracle Client 설치(8i) 
 Network Administrion --> Net 8 Configration Assistant --> iii3shop --> 211.233.5.110 
4. 입고 검품 Server 설치
5. Run VNC Server 설치 
검품장(211.33.193.129), 조의재 대리(211.33.193.167) --> pwd: i3shop2004 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.07.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:00 ==> 맑음 
  
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0 
---------------------------------------------------------------------------------------------------------------

- 재고조사(통합) 
1. 기초재고 작성(/BizMgr/ItemStockMgr/stockInquiryP.jsp) 
재고 실사 초기화(stockInquiryInitP.jsp) 
- 재고 실사 정보(T_STOCK_INQUIRY) , 재고 실사  상세 정보(T_STOCK_INQUIRY_DTL) TB 저장 
---------------------------------------------------------------------------------------------------------------  

재고 실사 정보(T_STOCK_INQUIRY) ==> T_GEGO_ITEM 
재고 실사 상세 정보(T_STOCK_INQUIRY_DTL) ==> T_GEGO_ITEM_DTL 
재고 로케이션 정보(T_STOCK_LOCATION)   
재고실사 바코드 정보(T_STOCK_INQUIRY_TEMP) 
---------------------------------------------------------------------------------------------------------------

재고 실사서 작성(/stockInquiryByLocationP.jsp)에서 재고실사 바코드 정보(T_STOCK_INQUIRY_TEMP)에 데이타를 저장 후  
재고 실사 상세 정보(T_STOCK_INQUIRY_DTL)와 비교하여 같으면 1차, 2차, 3차 수량 갱신 
==============================================================================================================
 
- 출고 정보 오류
이름 : 천병지  ====> 담당: 조현배씨 
주문번호 : 0100012004062100638 
내용 : 주문은 3가지를 품목을 했는데  
         배송검수시에는 1가지품목(GI발란스)만 뜸  
 출고상세 정보(T_STOREOUT_DTL)에 배송 데이타 2건 안 떨어짐 
---------------------------------------------------------------------------------------------------------------

0100012004062100638  -----> 송장번호(0555605223) 

GI발란스 등록 오류로 인해 현금 입금 확인 시에 
출고(T_STOREOUT), 출고 상세 정보(T_STOREOUT_DTL) 생성 되지 않음 
그래서 직접 수기로 작성 중 해당 주문번호를 빠뜨리고 등록해서 발생 
---------------------------------------------------------------------------------------------------------------

- GI발란스 등록 오류 
R&F상품 인데 최초 상품 등록시 자인물류점 등록을 안해서 문제가 생겼음 
==============================================================================================================

- 이클립스 오류
Java HotSpot(TM) Client VM warning: 
j2sdk1.4.1_05 설치 
-------------------------------------------------------------------------------------------------------------- 

- 환경값 로딩 실패 
환경설정/Orion 
Option Java VM Aguments: -Denvfile=C:\Project\i3shop_env\daco.env 
-------------------------------------------------------------------------------------------------------------- 
  
C:\orion2\config\server.xml 에서  @@@@@@@@@@@@@@@ 
<application name="BizMgrApp" path="C:\Project\i3shop_BizMgr" /> 
<web-site path="./Project-web-site.xml" /> 
-------------------------------------------------------------------------------------------------------------- 

C:\orion2\config\Project-web-site.xml 에서  @@@@@@@@@@@@@@@ 
<d<web-site host="[ALL]" port="5001" display-name="BizMgrApp"> 
<!-- The default web-app for this site, bound to the root --> 
<default-web-app application="BizMgrApp" name="WEB_ROOT" root="/" /> 
<access-log path="../log/int-web-site-access.log" /> 
</web-site> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.29(목) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:10 ~ 23:00 ==> 맑음 
  
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0 
-------------------------------------------------------------------------------------------------------------- 

- 재고조사(통합) 
1. 기초재고 작성(/BizMgr/ItemStockMgr/stockInquiryP.jsp) 
재고 실사 초기화(stockInquiryInitP.jsp) 
2. 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
위치별 상품 정보 입력(stockInquiryInputP.jsp) 
  
- 재고 실사 정보(T_STOCK_INQUIRY) , 재고 실사  상세 정보(T_STOCK_INQUIRY_DTL) TB 저장 
==============================================================================================================

재고 실사 정보(T_STOCK_INQUIRY) ==> T_GEGO_ITEM 
재고 실사 상세 정보(T_STOCK_INQUIRY_DTL) ==> T_GEGO_ITEM_DTL 
재고 로케이션 정보(T_STOCK_LOCATION)   
재고실사 바코드 정보(T_STOCK_INQUIRY_TEMP) 
---------------------------------------------------------------------------------------------------------------

재고 실사서 작성(/stockInquiryByLocationP.jsp)에서 재고실사 바코드 정보(T_STOCK_INQUIRY_TEMP)에 데이타를 저장 후  
재고 실사 상세 정보(T_STOCK_INQUIRY_DTL)와 비교하여 같으면 1차, 2차, 3차 수량 갱신 
==============================================================================================================

권용현 GM  011-817-2245 053)744-1388 *@*.* 
조항래 회원 4539341297617920 5580 3good/570513 
- 한미VISA카드 결제 안 됨 =====> 안심 결제 
신용카드 번호, 유효기간 확인 
CAVV 오류(인증오류) 에러 

한미은행(1588-1365) 
한미비자안심클릭을 이용하여 인터넷 쇼핑몰에서 30만원 이상 구매하시려면 공인인증서가 
있어야 합니다. 
공인인증서가 없으신 고객은 가까운 한미은행 영업점을 방문하시어 신청하시기 바랍니다.  
--------------------------------------------------------------------------------------------------------------- 
  
- 안심 --> 터미널 NO: i3shop9031(TGCORP)  ==========> 에러 
TGCORP는 안심 처리 안 함  

한미BC카드 --> ISP 한미VISA카드 --> 안심 
==============================================================================================================

- 맥 조기회 유니폼비 
대구은행(035080416594) 주용철 유니폼비 4만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 
  
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. 서버에서 재고 DATA(jego.mdb)파일 PDA로 보내기 
2. PDA에서 재고 조회, 실재고 수량 등록 
3. PDA에서 로케이션별 바코드 DATA 서버로 전송 
4. 서버에서 DATA 받아서 로케이션별 txt 파일 생성 
5. 통합에 로케이션별 파일(.txt) 등록 
6. PDA에서 로케이션별 실재고 수량 DATA 서버로 전송 

T_GEGO_ITEM_DTL: 재고 실사 상세 정보 Table 
T_GEGO_LOCATION: 재고 로케이션 정보 Table 
==============================================================================================================

- 쇼핑몰 결제 알림 수정
- 04_07.30 이전 
신용카드(안심클릭/ISP 해당사항 제외 카드)  
ISP 신용카드(국민/BC) 
안심클릭 신용카드(삼성/LG/현대/신한/하나/외환/전북/수협/제주/롯데) 

- 04_07.30 이후 
기타 신용카드(시티/축협/농협) 
ISP 신용카드(국민/BC/우리/평화/조흥)  
안심클릭 신용카드(ISP/기타 신용카드 제외 모든 카드) 
  
나이스 전화번호: 02)2187-2745 02)2187-2778 
==============================================================================================================

- TGCORP 결제 수정 
Tel) 02)3438-3576 
211.233.5.108 i3shop/i3shop1080506 
TRS01/conf/tgcorp.key 파일 교체(유효기간 만료) 

[i3shop@iiishop_int conf]$ pwd 
/opt/payment/TRS01/conf 
[i3shop@iiishop_int conf]$ ls 
tgcorp.key 
==============================================================================================================

- 전은혜 //mylove26 
- 계속 카드 이용했는데  오늘 갑자기  결제하니 isp창에서 비밀번호입력하고 
  결제하기 누르면 마지막 단계에서  해당카드 이용불가라는 오류문구가 뜬다심 
  카드 한도도 남았고 유효기간등 계속 정상 이용가능한 카드인데 이상하다심! 
  거듭 재결제해도 그렇다심! 
**비씨카드 - 전은혜 4553-3210-0133-7207  
* 확인후 전화요망 - 051-558-2552 
==============================================================================================================
 
- [전산팀 공지] 
전산팀 공지 입니다. 
통합에 새로운 업무 적용을 위하여 
14:30에 잠시 서버를 재시작 하도록하겠습니다. 
이점 유의하셔서 업무에 차질이 없었으면 합니다. 
그럼, 수고 하십시오. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.07.31(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 12:00 ==> 맑음 
  
- PDA 수정
- 재고조사(수정): Inventory Ver 2.0  
1. 서버에서 재고 DATA(jego.mdb)파일 PDA로 보내기 
2. PDA에서 재고 조회, 실재고 수량 등록(T_GEGO_ITEM_DTL, T_GEGO_LOCATION) 
3. PDA에서 로케이션별 바코드 DATA 서버로 전송 
4. 서버에서 DATA 받아서 로케이션별 txt 파일 생성(ex)501-D.txt) 
5. 통합에 로케이션별 파일(.txt) 등록 
6. PDA에서 로케이션별 실재고 수량 DATA 서버로 전송(T_GEGO_LOCATION) 
-------------------------------------------------------------------------------------------------------------- 

T_GEGO_ITEM_DTL: 재고 실사 상세 정보 Table 
T_GEGO_LOCATION: 재고 로케이션 정보 Table 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■