 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2015.02) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2015.02.01(일) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

▦ 조기축구
06:30 기상
07:00 지하철(대림역 <-> 신사역)
08:00 신구초등학교 
08:20 숏게임
09:20 게임(40대 하의 유니폼비 35,000원 태훈형에게 줌)
10:00 월례회의
11:20 종료
12:00 중식(류명국 해장국: 부대찌게): 회에서 쏨 
12:40 종료(태훈이형 차)
13:00 상도역
13:40 귀가
14:00 집출발
15:00 한국외국인력지원센터(서울 구로구 가리봉동 137-5)  ==> 2015년 베트남 설맞이 행사(루옌, 수종 동행)
17:00 종료(수종이가 너무 밸라서 일찍 옴, 화장품 선물 받음)
17:30 이마트 구로점
19:00 종료
20:00 석식
23:00 취침
==============================================================================================================
- 대림 문영APT 주변 상권[2015.02.08]
1. 은행
 1) 국민은행 구로지점 ==> http://place.map.daum.net/8836197
 2) SC은행 구로디지털지점 ==> http://place.map.daum.net/26369937
 3) 우리은행 구로디지털밸리지점 ==> http://place.map.daum.net/8465140

2. 목욕탕
 1) 청수24시사우나 ==> http://place.map.daum.net/10853545
 2) 만수탕 ==> http://place.map.daum.net/16909317

3. 시장
 1) 남구로시장 ==> http://place.map.daum.net/18526243
 2) 이마트 구로점 ==> http://place.map.daum.net/8039405
 3) CU 대림점  ==> http://place.map.daum.net/17892135
 
4. 병원
 1) 명지성모병원 ==> http://place.map.daum.net/10326662
 2) 고려대학교 구로병원 ==> http://place.map.daum.net/8235178
 3) 서울특별시 보라매병원 ==> http://place.map.daum.net/7891587 
 4) 한국 정형외과 ==> http://place.map.daum.net/11208670 
 5) 사랑의피부과의원 ==> http://place.map.daum.net/10453075
 6) 명소아청소년과의원 ==> http://place.map.daum.net/10332114
   
5. 우체국
 1) 대림1동우편취급국 ==> http://place.map.daum.net/10249642

6. 공원
 1) 두암어린이공원 ==> http://place.map.daum.net/8318888
 2) 구로리어린이공원 ==> http://place.map.daum.net/8710480

8. 서비스 센턴
 1) 삼성휴대폰서비스 구로센터 ==>http://place.map.daum.net/21848461
 2) LG전자서비스센터 구로점 ==> http://place.map.daum.net/8044066

7. 교통
 1) 지하철: 대림역(2호선, 7호선) 

8. 도서관
 1) 구로도서관(수요일 휴관)  ==> http://place.map.daum.net/8189288
 2) 대림정보문화도서관(화요일 휴관)   ==> http://place.map.daum.net/8862652

9. 공공 기관
 1) 국민건강보험 영등포남부지사 ==> http://place.map.daum.net/11721571

9. 맛집
 1) 참맛감자탕(대림역 9번 출구 앞) ==> http://place.map.daum.net/16300550
 2) 계림원누룽지통닭 구로구청점(티몬에서 9,000원 티켓구매) ==> http://place.map.daum.net/21503534 
 ==> http://www.ticketmonster.co.kr/deal/136592889/106069
 ==> http://www.ticketmonster.co.kr/local/106069/221
==============================================================================================================

- 지인 집 정보 
1. 허우집(경기 의정부시 금오동 80-39) 
2. 다오집(서울 관악구 신원동 412-103)
3. 프엉집(경기 오산시 가수로 33)
4. 응아집(경기도 고양시 일산동구 정발산동1188-8호)
==============================================================================================================

- 주요 기관
1. 서울출입국 관리소(양천구청역 2호선) ==> http://place.map.daum.net/7943223
2. 한국외국인력지원센터(서울 구로구 가리봉동 137-5) ==> http://place.map.daum.net/11212989
2. 마리오 아울렛(서울 금천구 가산동 60-35)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.02(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 집정리

- 이사(전입) 후 처리
1. 전입 신고(확정일자 받기) ==> 대림2동 주민 센터 
2. 새문빌라 현관문 카드키 501호 아줌마에게 갖다 줌(자전거)
3. 과일(사과, 귤, 감): 봉천역 청과점
==============================================================================================================

- 체류지 변경 신청
https://ssl.hikorea.go.kr/pt/CvlapplInfoDetailR_kr.pt?cvlapplCd=127000000AC&locale=ko&cvlapplGbSeq=
1. 공인인증서가 있어야만 가능
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.03(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 뚜엣(루옌 친구) 우리집 첫 방문

- 대림3동 어린이집 방문(10시)
1. 입학 원서 받아옴(작성하여 다음주까지 보내줄 것)
==============================================================================================================

- LG 모니터 A/S 신청
1. 받침대가 안 세워짐 ==> LG A/S 센터에 가서 A/S 받음(나사 2개 받음) 
2. LG전자 M2450D-PN(24In), 267,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A571944839&frm3=V2 
==============================================================================================================

- TV 유선 설치(내방)
1. 지상파 방송만 나옴(관리실에 문의 결과 케이블 방송은 개인적을 달아야 한다고 함)
2. 프린터 설치
==============================================================================================================

- 도시가스 자동이체 신청
1. 첫 달 고지서에서 사용계약번호를 알아야 신청 가능
==============================================================================================================

02. 분유 구입 ==> 완료
1) 남양유업 임페리얼 드림 XO World Class 4단계 스틱 280g, 6팩(120봉)(개당 8,333원), 가격: 53,0000원, G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=635287771
==============================================================================================================
  
- 의자 발싸개(테니스 공)
http://blog.naver.com/PostView.nhn?blogId=tamario&Redirect=View&logNo=220262076946&categoryNo=72&isAfterWrite=true

- [벧엘스포츠] 테니스공-3개1set, 18개)/의자다리, 11,040원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=519399012
==============================================================================================================

- 의자 구입
1. NS[에넥스 ENNEE]이지 503 메쉬 요추 의자: NS쇼핑, 가격: 60,140원
http://www.nsmall.com/jsp/item/itemview.jsp?good_id=12910433
 
- 책상 구입
1. 위더스 컴퓨터 책상1260/소프시스: G마켓, 가격: 31,170원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=538188434
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.04(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 집들이(11 ~ 16:30, 루옌 언니들)

- 달러 환전
1. 루옌 ==> 3,500달러 환전(3,914,505원)
2. 장인 ==> 4,500달러 환전(5,032,935원)
3. 타오돈(80만원): 원화
==============================================================================================================
 
- 외국인의 체류지 변경 신고(10시)
1. 영등포구청 종합민원실(루옌과 같이 감 ==> 내혼자가도 위임장 달라고 안함)
 1) 신고서 작성, 외국인 등록증, 임대차계약서
 2) 루옌만 신고 ==> 장인, 장모님은 8월달에 체류기간 연장때 변경 신고 해도 된다고 함(14일 경과시 100만 이하의 벌금은
외국인이 체류지 변경을 한 경우에 해당[나는 해당 외국인의 보호자임])
==============================================================================================================

- 외국인의 체류지 변경 인터넷 신고
https://ssl.hikorea.go.kr/pt/CvlapplInfoDetailR_kr.pt?cvlapplCd=127000000AC&locale=ko&cvlapplGbSeq=
1. 공인인증서가 있어야만 가능
==============================================================================================================

- 자전거 여행
1. 대림역 => 도림천 => 신도림역 => 안양천=> 안양천합수부 => 여의도 국회의사당 => 여의대로 => 마포대교 => 
63빌딩 => 안양천 => 도림천 => 대림역(갈때 3시간, 올때: 30분 ==> 보통 2시간 걸림)
==============================================================================================================

- 도어락 수리 기사 방문
1. 배란다문, 화장실문, 내방문 도어락 토요일에 고쳐 준다고 함
2. 인터폰 소리를 작게 들리는 문제도 이야기 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.05(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 모태산후인과, 착한 돼지(부폐), 남구로시장 구경

- 입회 신청서 작성, 처리 ==> 완료
1. 신부 외국인등록증 사본 출력
2. 가족관계증명서 출력
3. 입회신청서 작성
4. 아기 건강 수첩 사본
5. 영유아건강검진 확인서
==============================================================================================================

- 영유아건강검진 확인서
1. 건강검진결과 및 문진정보 > 영유아 정보
http://hi.nhis.or.kr/ggpb002m02_l02.do?mn_idx=MN00000016
==============================================================================================================

- 아이행복카드 발급 신청
1. 국민은행 ==> 1주일 후 은행[국민은행 구로지점]으로 받으로 가리고 함
==============================================================================================================

- 수종 예방접종(모태소아과)
1. DPT[디프테리아(diphtheria), 백일해(pertussis), 파상풍(tetanus)] ==> 완료
2. 수종 몸무게: 13kg, 키: 83.3cm
==============================================================================================================

- 건강보험 확인
1. 인터넷 민원 신청할 것(등록함)
2. 건강보험공단에서 지역가입자로 보험료 38,290원을 1년간 내면 된다고 전화 옴
 ==> 기존에 청구된 2015년 1월 보험료(154,110원이 청구)는 무효라고 함 ==> 2월달에 1, 2월 보험료가 한꺼번에 청구
(2달 합계: 76,580원)된다고 함 
==============================================================================================================

- Nexacro 교육(9시, 투비소프트) 
교육과정명 : Nexacro  
일시 : 2월 10일 09:30 ~ 2월 11일 17:00
교육장소 : TOBESOFT 3층 교육장  -> 5층 커피샵 

- Miplatform / Xplatform  교육은 http://www.tobesoft.co.kr 
사이트의 교육신청에서 자료실에 가면 교육동영상 참조하세요. 
- TOBESOFT 교육자료실
http://www.miplatform.co.kr/Miplatform/NewHome/asp/support/TotalBoard.asp?PCategory1=Education&PCategory2=MiPlatform&PCategory3=EduBoard
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.06(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

- 달러 환전(환율 1,090.21원) ==> SC은행 대림동지점
1. 총 8,0500달러 환전(8,721,680원) ==> 외환은행 우대 80%(122,400만원 절약함)
1. 루옌 ==>3,500달러 환전(3,815,735)
2. 장인 ==>4,500달러 환전(4,905,945원)
3. 타오돈(80만원): 원화 
==============================================================================================================

- SC제일은행 80% 환율우대 쿠폰
1. 로그인 > 쿠폰받기 ==> http://www.standardchartered.co.kr/np/kr/cms/cm/et/EventFinanceCoupon.jsp?ptfrm=HIN.KOR.INTRO.carousel41
==============================================================================================================

- 보육료 지원 신청 ==> 완료
1. 대림2동 주민센터 방문 ==> 2월 16일자로 처리해준다고 전화 옴(3월달 부터 보육료 지원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.07(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

▦ 조기축구
06:10 기상
06:30 지하철(대림역 <-> 신사역)
07:20 신구초등학교
07:40 숏게임
08:50 종료
09:20 중식(닭곰탕): 3,000원 냄 
10:00 커피(신사동): 현태형이 쏨(태훈형, 영석이형, 경훈, 기용)
11:30 고속터미널(영석이형 차)
12:40 귀가
16:30 책상 조립(루옌)
19:00 석식
20:00 루옌 여행 준비
23:00 취침
==============================================================================================================

- 책상, 의자 조립 완료
1. 가격대비 강력 추천
==============================================================================================================

- 왕자 더블기둥 3단 조절선반(2013년에 구입함) ==> 구조 분석할 것
http://www.gmarket.co.kr/challenge/neo_my_gd/contract_info.asp?oname=ordercontract&pack_no=1208726161
==============================================================================================================

- 루옌 이메일 만듬
1. 루옌 이름으로 처음 만듬
2. 이메일: vnluyen@naver.com / lulu339!@ [2015.02.07 ==> 사용 중]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.08(일) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 루옌, 수종 베트남 방문

- 루옌, 수종 베트남 방문
05:00 기상
05:45 집출발(영하 9도): 기내 수하물, 수하물 2개
06:00 지하철(대림역 -> 홍대입구역 -> 인천공항역): 루옌 신용카드 안 가져 옴
07:50 인천국제공항 도착
07:55 인천국제공항역 -> 밀리니엄홀(1층) -> 출국장(3층) -> 탑승수속 및 짐부치는 곳(베트남은 보통: D19~36)
        ==> 줄이 너무 김(2월 19일이 설이여서 베트남 가는 사람 너무 많음)
08:40 탑승수속(루옌 외국인등록증 안가지고 와서 출입국민원실(G)에 가서 외국인등록증사실증명 받음(2천원))
        ==> 수하물 33kg(3kg 오바) 통과 시켜줌, 기내 수하물 11kg(4kg 오바) 통과 시켜줌
08:50 무거운짐부치는 곳에 가서 짐 부침(수하물 캐리어 손잡이가 안 닫힘)
09:10 루옌, 수종 교통약자 게이트(GATE1)로 가서 출국장으로 들어감
09:30 베트남항공 직원이 전화 함 ==> 외국인등록증사실증명 안 가져 갔다고 함
10:10 루옌 베트남항공에 탑승(외국인등록증사실증명을 베트남항공 직원 전달해 줌)
10:35 베트남항공 이륙
10:40 지하철(인천공항역 -> 디지털미디어시티역(6호선 환승) -> 불광역(3호선 환승) -> 주엽역)
12:50 응아 아들 돌잔치(12시) ==> 소메르(주엽역 5번 출구: 주엽역 사거리) ==> http://cafe.naver.com/somerbf 
12:55 돌잔치 행사(하객 60명 왔다고 함): 프엉 부부
14:30 종료
15:10 응아집(옆집으로 이사감 ==> 조금 넓어짐
16:30 종료
16:40 프엉 남편차 얻어 탐
17:30 우성 사거리 도착(프엉 남편이 네비 잘못 봐서 여기에 내려 줌 ==> 초보인 것 같음)
17:40 귀가
20:50 루옌과 화상통화(루예, 수종 베트남 처가에 잘 도착함)
01:00 취침
==============================================================================================================

- 출국 전에 준비해야 할 필수 체크사항
1. 여권(잔여 유효기간 6개월 이상)
2. 항공권(전자티켓) 
3. 목적지 비자 
4. 주민등록증 또는 외국인등록증
5. 화폐 환전  
==> 출발시간 최소 2시간 전까지 공항에 도착하셔서 탑승수속을 마칠 것'
6. 탑승자 영문이름 확인 바랍니다. 
( 성/이름,성별 ※여권상의 영문이름 동일여부 반드시 확인! )  
DINHTHI/LUYEN,MS  
JIN/SOOJONG,MSTR  
==============================================================================================================

- 베트남항공 수하물 규정 
 1) 부치는 짐(여행용 캐리용 사용): 인당 20kg(관행적으로 5kg 추가 가능), 추가는 kg당 1~2만원 
 2) 기내에 들고 가는 짐: 7kg(가방 2개까지 가능), 액체는 100ml이하만 가능
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.09(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

- 문 손잡이 수리 전화(럭키부동산)
1. 럭키부동산 사장에게 전화 함
---------------------------------------------------------------------------------------

- 3월 등원 일수 문의(대림3동 어린이집)
1. 3월 18일 등원(13일로 계산됨 ==> 11일 이상이라 보육료 지원에는 문제 없다고 함)
---------------------------------------------------------------------------------------

- 루옌 휴대폰 중지
1. 2월 9일 ~ 3월 16일까지 중지 신청
2. 기본 요금(3,850원)만 청구된다고 함
==============================================================================================================

- 수하물 캐리어
1. 캠브리지 PC+ABS TSA 확장형 여행가방 29인치(5.7kg): 50*75*29, 가격: 73,800원   ==> 강추
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=823553415&service_id=estimatedn

 1) 캠브리지 PC+ABS TSA 확장형 여행가방 28인치(5.1kg): 50*73*30, 가격: 67,700원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1077472334&service_id=estimatedn

2. 트래블첵 PC+ABS 캐리어 28형 수하물용 SC7770 여행가방, 가격: 71,860원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=636483831&GoodsSale=Y&jaehuid=200002673

3. [올림피아] TANK PP-2000 레드 [30인치 수하물용], 30인치(5.4kg): 49*68*33, 가격: 111,000원
http://www.gabangpop.co.kr/app/product/detail/218027/0?source=ENURI&ACE_REF=enuri_pi
http://www.hanashop.com/goods/content.asp?guid=181327&NaPm=ct%3Di5x5getk%7Cci%3Dd66ec3964f254493976a5c59
dfd8d32a5bdca432%7Ctr%3Dslsl%7Csn%3D214351%7Chk%3Dc6f44281a0ccd7b0e09c7b1eab0039fc08528cac

4. [에다스 EDDAS]EP-304 블랙 25인치(5.4kg): 45*67*273, 스타일리쉬한 수화물용 여행가방 캐리어, 가격:  73,500원
http://www.hanashop.com/goods/content.asp?guid=25934&cate=3447
=========================================================================================================

- 도어폰(새문빌라 301호 사용 도어폰)
1. 코맥스 CAV-401FG(단종됨)
------------------------------------------------------------

- 인터폰(문영아파트 1806호 사용 폰)
1. 삼성 HI-101(단종됨)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.10(화) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 

- Nexacro 교육(10시, 투비소프트) 
1. Nexacro 소개
 1) Nexacro Platform 14(엑스플랫폼 14 버전): XPlatform 9.2가 이전 버전
2. 조회, 저장, 수정, 삭제  
3. 강사: 한정훈수석: (주)투비소프트 / 교육 사업팀(jhnov10@tobesoft.com) 
==============================================================================================================

- Nexacro 교육(9시, 투비소프트)
1.Tomcat 설정 방법
C:\Program Files\nexacro\14\nexacro14lib 복사하여 C:\Tomcat 7.0\webapps\np0210 폴더에 붙어넣기

2.Tomcat 실행 방법
http://localhost:8080/np0210/QuickView.html
http://localhost:8080/BUX_Project/QuickView.html
==============================================================================================================
 
- 서울 지하철 노선(교육: 투비소프트)
1. 대림역(9호선, 1-1) => 청담역(1번 출구) [1,250원, 32분 소요]
2. 청담역(9호선, 4-1) => 대림역(12번 출구) [1,250원, 32분 소요]
==============================================================================================================

- 사과 선물 받음(설 선물)
1. PCA 추임순 FC
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.11(수) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 

- Nexacro 교육2(10시, 투비소프트)
1. CSS 기본 문법
2. SDI 형태, MDI 형태
==============================================================================================================

- Script 폰트 변경
1. Tools > Options > Environment > Font and COlor > Script: 글자 크기 변경
단축키: Ctrl + 마우스 휠
- 주석 처리
1. /: 주석 막기
2. Atl + /: 주석 풀기
==============================================================================================================

- 투비소프트 교육 지원 센터
http://support.tobesoft.co.kr ==> tamario / s*p***8**1
http://www.playnexacro.com/#list:article:1
1. Nexacro SW 다운로드
http://support.tobesoft.co.kr/Next_JSP/nexacroHome/Next_JSP/SearchEngine/Html/Inner_KO.html
==============================================================================================================

- fiddler: 패킷 분석 프로그램
http://dsiol.blog.me/120177646288
==============================================================================================================

- 사장님 면담
16:00 투비소프트 교육 종료
16:10 Nexacro 실습
17:30 종료
17:50 포스코 빌딩 2층(카페): 현욱이형 만남
18:20 족발집((주)지아이데이타 이석부 사장님 만남)
20:00 종료
20:40 귀가
01:00 취침
==============================================================================================================

- 회사 정보
1. 회사명: (주)지아이데이타, 대표이사: 이석부 ==> 3월부터 다니게 될 회사 
 1) 주소: 서울특별시 강남구 테헤란로 309, 2013호(역삼동,삼성제일빌딩20층) (135-751) 
 2) 전화) 02-527-3887, www.gidata.co.kr 
http://www.saramin.co.kr/zf_user/recruit/company-info-view/idx/4330635
 3) 김현욱 선배(계대 86학번)이 이사로 있음, 포스코 1차 밴드
 4) 급여 조건: 연봉 5천 백(퇴직 연금 시행)
 5) 3월 초에 울산 현대중공업 파견 예상
==============================================================================================================

- 사진 공부
https://www.youtube.com/watch?v=cMBLgWuImCc

- 갤노트4 메모 공부 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.12(목) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 

- XPlatform 공부
1. XPlatform 동영상 시청(XPlatform9.2)
- 넥사크로플랫폼 14 사내 개발용 License
기간 만료 전 2개월간의 라이선스를 다시 발급할 예정입니다 
1. License
 A. Server (X-API) : nexacro14_server_license.xml (첨부파일)
 B. Client (Runtime) : nexacro14_client_license.xml (첨부파일)
 C. Tool (nexacro studio) : GZ5NT-6PNTQ-1426B-25A3F-2H35R-R1Y3U-YWX
2. License 정보 
 A. Application/Service : TOBESOFT 
 B. Clienst O/S : Windows, Windows RT, MAC, iOS, Android 
 C. 라이선스 : Runtime, HTML5 
 D. 라이선스 유효기간 : 2015/2/1 ~ 2015/3/31
==============================================================================================================

- [야택] - 당일지급, 일일가능, 기간자유
17:00 집출발
17:40 (주)한진택배 서울남부지점 본관1층 대기실(길 몰라서 헤멤)
17:50 등록(신입)
18:50 집합
19:00 상차(택배 물건 차에 싣기, 16, 17라인)
01:40 중식(10층 식당)==> 2015.02.13(금) @@@
02:40 일시작(너무 춥고 힘듬)
07:50 종료
08:30 귀가
09:00 취침
16:00 기상 ==> 야택 일당: 75,000원 받음
18:00 강호동 백정((주) 넥스트코어소프트 직원에거 고기 얻어 먹음)
19:20 종료
10:40 귀가
23:00 취침
==============================================================================================================

- [야택] - 당일지급, 일일가능, 기간자유, 초보알바
서울시 금천구 가산동 371-23 (주)한진택배 서울남부지점 본관1층 대기실, 17시까지 도착, 일당 65,000원
==> 연장 근무하여 75,000원 받음, 담당 : 윤실장(010-5597-6362)
[알바지원문자양식] 진태만, 44세, 영등포구 대림동, 2월 15일, 야택
http://www.alba.co.kr/job/Detail.asp?adid=59091159&areacd=02&workaddr1=%B0%FC%BE%C7%B1%B8%2C%B1%B8%B7%C
E%B1%B8%2C%BF%B5%B5%EE%C6%F7%B1%B8&workaddr2=&jobkind=&jobkindsub=&jobkindmulti=&gendercd=C01&agelimitcd=
&agelimit=0&worktime=&weekdays=&searchterm=&paycd=&paystart=&payend=&workperiodcd=&workstartdt=&workenddt=
&workchkyn=&workweekcd=&targetcd=&streetunicd=&streetstationcd=&unicd=&schnm=short&schtext=&orderby=freeorder
&acceptmethod=&totalCount=113&p=g
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.13(금) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 

- XPlatform 공부
1. XPlatform 동영상 시청(XPlatform9.2) 
==============================================================================================================

- DB 쿼리 개발 회의
1. (주) 넥스트코어소프트 김정현(010-6716-7585) ==> 대구 업체
 1) 주소: 서울시 관악구 신림동 삼남빌딩 10층
 2) 강호동 백정에서 고기 얻어 먹음
==============================================================================================================

- 굿플러스 협동조합 프로젝트 DB 설계 요청 분석
1. 현상태
 1) 1차 개발이 완료된 상태
 2) Critical 고객 요구사항 발생
    ==> 배당, 직급 관련한 핵심적인 부분 수정 요구
 3) 프리랜서 DBA가 무리한 추가 금액 요구
 4) 프리랜서 DBA와 협상 결렬로 DBA 철수
 5) (주)넥스트코어소프트에서는 2월 22일(월)까지 DB 설계 수정 완료해줄 것을 요청
 ==> 공식 오픈 3월 7일(토)
2. 문제점
 1) DB 설계 시간이 물리적으로 부족함
  ==> 이전 DBA도 위험 비용을 생각하고 무리한 금액을 요구
 2) DB를 추가 설계하면 된다고 하지만 기존에 설계된 DB도 아직 검증이 안됨
   ==> 기존에 설계된 DB가 문제가 있으면 추가로 시간이 소요될 수 있음
 3) 수당을 계산하는 프로그램이 복잡 
   ==> 수당은 돈과 연관되어 있어서 급하게 개발하면 큰 책임 따를 수 있음
 4) 고객 요구 사항 추가로 나올 가능성 존재
   ==> 협동조합에서 수당 부분은 수시로 변경됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.14(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 성희 이모부 사망 통보 받음(내일 장례식)

- XPlatform 공부 ==> 종료
1. XPlatform 동영상 시청(XPlatform9.2) 
==============================================================================================================

- MiPlatform 공부 ==> 시작
1. MiPlatform 동영상 시청(MiPlatform3.2) --> 설치버전: Developer (Unicode) 3.3  
MiPlatform V3.2를 설치 후 아래 License Key 를 사용해서 License 등록을 하십시오.
(MiPlatform V3.3도 동일합니다)
USER: admin
COMPANY: admin
KEY: 8HCH9-GBK5H-E6E3T-HEHNT-CCD75(1Year : 2014.11.01~2015.12.31) 
==============================================================================================================

- 문 손잡이 수리(문영 아파트 1806호)
1. 수리 기사가 와서 수리해줌(문 손잡이 5개, 열쇠 3개씩(총 15개) 받음(21:40 ~ 22:40)
2. 인터폰은 주문한 인터폰이 배송 도착하면 고쳐 준다고 함
==============================================================================================================

- 아랫층 1706호 부엌 천장 물 샘
1. 아랫층 아줌마에게 연락 옴(1806호 주인이 내일 수리 기사 부른다고 함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.15(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>  

▦ 조기축구
06:45 기상
07:30 문영APT앞(태훈형 차)
08:10 파주 NFC(경기도 파주시 탄현면 성동리)
08:20 게임(도곡FC, 강릉연합팀) ==> 2게임함(4시간 운동장 사용료: 16만 5천원), 김밥 3줄 먹음
11:20 종료
12:00 중식(강단콩 두부찌게: 전골): 회에서 쏨 ==> 라면, 아이스크림(정욱이형이 쏨) 사와서 먹음 
14:10 종료
15:20 귀가(태훈형 차)
16:00 낮잠 
18:00 기상
19:30 석식(김밥 2줄)
20:00 1706호 부엌 천장 물새는 문제로 집주인(조은창씨)이 수리 기사와 우리집에 와서 확인 
==> 이상 없음(보일러 물나오는 것 잠 그고 감)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.16(월) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 

- MiPlatform 공부 ==> 종료
1. MiPlatform 동영상 시청(MiPlatform3.2) 
 1) demp 경로 변경: C:\Users\TAMA\Documents\Tobesoft\MiPlatform330U\demo
 2) 처음 프로젝트명:MiPlat_Proj
==============================================================================================================

- 누수 확인
1. 집주인이 수리 기사와 우리집에 와서 다시 확인(하수도가 약간 누수가 있는 것으로 추정)
2. 아랫층에 물이 다시 새면 확인 한다고 함
==============================================================================================================

- 2015년 설날 차표 예매
1. 귀성 ==> 2015.02.17(화) 14:05 서울 -> 포항, 일반, 동양 33번: 21,400원
2. 귀경 ==> 2015.02.21(토) 13:50 포항 -> 서울, 일반, 한일 18번: 21,400원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.17(화) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 포항행

- MiPlatform 공부
==============================================================================================================

- DB 설계 도서
1. 아는 만큼 보이는 데이터베이스 설계와 구축, 이춘식 저 ==> http://book.naver.com/bookdb/book_detail.nhn?bid=4640260
2. 데이터베이스 설계와 구축, 이춘식 저 ==>http://book.naver.com/bookdb/book_detail.nhn?bid=53472
==> 관악도서관 상호대차 신청(조원도서관에서 수령할 것)
3. 실전 DB 모델링과 SQL for Oracle, 이호상 저  ==> http://book.naver.com/bookdb/book_detail.nhn?bid=7427273
--------------------------------------------------------------------------------------------------

- 데이터베이스 모델링 동영상 강의
1. 오용철의 데이터베이스 모델링 ==> https://www.youtube.com/channel/UCF5CqIVuw0S05ihUIb-HtAA
==============================================================================================================

- 우리은행 적금 자동이체 설정
1. 희망드림 통장 적금(루옌 통장)을 우리직장인재테크통장에서 매월 30만원씩 이체 시킴
------------------------------------------------------------------------------------------------------

- [우리은행] 희망드림 통장 적금 가입 ==> 2014.11.07(금) @@@@@@
1. 계좌번호: 1040-409-851432(1040409851432), 예금주: DINH THI ＬUYEN, pwd: 05*8*1
2. 금리: 연 7.5% 수익(기본: 4% + 우대: 3.5%), 서울대입구역지점(서울입구역 4번 출구)
3. 계약금액: 3,746,250( 세전), 계약금액2: 5,554,130(세후),4. 계약기간: 1년(월 30만원 한도)
==============================================================================================================

- 포항행
08:00 기상 
09:00 집출발(자전거): 뒷바퀴 바람 넣음 
09:20 대림 운동장 
10:00 구로도서관(도서대출증 만듬 ==> 리브로피아 앱 설치: 대출 가능)
10:40 라면 구입(진흥유통 --> 남구로 시장)
11:00 우리은행 방문(루옌 우리은행 적금 자동이체 설정)
12:00 귀가
12:10 점심(라면)
13:00 집출발
13:10 대림역(7호선0=)
13:45 고속터미널역 
14:05 서울 출발 
19:00 포항터미널 도착(5시간 걸림)
20:00 귀가 ==> 아버지 허리 아파서 거동 불편(일으켜 달라고 함)
       ==> 루옌과 화상 통화[한번 밖에 안됨]
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.18(수) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>

- 설 연휴 
07:00 기상 
09:30 봉춘이한테 문자옴(족구 동형이형이 못 온다고 취소 되었다고 함) 
11:30 집출발 
12:00 우현동 행복한 우프라자(포항시 북구 우현동 22-7, 봉춘이 아는 집)
12:10 포항계 모임(모임 회비: 2만원): 주남이형(가족), 진호형(가족), 태정, 정철, 진철, 성표, 봉춘(가족)
	==> 포항계 회비 6만원 납부(2014.09 ~ 2015.02) --> 계좌 이체[농협: 3520489541013, 예금주: 진봉춘]
	==> 태복이형(작은굴 앞, 주남이형 사촌)이 같이 참석해서 10만원 찬조함
14:30 종료
14:50 성표 가계(봉봉 놀이터): 같이 참여 ==> 봉춘(가족), 주남이형(가족), 정철
15:30 당구장 ==> 50놓고 3판 쳐서 1등함(주남이형 2등, 정철 3등[당구비 냄])
16:40 종료
17:20 귀가 ==> 밤 깍기 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.19(목) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>

- 설
08:00 기상
09:00 차례(혼자 지냄)  
09:40 종료  
10:10 식사   
10:40 집출발  
10:55 성희 이모집(경태 회사(해솔) 승합차) ==> 경태, 성희, 이모, 귀호 이모, 경태 삼촌, 큰삼촌)
11:30 동산공원묘원(경북 포항시 남구 동해면 동해안로 5294-90, http://www.dongsanpark.or.kr, 이모부 묘지) 
13:20 종료
15:20 이모집
16:00 식사(떡꾹)
	==> 조만간 성희 이모 현대 1차 아파트 구입해서 이사 한다고 함(32평 1억 3천, 수리: 2천 ==> 총 1억 5천)
17:30 귀가(두수 형님 차[경인이 운전]), 큰 누나(령경[쌍꺼풀 함, 선덕여고 합격함], 작은 누나(은아) 방문
	==> 신부, 수종이 베트남 보냈다고 욕 많이 먹음(명절에는 보내지 말 것), 수종 머리 이상하다고 함
19:00 이발(은아, 작은 누나, 작은 매형) ==> 큰누나가 무료로 해줌(은아 머리 짧아졌다고 움) 
20:00 석식
22:00 고스톱(큰 누나, 작은 누나, 큰 매형, 작은 매형)
==> 루옌과 화상 통화[한번 밖에 안됨]
02:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.20(금) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>

- 설 연휴
09:00 기상    
09:30 식사(10만원씩 내서 회 사옴)
10:40 낮잠
16:20 기상 
16:00 석식
18:00 석식
19:00 산책(북부 해숙욕장): 날씨 쌀쌀함
22:00 고스톱(큰 누나, 작은 누나, 큰 매형, 작은 매형)  ==> 만 3천원 읽음
02:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.21(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>

- 설 연휴
09:00 기상    
09:00 식사(회 사옴)  
13:00 짐 정리(김치) ==> 은아, 령경에게 용돈 5만원씩 줌
13:20 집출발(비 조금 옴)
13:40 포항 고속터미널
13:50 포항 출발(경부선 타고 감)
20:30 강남 터미널 도착(7시간 40분 걸림) ==> 될수 있으면 오전 시간에 포항 출발할 것
21:00 귀가  
21:20 석식  
00:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.22(일) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

▦ 조기축구
06:30 기상
07:10 지하철(대림역 <-> 신사역)
08:10 신구초등학교 
08:20 숏게임
09:20 게임
10:00 게임(라이트 윙) ==> 재미있었음
11:00 종료
11:30 중식(국밥: 뚝심한우): 상요형이 쏨 
        ==> 승렬이형이 남권이형 3천만원 채권 양도증명서로 해결 해준다고 함 --> 속은 셈치고 해보기로 함
12:10 종료 
12:20 상도역
13:10 귀가
16:00 집출발
16:20 자전거 바퀴 주부 교체(앞바퀴, 만원): 대림역 
16:20 책 반남(구로 도서관)
16:40 책 대여(조원도서관) --> 데이터베이스 설계와 구축, 이춘식 저 ==>http://book.naver.com/bookdb/book_detail.nhn?bid=53472 
17:30 귀가
19:10 석식
01:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.23(월) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==>

- (주)지아이데이타 첫 출근
==============================================================================================================

[★_00] 이번주 주요 일정[2015.02.23(월)] @@@@ - [★_11] 
01. 1인용 식탁 구입, 44,950원, 배송비 별도(착불 5천원)  ==> 주문 완료
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=178308380&GoodsSale=Y&jaehuid=200002673 
02. 수하물 캐리어 구입
03. 요양등급 확인
 1. 요양원(급수)
04. 채권 양도증명서
05. 포항 부동산 분석
==============================================================================================================

- TRIVEN E 시리즈 E810(삼광 컴퓨터)  ==> (주)지아이데이타 여분 노트북
http://blog.naver.com/noteledlcdtv/220178909085
==============================================================================================================

- host 파일
C:\Windows\System32\drivers\etc
ping www.xplatform.co.kr
DataURL ==> http://www.xplatform.co.kr:8080/edu/xp/
http://www.xplatform.co.kr:8080/edu/xp/employees_select.jsp
==============================================================================================================

- 회사 서버
1. 개발 서버
\\192.168.0.2 ==> Administrator / Gidata1107
2. 파일 서버
\\192.168.0.14\gidata 프로젝트 ==> Administrator / Gidata1107
\\192.168.0.14\GIDATA_FileServer\기술자료\설명 교재 메뉴얼  
==============================================================================================================

- 개발 SW(필수 SW)[2015.02.23]
1. EditPlus 3(에디터 플러스)
User：Free User
Pass：A3C8D-784D8-79ZDF-8FWD6-EBT4A
 1) 짙은 배경색 
색상: 76 
채도: 78 
명도: 194
폰트: 돋음 10
-------------------------------------------------
2. 로보폼(Robo Form, 로보폼_Data) ==> AiRoboForm 7.1
 1) 즐겨찾기(My Favorite)
3. Oracle 10g Client ==> 제외: 대용량
4. TOAD for Oracle 10.1 ==> 제외: 대용량
==============================================================================================================

- 노트북 수령[(주)지아이데이타]
1. LENOVO 에센셜 G580
 1) Model Name(모델명): G580-20150
 2) S/N(제조번호): CB19797956, P/N: 59356064
 3) LENOVO 에센셜 G580 59356063
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A672164207&frm3=V2
http://support.lenovo.com/kr/ko/products/laptops-and-netbooks/lenovo-g-series-laptops/lenovo-g580-notebook?type=Laptops-and-netbooks&c=1
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.24(화) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 18:00 ==>

- 노트북 셋팅
1. LENOVO 에센셜 G580 노트북 OS(Windows 7 Ultimate 버전) 설치
 1) VGA 드라이버 설치 안됨(Intel VGA Driver)
==============================================================================================================

- Oracle 11g Client 설치 및 설정
1. win64_11g R2_client 설치 
2. DB 정보
DB주소 : 192.168.0.11 --> 1521
DB유저명 : scott
DB패스워드 : tiger
DB SID : yard
==============================================================================================================
 
- JDK 설치 및 설정 방법
1. JDK 최선 버전 다운로드(jdk1.8.0_31)
http://www.oracle.com/technetwork/java/javase/downloads/jdk8-downloads-2133151.html
==> 설치 완료 후 확인(파일 및 버전 확인) --> C:\Program Files\Java
http://.oracle.com/technetwork/java/javase/downloads/java-archive-downloads-javase7-521261.html
--> 로그인: tamario@naver.com / s*jt*3**90A

 1) 내컴퓨터(오른쪽 버튼: 클릭) > 속성: 고급 시스템 설정(클릭) ==> 시스템 속성(새창)
    또는 제어판\시스템 및 보안\시스템 > 왼쪽 메뉴 > 고급 시스템 설정 ==> 시스템 속성(새창)
    고급(Tab) > 환경변수(N): 클릭  ==> 환경변수(새창)
    시스템 변수(S) --> 변수: Path ==> 편집(I): 클릭
    ==> 값: .... ;D:\Gidata\jdk1.6.0_24\bin ==> 기존(사용 중)
    ==> 값: .... ;C:\Program Files\Java\jdk1.8.0_31\bin ==> 추가(신규): 제거
 2) 확인
C:\Users\TAMAGI> set==> 적용된 JDK 버전 경로를 확인할 수 있음 @@@
Path=C:\ProgramData\Oracle\Java\javapath;D:\app\TAMAGI\product\11.2.0\client_1\b
in;C:\Windows\system32;C:\Windows;C:\Windows\System32\Wbem;C:\Windows\System32\W
indowsPowerShell\v1.0\;D:\Gidata\jdk1.6.0_24\bin;C:\Program Files\Bandizip\7z

2. 내컴퓨터(오른쪽 버튼: 클릭) > 속성: 고급 시스템 설정(클릭) ==> 시스템 속성(새창)
고급(Tab) > 환경변수(N): 클릭  ==> 환경변수(새창)
시스템 변수(S) --> 새로 만들기(W) => 변수 이름(N): JAVA_HOME, 변수값(V): C:\Program Files\Java\jdk1.6.0_45
--------------------------------------------------------------------------------------------------------

C:\Users\TAMAGI> javac
Usage: javac <options> <source files>
where possible options include:

C:\Users\TAMAGI> java -version
java version "1.8.0_31"
Java(TM) SE Runtime Environment (build 1.8.0_31-b13)
Java HotSpot(TM) 64-Bit Server VM (build 25.31-b07, mixed mode)
==============================================================================================================

- 이클립스 설정 및 연결
1. 이클립스 설치
http://btssgm.tistory.com/23

- Tomcat 설정 및 연결
1. Tomcat 설치(tomcat7.0)
http://tomcat.apache.org/download-80.cgi
http://smilennv.blog.me/220267731609 

C:\Program Files\Apache Software Foundation\apache-tomcat-7.0.59==> .zip파일을 다운받아 압축풀고
복사해서 해당 경로에 갖다 놓음 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.25(수) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 18:00 ==> 집에서 MSI 노트북 OS 설치 및 프로그램 설치

- Xplatform 개발
1. SCM::CIMF0050.xfdl(구매반품관리)
http://192.168.0.2 ==> http://192.168.0.2/XMain ==> http://192.168.0.2:8080/XMain
http://localhost:8080/XMain
==============================================================================================================

- Eclipse에서 Tomcat 설정 및 연결
1. http://dkatlf900.tistory.com/67, http://h5bak.tistory.com/132
 1) Eclipse 다운로드--> http://mobilegen.tistory.com/23
   ==> java 개발 Tool인 Eclipse IDE for java EE Developers 다운로드할 것
2. eclipse에서 Tomcat 서버 에러
The specified JRE installation does not exist
The JRE could not be found. Edit the server and change the JRE location.
eclipse에서 > 창 -> 환경설정 -> 서버항목확장 -> installed runtimes에 가면 
apache tomcat 7.xx 선택하고 옆에 edit를 누르면 JRE를 선택==> 그곳에서 인스톨된 JRE를 선택
3. 오라클(Oracle)- 이클립스 DB설정 ==> http://ects.tistory.com/66
==============================================================================================================

- 회사 DB 서버 세팅 문의
1. (주)지아이데이타 안상현 부장(010-8294-1969): swordfish@gidata.co.kr ==> 윤영호 대리(011-9546-0818)가 전화함
==============================================================================================================

- 회사 DB 서버 세팅
1. 파일 서버에 오라클 DB 설치할 것(11g)
\\192.168.0.14\gidata 프로젝트 ==> Administrator / Gidata1107 
2. 개발 서버(192.168.0.2)에 있는 것은 사용 못함(서버 불안, 지우지 말 것)
 ==> 윤영호 대리가 안상현 부장과 통화해서 확인
==============================================================================================================

- Mplatform 개발
1. Open Project 설정(기존 프로젝트 가져오기)
 1) Tools > Project Manager(ctrl + M) > Project Manager(새창)
==> New Project(새 프로젝트 등록), Add Exist(기존 프로젝트 가져오기) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.26(목) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 18:00 ==> 교육(오후에 본사 복귀), 귀가 후 개인이력카드 작성((주)지아데이타 입사용)

- TOBE 공통 교육(10시, 4층 교육장)
1. 강사: 조승래 팀장(010-2722-8732): 10:00 ~ 12:00 ==> 이원우 그룹장(010-8870-0409)
--------------------------------------------------------------------------------------------------

- Xplatform 공통 주요 업무
1. Frame 설정
 1) MainFrame
   -- HFrame==> 50,*,30
   -- TopFrame
   -- VFrame==> 200,*
   -- ChildFrame
   -- FrameSet
   -- BottomFrame==> *, 300
2. 공통 함수 생성
 1) gfn_callback() 함수 사용할 것
3. 배포
 1) 종류: 전용 브라우저, 일반 브라우저
 2) 진행 순서
  가. Runtcher
  나. Engine
 3) 일반 브라우저 ==> index.html
  가. IE 이면 ==> x_install AX ==> Active X 사용
  나. IE 아니면 ==> x_install Plugin ==> Plugin 사용
==============================================================================================================

- GIData Groupware[그룹웨어]
1. http://gidata.hanbiro.net/groupware/?category=index§ion=main ==> tamario / ta**3**
2. 입사 준비 서류(GIData) 
 1. 주민등록등본  ==> 민원24에서 발급
 2. 최종학력 졸업증명서  ==> 민원24에서 발급
 3. 경력증명서 ==> KOSA(경력 신고)에서 발급(2천원)
 4. 업무관련 자격증사본 ==> 정보처리기사
 5. 통장사본(신한은행) ==> 
==============================================================================================================

- 오라클(Oralce) 11g 서버 설치
1. 파일 서버(192.168.0.14)에 오라클 DB 설치할 것(11g)
 1) 192.168.0.14 --> SID: gidatadw ==> gidata / gidata1107
 2) 파일 서버 사양 ==> CPU: Intel(R) Celeron(R) CPU 430 @ 1.80GHz, RAM: 2G
 가. 파일 서버 사양이 떨어져서 개발 서버(192.168.0.2)에 오라클 DB 설치할 것(11g)
 --> 김문경(010-3126-2264)씨도 같이 작업
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.02.27(금) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- TOBE 공통 교육(14시 ~16시, 4층 회의실)
1. 담당: 안상일 팀장(010-8759-3999): 컨설팅사업본부 / 컨설팅컨버전스팀 
==============================================================================================================

- TOBE 공통 교육 내용
1. http://localhost:8080/hellow.html 
 1) UI 공통
 2) 컨설팅
-------------------------------------------------------------------------------------------------------

- Cache 방식
Cache 방식을 사용해서 시스템의 Resource와 화면의 로딩 속도를 개선한다.
1) Dynamic: 서버로부터 수신한 파일이 갱신 되었을 때만 수신 (서버의 파일이 갱신되지 않은 경우는 Local Cache
파일을 재사용) ==> 개발할 때
2) Static: 서버로부터 한번이라도 수신한 파일에 대해서 XPlatform Engine의 재 실행과 상관없이 Local Cache
파일만 사용   ==> image
3) None : Cache기능을 사용하지 않고 매번 서버로부터 데이타 수신, 주로 dataset관련 통신시 사용
==> TR, jsp, localhost
4) Session : XPlatform Engine을 기동할 때 한 번만 수신하고(만약 Local Cache파일과 일치하면 재사용),
해당 Engine이 종료 될 때까지 Local Cache파일만 사용(frame)
-------------------------------------------------------------------------------------------------------

http://localhost:8080/NewFile.jsp 
http://localhost:8080/testA.jsp
http://localhost:8080/xp_base_sel.jsp
==============================================================================================================

- eclipse 설정
1. eclipse 줄번호 설정
1) Window[상단 메뉴] > Preferences[새창] 에서, General > Editors > Text Editors에서 "Show line numbers"를 체크
2. eclipse font 설정
1) Window[상단 메뉴] > Preferences[새창] 에서, General > Appearence > Color and Fonf > Basic
> Tet Font ==> Edit > 글꼴[새창]: "돋움", "10"(설정)  
4. Console 배경색 설정
1) Window > Preferences[새창] 에서, Run/Debug > Console(클릭): Background color: 배경색(녹색: 86, 78, 194)
5. Console buffer size 설정
1) Window > Preferences[새창] 에서, Run/Debug > Console(클릭): Consol buffer size: 80000 --> 800000
==============================================================================================================

 - 신한은행 통장 개설[2015.02.27(금)]
1. 신한 직장인통장(저축예금): (주)지아이데이타 급여통장
 1) 계좌번호: 110-437-783130, 예금주: 진태만
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.02.28(토) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 대림3동 운동장(축구 구경), 대림3동 어린이집 OT(10시)

- 대림3동 어린이집 OT(10시 ~ 11시 30분)
1. 발표: 연지영 원장
2. 산새반 OT: 김현아 선생, 백종부 선생
3. 입학비(가방, 발당성장 수첩, 명찰): 19,000원 ==> 신한은행: 100-023-855255, 예금주: 대림3동 어린이집
==============================================================================================================

- Oracle 11g R2 서버 재설치(삭제 후 재 설치) ==> 집에서
1. Oracle 11g R2 서버 설치 ==> D:\app\TAMA2\product\11.2.0\dbhome_1
2. 설치 후 각종 구성
 1) Database Configuration Assistant로 데이터베이스 구성 ==> 생성
 2) Net Configuration Assistant Net Configuration Assistant 구성 ==> 생성 실패
  가. 접속 중...ORA-12514: TNS:리스너가 현재 접속 기술자에 요청된 서비스를 알지 못함 테스트를 실패했습니다.
 3) Net Manager 구성  ==> 설치 못 함
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■