 

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+---------------------------------------------// Memo(2015.07) //----------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á


¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.01(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==> DTD ±³À°(10½Ã ~ 11:30, °­»ç: LG CNS Á÷¿ø)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj
1. »ó´ÜFR(/Top.xfdl) ¸Þ´º °³¹ß[ÇÏ´Ü ÅÇ ¸Þ´º => »ó´Ü ÅÇ ¸Þ´º·Î º¯°æ)
==============================================================================================================

- ÇÔ¼ö¸í º¯°æ ¿¹Á¤ÀÎ ÇÔ¼ö¸í
cls_TabButtonInfo.xjs ===> cls_TabButtonInfo.xjs 
lib_menu.xjs ===> lib_com_menu.xjs
lib_formcommon.xjs ===> lib_com_formcommon.xjs
lib_syscommon.xjs ===> lib_com_syscommon.xjs
==============================================================================================================
 
- ±ÍÈ­
1. ¶È¶ÈÇÑ ÇÑ±¹»ìÀÌ-±¹ÀûÃëµæÆí==> https://www.youtube.com/watch?v=N2s1dz0Digg
2. ±ÍÈ­½ÃÇè - ÇÑ±¹ÀÎ µÇ±â ==> https://www.youtube.com/watch?v=9fO0ANfIDxw
3. ´ÙÅ¥¸àÅÍ¸® '±ÍÈ­' ==> https://www.youtube.com/watch?v=icjbr1yJPZE
4. ´Ù¹®È­ »ç¶û - ¿ø°îµ¿ ÀÛÀº¼¼°è, ±×µéÀÇ ÀÌ¾ß±â_#001 ==> https://www.youtube.com/watch?v=V2w7TBlpJRI
==============================================================================================================
 
- ·ç¿º Á÷ºÒÄ«µå·Î ½Å¿ëÄ«µå °áÁ¦ ±â´É Ãß°¡   
1. °øÀÎÀÎÁõ¼­: l**enl*l*3**A@, ISP ºñ¹Ð¹øÈ£: l*l*3**A(¾ÆÀÌÆù°ú °°À½) 
2. [±¹¹ÎÀºÇà] KBÁ¾ÇÕÅëÀå-ÀúÃà¿¹±Ý[·ç¿º]: ·ç¿º »ýÈ°ºñ ÅëÀå ==> 2014.11.07(±Ý) °¡ÀÔ @@@
 1) °èÁÂ¹øÈ£: 037401-04-130647(03740104130647)
==> DINH THI £ÌUYEN, lueyen94 / 0**8  ==> https://obank.kbstar.com, lueyen94 / t*m* 05*8
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.02(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj
1. »ó´ÜFR(/Top.xfdl) ¸Þ´º °³¹ß[ÇÏ´Ü ÅÇ ¸Þ´º => »ó´Ü ÅÇ ¸Þ´º[µ¿Àû DIV > ¹öÆ°]·Î º¯°æ)
==============================================================================================================

- positoin absolute ºÐ¼®
Map.position = "absolute 16 1 172 56";

ap.position.style = "absolute";
Map.position.left = "16";--> ÄÄÆ÷³ÍÆ®ÀÇ ÁÂÃø À§Ä¡¸¦ ÁöÁ¤ÇÏ´Â ¼Ó¼º
Map.position.top = "1";--> ÄÄÆ÷³ÍÆ®ÀÇ »ó´Ü À§Ä¡¸¦ ÁöÁ¤ÇÏ´Â ¼Ó¼º
Map.position.right = "110" ;--> ÄÄÆ÷³ÍÆ®ÀÇ ¿ìÃø À§Ä¡¸¦ ÁöÁ¤ÇÏ´Â ¼Ó¼º ==> with¿Í À¯»ç
Map.position.bottom = "200";--> ÄÄÆ÷³ÍÆ®ÀÇ ÇÏ´Ü À§Ä¡¸¦ ÁöÁ¤ÇÏ´Â ¼Ó¼º ==> heighth¿Í À¯»ç 

- positoin absolute ºÐ¼®
Map.position = "absolute 16 1 172 56";

div_mdi.position = "51 70 1000 120";  // TERST @@  ===>
==============================================================================================================

- °øÅë Å¸ÀÌÆ² Ã¢ »ó¼Ó
1. user_formÀ» »ç¿ëÇÏ¿© /nh_base_title.xfdl °øÅë È­¸é ÀÛ¼º
2. /NOTI_POINT.xfdl ÆÄÀÏ¿¡¼­ »ó¼Ó ¹ÞÀ½(inheritanceid="nh_base_title")
<Form id="NOTI_POINT" classname="LWPAM107000" inheritanceid="nh_base_title" position="absolute 0 0 846 578" 
titletext="°øÁö»çÇ×" visible="true" onload="NOTI_POINT_onload" onsize="LWPAM107000_onsize"> 
</Form>
==============================================================================================================
 
- °ú¾÷¼öÇà°èÈ¹¼­ ÀÛ¼º
0. °ú¾÷¼öÇà°èÈ¹¼­ ÀÛ¼ºÇÏ¿© ±è¹®ÁÖ ÆÀÀå(ammesia@tobesoft.com)¿¡°Ô ¸ÞÀÏ·Î º¸³»±â
--> ¹ÚÀç¿Ï ºÎÀå(010-8241-4516, jwanpark@lgcns.com, LG CNS ÇÏÀÌÅ×Å©»ç¾÷º»ºÎ, ERP1ÆÀ PL)
1. °ú¾÷ÀÇ °³¿ä
2. °ú¾÷ÀÇ ¹üÀ§
3. ´Ü°èº° ¼¼ºÎ °ú¾÷¼öÇà ³»¿ë 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.03(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj
1. »ó´ÜFR(/Top.xfdl) ¸Þ´º °³¹ß[ÇÏ´Ü ÅÇ ¸Þ´º => »ó´Ü ÅÇ ¸Þ´º[µ¿Àû DIV > ¹öÆ°]·Î º¯°æ) ==> Åõºñ¿¡ ¹®ÀÇÇÒ °Í
==============================================================================================================

- user_form Ãß°¡ °³¹ß
1. user_title(/nh_base_title.xfdl) °øÅë Å¸ÀÌÆ² Ã¢[01] ==> »ç¿ë
2. nh_base_inqCond(/nh_base_inqCond.xfdl) °øÅë Á¶È¸ Á¶°Ç[02] »ý¼º ==> »ç¿ë ¾ÈÇÔ
3. nh_base_inqCondReg(/nh_base_inqCondReg.xfdl) °øÅë Á¶È¸, µî·Ï Á¶°Ç[02] »ý¼º ==> »ç¿ë ¾ÈÇÔ
==============================================================================================================

-  URL º¯È¯¿¡ ½ÇÆÐ 
1. Çö»ó
uxs (7136): Error: URL º¯È¯¿¡ ½ÇÆÐÇÏ¿´½À´Ï´Ù. (file://D:/Tama_Prject/2015_06.25_ÇÑ¼¶ERP/./Images/
ico_treeopen.png:IMG::ico_treeitem.png)
uxs (7136): Error: URL (file://D:/Tama_Prject/2015_06.25_ÇÑ¼¶ERP/Images/ico_treeopen.png:IMG::ico_treeitem.png) À» 
·ÎµùÇÏ´Âµ¥ ´ÙÀ½°ú°°Àº http ¶Ç´Â  socket ¿¡·¯ÄÚµå -1·Î ½ÇÆÐÇÏ¿´½À´Ï´Ù.
uxs (7136): Error: TypeDefinition¿¡ (file://D:/Tama_Prject/2015_06.25_ÇÑ¼¶ERP/Images/ico_treeopen.png:IMG) 
¼­ºñ½º ±×·ìÀÌ Á¸ÀçÇÏÁö ¾Ê½À´Ï´Ù. 
uxs (7136): Error: ºÎÀûÇÕÇÑ ResponseItem(id=file://D:/Tama_Prject/2015_06.25_ÇÑ¼¶ERP/Images/ico_treeopen.png:I
MG::ico_treeitem.png,hr=ffffffff)
uxs (7136): Error: ÀÌ¹ÌÁö Á¤º¸ (IMG::ico_treeopen.png:IMG::ico_treeitem.png) À» Ã£À» ¼ö ¾ø½À´Ï´Ù.
uxs (7136): [/LEFT.xfdl] ==> [TEST_01] 
2. ¿øÀÎ: /LEFT_2.xfdl ÆÄÀÏ¿¡¼­ treeitemimage¸¦ 2°³ ¼³Á¤ÇÔ
1) treeitemimage:URL('IMG::ico_treeopen.png:IMG::ico_treeitem.png');
3. Á¶Ä¡: /LEFT_2.xfdl ÆÄÀÏ¿¡¼­ treeitemimage¸¦1°³ Á¦°Å
1) treeitemimage:URL('IMG::ico_treeopen.png');
==============================================================================================================

- theme ¼Ò½º Á¦°Å(CSS·Î °¥ ¿¹Á¤)
image: URL('theme://images/btn_TitlebarForm_Min_N.png');
image: URL('IMG::btn_goHome.png');
==============================================================================================================

- °øÅë Grid »ç¿ë(/nhGrid.xjs ±×¸®µå °øÅë ÄÄÆÛ³ÍÆ®)
1. »ç¿ë ¹æ¹ý: nhGrid.f_check("true")
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.04(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> 
 
- ÁÖ¸» 
04:00 ±â»ó
05:00 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷
07:00 Á¾·á
08:00 TV ½ÃÃ»
11:00 ÁýÃâ¹ß
11:20 Áø·á(¸í¼Ò¾Æ°úÀÇ¿ø): ¼öÁ¾ Æó·Å ÃÊ±â Áõ¼¼
11:30 Á¶Á¦(ÇÑµ¶ÇÁ¶óÀÚ¾à±¹)
11:40 ³²±¸·Î½ÃÀå(»§, Âü¿Ü(8°³), ¹Ù³ª³ª)
12:00 ±Í°¡
14:00 ³·Àá
17:00 ±â»ó
17:30 ·ç¿º, ¼öÁ¾ º£Æ®³² ¾ð´Ï µ¹ÀÜÄ¡ °¨
20:00 ¼®½Ä
21:00 ·ç¿º, ¼öÁ¾ ±Í°¡
00:00 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.05(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> 
 
¢Ë Á¶±âÃà±¸
06:00 ±â»ó
06:30 ¹ö½º(6411¹ø, ´ë¸²¿ª -> ÇÐµ¿¿ª)
07:20 ½Å±¸ÃÊµîÇÐ±³ 
08:00 °ÔÀÓ(3°ÔÀÓ): 2°ñ ³ÖÀ½(¼öºñ¼ö¿¡¼­ ¿ÀÆÛ·¡ÇÎ ÈÄ ½¸: ¸ÚÀÖ´Â °ñ)
11:05 Á¾·á
11:20 ½Å±¸ÃÊ±³ ¿îµ¿Àå¿¡¼­ °í¹®µé È¸½Ä »ó Â÷·Á ÁÜ(º´±ÔÇü)
11:30 Áß½Ä(±¹¹ä: ¶Ò½ÉÇÑ¿ì): ¸¸¿ø ³¿
12:40 Á¾·á
14:00 6411¹ø ¹ö½º  
15:00 ±Í°¡ 
15:40 ³·Àá
18:30 ±â»ó
19:50 ¼®½Ä
20:50 ¼öÁ¾ ¾Æ·§µµ¸® °¡·Á¿ö¼­ ¸¹ÀÌ ¿ï°í º¸Ã¨
00:00 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.06(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==> ¼öÁ¾ ÀÔ¿ø(09:00 ~ 15:00)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj
1. »ó´ÜFR(/Top.xfdl) ¸Þ´º °³¹ß[ÇÏ´Ü ÅÇ ¸Þ´º => »ó´Ü ÅÇ ¸Þ´º[µ¿Àû DIV > ¹öÆ°]·Î º¯°æ)  
==============================================================================================================

- °øÅë ÇÔ¼ö Á¤¸®
1. ºÒÇÊ¿äÇÑ ÇÔ¼ö »èÁ¦
==============================================================================================================

- AA ÅõÀÔ
1. TMax ÇÁ·¹ÀÓ¿öÅ©
 1) ÀÌÁ¾´ë ´ë¸®(010-8954-8235, jedi8235@naver.com)
2. WAS ¼³Á¤ÇÏ´Âµ¥ 1ÁÖÀÏ Á¤µµ ¼Ò¿äµÈ´Ù°í ÇÔ(Xplatform ¾È ÇØºÃ´Ù°í ÇÔ)
==============================================================================================================

- ¼öÁ¾ Æó·ÅÀ¸·Î ÀÔ¿ø
1. ¼öÁ¾ 119¿¡ ½Ç·Á °¨(ÀúÇ÷´çÀ¸·Î ÀÇ½Ä ÀÒ¾ú´Ù°í ÇÔ) ==> Àú³á¿¡ ´ß ¸Ô°í 12½Ã°£ °¡·® ¾Æ¹«°Íµµ ¾È ¸ÔÀ½
2. ÇÑ¸²´ëÇÐ±³ °­³²¼º½Éº´¿ø ==> 1003È£(º»°ü 10Ãþ) ÀÔ¿ø ½ÃÅ°°í ¿È
3. 19½Ã¿¡ Åð±ÙÇÏ°í ½ÅÇ³¿ª¿¡¼­ ÀÚÀü°Å Å¸°í Áý¿¡ ¿È ==> ¾ÆÀÌÆÐµå, ½Å¹ß, °úÀÏ(Æ÷µµ, ¹Ù³ª³ª) °¡Áö°í º´¿ø Àç ¹æ¹®
==> ¼öÁ¾ »óÅÂ ¸¹ÀÌ È£Àü µÊ ==> 21½Ã 30ºÐ¿¡ ±Í°¡
==> Å«´©³ª¤¿ 6¿ù ¸»¿¡ Æ÷Ç× ´ëµ¿ ¿ì¹æ ±ÙÃ³¿¡ ¹Ì¿ë½Ç °³¾÷ Çß´Ù°í ÇÔ
==============================================================================================================

- ´ç´¢º´ÀÇ ÀúÇ÷´ç
1. Ç÷´ç ¼öÄ¡°¡ 70mg/dl ¹Ì¸¸ÀÏ ¶§ 
--------------------------------------------------------------------------------
- ´ç´¢º´ÀÇ ÀúÇ÷´ç°ü¸®(°æÈñÀÇ·á¿ø)
https://www.youtube.com/watch?v=LYgNAbQRs-o
- °³ÀÎ¿ë Ç÷´çÃøÁ¤±â ¾ÆÅ¥Ã¥ »ç¿ë¹ý µ¿¿µ»ó
https://www.youtube.com/watch?v=wD2zfJglgpk
- ¼Ò¸®¾øÀÌ Ã£¾Æ¿À´Â ºÒÃ»°´ 'ÀúÇ÷´ç ¼îÅ©'
http://blog.naver.com/hmggmc/220261390089
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.07(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 19:10 ==> °ûÇöÁØ Â÷Àå µðÀÚÀÎ ±³À°(2ÀÏ°£), ¼öÁ¾ º´¹®¾È(20:30 ~ 22:00)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- °øÅë ÇÔ¼ö Á¤¸®
1. ºÒÇÊ¿äÇÑ ÇÔ¼ö »èÁ¦
==============================================================================================================

- ÇÑ¼¶ ERP Àç±¸Ãà PrjÅÛ Prj IP ÁÖ¼Ò
1. IP ÁÖ¼Ò: 172.168.110.79, GW: 172.168.110.254
SM: 255.255.255.0, DNS: 59.10.4.200
2. ÆÄÀÏ ¼­¹ö
\\172.168.110.42 --> ÇÑ¼¶ERP, 20160101a
==============================================================================================================

- º¸¾È ±³À°(µ¿¿µ»ó ½ÃÃ», lg cns)
1. Á¤º¸º¸¾È ÇÐ½À: http://partnercampus.lgcns.com/layout/layout/mainFrame.dev
2. LG CNS ÀÎÁõ¼­ ¹ß±Þ
 1) ºñ¹Ð¹øÈ£: ssp**m8**1!@  ==> PartnerPlus ID: DEV109094, hpÅÂ*1*!@
==============================================================================================================

- º¸¾È ÇÁ·Î±×·¥ ¼³Ä¡
1. v3 ¼³Ä¡(AhnLab V3 Internet Security 8.0.exe)
2. z ¼³Ä¡(zsetup.exe)
3. PC Check ¼öÇà(PCCheck_1.7.3 > start.bat)
 ==> red°¡ ¾ø´Â »óÅÂ¿¡¼­ È­¸é Ä¸Ã³ ÈÄ Ãâ·ÂÇÏ¿© Á¦Ãâ
 --> file:///D:/51.%20TAMA%20SW/PCCheck_1.7.3/web/main.html?empno=DEV109094&empnm=ÁøÅÂ¸¸
 ==> TAMA ³ëÆ®ºÏ: TAMA / hp¼ö*12!@, asas1212
4. ÇÑ¼¶ DRM ¼³Ä¡ ==> º°µµ °øÁö
==============================================================================================================

- È­¸éº¸È£±â ºñ¹Ð¹øÈ£ ¼³Á¤
1. ½ÃÀÛ¹öÆ° > Á¦¾îÆÇ > »ç¿ëÀÚ °èÁ¤ > ¿©±â¼­ ºñ¹Ð¹øÈ£ ¼³Á¤À» ÇÏ½Ã°í
2. ¹ÙÅÁÈ­¸é¿¡ ¿ìÅ¬¸¯ > °³ÀÎ¼³Á¤ > ¿ìÃø ÃÖÇÏ´Ü¿¡ È­¸é º¸È£±â > ´ë±â ½Ã°£°ú ½ºÅ©¸° ¼¼ÀÌ¹ö ¼³Á¤ ÈÄ ÀúÀå
-------------------------------------------------------------------------------------------------------

- ¸í·ÉÃ¢¿¡¼­ À©µµ¿ì7ÀÇ ±âº» °øÀ¯/µðÆúÆ® °øÀ¯¸¦ Á¦°ÅÇÏ´Â ¸í·É¾î  
C:\Users\TAMA> net share==> È®ÀÎ
C:\Users\TAMA> net share  c$  /delete==> Á¦°Å
C:\Users\TAMA> net share  d$  /delete==> Á¦°Å
==============================================================================================================

- TAMA PC ºñ¹Ð¹øÈ£ º¯°æ
1. TAMA / asas1212==> º¯°æ(»ç¿ëÇÒ °Í)
2. TAMA / hp¼ö*12!@==> (ÀÌÀü °Í)
3. administrator / asas1212, qwqw1212==>  (ÀÌÀü °Í)
==============================================================================================================

- ¼öÁ¾ ½Çºñº¸Çè È®ÀÎ
1. ¹«¹è´ç ±Â¾Ø±Â¾î¸°ÀÌCIº¸Çè(Hi1304)(Çö´ëÇØ»ó, Áø¼öÁ¾) ==> ¿ù³³ÀÔ¾×: 52,000¿ø(Ãâ»ê ÈÄ ¸¸¿ø ÇÒÀÎµÊ) 
2. ½Çºñº¸Çè Ã»±¸ ¼­·ù
 1) Áø·áºñ ¿µ¼öÁõ, Áø·áºñ ¼¼ºÎ ³»¿ª¼­, ÀÔÅð¿ø È®ÀÎ¼­, Ã³¹æÀü, Áø´Ü¼­³ª Áø·áÂ÷Æ® º¹»ç, ½ÅºÐÁõ ÅëÀå »çº»
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.08(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> ¼öÁ¾ º´¹®¾È(20:30 ~ 22:00): ´ã´çÀÇ»ç¿Í »ó´ã(Åð±ÙÀÏÀÚ ÇùÀÇ): ¼öÁ¾ ÀúÇ÷´ç

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- Á¶È¸, ÀúÀå, »èÁ¦ Ã³¸®(transction)
1. Á¶È¸, ÀúÀå
==============================================================================================================

- PicPick StartUp ¼³Á¤
1. ÇöÀç »ç¿ëÀÚ
 1) Name: PicPick Start 
 2) Data: "C:\Program Files (x86)\PicPick\picpick.exe" /startup
 3) Registray: ÇöÀç »ç¿ëÀÚ¿¡°Ô ¸Å¹ø
==============================================================================================================

- º¸¾È ÇÁ·Î±×·¥ ¼³Ä¡
1. ÇÑ¼¶ DRM ¼³Ä¡ ==> handsome01, 1111
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.09(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> ¼öÁ¾ Åð¿ø(10:30 ~ 11:30, º´¿øºñ 40¸¸¿ø ³ª¿È): Áý¿¡¼­ Áß½Ä

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- ÀúÀå, »èÁ¦ Ã³¸®(transction)
1. Á¶È¸, ÀúÀå, »èÁ¦
==============================================================================================================

- Alert Msg Çü½Ä  
gf_Alert("BBA01423");	// BBA01423: °Ë»ö Á¶°ÇÀ» ¼±ÅÃÇØÁÖ¼¼¿ä. 
gf_Alert("MSG00017");	// MSG00017: »èÁ¦ÇÒ Á¤º¸ÀÇ  Ã¼Å©¹Ú½º¸¦ ¼±ÅÃÇÏ½Ê½Ã¿À
if(gf_Confirm("MCB00014", "", "")) { }	// MCB00014: »èÁ¦ÇÏ½Ã°Ú½À´Ï±î? 
application.alert(" ³óÃàÇù »ç¿ëÀÚ°¡ ¾Æ´Õ´Ï´Ù","Á¤º¸","information"); 
gf_Alert("BLJ01757",["["+getScreenInfo("MENU_NO")+"]" + getScreenInfo("MENU_NAME") + "È­¸éµµ¿ò¸»"]);//@ ÀÌ(°¡) Á¸ÀçÇÏÁö ¾Ê½À´Ï´Ù.
-------------------------------------------------------------------------------------------------------------------------
 
- /gds_message.xml(/ÇÑ¼¶ERP\load_init) 
<Row>
<Col id="MSG_ID">BBA01423</Col>
<Col id="MSG_STR">°Ë»ö Á¶°ÇÀ» ¼±ÅÃÇØÁÖ¼¼¿ä</Col>
</Row>
<Row>
<Col id="MSG_ID">MSG00017</Col>
<Col id="MSG_STR">»èÁ¦ÇÒ Á¤º¸ÀÇ  Ã¼Å©¹Ú½º¸¦ ¼±ÅÃÇÏ½Ê½Ã¿À.</Col>
</Row>
<Row>
<Col id="MSG_ID">MCB00012</Col>
<Col id="MSG_STR">µî·Ï ÇÏ½Ã°Ú½À´Ï±î?</Col>
</Row>
<Row>
<Col id="MSG_ID">MCB00013</Col>
<Col id="MSG_STR">¼öÁ¤ ÇÏ½Ã°Ú½À´Ï±î?</Col>
</Row>
<Row>
<Col id="MSG_ID">MCB00014</Col>
<Col id="MSG_STR">»èÁ¦ ÇÏ½Ã°Ú½À´Ï±î?</Col>
</Row>

<Row>
<Col id="MSG_ID">BLJ01757</Col>
<Col id="MSG_STR">@ ÀÌ(°¡) Á¸ÀçÇÏÁö ¾Ê½À´Ï´Ù.</Col>
</Row>
==============================================================================================================

- AA ¿äÃ» »çÇ×
1. XP ÀüÀÚÁ¤ºÎÇÁ·¹ÀÓ Àû¿ë °¡ÀÌµå ==> ±è¹®ÁÖ ÆÀÀå¿¡°Ô ¸ÞÀÏ·Î ¹Þ¾Æ¼­ ÆÄÀÏ¼­¹ö¿¡ µî·Ï(Egove°¡ÀÌµå.zip)
2. °³¹ß °¡ÀÌµå ¹®¼­ Á¦°ø
3. À¥º¸¾È Ãë¾àÁ¡(È®ÀÎ)
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.10(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> 7¿ù Àü¶ô È¸ÀÇ Ãë¼Ò((ÁÖ)Áö¾ÆÀÌµ¥ÀÌÅ¸, 19½Ã)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- ÀúÀå, »èÁ¦ Ã³¸®(transction)
1. Á¶È¸, ÀúÀå, »èÁ¦
==============================================================================================================

- Grid ÀüÃ¼ ¼±ÅÃ(checkbox·Î ÀüÃ¼ ¼±ÅÃ, ¹Ì ¼±ÅÃ ¼³Á¤)
/*-----------------------------------------------------------------------------------------------
 * gd_onheadclick : Grid ÀüÃ¼ ¼±ÅÃ
 *----------------------------------------------------------------------------------------------*/ 
function gd_onheadclick(obj:Grid, e:GridClickEventInfo)
{ 
	if(e.col == 0)
	{
		var sVl = obj.getCellProperty("head", e.col, "text");
		var sCk;

		if (sVl == "0")
		{
			obj.setCellProperty("head", e.col, "text", '1');
			sCk="1";
		} 
		else 
		{
			obj.setCellProperty("head", e.col, "text", '0');
			sCk="0";
		}  

		for(var i=0 ; i< eval(obj.binddataset).rowcount ; i++)   // checkbox·Î ÀüÃ¼ ¼±ÅÃ, ¹Ì ¼±ÅÃ ¼³Á¤
		{
			eval(obj.binddataset).setColumn(i, "CHK", sCk);  
		}  // end of for()
	} else {
		gfn_GridSort(obj,e);  // Grid Sort ¼³Á¤
	}
}
==============================================================================================================

- È­¸é ÅÛÇÃ¸´ È¸ÀÇ(10½Ã, È¸ÀÇ½Ç)
1. ±ÇÇÑ°ü¸®(»ç¿ëÀÚ±ÇÇÑ°ü¸®), Menu
http://www.egovframe.go.kr/wiki/doku.php?id=egovframework:%EA%B6%8C%ED%95%9C%EA%B4%80%EB%A6%AC
2. TO_DO_LIST(ÀÏÁ¤ °ü¸®) ºÐ¼®
==============================================================================================================

- XPlatform°ú ÀüÀÚÁ¤ºÎÇÁ·¹ÀÓ¿öÅ© ¿¬µ¿°ü·Ã ÀÚ·á  
1) ÀüÀÚÁ¤ºÎ Ç¥ÁØÇÁ·¹ÀÓ¿öÅ© www.egovframe.go.kr
2) Á¢¼Ó ÈÄ »ó´Ü °Ë»öÃ¢¿¡¼­ ¡°XPLATFORM¡±À¸·Î °Ë»ö 
3) ÀÚ·á È®ÀÎÀ¸·Î ÁøÇà 
4) UI Adapter °¡ÀÌ³ª º°µµ·Î Á¦°øµÇ´Â ¸µÅ©¸¦ ÂüÁ¶ 
 °¡. UI Adapter °¡ÀÌµå :  http://www.egovframe.go.kr/wiki/doku.php?id=egovframework:rte2:ptl:ui_adaptor 
 ³ª. ÅÛÇÃ¸´ ¸µÅ©: http://www.egovframe.go.kr/files/com/XPlatform.zip 
==============================================================================================================

- ÇÑ¼¶ ERP Àç±¸Ãà Prj AS-IS
1. http://172.168.110.41 ==> HYUNDAI/HYUNDAI1
 2) »ý»ê°ü¸® > »ý»êÁö½Ã°ü¸® > 104. »ý»êÁö½Ã¼­(»çÀºÇ°) °ü¸®
==============================================================================================================

- ¼öÁ¾ ¿Ü·¡Áø·á(11:10, °­³²¼º½Éº´¿ø)
1. 2015.07.13(¿ù) 11:00 ¼Ò¾ÆÃ»¼Ò³â°ú, ¹æÁö¼® ¼±»ý´Ô
2. 2015.07.13(¿ù) 11:15 ¼Ò¾ÆÃ»¼Ò³â°ú, ÀÌ°ÇÈñ ¼±»ý´Ô
3. ÀüÈ­(¿Ü·¡): 02-829-5142 ==> http://kangnam.hallym.or.kr/PD/?cms_idx=46&scr=300
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.11(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> 
 
- ÁÖ¸»(¢Ë Á¶±âÃà±¸)
05:00 ±â»ó
05:20 ¹ö½º(6411¹ø, ´ë¸²¿ª -> ÇÐµ¿¿ª)
06:20 ½Å±¸ÃÊµîÇÐ±³ 
06:30 ¼ô°ÔÀÓ 
07:50 Á¾·á
08:30 Áß½Ä(´ß°õÅÁ, È­Á¤½Ä´ç): ¸¸¿ø ³¿ ==> ÀÌ¹øÁÖ ÆòÀÏ¿¡ ¼öÀÎÀÌÇüÇÏ°í ¼º¼öÇüÇÏ°í ¿îµ¿Àå¿¡¼­ ½Î¿îÀÏ·Î ¸» ¸¹À½
09:40 Ä¿ÇÇ¼ó¿µ¼®ÀÌÇüÇÏ°í ÅÂÈÆÀÌÇüÀÌ ½ô)
10:40 Á¾·á
10:50 ³²»ê ±¸°æ(¿µ¼®ÀÌÇüÂ÷, º´·æÀÌ)
11:30 °í¼ÓÅÍ¹Ì³Î 
14:00 6411¹ø ¹ö½º  
13:00 ±Í°¡ 
14:00 ÀÌ¹ß(·ç¿ºÀÌ ÇØÁÜ)
13:30 ³·Àá
17:00 ±â»ó
17:30 ¼îÇÎ(ÀÌ¸¶Æ® ±¸·ÎÁ¡) ==> ¿°»ö¾à ±¸ÀÔ(ÀÌ¸¶Æ® ¿°»ö¾à[4,950¿ø], Èë°¥»ö)
18:30 ¼®½Ä(ÀÌ¸¶Æ® ±¸·ÎÁ¡ 3Ãþ ½Ä´ç)
20:30 ±Í°¡
00:00 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.12(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ÅÂÇ³ ÂùÈìÀ¸·Î ºñ ¸¹ÀÌ ¿È
 
- ÁÖ¸»2
06:00 ±â»ó
06:30 Á¶½Ä(»§) 
12:30 Áß½Ä
13:30 ³·Àá
17:00 ±â»ó
18:30 ¼®½Ä(Â¥Àå¸é2, ÅÁ¼öÀ°): ¸¸µð¸°(±¸·Îµ¿) ==> ¸¸ 5Ãµ¿ø(¼ÂÆ® ¿ä¸®)
	==> ¸¸´Ù¸°(¼­¿ï½Ã ±¸·Î±¸ ±¸·ÎÁß¾Ó·Î 55)  ==> http://map.naver.com/local/siteview.nhn?code=13054308
	==> ·¡¸®¼º(¼­¿ï½Ã ±¸·Î±¸ µµ¸²·Î20±æ 10) ==> http://map.naver.com/local/siteview.nhn?code=13145759 
23:20 °³¾÷ È­ºÐ(Çà¿î¸ñ, 11¹ø°¡): Å«´©³ª ¹Ì¿ë½Ç °³¾÷ ¼±¹°(Æ÷Ç×½Ã ºÏ±¸ ¿ìÇöµ¿ 104-7 ¹øÁö ´ëµ¿»ó°¡ 109È£ ²Ò²¿¸®¹Ì¿ë½Ç)
	http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1204959133&xfrom=&xzone=
00:00 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.13(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==> ¼öÁ¾ ¿Ü·¡Áø·á(11:10, °­³²¼º½Éº´¿ø, ·ç¿º)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- UI °øÅë ÀüÃ¼ ¼öÁ¤
==============================================================================================================

- Shock StartUp ¼³Á¤(ÇöÀç »ç¿ëÀÚ) ==> Win 7 64Bit
1. ÀÌ¸§: 01. Windows Å½»ö±â, µ¥ÀÌÅÍ: C:\WINDOWS\explorer.exe 
2. ÀÌ¸§: 02. EditPlus 3, µ¥ÀÌÅÍ: C:\Program Files (x86)\EditPlus 3\editplus.exe 
3. ÀÌ¸§: 03. IE 8, µ¥ÀÌÅÍ: C:\WINDOWS\ie8\iexplore.exe  --> Æ²¸²
==============================================================================================================

- Äü ¸Þ´º
1. °øÁö»çÇ×(NOTI_POINT)
2. ¿À´ÃÀÇÇÒÀÏ(TO_DO_LIST)
3. »çÀÌÆ®¸Ê(SITE_MAP)
4. ÅëÇÕ°Ë»ö(INTG_SRCH)
5. ¿ë¾î»çÀü(TRNL_DIC) 
6. ¸Þ½ÅÀú(MSNG)  
7. °³ÀÎ¼³Á¤(INDV_SET) 
==============================================================================================================

- Æû À§Ä¡ È®ÀÎ(form position)
/*****************************************************************************************
* ÇÔ  ¼ö  ¸í : formTest_onclick()
* ¼³      ¸í : form Test(ÆûÀÌ ¿­·È´Â Áö È®ÀÎ)
*****************************************************************************************/  
function formTest_onclick(obj:Button, e:ClickEventInfo)
{  
	// trace("[/Top.xfdl] [formTest_onclick()] ==> [TEST_01] [gv_fs_work.all.length]"+ gv_fs_work.all.length ); 

	for(var i=0; i< gv_fs_work.all.length; i++)
	{
		// trace("[/Top.xfdl] [formTest_onclick()] ==> [i_¹øÂ°]"+ i +"[gv_fs_work.all[i].name]"+ 
		gv_fs_work.all[i].name +"[gv_fs_work.all[i].position]"+ gv_fs_work.all[i].position );  
	}  // end of for()
}
==============================================================================================================

- ¼öÁ¾ ¿Ü·¡Áø·á(11:10, °­³²¼º½Éº´¿ø)
1. 2015.07.13(¿ù) 11:00 ¼Ò¾ÆÃ»¼Ò³â°ú(½Å°ü 1F), ¹æÁö¼® ¼±»ý´Ô
2. 2015.07.13(¿ù) 11:15 ¼Ò¾ÆÃ»¼Ò³â°ú(½Å°ü 1F), ÀÌ°ÇÈñ ¼±»ý´Ô
3. ÀüÈ­(¿Ü·¡): 02-829-5142 ==> http://kangnam.hallym.or.kr/PD/?cms_idx=46&scr=300
==============================================================================================================

- ºÐ¼®
1. ¿¡¾îÄÁ ¼³Ä¡ÇÏ´Â ¹ý(10½Ã, ºÐ¼®)
2. ¹æÃæ¸Á ¼ö¸®  ==> http://m.blog.naver.com/jdh8624550/220027089766
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.0714(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:10 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- °øÅë DS ¼öÁ¤
gds_ReqSystemHeader// TRANSCTION Header ¼¼ÆÃ DS
gds_ReqChannelCommon// °Å·¡°øÅëºÎ ¼¼ÆÃ DS  
gds_ResMessageCntn// ¼­¹ö¿¡¼­ ¸®ÅÏµÈ ¸Þ¼¼Áö¸¦ Ã³¸® DS
==============================================================================================================

- WAS
1. JEUS
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.15(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- ÆÄÀÏ ¾÷·Îµå(0001_SMP_FileUpDown.xfdl)
1. ÆÄÀÏ ¾÷·Îµå ==> http://127.0.0.1:9080/JSP_HANSOME/fileUploadForm.jsp
==============================================================================================================

- ÆÄÀÏ ¾÷·Îµå
https://www.youtube.com/watch?v=lCQQxdc2wLI
http://blog.daum.net/revolo/2859487 
==============================================================================================================

- °øÅëÇÔ¼ö¸í ¼öÁ¤
form_onload --> gfn_formOnload
form_onkeydown --> gfn_onKeyDownd
addBaseTitleButtonEvent --> gfn_addBaseTitleButtonEvent
f_auth_onclick --> gfn_authOnclick
setBaseTitle --> gfn_setBaseTitle
form_onload --> gfn_formOnload
setBaseTitle --> gfn_setBaseTitle
setUseButton --> gfn_setUseButton
scanAllComponent --> gfn_scanAllComponent
setStaticDefaultSet --> gfn_setStaticDefaultSet
setBtnAutr --> gfn_setBtnAutr
setDefaultBtnAuth --> gfn_setDefaultBtnAuth
findComCode --> gfn_findComCode 
==============================================================================================================

- ¸®¹ö½º ¿£Áö¸®¾î¸µ È¸ÀÇ(10½Ã, È¸ÀÇ½Ç)
1. ÇÑ¼¶ ÇÁ·Î±×·¥¿¡ ¾îµµºñ ÄÝµåÇ»Àü(Adobe ColdFusion)ÀÌ Àû¿ëµÈ AS-IS È­¸é ºÐ¼®, ¼³°è È­¸é ¾øÀ½
2. ¸®¹ö½º ¿£Áö¸®¾î¸µÇÒ ¼ö ÀÖ´ÂÁö °í¹Î ¿äÃ»(LG CNS ¹ÚÀç¿Ï ºÎÀå ¿äÃ»)
https://ko.wikipedia.org/wiki/%EC%96%B4%EB%8F%84%EB%B9%84_%EC%BD%9C%EB%93%9C%ED%93%A8%EC%A0%84
==> Çö½ÇÀûÀ¸·Î ºÒ°¡´ÉÇÏ´Ù°í ÇÔ
==============================================================================================================

- ±Ù¹«³»¿ª¼­ Á¦Ãâ ¿äÃ»
1. ±Ù¹«³»¿ª¼­ ÀÛ¼ºÇÏ¿© (ÁÖ)Åõºñ¼ÒÇÁÆ® ÀÌÀ±¼± ¼±ÀÓ ¸ÞÀÏ jasc13@tobesoft.com ·Î ¹Ù·Î º¸³»½Ã¸é µË´Ï´Ù.
==============================================================================================================
 
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.16(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]
- °øÅë ¼öÁ¤
1. »õÃ¢ ¶ç¿ì±â
==============================================================================================================

- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1.  »õÃ¢ ¶ç¿ì±â
==============================================================================================================

- SVN
1. URL: https://172.168.110.41:7443/svn/D_HS  ==> tamario / 0898
==============================================================================================================

- ½º¸¶Æ®ÆùÀ¸·Î ÆÑ½º º¸³»±â
1. ¸ð¹ÙÀÏ ÆÑ½º(SK) --> https://www.youtube.com/watch?v=e7kCDSfirQw
http://blog.naver.com/mong728/220397006311
==============================================================================================================

- DB ·Î±×ÀÎ Á¤º¸(DB ÁÖ¼Ò)
1. 172.168.110.41:1522:HSED -->  HSE_APP / apphse#$
# ÇÑ¼¶ ERP Àç±¸Ãà Pro ¼­¹ö DB  @@@@@@@@  
TAMADB =
  (DESCRIPTION =
    (ADDRESS = (PROTOCOL = TCP)(HOST =172.168.110.41)(PORT = 1522))
    (CONNECT_DATA =
      (SERVER = DEDICATED)
      (SERVICE_NAME = HSED)
    )
  )
--------------------------------------------------------------------------------------------------------

- C:\HS_ERP\workspace\handsome\src\main\webapp\WEB-INF\config\spring\context-datasource.xml
<?xml version="1.0" encoding="UTF-8"?>
<beans xmlns="http://www.springframework.org/schema/beans"
xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
xsi:schemaLocation="http://www.springframework.org/schema/beans http://www.springframework.org/schema/beans/spring-beans-2.5.xsd">

    <bean id="dataSource" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
        <property name="driverClassName" value="net.sf.log4jdbc.DriverSpy"/>
        <property name="url" value="jdbc:log4jdbc:oracle:thin:@172.168.110.41:1522:HSED" />
        <property name="username" value="HSE_APP"/>
        <property name="password" value="apphse#$"/>
    </bean> 
</beans>
==============================================================================================================

- WAS ¼­¹ö¿¡ º¸³»´Â URL Ç¥ÁØ
1. ÇöÀç: xplatform/egovSampleModify.do
2. ¼öÁ¤: xpDsss/SDFDD.do
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.17(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1. »õÃ¢ ¶ç¿ì±â
==============================================================================================================

-- 02. CM_°øÅëÄÚµå»ó¼¼ Á¤º¸ Á¶È¸ @@@ ==> ¾÷¹«±¸ºÐ Á¶È¸
SELECT * FROM TB_CM_COM_CD_DTL   
WHERE COM_CD = 'TSK_CD'
--;  
==============================================================================================================

- MS¿öµå 2010 °í±Þ ½Ç¹« °­ÀÇ[4.¹®¼­ ¸ñÂ÷ ¸¸µé±â] »ùÇÃ µ¿¿µ»ó °­ÁÂ
1. https://www.youtube.com/watch?v=9p5VsuK-hxo
2. ¸ñÂ÷ ¼öÁ¤
 1. ÂüÁ¶ > ¸ñÂ÷ > ¸ñÂ÷»ðÀÔ(I) > ¸ñÂ÷(»õÃ¢): ÀÏ¹Ý> ¼öÁØ Ç¥½Ã(L): 4(3¿¡¼­ 4·Î º¯°æ) --> È®ÀÎ(Å¬¸¯)
==============================================================================================================
 
- MS¿öµå 2013¿¡¼­ Ç¥ »ðÀÔ
1. Ç¥ º¹»ç(ºó Ç¥ Rows º¹»ç) > •Ž¿©³Ö±â ¿É¼Ç : »õ ÇàÀ¸·Î »ðÀÔ(R) ==> »õ·Î¿î Çà¿¡  Ç¥µéÀÌ »ðÀÔµÊ
==============================================================================================================

- ÈÞ°¡ °èÈ¹ ¼öÁ¤
1. 7¿ù 30ÀÏ(¸ñ), 31ÀÏ(±Ý)À¸·Î ÃÖÁ¾ °áÁ¤
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.18(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> 
 
- ÁÖ¸» 
06:00 ±â»ó
06:10 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷(XPlatform_°³¹ß_°¡ÀÌµå_v1.00.doc ÀÛ¾÷)
      ==> MS Office 2013 ÇÁ·Î±×·¥ ¸ÞÀÏ·Î ¹ÞÀ½((ÁÖ)¼ÒÇÁÆ®¿ø °ûÇöÁØ Â÷Àå[µðÀÚÀÌ³Ê]¿¡°Ô ¹ÞÀ½)
08:00 Á¾·á
09:30 ÁýÃâ¹ß
10:20 °­³²¼º½Éº´¿ø ¹æ¹®[ÀÔÅð¿ø È®ÀÎ¼­(1Åë, ¸¸¿ø),  ÀÇ¹«±â·Ï »çº» Áõ¸í¼­(2Åë, 4,240¿ø)] ==> º¸Çèºñ Ã»±¸¿ë
--> ÁÖ¹Îµî·Ï µîº»ÀÌ ÇÊ¿ä(ÀÚµ¿ÆÇ¸Å±â¿¡¼­ Ãâ·Â[200¿ø: ¸ð¸£´Â ¾ÆÁÜ¸¶°¡ ´ë½Å ³»ÁÜ])
11:30 Á¾·á
11:40 ±Í°¡
11:50 Áß½Ä
15:00 ÁýÃâ¹ß
16:00 ¿©ÀÇµµÁßÇÐ±³
16:30 ÃÖÈ­½Ä ¼±¹è(È¸Àå[36È¸], µ¿±¹´ë ÇàÁ¤ÇÐ ±³¼ö), ¾ÈÇüÀÏ(ÃÑ¹«[44È¸], ¼ö¿ø, GIS ¾÷Ã¼ ±Ù¹«)  ==> 3¸í ³ª¿È
16:40 °ÔÀÓ ==> 4°ÔÀÓ ÇÔ(ºñ ¾àÇÏ°Ô ¿È)
18:30 Á¾·á
19:00 ´Ü°ñÁý(T: 755-1858[È¸Çö¿ª 1¹ø Ãâ±¸], ÀÌ¼ºÈ£ ¼±¹è °¡°Ô, ±â¾ÆÂ÷ ¿µ¾÷) 
==> »ï°ã»ì ¸ÔÀ½(´Ù¸®¿¡ Áã°¡ ³ª¼­ °í»ý: ¸ÆÁÖ ¸¶½Ã°í ½ºÇÁ·¹ÀÌ ÆÄ½º »Ñ¸®´Ï±ñ ¸¹ÀÌ È£ÀüµÊ)
20:30 ³ë·¡¹æ(µµ¿ì¹Ì: Àç¹Ì ¾ø¾úÀ½)
00:30 Á¾·á
01:40 ±Í°¡
01:50 ÃëÄ§
==============================================================================================================

- ½ºÄµ »ç¿ë ¹æ¹ý  ==> »ï¼º Ä®·¯ º¹ÇÕ±â(CLX-3175K)
0. http://sajahwa1.blog.me/220280731329
1. SmarThru Office2 ½ÇÇà
2. °¡¿îµ¥ »ó´Ü > ½ºÄµ(ÀÌ¹ÌÁö Å¬¸¯) > ½ºÄµ ¼³Á¤(»õÃ¢) 
 1) ¹Ì¸®º¸±â(Å¬¸¯): ½ºÄµÀ» ÇØ³õÀº ÀÌ¹ÌÁö º¸ÀÓ > ½ºÄµ(Å¬¸¯)
==> C:\Users\TAMA\Documents\41. ½ºÄµ Æú´õ¿¡ ÀÌ¹ÌÁö ¸¸µé¾îÁü
----------------------------------------------------------------------------------------------------

- »ï¼ºÇÁ¸°ÅÍ USB ½ºÄµ ¹æ¹ý
1. USB »ðÀÔ
2. USB ¿¬°á ¹öÆ° ´©¸§
3. ½ºÄµ º¸³»±â ¹öÆ° ´©¸§
 1) ½ºÄµ ÁØºñ ==> USB·Î ½ºÄµ(¼±ÅÃ)
4. OK ¹öÆ° ´©¸§
 1) °¡°ø¿ë°£ 1256M(Ç¥½ÃµÊ)
 2) USB·Î ½ºÄµ ÁØºñ ¿Ï·á
5. ½ÃÀÛ > ÄÃ·¯ ¹öÆ° ´©¸§
 1) ½ºÄµÁß...
6. ¿Ï·á
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.19(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ºñ
 
¢Ë Á¶±âÃà±¸
06:00 ±â»ó
06:40 ÁöÇÏÃ¶(´ë¸²¿ª -> ¼­¿ï´ëÀÔ±¸¿ª)
07:10 ÅÂÈÆÀÌÇü Â÷ 
07:35 ¼öµµÀü°ø µµÂø(ºñ ¾àÇÏ°Ô ¿È)
08:00 ¼­¿ï½Ã¹Î ¸®±× °ÔÀÓ(¶óÀÌÆ® À®À¸·Î ¼±¹ß ÃâÀå) ==> Àü¹Ý ºñ±è[Àü·Â ÁúÁÖ, ¼öºñ Àß Çß´Ù°í ÇÔ]
09:00 Á¾·á ==> ¼­¿ï½Ã¹Î¸®±×(½Å»ç 1: 2 ¿ª»ï)
09:10 °ÔÀÓ(¿ª»ï°ú Ä£¼± °ÔÀÓ): 1°ÔÀÓ ´õ ¶Ü[´Ù¸® ºÎ»óÀ¸·Î ¸¹ÀÌ ¸ø ¶Ü]
11:00 Á¾·á
11:30 Áß½Ä(°í±â, ¿ì¸®½ÄÀ°½Ä´ç[º´±âÇüÀÌ °³¾÷ÇÒ °¡°Ô]): Á¶±â Ãà±¸(2¸¸¿ø ÂùÁ¶)
13:40 Á¾·á
15:00 ±Í°¡ 
15:10 ³·Àá
18:30 ±â»ó
18:40 ¼îÇÎ(³²±¸·Î ½ÃÀå)
19:50 ¼®½Ä
00:00 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.20(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> ÅÂÁ¤ÀÌÇü »ç¸Á(±Ç¿À¼º, ½ÃÆ¼º´¿ø)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú]  
- °øÅë ÇÔ¼ö ¼öÁ¤
commonForm.xjs: form ÃÊ±âÈ­½Ã »ç¿ëÇÒ ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
commonSys.xjs: commonForm.xjs¿¡ form ÃÊ±âÈ­½Ã »ç¿ëÇÒ ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
commonUtil.xjs: °øÅë UTIL °ü·Ã ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_box.xjs: ¸Þ¼¼Áö Ã³¸®¸¦ À§ÇÑ div box ¸¦ »ý¼ºÇÏ±â À§ÇÑ ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_cb.xjs: ¾÷¹« °øÅë Ã³¸® ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_cb_file.xjs: ÆÄÀÏ °ü·Ã ¾÷¹« ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_date.xjs: ³¯Â¥ °ü·Ã °øÅë ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_file.xjs: ÆÄÀÏ °ü·Ã °øÅë ÇÔ¼ö ¸ðÀ½ --> 
lib_lm_common.xjs: Á¶È¸ ±ÇÇÑºÎ¼­ °ü·Ã ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@
lib_menu.xjs: ¸Þ´º °ü·Ã °øÅë ÇÔ¼ö --> ¿Ï·á @@@
lib_message.xjs: ¸Þ¼¼Áö °ü·Ã ÇÔ¼ö --> ¿Ï·á @@@ 
lib_report.xjs: ¸®Æ÷Æ® °ü·Ã °øÅëÇÔ¼ö
lib_tabButtonInfo.xjs: Tab, ¹öÆ° Á¦¾îÇÏ´Â ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@ 
lib_validation.xjs: form validation Ã¼Å©ÇÏ´Â °øÅë ÇÔ¼ö ¸ðÀ½ --> ¿Ï·á @@@ 
==============================================================================================================

- Ç¥ÁØ ¼³¸í È¸ÀÇ(14½Ã, È¸ÀÇ½Ç)
1. ¸í¸í ±ÔÄ¢ AA¿Í ÇùÀÇÇÏ¶ó°í ÇÔ
==============================================================================================================

- °øÅë, ¸ðµ¨¸µÈ¸ÀÇ(18½Ã, È¸ÀÇ½Ç)
1. °øÅë ±è±âÃ¶ ºÎÀåÀÌ ´ã´çÇÑ´Ù°í ÇÔ
==> WAS º¯°æ ÇùÀÇ
==============================================================================================================

- fiddler »ç¿ë¹ý( ÆÐÅ¶ ºÐ¼® ÇÁ·Î±×·¥)
1. http://dsiol.blog.me/120177646288 ¿¡¼­ ´Ù¿î·Îµå ¹ÞÀ½
2. Fiddler´Â Web Debugging ÅøÀÔ, À¥¿¡¼­ ¾î¶² ¿À·ù°¡ ³ª¿ÔÀ»½Ã ¿øÀÎ ÆÄ¾ÇÀ» ÇÏ´Â Åø. 
==============================================================================================================

- UCAP ¼³Ä¡
1. PC ¸Þ½ÅÀú: http://ucap.lgcns.com/pub/setup.exe
2. tamario / 111111
==============================================================================================================

- ½Ò Æ÷´ë ¶â´Â ¹æ¹ýºÎÅÍ º¸°ü±îÁö!    
1. ¹ÚÀ½ÁúÀÌ °í¸® ÇüÅÂÀÇ µ¿±×·± ÂÊÀº ³¡ ºÎºÐ! ±× ¹Ý´ëÆíÀÇ ¸ÅµìÀ» Ç®¾îÇã ºÐ¸®ÇØ¾ß ÇÑ´Ù. 
2. ¸Åµì °í¸® ºÎºÐ ¾ÈÀ¸·Î µé¾î°£ ½ÇÀ» ²¨³½´Ù. 
3. Ç®¾î³½ ½ÇÀÇ ³¡À» Àâ°í ¹Ý´ëÆí ¹æÇâÀ¸·Î ´ç°Ü Ç®¾î³½´Ù. 
4. ±ò²ûÇÏ°Ô ¶â±â ¼º°ø!
http://sharehows.com/all-about-rice-sack
5. ½ÒÆ÷´ë¸¦ ºñ·Ô ¸ðµç Æ÷´ë´Â »ïÁÙ·Î ¹ÚÇô ÀÖ½À´Ï´Ù.  
¶È¹Ù·Î ¼¼¿ì½Ã°í »ó´Ü ±ÍÅüÀÌ µÞÂÊÀ» º¸½Ã¸é  ÁÙÀÌ Á¶±Ý ³ª¿Í ÀÖ´Â °÷ÀÌ ÀÖ½À´Ï´Ù. 
¾öÁö¿Í  °ËÁö·Î  »ìÂ¦  »ì»ì ~  Ç®µíÀÌ ´ç±â±â¸¦ ¹Ýº¹ÇÏ¸é  
½Ç ÇÏ³ª°¡ ±æ°Ô ³ª¿É´Ï´Ù. 
==============================================================================================================

- Capture ±â´É(ÇÑ¼¶ ERP¿¡¼­)
1. ÇÈÇÈ Capture ½ÇÇà(Ctrl + Shift + 0)
2. ¹ÙÅÁÈ­¸éÀ¸·Î °¡±â
3. ÇÈÇÈ Capture ½ÇÇà(Ctrl + Shift + 0)
4. ¿øÇÏ´Â È­¸é Capture
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.21(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> º¸Çè ¼­·ù Àü´Þ(12½Ã, ´ë±Ô, ÇÑ¼¶Prj(Ã»´ã) Áß½Ä °°ÀÌÇÔ)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1. Á¶È¸
==============================================================================================================

- WAS ¼­¹ö¿¡ º¸³»´Â URL Ç¥ÁØ
1. ÇöÀç: xplatform/egovSampleModify.do
2. ¼öÁ¤: xpDsss/SDFDD.do
---------------------------------------------------------------------------------------------------

- EgovComCdMgmtController
C:\HS_ERP\workspace\handsome\src\main\java\hse\sample\controller\EgovComCdMgmtController.java

- SQL Map
1. /EgovSample_Sample_SQL.xml
C:\HS_ERP\workspace\handsome\target\handsome\WEB-INF\classes\egovframework\sqlmap\rte\sample
2. Äõ¸® Ã£±â ==> [jdbc.sqltiming]
==============================================================================================================

- °øÅë, ¸ðµ¨¸µÈ¸ÀÇ(11½Ã, È¸ÀÇ½Ç)
1. °øÅë ¾÷¹«ÇöÈ² ÆÄ¾Ç ==> ÃÖÀûÈ­ ¹æ¾È ¸¶·Ã
==============================================================================================================

- ·ç¿º Á÷Àå Ã¹ Ãâ±Ù
1. ±¤¸íÅ×Å©¼Ö·ç¼Ç(¼­¿ï ±ÝÃµ±¸ °¡»êµ¿ 481-2, 02)855-9100) --> http://www.pcbassembly.co.kr
2. Åð±Ù ÈÄ ÀÚÀü°Å·Î ±¤¸íÅ×Å©¼Ö·ç¼Ç ¹æ¹®(¹®¿µA -> ³²±¸·Î¿ª 5¹ø Ãâ±¸ -> À°±³(³Ê¹« Èûµë) -> ±¤¸íÅ×Å©¼Ö·ç¼Ç)
 ==> ·ç¿º ÀÚÀü°Å·Î ÃâÅð±Ù ¾ÈÇÏ±â·Î ÇÔ
==============================================================================================================

- ±âÀú±Í ±¸ÀÔ  ==> ¿Ï·á 
1. [ÃÑ4ÆÑ+»çÀºÇ° ¹°Æ¼½´4ÆÑ]ÇÏ±â½º º¸¼Ûº¸¼Û ÆÒÆ¼ 5´Ü°è(31px4ÆÑ), °¡°Ý: 73,180¿ø(°³´ç 363¿ø): 11¹ø°¡
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1266607757&xfrom=&xzone=
==============================================================================================================

- ½ºÆ½ ºÐÀ¯ ±¸ÀÔ  ==> ¿Ï·á
1) ³²¾çÀ¯¾÷ ÀÓÆä¸®¾ó µå¸² XO World Class 4´Ü°è ½ºÆ½ 280g, 6ÆÑ(120ºÀ)(°³´ç 8,333¿ø), °¡°Ý: 51,400¿ø, ¿Á¼Ç
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=A957807842&frm3=V2
==============================================================================================================

- ¹°Æ¼½´ ±¸ÀÔ ==> ¿Ï·á 
1. [¸ð³ª¸®ÀÚ] ºÎÀÚµÇ´ÂÁý Çãºê¹°Æ¼½´ ¸®ÇÊ100¸Åx10°³*3°³/16Ùí¹°Æ¼½´, °¡°Ý: 27,480¿ø, G¸¶ÄÏ
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=488061725
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.22(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> º¸Çè ¼­·ù Àü´Þ(12½Ã, PCA ÃßÇÃ·¡³Ê, ÇÑ¼¶Prj(Ã»´ã) Áß½Ä ¾ò¾î ¸ÔÀ½): º¸Çè µé¶ó°í ²¿½É 

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1. Á¶È¸, ¼öÁ¤, »èÁ¦ Ã³¸®
==============================================================================================================

- °øÅë È¸ÀÇ(10½Ã, È¸ÀÇ½Ç)
1. °øÅë Çö¾÷°ú ÇùÀÇ(14½Ã ~ 18½Ã)
==============================================================================================================

- ÇÑ¼¶ ERP Àç±¸Ãà PrjÅÛ Prj IP ÁÖ¼Ò  ==> 2015.07.07(È­) 
1. IP ÁÖ¼Ò: 172.168.110.79, GW: 172.168.110.254
SM: 255.255.255.0, DNS: 59.10.4.200
2. ÆÄÀÏ ¼­¹ö
\\172.168.110.45 --> handsome / 20160101a==> 2015.07.22(¼ö) º¯°æ
==> ÆÄÀÏ ¼­¹ö[06.XPlatform](.45¹ø)
==> ÆÄÀÏ ¼­¹ö[ÁøÅÂ¸¸(UI °øÅë)](.45¹ø)
\\172.168.110.42 --> ÇÑ¼¶ERP / 20160101a==> ÀÌÀü °Í
==============================================================================================================

- ÅÇ ¹öÆ°¿¡ ÀÌ¹ÌÁö ÀÔÈ÷±â ¹®ÀÇ
==============================================================================================================

- ¼ÒÇÁÆ®¿ø ºÐ¼®
1. http://www.esoftone.co.kr
==============================================================================================================

- ÆÝµå Àû¸³ ºñÀ² º¯°æ(ÆÝµå º¯°æ, PCA º¸Çè)  ==> ÀÎÅÍ³Ý¿¡¼­ ½ÅÃ» 
1. https://www.pcakorea.co.kr --> ·Î±×ÀÎ(°øÀÎÀÎÁõ¼­)
2. °è¾àº¯°æ > ÆÝµå ¹× ÅõÀÔ ºñÀ² º¯°æ
 1) »óÇ°¸í: ¹«)ÇÁ¸®¹Ì¾îVULIII(Å¬¸¯)==> Ãß°¡³³ÇÒ °Í(¿¹±Ý¿¡ ÀûÇÕ, »ç¾÷ºñ Ãß°¡·Î ¾È µë)
--> ÆÝµå Àû¸³ ºñÀ² > ÆÝµå(ÆÝµåÀû¸³±Ý)º¯°æ(Å¬¸¯) 
--> ÆÝµå Àû¸³ ºñÀ²(º¯°æ Ã¢)
A+Â÷ÀÌ³ªÆÝµå: 20
Ã¤±Ç: 20
¹è´çÁÖ ÆÝµå: 40
ÇØ¿Ü¼ºÀåÇü: 20
---------------------------------------------------------------------------------------------------------------------------

 2) »óÇ°¸í: (¹«) PCAµå¸²¸µÅ©¥±(Å¬¸¯)
--> ÆÝµå Àû¸³ ºñÀ² > ÆÝµå(ÆÝµåÀû¸³±Ý)º¯°æ(Å¬¸¯) 
--> ÆÝµå Àû¸³ ºñÀ²(º¯°æ Ã¢)
A+Â÷ÀÌ³ªÆÝµå: 20
°¡Ä¡ÁÖ ÆÝµå: 40
Ä£µð¾Æ ÁÖ½ÄÇü: 20
À¯·´ ÁÖ½ÄÇü: 20
ÇØ¿Ü¼ºÀåÇü: 20
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.23(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==>  

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1. °øÅëÄÚµå ¸¶½ºÅÍ ==> Á¶È¸, ¼öÁ¤, »èÁ¦ Ã³¸®  ==> ¿Ï·á @@@
==============================================================================================================

- /commTran.xjs ÆÄÀÏ¿¡¼­ 
transaction(svcid, "svc::" + strURL,  "__DS_TRANS_INFO__=dsTransInfo " + inputDs, outputDs, params, "fn_callBack");
==> VO°¡ ¾ÈµÇ¾î ´Ù½Ã °³¹ß ==> AA°¡ ¼Ò½º ¼öÁ¤ÇÔ
2. °ø°øÅë»ó¼¼ÄÚµå ==> Á¶È¸, ¼öÁ¤, »èÁ¦ Ã³¸®  
/EgovSampleServiceXpImpl.java] [comCdDtlSelectService(
System.out.println("[/EgovSampleServiceXpImpl.java] [comCdDtlSelectService()] [TEST_01]"); 

SampleDefaultVO udDtoVO = new SampleDefaultVO();	//TODO datasetÀ¸·Î ¹Þ¾Æ¼­ Ã³¸®ÇÏ°Ô ²û º¯°æÇØ¾ßÇÑ´Ù.
String test = udDtoVO.getSearchKeyword();
System.out.println("[/EgovSampleServiceXpImpl.java] [comCdDtlSelectService()] [test]"+ test );  
==============================================================================================================

- ½Çºñ º¸Çè±Ý ³ª¿È
1. ÀÔ¿øºñ(¼öÁ¾, Æó·Å, 4ÀÏ ÀÔ¿ø): Çö´ëÇØ»ó ¾î¸°ÀÌº¸Çè  ==> 429,231¿ø ¹ÞÀ½
- Ã¼´ç±Ý(2014.04, (ÁÖ)Á¦ÀÌÆ®¸®, ÃÖÁ¤ÈÆ »çÀå): ¼ö¼ö·á(27¸¸¿ø Á¦¿Ü)
1. 2,730,000¿ø ¹ÞÀ½
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.24(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 19:10 ==> ºñ ¸¹ÀÌ ¿È

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- °øÅëÄÚµå°ü¸®(COM_CD_MGMT.xfdl) °³¹ß
1. °øÅëÄÚµå ¸¶½ºÅÍ ==> Á¶È¸, ¼öÁ¤, »èÁ¦ Ã³¸®  ==> ¿Ï·á @@@ 
2. °ø°øÅë»ó¼¼ÄÚµå ==> Á¶È¸, ¼öÁ¤, »èÁ¦ Ã³¸®   ==> ¼öÁ¤, »èÁ¦ Ã³¸® ¾È ÇÔ @@@ 
==============================================================================================================

- sqlMap Ã£±â ¿¡·¯
1. Çö»ó: com.ibatis.sqlmap.client.SqlMapException: There is no statement named comCdMgmtDAO.selectComCdMstrList in this SqlMap.
2. ¿øÀÎ: /context-sqlMap.xml ÆÄÀÏ¿¡¼­ ¼³Á¤ SqlMap ÇØµÒ
C:\HS_ERP\workspace\handsome\src\main\webapp\WEB-INF\config\spring\context-sqlMap.xml
<bean id="sqlMapClient" class="hse.framework.ibatis.RefreshableSqlMapClientFactoryBean">
<property name="configLocation" value="classpath:/sqlmap/sql-map-config.xml"/>
<property name="dataSource" ref="dataSource"/>
<property name="mappingLocations" value="classpath:/sqlmap/**/*.xml" />
<property name="checkInterval" value="1000" /> 
</bean> 
==============================================================================================================

- sqlmap ¼³Á¤(/context-sqlMap.xmlÆÄÀÏ¿¡¼­ ¼³Á¤)
<bean id="sqlMapClient" class="org.springframework.orm.ibatis.SqlMapClientFactoryBean">
<property name="configLocation" value="classpath:/sqlmap/sql-map-config.xml"/>
<property name="dataSource" ref="dataSource"/>
</bean>

- /sql-map-config.xml ÆÄÀÏ¿¡¼­ ¼³Á¤
 <sqlMapConfig> 
    <sqlMap resource="sqlmap/cm/ComCdMgmtDAO_SQL.xml"/>
    <sqlMap resource="sqlmap/sample/SampleDAO_SQL.xml"/>
</sqlMapConfig>
-----------------------------------------------------------------------------------------------------

- sqlmap ÀÚµ¿ ¸®·Îµù(iBATIS 2.3.0 ¶Ç´Â 2.3.2 ÀÌ»ó)(/context-sqlMap.xmlÆÄÀÏ¿¡¼­ ¼³Á¤)
<bean id="sqlMapClient" class="hse.framework.ibatis.RefreshableSqlMapClientFactoryBean">
<property name="configLocation" value="classpath:/sqlmap/sql-map-config.xml"/>
<property name="dataSource" ref="dataSource"/>
<property name="mappingLocations" value="classpath:/sqlmap/**/*.xml" />
<property name="checkInterval" value="1000" /> 
</bean>

- /sql-map-config.xml ÆÄÀÏ¿¡¼­ ¼³Á¤ ¾ÈÇÔ
 <sqlMapConfig> 
     <sqlMap resource="sqlmap/sample/DummyDAO_SQL.xml"/>
</sqlMapConfig>
==============================================================================================================

- iBatis ÀÚÁÖ ¾²´Â ÅÂ±×µé(sqlMap, DB)
1] Alias
 <typeAlias alias="asName" type="package.SampleClassName"/>

2] ±âº» ÅÂ±×
Select : <select id="test" parameterClass="package.ClassName" resultClass="package.ClassName">
 Insert : <insert id="test"  parameterClass="package.ClassName" >
 Update : <update id="test"  parameterClass="package.ClassName" >
 Delete : <delete  id="test"  parameterClass="package.ClassName" >
 Statement : <statement  id="test"  parameterClass="package.ClassName" >

3] ÇÁ·ÎÆÛÆ¼ Á¸Àç¿©ºÎ
 Á¸ÀçÇÒ¶§ : <isPropertyAvailable property="a"></isPropertyAvailable>
Á¸ÀçÇÏÁö ¾ÊÀ»¶§  : <isNotPropertyAvailable property="a"></isNotPropertyAvailable>

4] ÇÁ·ÎÆÛÆ¼ Null Ã¼Å©
Null ÀÏ¶§: <isNull property="a"></isNull>
 NullÀÌ ¾Æ´Ò¶§: <isNotNull property="a"></isNotNull>

5] ÇÁ·ÎÆÛÆ¼ Empty Ã¼Å©
EmptyÀÏ¶§ : <isEmpty property="a"></isEmpty>
 Empty¾Æ´Ò¶§ : <isNotEmpty property="a"></isNotEmpty>

6] ÇÁ·ÎÆÛÆ¼ °ª ºñ±³
 °°À» ¶§ : <isEqual property="a" compareValue="K"></isEqual>
°°Áö ¾ÊÀ»¶§ : <isNotEqual property="a" compareValue="K"></isNotEqual>

7] ParameerMap
 <parameterMap id="paramMap" class="package.ClassName">
     <parameter property="id"/>
     <parameter property="name" javaType="java.lang.String" jdbcType="VARCHAR" mode="IN"/>
     <parameter property="msg" javaType="java.lang.String" jdbcType="VARCHAR" mode="OUT"/>
 </parameterMap>

8] ResultMap
 <resultMap id="reMap" class="package.ClassName">
     <result property="id" column="test_id"/>
 </resultMap>

9] Dynamic
 <select>
 select a from test
 <dynamic prepend="where">
     <isNotNull property="a"> id = #a# </isNotNull>
     <isNotNull property="b" prepend="AND"> name = #b#</isNotNull>
     <isNotNull property="c" prepend="AND"> open="(" close=")">
         <isNotNull property="c"> no = #c# </isNotNull>
         <isNotNull property="c" prepend="OR"> no_as = #d# </isNotNull>

    </isNotNull>
 </dynamic>
 </select>
==============================================================================================================

- ÇÏ´Ü ²ø¾î ´ç±â±â ¹Ù º¸ÀÌ±â
 resizable="false"  ==> Ãß°¡
<ChildFrame id="cf_workMain" visible="true" formurl="FRAME::MAIN.xfdl" openstatus="maximize" showtitlebar="false" resizable="false"/>
==============================================================================================================

- LTE ¾È½É¿É¼Ç Àç°¡ÀÔ
1. ÇÑ ´Þ ¾àÁ¤ µ¥ÀÌÅ¸(1.2G) ¸ðµÎ »ç¿ë½Ã 3G·Î µ¥ÀÌÅ¸ ¹«Á¦ÇÑ Á¦°ø, ¿ä±Ý: ÇÑ ´Þ 5,500¿ø
http://www.tworld.co.kr/normal.do?serviceId=S_PROD2001&viewId=V_PROD2001&prod_id=NA00003362&save_flag=save_A
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.25(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ºñ ¿È
 
- ÁÖ¸» 
05:00 ±â»ó
05:10 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷
07:30 Á¾·á
08:00 TV ½ÃÃ»
10:00 ÁýÃâ¹ß
10:20 Áø·á(¸í¼Ò¾Æ°úÀÇ¿ø): ¼öÁ¾ Æó·Å ÃÊ±â Áõ¼¼
10:30 Á¶Á¦(ÇÑµ¶ÇÁ¶óÀÚ¾à±¹)
10:40 ³²±¸·Î½ÃÀå(»§: 6Ãµ¿ø ¾îÄ¡, ¿Àµ­(¹åÀÖÀ½, ¶±»È±â(¸ÀÀÌ ¾øÀ½)[Åä¸¶Åä ºÐ½ÄÁý])
11:10 ±Í°¡
12:00 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷
15:00 Á¾·á
20:00 ¼®½Ä(¶ó¸é)
23:00 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷
02:00 Á¾·á
02:10 ÃëÄ§
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.26(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ºñ ¿È, Ãà±¸ ¸ø°¨
 
- ÁÖ¸»2 
06:00 ±â»ó(ºñ ¿Í¼­ ´Ù½Ã Àá)
09:00 ±â»ó
11:30 Áß½Ä(¶ó¸é)
14:00 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷ 
16:30 Á¾·á
16:30 ÁýÃâ¹ß
18:40 ¾¾Çªµå Æþµà(¿À) M(40% DC): µµ¹Ì³ëÇÇÀÚ(´ë¸²Á¡À¸·Î °¡Áö·¯ °¨)
19:00 ´ë¸²¿ª(µµ¸²Ãµ) -> ¾È¾çÃµ À¯¿øÁö
19:20 ÇÇÀÚ ¸ÔÀ½(¼öÁ¾, ·ç¿º)
20:20 Á¾·á
21:10 ¼®½Ä(¶ó¸é)
23:00 ÇÑ¼¶ ERP Àç±¸Ãà Prj °³¹ß ÀÛ¾÷
01:20 Á¾·á
==============================================================================================================

- ÇØ¸Ô(º£Æ®³² ¾ß¿Ü Ä§´ë) ±¸ÀÔ
1. 2015½ÃÁð ½ºÅÄµåÇØ¸Ô, Ä·ÇÎ½ºÅä¸®, °¡°Ý: 43,790¿ø
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1052438369&xfrom=&xzone= 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.27(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:20 ~ 19:10 ==> µ¿ÆÇ ¸¸³²(Ä¿ÇÇ ¾ò¾î ¸ÔÀ½), Ã¶¾ß(20½Ã ~ 05½Ã, Áý¿¡¼­): ÇÑ¼¶ ERP Àç±¸Ãà Prj È­¸é µðÀÚÀÎ ÀÔÈ÷±â

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- ¿ÞÂÊ È­¸é div(LEFT_divLeftMenu.xfdl) ¼³Á¤ ¼öÁ¤
==============================================================================================================

- expr »ç¿ë @@@
1. expr ÀÏ¹Ý »ç¿ë
expr="expr:META_NM_8==nullMETA_NM_8==''?'':META_NM_8"

2. expr¸¦ »ç¿ëÇÑ  fn_code() ÇÔ¼ö Ã³¸® 
 1) expr:fn_code(comDtlCd, 1) 
function fn_code(comDtlCd, strNo)
{ 
	var strcomDtlCdNew = ""  
	var strcomDtlCdNo = 0;
	trace("[/CoaComDtlCdReg.xfdl][fn_code()_01_1]==> [comDtlCd]"+ comDtlCd +"[strNo]"+ strNo );
	 
	if(strNo == "1")
	{ 
		if(comDtlCd != ""
		) { 
		strcomDtlCdNo =  strcomDtlCdNo + 1;
		}
	}
	trace("[/CoaComDtlCdReg.xfdl][fn_code()_01_1]==> [strcomDtlCdNo]"+ strcomDtlCdNo );

	return strcomDtlCdNo;
}
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.28(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:50 ~ 19:10 ==> ¼öÁ¾ ¾î¸°ÀÌÁý¿¡¼­ ¶Ç ¹°·È´Ù°í ÀüÈ­ ¿È(3¹øÂ°)

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- ¼Ò½º Ç¥ÁØÈ­ 
1. Grid Ã³¸® ¸Þ´º ==> ¿¢¼¿ ÀúÀå(»ùÇÃ), ¿¢¼¿ ÀúÀå, ¸ÖÆ¼Á¤·Ä, ¸ÖÆ¼ÇÊÅÍ, Ä®·³¼±ÅÃ, Æ²°íÁ¤
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.29(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:40 ~ 19:10 ==> 

- ÇÑ¼¶ ERP Àç±¸Ãà Prj[¡Ú] 
- ¼Ò½º Ç¥ÁØÈ­
- ¿ÞÂÊ È­¸é div(LEFT_divLeftMenu.xfdl) ¼³Á¤ ¼öÁ¤
==============================================================================================================

- ÀÌ¹øÁÖ ÀÌ½´ »çÇ×
1. ¸ÞÀÎ ÇÁ·¹ÀÓÀÌ °¡·Î ±æÀÌ º¯°æ  ==> º¯°æ ¿Ï·á @@@
==> 1200 --> 1280
 1) Æû: 1150 --> 1230  
 2) Div, Grid: 1140 --> 1220
2. adv_hfs_main(ÇÁ·¹ÀÓ)  º¯°æ  ==> Ã³¸® Áß @@@
==> 1. ±âÁ¸: 123,*(2´Ü)
==> 2. º¯°æ: 123,*,24(3´Ü)
==============================================================================================================
 
- mybatis
1. ½ºÇÁ¸µ°ú ¸¶ÀÌ¹ÙÆ¼½º - 02. ±âº»Æí ==> http://blog.naver.com/protosi/220151051062
2.  MyBatis °³¿ä ==> http://aid.altibase.com/pages/viewpage.action?pageId=7341605 
==============================================================================================================

- Beyond Compare[ºñ±³] ÇÁ·Î±×·¥ upgrade ´Ù¿î·Îµå
http://www.scootersoftware.com/download.php 
==============================================================================================================
 
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.30(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ÈÞ°¡1(ÇÑ¼¶ ERP ±¸Ãà Prj) 
 
- ÁÖ¸» 
08:00 ±â»ó
08:10 Á¶½Ä(»§)
09:00 ÁýÃâ¹ß(ÀåÀÎ, Àå¸ð, ·ç¿º, ¼öÁ¾)
09:10 ¼öÁ¾ ¾î¸°ÀÌÁý µ¥·Á´Ù ÁÜ
09:20 ¿µµîÆ÷±¸Ã»(ÀåÀÎ, Àå¸ð Ã¼·ùÁö º¯°æ): ¹«·á ==> Àü¼¼ °è¾à¼­ °¡Áö°í °¨
09:30 ¿µµîÆ÷±¸Ã»¿ª -> ½Åµµ¸²¿ª -> ¾çÃµ±¸Ã»¿ª
10:10 ÅÃ½Ã(¾çÃµ±¸Ã»¿ª -> ÃâÀÔ±¹°ü¸®»ç¹«¼Ò, 3Ãµ¿ø)
10:20 ÃâÀÔ±¹°ü¸®»ç¹«¼Ò(3Ãþ, ¿µµîÆ÷±¸Ã» °üÇÒÀº ¼­¿ï³²ºÎ¶ó°í ÇÔ)
	==> ÀåÀÎ, Àå¸ð Ã¼·ù ¿¬Àå ½ÅÃ» ¼­·ù Á¦Ãâ(¼öÀÔÀÎÁö ±¸ÀÔ(2Ãþ), »çÀ¯¼­(1®)¸¦ ½á ¿À¶ó°í ÇÔ)
	==> ¼öÀÔÀÎÁö(12¸¸¿ø, Ã³°¡¿¡¼­ ÁöºÒÇÔ), »çÀ¯¼­ ÀÛ¼º
	==> ·ç¿ºÀÌ 2¿ù, Àå¸ð°¡ ÀÛ³â 11¿ù¿¡ º£Æ®³² ¹æ¹®ÇÑ °Í¿¡ ´ëÇØ ¹®Á¦ Á¦±â --> ÀåÀÎÀº ¾îµð¿¡ ÀÖ¾ú´ÂÁö
	      ºÒ¹ý Ãë¾÷À» ÇÏÁö ¾Ê¾Ò´ÂÁö¸¦ µûÁ® ¹°À½(ÀåÀÎ, Àå¸ð ºÒ¹ý Ãë¾÷ ±ÝÁö ¼­¾à¼­ ÀÛ¼º)
11:00 Á¾·á
11:10 ÅÃ½Ã(ÃâÀÔ±¹°ü¸®»ç¹«¼Ò -> ±¸·Î±¸Ã»¿ª, 6,700¿ø)
11:30 ¼­¿ï³»°úÀÇ¿ø(Á¾ÇÕ°ËÁø ¹®ÀÇ --> ´ÙÀ½ÁÖ È­¿äÀÏ¿¡ µÈ´Ù°í ÇÔ: ¿¹¾à ¾È ÇÔ)
12:00 Áß½Ä(¼øµÎºÎ2, ±¹¹ä, ³Ã¸é): ¼Ò¹®³­»ï°ã»ì
13:00 ±Í°¡
13:50 ³·Àá
16:00 ±â»ó
16:30 ¾î¸°ÀÌÁý(¼öÁ¾ µ¥¸®°í ¿È)
17:00 ±Í°¡
20:00 ¼®½Ä
02:10 ÃëÄ§
==============================================================================================================

- º£Æ®³² ÀåÀÎ, Àå¸ð Ã¼·ù ¿¬Àå(Ãß°¡ ¿¬Àå) ½ÅÃ» ¼­·ù
1. »çÀ§(È¥ÀÎ°ü°èÁõ¸í¼­/°¡Á·°ü°èÁõ¸í¼­/ÁÖ¹Îµî·Ïµîº», »çÀ¯¼­ °¢ 1Åë) 
2. ÀåÀÎ, Àå¸ð(¿Ü±¹ÀÎµî·ÏÁõ/¿©±Ç)
3. ½Å¿øº¸Áõ¼­, ÅëÇÕ½ÅÃ»¼­(ÃâÀÔ±¹»ç¹«¼Ò ºñÄ¡)
4. ¼öÀÔÀÎÁö(Ã¼·ù±â°£ ¿¬Àå): 6¸¸¿ø(ÀÎ´ç) 
  ==> È¥ÀÎ°ü°èÁõ¸í¼­/°¡Á·°ü°èÁõ¸í¼­/ÁÖ¹Îµî·Ïµîº», ½Å¿øº¸Áõ¼­, ÅëÇÕ½ÅÃ»¼­ Áý¿¡¼­ Ãâ·ÂÇØ¼­ °¨
  ==> »çÀ¯¼­(°¢ 1Åë)´Â ÃâÀÔ±¹»ç¹«¼Ò¿¡¼­ ÀÚÇÊ·Î ÀÛ¼º
==============================================================================================================
 
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2015.07.31(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 20:40 ==> ÈÞ°¡2(ÇÑ¼¶ ERP ±¸Ãà Prj) 
 
- ÁÖ¸» 
08:00 ±â»ó
08:10 Á¶½Ä(¶ó¸é)
09:00 ÁýÃâ¹ß(ÀåÀÎ, Àå¸ð, ·ç¿º, ¼öÁ¾)
09:20 ¼öÁ¾ ¾î¸°ÀÌÁý µ¥·Á´Ù ÁÜ
09:30 Áø·á(¸íÁö¼º¸ðº´¿ø Á¤Çü¿Ü°ú, X-ray, Çã¸®): ÀåÀÎ
==> ÀÇ»ç°¡ ´Ù¸®°¡ ¾ÆÇÁ´Ù°í ÇÏÁö¸¸ Ã´Ãß(Çã¸®)¿¡ ¹®Á¦°¡ ÀÖ¾î¼­ ´Ù¸®°¡ ¾ÆÇÁ´Ù°í ÃßÁ¤ÇÔ
10:00 ¹°¸®Ä¡·á(Çã¸®): ÀåÀÎ
11:00 Á¶Á¦(Çã¸®, Çö´ë¾à±¹): ÀåÀÎ
12:10 ±Í°¡
12:20 Áß½Ä
15:30 ±¹¹ÎÀºÇà(·ç¿º »ýÈ°ºñ ÅëÀå °øÀÎÀÎÁõ¼­ ¹ß±Þ)
16:30 ¾î¸°ÀÌÁý(¼öÁ¾ µ¥¸®°í ¿È) 
17:00 ±Í°¡
20:00 ¼®½Ä
02:10 ÃëÄ§
==============================================================================================================

- Ç÷¾Ð Ã¼Å©(¸íÁö¼º¸ðº´¿ø)
1. ÃÖ°í Ç÷¾Ð: 140mmHg(¾à°£ ³ôÀº Æí)
2. ÃÖÀú Ç÷¾Ð: 94mmHg
3. ¸Æ¹Ú¼ö: 96bpm
==============================================================================================================
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+--------------------------------------------------------// End //--------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
