 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2015.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2015.04.01(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==> 수종 어린이집 친구 선물 포장지 구입(다이소)

- AIG손해보험 개발
1. Frame 수정(Left 메뉴)
==============================================================================================================

- 왼쪽 메뉴 바에서 Main 프레임 셋 생성
- frmLeft 메뉴 더블 클릭시 ===> 파일 첨부한 내용
function Grid00_oncelldblclick(obj:Grid, e:GridClickEventInfo)
{
	var strUrl   = gds_menu.getColumn(e.row,"form_url");
	var strTitle = gds_menu.getColumn(e.row,"menu_nm");

	if (strUrl.length > 0) gfn_OpenForm(strUrl,strTitle); 

}
------------------------------------------------------------------------------

- gfn_OpenForm 함수
function gfn_OpenForm(strUrl,strTitle)
{
	var objFrameSet = application.mainframe.VFrameSet0.HFrameSet0.FrameSet0;

	var objChildFrame = new ChildFrame("tmp_chf",10,10,810,610);
	objChildFrame.formurl = strUrl;
	objChildFrame.titletext = strTitle;

	var strChildID = "chf_"+objFrameSet.frames.length;

	objFrameSet.addChild(strChildID, objChildFrame);

	objChildFrame.show();
}
==============================================================================================================
 
- 동적 Component 생성
1.  /lib_XForm.xjs 파일에서
//********************************************************************
//동적으로 지정한 Component를 생성할때 사용되는 Form API 
//********************************************************************
function create(strCompID, strCompName, strAttrib, strPersistData, objContainer)
{    
	var xml = '<ObjectTemplate id="template" objecttype="' + strCompID + '" ' + nvl(strAttrib, "") + '/>';
	trace("[/lib_XForm.xjs] [create()] ==> [xml]"+ xml);

	var objTemplate = new ObjectTemplate(xml);
	if(isNull(objContainer)) objContainer = this;
	//trace("[/lib_XForm.xjs] [create()] ==> [isNull(objContainer)]"+ isNull(objContainer) ); 
	trace("[/lib_XForm.xjs] [create()] ==> [objContainer]"+ objContainer +"[strCompName]"+ strCompName ); 

	var idx = objTemplate.createAndAddTo(objContainer, strCompName);
	trace("[/lib_XForm.xjs] [create()] ==> [idx]"+ idx );

	if(idx == -1) return false;
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.02(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>  

- AIG손해보험 개발
1. 공통 부분 소스 커밋(공통 주의 사항 공지)
==============================================================================================================

- 베트남 송금[2015.04.02(목)]
1. 작은 처남이 일본으로 산업 연수생으로 일하러 간다고 함
 1) 장인이 허우 아빠에게 300만원 빌림
2. 베트남 큰 처남 통장에 송금
3. 외국환 계산서[REF-NO: DT275R071276]
 1) 송금 금액: 5,000 달러 
 2) 원화 환산 입금액: 5,517,500원
 3) 송금 수수료: 만 2천원(6천 달러 미만)
 4) 전신료: 12,000원 
 5) 혜은(국외) 수수료: 18달러([1,106.40원 환율] 19,915원)
 6) 총 수수료: 39,915원
 7) 총 송금 금액: 5,557,415원(5천 달러) 
4. 베트남 타발 수수료: 알 수 없음(5원 정도 들었다고 함)
5. 실시간 송금서비스 
http://m.news.naver.com/read.nhn?mode=LSD&mid=sec&sid1=101&oid=421&aid=0001165780
-------------------------------------------------------

1. 수취인 거래 은행[전신송금(T/T)]
1) 수취인 은행명: IVIETNAM INTERNATIONAL COMMERCIAL JO
2) 수취인 지점명: INT STOCK BANK(VIB)
3) 수취인 계좌번호: 0684006004382
2. 수취인
 1) 성명: DINH KHAC MANH(큰 처남)
 2) 전화: 8401699477751
 3) 주소: HAIPONG VIETNAM(하이퐁)
=========================================================================================================

- 송금 수수료
2천 달러 미만: 7천 원
4천 달러 미만: 만 원
6천 달러 미만: 만 2원
8천 달러 미만: 만 5원
만 달러 미만: 만 8원
==============================================================================================================

- 핸드폰 충전
1. 장인, 장모 3만원씩 총 6만원 송금
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.03(금) 작업 ■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00 ==> 방규식 차장, 김유진 과장 철수(18시 ~ 23시: 맥주[방 차장이 쏨])

- AIG손해보험 개발
1. 공통 부분 소스 커밋(공통 주의 사항 공지)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.04(토) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 

- 주말
08:30 기상
09:40 집출발 
10:00 진료(수종 감기, 명소아과의원)
10:30 진료(루옌 감기, 김성목내과의원)
10:50 진료(루옌 눈, 삼성 밝은 안과의원) 
11:20 쇼핑(과일, 남구로시장)
12:10 귀가
12:30 중식 
13:30 낮잠
15:50 가계부 월말 결산
16:30 주간 보고서 작성
17:30 인터넷 쇼핑(아이패드 케이스, 아이패드 케이스 구입)
19:00 석식
21:30 장인 어른 방문
00:00 취침
==============================================================================================================

- 문의(투비소프트)
1. AxMSIE.Document
2. 파일 동적 생성
==============================================================================================================

- 배경색(이클립스에서) ==> Color Picker
1. 연녹색 ==> 색상(E): 76, 채도(S): 78, 명도(L): 194
2. 하늘색 ==> 색상(E): 130, 채도(S): 180, 명도(L): 225
3. 연주황색 ==> 색상(E): 26, 채도(S): 146, 명도(L): 214 
--------------------------------------------------------------------------------

- Color Picker 설치(RGB색 설정)
1. Screen Color Picker v1.5 설치
 1) 엔터로 모든 것을 처리
==============================================================================================================

- 장모님 금산행예매
1. 2015.04.04(일) 13:30 서울 -> 금산, 일반, 삼화고속(일반) 13번: 11,700원 
==============================================================================================================

- 2015년 5월 포항행 예매
1.2015.05.01(금) 13:00 ~ 15:35, 서울 -> 포항, KTX 산천 807(17호차 5A, 5B), 52,600원(루옌 포함: 105,200원)
2. 2015.05.03(일) 17:00 ~ 19:36, 포항 -> 서울, KTX 산천 812(8호차 11A, 11B), 50,000원(루옌 포함: 100,000원) 
==============================================================================================================

- 키스킨 구입
[실리스킨]MSI GT683DX i7 Imperial 전용 키스킨 키덮개, 가격: 8,000원
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=016001&sc.prdNo=3014558485

MSI GE60-2OE-003US 전용 노트 북키스킨, 가격: 8,000원  ==> 검토 중
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A926809509&frm3=V2
==============================================================================================================

- 아이핀 변경(i-pin)[2015.04.04(토)]
1. 발급기관: 한국신용평가정보(https://ipin.siren24.com/i-PIN/jsp/ipin2_j21.jsp) 
2. tamario/hp태*1*!*
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.04.05(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

▦ 조기축구
06:30 기상
06:50 지하철(대림역 <-> 신사역)
07:50 신구초등학교 
08:30 게임
09:00 월례회의(구창원 회장님 한식이라 산소 갔다고 함)
09:10 게임
10:10 숏게임(마지막 골 넣음)
11:15 종료 
11:40 중식(불고기: 뚝심한우[맛있음]): 부회장단에서 쏨
12:00 종료 
12:30 고속버스터미널
13:00 루옌, 장모님 만남
13:30 장모님 배웅(금산으로 출발)
13:50 중식(비빕밥: 루옌)
15:00 귀가
15:30 낮잠
17:30 기상
19:00 석식
21:00 포항집 전화(5월 1일 포항 간다고 함)
23:00 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2015.04.06(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> TM팀으로 자리 이동

- AIG손해보험 개발
1. TM팀 Frame 수정
2. WAS 셋팅이 안되고 에러가 나서 TM팀 차장에게 짜증을 냄
==============================================================================================================
 
- 루옌 사회통합 프로그램 신청 ==> 완료
http://www.socinet.go.kr/soci/comm/board/BoardList.jsp?q_global_menu_id=S_AN_BOARD 
- 사회통합프로그램 사전평가 
1. 평가일자 : 2015.05.09 13시 (12시30분까지 입실완료) 
2. 평가장소 : 미정  
3. 평가점수/결과 :  
==============================================================================================================

- 기저귀 구입  ==> 완료 
1. 하기스 보송보송 팬티 5단계(31px4팩), 가격: 79,800원(개당 363원): G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=667263010
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.07(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> PM 회의(컨버터, 퍼블러셔가 일 제대로 안했다고 함 ==> 사장님께 보고)

- AIG손해보험 개발
1. Frame 수정
==============================================================================================================
 
- 튜브 스타킹 구입  ==> 완료 
1. 키카 양말 튜브, 가격: 3,640원: G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=575913776
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.08(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>  

- AIG손해보험 개발
1. TM Frame 수정
==============================================================================================================

- 키스킨 구입
1. [실리스킨] MSI GT683DX i7 Imperial 전용 키스킨 키덮개, 가격: 8,000원 ==> 구입
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=016001&sc.prdNo=3014558485

2. [실리스킨] MSI GE60-2OE-003US 전용 노트북 키스킨, 가격: 8,000원  ==> 구입
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A926809509&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.09(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>  

- AIG손해보험 개발
1. TM Frame 수정(완료, TM팀에 배포함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.10(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- 손석호 차장(010-8719-0435, shson@gidata.co.kr) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.11(토) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 

- 주말
09:30 기상
10:00 노트북(AIG 업무)
12:10 낮잠
16:00 기상 
16:30 집출발(자전거)
17:00 도림천(대림역, 루옌, 수종 자전거에 태움)  ==> 도림천 => 신도림역 => 안양천=> 안양천 합수부(한강)
       --> 벚꽃, 개나리가 활짝 핌
19:00 석식(동태탕)
19:50 귀가
00:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.04.12(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

▦ 조기축구
06:10 기상
06:30 버스(6411번, 대림역 -> 한티역)
07:30 도곡 초등학교(도곡 조기회): 신구초교 운동장 발암 물질 나와서  사용 금지(7월달까지 예상) 
08:00 숏게임(맨땅, 야구장)
08:30 게임(3게임 함) 
10:30 종료(야구부 때문에 일찍 마침) 
11:30 중식(부대찌게, 철판 쭈꾸미: 놀부부대찌게[압구정점]): 2만원 냄
14:00 귀가
14:30 낮잠
16:30 기상
16:40 집출발
16:50 장보기(남구로시장, 과일)
18:00 귀가
19:00 석식 
23:00 취침
==============================================================================================================

- 도곡 원정(8시) 
1. 대림역(7호선, 5-2) -> 선릉역(분당선, 4-3) -> 한티역(2번 출구) -> 도곡초교(50분, 18,2km, 12,500원) 
2. 대림역(19-264, 6411번, 12번 출구) -> 한티역(29-30) -> 도곡초교(1시간 30분, 18,2km, 10,500원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.13(월) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 19:00 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- XPLATFORM_Server_License 만료 에러
1. 현상
Invalid license: jarResource=file:/C:/eduPrj/mid/apache-tomcat-7.0.53/wtpwebapps/eduPrj/WEB-INF/lib/XPLATFORM_Server_License.xml
com.tobesoft.xplatform.license.InvalidLicenseException: License has expired: expireDate=2015-04-01, currentDate=2015-04-13
2. 조치: 날짜를 2015-02-14로 변경
==============================================================================================================

- USB 구입
1. Sandisk정품 Ultra Fit USB 3.0 64GB /130MB/s /CZ43, 가격: 32,340원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1154962301&xzone=order^list&xfrom=order^list
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.14(화) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 18:20 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- AIG손해보험 CS 노트북 개발
1. 웹서버 셋팅
 1) http://127.0.0.1:8080/JSP_AIG_CS/login.jsp 
==============================================================================================================

- XPLATFORM License 적용  
1. A. Server License 제공 되는 XPLATFORM_Server_License파일(XPLATFORM_Server_License.xml)을 WAS
서버에 올리시면 됩니다.(일반적으로 Web Application의 /WEB-INF/classes 폴더에 위치시키면 됩니다.)
 1) C:\eduPrj\work\eduPrj\Web\WEB-INF\lib\XPLATFORM_Server_License.xml
==============================================================================================================

- DB연결이 안되고 있음
1. 현상: No suitable driver found for jdbc:oracle:thin:@127.0.0.1:1521:TamaDB
2. 조치: Download the Oracle jdbc library.  add it to the classpath when running your program. 
D:\app\TAMA\product\11.2.0\dbhome_1\jdbc\lib 폴더의 ojdbc5.jar, ojdbc6.jar 파일을 복사해서
C:\Program Files\Java\jdk1.6.0_45\lib 폴더와 C:\Program Files\Java\jdk1.6.0_45\lib폴더에 붙여넣기
C:\eduPrj\mid\jdk1.6.0_30\lib, C:\eduPrj\mid\apache-tomcat-7.0.53\lib
3. 원인: 1. 드라이버 로딩이라는 라인이 없었음
// 1. 드라이버 로딩 
Class.forName("oracle.jdbc.driver.OracleDriver"); 
==============================================================================================================
 
- Eclipse / JSP / tomcat 7.0 ( 404 not found ) 가 생기는 주요 원인  
1. 파일명을 확인, 앞에 스페이스가 들어 있는지 확인 ==>  현상: HTTP Status 404
==============================================================================================================

- 긴급 이슈 메일 보내기
1. 긴급 이슈 발생(왼쪽 메뉴 바 문의 ==> 예스 강부장에게 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.15(수) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 18:20 ==> 수종 어린이집에서 친구에게 물려서 상처나서 옴

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- AIG손해보험 CS 노트북 개발
1. 웹서버 셋팅
 1) http://127.0.0.1:8080/JSP_AIG_CS/login.jsp 
==============================================================================================================

- eclipse 에러 로그가 뜸(로그인(http://127.0.0.1:8080/JSP_AIG_CS/login.jsp) 실행)
[/JSP_AIG_CS/login.jsp] [TEST_시작] ==> @@@
2015. 4. 15 오전 6:19:05 com.tobesoft.xplatform.license.A.E A
정보: Loaded license file in JAR dir: path=C:\eduPrj\work\.metadata\.plugins\org.eclipse.wst.server.core
\tmp1\wtpwebapps\eduPrj\WEB-INF\lib\XPLATFORM_Server_License.xml
==============================================================================================================

- /server.xml 파일에서
<!--// 01. HOST 설정 //-->   
<Host appBase="webapps" autoDeploy="true" name="localhost" unpackWARs="true">
<!-- <Context docBase="프로젝트 경로" path = "주소창에 보여질 이름"  reloadable="true" source="org.eclipse.jst.j2ee.server:프로젝명"/> -->
<Context docBase="eduPrj" path="/" reloadable="true" source="org.eclipse.jst.jee.server:eduPrj"/>
<!-- <Context docBase="eduPrj" path="/eduPrj" reloadable="true" source="org.eclipse.jst.jee.server:eduPrj"/>  // 초기 자동 설정 값 // -->
</Host>
1. http://127.0.0.1:8080/JSP_AIG_CS/login.jsp 실행
==============================================================================================================

- 판상 구입(다오씨 부탁)
1. 각시상 900중 교자상[노송가구], 48,550원 ==> 구입 완료(5만원 받음)
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=453849230
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.16(목) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:20 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- AIG손해보험 CS 노트북 개발
1. 로그인 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.17(금) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 18:20 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- AIG손해보험 CS 노트북 개발
1. 로그인 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.18(토) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 18:20 ==>  

- AIG손해보험 CS 노트북 개발
1. 메뉴 DB 수정
==============================================================================================================

- CS 화면 설정
01. start_dev.xadl
02. login.xfdl
03. COMCM1_M001.xfdl
04. COMCM1_M002.xfdl
05. COMCM1_M002_D01.xfdl
06. COMCM1_M002_D02.xfdl
07. COMCM1_M003.xfdl
==============================================================================================================

- 주말
00:00 밤샘(AIG손해보험 CS 노트북 개발)
09:00 취침
14:00 기상
15:00 중식 
16:00 집출발
16:40 이마트 구로점(수종 주차장 장남감 구입)
18:00 남구로시장(과일)
19:00 귀가
19:10 수종 주차장 장남감 조립(힘듬)
20:00 석식
22:00 AIG손해보험 CS 노트북 개발 
02:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2015.04.19(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 강북 원정

▦ 조기축구
06:00 기상
06:30 대림역
06:50 서울대입구역
07:00 태훈이형 차
07:30 신구초교
07:50 강북구민운동장
08:30 게임(오동 조기회)
10:30 게임(비옴(옷 젖음), 골키퍼 봄)
11:30 종료
12:30 중식(국밥, 뚝심한우): 조기회에서 쏨
13:00 종료
14:00 종료
14:30 낮잠
19:00 기상
19:00 석식 
02:00 취침
==============================================================================================================
- 쌀구입
1. 쌀집총각 2014년 대나무향미 20kg, 36,900원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A534194393&frm3=V2
--------------------------------------------------------------------------------------------------------

- 분유 구입
02. 분유 구입 ==> 완료
1) 남양유업 임페리얼 드림 XO World Class 4단계2캔+스틱40봉, 가격: 65,200원: 11번가 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1088855812&xfrom=&xzone=  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.20(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:20 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- TM 화면 설정
01. start_tprime.xprj
02. login.xfdl
03. top_frame.xfdl
04. left_frame.xfdl
05. menu.xfdl
06. bookmark.xfdl
07. bottom_frame.xfdl
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.21(화) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:20 ==>  

- AIG손해보험 개발
1. CS 수정
==============================================================================================================

- AIG손해보험 CS 노트북 개발
1. http://127.0.0.1:8080/JSP_AIG_TM/aig_tm.jsp
Variable id="DataURL_TM" initval="http://localhost:8089/"/>'
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.22(수) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:20 ==>  AIG손해보험 개발 Prj 철수(노트북 포맷 맡김), 김형태 차장이랑 싸움(산출물 요구)

- AIG손해보험 개발
1. CS 수정
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.23(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 본사 복귀

- Xplatform 개발
1. 로그인 개발
==============================================================================================================
 
- (주)지아이데이타 직원
1. 신용진 과장(010-2934-2502, yongjin.shin@gidata.co.kr): 4월 27일 파주 LG Display 투입
2. 최수호 과장(010-9109-2322, suho.choi@gidata.co.kr): 5월 6일 의왕 연구소 투입 예정
3. 김성욱 차장(010-3295-3840, sungwook.kim@gidata.co.kr): 나주 파견, Nexacro 공통
4. 김경태 과장(010-2380-4804, kkt@gidata.co.kr): 4월달 입사(옆자리), 5월 6일 삼성전기 투입 예정
5. 윤주호 대리(010-6546-0866): 대구 출신
==============================================================================================================

- 식대 출력 후 제출
1. 석식 식대 5장 김민주 대리에게 전달
==============================================================================================================

- SW 경력증명 확인  
 1) 사실상 폐업 각서 작성
 1. 고시 제8조제1항에 따른 근무사실 및 기간을 증명할 수 있는 서류 중 하나 
 ② 근로소득원천징수영수증 ==> 홈텍스(http://www.hometax.go.kr)출력할 것 ==> http://ihaebarag.tistory.com/36
==> 근로소득원천징수영수증은, 세무회계사무실도 근로소득지급명세신고를 해야 하므로, 올해 5월 이후에 
국세청홈택스를 통하여 발급 받을 수 있음
==============================================================================================================

- 지급명세서 조회서비스는 
홈택스(소득자 공인인증서로 로그인) → My NTS → 지급명세서 등 제출내역 코너에서 제공하고 있습니다. 
  
2015.4.15 현재,  
2013년 귀속 지급명세서만 조회가 가능하며,  
2014 년귀속 지급명세서는 2015년 5월부터 제공할 예정입니다.   
국세청에서 제공하는 서비스는 조회용으로만 사용이 가능하며,  
증명용으로 사용할 경우에는 원천징수의무자(급여를 제공하는 회사)에게 발급을 요청하시기 바랍니다. 
https://teer.hometax.go.kr/home.do?mode=getFaq_view&url=pub/getFaq_view&faqId=133667&loginId=&viewYn=Y
==============================================================================================================

- 휴폐업 조회
https://teht.hometax.go.kr/websquare/websquare.html?w2xPath=/ui/ab/a/a/UTEABAAA13.xml 
1. 조회/발급의 중앙에서 우측 아래쪽에 '사업자상태'에서 사업자등록번호 조회 또는 주민등록번호로 조회를 
클릭하면 조회가 가능하십니다.
 1) (주)제이트리크리에이티브(대표자:최정훈) 기업보고서 2014년(사업자 번호:  211-88-64029)
 --> 폐업자(과세유형: 부가가치세 일반과세자, 폐업일자:2014-12-05) 입니다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.24(금) 작업 ■■■■■■■■■■■■■■■
---> 06:50 ~ 19:00 ==> 15시에 AIG손해보험 개발 Prj 노트북 찾으러 감

- Xplatform 개발
1. 메뉴 DB 수정
==============================================================================================================

- 이미지 로드 실패
uxs (7068): Error: URL (file://F:/03. Program/51. XPlatform/42. AIG 데이타/54. AIG_TOBE_TM/main/0) 을 로딩
하는데 다음과같은 http 또는  socket 에러코드 -1로 실패하였습니다.
uxs (7068): Error: 부적합한 ResponseItem(id=file://F:/01. 조치: 3. Program/51. XPlatform/42. AIG 데이타/54. AIG_TOBE_TM/main/0,hr=ffffffff)
uxs (7068): Error: 이미지 정보 (0) 을 찾을 수 없습니다.
1. 원인:  GridTress > treeitemimage를 설정해 놓음(treeitemimage ==> bind:IMAGE_NUM)
2. 조치: GridTress > treeitemimage를 설정 제거 ==> Grid treeItem img 속성에 숫자가 들어가서 나오는 현상, 숫자 제거
---------------------------------------------------------------------------------------------------------

- 이미지 로드 실패2 
uxs (4832): Error: URL (file://F:/03. Program/51. XPlatform/42. AIG 데이타/54. AIG_TOBE_TM/images/left_bg.bmp) 을 
로딩하는데 다음과같은 http 또는  socket 에러코드 -1로 실패하였습니다.
uxs (4832): Error: 부적합한 ResponseItem(id=file://F:/03. Program/51. XPlatform/42. AIG 데이타/54. AIG_TOBE_TM/images/left_bg.bmp,hr=ffffffff)
uxs (4832): Error: 이미지 정보 (images::left_bg.bmp) 을 찾을 수 없습니다. 
1. 조치: 
/images폴더에서 leftBg.bmp를 left_bg.bmp로 변경
==============================================================================================================

- 이미지 로드 실패3
(6660): Warning: Theme 화일에서 (theme://titlebar_icon.png center middle)을 찾을 수 없습니다.
(6660): Error: 부적합한 ResponseItem(id=theme://titlebar_icon.png center middle,hr=ffffffff) 
1. 조치
/view.css 파일에서
/***** titlebarform start *****/
TitlebarForm
{
background: #343539 URL('theme://sta_TF_TitbarBG.png') stretch 500,26;
gradation: ;
border: 0 none #00000000;
bordertype: normal 0 0;
font : Malgun Gothic, 9, antialias ;
padding : 0 0 0 0 ;
align: left middle;
icon : URL('theme://titlebar_icon.png');/****  icon은 center middle 사용하지 말 것 ***/
/*****icon : URL('theme://titlebar_icon.png') center middle;  *****/
color : transparent ;
}  
==============================================================================================================

- Script 화면 글자 크기 조절(XPlatform에서)
1. Ctrl + 마우스 휠
==============================================================================================================

- ORA-28547 에러
1. 현상: ORA-28547: 서버에 대한 접속을 실패했습니다. Oracle Net 관리자 오류일 수 있습니다.
2. 원인: hostname 수정에 문제가 있었던 것으로 보임
3. 조치: listener.ora의 LISTENER의 HOST를 IP가 아닌 내 컴퓨터 이름으로 넣어야 함(
==> (HOST = localhost --> HOST = TAMA-PC로 변경)
/listener.ora 파일에서
LISTENER =
  (DESCRIPTION_LIST =
    (DESCRIPTION =
      (ADDRESS = (PROTOCOL = IPC)(KEY = EXTPROC1521))
      (ADDRESS = (PROTOCOL = TCP)(HOST = TAMA-PC)(PORT = 1521))
    )
  ) 
==============================================================================================================

- MSI 노트북(GE60_2O) 설치 방법
1. 장치관리자 드라이버 설치
 1) MSI GE60_2OE ==> http://www.msi.com/support/nb/GE60-2OE.html#down-driver&Win7 64
 2) 드라이버 설치 순서
==> 1. 칩셋, 2. 인텔 VGA, 3. 엔비디아 VGA, 4. 오디오, 5. LAN, 6 카드 리더 7. WLAN, 8. BT, 9. Touchpad, 10. ME,
11 USB 3.0, 12. Radio Switch, 13. Others 
==============================================================================================================

- MSI 노트북(GT683DX-i7 Imperial) 설치 방법
1. 장치관리자 드라이버 설치
 1)  GT683DX-i7 Imperial ==> http://www.msi.com/support/nb/GT683DXGT683DXR.html#down-driver&Win7 64
 2) 드라이버 설치 순서
==> 1. 칩셋, 2. 인텔 VGA, 3. 엔비디아 VGA, 4. 오디오, 5. LAN, 6 카드 리더 7. WLAN, 8. BT, 9. Touchpad, 10. ME,
11 USB 3.0, 12. Radio Switch, 13. Others 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2015.04.25(토) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 18:20 ==>  

- AIG손해보험 CS 노트북 개발
1. 메뉴 DB 수정
==============================================================================================================

- 주말 
05:20 기상
06:30 지하철(대림역 <-> 신사역)
06:50 신구초등학교(운동장 발암 물질 사건으로 다시 개방 첫날)
07:00 숏게임
08:50 종료
09:30 조식(닭곰탕): 영희형이 쏨
10:20 죵료
11:00 귀가
13:40 수종 돌봄(수종 많이 움, 루옌 친구들이랑 축제 감)
19:00 루옌 귀가(친구 2명이랑 같이옴)
20:00 석식
00:00 취침
==============================================================================================================
 
- 급여 통장 거래 내역 발송
1. 2014년 12월1일부터 현재일까지 ==> nsthinking@naver.com,  인터넷뱅킹
2. 권세원 노무사에게 메일로 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.26(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 여양 진씨 전국 청.장년연합체육대회(광희초교, 10시)

▦ 여양 진씨 전국 청.장년연합체육대회
06:00 기상
06:10 개인 업무용 노트북(MSI GT683DX-i7) 포맷 후 셋팅
07:00 AIG손해보험 CS 노트북 개발
08:00 루예, 수종 기상
08:30 조식(라면)
09:10 집출발
09:40 지하철(대림역 <-> 신당역)
10:30 광희초교(대규 안 옴)
11:00 여양 진씨 전국 청.장년연합체육대회 개막식
11:40 축구 게임(대구. 경북 청년회 0 (3 PK 1) 0 용인 청년회): 전후반 10분씩 
       ==> 게임 내용 용인 청년회가 우세했음(제대로 공격 한번 못 함)
       ==> PK 때 4번째 키커로 나와서 실축함
       ==> 계대 89선배 진승환형 만남(대구 진씨 종친회 회장 아들)
12:30 종료
12:30 중식(육계장)
13:00 축구 게임(대구. 경북 청년회 3:1 서울 청년회): 우승
13:30 종료
15:00 게임(원통 달리기, 줄넘기)
15:40 노래자랑
16:30 시상식(대구. 경북 청년회 우승[상금 30만원]) ==> 보물찾기 선물(루옌 후라이팬 받음), 수건 2장, 티 받음
16:40 폐막식 ==> 내년 4월에는 용인에서 계최, 대구청장년회장 진도근 형님에게 만원 받아서 옴
18:00 귀가
20:00 석식
23:00 취침
==============================================================================================================

- 여양 진씨 전국 청.장년연합체육대회(광희초교, 10시)
1. 일시: 2015년4월 26일(일요일) 10시 ~ 5시
2. 장소: 광희초교(서울 중구 신당동 254, 신당역 10번 출구)
3. 기타: 여양 진씨 서울청장년회장 진정호(010-6250-5388)
 1) 여양 진씨 대구청장년회장 진도근(010-7375-3539)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.27(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 3, 4월 급여 수령(7,349,240원, 착오가 있었다고 함): 계약서상의 월급여(3,923,100원)

- 개인 업무용 노트북(MSI GT683DX-i7) DB 설치
01. Oracle 11g R2 설치[2015.04.27_Tama].txt 작성
==============================================================================================================

- Xplatform 개발
1. 메뉴 DB 수정
 1)  menulist 조회(menulist Grid 더블 클릭시)  ==> 인식 안됨(error가 있으면 인식 못 할 수 있음)
==============================================================================================================

- (주)지아이데이타 첫 급여 수령
1. 계약서상의 월급여: 3,923,100원
2. 실제 지급된 월급여: 3,426,200원(지급액계: 3,923,100원, 공제액계: 496,900원) ==> 7,349,240원(3, 4월 합계)
3. 연금 보험은 연봉에 1/13(3,413,077원)해서 1년 후에 가입해준다고 함 
------------------------------------------------------------------------------------

- 2015년 4월분 급여 명세서
지급 내역 지급액공제 내역 공제액
기본급7,546,140 국민연금163,030 
상여0 건강보험109,980 
식대100,000 고용보험50,990 
차량유지비200,000 장기요양보험료7,200 
소득세150,640 
지방소득세15,060 

공제액계496,900 
지급액계7,846,140원 차인지급액  7,349,240원
--------------------------------------------------------- 

- 2015년 3월분 급여 명세서(원래 명세서)
지급 내역 지급액공제 내역 공제액
기본급3,623,100 국민연금163,030 
상여0 건강보험109,980 
식대100,000 고용보험50,990 
차량유지비200,000 장기요양보험료7,200 
소득세150,640 
지방소득세15,060 

공제액계496,900 
지급액계3,923,100원 차인지급액  3,426,200원
--------------------------------------------------------- 

- 2015년 4월분 급여 명세서(원래 명세서)
지급 내역 지급액공제 내역 공제액
기본급3,623,100 국민연금163,030 
상여0 건강보험109,980 
식대100,000 고용보험50,990 
차량유지비200,000 장기요양보험료7,200 
소득세150,640 
지방소득세15,060 

공제액계496,900 
지급액계3,923,100원 차인지급액  3,426,200원 
==============================================================================================================

- 밥솥 구입
[쿠첸] 2014년 4월출시 6인용 IH압력밥솥 CJH-VE0681ID(명품철정/블랙다이아몬드코팅/분리커버), 11번가, 가격: 162,000원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1031775389
==============================================================================================================

- 오렌지 구입
1. [A912893181] 썬키스트 블랙라벨 오렌지 5kg(중소과/26~29과내외), 가격: 12,900원
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=A912893181&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.28(화) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 19:00 ==> 

- Xplatform 개발
1. function newWindow() 함수 처리 정상인데도 MDIForms에서 창이 안 뜸
 1) 원인: objNewWin.init(strFormID, nvl(nLeft, 0), nvl(nTop, 0), nWidth, nHeight);
 2) 확인: 
-/left_frame.xfdl 파일에 폼 확인 버튼 추가하여 테스트
function formTest_onclick(obj:Button,  e:ClickEventInfo)
{ 
var mdiFrame = application.mainframe.VFrames.HFrames.MDIForms;
formTesttrace("[/left_frame.xfdl] [formTest_onclick()] ==> [TEST_01] [mdiFrame.all.length]"+ mdiFrame.all.length ); 
 
for(var i=0; i<mdiFrame.all.length; i++)
{
formTesttrace("[/left_frame.xfdl] [formTest_onclick()] ==> [i_번쨰] [mdiFrame.all[i].name]"+ mdiFrame.all[i].name 
+"[mdiFrame.all[i].position]"+ mdiFrame.all[i].position );   
}
}
 가. [i_번쨰] [mdiFrame.all[i].name]CRSC0101_M001[mdiFrame.all[i].position]absolute 0 0 0 0
  ==> 폼(CRSC0101_M001)은 존재하는데 position이 0이라서 안 보임
   3) 확인: position값 정상값으로 수정
==============================================================================================================

- 배경색이 겹쳐질때
1. Properites > Style > background: transparent ==> white로 변경
==============================================================================================================
 
- form 생성
 var formObj = application.mainframe.VFrames.HFrames.MDIForms.frames[formId];
==============================================================================================================
 
- 01. 정보[★]
99. 정보[★] ================== @@@==> C:\Users\TAMA\Desktop\01. 정보[★]  
--- 00. My_Resume [D]
--- 01. TAMA_Prject [D] 
--- 59. MtoXConverter [D]==> 옵션
--- 60. Convert 변환 결과[D]==> 옵션
--- 91. ADMIN(오라클 서버 LSN) [D]
--- 99. etc [C] ==> C:\Windows\System32\drivers\etc/hosts==> 옵션
==============================================================================================================

- SC은행 로그인 안됨(공인인증서 에러)
1.  에러 내용: 이 웹 사이트의 보안 인증서에 문제가 있습니다.
3. 원인: 내컴퓨터의 시간이 맞지 않아서 일어나는 현상
4. 조치: 내컴퓨터의 시간 변경
 1) 참조 ==> SC은행 콜센터: 1588-1599
=========================================================================================================
 
- 스마트폰(브리즈)인증서 복사(공인인증서)
1. 스마트폰 인증서 PC로 가져오기(공인인증서 가져오기)
https://open.standardchartered.co.kr/service/cert/CtBreezeExport03?menuid=OIB09010304000000&langCode=KR 
2. PC인증서 스마트폰 내보내기(공인인증서 내보내기)
https://open.standardchartered.co.kr/service/cert/CtBreezeExport02?menuid=OIB09010303000000&langCode=KR
==============================================================================================================

- 크롬(crome) 비번번호 변경(구글 메일)
1. 구글(크롬[crome])
https://www.google.com ==> taemario@gmail.com / hp수*1*1* 
==============================================================================================================
 
- Foxit Reader(PDF 뷰어)
http://www.foxitsoftware.com/kr/downloads/?action=download&product=Foxit-Reader&platform=Windows&version=7.0.8&package_type=exe&Language=Korean
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.29(수) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 19:00 ==> 

- Xplatform 개발
1. __trackPopupMenu__ 에러 처리
 1) 수정 전: iif(isNull(Find("__trackPopupMenu__")) == true) 
 2) 수정 후: if(!isValidObject("__trackPopupMenu__"))  // __trackPopupMenu__이 null 이면
==============================================================================================================

- 화면 목록에서 화면 삭제 후 화면 닫기 
function gfn_closeWindow(pgmId) 
{ 
	if(gds_screen.findRow("SCREEN_ID", pgmId) > -1) 
	{ 
		var row = gds_screen.findRow("SCREEN_ID", pgmId); 
		gds_screen.deleteRow(row);  
		var mdiFrame = application.mainframe.VFrames.HFrames.MDIForms;// Frame set
		 
		for(var i=0; i< mdiFrame.all.length; i++)
		{ 
			if(pgmId == mdiFrame.all[i].name)
			{ 
				trace("["+i+"_번째][/common.xjs] [gfn_closeWindow()] ==>  [pgmId]"+ pgmId+"[mdiFrame.all[i].name]"+ 
				mdiFrame.all[i].name+"[mdiFrame.all[i].position]"+ mdiFrame.all[i].position );  
				mdiFrame.all[i].form.close(); // form 창 닫기
			 }
		 } 
	}  
}
==============================================================================================================

// 메뉴 활성화 버튼 처리
function setViewMenuStatus(openFlag) 
{ 
	if(openFlag) 
	{
		trace("[/top_frame.xfdl] [setViewMenuStatus()] ==> [열기 처리] --> [btnMenuHidden.bmp]" );  
		btn_viewMenu.style.background.image = "URL('images::btnMenuHidden.bmp')";// TOP 메뉴 숨기기 이미지 Display
		 
		application.mainframe.VFrames.HFrames.separatesize = "180,*";     // lelft frame 재설정(왼족 프레임 생성[프레임 나누기])
		 
		gv_LeftFrame.form.btn_split.style.background.image = "URL('theme://IMG/btn_LF_menuClose.png')"; // Left 메뉴 닫기 이미지 Display
		gv_LeftFrame.form.btn_split.position = "absolute 150 47 167 741"; 
		trace("[/top_frame.xfdl] [setViewMenuStatus()] ==> [열기 처리_Done]" );  
	} 
	else 
	{ 
		trace("[/top_frame.xfdl] [setViewMenuStatus()] ==> [닫기 처리] --> [btnMenuView.bmp]" );  
		btn_viewMenu.style.background.image = "URL('images::btnMenuView.bmp')";// TOP 메뉴 보이기 이미지 Display
		 
		application.mainframe.VFrames.HFrames.separatesize = "17,*";    // lelft frame 재설정(왼족 프레임 제거[오픈할 이미지만 남겨 둠, 프레임 닫기])

		gv_LeftFrame.form.btn_split.style.background.image = "URL('theme://IMG/btn_LF_menuOpen.png')"; // Left 메뉴 보이기 이미지 Display
		gv_LeftFrame.form.btn_split.position = "absolute 7 48 24 742"; 
		trace("[/top_frame.xfdl] [setViewMenuStatus()] ==> [닫기 처리_Done]" ); 
	}
}
==============================================================================================================

- nexacro 공통 교육 자료 입수
1. 김경태 과장(옆자리)에게 구함
2. Runtime은 안됨 ==> MySQL DB 사용
01. nxui_NX ==> http://localhost/nxui/index.html  ==> chulsoo/test123 
System.out.println("[/LogInOutController.java] [loginCheck()] ==> [TEST_01]" ); 
==============================================================================================================

- Toad(토드) for MySQL
1. http://blog.naver.com/sensate1024/220302826889
http://blackturtle.tistory.com/711708
2. MySQL 한글 깨지는 문제 해결 ==> http://blog.naver.com/sensate1024/220304961031
3. MySQL 설치와 기본 사용법 ==> http://blog.naver.com/titetoto123/130162178160
4. ToadforMySQL_Freeware_7.5.0.966.exe 설치

- /nexacroplatform/target/nexacroplatform/WEB-INF/classes/egovframework/spring/context-datasource.xml
<!--// 01. mysql DB 설정 //-->   
<bean id="dataSource" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close">
<property name="driverClassName" value="com.mysql.jdbc.Driver"/>
<property name="url" value="jdbc:mysql://localhost:3306/test"/>
<property name="username" value="nexacro"/>
<property name="password" value="nexacro"/>
</bean>
---------------------------------------------------------------------------------------------------------------

- My SQL 명령어
show tables   -- DB의 테이블 보기
--;
--------------------------------------------------------------------------------

DESC tb_code  -- 테이블 column 보기
--;
--------------------------------------------------------------------------------

- MySQL 테이블 생성 구문에 코멘트 달기, mysql comment   
MySQL 에서 테이블 생성 시 "comment" 를 사용하여 코멘트를 추가할 수 있다. 
하이픈(-)을 연속으로 2개 붙이고, 빈칸 없이 문자열을 넣는 경우는 그냥 주석처리에 해당한다.  
CREATE TABLE MENU
(
MENU_ID       int comment '메뉴ID', --그냥주석
MENU_NAME     VARCHAR(20) comment '메뉴명칭',
MENU_PARENTID VARCHAR(10) comment '상위메뉴 ID',
MENU_DEPTH    VARCHAR(10) comment '메뉴 depth',
MENU_URL      VARCHAR(255) comment '메뉴 url 경로',
MENU_LEVEL    VARCHAR(10) comment '사용자 메뉴 레벨'
) ENGINE=InnoDB DEFAULT CHARSET=euckr comment = '메뉴관리 테이블'; 
==============================================================================================================

- 여러 파일 찾기(I): Edit Plus에서
1. 검색(S) > 여러 파일 찾기(I) > 여러 파일 찾기(새창)
 1) 찾을 말(I): 기준지
 2) 파일 종류: *.txt
 3) 폴더(O): D:\01. TAMA Work(USB 64G)\01. Memo
 --> 하위 폴더 포함(S): 체크
---------------------------------------------------------
 
2. 검색(S) > 여러 파일 찾기(I) > 여러 파일 찾기(새창)
 1) 찾을 말(I): trackPopupMenu
 2) 파일 종류: *.xjs  --> .xfdl 
 3) 폴더(O): D:\Tama_Prject
 --> 하위 폴더 포함(S): 체크 
==============================================================================================================

- 외국인등록증 복사(장인, 장모, 10시)
1. 외국인등록증 복사해서 회사에 제출
 1) 직장 강보험 가입 목적
==============================================================================================================

- 회사 홈페이지 개편 지시(김현욱 이사님)
1. http://gidata.co.kr  ==> gidata / adm1472 --> admin / adm1472[예전 거)
 1) http://gidata.co.kr/page/target.php?theme=logon
2. 호스팅 업체(한비로): http://mypage.hanbiro.com/index.asp?l=2  --> hanbiro@hanbiro.com --> 1544 - 4755
 1) 호스팅(Gidata) ==> http://www.hanbiro.com/
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2015.04.30(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 19:00 ==> 

- Xplatform 개발
1. 게시판 개발
==============================================================================================================

- 회사 홈페이지 수정(김현욱 이사님)
1. 호스팅(Gidata) 관리자 로그인 ==> http://gidata.co.kr/page/target.php?theme=login  ==> admin / adm1472 
 1 ) http://mypage.hanbiro.com ==> gidata / adm1472
-----------------------------------------------------------------------------------------------------

- 호스팅 정보
 1. 웹 호스팅 정보
 1) 도메인: gidata.co.kr, 2) FTP ID: gidataftp, 3) FTP 패스워드: gidata1472, 4) 접속서버: 211.234.111.5, 
 5) 네임서버(1차): ns8.hanbiro.com, 6) 총용량: 1000 MB
2. DB 호스팅 정보(mysql)  ==> php
 1) DB명: gidata, 2) DB-ID: gidata, 3) 패스워드: gidata1472, 4) 접속서버: 211.234.111.5, 5) 총용량: 1000 MB   
==============================================================================================================

- 글쓰기
- /list.skin.php 파일에서(/bbs/board.php)
<div style="float:right;">
<? if ($write_href) { ?><a href="<?=$write_href?>"><img src="<?=$board_skin_path?>/img/btn_write.gif" border='0'></a><? } ?>
</div> 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■