

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.07) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.07.01(금) 작업 ■■■■■■■■■■■■■■■■■
---> 07:30 ~ 01:00 ==> 비 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

- 나이스 결제 확인 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02)2187-2745 박재준(마케팅 팀장) 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>가맹점 코드(KSNET R&F: 2002100297/32871, KSNET L&B: 2002100298/32871) 
------------------------------------------------------------------------------------------ 
- BC카드 KS넷 모듈 분석 
- 김명석 과장(3420-5916 *)  ===> 사업부 
ISP기준 모듈((주)KS넷) 
3420-6807  윤영환 
3420-5922  왕정근 대리 
==============================================================================================================

- missing right parenthesis 
서브쿼리를위해 괄호로 묶었는데 에러뜹니다. 우측괄호가 없다면서. 
(SELECT no from BBS where code=0 ORDER BY no asc) 
에러->ORA-00907: missing right parenthesis 
아래는 잘됩니다. ㅡㅡ; 
(SELECT no from BBS where code=0)  
아래도 잘됩니다. ㅡㅡ; 
SELECT no from BBS where code=0 ORDER BY no asc  
결론.. 괄호속에서 order by 쓰면 에러납니다. 
==============================================================================================================

- identifier too long 
==============================================================================================================

- 환불금 확정 (/BizMgr/SaleMgr/WebOrderMgr/repayDeductP.jsp) 
==============================================================================================================

카드 번호:  5404-8664-8095-9001 엘지  
이카드 결제중입니다라고 해서 화면이 안넘어간다고 하는데 
확인부탁드리겠습니다~^^ 
==============================================================================================================

- Gold Store 테이블 정보 
T_ITEM: 상품 정보 
T_STOCK_IN_OUT:상품입출고 정보 

T_ORDER: 주문 정보 
T_ORDER_DTL: 주문정보상세 정보 
T_GUEST: 고객 정보  
T_GOLD_AR: 금시세 정보  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.02(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 비 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

-- 주문상태(21:반품신청, 22:반품접수, 23:물품회수완료, 24:환불금계산완료, 29:환불완료) 
==>  23:물품회수완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.03(일) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 01:00 ==> 비

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

- 6월 마감 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.04(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:30 ==> 비

- 쇼핑몰 수정
- 116번 서버 적용 
노블레스 패키지 적용 
==============================================================================================================

\\210.123.133.39\f$\쇼핑몰부분개편\노블레스소프트웨어패키지\이정애 
www.i3shop.co.kr에서 "노블레스 패키지 구매"하는 이미지 입니다. 
(리셀러 타운 부분) 
main_tpl/img/main/No_packsge_Bt.jpg 으로  
이미지 올려 두었습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.05(화) 작업 ■■■■■■■■■■■■■■■■
---> 05:30 ~ 24:00 ==> 구름 

- 쇼핑몰 수정
- 실 서버 적용(쇼핑몰 부분 개편) 
핸드폰 한정수량 적용 
SPH-X9850: 300대 한정 
==============================================================================================================

- 협력업체 
드리미(pyunsu/2530249) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.06(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 24:00 --> 구름 

- 쇼핑몰 수정
- 실 서버 적용 
핸드폰 양식 다운로드 추가 
==============================================================================================================

2005년 골드엔 사은품 디스크 
------------------------------------------------------------------------------------------------------------------------------
  
- 노블 패키지2 2개 구매(서버 이상: 느린 시스템이 원인) 
0100012005070600474 
류미자(김경옥):65rmj * 053-591-3089 
최선미(65rmj) 018-51-3543 
==============================================================================================================

- 재고관리 프로그램 개발(VB)
텍스트 파일을 Oracle DB로 전환 
재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.07(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

0100012004110400168 ->주문건으로 2005년 5월20일날 재설치 a/s접수되어있는데요~ 
이건...대리점측에서 접수를 잘못한건이거든요~ 
재설치 A/S신청한적 취소 부탁 부탁드릴께요~ 
==============================================================================================================

0100012005061900075 
선봉자_E  
쇼핑몰 마이샵관리에 사진파일올리면 내부서버오류 페이지를 표시할수없습니다라고 뜹니다. 
/home/i3shop/upfile 
http://h21.hani.co.kr/section-021118000/2005/07/021118000200507050567069.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.07(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 --> 구름 

- 쇼핑몰 수정
- 05년 상반기 재고조사 최종 점검 
- 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
==============================================================================================================

- IP: 211.33.193.131 
http://211.33.193.131/login/login.jsp 
==============================================================================================================

- Nobless 판매현황(/BizMgr/ReportMgr/SaleMgr/noblessP.jsp) 
==============================================================================================================

- TNS 네임 에러 
C:\oracle\ora92\network\ADMIN\tnsnames.ora 파일에서  
TNS 네임이 없어서 에러 남(아래  TNS 네임(IIISHOP) 추가) 
IIISHOP = 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST = 211.233.5.110)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SERVICE_NAME = iiishop) 
    ) 
  ) 
==============================================================================================================

- 상품코드: 00153300 
8801042284394 --> 8801042976009 
라네즈 퓨쳐에이지 아이세럼-20ml 
==============================================================================================================

- 20050708 00205
guscjffl/김현철 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.08(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 03:00 --> 구름 

- 쇼핑몰 수정
- 05년 상반기 재고조사 
- 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.09(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:50 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.10(일) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 20:10 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.11(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
20050710 00123  김미자 

주문자 : 최기자 
주문번호 : 0100012005070700430 -- 20050707 00430 
==============================================================================================================

0100012005062900628..주문번호인데요~ 
주문번호로 보니까..6월29일날 한거 같은게......ㅡ.ㅡ;;; 
언제쯤 전산에 주문 했는건인지 확인좀 해주세요~??? 
==============================================================================================================

- 직원 기초 소양교육 
- B조 : 7월 22일(금), 16~18:00 / 25일(월) ~ 28일(목), 19~21:00 (총 10H) 
==============================================================================================================

- 노은주 주임 프린터 
\\210.123.133.185(노은주/9035)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.12(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

0100012004081800315 ..이옥자/이옥자 이구요.~ 
배송, 설치 다 받은걸로 나오는데..확인결과 배송만 받은건입니다~ 
배송만 받은걸로..전산에 수정 부탁드립니다~ 
==============================================================================================================

- 칼럼 추가 
ALTER TABLE T_NETTEL_INSTREQUEST_BK ADD (  
	DONE_GB CHAR(2 BYTE), /* 처리여부(01:미처리, 02:처리중, 03:완료, 04:기타) */ 
	DONE_DT CHAR(8 BYTE), /* 처리일자 */ 
	DONE_TXT          VARCHAR2(2000 BYTE) /* 처리내역  */   
);   
==============================================================================================================
  
- 무료설치 이관 내역 
처리일자, 처리내역, 처리여부(01:처리, 02:미처리, 03:기타)   
==============================================================================================================

- 노블레스 패키지 변경 
당일건은 통합에서 실무자가 취소 처리 
하루 지난 건은 DB 업데이트 후 마감(수불장, 매입장, 영업마감) 다시 돌리기 
==============================================================================================================

- 상품코드(00153090:지문인식기): 918개(921개로 수정) 
20050516 --> 2건 잘못 
20050516 ~ 20050711 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.13(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
- 엑셀 출력 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.14(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 

--일별 노블레스PK 해피콜 수정(설치요청 여부 정보 수정)     @@@@@@@@@@@@@@@@@@@ 
-- UPDATE T_ORDER_HAPPY U 
SET U.INSTALLREQ_YN = 'Y' /* 설치요청 여부(무료설치) */ 
WHERE EXISTS 
    ( SELECT  'x'  
-- SELECT  A.ORDER_DT, A.ORDER_NO 
FROM T_ORDER A, T_ORDER_DTL B, T_NETTEL_INSTREQUEST C 
WHERE A.COMPANY_CD = B.COMPANY_CD 
    AND A.MERCHANT_CD = B.MERCHANT_CD 
    AND A.ORDER_DT = B.ORDER_DT 
    AND A.ORDER_NO = B.ORDER_NO 
AND A.ORDER_DT = U.ORDER_DT 
AND A.ORDER_NO = U.ORDER_NO 
AND B.ORDER_DT = U.ORDER_DT 
AND B.ORDER_NO = U.ORDER_NO 
    AND A.MEM_ID = C.ORDER_ID --주문자ID가 같은 것 
    AND A.COMPANY_CD = '01' 
    AND A.MERCHANT_CD = '0001'   
    AND A.ORDER_TP IN ('01')  --주문유형(01:정상주문, 03:반품주문) 
AND A.ORDER_STS >= '03' --주문상태(03:결제완료) 
    AND A.ORDER_DT >= '20050705'       --주문번호 
AND B.ITEM_CD = '00156771'       --상품코드(00156770:노블패키지1(노블CD+휴대폰), 00156771:노블패키지2(노블CD+G/W+전화기))   
GROUP BY 
        A.COMPANY_CD, 
        A.MERCHANT_CD, 
        A.ORDER_DT, 
        A.ORDER_NO, 
        B.ITEM_CD, 
        B.ITEM_NM, 
        A.SELLING_DT, 
        A.MNO,        
        A.MEM_ID  
) 
; 
==============================================================================================================

--일별 노블레스PK 해피콜 정보 조회     @@@@@@@@@@@@@@@@@@@ 
SELECT ORDER_DT, ORDER_NO, ITEM_CD, INSTALLREQ_YN 
FROM T_ORDER_HAPPY   
WHERE ITEM_CD = '00156771'        --상품코드(00156770:노블패키지1(노블CD+휴대폰), 00156771:노블패키지2(노블CD+G/W+전화기))   
AND ORDER_DT >= '20050705'     --주문일자--> 20050621 00354 
AND ITEM_CD = '00156771'       --상품코드(00156770:노블패키지1(노블CD+휴대폰), 00156771:노블패키지2(노블CD+G/W+전화기))   
--AND ORDER_NO = '00476' 
AND INSTALLREQ_YN = 'Y' /* 설치요청 여부(무료설치) */ 
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.15(금) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 24:00 --> 구름 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

 %%  정진옥   codejjo   Active-Master 
엘지카드 결재하는데 - 잔여한도초과라 결재가 안된다고 나온다고함  
카드사로 확인했으나 한도 600만 남아있다고하시며~   
카드번호 : 4386 7611 8793 3000  -> \ 190000  결재하려고하심  
확인후 전화  *   
--------------------------------------------------------------------------------- ----------------------------------------- 
8326 사용한도초과                           
==============================================================================================================

- Nobless 판매현황(/BizMgr/ReportMgr/SaleMgr/noblessP.jsp) 
노블CD: 00143123, 노블CD Ver2: 00152262 
--상품코드(00156770:노블CD+휴대폰, 00156771:노블CD+G/W+전화기, 00152262:노블CD2, 00152138:게이트웨이) 
==============================================================================================================

- ORA-12545 에러(tnsnames.ora) 
대체적으로 에러 메시지에 문제의 원인이 있습니다. 
대상 호스트나 객체가 없다는 말은 말그대로 tns에 설정된 호스트가 없다는 말이지요. 
호스트이름에 대한 ip를 찾을수 없거나 아니면 호스트이름이 잘못되었거나 하였을 겁니다. 
확인해보시지요. 
--------------------------------------------------------------------------------- ----------------------------------------- 

IIISHOP = 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST =  211.233.5.110)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SID = IIISHOP) 
      (SERVER = DEDICATED) 
    ) 
==============================================================================================================

- 데이타 이관 수정(처리완료 받음) 
SELECT * 
FROM T_ORDER  
WHERE I3SHOP_ORDER_NO = '0100012004090300441' 
0100012004090300441 주문자: 김양선       수령자: 배종진(김양선)            
--------------------------------------------------------------------------------- ----------------------------------------- 

SELECT * 
FROM T_ORDER  
WHERE RECV_NM LIKE  '이옥자%' 
0100012004081800315  9903 주문자: 이옥자       수령자:이옥자       
==============================================================================================================

- 마우스 구매(NB-30 블랙); 23,100원(택배비3,000원 포함) 
http://nshopping.naver.com/price/detail.php?cat_id=01010402&nv_mid=115640 

dateadd("d",-6,Format(Text1.Text, "yy-mm-dd"))  
Format(Text1.Text, "yy-mm-dd") 
DateAdd("d", 1, Format(Text6.Text, "yyyymmdd")) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.18(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 --> 구름 

- 통합 수정
- 노블PK2관리(G.W)  수정  
==============================================================================================================

 패키지 2 게이트웨이 주문수량은 맞는데 반품수량이 맞지 않습니다. 
112-6=106 통합기준 
112-3=109 해피콜 프로그램 기준...ㅠ.ㅠ 
==============================================================================================================

- 우편번호 업데이트(20050524변경) 
- 필드 값을 붙일수 있는 방법(MS-SQL) 
SELECT DONG , RI , ISNULL(DONG,' ') + ISNULL(RI,' ') AS DONG_RI, ISNULL(BUNJI,' ')              
FROM T_ZIPCODE_New 
WHERE (DONG LIKE '%옥천%') 
-------------------------------------------------------------------------------------------------------------------------- 

- 숫자라면 문자로 바꾼후에 해야 합산) 
SELECT convert(varchar(2),a)+convert(varchar(2),b) as 'c' FROM aaa 
-------------------------------------------------------------------------------------------------------------------------- 

- MS-ACCESS 에서 
SELECT (iif(isnull(DONG),'',DONG) +' '+ iif(isnull(RI),'',RI)) AS DONG_RI FROM T_ZIPCODE 
==============================================================================================================

- 신용카드 매출 파악(수당적용일자 기준) 
--신용카드 매출 파악(수당적용일자 기준) 조회 ===> BC카드  @@@@@@@@@@@@@ 
SELECT A.COMPANY_CD  A.MERCHANT_CD  A.ORDER_DT  A.ORDER_NO AS 주문번호, 
       MAX(A.ORDER_DT) AS 거래일자, 
       MAX(C.MEM_NM) AS 주문자,  MAX(D.ITEM_NM) AS 상품명, 
       MAX(D.REAL_SALE_PRICE) AS 단가, SUM(D.REAL_QTY) AS 수량, --C.SHIP_CHARGE AS 배송비, 
       SUM((D.REAL_SALE_PRICE * D.REAL_QTY) + C.SHIP_CHARGE) AS 금액, 
       MAX(A.AMT) AS 결제금액, 
       MAX(A.CARD_NO) AS 카드번호, MAX(A.QUOTA_MONTH) AS 할부, 
       MAX(C.FIX_ADDR  C.DTL_ADDR) AS 배송지, A.REG_DT AS 등록일, A.REG_IP AS IP주소 
FROM T_CARD_LOG A,  T_ORDER C, T_ORDER_DTL D 
WHERE A.ORDER_DT = C.ORDER_DT 
    AND A.ORDER_NO = C.ORDER_NO 
    AND A.ORDER_DT = D.ORDER_DT 
    AND A.ORDER_NO = D.ORDER_NO 
    AND C.ORDER_DT = D.ORDER_DT 
    AND C.ORDER_NO = D.ORDER_NO 
    AND APPROVAL_CODE ='O'           --승인코드(0000:정상완료) 
    AND A.TERMINAL_NO ='2002100297'   --가맹점번호(2002100297:R&F BC카드) 
   --AND B.CARD_NM ='BCcard'        --카드명(KBcard, BCcard, lgcard, samsungcard) 
AND C.ORDER_TP IN ('01') --주문유형(01:정상주문, 03:반품주문) 
AND C.ORDER_STS >= '03'   --주문상태(03:결제완료) 
AND C.AR_WAY_CD IN('02','03')       --결제방법코드(01:현금, 02:카드, 03:현금/카드) 
   -- AND C.ORDER_DT >= '20050401' --주문일자 
--AND C.ORDER_DT <= '20050715' 
AND D.BONUS_APPLY_DT >= '20050629' --수당적용일자 
AND D.BONUS_APPLY_DT <= '20050630' 
AND D.RESELLER_SALE_YN ='Y'    --리셀러소비여부 
GROUP BY A.COMPANY_CD  A.MERCHANT_CD  A.ORDER_DT  A.ORDER_NO, A.REG_DT, A.REG_IP, C.ORDER_STS 
;  
==============================================================================================================

--신용카드 매출 파악(수당적용일자 기준) 조회 ===> KB카드  @@@@@@@@@@@@@ 
SELECT A.COMPANY_CD  A.MERCHANT_CD  A.ORDER_DT  A.ORDER_NO AS 주문번호, 
       MAX(A.ORDER_DT) AS 거래일자, 
       MAX(C.MEM_NM) AS 주문자,  MAX(D.ITEM_NM) AS 상품명, 
       MAX(D.REAL_SALE_PRICE) AS 단가, SUM(D.REAL_QTY) AS 수량, --C.SHIP_CHARGE AS 배송비, 
       SUM((D.REAL_SALE_PRICE * D.REAL_QTY) + C.SHIP_CHARGE) AS 금액, 
       MAX(A.AMT) AS 결제금액, 
       MAX(A.CARD_NO) AS 카드번호, MAX(A.QUOTA_MONTH) AS 할부, 
       MAX(C.FIX_ADDR  C.DTL_ADDR) AS 배송지, A.REG_DT AS 등록일, A.REG_IP AS IP주소 
FROM T_CARD_LOG A, T_CARD_BIN B, T_ORDER C, T_ORDER_DTL D 
WHERE SUBSTR(A.CARD_NO, 1, 6) = B.CARD_BIN 
    AND A.ORDER_DT = C.ORDER_DT 
    AND A.ORDER_NO = C.ORDER_NO 
    AND A.ORDER_DT = D.ORDER_DT 
    AND A.ORDER_NO = D.ORDER_NO 
    AND C.ORDER_DT = D.ORDER_DT 
    AND C.ORDER_NO = D.ORDER_NO  
    AND A.APPROVAL_CODE ='0000'             --승인코드(0000:정상완료)  
    AND B.CARD_NM ='KBcard'            --카드명(KBcard, BCcard, lgcard, samsungcard) 
AND C.ORDER_TP IN ('01') --주문유형(01:정상주문, 03:반품주문) 
AND C.ORDER_STS >= '03'   --주문상태(03:결제완료) 
AND C.AR_WAY_CD IN('02','03')       --결제방법코드(01:현금, 02:카드, 03:현금/카드) 
    --AND C.ORDER_DT >= '20050401' --주문일자 
--AND C.ORDER_DT <= '20050715'  
AND D.BONUS_APPLY_DT >= '20050429' --수당적용일자 
AND D.BONUS_APPLY_DT <= '20050430' 
AND D.RESELLER_SALE_YN ='Y' --리셀러소비여부   
GROUP BY A.COMPANY_CD  A.MERCHANT_CD  A.ORDER_DT  A.ORDER_NO, A.REG_DT, A.REG_IP, C.ORDER_STS 
; 
==============================================================================================================

- Mail 세팅 
http://old.i3shop.com/admin.html 
i3shop/0506 
==============================================================================================================

'☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞ 
' 사용불가 : TEST시 자기PC에 DOWN하여 사용 
'☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞☞ 
'    With gUserInfo 
==============================================================================================================

  
■■■■■■■■■■■■■■■■■■ 2005.07.19(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00 --> 맑음 

- 통합 수정
- 노블PK관리 수정  
==============================================================================================================

- 0/0 에러(divisor is equal to zero) 
java.sql.SQLException: ORA-01476: divisor is equal to zero 
==============================================================================================================

- 정수기 수정 
0100012004090300441 
배송일자 20040907 
===================================================================================================================

- 노블 패키지 전환 예정(PK2 -> PK1) 
0100012005071400339 이만희 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.20(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 24:00 --> 맑음 

- 통합 수정
- 노블PK2관리(G.W)  수정  
==============================================================================================================

- 하드 디스크 구매 
Seagate 80G 7200rpm (7200.7) 정품(SN:PCD-507-A9843) -- 가격: 56,000원  
http://www.next2u.co.kr 
국민은행 590602-01-173901 이민경( 59060201173901) ---> 6만원 구매 
==============================================================================================================

- 로그인시 게이트웨 신청 팝업창 안뜸 
--> 정소쇠   j0519/380519 Active-Master 0100012005070600199 
--> 이경화   h0605 Active-Master 0100012005070500122 
--> 나성훈   nasb0925 Member 0100012005070600215 
==============================================================================================================

-- 우편번호 업그레이 안함(44,386 --> 48.161) 
강원 정선군 신동읍 조동7리 / 8리 
------------------------------------------------------------------------------------------------------------------------ 

-- 우편번호 조회 @@@@@@@@@@@@@ 
String SQL = " SELECT ZIPCODE_SEQ, ZIP_NO, \n" + 
" STATE' 'CITY' 'DONG ADDR, \n" + 
" ADDR ADDR_DETAIL \n" + 
"  FROM T_ZIPCODE \n" + 
" WHERE DONG LIKE '%" + p_dong + "%' \n" ; 
------------------------------------------------------------------------------------------------------------------------ 

-- 우편번호 조회 @@@@@@@@@@@@@ 
SELECT ZIPCODE_SEQ, ZIP_NO, DONG, 
STATE' 'CITY' 'DONG ADDR, 
ADDR ADDR_DETAIL 
-- SELECT  COUNT(*) 
-- SELECT  * 
FROM T_ZIPCODE 
WHERE DONG LIKE '%두호%' 
; 
==============================================================================================================

-- 칼럼 수정 
ALTER TABLE T_ZIPCODE_2 MODIFY (  
DONG  VARCHAR2(50) --동 
);   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.21(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 24:00 --> 맑음 

- 통합 수정
- 노블PK2관리(G.W)  수정  
==============================================================================================================

허인녀            chunbo19                 Management-M 
오전에 카드 결제를 한번했고, 또 한번더 다른주문을 하려고 하니,  
잔액이 부족하다고 해서 충전한 다음 다시 결제하려고 하니  
거래 정지카드 8324  라고 조회된다고 하심  
카드번호: 9420-9020-5946-4900    
==============================================================================================================

/VendorMgr/noblessePkg/noblessePkgRetP.jsp 

--노블레스 패키지(핸드폰 약관 정보) 조회   
SELECT A.ORDER_DT,  A.ORDER_NO,  A.ITEM_CD, A.DREAMMI_GBN 
FROM T_NOBLE_PK_ORDER A 
WHERE DREAMMI_GBN IN ('01', '04')   ---드리미 구분(01:개통완료, 04:배송) 
==============================================================================================================

* 신금자 Active-Master / nageumjada 
운영자 소개글에 리셀러 사진을 등록했는데.... 잘못 등록했다고함... 
다시 등록을 하려고하니  삭제도 안되고.  덮어쓰기를 해도 사진이  
변경되지않고 첨에 등록했던 사진 그래도 확인이 된다고함. 
대리님위건으로 고객에게 연락을 해서 정상적으로 변경이 된다안내를드렸습니다.  
고객도 덮어쓰기 여러번 시도했는데 전혀 처리가 안된다고합니다.  
확인후 통화부탁드립니다~  
02-993-7359  / * --> * 
처리결과 메모 부탁드립니다. 수고하세요. 
==============================================================================================================

- 노블 패키지 전환(PK2 -> PK1) 
0100012005071400339 이만희 
- 상품코드 수정 
==============================================================================================================

--노블레스PK 주문시 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
SELECT ORDER_DT, ORDER_NO, AMT_NOBLE_PK_1, AMT_NOBLE_PK_2, 
     ITEM_CD, ITEM_NM, REG_ID 
FROM T_NOBLE_PK_ORDER_PRICE 
WHERE ORDER_DT = '20050714'  
AND ORDER_NO = '00339'     
;     

--노블레스PK 주문시 정보 수정 @@@@@@@@@@@@@@@@@@@ 
-- UPDATE T_NOBLE_PK_ORDER_PRICE  
SET ITEM_CD = '00156770', 
ITEM_NM = 'i3 노블레스 소프트웨어 Ver 2.0+휴대폰', 
AMT_NOBLE_PK_1 = 143000 
WHERE ORDER_DT = '20050714'  
AND ORDER_NO = '00339'     
;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.22(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 24:00 --> 맑음 

- 통합 수정
- 통계 분석 수정  
==============================================================================================================

-- 시퀀스 삭제, 생성 
DROP SEQUENCE IIISHOP.NO_SEQ; 

CREATE SEQUENCE IIISHOP.NO_SEQ 
  START WITH 1 
  MAXVALUE 999999999999999999999999999 
  MINVALUE 0 
  NOCYCLE 
  NOCACHE 
  NOORDER; 
==============================================================================================================

- 정수기 에러 
0100012004021001313..주문건요~ 
배송+설치 다 받은걸로 나오는데...배송만 받고 설치안한건입니다~ 
설치삭제랑...빨간색으로 수정해주세요~ 
==============================================================================================================
  
0100012004082400455 건요...배송+설치 둘다 받은건이래요. 
아까 보낸 메세지 생각하지마시구요~ 
설치날짜에다가...7월1일만 추가 해주시면되요... 
7월1일날 설치 완료된건이라고 하십니다~ 
==============================================================================================================

산소수기 7월3일날 주문한건인데요~ 
정수기 전산에 안보이거든요~ 
20050703, 이금순, 0100012005070300205, 20050703 
3 - R&F매장 - 52in 산소수기() -  - 1299000 - 1 
4 - R&F매장 - 52in산소수기 설치비() -  - 70000 - 1 
주문내역이거든요..확인부탁드릴꼐요~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.23(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 --> 맑음 

- 통합 수정
- 통계 분석 수정 
노블레스 패키지 전체 매출 분석 
노블레스 PK1( 핸드폰) 매출 분석 
==============================================================================================================

- 결제 불가 카드 
현대 결제불가일:20051215 원인: 가맹점 계약 만료 
하나비자 결제불가일:20050225 원인: BC카드가 관리하는 카드로 결제 중지 후 나이스 망에서 중지됨 
KSNET망을 타면 결제가 가능할 것으로 추정 
한미 --> 잘 안될 때도 있음(정상적으로 가능) 
==============================================================================================================

- KB카드 할부 불가 
5543490385730000 akgigtid 비할부가맹점(0012)  
==============================================================================================================

- 오라클 부하율 보기 
> topas -i1 
==============================================================================================================

SELECT MAGAM_DATE, MEIP_NO, RECEIVER_ADDR 
FROM T_MAGAM_MEIP 
WHERE MAGAM_DATE = '20050723'  
 AND MEIP_NO = '0100012005072300114'  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.25(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 --> 맑음 

- 통합 수정
- G.W프로그램 에러 
고객님은 게이트웨이사은품신청 
안재형      anje0 
20050612, 안재형, 0100012005061200153, 20050612 
1 - R&F매장 - i3 노블레스 소프트웨어 Ver 2.0() -  - 1299000 - 1 
==============================================================================================================

- 재고조정 에러 
00155474 precarbon 필터 (2차) -16 
확인 부탁해요 장부재고에 16개 있어야 되는데 
재고조정 -16개 되어 0개로 되어 잇네요 
==============================================================================================================

- 미러쿠아 반신욕기와 설치비는 같이 수량으로 주문 수정 
- 1개이상 주문 가능--> 2:1 주문 불가능으로 수정 
==============================================================================================================

- 이모빅스 
김현구 * 
==============================================================================================================

- 노블CD Ver2주문 G.W  배송 조회  ==> 해피콜  @@@@@@@@@ 
SELECT A.COMPANY_CD, A.MERCHANT_CD, A.ORDER_DT, A.ORDER_NO,  
   A.ITEM_CD AS 상품코드, A.ITEM_NM AS 상품명, 
   A.SELLING_DT AS 입금일자, A.ACCEPT_DT AS 신청일자,  
   A.DELEVERY_STS AS 배송여부,  A.DELEVERY_DT  AS 배송일자,  
   A.MEM_NM, A.MEM_ID, A.RECEIVER_NM, A.RECEIVER_PHONE,  
   A.RECEIVER_HP, A.ZIP_NO, A.FIX_ADDR, A.DTL_ADDR 
FROM T_ORDER_HAPPY A  
WHERE A.COMPANY_CD = '01'  
  AND A.MERCHANT_CD = '0001'  
  AND A.MEM_ID = 'anje0'        --주문자ID 
  AND( A.SELLING_DT >= '20050601' AND  A.SELLING_DT <= '20050630' )   
  AND A.INSTALL_YN <> 'Y'  
  AND GUBUN = '01'  
  --AND DELEVERY_STS = '01'  --배송여부(01:배송전, 02:배송처리) 
ORDER BY SELLING_DT 
;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.26(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 01:00 --> 맑음 

- 통합 수정
- BC카드 완전 결제 가능(L&B가능) 
결제한도 --> R&F: 3억 5천, L&B: 5천 
==============================================================================================================

- 노블Ver2.0_G.W 출고 데이타 출력(조의대 대리 요청) 
2005년 01월 01일 ~ 7월 27일 
00152262 노블CD Ver2.0 
00152138  VOIP 게이트웨이(재고조정 내역 추가) 
00152821  게이트웨이 DV-101 
==============================================================================================================

- 재고조정 수정 
00149287  코트랑알파    -1개   재고조정이 안되었어요.  --> 0개   
업무 협조전 발송 할테니 data도 부탁 합니다. 
(게이트웨이 /노블레스cd 2.0  일자별 입출고 현황) 
==============================================================================================================

- 협력업체 수정(핸드폰) 
신청내역조회(/VendorMgr/noblessePkg/noblessePkgRetP.jsp)  
드리미(pyunsu/2530249) 
==============================================================================================================

--노블레스 PK1( 핸드폰) 매출 분석 조회   @@@@@@@@@@@ 
SELECT A.REAL_PHONE_TYPE,       --지급모델    
   NVL(SUM(C.QTY),0) AS QTY,    --수량 
   NVL(MAX(A.PRICE),0) AS PRICE,    --판매가 
   NVL(SUM(A.PRICE),0) AS TOT_PRICE  --총금액 
FROM T_NOBLE_PK_ORDER A, T_ORDER B, T_ORDER_DTL C  
WHERE A.MNO = B.MNO  
AND B.ORDER_DT = C.ORDER_DT 
AND B.ORDER_NO = C.ORDER_NO  
    AND B.SELLING_DT >= '20050701'     --주문일자  
AND B.SELLING_DT <= '20050724' 
AND B.ORDER_TP = '01'       --주문유형(01:정상주문, 03:반품주문)  
AND B.ORDER_STS >= '03'        --주문상태(03:결제완료 이상인 것)   
AND A.DREAMMI_GBN IN ('01', '04')   --드리미 구분(01:개통완료, 04:배송) 
AND C.ITEM_CD = '00156770'  
GROUP BY A.REAL_PHONE_TYPE --, B.SELLING_DT 
; 

--노블레스 PK1( 핸드폰) 매출 분석 조회   @@@@@@@@@@@ 
SELECT A.PHONE_TYPE, A.DREAMMI_GBN,  A.REAL_PHONE_TYPE,       --지급모델       
   A.PRICE AS PRICE,    --판매가 
   A.PRICE AS TOT_PRICE  --총금액 
-- SELECT  * 
FROM T_NOBLE_PK_ORDER A  
WHERE  A.DREAMMI_GBN IN ('01', '04')   --드리미 구분(01:개통완료, 04:배송) 
  AND A.REAL_PHONE_TYPE IS NULL 
; 
==============================================================================================================

-- 노블CD Ver2주문 G.W  배송 조회  ==> 해피콜  @@@@@@@@@ 
SELECT B.STOREIN_DT AS 입고일자,  
   A.COMPANY_CD, A.MERCHANT_CD, A.ORDER_DT, A.ORDER_NO,  
   A.ITEM_CD AS 상품코드, A.ITEM_NM AS 상품명, 
   A.SELLING_DT AS 입금일자, A.ACCEPT_DT AS 신청일자,  
   A.DELEVERY_STS AS 배송여부,  A.DELEVERY_DT  AS 배송일자,  
   A.MEM_NM, A.MEM_ID, A.RECEIVER_NM, A.RECEIVER_PHONE,  
   A.RECEIVER_HP, A.ZIP_NO, A.FIX_ADDR, A.DTL_ADDR 
FROM T_ORDER_HAPPY A, T_STOREIN_DTL B 
WHERE A.ORDER_DT = B.STOREIN_DT 
  AND A.ORDER_NO = B.STOREIN_NO 
  AND A.COMPANY_CD = '01'  
  AND A.MERCHANT_CD = '0001'  
  AND A.INSTALL_YN <> 'Y'  
  AND GUBUN = '01'  
  AND A.DELEVERY_DT >= '20050601'  --배송일자(출고일자) 
  AND A.DELEVERY_DT <= '20050601'   
  AND DELEVERY_STS = '02'  --배송여부(01:배송전, 02:배송처리) 
ORDER BY SELLING_DT 
;  
==============================================================================================================

- 황미옥(miok51) 
주문배송 상세조회에서  PV, BV 이미지가 안 보이는 이유 
--> PV, BV가 없는 상품을 주문하면 이미지가 안 보입니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.27(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 --> 맑음 

- 쇼핑몰 수정
- 하나비자 카드(안심클릭) 붙이기 
http://test.mart.cc/order/KSNET/KSpayAuth.html 

String CardSendType = "1" ; //카드정보전송유무 
0:미전송 
1:카드번호,유효기간,할부,금액,가맹점번호 
2:카드번호 앞14자리+”XXXX”,유효기간,할부,금액,가맹점번호 
==============================================================================================================

- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>가맹점 코드(KSNET R&F: 2002100297/32871, KSNET L&B: 2002100298/32871)  
------------------------------------------------------------------------------------------------------ 
- BC카드 KS넷 모듈 분석 
- 김명석 과장(3420-5916 *)  ===> 사업부 
ISP기준 모듈((주)KS넷) 
3420-6807  윤영환 
3420-5922  왕정근 대리 
==============================================================================================================

- 재고조정 수정 
00143460  에어스텔 공기 청정기  
==============================================================================================================

- 무료설치 안뜨는 고객 아이디-> msk0229 입니다. 
이 고객이 주문한 것은 노블레스 소프트웨어 Ver 2.0 이고 
무료설치는 노블레스패키지를 구매해야 뜹니다. 
주문번호: 0100012005070200310 00152262 i3 노블레스 소프트웨어 Ver 2.0 
==============================================================================================================

-- 수불장 조회 @@@@@@@@@@@@@@@ 
SELECT SUBUL_DATE, ITEM_CD, GICHO_QTY AS 기초재고, IPGORET_QTY AS 입고, CHULGO_QTY AS 출고,  
  JEGO_QTY AS 재고수량, JEGO_WONGA AS 재고금액, JEGO_WONGA_VAT AS 재고원가 
--  SELECT * 
FROM T_DAY_SUBUL 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '9001' 
  AND SUBUL_DATE = '20050726'   --수불일자 
  AND ITEM_CD IN ('00152262' )      --상품코드  00137810--> 0  00137811 -> 1 
  --AND ITEM_CD = '00153090'      --상품코드  00137810 
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.28(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 --> 맑음 

- 쇼핑몰 수정
- 하나비자 카드(안심클릭) 붙이기 
http://test.mart.cc/order/KSNET/KSpayAuth.html 

String CardSendType = "1" ;	// 카드정보전송유무 
0:미전송 
1:카드번호,유효기간,할부,금액,가맹점번호 
2:카드번호 앞14자리+”XXXX”,유효기간,할부,금액,가맹점번호 
==============================================================================================================

0100012003112800621 주문건인데요...배송+설치 받을걸로 나오는요~ 
배송+설치 안받은건->빨간색으로 변경 부탁드릴께요~ 
  
0100012004082400455..주문건이구요~ 
설치날짜가..2004년12월16일인데요...2005년 7월4일로 변경이 가능하지요???????  
------------------------------------------------------------------------------------------------------------- - 
0100012004082400455 김진희               
ORDER_NO: 9929 
FRESH_REG_DT =' 20041216' 
==============================================================================================================

- Message1=[잠시후재시도    ] 
Message2=[1003-IS1-1T-    ] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.29(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 24:00 --> 맑음 

- 쇼핑몰 수정
- KS NET 결제 모듈 붙이기 
http://test.mart.cc/order/KSNET/KSpayAuth1html 

String CardSendType = "1" ;	// 카드정보전송유무 
0:미전송 
1:카드번호,유효기간,할부,금액,가맹점번호 
2:카드번호 앞14자리+”XXXX”,유효기간,할부,금액,가맹점번호 
==============================================================================================================

박양희     park730 
카드번호 : 9430-2176-7328-5913  조흥BC 법인카드 
어제 결재안되어 BC로 전화를 하니 제휴하지않는 업체라 결재가 안된다고했다하세요.. 확인부탁드립니다.. 
==============================================================================================================

- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===> 가맹점 코드(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871) 
국민카드 직가맹 코드(R&F:16030818/32871, L&B:36894299/32871)  
------------------------------------------------------------------------------------------------------------ 

- BC카드 KS NET 모듈 분석 
- 김명석 과장(3420-5916 *)  ===> 사업부 
김철호 과장(251-6323) ===> 국민카드 대구지점 
ISP기준 모듈((주)KS넷) 
3420-6807  박, 윤영환 
3420-5922  왕정근 대리 
==============================================================================================================

0100012004082400455 김진희 
완료상태120050704) 
후레시 등록일자(20050728) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.07.30(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:40 --> 맑음 

- 쇼핑몰 수정
- KS NET 결제 모듈 붙이기 
http://test.mart.cc/order/KSNET/KSpayAuth1html 
==============================================================================================================

- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) 
==============================================================================================================

* 임승훈 Management-M / 170701   [ 가입일 : 20021209 ] 
위 분이구요.... 사이트에소 가입일 기준으로 주문배송현황조회하면 
주문번호는 조회되는데...클릭하면 페이지오류로 뜹니다.. 
==============================================================================================================

주문번호 [010001-2002120900021]의 주문내역 삭제된 건 ----< 
==============================================================================================================

%%  황규환  patron31  Active-Master  
아이리버 MP3주문하시는데... 국민카드 결재하셨는데 . 주문일시 에러 난다고하심  
(현금주문건 해봤는데 에러 나지 않음) 
확인후 전화요망  :  * 
==============================================================================================================

- 카드BIN 조회 
SELECT * FROM T_CARD_BIN 
WHERE  (CARD_BIN LIKE SUBSTR( '941046839841XXXX%', 0, 3) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 4) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 5) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 6) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 7) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 8) 
		OR CARD_BIN LIKE SUBSTR( '941046839841XXXX%',  0, 9) 
) 
AND ROWNUM = 1 
;
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■