

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.01.01(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 00:00 ~ 05:00 

- 쇼핑몰 수정
- 마감  
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.02(일) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 02:00 

- 쇼핑몰 수정
- 쇼핑몰 메인 작업 
- 노블레스 메인 작업 
----------------------------------------------------------------------------------------------------------------- 

-도메인 숫자 넣기 
[/top.jsp]:[topmenuPath]/main_tpl/topmenu/templete02/main.jsp 

-- MD 추천상품 조회(노블레스 매장): SALE_STS_CL: 03은 조회 안 됨 
SALE_STS_CL--> 배송구분(01:아이쓰리마트, 02:R&F, 03:협력업체) 
----------------------------------------------------------------------------------------------------------------- 

www.i3shop.co.kr 로그인 후 개인 도메인(tamario.i3shop.cc)으로 리턴 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.01.03(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:50 ~ 08:00 (철야) 

- 쇼핑몰 수정
- NK 테스트 서버 
\\210.123.133.221\c$ 
administrator/i3shopcvs1943 
========================================================================================================= 

- R&F 12월 프로모션 공지(팝업 내리기) 
/display/prdlist/prdlist.jsp, /display/big/bigctg.jsp 
==============================================================================================================

- 제한 수량 에러 
김영기 vip71 
킬러앱매장에 부안갯마을쌀 수량제한이 2주에 2포인데 
이분 주문한적없는데 주문안된다고 하시구요.., 
제가  김영기님 몰에서 주문해보니 주문은 되는데, 3포.4포..주문가능하네요~ 수량제한이 없는것같습니다~ 
오류가 있는것같네요~ 확인바랍니다~ 
========================================================================================================= 

이연동 대리 대금정산관리 읽기기능 권한 주세요.. 
========================================================================================================= 

이정순    570228 
R&F 상품 구매할려하는데... 12개월 할부개월수 오류라고 뜬다고 확인된다하심..  
BC 카드번호 : 9435-2000-1499-2749 
========================================================================================================= 

- 현금+ 카드 결제 130만오류 
sim1936/650815 
* 현시대 
반신욕기      5만 9원,   130만원 카드 
========================================================================================================= 

- 정수기 이관 실패 
주문번호: 0100012004040800144 
주문자/수령자: 최명옥/임찬임 
요건 10/22일자로 이관된건인데. 확인부탁드립니다~~~ 
수고하세요~~~^^* 
==============================================================================================================

- 통합 수정
--수불장_오류  =========> 
수불(T_DAY_SUBUL)이 수불구분[출고]가 2005년 1월 1일, 2일에 없어서 에러 

--어제 날짜 일별 수불장(T_DAY_SUBUL)이 돌았는지 확인 
 SELECT NVL( MAX ( ITEM_CD ), 0 )  INTO  P_ITEM_CD 
 FROM  T_DAY_SUBUL 
 WHERE COMPANY_CD = '01' 
   AND MERCHANT_CD = '9001' 
   AND SUBUL_DATE = TO_CHAR(SYSDATE - 1, 'YYYYMMDD') 
; 

IF  P_ITEM_CD IS NOT NULL THEN  --일별 수불장(T_DAY_SUBUL) 데이타가 존재하면  ===========> 
    --마감일자가 어제 날짜이면 상품의 현재고 UPDATE 
    IF TO_CHAR(SYSDATE - 1, 'YYYYMMDD') = '20050102' THEN 
      UPDATE T_MERCHANT_ITEM A  
      SET NOW_STOCK =   NVL( 
       ( 
 SELECT JEGO_QTY 
 FROM 
 T_DAY_SUBUL 
 WHERE 
 COMPANY_CD = '01' AND 
 MERCHANT_CD = '9001' AND 
   SUBUL_DATE = '20050102' AND 
   ITEM_CD = A.ITEM_CD 
  ), 0 
) 
      WHERE 
      COMPANY_CD = '01' AND 
      MERCHANT_CD = '9001'; 

    END IF; 
END IF;  
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 08:00 (철야) 

- 쇼핑몰 수정
- NK 테스트 서버 
\\210.123.133.221\c$ 
administrator/i3shopcvs1943 
--------------------------------------------------------------------- 

- 신상품 입고일자 수정(/BizMgr/BuyingMgr/PlacingOrderMgr/poStatP.jsp) 
0100012005010300001  --> 0100012004123000017 
  
ORA-00001: unique constraint (IIISHOP.SYS_C004479) violated 

아래 에러는 PK 중복이 발생할 때 나타나는 메시지입니다. 
즉, 같은 키를 가진 레코드가 이미 테이블에 존재한다는 얘기지요. 
프라이머리 키가 어떻게 잡혀 있는지 확인하세요. 
PK가 잡혀 있으면 PK가 동일한 레코드가 복수개 존재할 수는 없습니다. 
==============================================================================================================

System.out.println("[/MemberSvcBean.java]:[searchMyPasswd]:[SQL]===> \n"+ SQL); 
  
SELECT count(jobid) 
FROM job" 
WHERE jobdept like   '%"&jobdept&"%' " 
========================================================================================================= 

- R&F 무통장 입금 계좌 수정(/order/orderPutP_2.jsp) 
스크립트 에러 수정( 통장 8개 까지 가능) 
========================================================================================================= 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02)2187-2773 김재영 과장: 현금영수증 담당 

02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
========================================================================================================= 


- 무료회원이 킬러앱 상품 구매한 건 
※ 고객정보: 정희용 helena9411jhy 
20050104, 정희용, 0100012005010400248, 00150020 
1 - 노블레스매장 - (K)샤프 전자사전 RD-6500M() - (영어+일본어+중국어) - 179000 - 1 
------------------------------------------------------------------------------------------------------ 

ivy-i3.1004.cc(리설러: 권혁대) 
김소명(pscut/0000) *-2768419 
http://ivy-i3.1004.cc/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51&p_item_cd=00150020 
http://ivy-i3.1004.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=U02010101&p_display_cd=51&p_item_cd=00150020 
==============================================================================================================


난  00003   21  이 인 것만 가지고 오고 싶다.. 
그러니깐.. ITEM_CD가   ITEM_TP 21, 22 반복 되는게 아니고  ITEM_TP 21인 것만 가지고 오고 싶다.  
------------------------------------------------------------------------------------------------------ 

ITEM_CD ITEM_TP 
00001 21 
00001   22 
00003   21 --승인 
00004 21 
00004   22 
00005  22 
------------------------------------------------------------------------------------------------------ 

SELECT  * 
FROM <테이블> 
WHERE ITEM_TP = 21 
AND ITEM_CD in (SELECT ITEM_CD 
    FROM  <테이블> 
   GROUP BY ITEM_CD 
   HAVING COUNTt( * ) = 1 
  ) 
; 
========================================================================================================= 
  
- R&F프로모션 팝업 
/popup/RnF_P_200501.html  
------------------------------------------------------------------------------------------------------ 

- R&F 12월 프로모션 공지(팝업 내리기) 
/display/prdlist/prdlist.jsp, /display/big/bigctg.jsp 
==============================================================================================================

- 통합 수정
- 재고 조정 등록(하반기 재고 조사 재고 조정) 
2004년 12월 29일 재고 조정 
========================================================================================================= 
   
■■■■■■■■■■■■■■■■■■ 2005.01.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 08:00 (철야) 

- 쇼핑몰 수정
- 3만원미만 배송비 3천원 추가 
팬틴 트리트먼트샴푸(불륨케어)550ml*2+린스1개(00152251) 
------------------------------------------------------------------------------------------------------------- 

--거래처 코드 수정 수정 @@@@ 
-- UPDATE T_MERCHANT_ITEM 
SET ENTR_NO = '00117'    --거래처 코드('00117': i3mart, '45054': 자인) 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ITEM_CD IN ('00152251') 
; 
==============================================================================================================

- 노블레스 매장 
/display/big/bigctg.jsp?p_store_cd=S065&p_category_cd=000000000&p_display_cd=01 
- i3넷텔 
/display/main/S065/i3NettelMain.jsp 
- B2B 매장 
/display/main/b2b/mainP.jsp 
- 킬러앱 매장 
display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
- 비즈메카 매장 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=51 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00 

쇼핑몰 재 오픈 Prj
- 실서버 오픈(12:00), 버그 수정 ----> NK-7 프로젝트 오픈 
========================================================================================================= 

- i3shop.co.kr 로그인 에러 
※ 고객정보 : 서수경 ssgmall 비,번: 0000 / www.i3shop.co.kr 
※ 고객정보 : 전윤정 forenjun7  비,번이 [ tlqkf ] / www.i3shop.co.kr 
========================================================================================================= 

- 리셀러 등록 오류 
321112 - 1796311 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.01.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 01:30 

- 통합 수정
- 반품 에러(협력업체 등록) 
규수방(B0000702/4555) 
원주문번호: 0100012004123100747   
반품주문번호: 0100012004123101506 
======================================================================================================== 

- 2004년 주문_2005년 출고 데이타 출력(회계 감사용) 
--2004년 주문_2005년 출고 데이타  ===> 회계 감사용  @@@@@@@@@@ 
SELECT  B.ITEM_CD, --상품코드 
(SELECT ITEM_NM FROM T_ITEM WHERE ITEM_CD =B.ITEM_CD), --상품명 
B.QTY AS 수량, --수량 
B.TAX_YN AS 과세유무, --과세유무 
B.BUYING_PRICE AS 매입단가,    --구매가 
B.AMT AS 판매단가 --출고금액 
FROM 
    T_STOREOUT A 
    INNER JOIN 
    T_STOREOUT_DTL B 
    ON 
      A.COMPANY_CD = B.COMPANY_CD AND 
      A.MERCHANT_CD = B.MERCHANT_CD AND 
      A.STOREOUT_DT = B.STOREOUT_DT AND 
      A.STOREOUT_NO = B.STOREOUT_NO 
WHERE A.COMPANY_CD = '01' 
  AND A.MERCHANT_CD = '9001'              --점코드 
  AND A.RECV_MERCHANT_CD = '0001'         --수주점코드 
  AND A.RECV_DT < '20050101'              --수주일자 
  AND A.STOREOUT_END_DT >= '20050101'     --출고완료일자 
  AND B.QTY > 0 
ORDER BY A.RECV_DT, B.ITEM_CD ASC 
; 
======================================================================================================== 

- 배송 검수 에러(강제 검품으로 물건 내 보냄) --> 점코드 등록 잘못 
01000120050106 00197(00001) 010001 20050106 00001 
01000120050106 00202(00001) 
------------------------------------------------------------------------------------------------------------- 

--주문 정보 수정 @@@@ 
-- UPDATE T_ORDER_DTL 
SET ENTR_NO ='00117'          --거래처 변경(45054:자인물류점, 00117:i3마트) 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT ='20050106'   --주문일자 
AND ORDER_NO ='00202' 
AND ITEM_CD ='00152260' --상품코드(00152260: 팬틴) 
; 
======================================================================================================== 

- [PDA 수정]
-  입고검품 수정 
로컬로 바코드 검색 
------------------------------------------------------------------------------------------------------------- 

--입고검품 조회 @@@@@@@@@@@ 
SELECT C.BARCODE,                 --바코드 
       A.ITEM_CD,                 --상품코드 
       B.ITEM_NM,                 --상품명 
       B.MODEL_NM AS MODEL_NM,    --모델명 
       (SELECT ENTR_NM FROM T_ENTERPRISE 
       WHERE COMPANY_CD = '01' AND ENTR_NO = A.ENTR_NO) ENTR_NM,      --거래처 
       A.NOW_STOCK AS N_COUNT,     --현재고(장부 수량) 
       B.WS AS W_S,                --발주시참조판매주 
       (SELECT SUBSTR(CODE_NM, 1,1) FROM T_BASECODE 
       WHERE GROUP_ID = 'G134'AND CODE = B.SALE_STS_CL) AS SALE_STS,  --판매상태 
       (SELECT CODE_NM  FROM T_BASECODE 
       WHERE GROUP_ID = 'G133'AND CODE = B.UNIT_CD) AS UNIT_NM        --단위 
FROM T_MERCHANT_ITEM A 
   INNER JOIN T_ITEM B ON A.COMPANY_CD = B.COMPANY_CD 
         AND A.ITEM_CD = B.ITEM_CD 
   INNER JOIN T_ITEM_BARCODE C ON A.COMPANY_CD = C.COMPANY_CD 
         AND A.ITEM_CD = C.ITEM_CD 
WHERE A.COMPANY_CD= '01' 
      AND A.MERCHANT_CD = '9001' 
; 
======================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.08(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:30 

- 쇼핑몰 수정
- 상품 검색 수정(킬러앱 상품 조회 안되게 수정) 
S065: 노블레스매장, U02010102 
------------------------------------------------------------------------------------------------------------- 

- 노블레스매장(킬러앱/생필품) 
 (K)코디 파워엠보싱 24롤+6롤증정 화장지  ITEM_CD = '00009126' 
 ( U02010100: 킬러앱 매장==> U02010101:공산품, U02010102:생필품) 
======================================================================================================== 
  
- 쇼핑몰 메인 수정  
-도메인 문자 이미지 넣기 
[/top.jsp]:[topmenuPath]/main_tpl/topmenu/templete02/main.jsp 

img_text_1 = replaceDomain(domain_nm_1);  //도메인 문자 변경(t ->  img_url+/t.gif)  
------------------------------------------------------------------------------------------------------------- 

<%!   //@@@@@@@@@@     도메인 변경 함수  @@@@@@@@@@@@@@@@@ 
    public static String replaceDomain(String domain_nm)  
    {  
if ( domain_nm.equals("a")) { 
img_text = img_url+"/"+ domain_nm +".gif"; 
} 
if ( domain_nm.equals("b")) { 
img_text = img_url+"/"+ domain_nm +".gif"; 
} 
if ( domain_nm.equals("c")) { 
img_text = img_url+"/"+ domain_nm +".gif"; 
} 
if ( domain_nm.equals("t")) { 
img_text = img_url+"/"+ domain_nm +".gif"; 
} 
        return img_text; 
    } 
    //================================================================================================ 
%> 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 19:00 

- 쇼핑몰 수정
- 쇼핑몰 메인 수정(도메인 문자 이미지 넣기) 

domain_nm = domain_nm.toLowerCase(); //소문자로 변경(.toUpperCase();) 
------------------------------------------------------------------------------------------------------------- 

for( int i=1; i<=str_len; i++) { 
str_Str_len =  str_len+ "";   
String domain_nm_no = domain_nm_+""+ str_Str_len ;    //정수를 String으로 변경(형전환) 
domain_nm_no = p_req_domain_nm.substring(i-1, i); 
img_text  = replaceDomain(domain_nm_no);   //도메인 문자 변경(t ->  img_url+/t.gif) 
%><Img Src="<%=img_text%>" Border=0 ><%  
} 
========================================================================================================= 

- B2B 팝업(B2B 신년맞이 1월 감사 이벤트)  =====> 노블레스매장/ 
//display/main/b2b/mainP.jsp 
========================================================================================================= 

- 게시판 에러 
euijae.mart.cc 도메인이 쇼핑몰주인 MNO이 없어서 나는 에러  
========================================================================================================= 

- 통합 수정
- 출고 작업 지시서 출력, 바코드 출력 안됨 
0100012004123000623 
물품 확인서 출력(/BizMgr/DeliveryMgr/StoreOut/storeOutP.jsp?rmode=002)  
========================================================================================================= 

- 영업 마감 다시 돌리기 
01/04 ~ 09 
========================================================================================================= 

- 마트전용식품 백설 진한 참기름(00005115) 
일반판매가15,000   회원가 14,420      구매가 12,000 
현재재고 18개 
-------------------------------------------------------------- 

- I3SHOP 상품개발팀  053)757-9140 
남명환  071-801-0977 
========================================================================================================= 

- 이전 데이타 수정(정수기) 
0100012004082200250 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 22:00 

- 쇼핑몰 수정
- 리셀러 타운 도메인 문자 이미지 넣기 
리셀러 타운 서버(\\211.233.5.121\C$) 
administrator/i3shoprt1943 
/I3YellowEar/I3YellowWeb/ 
========================================================================================================= 

- 부가세 여부 
상품마스타관리(구버젼)에서 
백설 진한 참기름(00005115) 
일반판매가15,000   회원가 14,420      택배비 1,009 
구매가 12,000원(VAT:1200원 포함 가격) --> 과세여부(Y) 부가세(0.1)   
------------------------------------------------------------------------------------------------------------- 

1. 총계 IMU, GM 오류 수정 
초기 마진(IMU) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량)/(일반판매가*수량)]*100  
총 마진(GM) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량) - (판매수당*수량) - (직판수당*수량)/(일반판매가*수량)]*100 
점유율(PEN) = 반품액/전체 반품액*100 
2. BV, 판매수당, 직판수당 필드 추가 
========================================================================================================= 

- 입금확인 취소 
0100012005011000298 접수취소  010001 20050110 00298 
========================================================================================================= 

- 메일 에러 
첨부 파일 다운로드 불가능 
로그인 페이지로 들어감 
========================================================================================================= 
  
- R&F 01월 프로모션(겨울철 지친 피부를 위한 PV/BV up 프로모션) 
/display/big/bigctg.jsp, /display/prdlist/prdlist.jsp 
========================================================================================================= 

- 노블레스 매장 권한(/top.jsp) 
1. 마스타 이상 기존 쇼핑몰 회원 
2. 신규 CD구매 회원 설치 완료 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
- 킬러앱 매장 수정(다음차 상품공지) 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51  

- 이미지 서버 
itemPath ="/\\211.233.5.104/img/items/midimage/";   //테스트 서버(이미지) ===================================>  
System.out.println("[/itemsListByListP.jsp]:[itemPath]->"+ itemPath +"[strItemImage]"+ strItemImage);  

<Img Src="\\211.233.5.104\img\items\midimage/<%=strItemImage%>" Border=0> <!--  // 테스트 서버(이미지) =======   ----> 
========================================================================================================= 

- 통합 수정
- 제한 수량 에러 
이화순(posco1004) 
킬러앱매장에서 부안갯마을쌀 주문하려고하니 주문한적없는데 구매제한수량 오류메세지나오네요 
-------------------------------------------------------------------------------------------------- 

부안갯마을쌀: 00150568 
(K)LG 와이드형 뉴 회전 팍팍흡입구 청소기: 00151755 
(K)하기스 골드 4단계 여아용 62p×3개: 00029940 
========================================================================================================= 
  
- 수불장 에러 조회  
i3 노블레스 소프트웨어 Ver 2.0: 00152262 
i3 노블레스 소프트웨어: 00143123 
========================================================================================================= 

- [컴퓨터 사양]
모델명: Intel 팬티엄4 
CPU: Intel x86 Familly 15 Model 2 Stepping 9(2CPU) 2600MHz 
메모리: 512 DDR RAM 
HDD 용량/ 개수: 80GB(1개) 
FDD 여부: 없음 
CDrom 배속 / OOD 여부( 레코딩 가능 여부) 
ex) 64*123*12/가능 --> 삼성 SP0802N 
그래픽 카드: RADEON 9200 
사운드카드: Sound MAX Intergrated Digital Audio 
네트웍 카드: (Intel(R) PRO/100 VE 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:00 

- 쇼핑몰 수정
- 킬러앱 매장 수정 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51   
다음차 상품판매 기간: 20050112 ~ 20050125  
상품판매 기간: 20050112 ~ 20050125  
========================================================================================================= 

- FAQ 수정(/custcenter/c2cStar.jsp) 
C2C매장관련 
========================================================================================================= 

- 정수기 취소 
0100012004083111187  
대구 달서구 진천동 월배 귀빈2차아파트 201동 901호   
702250 
변경 주소 : 대구 북구 동천동 국민은행 4층 최승희 학원  
변경 전화번호 : * 
========================================================================================================= 
  
- 옥이 고모 딸 결혼식 
프린스 호텔 별관 5층 글로리아  
01월 15일(토) 14시 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30 

- 쇼핑몰 수정
- FAQ 수정(/custcenter/c2cStar.jsp) 
C2C매장관련 
========================================================================================================= 
  
- 리셀러 소개글 수정(/main_tpl/resellerGreetingP.jsp) 
* 박종순Master      yeye06 
========================================================================================================= 
  
- [웹용 PDA]
- 자바스크립트 1.1만 지원(웬만한 스크립트만 가능): 복잡한 기능 불가능 
- 세션 많이 사용 --> Hidden값 안 쓰고 세션으로 넘기기 
- html 페이지 크기 제한(250~ 500M) 
- 웬만하면 이미지 않쓰고 꼭 필요하면 gif로 만들어야 함 
- 로그인, 공지사항, 주문 배송, 수당 명세서, 매출 보기  
--------------------------------------------------------------------------------------------------------------------- 

 http://tamario.i3shop.cc/mobilePDA/loginfP.jsp 
 pda.daum.net 
 pda.interpark.com 
========================================================================================================= 
  
- 주문금액이 다른 경우(01000 20050114 00066) 
현금입금 + 사이버 머니(AR_WAY_CD01:현금으로 찍힘) 

SELECT  ORDER_DT, ORDER_NO, SPEND_CMONEY 
FROM T_ORDER_DTL 

SPEND_CMONEY(사용한 직판 수량): 135, 600 원이 찍힘 
--------------------------------------------------------------------------------------------------------------------- 

52in 산소수기 1,163,000 52in 산소수기 1,299,000 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.15(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 13:00 

- PDA 수정
- 입고 검품 수정 
jego.mdb 파일에 T_GEGO_ITEM_DTL 테이블 사용 
 http://tamario.i3shop.cc/mobilePDA/loginfP.jsp 
-------------------------------------------- 
pda.naver.com, pda.nate.com 
========================================================================================================= 

- PDA 1대 고장 
검품1 PDA(황영주 주임: 정우 하이테크) A/S 맡김 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.17(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 09:10 ~ 19:00 

- 웹용 PDA
- PDA 메인 작성 
http://tamario.i3shop.cc/mobilePDA/index.jsp 
========================================================================================================= 

-로그인 하기 
http://tamario.i3shop.cc/mobilePDA/loginfP.jsp  
========================================================================================================= 

※ 고객정보: 박재성 / pcs200301 * --> 784-3857 
삼성카드로 마트상품 (5만7천원)정도 구매하려고 하는데, 예전에도 그러던데 또 오류난다고 함! 
안심클릭결제방법으로 결제하기누르고 안심클릭창 뜨고 결제하기누르면 에러난다고 함! 
- 페이지 표시할수없습니다~ [ 배송비 ]오류 
삼성카드 4009 1355 6637 7005 4009135566377005  
========================================================================================================= 

- 지로 요금 납부(http://www.giro.or.kr): tamario/jtm339 
지로번호: 7001565(적십자 회비) 
고객번호: 20050271405800290318 체크번호: 8 
640-21-0052-309 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.18(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:40 ~ 23:00 

- 정수기 수정
- 반품 검색 
백승관 0100012003111001115 
한동수 0100012003100801066 
송영순 0100012003092700597 
0100012003091700580 
반품 검색안되게 해 주세요... 
------------------------------------------------------------------------------------------------------ 

- 반품 04로 수정 
SELECT   I3SHOP_ORDER_NO, ORDER_NO, ORDER_TYPE, ORDER_STS, DONE_STS, RETURN_DT, CASH_DT, 
                RETURN_DT, DELIVER_STS, INSTALL_STS, DELIVER_DT, INSTALL_DT,  
                ORDER_DT, FRESH_REG_DT, PROC_DT 
--  SELECT  COUNT(*) 
FROM      T_ORDER 
WHERE   (RETURN_DT IS NOT NULL) AND (ORDER_TYPE = '01') 
	AND CASH_DT> '20040901' 
; 

이정주 0100012003120901339 --> 반품주문번호: 0100012004082400065 RETURN_DT IS NULL   
0100012003120901339 01 20031209 
0100012004082400065 03 20040824 
류억형 0100012003091801273 
박길배 0100012003092300686 
임종찬 0100012003112400577 
김지현 0100012003121300033 
홍향미 0100012004021001569 
박성철 0100012003100900893 
백승관 0100012003111001115 
한동수 0100012003100801066 
송영순 0100012003092700597 
김미영 0100012004042600660 
이덕중 0100012003101001876 
정찬목 0100012003120901738 
위향랑 0100012003092401264 
이연순 0100012003112900668 
최정균 0100012003111001062 
박정자 0100012004010700340 
임종경 0100012004021200527 
이은경 0100012003122300720 
박규영 0100012004021100881 
심미정 0100012003110800821 
송동연 0100012003111200725 
정일욱 0100012003110300937 
회수 완료건입니다. 반품 04로 수정바랍니다.^^* 
========================================================================================================= 

- 제품일련번호 
a/s 접수건 제품일련번호 안보임.. 
보이게 해주세요....  
========================================================================================================= 
  
0100012004021202748 --> 반품주문번호: 0100012004021300475 RETURN_DT = '20040216' 
0100012004031101064   --> 반품주문번호: 0100012004031101076 RETURN_DT = '20040312' 
0100012004032600658 --> 반품주문번호: 0100012004032600667 RETURN_DT = '20040327' 
0100012004042900563 --> 반품주문번호: 0100012004042900569 RETURN_DT = '20040504' 
0100012004060600517 --> 반품주문번호: 0100012004060700567 RETURN_DT = '20040608' 
가용 반품건들입니다.^^* 
========================================================================================================= 
  
- 상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
T_CLOSE_DEPART 테이블 --SELLING_DT(매출일자) 
현금: 입금확인 
카드: 주문과 동시에 생성 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.19(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00 

- 웹용 PDA
- PDA 메인 작성 
http://tamario.i3shop.cc/mobilePDA/index.jsp 

-로그인 하기 
http://tamario.i3shop.cc/mobilePDA/loginfP.jsp  
==================================================================================================== 

1.NK-7 연장선상의 프로젝트 모델개발 
-모바일 환경 쇼핑몰 구현 
-모바일 회원가입 용이성 
-무선인터넷 결제 제공 
-다양한 정보제공(수당명세서,회원관리) 
-카메라폰 통한 화상전화 제공 
-넷스팟존의 무선 PtoP 환경 구현 
========================================================================================================= 

- 노블레스CD 구매 약관 
상세보기(/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010601&p_item_cd=00152262&p_display_cd=11) 
노블레스CD 구매 약관(/order/rnf/articleAgreeNB_CD.jsp)  

- i3 노블레스 소프트웨어 Ver 2.0: 00152262 
 고객정보 : 서수경 ssgmall 비,번: 0000 / www.i3shop.co.kr 
==============================================================================================================

- 2005년 설 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V92000000&p_display_cd=51 
--> /display/event/V92000000/categoryP.jsp 
- 카테고리별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V92010101&p_display_cd=55 
--> /display/event/V92010100/categoryP.jsp 
- 가격대별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V92010301&p_display_cd=55 
--> /display/event/V92010300/categoryP.jsp 
-  상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V92010101&p_display_cd=55 
--> /display/prdlist/tpl/type55/itemListP.jsp 
========================================================================================================= 

- 2004년추석 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V62000000&p_display_cd=51 
--> /display/event/V62000000/categoryP.jsp 
- 카테고리별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V62010100&p_display_cd=51 
--> /display/event/V62010100/categoryP.jsp 
- 가격별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V62010300&p_display_cd=51 
--> /display/event/V62010300/categoryP.jsp 
- 상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=V62010301&p_display_cd=56 
--> /display/prdlist/tpl/type56/itemListP.jsp 
==============================================================================================================

- 수도 검침 
수용가 번호: 100-1950 
동명: 신천4동 461-4 
담당자 HP)016-414-1637  Tel)951-0091  953-0091 
------------------------------------------------- 
2004년 12월 2247 
2005년 01월 2252 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.01.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 정수기 수정
- VB에서 NULL값 처리 
==================================================================================================== 

- 공인인증서 에러 
최영남 /i3ibs01  *-2650211 
-이메일 주소가 미기재되었다고해서 현재는 회원정보란에 
이메일주소 기재해두었습니다  
==================================================================================================== 

- 아이비 : gu123 구영선 
----> 등록할때 전화번호를 안 넣어서, 인증서 다운로드가 안된다고 합니다. 
==================================================================================================== 

- PDA 사양
- PDA1 대체 장비  
- Unitech PDA960 
인증번호: E-A900-04-XXXX(A)  
--------------------------------- 
IP: 211.33.193.131 
SN: 255.255.255.0 
GW: 211.33.193.254 
DNS: 211.233.5.93(168.126.63.1)  
==================================================================================================== 

SELECT * 
FROM T_STARTUP 
WHERE SN LIKE '%02139%' 
; 
==================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.21(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00 

- 웹용 PDA
- 주문 배송(완료) 
http://tamario.i3shop.cc/mobilePDA/orderlist.jsp 

- 네트웍 연결 설정 
KTF CDMA 설정 
==================================================================================================== 

- 정수기 수정
- 후레쉬 이관 
(주)후레쉬 안세희 차장님  031-763-1413 
콜센타 이상영 031-763-1431 
- 20050119일 12건 이관 확인 
==================================================================================================== 

- VB에서 NULL값 처리 
보통 비베의 콘트롤 들은 널 값을 지정 하지 못 합니다. 특히 text Box 같은 경우 
그래서 코딩 할때 TextBox에 디비 값을 치환 하기 전에 빈문자 열인 "" 를 스트링 연결 연산자를 사용해서 합쳐서 치환 합니다. 

textbox.text = "" & data1.recordset.field("상호")  
.TextMatrix(Lng_Loop, 14) = Trim("" & Rs(14))   '배송메세지 
==================================================================================================== 
 
- PDA 수정
- PDA_재고List 수정  
MODEL_NM 필드 빈문자열 허용 체크 바람 
--------------------------------------------------------------- 

- 날짜 전환 함수 
SELECT  TO_CHAR(TO_DATE('2003-08-07 16:50:55', 'YYYY-MM-DD HH24:MI:SS'),'YYYYMMDD') FROM DUAL ; 
  
 ,TO_CHAR(TO_DATE(C.REG_DT, 'YYYY-MM-DD HH24:MI:SS'),'YYYYMMDD') 
==================================================================================================== 

- 쇼핑몰 수정
- 무료회원 email 발송 
arromi *@*.* 
==================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.22(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30 

- PDA 수정
- PDA 재고 프로그램 설치 교육(자인방문) 
==================================================================================================== 

- PDA_재고List 수정 
MODEL_NM 필드 빈문자열 허용 체크 바람 
==================================================================================================== 
 
- 칼럼 추가[add column]  ======> DB 칼럼 추가 
-- 칼럼 추가  --------- 
ALTER TABLE T_ITEM_BARCODE ADD (  
REG_DATE    CHAR (8) --바코드 등록일자 
); 
==================================================================================================== 

- 상품마스트 구버전(/BizMgr/ItemMgr/itemP.jsp) 
- 바코드 등록(/BizMgr/ItemMgr/itemBarcodeEditP.jsp) 
-------------------------------------------------------------------------------------------------- 

SELECT * FROM T_ITEM_BARCODE 
WHERE ITEM_CD ='00135942'   --상품코드           바코드: 8809078830366 
; 
==================================================================================================== 

- 구TM 에러 
호스트로의 회람이 없습니다. 
지금 보내드리는 파일을 구Tm설치 폴더에다가 
덮어 쓰시면 되겠습니다. (TM_Client.exe) 
==================================================================================================== 

- 공인인증서 에러 
이선숙    iss1004    
공인인증서 전화번호 입력안되어 처리 안된다고 오류나신다고합니다. 
조치후, TM부탁드리겠습니다.- 
==================================================================================================== 

- 하나로 통신 
***6546540 
==================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 상품검색부분(/main_tpl/top.jsp) 
검색Box - 인기검색어, 광고 노출 
------------------------------------------------------------------------------------------- - 

- 내가 본 상품(상위 5개 상품) 
http://www.bonagirl.com/Templets/main1.aspx 

- 쇼핑몰 메인(idex_t.html) 
http://tamario.i3shop.cc/index_t.html 
==================================================================================================== 

- 웹용 PDA 회의(14:00 ~ 18:00) 
==================================================================================================== 

- 현금 영수증 발급(Tax point) 
현금 영수증  승인, 취소(승인번호 생성, 전송, 수신) 
현금 매출영수증 발급(오즈 리포트) 
현금 영수증 조회 
==================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2005.01.25(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
-  2005년 설매장 퀵보드 
노블레스, L&B, R&F, I3마트, C2C 
=================================================================================================== 
  
- 공인인증서 에러 
 이강수   i3sindo01  
공인인증서 전화번호 입력안되어 처리 안된다고 오류나신다고합니다. 
=================================================================================================== 

- 고객정보: 박재성 / pcs200301 
삼성카드로 결제하려고하니 또 에러난다고 함! 
1/17일날로 에러나서 담당자분 전화오셨을때 다시 결제해보라고 해서 결제했더니 됐었는데, 
이번에는 또 다른 오류메세지 확인된다고 함! 
*->AA ADDORDERINFO 주문일시에 에러입니다. 관리자문의하세요~ 

- 삼성카드 4009 1355 6637 7005  
* 확인후 연락-> 안효진 02-788-2431  * 
확인후 다시 상담부탁드려요 수고하세요. 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.26(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 22:30 

- 쇼핑몰 수정
- 무료회원 email 발송 수정(PV, BV 제거) 
String url = "http://" + serverIp + "/inquiry/orderMailP.jsp?p_order_dt=" + p_order_dt 
+ "&p_order_no=" + p_order_no + "&p_mno=" + p_mno + "&p_domain_nm=" + p_domain_nm+ "&p_memgbn=" + memgbn; 
System.out.println("[/orderPutP_4.jsp]:[url] @@@@@@@@@@@@@@@@==>"+ url); 
--------------------------------------------------------------------------------------------------------------- 

url은 세션이 끊어 지므로  p_memgbn 추가 하고 아래와 같이 받음 
String p_memgbn = request.getParameter("p_memgbn");  //회원구분(01:무료회원, 02:리셀러, 03:직원, 04:가상회원) 
--------------------------------------------------------------------------------------------------------------- 

http://jinjin.town.cc (phew / wmf9025)  
=================================================================================================== 

- 장바구니 분석 
T_CART  
=================================================================================================== 

- 공인인증서 에러 
공인인증 다운받을때, 전화번호 오류로 인한 건 입니다. 
 jesus1009 최봉임 회원번호 : 668340 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 리셀러 회원 가입 수정 
전화번호, 핸드폰 필수 
--------------------------------------------------------------------------------------------------------------- 
회원ID 83821 전수임  
--> 공인인증 받는데, 이메일 에러라고 하면서 받기가 안된다고 하십니다. 
=================================================================================================== 

- 카테고리 수정 
=================================================================================================== 

- 기타 카드 에러 수정 
TERMINAL_NO에 i3shop이 찜힘, 아래 부분 주석 처리(삭제) 
이벤트 결제인지 확인하여 이벤트 결제시 해당 PG사의 해당 상점으로 보낸다. 
--------------------------------------------------------------------------------------------------------------- 

- * 최영화Silver-M    vip5901 
사용카드 : 시티카드 
카드번호 : 4404454258501009 
* // 김종섭 
--------------------------------------------------------------------------------------------------------------- 

위 카드로 결제를 하게되면  미등록 가맹점이라는  
메세지가 나오고 결제가 안된다고함. 
확인후 연락드리기로함.  
=================================================================================================== 

- 국민카드(9410468398418016) 2007 08 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 현금 영수증 TB 생성 
ALTER TABLE T_CASH_RECEIPT ADD ( 
	  RETRUN_DT CHAR(8) NULL, -- 반품일자 
	  REG_ID VARCHAR2(20) NULL, -- 등록자ID  
	  REG_IP VARCHAR2(20) NULL, -- 등록자IP  
	  REG_DT DATE -- 등록일  
 );  
--------------------------------------------------------------------------------------------------------------- 

INSERT INTO T_CASH_RECEIPT () 
--------------------------------------------------------------------------------------------------------------- 

- 주문배송 상세 조회(/inquiry/orderMasterP.jsp?p_page=1&p_order_dt=20040908&p_order_no=00171) 
=================================================================================================== 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02)2187-2773 김재영 과장: 현금영수증 담당 
=================================================================================================== 

* 오현경Gold-M    /  24call03 
BC카드 사용 
카드번호 : 4553253031182635 
카드결재가 안된다고함... 
오류메세지 : 카드승인실패.  거래타임아웃으로 계속나온다고함. 
확인후 연락드리기로함 
--------------------------------------------------------------------------------------------------------------- 

거래TIME-OUT: 
PG사에서 공인인증 기관에 보낸 응답 메세지가 
5초 내로 안 오면 에러가 남 
이 경우 공인인증 기관에 시스템 에러일 경우가 많다고 합니다. 
(오늘건은 BC카드 공인인증건이 오전 11시쯤 시스템 에러를 일으켰다고 합니다.) 
--> 해당 카드사 문의 바람 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:30 

- 쇼핑몰 수정
- 현금 영수증 수정 
1. 현금영수증_VB(조회) 
=================================================================================================== 

- 배송정보 텍스트 깨짐 
1. 물품 확인서 출력(/BizMgr/DeliveryMgr/StoreOut/storeOutP.jsp?rmode=002) 
--------------------------------------------------------------------------------------------------------------- 

- 배송정보 수정 @@@@@@@@@ 
-- UPDATE T_ORDER 
SET  RESELLER_NM = '박금선', 
RECEIVER_NM = '박금선', 
FIX_ADDR = '서울 은평구 응암동', 
DTL_ADDR = '99-48 2층' 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT = '20050128'  
AND ORDER_NO ='00321' 
AND REG_ID = 'pks126' 
; 
=================================================================================================== 

※ 고객정보: 김순연 /nanum01 
* 농협비씨카드 : 9410 1126 9647 4509  ( *->카드소유자 // 김대래 dr4801) 
노블CD구매하려고 해서 공인인증서 다 받고, ISP결제등록해서 결제하려고 하는데,  
제일 마지막창에가서 결제누르면 계속 승인실패라는문구가 확인된다고 함!  
--------------------------------------------------------------------------------------------------------------- 

에러: 주민번호와 인증서 소유자 불일치 
더 자세한 사항은 농협비씨카드에 본인이 문의를 해야 됩니다. 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.01.31(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 01:30 

- 쇼핑몰 수정
- 서버 속도 느림 
L4 장비 고장(14:00 ~ 03:00): 로드 발란스(.111, .112, .113) 해주는 장비 고장 
--> 마감 연기 
--------------------------------------------------------------------------------------------------------------- 

* 나영훈Active-Master  /   i3chang04 
엘지카드 사용... 
주문처리중이니 잠시만 기다려 달라고 확인되거나 로그인하라는  
메세지가 반복적으로 확인된다고함. 
카드번호 : 4009333541191019 
확인후 연락드리기로함.    
--------------------------------------------------------------------------------------------------------------- 

--> 쇼핑몰 속도 느림 
=================================================================================================== 

- 통합 수정
- 주간업무 보고서 수정(/BizMgr/ReportMgr/WeekleyReport/WeekleyReportP.jsp) 
상세 내용 필드 추가 
=================================================================================================== 

- 칼럼 추가[add column]  ======> DB 칼럼 추가  
--ALTER TABLE T_WEEKLEYREPORT ADD (  
ALTER TABLE T_WEEKLEYREPORT MODIFY (  
	REMARK_DETAIL    VARCHAR2(4000) --상세내용 
);  
==================================================================================================== 

- 정수기 수정
0100012003100901516 --> 반품주문번호(0100012005011700445) 삭제 
이순나/신형대 
--------------------------------------------------------------------------------------------------------------- 

- 필터 교환권에 AS 달기 에러(달면 안됨) 
0100012005011800275  
AS 주문번호(14703) 삭제 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■