

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.06.01(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 

- 쇼핑몰 수정
- 클로렐라면 포스터 공모전 최종 수정 
==============================================================================================================

신금자    nageumjada    Member   
공인인증서 다운로드 받는데.."상세주소 미입력으로 오류 발생한다심 " 콜센터로 문의하라고 나온다고 합니다. 
조치후, 메세지 전달 부탁 드리겠습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
적립된 사이버머니(p_own_cmoney)  --> p_cybermoney 
지불 사이버머니(USE_CMONEY)   
==============================================================================================================

- 상품 상세 수정 
RM머니 존재 상품 수당 미발생 공지 이미지 보이기 
==============================================================================================================

- 비즈메카 매장 PV, BV, 뱅크PV 제거 
00143460: 에어스텔 공기청정기  ===> 노블레스매장(비즈메카매장), R&F매장  
==============================================================================================================

- 현대 중공업 안에  
다이아몬드 호텔  2시 --> 9~10시  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.03(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 20:00 

- 쇼핑몰 수정
- 카드BIN 데이타 DB이관 
-- 848개 중 --> 843개 신용카드BIN 정보(T_CARD_BIN)를 삽입함 
-- 중복 데이타 
4670-06 롯데 
9410-07 수협 
9410-07 수협 
4658-89 수협 
4599-505 외환 
5405-28 현대  
==============================================================================================================

- 김진혁 대리 프린터 
\\210.123.133.148(진태만/tama12) 
-노은주 주임 프린터 
\\210.123.133.185(노은주/9035)  
==============================================================================================================

- LG카드 무이자 오류 
LG카드무이자행사로 구매한 주문건들인데 무이자결제가  
안되었다고 전화주셨어요.. 확인부탁드립니다.  
이경미    sou01 
주문번호 : 0100012005051600472/0100012005052500100/0100012005060200082 
카드번호 : 4220-1610-1704-7008 
--------------------------------------------------------------------------------------------------- 

오류 원인: 나이스 정보통신에서 LG카드를 인식하는 CARD_BIN DB가 업데이트 되지 않아서 발생  
처리 결과: 나이스 정보통신으로 부터 최신 CARD_BIN 데이트를 받아서 업데이트 함 
할부 취소 여부는 기획팀 박인영 대리가 LG측과 협의 한다고 합니다. 
문제점: 가맹점 코드: 3597  --> 가맹점 코드: 2023로 타야 정상 
==============================================================================================================

 - 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

- 정수기 수정 
0100012004032600675  --> 0100012005052400129(반품 주문번호) 
...통합에는 반품접수 되어있는데~ 
정수기 전산에 반품으로 표시가 안되어있습니다~ 
확인부탁드립니다~ 
==============================================================================================================

- 현금영수증 수정 
개인식별 항목에서 신용카드 제외 
==============================================================================================================

- BC카드 KS넷 모듈 분석 
- 김명석 과장(3420-5916 *)  ===> 사업부 
ISP기준 모듈((주)KS넷) 
3420-6807  윤영환 
3420-5922  왕정근 대리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00 

- 쇼핑몰 수정
- BC카드 모듈 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.07(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
- BC카드 모듈 분석 
BC카드 TOP포인트 조회 - 5천 포인트 이상 사용 
http://www.bccard.com 
==============================================================================================================

- jsp에서 문자를 숫자로 변경 
String strMoonja =""; 
int rprice = util.parseInt(strMoonja); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
==============================================================================================================

ISP결제 
1. 국민, 2. BC 3. 우리,평화 4. 조흥 
------------------------------------------------------------------------------------------------- 

- BC카드(강금순 주임) 
ISP: hope0404 
==============================================================================================================

%%   김자영   erom02    Active-Master 
세션설정.쿠키삭제등 로긴 안될때 하는 것들 다 설정했고 재부팅도 했는데...  
전혀 로긴되지않고.. 재로긴 화면만 계속적으로 나오며 장바구니에 상품도 안담긴다고하심 ㅡㅡ;;; 
당사 사이트 문제가 아니라.. 회원님 컴퓨터 점검 안내드려도 다른사이트 다 되는데  
왜 당사 사이트만 안되냐고 항의 너무 심하셔서 대화가 불가함  * 
-------------------------------------------------------------------------------------------------

전화를 해보니 옆자리에서 주문을 했다고 하네요... 
통화를 하니깐 앞으로 자기가 알아서 한다고 하네요... 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 22:00 

- 쇼핑몰 수정
- 장바구니 수정 
==============================================================================================================

- BC카드 수정 
수당상품구분 분개(01:일반상품, 02:R&F상품) 
==============================================================================================================

- '52in산소수기 필터관련 안내' 구매 못 하도록 수정 
0100012005053000560  
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010101&p_item_cd=00142161&p_display_cd=11 
==============================================================================================================

- PDA 입고 관리 수정 
바코드 저장시 MODEL_NM 작은 따옴표 수정(대치) --> 00152338 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
==============================================================================================================

- 카드오류건 
이동준     zzzinie 
롯데카드 : 4670-0712-3252-7004   
[500인터널서버에러] 
------------------------------------------------------------------------------------------------------------------------------
====> 원인: 월 사용한도 초과 
==============================================================================================================

- ISP결제 
1. 국민, 2. BC 3. 우리,평화 4. 조흥 
------------------------------------------------------------------------------------------------------------------------------

- BC카드(강금순 주임) 
9410 3170 1934 7627(9410317019347627) 
ISP: hope0404 
상점번호: 2999199999(테스트)  --> 2002100297(실 서버) 
Message1=[승인전문오류    ] 
Message2=[ISP인증오류     ] 
==============================================================================================================

00154855 (K)하기스골드 3남 72*3팩(신형) 
GICHO_QTY AS 기초재고, JEGO_QTY AS 재고수량, IPGORET_QTY, CHULGO_WONGA 

20050609 
기초재고: 264 
재고수량: 253 

20050609 
기초재고: 264 
재고수량: 253 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.13(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- BC 카드 오류 수정 
BC카드 오픈 
개인당 월 BC카드 사용 정보 수정(가맹점코드 추가)--> TERMINAL_NO 
==============================================================================================================
  
- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
R&F상점 아이디: 2002100297/32871 
------------------------------------------------------------------------------------------------------------------------------

- BC카드 KS넷 모듈 분석 
- 김명석 과장(3420-5916 *)  ===> 사업부 
ISP기준 모듈((주)KS넷) 
3420-6807  윤영환 
3420-5922  왕정근 대리 
==============================================================================================================

- 나이스 결제 확인 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

- 중복승인 추정내역 
같은 카드번호나 금액으로 들어 와서 중복 수정이 의심하는 내역 
가맹점에서 관리할 필요가 없음 
가맹점에서 거래내역 관리, 거절내역 관리만 조회 
==============================================================================================================

* 문정현 / numam   [ 무료회원 ] 
롯데카드 번호 : 9409130104704039 
안심클릭 등록했다고함. 
카드결재가 계속적으로 안된다고함. 
안심클릭 비번입력하라는창도 뜨지않고...  
계속적으로 처리진행중입니다.잠시만 기다려 주세요.란 부분에서 멈춰있다고함.  
확인후 연락드리기로함.   * 
==============================================================================================================

- L&B 상품 BC카드 결제 오류 
0100012005061300143 
34,900원 주문(마트상품) 
==============================================================================================================

- 공인인증서 결제(2,200원) 
정해원PM * 
==============================================================================================================

- KS넷 모듈 재 등록(UNIX계열 서버) 
[root@i3shop_ccdom1 root]# cd /  
[root@iiishop_ccdom1 /]# cd home/i3shop/ksnet1  
[root@iiishop_ccdom1 /]# ps -ef  grep ipgClient ---> 데몬이 살아 있는 지 확인 
[root@i3shop_ccdom1 ksnet1]# ps -ef  grep ipgClient 
root     14089     1  0 16:01 ?        00:00:00 ./ipgClient 29991 210.181.28.137    <----- 떠 있음 
root     14117 13784  0 16:03 pts/1    00:00:00 grep ipgClient 
[root@iiishop_ccdom1 /]# ./sc ---> 데몬이 띄우기  
------------------------------------------------------------------------------------------------------------------------------

- 서버를 재부팅 할 때 
- 111번 부터 117번 까지 모두 적용해야 함 
==============================================================================================================

- 매치머니 에러 
김해선   0010 
20050607, 김헤영, 0100012005060700372, 20050608 \57,970 
1 - L&B매장 - 키카(키카장갑)() -  - 29000 - 1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- BC 카드 오류 수정 
가맹점 화면에서 한글 깨어지는 것 수정(/CardPayForISP.java) 
한글 전환된 걸 다시 전환하면 안됨 
------------------------------------------------------------------------------------------------------------------------------

public Hashtable approvalKSNET_ISP(Hashtable arHash, Hashtable inputHash) throws Err { 
String UserName  = memnm ; //*주문자명 
//UserName = new String(UserName.getBytes("8859_1"), "KSC5601"); 
System.out.println("[/CardPayForISP.java]:[approvalKSNET_ISP()]:주문자명["+memnm+"], 카드번호["+cardno+"]"); 
} 
==============================================================================================================

- i3shop 모바일(월수당 내역) 수정  @@@@@@@@@@@@@@@ 
차분이RM coca6/22060 
<wageitem>     
	<name>AM 수당</name> <!--수당명--> 
	<date>20030930</date> <!--지급일 (yyyymmdd)-->  
	<approve>29,238</approve> <!--승인총액--> 
	<redeem>0</redeem> <!--환수금--> 
	<incometax>877</incometax> <!--소득세--> 
	<inhabtax>87</inhabtax> <!--주민세--> 
	<hostingfee>0</hostingfee> <!--호스팅비--> 
	<deduct>0</deduct> <!--기타 공제--> 
	<total>28,273</total> <!--공제 후 총액-->    
</wageitem> 
==============================================================================================================

<wageitem>     
	<name><%=util.getData("ALLOWANCE_NM",rowHash)%></name> <!--수당명--> 
	<date><%=util.getData("PAY_DT",rowHash)%></date> <!--지급일 (yyyymmdd)-->  
	<approve><%=util.HanMoney(p_KWASE)%></approve> <!--과세표준-->  
	<incometax><%=util.HanMoney(p_incometax)%></incometax> <!--소득세--> 
	<inhabtax><%=util.HanMoney(p_inhabittax)%></inhabtax> <!--주민세--> 
	<hostingfee><%=util.HanMoney(p_gen_deduct)%></hostingfee> <!--공제1--> 
	<deduct><%=util.HanMoney(p_etc_deduct)%></deduct> <!--공제2--> 
	<total><%=util.HanMoney(p_supply_amt)%></total> <!--실지급액-->    
</wageitem> 
===================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.15(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 

- 쇼핑몰 수정
- i3shop 모바일(월수당 내역) 수정  @@@@@@@@@@@@@@@ 
==============================================================================================================

- 장바구니 수정 
1. 장바구니 ==> 일시품절 또는 판매종료된 상품 이 장바구니에 
표시되었는것은 알겠으나.. 장바구니에서 취소처리를 하지 않으면 
결제쪽으로 안넘어가도로 변경요망 

2. 찜하기 --> 유형별로  찜하기가 안됨  변경요망 
찜하기에서 쇼핑하기 누르면  바로 전 화면 또는 각 매장 메인 또는  
(매장메인이 없는경우) 첫카테고리로 이동요망 
==============================================================================================================

 수고많으십니다..  
이분 로그인하면 이상하게 쇼핑몰에 뜹니다.. 확인부탁드립니다.  
로그인 했는데도.. 쇼핑몰에 로그인하시기바랍니다라고 떠요 
아이디 : anje0  / 비밀번호 : *1783210 
==============================================================================================================

- 신세계 씨티뱅크 카드,  
카드번호: 4743 6040 1265 5554 
-->이건은 결재할때, 안심클릭이나 ISP인증은 아니자나요~ 
기타신용카드로 해서 결재했는데, 할부기간 오류 9503 이렇게  
멘트가 나온답니다.. 
------------------------------------------------------------------------------------------------------------------ 
---> 한미카드 같은데요...............안심클릭으로 결제 해보라고 하세요... 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.16(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 장바구니 수정 
같은 ID로 2명 이상이 로그인 시 문제 
------------------------------------------------------------------------------------------------------------------ 

- 빈 컴포넌트의 Scope   
1. page 영역: 빈 객체의 수명은 한 페이지 내에서만 유지 
2. request 영역: 생성된 빈 객체를 request 객체에 저장하거나 request 객체로 부터 찾아서 참조 
3. session 영역: 세션이 유지되는 동안에는 같은 세션에서 호출되는 모든 페이지에서 빈 객체는 소멸되지 
않고 유지 
<jsp:useBean id="cart" class="com.i3shop.beans.BizStore.CartBean" scope="session" /> 
4. application 영역: 생성된 빈 객체는 JSP 컨테이너에 의해 소멸되지 않고 유지  
==============================================================================================================

- 중복로그인을 체크중입니다. 
로그인시 Hashtable에 유저 아이디와 세션객체를 저장했습니다. 
그리고 session.setAttribute( session.getId() , this.getInstance() )로  
세션정보를 저장했습니다. 
A사용자가 로그인 후 B사용자가 같은 id로 로그인시 
중복로그인이 되었다는 메시지는 나오는데 
여기서 어떻게 하면 처음 사용자인 A의 세션을 죽일 수가 있을까여? 
세션ID가지고 처음 사용자의 세션만을 죽일 수가 있나요? 
==============================================================================================================

0100012004040700406 
이건 배송/설치건인데~ 이관이 안된다는데요~  
제가 7일날 이전데이타 업 했는데~  
확인부탁드립니다~  
------------------------------------------------------------------------------------------------------------------ 

0100012004021200909 
김순연 
==============================================================================================================

- 로그인 안 했을 때 
[/cartPut.jsp]:[util.iMNO_0]false 
[/cartPut.jsp]:[cart.getLogin]false 
[/cartPut.jsp]:[session.getId()]HDFGODFAJEPJ 

- 로그인  했을 때 
[/cartPut.jsp]:[util.iMNO_0]true 
[/cartPut.jsp]:[cart.getLogin]false 
[/cartPut.jsp]:[session.getId()]HDFGODFAJEPJ 
==============================================================================================================

- 같은 ID로 2명 이상이 로그인 시 문제 
[/cartPut.jsp]:[MNO]92201 
[/cartPut.jsp]:[getSesValue.MNO]true 
[/cartPut.jsp]:[cart.getLogin]true 
[/cartPut.jsp]:[session.getId()]HDFGODFAJEPJ 
==============================================================================================================

- 같은 ID로 2명 이상이 로그인 시 문제 
[/cartPut.jsp]:[MNO]92201 
[/cartPut.jsp]:[getSesValue.MNO]true 
[/cartPut.jsp]:[cart.getLogin]true 
[/cartPut.jsp]:[session.getId()]BAHKFEFAJEPJ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 장바구니 수정 
같은 ID로 2명 이상이 로그인 시 문제 
==============================================================================================================

* 신동식 / sinds   [ 무료회원 ] 
농협BC 5377 1127 4102 4175(5377112741024175)  
대리님...고객이 카드번호 잠못 불러줬다고 하시네요~~ 
위 카드번호가 맞습니다~~ 수고하세요...  
==============================================================================================================

- OKoutdoor(등산용품점) 
대구 교대점 영업시간  
평일/주말/공휴일 : 10시 30분 ~ 20시 30분(연중무휴)  
문의전화 : 053-472-1172 
http://www.okoutdoor.com/product/view.html?set=&p_category_id=B&category_id=BA&no=2898   --> 67,000 원 
==============================================================================================================

주문자 : 김미현  
1,540,500원  2005-06-17 오후 05:44:17 
1,007,500원  2005-06-17 오후 05:25:27 
  
개인당 월 BC카드 사용  
==============================================================================================================

drink_01.jpg 
crab1_01.jpg 
clorela3_01.jpg 
==============================================================================================================

p_item_cd 
p_tp_no,             --유형번호 
p_tp_dtl_no,     --유형상세번호 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 24:00 

- 쇼핑몰 수정
- 장바구니 수정 
같은 ID로 2명 이상이 로그인 시 문제 
==============================================================================================================

최명자      dohan01 
R&F상품 구매하는데 가맹점 오류라고 뜨면서 결재가 안된다고하세요.. 확인부탁드립니다. 
카드번호 : 9410-0658-6690-4053 국민BC 
9410065866900000 
--------------------------------------------------------------------------------------------------------- 

배은진      pkpkll      무료회원 
안심클릭 등록했고, 비밀번호 누르고 다음 화면이 넘어가지 않고 자꾸 취소가 된다고 하심! 
카드번호: 4518-4400-7205-9731  
카드사에 문의하니, 카드에는 이상없다고 했다심! 
--------------------------------------------------------------------------------------------------------- 

- 안심클릭 신용카드 팝업 에러 대처 방법 
원인: 2005년 초에 나이스에서 안심클릭 업데이트를 하면서 창이 띄면서 보안 점검 하는데  
이때 반드시 예(Y) 체크 해야만 안심클릭 창이 띄게 됨 
대처: 
1. OS가 XP Home Editon 이면 
브라이저(IE6.0) -> 도구(T) -> 팝업차단(P) -> 팝업차단 설정 안 함으로 설정 
2. 기타 OS 이면 
주문할 때 안심클릭 체크 후 다음을 누르면 창이 띄면서 보안 점검 체크 여부를 물으면 
반드시 예(Y) 체크를 한다. 
==============================================================================================================

- BC카드 결제 에러 
yjmi3   조영현 * 
승인거절C잠시후재시도  ---> KSNET과 소켓 통신이 제대로 안 이루어져서 나는 에러 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.21(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 

- 쇼핑몰 수정
- 장바구니 수정 
다중 삭제 오류 
==============================================================================================================

김정훈    kims77 
5543-4940-8799-0105 국민 카드결재시 오류난대요.  
확인부탁드립니다. 금액은 \1299,000 이구요 
==============================================================================================================

- 정수기 입력 오류 
0100012003111001750..주문건에...2004년 10월1일날 a.s접수한건있는데요...~  
0100012003111001654 주문번호로  수정가능한가요?? 
0100012003111001750...은..아직 설치안한건인데..접수를 제가 잘못한거 같거든요~  
확인해 보시고 쪽지 부탁드립니다~ 
--------------------------------------------------------------------------------------------------------- 

0100012003111001750건요..배송 받은걸로 나오는데. 
저희 엑셀자료 확인결과..배송+설치 안받은걸로 나오건든요~ 
배송 받은거...삭제 가능한가요??? 
--------------------------------------------------------------------------------------------------------- 

-- 상품 주문정보 삭제  ==========> @@@@@@@@@ 
-- DELETE T_ORDER_PRODUCT 
WHERE ORDER_NO = '12521' 
; 
--------------------------------------------------------------------------------------------------------- 

-- 주문정보 삭제  ==========> @@@@@@@@@ 
-- DELETE T_ORDER 
WHERE  I3SHOP_ORDER_NO = '0100012003111001750' 
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
사이버머니에 따라 장바구니 분리 
==============================================================================================================

- 장바구니 문제점 발생.. 
엘엔비 찜하기 에서 쇼핑계속하기 누를시 에러남... 
장바구니에서 한가지 상품 판매상태 변경시(inactive, delete)시 장바구니 전상품이 일시품절이라는 문구나옴... 
==============================================================================================================

- 승인거절C잠시후 -->  
Server로 부터 응답이 없을시 자체응답(KSNET 서버의 응답이 없음) 
===> ipgClient가 제대로 떠있는지 확인(7대 서버) 
------------------------------------------------------------------------> 

 - KS넷 모듈 재 등록(UNIX계열 서버) 
[root@i3shop_ccdom1 root]# cd /  
[root@iiishop_ccdom1 /]# cd home/i3shop/ksnet1  
[root@iiishop_ccdom1 /]# ps -ef  grep ipgClient ---> 데몬이 살아 있는 지 확인 
[root@i3shop_ccdom1 ksnet1]# ps -ef  grep ipgClient 
root     14089     1  0 16:01 ?        00:00:00 ./ipgClient 29991 210.181.28.137    <----- 떠 있음 
root     14117 13784  0 16:03 pts/1    00:00:00 grep ipgClient 
[root@iiishop_ccdom1 /]# ./sc ---> 데몬이 띄우기 
------------------------------------------------------------------------------------------------------------- 

- 서버를 재부팅 할 때 
- 111번 부터 117번 까지 모두 적용해야 함 
==============================================================================================================

- 삼성카드   =============> 김진혁 대리 
4009 1311 0196 9729(4009131101969729) kyeogie1 
200906/0159 
CVC: 362 
720720 - 1797816 
==============================================================================================================

- 삼성카드  =============> 이정애 
4009 1311 0133 8271(4009131101338271) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.23(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 노블레스 패키지 분석(회의, 분석) 
==============================================================================================================
  
- 노블레스 팩키지등록 
00156770:노블패키지1(노블CD+휴대폰) 
00156771:노블패키지2(노블CD+G/W+전화기) 
--상품코드(00156770:노블패키지1(노블CD+휴대폰)00156771:노블패키지2(노블CD+G/W+전화기)) 
==============================================================================================================

- 날짜 세팅(JSP에서) 
Date date = new Date();  
java.text.SimpleDateFormat formatter = new java.text.SimpleDateFormat("yyyy/MM/dd"); 
p_calc_stdt = formatter.format(date); //날짜 가져오기 
==============================================================================================================

- SEQ 넘버 세팅 
SELECT RESELLERJOIN_SEQ.nextval, A.* 
FROM T_MONTH_TFT_REAL A 
------------------------------------------------------------------------------------------------------------------------

- 시퀀스 삭제, 생성 
DROP SEQUENCE IIISHOP.RESELLERJOIN_SEQ; 

CREATE SEQUENCE IIISHOP.RESELLERJOIN_SEQ 
  START WITH 20680 
  MAXVALUE 999999999999999999999999999 
  MINVALUE 0 
  NOCYCLE 
  NOCACHE 
  NOORDER; 
==============================================================================================================

- R&F 상품 찜하기  
/display/prdlist/tpl/type11/itemsListByListP.jsp   -----> 수정 
==============================================================================================================

진선숙 7001202703415 
진태규 7306251703418(tamario3/tama33)   ==> 리셀러 회원 가입(www.i3shop.co.kr) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.24(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 

- 쇼핑몰 수정
- 노블레스 패키지 수정 
노블레스PK 해피콜 정보 TB 생성 
- 해피콜 프로그램 수정(VB) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.25(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:30 

- 쇼핑몰 수정
- 노블레스 패키지 수정 
 해피콜 프로그램 수정(VB) 
==============================================================================================================

- 널값 제거(VB에서) 
If IsNull(adoGongsaItem(10)) Then txtAsst_TY.Text = "" Else txtAsst_TY.Text = adoGongsaItem(10) 
==============================================================================================================

- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
반품신청(고객 쇼핑몰) --> 반품접수(반품신청관리) --> 반품접수(반품신청관리)  
--> 반품 회수 확인(반품 회수 관리): 물류센타에서 직접 확인  --> 환불금 확정(회계팀) 
--> 환불처리(현금, 카드) 
==============================================================================================================

- 노블레스 패키지 반품정보 
function findGongje_Item() { 
	var url = "/BizMgr/SaleMgr/WebOrderMgr/popup_nobeCDInfo.jsp?p_form_name=editForm" + 
	"&p_etc_fee=p_etc_fee&em_etc_fee=em_etc_fee"+ 
	"&p_nobeCD_gongje_nm=p_nobeCD_gongje_nm&p_nobeCD_gongje_cd=p_nobeCD_gongje_cd";   
	window.open(url,"open_win1","toolbar=no,status=no,resizable=no,scrollbars=yes,Left=600,Top=250,width=600,height=500"); 
} 

<a href="javascript:findGongje_Item()"><img src="/images/bizMgr/bt_detail.gif" alt="노블레스 패키지 반품 공제금액 정보" 
border="0" align="absmiddle" hspace="10"></a> 
==============================================================================================================

<td class="tbl_title" width="100">기타수수료<a href="javascript:findGongje_Item()"> 
<img src="/images/bizMgr/bt_detail.gif" alt="노블레스 패키지 반품정보" border="0" align="absmiddle" hspace="10"></a></td> 

<input type="text" style="width:152px;" name="p_nobeCD_gongje_nm" value="" class="readonly" readonly > 
<input type="text" style="width:152px;" name="p_nobeCD_gongje_cd" value=""> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.27(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
- 노블레스 패키지 수정 
G.W 유무료 설치 등록 
==============================================================================================================

- 게이트웨이 무료 설치신청 
http://www.i3shop.co.kr/Nettel/calling_gateway_instrequestP.jsp 

- 게이트웨이 유료 설치신청 
http://www.i3shop.co.kr/Nettel/calling_gateway_instrequestChP.jsp 
==============================================================================================================

--주문 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
SELECT A.MEM_ID, B.ITEM_CD 
FROM T_ORDER A, T_ORDER_DTL B 
WHERE A.ORDER_DT = B.ORDER_DT 
	AND A.ORDER_NO = B.ORDER_NO  
	AND A.MNO = 692323 
	AND B.ITEM_CD = '00156771' 
GROUP BY A.MEM_ID, B.ITEM_CD 
; 
==============================================================================================================

 --하부 무료 회원 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
SELECT MNO, MEM_ID AS 주문자ID 
FROM T_MEMBER 
WHERE PMNO = 92201   --회원번호 
  AND MEMGBN_CD = '01' 
 ; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.28(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 24:30 

- 쇼핑몰 수정
- 노블레스 패키지 수정 
노블레스PK 주문시 가격 정보 저장(노블레스PK 실가격 정보 테이블 참조) 
==============================================================================================================

- 글자 대체 함수 
<%!  
    public static String replace(String line, String oldString, String newString)  
    {  
        for(int index = 0; (index = line.indexOf(oldString, index)) >= 0; index += newString.length())  
              line = line.substring(0, index) + newString + line.substring(index + oldString.length());  
        return line;  
    }  
%> 

p_Search_txt = replace(p_Search_txt, "-", ""); 
==============================================================================================================

testzzzz/test757 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.29(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00 

- 쇼핑몰 수정
- 반품 수정 
반품신청, 반품회수 수정(노블레스 패키지 구매 정보 조회, 저장) 
==============================================================================================================

LG카드이용하는데 안심클릭신청 다 한카드인데도 결재도중에러가 난다하세요. 확인부탁드립니다. 
김종섭     aaa1656 
카드번호 : 5421-5837-0685-1321 
오류코드 : CAVV 
------------------------------------------------------------------------------------------- 

원인: CAVV데이타오류(8900): 비자 안심결제를 안하고 일반 거래로 결제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.06.30(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 01:00 

- 쇼핑몰 수정
- 해피콜 수정(VB) 
게이트웨이 설치 신청 관리 
==============================================================================================================

- MPI 모듈 수정(적용) 
도메인 주소 수정(pg.innotg.com -> mpi.tgcorp.com) 
==============================================================================================================

김인선       4-82401             Silver-M 
카드번호: 9420-9020-4896-4100 
i3패밀리카드로 결제했는데, 카드 결제 되었다고 메일전송까지 받았다고 하심... 
현재 정상적으로 결제 된게 맞는지 문의? -->현재 접수취소상태임 
==============================================================================================================
  
- 결제 불가 카드  
현대, 하나비자, 외국계열 카드 
한미 --> 잘 안될 때도 있음 
==============================================================================================================

- 황은희PM: 02-3442-1567 
==============================================================================================================

- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama3** 
200902/9597 
CVC: 891 
640712 - 1703812 
==============================================================================================================

- Gold Store 테이블 정보 
T_ITEM: 상품정보 
T_ORDER: 주문정보 
T_ORDER_DTL: 주문정보상세 정보 
T_GUEST: 고객정보 
T_STOCK_IN_OUT:상품입출고 정보 
==============================================================================================================

  With StatusBar1 
        .Panels(2).Text = Rs(0) 
        .Panels(4).Text = Rs(4) 
        .Panels(6).Text = Rs(3) 
        .Panels(8).Text = Rs(1) 
        .Panels(10).Text = Rs(2) 
    End With 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■