

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.05.01(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 11:30 

▦조기축구 
06:30 기상 
08:00 성서(비 약간) 
11:30 종료 
13:30 귀가   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.02(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 01:30 

- 쇼핑몰 수정
- R&F 매장 수정(/display/prdlist/tpl/type11/itemListP.jsp) 
http://test.mart.cc/display/sml/smlctg.jsp?p_store_cd=S013&p_category_cd=T03010100&p_display_cd=11 

- R&F 매장- 전체상품(/display/prdlist/prdlist.jsp  
--> /display/prdlist/tpl/type99/itemListP.jsp --> /display/prdlist/tpl/type99/itemsListByListP.jsp) 
/display/prdlist/prdlist.jsp?p_store_cd=S013&p_category_cd=T03010901&p_display_cd=99 
-----------------------------------------------------------------------------------------------------------------------------

- R&F 매장- 자료실(/display/prdlist/prdlist.jsp  
--> /display/prdlist/tpl/type11/rnfGuest_center.jsp 
/display/prdlist/tpl/type11/rnfGuest_center.jsp?p_store_cd=S013&strLeftNO=01 
-----------------------------------------------------------------------------------------------------------------------------
- R&F 매장- FAQ 
/display/prdlist/tpl/type11/rnfGuest_center.jsp?p_store_cd=S013&strLeftNO=03 
-----------------------------------------------------------------------------------------------------------------------------
- R&F 매장- 건의사항 
=/etc/sendMailfP.jsp?p_store_cd=S013&strLeftNO=02 
----------------------------------------------------------------------------------------------------------------------------- 

System.out.println("[/BoardSvcBean.java/getNewsDetail()]:[SQL_t]===> \n"+ SQL); 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

 %%   박홍석   ks1128   Member 
위분 매출 하시는데  \ 5,124,200 결재하니 에러가 나면서 시티은행으로 확인하니 금액이 너무 크다고 가맹점에서  
연락을 줘야 결재 가능하다고했다함 ㅡㅡ;; 
[시티은행  5485 9601 3253 8008  황덕춘]  - 시티은행으로 전화해달라시며~ 
확인후 전화 요망  *   황덕춘 
전 - 김수진    ksj777    Gold-M 
----------------------------------------------------------------------- 

- 8373 카드사 전화 요망  ==>가맹점 한도 초과 
NICE 월 한도 초과: NICE에서 월 한도를 카드사별로 설정하는데 그 한도가 넘으면 결제가 불가능함 
월초에 다시 풀림 
==============================================================================================================

- PG사별카드매출내역(/BizMgr/ReportMgr/entrcardsaleReportP.jsp?p_entr_no=44004) 
0100012005033101997(L&B) --> 거래기간: 20050331, 매출일자: 20050401  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.03(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 11:30 

- 쇼핑몰 수정
- R&F 매장 수정(/display/prdlist/tpl/type11/itemListP.jsp) 
http://test.mart.cc/display/sml/smlctg.jsp?p_store_cd=S013&p_category_cd=T03010100&p_display_cd=11 

- R&F 매장- 전체상품(/display/prdlist/prdlist.jsp  
--> /display/prdlist/tpl/type99/itemListP.jsp --> /display/prdlist/tpl/type99/itemsListByListP.jsp) 
/display/prdlist/prdlist.jsp?p_store_cd=S013&p_category_cd=T03010901&p_display_cd=99   
==============================================================================================================

- 신용카드 결제 오류(승인 데이타 미존재)  
0100012005050200527: 카드 결제 오류(R&F)  
==============================================================================================================

- 쇼파 주문 
[코시트]아이모스 고품격 인조가죽 소파(3인용)(삼성몰)  ==> 287,000원 
http://www.samsungmall.co.kr/catalog/general/detail.jsp?disp_class_cd=0902&goods_cd=410306160005&urlpath=0@0902@A01@C01@C01@F01 

- 50만원 송금 
이원철 (농협)150077-52-022380 * 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.04(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 11:00 

- 쇼핑몰 수정
- 찜하기  
==============================================================================================================

- SMS전송(게이트웨이 설치 이벤트)  
4차 271건 전송 
==============================================================================================================

- KT ADSL 외장형 모뎀(CISCO677) 
http://www.megapass.net/megapds2/ 
패카패스 자료실에서  접속프로그램 
==============================================================================================================

- 본사 홈페이지 접속 불가능 
*  김성호 
kmart.town.cc 
http://www.i3shop.com/ 
아마도 100% 노트북, 인터넷선 문제입니다. 
혹은 네트워크 설정 문제일수도 있겠네요 . 
(노트북 인터넷선 문제로 DNS서버가 정확하게 작동 안 함) 
==============================================================================================================

- 자동로그인 해제 
시작-설정-제어판-사용자계정에서 작업 선택부분의 사용자 로그온또는 로그오프방법 변경에서  
새로운 시작화면 사용을 UnCheck해주시길 바랍니다. 이때 빠른 사용자전환부분도 Uncheck가 됩니다. 
그럼 이후 시스템 로그온시 로그온 창이뜨게됩니다. 
이때 계정과 비번을 입력해야만 로그온 가능합니다. 
==============================================================================================================

- 컴퓨터 세팅 
20:00 윈2000 Pro로 세팅(2대: 대규방, 대규 서울집) 
23:00 퇴근(택시) 
23:10 귀가  
------------------------------------------------------------------------------------------------------------ 

- 컴퓨터 사양 
CPU: 팬티엄3 700Hz 
램: 256M 
HDD: 20GB 
------------------------------------------------------------------------------------------------------------ 
드라이버 
네트웍:  
비디오:  
사운드: 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.06(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 13:00  ~ 20:00 

- 공휴일
09:30 기상 
10:00 목욕 
11:00 E-mart 
12:00 점심 
13:00 회사 출근(TAMA_SCHEDULE, 독서) 
20:00 귀가  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.06(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 19:00 

- 쇼핑몰 수정
- 찜하기 수정 
==============================================================================================================

- SMS전송(게이트웨이 설치 이벤트)  
5차 826건 전송(337 재 전송) 
==============================================================================================================

- 인치 계산 
15 38.1 
17 43.18 
19 48.26 
21 53.34 
------------------------------------------------------------------------------------ 
모니터나 텔레비젼은 대각선의 길이를 인치로 표시하는거랍니다. 
1inch는 2.54cm입니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.07(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 13:00 

- 쇼핑몰 수정
- 찜하기 수정 
==============================================================================================================

- LG카드 무이자 행사(/display/com/itemDetaiInfoP.jsp) 
/img/common/icon_lgmu.gif 
==============================================================================================================

http://www.abnkorea.co.kr/new_abn/login.asp 
암웨이 : 3726875 / 1230 
http://www.hilivingmall.co.kr/ 
하이리빙 : 1912470 / 0909 (마이룸비번:2806815) 
http://wwwi.altwell.biz/shop/main.asp 
엘트웰 : myo082 / myo7510 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.09(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 찜하기 수정 
==============================================================================================================

- ODBC 연결 에러(MS-SQL) 
telnet I3SHOPMMSERVER2 1433  
telnet 210.123.133.121 1433  

"서버에 연결할 수 없습니다  
서버 : 메시지 17, 수준 16, 상태 1 
[Microsoft] [ODBC SQL Server Driver][TCP/IP Sockets] SQL Server가 없거나 액세스할 수 없습니다." 
-------------------------------------------------------------------------------------------------------------- 

재 웹서버에는 2000 Server를 사용중이며 DB OS를 Win2003으로 사용중인데요, 
DB에 있는 데이터를 ODBC 연결하여 수정하려 하는데 액세스가 거부되는 일로 인해 Q&A에 글을 올렸으나 
아무도 답변을 해주지 않아서 스스로 해결하게 되었습니다.-_-; 
다른 SQLER분들도 이런 문제가 있을 법 하여 약소한 Tip이나 공유할까 하네요, 
Win2k3에서 자체 보안설정 때문인지는 모르겠지만, 외부에서 ODBC 연결을 시도하여 DB 내용을 액세스하려 하면 
차단시켜 버리는 일이 있더라고요, 그럴 때에는 ODBC 연결 설정부분에서 클라이언트 구성 설정을 보시면 
TCP/IP로 연결하는 설정이 있습니다. 

해당 옵션을 선택하고 연결하는 포트를 설정(자동으로 해도 무관)하시면 문제 없이 연결되더군요, 
기본적으로 ODBC연결 방식은 명명된 파이프(Named Pipes)로 설정되어 있는데  
이를 사용하면 보안상이나 효율성에서 떨어지기 때문에 Win2k3부터는 직접 연결방식을 사용하나 봅니다.  
http://sqler.pe.kr/web_board/view_list.asp?id=617&read=1193&pagec=&found=is&part=myboard7&ser=yes 

---------------> kor_sql2ksp3.exe 다운 받아 설치 후 재부팅 하면 됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.10(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 정수기 수정
- ODBC 연결 에러(MS-SQL) 
\\211.233.5.107((MS-SQL DB서버) i3shop/i3shop1070321 sa/ckrladl(차김이) MSDB-SERVER 
\\210.123.133.121(MS-SQL DB서버) administrator/i3shop649563 sa/project 
\\210.123.133.227(MS-SQL DB서버2) administrator/i3shop2270321 sa/project  
==============================================================================================================

- PortQryV 사용법 
MS 사이트에서 portqry라는 프로그램을 다운받아서 설치하신다음 
커맨드 프롬프트에서 
C:\PortQryV2> portqry -n 211.233.5.107  -e 1433 
요렇게 하시면 SQL 서버의 표준포트인 1433번 포트에 리스너가 동작하는지 
안하는지 알수 있습니다. ( Listening이라고 나와야 정상입니다. ) 

Not Listening이라고 나오면, 해당 서버의 사용포트(서버에서 변경가능합니다.)를 
점검하던지, 아니면 portqry를 이용해서 어느포트를 통해서 리스닝하는지 확인해서 
서버가 사용하고 있는 포트와 클라이언트 네트워크 유틸리티의 TCP 포트를 
일치시켜 줘야 합니다. 

ps.원거리이기 때문에 Named Pipe를 사용하지 않고, TCP/IP를 사용하는 걸 
     전제로 합니다.  
==============================================================================================================

- OLE DB 직접 접근 방법 (MS OLE DB for SQL Server) 
Provider=SQLOLEDB; Data Source=디비서버이름;Initial Catalog=디비이름;User  
id= 아이디;password= 비밀번호[; Trusted Connection=사용자 인증 모드(true:NT인증 
모드 FALSE:복합모드사용); Current Language=사용언어식별;Network Address=Location 
으로 지정한 SQL Server의 네트워크 주소;Network Library=Net-Library(DLL)이름(경로 
나 .dll 파일 확장명 불가);Use Procedure for Prepare=저장프로시저사용;Auto  
Translate=OEM/ANSI문자 전환(TRUE);Packet Size=바이트단위의네트워크패킷크기(512- 
32767,기본:4096);Application Name=클라이언트응용프로그램이름;Workstation ID=워크 
스테이션식별문자열] 

ex) Provider= SQLOLEDB;Data Source= taeyo;Initial Catalog=taeyo;User id=  
taeyo; password= 11 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.11(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00  

- 쇼핑몰 수정
- 찜하기 수정 
==============================================================================================================

- LINKED SERVER(MS-SQL) 
1. MS-SQL 2000 에서 ORACLE 9i 에 있는 데이터를 
LINKED SERVER 를 이용하여 가져오려고 합니다. 
2. 연동테스트를 위해 아래와 같이 링크드 서버를 생성하고 
로긴매칭을 했습니다. 
EXEC sp_addlinkedserver   
@server = 'LINKEDSERVERNAME',   
@srvproduct = 'ORACLENAME', 
@provider = 'MSDAORA', 
@datasrc = 'ORACLENAME' 

 EXEC sp_addlinkedsrvlogin  
'LINKEDSERVERNAME', 'false', NULL, 'USERID', 'PASSWD' 

4. 당연히 MS-SQL2000 에서 OPENQUERY 로 호출은 안되구요. 
SELECT * FROM IIISHOP..IIISHOP.T_DEPEND_ORDER 
             --서버명.데이타베이스명.사용자명.테이블명 
------------------------------------------------------------------------------------------------------------------ 

EXEC sp_addlinkedserver   
@server = 'IIISHOP',   
@srvproduct = 'IIISHOP', 
@provider = 'MSDAORA', 
@datasrc = 'IIISHOP' 
 EXEC sp_addlinkedsrvlogin  
'IIISHOP', 'false', NULL, 'IIISHOP', 'IIISHOP' 
GO 
------------------------------------------------------------------------------------------------------------------

SELECT * FROM IIISHOP..IIISHOP.T_DEPEND_ORDER 
             --서버명.데이타베이스명.사용자명.테이블명 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.12(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00  

- 쇼핑몰 수정
- 찜하기 수정 
- 찜 리스트에 넣기 
resultHash = cart.addItemOnZzim(outHash_2); 
//장바구니에 넣기 
resultHash = cart.addItemOnCart(outHash_2);  
==============================================================================================================

- B2B 이벤트(수입차(볼보) 5월 이벤트 시행) 
/display/main/b2b/car_import.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.13(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00  

- PT 자료 작성
- 쇼핑몰 주문 Flow 개선 방안 
==============================================================================================================

- 기간별지각자현황 조회(/EmpMgr/attendMgt/attenList/termLateEmployeeListP.jsp) 
==============================================================================================================

- 디카 이미지 
www.350dclub.com --> nam0977/3590 
==============================================================================================================

- 카드 오류 
오미진  *ID: zin73 
* 카드 정보 : 엘지카드 - 4499-1418-5718-5005  오미진  
=>안심클릭등록까지 정상했고, 12개월 할부 결제시도시  
할부개월수오류라는 문구가 계속 뜬다하여 10개월로 수정해서 
재결제 해보라고했으나 10개월로 해도 할부개월수 오류가 
난다고하시네요,확인부탁드립니다~ 
--------------------------------------------------------------------------------------------------------------------- 

- 8393 할부개월 오류 
이 건은 엘지카드에서 오류를 내는 것이기 때문에 카드 소유자가 
직접 엘지카드로 전화해서 문의를 해야 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.14(토) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 20:00 --> 토요 휴무 

- 쇼핑몰 수정
- 찜하기 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.16(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 23:00 

- 쇼핑몰 수정
- 찜하기 수정 
<a href=# onclick=opener.location.replace('/cart/cartGetP.jsp?p_CART_GB=02');self.close();>찜목록 확인</a> 
<a href="javaScript:self.close();">아니오</a> 
==============================================================================================================

- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama3** 
200902/9597 
CVC: 891 
640712 - 1703812  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.17(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:30 

- 쇼핑몰 수정
- L&B 수정  
전기/전자(/display/mid/tpl/type01/categoryP.jsp) 
/display/big/bigctg.jsp?p_store_cd=S001&p_category_cd=T01000000&p_display_cd=01  
--------------------------------------------------------------------------------------------------------------------------- 

- 오른쪽 마우스 방법 
<BODY oncontextmenu="return false" onselectstart="return false" ondragstart="return false"> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.18(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 

- 쇼핑몰 수정
- 클로렐 라면 포스터 공모전 
자유게시판(/entertain/club/clubBoardListP.jsp?p_bbs_no=54641&p_club_no=53981) 
게시판 글쓰기(/entertain/club/clubBoardWritefP.jsp?p_club_no=53981&p_bbs_no=54641&p_search_kind=&p_search_str=) 

dev_stand.jar 파일에 존재(Upload.class, FileDistLog.class) 
new FileDist(filedistlog, fullpathfile, remotePath).start(); 

- 클로렐라면 포스터 공모전(/entertain/event/postPicMainP.jsp) 
---------------------------------------------------------------------------------------------------------------------------

- 글자 대체 함수 
<%!  
    public static String replace(String line, String oldString, String newString)  
    {  
        for(int index = 0; (index = line.indexOf(oldString, index)) >= 0; index += newString.length())  
              line = line.substring(0, index) + newString + line.substring(index + oldString.length());  
        return line;  
    }  
%> 

SmsMsg = replace(SmsMsg, "홍길동", MEM_NM); 
==============================================================================================================

- 디카 이미지 
www.350dclub.com --> nam0977/3590 
==============================================================================================================

- 마이샵관리(/admin/myshop/myshopManagefP.jsp) 
/img/fupload/resellerphoto/38584-584314.jpg  
==============================================================================================================

* 신미영Active-Master / gold100406 
엘지카드 사용...카드결재를 하면 에러코드: NULL 이 자꾸나온다고함. 
확인후 전화드리기로함.   *  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.19(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 클로렐라면 포스터 공모전(/entertain/event/postPicMainP.jsp) 
- DB 생성 
T_REGPIC_POST(포스터 공모전 사진 추천) 
T_REGPIC_POST_CC(포스터 공모전 사진 등록) 
==============================================================================================================

* 김태봉Active-Master  / dcmadang01 
킬러앱 매장에서 상품을 주문하는데 오류가 생긴다고함... 
주문하기를 클릭하면 아래와같이 확인된다고함.  
A1E -> 이부분이 먼저 확인되고... 
오류 메세지 : AEG  2005.......담당자 확인하라고 획인된다고함.  
확인후 연락요망함.   053-781-3294 
확인후 메모 부탁드립니다. 수고하세요~~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.20(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 02:00 

- 쇼핑몰 수정
- 클로렐라면 포스터 공모전(/entertain/event/postPicMainP.jsp) 
- 파일 업로드(MultipartRequest) 
cos.jar를  /ROOT/WEB-INF/lib 에 넣음 
---------------------------------------------------------------------------------------------------------- 

- 파일 upLoad는 현재 2가지가 주류를 이루고 있지요..  
하나는 JspSmartUpload가 있고 또 하나는 MultipartRequest가 있지요..  
전자가 좀더 편리하긴 하지만 문제가 좀 있지요...  
전자는 파일의 크기 만큼 서버가 메모리를 할당해놓고 파일을 올리게   
되므로 무지하게 위험한 방식이 되는 거구요..  
후자는 폼의 enctype을 multipart/form-data 형식으로 하고 post   
method를 이용하여 파일 input type을 쓰면 문제가 있음(MultipartRequest 사용) 
==============================================================================================================

- 공모전 사진 등록 로직(/postPicRegS.jsp) 
String path = "/opt/WebSphere/AppServer/installedApps/BizStore.ear/BizStore.war/entPost_img";    //저장할 디렉토리(절대경로) 
String path = "D:/CCDOM2/Ccdom/CcdomWeb/entPost_img";    //저장할 디렉토리  ======> LOCAL 서버 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.23(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
<%--       비즈니스 로직 수행         --%> 
<jsp:include page="/display/prdlist/tpl/type51/itemListKillerApp.jsp" flush="true" > 
<jsp:param name="search_bz_logic" value="0" /> 
</jsp:include> 
------------------------------------------------------------------------------------------------------------------- 

AR_WAY_CD,     --결제방법코드(01:현금, 02:카드, 03:현금/카드모두) 
SHIP_CL_CD --배송구분코드(01:마트배송상품, 02:R&F상품, 02:업체배송상품) 
ENTR_CL --R&F상품 배송구분코드(01:R&F상품 중 자사배송상품, 02:R&F상품 중 업체배송상품) 
==============================================================================================================

카드깡: 돈빌려주고 채무자의 카드로 물건사서 영수증 끊고 바로 되팔아서 돈먹고 카드값은 채무자가 무는 행위 
1. 현재 각종 쇼핑몰에서 판매하고 있는 삼성 대학노트북의 가격이 매우 싸게 나오고 있다고 합니다. 
이유인즉 카드깡업자들이 깡한 제품들을 용산의 쇼핑몰들이 제품들을 무자료로 구매하여  
판매하기에 가격이 싸게 나온다고 합니다. 
2. 급전 어쩌고 해서 명함 있는거 대부분이 카드깡입니다 약 30프로 정도...이자 무셔야 하구요 
선이자 15 그이후에 15정도 무셔야 합니다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.24(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- LG카드 포인트 추가(myLG포인트) 
LG카드 결제란 추가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.25(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- LG카드 포인트 추가(myLG포인트)  
 할부개월수를 60개월 이상하면 무조건 포인트 활용 
==============================================================================================================

- LG카드(주영지씨)  =============> 
4009 0632 8602 4014(4009063286024014) 안심: zoo9508047 9614  
2007/08 CVC: 038 *-2675810  
www.lgcard.com joo0ji/dm1032 
MYLGPOINT 11,840 
==============================================================================================================

- 배송검수 조회 안됨 
0100012005052300298 
00155701 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.26(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 7:30 ~ 23:00 

- 쇼핑몰 수정
- 찜 록록 수정 
T_WISH_LIST(찜 목록 정보) 생성  

- 장바구리 전체 수정 
==============================================================================================================

- 상품마스타관리(구버젼)--> 상품웹정보에서  
모델웹명 
<img src="/img/items/a.gif" border=0>을 <img src=/img/items/a.gif>으로 수정 
[프랜드리]프랜즈챙모자  
다음 부터 모델웹명에 작은 따음표와 큰 따음표 없이 등록 해 주세요. 
상품에서 에러가 납니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.27(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
장바구니 전체 삭제 
==============================================================================================================

- 정수기 수정 
10일 2대:  
주문번호: 0100012005050900326 
주문번호: 0100012005051000117  
20일 1대 
주문번호: 0100012005052000068  
25일 1대 ---> 누락 됨 
주문번호: 0100012005052500133 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.28(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 20:00 

- 쇼핑몰 수정
- 장바구니 전체 삭제 
==============================================================================================================
  
- 상품코드가 같더라도 유형이 틀리면 다른 상품으로 인식  
--> 상품코드:00155081 유형번호:3 TP_DTL_NO:1 
유형명:칼라 유형상세번호:10호 내추럴베이지 
보따니끄 마뜨 피니쉬(오일프리파운데이션)-40ml [10호 라이트베이지]  
--> 상품코드:00155081 유형번호:3 TP_DTL_NO:2 
유형명:칼라 유형상세번호:20호 내추럴베이지  
보따니끄 마뜨 피니쉬(오일프리파운데이션)-40ml [20호 내추럴베이지] 
------------------------------------------------------------------------------------------------------------------------- 

- LG카드 포인트 추가(안내 페이지)  
 /custcenter/lg_point.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 장바구니, 찜 목록 전체 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.05.31(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 01:20 

- 쇼핑몰 수정
- 클로렐라면 포스터 공모전 최종 수정 
==============================================================================================================

박성현     anything19 
시티은행 카드 결재안된다고 문의 [ccvv]라는 오류가 난다하심.  
카드번호 : 4539-3412-9940-4343 
에러 메세지: CAVV데이터오류 
이 에러는 카드사에 고객이 직접 문의 해야 됩니다. 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■