

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.12.01(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 통합 ERD 작성
- 신용카드 TABLE 
T_CARD_LOG T_CARD_BIN, T_CARD_HANDO 
T_KICA_BILL(공인인증서 정보), T_KICA_REQ(공인인증서 신청 정보)  
http://www.dbguide.net/educ/educ120002.jsp?mode=view&idx=152651 
http://www.dbguide.net/educ/educ120001.jsp?mode=list&catenum=52&pg=2 
==============================================================================================================

- 공인인증서 중복 
김영란,오정임,정은숙,이미경 
--> 마감일에 속도가 느려서 고객이 클릭을 여러번 해서 중복결제로 뜬 것으로 추정 
==============================================================================================================

- KSNET 결제 확인(신용카드) 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  직가맹, 기타 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999)) 
--> 직가맹: 국민, BC, LG 
마이너 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 외환, 
신한(조흥((구)강원카드):ISP, 제주,수협,광주,전북) 
---------------------------------------------------------------------------------------------------------- 
- 김명석 과장(3420-5916, *)  ==> 사업부 
02)3420-5951  박영준 대리(*) 
==============================================================================================================

- KS NET 카드 영업 담당 
신재혁 대리 02)3420-5862  --> 카드 번호4689140061277202 
==============================================================================================================

- 안심클릭 카드 
삼성올앳카드(9420902101937600): 진태만   --> 우리은행(96075366418964) 
국민카드(9410468398418016) 진태만 
국민 체크카드(9436457695390101) 진태만--> 1105/***52** CVC: 060  
외환카드(9410004760649621) 진태만 --> 1010/***52** CVC: 386  
LG카드(9410803255269007): kijin00/tama3** 큰 매형 
200902/9597 CVC: 891 640712 - 1703812 
롯데카드(4670071170373007): 안심:vldmswl0442(vldmswl0441) 공인:pej7579133    피은지(vldmswl01, 7912252804418)  
200712/44** CVC번호:783  ==> 4670 0711 7037 3007 맞습니다  
http://www.lottecard.co.kr --> vldmswl/pej0442 
==============================================================================================================

김광숙         iks02           Active-Master 
카드번호: 4689-1400-6127-7202 조흥비자  
어제 카드결제시 오류가 난다고 하시며 문의? - 결제 방법에 "기타" 로 체크하셨냐 여쭤보니 했다고 하심 
---------------------------------------------------------------------------------------------------------- 
카드번호: 4689-1400-6127-7202 조흥비자  
에러내용: 승인불가        카드사전화요망 
==============================================================================================================

김광숙(iks02) *  / 카드번호: 4689-1400-6127-7202 조흥비자  
진대리님 확인 결과 -> 에러내용: 승인불가        카드사전화요망 
--  조흥비자카드 -> 위 고객이 카드사로 문의하셨는데 전혀 해당사에 이상없는 카드이고  
정상적으로 결제가되는카드라고함.. 조흥비자 4689 가맹점이 맞는지 문의? - 가맹점 맞다 안내드림 
isp를 써서 결제하는 카드사인데 그렇게 했는지 확인해달라심 
-> 대리님 우리 주문시 기타로 선택 결제하도록 나오는데.. 조흥비자는 isp쓴다는데 확인바랍니다~   
==============================================================================================================

- 조흥카드 ISP결제로 변경 
상점ID변경(메인 상점ID --> KSNET_직가맹 상점ID) 
/order/orderPutP_2.jsp 에서 @@@@@@@@ 
if (MakePayMessage(frm) == true) { 
	var p_decieve_card_nm_2 = frm.KVP_CONAME.value.substring(0,2);		// 카드명(ISP 모듈 적용 후 받아 옴) 
	if ( p_decieve_card_nm_2 == "조흥"  p_decieve_card_nm_3 == "CHB") {	//조흥카드 이면 
		frm.p_isp_gubun.value = "3"; 
	} 
} 
---------------------------------------------------------------------------------------------------------- 

/CallExternalSystemBeanForWeb.java 에서 @@@@@@@@ 
if (p_isp_gubun.equals("3")) { // KSNET 조흥카드 이면 
	if (p_order_dtl_tp_cd.equals("02")){ // R&F주문 
		TERMINAL_NO = getEnv("KSNET_TID_3"); // KSNET_직가맹 상점ID 
	} else { 
		TERMINAL_NO = getEnv("KSNET_TID_4"); // KSNET_직가맹 상점ID 
	} 
	PGNAME = "KSNET"; 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.02(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:30 

- 쇼핑몰 수정
- 통합 ERD 작성
- 신용카드 TABLE 
T_CARD_LOG T_CARD_BIN, T_CARD_HANDO  
T_KICA_BILL(공인인증서 정보), T_KICA_REQ(공인인증서 신청 정보)   
==============================================================================================================

- 수능 합격Evt SMS 전송 
최근 6개월 내 AM 승급자 중 L&B 구매 회원 858건 전송  ==> 14:20 ~ 14:22(2분 소요)  ---> Evt수능합격기원(57)  
SMS 발송 문구: ""수능 합격기원 더블도끼 사은전" 2005/11/22~12/21 많은 참여 바랍니다. i3shop 1688-1313"   
3건 추가: *, *, * 
==============================================================================================================

최근 6개월 내 AM 승급자(20050601 ~ 20051202)==> 2,596 
최근 6개월 내 L&B 구매회원(20050601 ~ 20051202)==> 83,973 
==============================================================================================================

- SMS 문자 전송(순위) 
SMS 발송 문구:"당신은 황금산타 1위 입니다. (2005-11-09 04시까지 적용기준) 아이쓰리샵 1688-1313" 
---> Evt산타_순위(55)  --> 총: 48건 
==============================================================================================================

- 수불장 금액 1원 차이 ==> 수불장 수정  
00159410 더블에이 A4 복사용지 80g 500매 * 5 모던페이퍼(거래처명) 45 613,637(매입_금액) 
NVL(TRUNC( 
      SUM( 
   ( 
     CASE 
       WHEN B.TAX_YN = 'Y' THEN 
 B.BUYING_PRICE - (B.BUYING_PRICE / 1.1) 
       ELSE 
     0 
 END 
   ) * B.STOREIN_QTY 
 ) 
 ), 0) AS IPGO_WONGA_VAT,                                --입고원가(VAT) 
------------------------------------------------------------------------------------------------------------------------------ 

==> 수정 후 
NVL(TRUNC(SUM((CASE WHEN B.TAX_YN = 'Y' THEN NVL(B.BUYING_PRICE,0) ELSE 0 END) * B.STOREIN_QTY)), 0) 
  - NVL(TRUNC(SUM((CASE WHEN B.TAX_YN = 'Y' THEN (B.BUYING_PRICE / 1.1) ELSE 0 END) * B.STOREIN_QTY)),0) 
  AS IPGO_WONGA_VAT,  --입고원가(VAT) 

검산법(기존) ===> {15,000 - (15,000/1.1)} * 45 = 61,363  --입고원가(VAT) 
검산법(수정) ===> {15,000 - (15,000/1.1)} * 45 = 61,364  --입고원가(VAT)  ==> 대금정산과 동일 
==============================================================================================================

%%   최덕희   duk53   Gold-M     
조흥 비씨 정상 결제가 안된다고하심 -> 130만원 r&f 결제한도 - ISP+공인인증 다 되어있다고함   
카드번호 :  9430 2124 0233 0551  -> 미등록 가맹점이라고 메세지 뜬다고함  
확인후 전화  * 
원인: ISP를 잘못 받았거나 본인 것이 아님 
==============================================================================================================

- 조흥카드 ISP결제 에러 
배종진 GM(*) 49022071XXXX6103(121652042228) 
------------------------------------------------------------------------------------------------------------------------------
고석환(go6810)  *  입니다 
==============================================================================================================

- 대문자 ID 소문자로 변경 
A1128 --> a1128 
ID: a1128 PWD: 641128 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.03(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:30 

- 쇼핑몰 수정
- 통합 ERD 작성
- 신용카드 TABLE 
T_CARD_LOG T_CARD_BIN, T_CARD_HANDO  
T_KICA_BILL(공인인증서 정보), T_KICA_REQ(공인인증서 신청 정보)   
T_RACARD_LOG 
==============================================================================================================

- G.W무료설치 신청 문의 
imjs(임점숙) --> 배송완료일자(20051102) 
G.W무료설치 신청은 주문일자가 아니라 배송완료일자 기준입니다.  
==============================================================================================================

http://onlec.net/index.htm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 

1. 장바구니 세션(cartVec는 결제까지 가지고 가야 하므로 반드시 체크 해야 됨) 
a) 장바구니 세션 리스트 Vector가 존재하지 않으면  
로그인 후 장바구니를 처음 방문한 ID ==> T_CART DB 불러 오기 
b) 장바구니 세션 리스트 Vector(cartVec)가 존재하면 
로그인 후 장바구니를 한번이라도 방문한 ID  ==> 세션 리스트 Vector(cartVec) 불러 오기 
------------------------------------------------------------------------------------------------------------- 

T_WISHLIST(찜 목록 정보), T_WISHLIST_TYPE(찜 목록 상품 유형 정보) 
==============================================================================================================

- 신용카드 점유율 분석 조회 
ROUND( RATIO_TO_REPORT(SUC_COUNT)OVER(PARTITION BY 'ALL')*100,2) AS 점유율,    --백분율 조회 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.06(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
장바구니 저장 수정 
==============================================================================================================

- T_CART 시퀀스 생성   
DROP SEQUENCE IIISHOP.T_CART_SEQ; 
SELECT T_CART_SEQ.nextval FROM DUAL; 

CREATE SEQUENCE IIISHOP.T_CART_SEQ 
  START WITH 10000 --시작값 
  MAXVALUE 9999999999999999999999999999 --최대값 
  MINVALUE 1 --최소값 
  NOCYCLE 
  NOCACHE --캐쉬: Oracle Server가 미리 지정하고 메모리에 유지할 값의 수 
  NOORDER; 
--------------------------------------------------------------------------------------------------- 
sequence 을 생성할때의 옵션인 cache 속성에 
대해서 알아보면 Oracle Server가 미리 지정하고 메모리에 유지할 값의 수로 default값은 20이라고 합니다. 
새로운 세션이 맺어지는 경우에 cache 사이즈 만큼 건너뛰고 nextval 가 생성된다는걸 간단히 유추할수 있겠네요. 
sqlplus 에서 테스트 하는건 당연히 현재 세션 내에서 nextval 를 요구하므로 +1 씩 증가 하지만 
WAS 에서 돌아가는 jsp 는 아마도 페이지 로딩시 마다 세션을 새로 맺으므로(커넥션 풀이라 해도 jsp 자체는 새로운 세션이겠죠) 
cache 사이즈 만큼 건너뛰고 값을 리턴하겠죠. 
캐쉬를 0으로 하세요 ^^;; 
==============================================================================================================

- 정수기 수정 
배송+설치 전산오류건 수정부탁드려요~ 
0100012003101000295..주문자건이구요..지금..배송+설치 다 받은걸로(파란색)되어있는데요... 
확인결과..배송만 받고 설치는 아직 안받은거거든요~ 
그래서...배송 2003년10월31일은 그래도 놔두고..설치 일자 삭제하고.. 
주소->대구 동구 신천동 740-7번지 신천지빌라 301호 수령자-성경옥 연락처 * 로 바꿔서.. 
노란색으로 만들어주세요~ 
후레쉬워터에서 내일 다운받아서..설치일자 넣고 완료(파란색)하기로 했거든요~ 
==============================================================================================================

- 카드 계약 계약 종료일(NICE) 
현대카드: 2005년 3월 9일 
삼성카드: 2005년 9월 3일 
--------------------------------------------------------------------------------------------------- 
- BC카드 가맹점 계약 종료일(NICE) 
BC카드: 2005년 2월 26일 
하나카드는 BC카드와 같은 망을 타서 같은 날 계약이 종료됨 
(하나카드 계약 재개: 2005년 8 월 10일) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.07(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
장바구니 저장 수정 
SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 
==============================================================================================================

- 대금정산관리 수정(송금안 한 걸로 수정) 
거래처코드 :00408 
업체명 : 사랑의 가구마을  
일자 :10/1~10/31일까지 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
장바구니 저장 수정 
SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 
--------------------------------------------------------------------------------------------------- 

CMONEY_USEYN AS p_cmoney_useyn,	 // 사이버머니 사용여부   ---> 
CYBERBV AS p_cyberpv,	// 사이버머니 사용시 PV    --->  
CYBERPV AS p_cyberbv	 // 사이버머니 사용시 BV   ---> 
C_SALE_PRICE AS p_c_salepric S p_cyberbv	 // 사이버머니 사용시 판매가   ---> 
USE_CMONEY AS p_use_cmoney	 // 사용가능한 사이버머니  
==============================================================================================================

- 신용카드 결제 오류 
강갑춘    dohee0418    Member 
20051208, 강갑춘, 0100012005120800039, 20051208  - I3MART [ 35,520원 ]  -> 주문내역 확인됨을 안내. 
오늘 국민카드사용...마지막에 isp결재정보를 넣으니 결재완료가 됐다는 메세지가 아닌 isp팝업이다시뜬다고 함.  
주문이 제대로 되었는지?  그리고 이러한 현상이 어제부터나타나는데 왜그런건지 문의?  
확인후 연락달라고하심. * 
--------------------------------------------------------------------------------------------------- 
실제 ISP 테스트 해보면 정상 결제 됨. 
회원에서 전화 해서 ISP 다시 받아 보고 다른 컴에서 해보라고 통보 했어요. 
==============================================================================================================

-공인인증서 휴대폰 결제 에러 
mo거래번호  cp거래번호 아이디  
2005/11/21 347431488   1132567497603    joamall26 ---> 1132567100428(이중 등록으로 추정--> 결제 취소 요청) 
2005/11/29 49807474   1133252340057    hee48 ---> 1133252143673(이중 등록으로 추정--> 결제 취소 요청) 
==============================================================================================================

- 모빌리언스 휴대폰 결제 관리자 페이지 
https://mcash.mobilians.co.kr/bill/payment/index.php3 ID/PWD(05011701/05011701)  
휴대폰 결제 담당자: 오경수 주임 T) (02)2192-2165 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보)  
SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 

- 사은품정보 
[NOWBIZ] 스트라이프 세미클래식 정장+사은품  ==> 00158487 
CJ 압착 올리브유 1L + 퓨어 올리브유 500ml   ==> 00155870 
(/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010301&p_item_cd=00155870&p_display_cd=01) 

if(util.getData("GIFT_TP",rowHash1).equals("02")) { //선택형 
itemHash.put("p_gift_yn","N"); // 사은품유무 
itemHash.put("p_gift_no","0"); // 사은품번호 
itemHash.put("p_gift_seq_no","0"); // 사은품일련번호 
itemHash.put("p_gift_nm",""); // 사은품명 
-------------------------------------------------------------------- ------------------------------------

- 형변환 
String -> Double로 형전환 
double  l_reseller_sale_price = util.parseLong(reseller_sale_price); 
String -> Int 로 형전환 
int iSALE_PRICE = util.parseInt(p_SALE_PRICE); //판매가격 
==============================================================================================================

- SMS 문자 전송(순위) 
1~12위 
SMS 발송 문구:"[산타공지]1위~12위 순위권에 포함. 황금상타 주인공이 될수 있습니다. i3shop" 
13~50위(9일 ~15일 이후 발송) 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 황금산타 주인공이 될수 있습니다. i3shop" 
13~50위(21일 이후 발송) 
SMS 발송 문구:"[산타공지]당신은 13위~50위 순위권으로 13위 더블찬스상을 노리세요. i3shop" 
1313~2005위 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 1313위 더블찬스상을 노리세요. i3shop" 
==============================================================================================================

- 노블 주문가능하게 하는 기능 권한 부여 
박민정(stayfeel), 정희영(250935) 2명 
==============================================================================================================

- 공인인증서 휴대폰 결제 에러 
mo거래번호  cp거래번호 아이디  
2005/12/2 0351602976   1133514630962    nam1010 ---> 1132567100428(이중 등록으로 추정--> 결제 취소 처리)  
==============================================================================================================

- 정수기 문제 파악 
11/22 2건 
신점순 0100012004030800428  --> 주문번호: 0100012005112200276 
김광선 0100012004011900224  --> 주문번호: 0100012005112200278 
==============================================================================================================

- 외환카드 2~3개월 무이자 할부 
2005.12.10 ~ 31(22일간) 
5만원 이상 2~3개월 할부 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보)  
SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 

- 사은품정보 
[NOWBIZ] 스트라이프 세미클래식 정장+사은품  ==> 00158487 
CJ 압착 올리브유 1L + 퓨어 올리브유 500ml   ==> 00155870 
(/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010301&p_item_cd=00155870&p_display_cd=01) 

if(util.getData("GIFT_TP",rowHash1).equals("02")) { //선택형 
itemHash.put("p_gift_yn","N"); // 사은품유무 
itemHash.put("p_gift_no","0"); // 사은품번호 
itemHash.put("p_gift_seq_no","0"); // 사은품일련번호 
itemHash.put("p_gift_nm",""); // 사은품명 
-----------------------------------------------------------------------------------------------------

[/cartGetP.jsp]:[resultHash_담겨진 장바구니 상품] 
{P_STORE_CD=S019, P_SALE_PRICE=9500, P_EM_CL=01, P_GIFT_NO=0, P_BONUS_ITEM_CL=01, P_BANK_PV=0, P_AR_WAY_CD=03,  
P_CONSUMER_PRICE=9900, CYBER_BV=5570, P_POINT=0, P_PV=5700, P_EM=8090, P_USE_CMONEY=0, P_LIMIT_SALE_YN=N,  
P_RESELLER_PRICE=8900, P_CMONEY_USEYN=N, P_SAL_STS_CL=01, P_GIFT_YN=N, P_ITEM_CD=00026960,  
P_ITEM_NM=Dr.Clean 칫솔 4개입, P_QTY=2, P_SHIP_CL_CD=01, P_BV=0, P_DIRECT_CMONEY=0, P_SALE_MAX_QTY=0, 
P_CARD_NO=10033, p_itemTypeVec=[{P_TP_DTL_NO=, P_TP_DTL_NM=, P_TP_NO=, P_TP_NM=}], P_SALE_MIN_QTY=1,  
P_CATEGORY_CD=T08020105, UNIT_CD=01} 
-----------------------------------------------------------------------------------------------------

[/CartBean.java]::[makeAllItemValue()]:[tmpStr]Y[p_gift_no]0[p_gift_seq_no]0[p_gift_nm]0 
==============================================================================================================

- 2005년 하반기 재고조사 관련 회의  
   - 세부내용 
1. 바코드 쉬트지 출력 프로그램(Visual Basic) 설치 및 교육 
- 12월 14일(수) 방문하여 프로그램 설치 및 재반 교육 실시 
 (향후 쉬트지 출력은 프로그램을 사용하여 물류팀에서 자체 해결 가능) 
 ==> 완료 예정일: 12월 13일(화)   
2. 바코드 신규 등록 에러 
- 추가로 바코드 등록할 때 바코드 조회 가능하게 수정 
 ==> 완료 예정일: 12월 20일(화)  
3. 편차조회 프로그램 수정 요청 
- 판매분 제외, 상품구분(R&F, L&B), 합계 보이기 
 ==> 완료 예정일: 12월 20일(화) 
4. 자인물류 매출 조회 프로그램 추가(통합) 요청 
- 자인물류에 등록된 상품 중 온라인점 매출 조회 가능 
 ==> 완료 예정일: 12월 15일(목) 
==============================================================================================================

- 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
팝업 한 Grid 쉬트 지정, 번호 주기 
- 위치별 실사서 입력 조회(팝업)(/BizMgr/ItemStockMgr/stockInquiryEditP.jsp) 
번호 주기, 조회수 보이기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 통합 수정
- 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
팝업 한 Grid 쉬트 지정, 번호 주기 
- 위치코드 삭제(팝업)(/BizMgr/ItemStockMgr/popStockInquiryByLocationP.jsp) 
위치코드 삭제 가능 
- 위치별 실사서 입력 조회(팝업)(/BizMgr/ItemStockMgr/stockInquiryEditP.jsp) 
번호 주기, 조회수 보이기 
- 위치별 상품 정보 입력(팝업)(/BizMgr/ItemStockMgr/stockInquiryInputP.jsp) 
에러내용: 이미 등록된 코드를 추가될 수 없습니다-3    
===> 바코드 쉬트지 출력 프로그램(Visual Basic)으로 갈 수 밖에 없는 이유(.ActiveX로 되어 있음) 
- 위치별 재고실사 바코드 삭제(팝업)(/BizMgr/ItemStockMgr/stockInquiryEditpopP.jsp) 
바코드 삭제 가능 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30 

- 재고VB 수정
- 바코드 쉬트지 출력 프로그램(Visual Basic) 설치, 수정 
--------------------------------------------------------------------------------------------------------- 
1. 오라클 설치 후 tnsnames.ora를 반드시 잡아 줘야 함(기존 걸 복사하여 넣을 것) 
2. 오라클 연결 커넉터 수정 
Connstr = "provider=OraOLEDB.Oracle;User ID=IIISHOP;Password=IIISHOP;Data Source=IIIshop;Persist Security Info=True" 
-->  
Public Const ConnectString = "provider=MSDAORA.1;User ID=IIISHOP;Password=IIISHOP;Data Source=IIISHOP;Persist Security Info=True" 
--------------------------------------------------------------------------------------------------------- 

- 조의재 대리 컴(Win XP Pro)에 설치 
백환일 대리 컴(Win XP Home)에 오라클 연결 에러 
 "Microsoft OLE DB Provider for Oracle" 이 에러 발생 
==============================================================================================================

- VNC 서버 사용 
백환일 대리 컴퓨터 
IP: 211.33.193.146 
PWD: i3shop 
--------------------------------------------------------------------------------------------------------- 
- VNC 서버 사용 
조의재 대리 컴퓨터 
IP: 211.33.193.168 
PWD: i3shop 
==============================================================================================================

- 자인 방문 
08:00 조의재 대리(회사차) 
09:00 자인물류 도착 
18:30 종료 
19:10 회사 복귀 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
- 재고 편차 조회 (/BizMgr/ItemStockMgr/stockInquiryStatDeclinP.jsp) 
BONUS_ITEM_CL: 수당상품구분(01:L&B, 02:R&F, 03:구L&B) 
ORDER_CRT_DTL_TP: 주문발생상세유형코드(01:일반, 02:R&F) 
==============================================================================================================

- PDA 에러 
구성요소를 찾을 수 없습니다. 
해결책: PDA 뒷쪽 맨위 랜카드 넣는 부분의 나사를 풀어서 랜카드를 다시 끼움 
==============================================================================================================

- 정수기 수정(접수취소 추가) 
주문번호: 0100012003101000409 이재봉 ==> 테스트 
주문번호: 0100012004083111366 i-yes/서울 ==> 테스트 
chOrder_type.Enabled = False    '접수취소 여부(불가능) 
------------------------------------------------------------------------------------------------------------------ 
이옥련 0100012004050601232   --> 반품주문번호: 0100012005110300232 
민은기 0100012003120900846   --> 반품주문번호: 0100012005102800125 
곽경희 0100012004090600476   --> 반품주문번호: 0100012005102700469 
==============================================================================================================

- 카드 한도 문의 
 김정희        jch1         Gold-M 
20051012, 이경숙, 0100012005101200134, 20051012 
1 - 기획매장 - 황토가 매트(싱글) - 천연염색패드 포함() -  - 390000 - 1 
6개월, 하나비씨카드 결제..-> 무이자 할부 기간내에 구매했는데, 수수료가 나왔다고 하심. 
------------------------------------------------------------------------------------------------------------------ 
주문번호: 2005101200134 --> 하나카드 ==> 378,000 원 결제  상품명: 황토가 매트(싱글) - 천연염색패드 포함 
주문번호: 2005101200140 --> BC카드 ==>  90,000 원 결제 
==============================================================================================================

- 관리비 이체 
농협: 177250-51-007099(진태만)  4만원: 11월, 12월 관리비 
농협: 150017-52-377791(15001752377791) 예금주: 김윤임  HP)* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.19(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 통합 수정
- 자인물류매출조회(/BizMgr/ReportMgr/SaleMgr/Anal_JainSaleListP.jsp) --> Anal_JainSaleListP 
==============================================================================================================

-정수기 재고 수정  
수령자 주소..바꿀려고..우편번호 검색하면 '424'런타임 오류가 발생하였습니다. 
개체가 필요합니다. 
==============================================================================================================

- 휴대폰 결제 오류 
모빌리언스 - 2200원 결제된거에 대해서 문의 
---> 이정자 - 016-214-4602로 2200원 결제를 해서 인증서 다운을 받았는데, 이중결제가 되었다고 하심  
==============================================================================================================

- SMS 문자 전송(순위)---> Evt산타_순위(55)  --> 총: 1756건  
 - SMS 문자 전송(순위) 
1~12위 
SMS 발송 문구:"[산타공지]1위~12위 순위권에 포함. 황금상타 주인공이 될수 있습니다. i3shop" 
13~50위(9일 ~15일 이후 발송) 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 황금산타 주인공이 될수 있습니다. i3shop" 
13~50위(21일 이후 발송) 
SMS 발송 문구:"[산타공지]당신은 13위~50위 순위권으로 13위 더블찬스상을 노리세요. i3shop" 
1313~2005위 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 1313위 더블찬스상을 노리세요. i3shop" 
==============================================================================================================

- 이용통계 페이지 
- SMS 전송 관리자 페이지 
https://mcash.mobilians.co.kr/smsgw/ ID/PWD(i3shop/757913) 
SMS 결제 담당자:  임영식 주임(*@*.*)  T) 02-2192-2163 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.20(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 21:00 

- 통합 수정
- 재고 편차 조회 (/BizMgr/ItemStockMgr/stockInquiryStatDeclinP.jsp) 
BONUS_ITEM_CL: 수당상품구분(01:L&B, 02:R&F, 03:구L&B) 
ORDER_CRT_DTL_TP: 주문발생상세유형코드(01:일반, 02:R&F)  
==============================================================================================================

- 최근 6개월 구매 회원 11,364 건 전송 ==> 12:00 ~ 12:15(15분 소요)  ---> Evt산타(54)  
SMS 발송 문구: "[황금산타 공지]소비보고를 통한 총상금5천만원의 지름길로 가세요! i3shop 1688-1313"   
==============================================================================================================

- 2005 추석 매장 주문 정보 조회  
04: 설 U29 
05설 V92 
05추석 W28 
==============================================================================================================

- 방문 접수후 취소한거 있는데요.. 
제가 잘못 접수해서요~~삭제 좀 부탁드릴꼐요~ 
0100012003110700882 건이예요~~~ 
==============================================================================================================

- 오즈 리포트 세팅 
D:\Project\OZProduct\OZDesigner25 폴더에서 OZDesigner.exe을 바탕화면으로 보내기   
DB 연결 실패 
C:\i3shop\OZProduct\OZServer25\conf\db.properties (지정된 경로를 찾을 수 없습니다)  
[DATA MODULE] ERROR DataModule - [Error Code :12202] Pool name is 'Oracle:211.23 
3.5.110:1521:i3shop:i3shop' 
해결책: C:\i3shop\OZProduct\OZServer25\conf에서 db.properties를 정확하게 설정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.21(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:30 

- 통합 수정
- 재고 조사 테스트 
==============================================================================================================

- 정수기 수정 
유무상 여부 조회 추가, 코드 수정 추가 
--코드 정보 조회 
SELECT * FROM T_CODE WHERE CODE_GROUP = '0009'  
----------------------------------------------------------------------------------------------------------------- 
08  물이나오지않음  --> 전체단수 
09 온수가나오지않음  --> 온수단수 
10 냉수가나오지않음  --> 냉수단수 
34 냉수불량  --> 추가 
35 온수불량  --> 추가 
36 기타 --> 항목추가 
----------------------------------------------------------------------------------------------------------------- 

- 민원유형 추가 
INSERT INTO T_CODE(CODE_GROUP, CODE, CODE_NM, REG_DT, REG_ID) 
VALUES('0009', '34', '냉수불량',  '20051221',  'tamario') 

INSERT INTO T_CODE(CODE_GROUP, CODE, CODE_NM, REG_DT, REG_ID) 
VALUES('0009', '35', '온수불량',  '20051221',  'tamario') 

INSERT INTO T_CODE(CODE_GROUP, CODE, CODE_NM, REG_DT, REG_ID) 
VALUES('0009', '36', '기타',  '20051221',  'tamario') 
==============================================================================================================

- SMS 문자 전송(순위)---> Evt산타_순위(55)  --> 총: 708건  
1~12위 
SMS 발송 문구:"[산타공지]1위~12위 순위권에 포함. 황금상타 주인공이 될수 있습니다. i3shop" 
13~50위(9일 ~15일 이후 발송) 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 황금산타 주인공이 될수 있습니다. i3shop" 
13~50위(21일 이후 발송) 
SMS 발송 문구:"[산타공지]당신은 13위~50위 순위권으로 13위 더블찬스상을 노리세요. i3shop" 
1313~2005위 
SMS 발송 문구:"[산타공지]아직 기회가 있습니다. 1313위 더블찬스상을 노리세요. i3shop" 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.22(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
- 재고 조사 수정 
6. 재고 실사서 작성(/stockInquiryByLocationP.jsp) 에서  
ㄴ) 일마감(/closeStockS.jsp) 
PKG_SUBUL_MAGAM.DAY_SUBUL_MAGAM: 수불장 돌리기 
ㄷ) 점의 재고관리 상품을 복사(/closeStockPrintS.jsp) 
T_STOCK_INQUIRY_DTL:재고실사 상세 정보 테이블 생성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.23(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
- 재고 조사 수정 
 6. 재고 실사서 작성(/stockInquiryByLocationP.jsp) 에서  
ㄱ) 실사수량 등록(/stockInquiryTempS.jsp) 
- 위치별 실사서 입력 조회(팝업)(/BizMgr/ItemStockMgr/stockInquiryEditP.jsp) 
ㄹ) 입력완료(/stockInquiryS.jsp) 
위치별 재고실사서 작성한 수량을 재고실사 상세정보(T_STOCK_INQUIRY_DTL)에 저장 
로케이션별 상품 정보저장(T_STOCK_INQUIRY_DTL 테이블에 LOCATION_LIST:로케이션 리스트)  
7. 재고 실사 승인(/stockInquiryAppP.jsp) 에서  
승인, 승인거부 수정 
8 .재고 편차 조회(/stockInquiryStatDeclinP.jsp) 에서  
실사상태 변경 추가 
==============================================================================================================

- 정수기 수정 
전순희 
0100012004081300402 
전산에는 체크밸루 파손(원래는 전제단수로 접수)으로 접수했는데~  
민원출력하면 기타부속빠짐으로 나옵니다~ 오늘 접수한거 말고 어제 접수건입니다~   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.24(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 20:00 

- 통합 수정
- 재고 조사 수정
 6. 재고 실사서 작성(/stockInquiryByLocationP.jsp) 에서  
ㄱ) 실사수량 등록(/stockInquiryTempS.jsp) 
- 위치별 실사서 입력 조회(팝업)(/BizMgr/ItemStockMgr/stockInquiryEditP.jsp) 
ㄹ) 입력완료(/stockInquiryS.jsp) 
위치별 재고실사서 작성한 수량을 재고실사 상세정보(T_STOCK_INQUIRY_DTL)에 저장 
로케이션별 상품 정보저장(T_STOCK_INQUIRY_DTL 테이블에 LOCATION_LIST:로케이션 리스트)  
7. 재고 실사 승인(/stockInquiryAppP.jsp) 에서  
승인, 승인거부 수정(/stockInquiryAppS.jsp) 
8 .재고 편차 조회(/stockInquiryStatDeclinP.jsp) 에서  
실사상태 변경 추가(/stockInquiryAppS.jsp) 
==============================================================================================================

- 정수기 수정 
권오도 
0100012003120800554 
이전설치인데~ a/s로접수됨!! 
신품교체, 이전설치 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 통합 수정
- SMS 문자 전송(순위)---> Evt산타_순위(55)  --> 총: 708건   
SMS 발송 문구:"[황금산타 마감공지]12월27일 24시까지 현금입금확인 및 소비완료 기준 [전산상기준]"  
이벤트 참가자 전원에게 위의 내용대로 SMS 금일 발송 부탁 
==============================================================================================================

- 수불장 금액 1원 차이 ==> 수불장 수정  
NVL(TRUNC( 
      SUM( 
   ( 
     CASE 
       WHEN B.TAX_YN = 'Y' THEN 
 B.BUYING_PRICE - (B.BUYING_PRICE / 1.1) 
       ELSE 
     0 
 END 
   ) * B.STOREIN_QTY 
 ) 
 ), 0) + SUM(CASE WHEN B.TAX_YN = 'Y' THEN 1 ELSE 0 END) AS IPGO_WONGA_VAT,    --입고원가(VAT) 
--------------------------------------------------------------------------------------------------------------- 

-  수불장 
(K)애경 스파크 리필 5.5kg 대경상사 879,999(매입금액) 
- 대금정산 
입고원가_VAT = (8000 * 51) - ((8000/1.1)*51) = 879,998(공급가액) 
--------------------------------------------------------------------------------------------------------------- 
입고원가_VAT = (8000 * 1) - ((8000/1.1)*1)  
입고원가_VAT = (8000 * 50) - ((8000/1.1)*50) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.27(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
사용여부, 적용일자, 만료일자 수정  
==============================================================================================================

- 정수기 수정 
0100012003112100572 건...반품 한건 인데요~ 
2005년9월21 일날 온수단수로 a.s접수되어있거든요~그건..a./s삭제해 주시고요~.. 
0100012003112100578 주문번호로 온수단수. 
2005년9월21일로 a.s접수해주세요~ 
[18818]--->삭제 부탁드려요~~ 

처리일자 와 처리내용이 존재하는데 주문상태 설치완료(04) 가 아닌 것(설치완료로 수정) 
20040901 5건, 20040901 이후 227  건 
12023, 11812   ===> 배송만 된 것(파란색 아님) 
==============================================================================================================

-- 입고원가(VAT) UPDATE 
UPDATE T_DAY_SUBUL U 
SET  U.IPGO_WONGA_VAT = U.IPGO_WONGA_VAT + 1  --입고원가(VAT)   
WHERE EXISTS 
  (SELECT 'x' 
  FROM T_STOREIN A, T_STOREIN_DTL B 
  WHERE A.COMPANY_CD = B.COMPANY_CD 
    AND A.MERCHANT_CD = B.MERCHANT_CD 
    AND A.STOREIN_DT = B.STOREIN_DT 
    AND A.STOREIN_NO = B.STOREIN_NO 
AND A.COMPANY_CD = U.COMPANY_CD 
    AND A.MERCHANT_CD = U.MERCHANT_CD 
AND A.STOREIN_DT = U.SUBUL_DATE 
AND B.ITEM_CD = U.ITEM_CD 
    AND A.COMPANY_CD = '01' 
    AND A.MERCHANT_CD = '9001' 
AND A.STOREIN_DT >= '20051101'   --입고일자 
AND A.STOREIN_DT <= '20051130'   
AND B.TAX_YN = 'Y'   --과세여부 
--AND U.ITEM_CD IN ('00000588')    --상품코드 
AND MOD(U.IPGO_WONGA_VAT, 10) <> 0 --입고원가(VAT) 
  ) 
==============================================================================================================

column_name = "123,000"; 
SELECT instr(column_name,','), SUBSTR(column_name, 1, 1) FROM table_name ; 
=> ',' 이 위치한 첫번째 자리수를 리턴합니다. 
리턴받은 자리수가 4 라면 4 이전의 3까지 select  
select substr(column명 , 0,3) from table명 ; 
=>  하면 123 을 얻을수 있겠죠 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:30 

- 통합 수정
- 재고 조사 수정 
------------------------------------------------------------------------------------------------------------------------------ 

- 20051227 바뀐 로케이션 
501.-A, 501.-B, 502.-B, 501_C, 801_B 
------------------------------------------------------------------------------------------------------------------------------ 

502-B --> 502-D 
502-D --> 502-B 로 수정  
502-D --> 502-Z 
502-B --> 502-D  --> 변경 
502-Z --> 502-B  --> 변경 
==============================================================================================================

- 필드 붙이기(MS-SQL) 
SELECT '1' +  I3SHOP_ORDER_NO  AS I3SHOP주문일자 
FROM T_ORDER 
WHERE I3SHOP_ORDER_NO  IN( '0100012004040800144'); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.29(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 01:00 

- 재고 조사(2005년 하반기 재고 조사)   
20:00  재고실사(1차, 2차) 
21:10  재고실사 등록 
21:48  재고실사 등록 종료 
21:53 1차 입력완료 
21:53 1차 재고편차 조사(편차: 6,783,023 원) 
23:07 2차 재고실사 등록 
23:40 야식 
24:00 2차 입력완료 
21:53 2차 재고편차 조사(편차: -1,038,801 원( 339,051 원으로 착각함)) 
01:00 종료 
------------------------------------------------------------------------------------------------------------ 

- 자인물류에서 Eclipse 실행 
 http://211.33.193.148/index.jsp 
==============================================================================================================

- 통합 수정
- 재고 조사 수정  
 편자재고 조정 출력 수정 
 최종 테스트 
==============================================================================================================

- 신용카드 에러 
0100012005122800730 문혜성 
==============================================================================================================

- 정수기 수정 
<18826>--> 냉수단수, 온수 단수로 접수했는데요 
민원유형을 냉수불량, 온수불량으로 수정 
------------------------------------------------------------------------------------------------------------ 
0100012004010900302  
배송일자-> 2004년1월15일 ,,설치일자->2004년1월15일--변경전 
배송일자->2003년 12월 1일..설치일자->2004년 6월29일 --변경후 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 통합 수정
- 재고 조사 수정 
3차 재고실사 등록, 편차 조회(편차: -138,415원) 
------------------------------------------------------------------------------------------------------------------------

- 상품 삭제 요청(백환일 대리) 
지문인식기 상품코드: 00153090 
==============================================================================================================

- 정수기 수정 
배송일자, 설치일자가 입력된 건중 처리일자가 없는건은 
설치일자를 처리일자로 일괄 입력....  --> 775 
색상은 파란색으로 
------------------------------------------------------------------------------------------------------------------------
<18843> --->오늘 접수한건인데요..죄송한데요~ 
접수잘못해서 삭제 부탁드릴께요`~~ 
==============================================================================================================

- 신용카드 에러 
0100012005122800729(주문상태: 카드승인오류)  ===> 신용카드: 승인 
0100012005122800730(주문상태: 결제완료)  ===> 신용카드: 승인 
0100012005122800730(주문상태: 결제완료)  ===> 신용카드: 취소승인(비씨마스타체크  취소OK: 56299167) 
------------------------------------------------------------------------------------------------------------------------
원인: 0100012005122800729 신용카드 정상 결제되고 속도가 느려서 고객이 클릭을 한번 더 해서 
9초 차이로 0100012005122800730 생성되고 신용카드 결제가 되고 데이타 저장하는 과정에서 에러가 생겨 취소승인 됨 
0100012005122800729 는 정상 승인이므로 파리미터로 로프를 빠져 나옴  
------------------------------------------------------------------------------------------------------------------------
0100012005122800701(주문상태: 카드승인오류)  ===> 신용카드: 승인 
0100012005122800703(주문상태: 결제완료)  ===> 신용카드: 승인 
0100012005122800703(주문상태: 결제완료)  ===> 신용카드: 취소승인(비씨개인일반카드취소OK: 56272223) 
------------------------------------------------------------------------------------------------------------------------

0100012005122800393(주문상태: 배송중)  ===> 신용카드: 승인(거래번호 2개 만들어 짐) 
0100012005122800389(주문상태: 배송중)  ===> 신용카드: 승인(거래번호 2개 만들어 짐)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.12.31(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보)  
==============================================================================================================

- 종무식(12:30 ~ 13:00) 
==============================================================================================================

-  수불장 수정(1원 차이 수정) 
START: (15:30 ~ 18:00)  --> 2시간 30분 
------------------------------------------------------------------------------------------------------------------------

-- 수불장 조회 @@@@@@@@@@@@@@@@@@@@22 
SELECT B.STOREIN_DT, U.ITEM_CD, B.TAX_YN, U.IPGO_WONGA_VAT, 
U.IPGO_WONGA AS 입고원가, U.IPGO_WONGA_VAT AS 입고원가_VAT, --입고원가_VAT가 정확해야 함 
NVL(U.IPGO_WONGA, 0) - NVL(U.IPGO_WONGA_VAT,0) AS 매입금액 --매입금액이 대금정산에서 공급가액과 같을 것 
  FROM  T_STOREIN_DTL B, T_DAY_SUBUL U 
  WHERE B.COMPANY_CD = U.COMPANY_CD 
AND B.MERCHANT_CD = U.MERCHANT_CD 
AND B.STOREIN_DT = U.SUBUL_DATE 
AND B.ITEM_CD = U.ITEM_CD 
AND B.COMPANY_CD =  '01' 
AND B.MERCHANT_CD = '9001' 
AND B.STOREIN_DT = '20051103'   --입고일자 
AND B.TAX_YN = 'Y'   --과세여부 
AND MOD(U.IPGO_WONGA, 10) <> 0 --입고원가(VAT) 
--;  
------------------------------------------------------------------------------------------------------------------------

-- 입고원가(VAT) UPDATE 
UPDATE T_DAY_SUBUL U 
SET U.IPGO_WONGA_VAT = U.IPGO_WONGA_VAT + 1  --입고원가(VAT) 
WHERE EXISTS 
	  (SELECT 'x' 
	   FROM  T_STOREIN_DTL B   
	  WHERE B.COMPANY_CD = U.COMPANY_CD 
		AND B.MERCHANT_CD = U.MERCHANT_CD 
		AND B.STOREIN_DT = U.SUBUL_DATE 
		AND B.ITEM_CD = U.ITEM_CD 
		AND B.COMPANY_CD = VAR_COMPANY_CD 
		AND B.MERCHANT_CD = VAR_MERCHANT_CD 
		AND B.STOREIN_DT = VAR_SUBUL_DATE --입고일자   
		AND B.TAX_YN = 'Y'   --과세여부 
		AND MOD(U.IPGO_WONGA, 10) <> 0 --입고원가(VAT) 
 ) 
==============================================================================================================

DECLARE 

START_DT CHAR(8); 
END_DT CHAR(8); 
NOW_DATE DATE; 
END_DATE DATE; 
RE_TEXT VARCHAR2(2000); 

BEGIN 
    START_DT := '20051203'; --START_DT가 2005 0110 날짜이면 0109 일자 수불장 처리 
END_DT := '20051230'; --END_DT는 오늘날짜 초과한 날짜는 절대 넣지 말것 
NOW_DATE := TO_DATE(START_DT); --시작일 
END_DATE := TO_DATE(END_DT); --종료일 

LOOP 
IF NOW_DATE > END_DATE THEN 
      EXIT; 
END IF; 

RE_TEXT := PKG_SUBUL_MAGAM_3.DAY_SUBUL_MAGAM('01', '0002', TO_CHAR(NOW_DATE, 'YYYYMMDD')); -- Package내에 있는 함수 호출 
RE_TEXT := PKG_SUBUL_MAGAM_3.DAY_SUBUL_MAGAM('01', '9001', TO_CHAR(NOW_DATE, 'YYYYMMDD')); -- Package내에 있는 함수 호출 
-- PKG_SUBUL_MAGAM.DAY_MEIP(TO_CHAR(NOW_DATE, 'YYYYMMDD'));   -- Package 호출 
NOW_DATE := NOW_DATE + 1; 
END LOOP; 
END; 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■