  

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.11) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.11.01(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> LG U+ Prj 투입
 
- LG U+ 게시판 기능 개선 Prj[★] 
05:00 기상
05:40 조식
06:00 집출발(백팩, LG 모니터(M2450D-PN) 가지고 감)
06:20 신대방역
07:00 발산역 도착
07:15 LG 사이언스파크E 11동 지하 1층 ==> 도보
08:40 (주)와이즈인포텍 박원상 부사장 만납 ==> 아메리카노 얻어 먹음
09:10 (주)와이즈인포텍 노동연 이사와 전화 통화 ==> 프로젝트 사업장이 마곡 사옥이 아니고 상암 사옥이라고함
09:20 철수(내일부터 상암동 출근하라고 함)
09:25 발산역
10:10 신대방역 도착
10:20 귀가 
10:25 인터넷 서핑 ==>
12:00 중식
12:30 실내 도보 
14:00 종료
14:10 인터넷 서핑 ==> 주남이형 조립 PC 분석, 주문, 결제(내 현대카드로 결제 --> 주문이형이 송금해줌)
18:00 석식 
18:20 실내 도보 
20:00 종료 
20:10 인터넷 서핑
22:00 가계부 월말 결산 처리
23:10 취침
==============================================================================================================

[★] LG CNS 투입 전 필수 등록 사항(LG CNS 파트너플러스) 
01. LG CNS PartnerPlus ==> https://partnerplus.lgcns.com/lpp/home --> DEV109094 / 22ta오*둘@
2. 개인정보 및 경력사항 등록 
3. 주식회사: 에코소프트 (사업자등록번호 : 132-86-13602)  (회사변경요청중)
------------------------------------------------------------------------------------------------------------------------

51. LG CNS 캠퍼스(기본교육수강: IE에서 만 가능)
http://partnercampus.lgcns.com/layout/layout/partMain.dev --> DEV109094 / 22ta오*둘@
==============================================================================================================

- 주남이형 조립 PC 추천 @@@  ==> 완료[♥♡] 
01. 프리플로우 ELITE 홈오피스 i5 [8GB, SSD 240GB], 가격: 459,000원(카드) ==> 주문 완료[♥♡] 
1. 메모리 변경 - C60342_삼성전자 16GB 25600 (16GB x1) ==> 총 금액: 509,000원(카드)
http://www.enuri.com/detail.jsp?modelno=57215711
https://www.lotteon.com/p/product/LO1435151731?entryPoint=mysel&sitmNo=LO1435151731_1435151732&mall_no=1&dp_infw_cd=MLT
==============================================================================================================

- 미래에셋 증권
https://securities.miraeasset.com/imf/100/imf703.do --> tamario / 22ta오*@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.02(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 재택 근무
 
- LG U+ 게시판 기능 개선 Prj[★]
- 보안서약서 등록, 교육수강 요청
1. 투입시작일자가 없어서 등록 안됨((주)와이즈인포텍 노동연 이사에게 확인)
==============================================================================================================

- LG U+ Prj[★] 
05:00 기상
05:40 조식
06:00 실내 도보 
07:20 종료
07:25 인터넷 서핑 ==> 보안서약서 등록, 교육수강 작성 시도
12:00 중식
12:30 실내 도보 
14:00 종료
14:10 인터넷 서핑 ==> 장판 검색
16:10 집출발(자전거) ==> 노트북 잠금 장치 구입하러 감
16:50 신도림 테크노 마트 방문 ==> 3층(컴퓨터 매장), 9층(핸드폰 매장) ==> 노트북 잠금 장치 판매 안함
17:00 이마트 신도림점 방문 ==> 노트북 잠금 장치 판매 안함
17:30 이마트 구로점 방문 ==> 노트북 잠금 장치 판매 안함
17:55 귀가 
18:00 석식 
18:20 실내 도보 
20:00 종료 
20:10 인터넷 서핑 
23:10 취침
==============================================================================================================

- USB 허브 구입
- EFM네트웍스 ipTIME UH505-QC1 [유전원(어댑터 포함)] (USB 허브), 가격: 36,200원
http://www.enuri.com/detail.jsp?modelno=37564617
==============================================================================================================

- IE 11 이 필요한데, 윈도우11은 못쓴다? 그럴때 IE 11 꺼내 쓰는 방법
https://youtu.be/fP4WLtGunSI
1. EDGE에서 점 3개 더보기--> 설정 ==> 설정 화면(edge://settings/profiles)
 1) 기본 브라우저 [왼쪽 탭] --> 기본 브라우저 화면
 2) Internet Explorer 호환성
  가. Internet Explorer 모드로 다시 로드 ==> 호환되지 않는 사이트만: 선택 ■■■
  나. 사이트를 Internet Explorer 모드로 다시 로드 ==> 허용: 선택 ■■■
  ==> 다시 시작: 클릭
2. EDGE에서 점 3개 더보기--> 기타도구 -> internet explorer 모드에서 다시로드를 클릭 
3. IE모드가 동작하면 상단에 Internet Explorer 모드로 들어왔다는 메시지가 뜹니다.
4. 02. PartnerCampus 접속
https://partnercampus.lgcns.com/layout/layout/mainFrame.dev
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.03(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  LG U+ Prj 다시 투압(09시, 상암 사옥[첫 방문]: 노동연 이사 만남)
 
- LG U+ 게시판 기능 개선 Prj[★]
05:00 기상
05:40 조식
06:00 집출박(오주코 백팩: 편안함)
06:15 신대방역 
07:00 디지털 미디어시티 역 도착
07:20 LG U+ 상암 사옥 도착
08:50 (주)와이즈인포텍 노동연 이사 만남
09:10 LG U+ 12층 도착(방문증 발급 받음[매일 발급받아야 함], 회의실에 탁자에 짐 풀기): 열악한 상황
		==> 현업 담당자인 손태기 책임(PL, LG CNS)은 오늘 재택 근무라 못 봄
09:25 MIS 노트북 셋팅  ==> LG U+ SW 설치, U Cloud 설치및 셋팅
10:25 무선 네트쿼크 사용 에러 ==> LG U+ 직원이 와서 해결해줌(CWP에서 SW 다운로드 받아서 재설치)
11:40 중식(편의점 김바: GS25 SH상암1호점)
11:50 도보
12:25 오피스 디포 코리아 방문 ==> actto 폴시트 노트북 도난방지 케이블(18,000원) 구임
13:10 노트북 도난방지 케이블 설정 잘못하여 비밀번호 분실함
13:55 오피스 디포 코리아 방문 ==> 비밀번호 몰라서 A/S 처리 안된다고 함 
17:10 오피스 디포 코리아 방문 ==> actto 폴시트 노트북 도난방지 케이블 A/S 맡김(1주일 걸린다고 함)
18:00 퇴근 
19:00 석식 
19:20 실내 도보 
20:00 종료 
20:10 인터넷 서핑
23:10 취침
==============================================================================================================

- LG U+ SW 설치( 노동연 이사가 도와 줌)
http://172.30.10.173/genian_EMS.htm

- U Cloud Portal
https://ucloud.lguplus.co.kr --> tamario01 / 632d14a0c4  --> 22ta오*둘!
----------------------------------------------------------------------------------------

- M 메신저 로그인
1. tamario01 / 22ta오*둘@
==============================================================================================================
 
- Cloud PC 신청 및 결재(우서범 사원이 도와 줌) ==> 완료[♥♡]
1. 신청사유 : 
 1) AS 매뉴얼 게시판 기능 개선 개발 업무를 위한 신규 투입으로 신청
 2) 방화벽 신청을 위한 지정 클라우드 고정 IP 사용 필요로 인한 개발 클라우드 신청을 드립나다.
==============================================================================================================
 
- 보안 클라우드 신청(17:47)   ==> 완료[♥♡]
1. 신청사유 : AS 매뉴얼 게시판 기능 개선 개발 업무를 위한 신규 투입으로 인한 보안 클라우드 신청드립나다.
==============================================================================================================
 
- CWP (Captive Web Portal) (무선 네트쿼크 에러 조치: 재설치)
http://gnac.lguplus.co.kr/cwp/faces/common/main.xhtml
==============================================================================================================

- 주남이형 조립 PC 도착
1. 모니터 설치
2. 윈도우10 설치 ==> 드라이버 설치 안됨(다른 부탕 USB로 다시 설치해 볼 것)
==============================================================================================================

- 노트북 잠금 장치 구입
1. actto 폴리스 노트뷱 도난방지 케이블 NBL-04(LG U+ Prj용), 오피스디포 상암DMC점에서 직접 구입, 가격: 18,000원
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2190198713&GoodsSale=Y&jaehuid=200002673

- 노트북 자물쇠 잠금 해제, Unlock Notebook, 노트북 자물쇠 해체
https://youtu.be/2yP3cmEPgbA
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.04(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>   
 
- LG U+ 게시판 기능 개선 Prj[★]
- 업무 미팅(13:20, 손태기 책임 자리에서)
1. 게시판 기능 개선
 1) AS 전체 게시판 추가
 2)  Web 게시판 검색 조건 추가
==============================================================================================================
 
- 외부접속/모바일앱사용 신청(13:54)  ==> 완료[♥♡]
1. 신청사유 : 코로나 사태 대비 AS 매뉴얼 게시판 기능 개선 개발을 위한 외부 접속 신청 드립니다.
==============================================================================================================

- WS5 소스 분석
1. 
- eclipse에서 add Bookmark 사용
--> [▶_01] 06. 병역 여부 <w2:column>....</w2> ==> add Bookmarks 처리 ■■■
<!--// 01. 개인 정보 Grid //-->
<w2:gridView adaptive="" adaptiveThreshold="" autoFit="allColumn" class="dmb cm_grid" columnMove="true" dataDragDrop=""
	dataDragSelect="" dataList="data:dl_person" defaultCellHeight="" ev:onafteredit="scwin.gridView1_onafteredit" ev:onbeforeedit="" 
	rowStatusVisible="" scrollByColumn="false" scrollByColumnAdaptive="false" senseReader="" style="height:370px;"
	summaryAuto="false" tooltipDisplay="true" tooltipDisplayColumn="INFO" useCtrlOnMultisort="" useShiftKey="true" 
	visibleRowNum="8" editModeEvent="onclick" keyMoveEditMode="true"> 
	<w2:column allOption="" blockSelect="false" chooseOption="true" chooseOptionLabel="" displayMode="label"
	id="MILITARY" inputType="select" ref="" style="" value="" width="70" viewType="icon"> <!--// 06. 병역 여부 //-->
		<w2:choices>
			<w2:item>
				<w2:label><![CDATA[군필]]></w2:label>
				<w2:value><![CDATA[fulfilled]]></w2:value>
			</w2:item>
			<w2:item>
				<w2:label><![CDATA[미필]]></w2:label>
				<w2:value><![CDATA[unfulfilled]]></w2:value>
			</w2:item>
			<w2:item>
				<w2:label><![CDATA[면제]]></w2:label>
				<w2:value><![CDATA[exempted]]></w2:value>
			</w2:item>
		</w2:choices>
	</w2:column>
</w2:gridView>

--> [▶_02] gridView1_onafteredit 함수(Grid 컬럼 클릭 이벤트)  ==> add Bookmarks 처리 ■■■
scwin.gridView1_onafteredit = function(row, col, value) {
	console.log("[/06_08.xml] [gridView1_onafteredit()] ==> [Grid 컬럼 클릭 이벤트(포커스가 빠진후 발생)] [TEST_01] 
	[row]"+ row +"[col]"+ col +"[value]"+ value ); 
	
	var colId = this.getColumnID( col );
	console.log("[/06_08.xml] [gridView1_onafteredit()] ==> [TEST_02] [colId]"+ colId ); 
	
	if (colId == "MILITARY"){
		this.refreshCell( row , "MILITARYINFO" );		// MILITARYINFO 컬럼
		dl_person.setCellData( row , "MILITARYINFO" , "" );		//  MILITARYINFO	
	}
};

--> [▶_03] 07. 병역 정보 <w2:column>....</w2> ==> add Bookmarks 처리 ■■■
<w2:column blockSelect="false" checkboxLabel="" displayMode="label" falseValue="0" id="MILITARYINFO"
	inputType="custom" style="" trueValue="$blank" typeGetter="scwin.getCustomType" value="" valueType="other" width="120">
</w2:column>		 <!--// 07. 병역 정보 //-->
-----------------------------------------------------------------------------------------------------------------------

- [gridView] gridView inputType이 custom인 typeGetter 속성 샘플
https://inswave.com/confluence/pages/viewpage.action?pageId=14716765
1. gridView의 각 Cell 타입을 동적으로 변경 할 수 있다
2. col2 컬럼의 값이 1 일때 col1 컬럼을 selectbox 로 동적 설정한다.
3. 설정
column 속성으로 inputType="custom" typeGetter="scwin.getType" 설정
scwin.getType function 구현
scwin.grd_onviewchange 이벤트에서 변경된 Row 를 Refresh (grd.refreshRow(info.rowIndex))
==============================================================================================================

01. WS 교육, API
https://wtech.inswave.kr/websquare/websquare.html?w2xPath=/ws/index.xml&inPath=edu

02. WS 기술지식in
https://inswave.com/confluence/pages/viewpage.action?pageId=6030702
==============================================================================================================

- 윈도우10 부팅 USB 만들기(21시, 집)
https://m.blog.naver.com/sgjjojo/221546872268
1. 윈도우 10 설치파일 다운로드
https://www.microsoft.com/ko-kr/software-download/windows10
2. 사용할 미디어 선택
 1) USB 플래시 드라이브: ■■■
3. 윈도우10 설치 후 네트워크 드라이브 성성 안됨
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.05(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>   
 
- LG U+ 게시판 기능 개선 Prj[★]
- 사용하실 CLOUD PC
1. 업무 Cloud PC(통합 OSS)
2. PCPC01S476: 협력사 보안 Cloud PC [172.28.185.102] --> (출근하니깐 설치 완료되어 있음)
3. PCPC02W164: 협력사 개발 Cloud PC[172.28.49.64]
==============================================================================================================

- 방화벽 해지 신청 ==> 신청 안됨
1. 협력사 개발 Cloud PC에서 신청 
-----------------------------------------------------------------------------------------------------------------------

- 시스템 계정 등록 (DBMS 권한) 신청 ==> 번려됨(재신청할 것)
1. 협력사 개발 Cloud PC에서 신청
2. 종류
 1) DBsafer 계정 신청 ==> DBsafer 설치
 2) DB 접속 권한 신청
 3) Trust Orange 계정 신청 ==> Orange 설치
 4) Oracle 설치
 5) Git 설치
==============================================================================================================

- ALSee 918 설치
1. ALSee918.exe
==============================================================================================================

- LG전자 27MK430H, 27인치 모니터, 가격: 188,500원 도착(조은 사람들) ==> 판매자와 1주일 가량 실랑이 함(열받음)
http://www.enuri.com/detail.jsp?modelno=30169234
https://goodpeopleshop.co.kr/shop/product_detail.html?pd_no=105408
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.06(토) 작업 ■■■■■■■■■■■■■■■■■■ 
------> 07:30 ~ 18:00 ==> 

- 주말2[★]
05:00 기상
05:40 조식
06:00 집출발(도보)
06:22 신대방역
07:44 파주역 도착
07:48 태용이 차
07:55 편의점(캔 커피 2개: 태용이가 쏨)
08:00 태용이 숙소(로사주택 301호(파주시 덕은리 907-2)) 도착: 이사짐 나르기
08:10 봉고차 기사 도착 ==>서랍장, 장롱, 침대 옮김
09:40 짐정리 종료
09:45 파주 출발 ==> 태용이 회사 차(QM5) 탑승
12:15 풀하우스 101호(경기 용인시 처인구 역북동 504-3) 도착
12:20 이사짐 나르기 ==> 기타 짐
12:25 봉고차 기사 도착 ==> 서랍장, 장롱, 침대 옮김(태용이 와이프 와 있음)
13:03 이사 종료
13:15 중식(홍짜장: 짜장면, 탕수육): 태용이가 쏨
13:40 종료 
13:50 숙소 출발(태용이 차) 
14:00 기흥역 도착
16:00 신림역 도착
16:14 다이소 신림3호점 방문 ==> 알루미늄 미니 카라비너 4P(고리) (천원), 직사각 샐러드 도시락(3천원), 3M 스카치 다용도 테이프 
		 디스펜서 (18mm*25m) (2천원), 박스테이프 커터 2000, 무릎 보호 밴드(2천원) 구입
16:27 귀가  
16:40 인터넷 서핑 
18:00 석식
18:30 실내 도보 
20:00 종료 
20:05 인터넷 서핑  
22:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.07(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:40 조식
08:00 실내 도보 
08:10 종료
08:15 인터넷 서핑
08:30 주남이형 조립PC SW 설치 ==> 윈도우10  정품인증 제품키 구입 및 설치
12:00 중식
12:30 실내도보 
14:00 종료
14:10 주남이형 조립PC SW 설치
16:33 집출발(자전거) ==> 주남이형 조립PC 박스 가져감
16:45 GS25 신대방노블점) 방문 ==> 주남이형 조립PC 박스 착불로 주노 세탁소로 보냄 
16:55 다이소 난곡사거리점 방문 ==> 잠금식 카라비너 2P(천원),  무릎 보호 밴드(2천원) 구입
17:08 귀가
17:10 인터넷 서핑
18:00 석식
18:30 실내 도보 
20:00 종료
20:05 청소 
20:40 샤워
20:88 인터넷 서핑  
22:50 취침
==============================================================================================================

- 윈도우10  정품인증 제품키 구입[주남이형 조립PC용]
1. [바로발송] 마이크로소프트 윈도우 10 프로/홈 정품인증 제품키 windows 10 pro/home, 가격: 1,500원(내가 카카오 페이 결제함)
https://front.wemakeprice.com/product/1863128582 
==============================================================================================================

- 모바일 핫스팟 및 테더링을 이용한 데스크톱 인터넷 연결 방법[놀던청년]
https://youtu.be/cKz-Rw2nxcE
https://m.blog.naver.com/ubprime/221990928289
1. 폰과 PC를 연결
 1) 정상적으로 연결이 되면 PC에 그림과 같은 메세지가 팝업됩
  2) 폰에서 접근 허용
2. 폰에서
  1) 설정 --> 모바일 핫스팟 및 테더링 --> USB 테더링: 활성화
3. PC에서
  1) PC 네트워크 연결 정보 보면 현재 인터넷(네트워크) 연결 안된 상태
  2) 폰과 PC 연결후 USB 테더링이 완료 되면 그림과 같이 이더넷 아이콘이 추가 되고, PC에서 별다른 작업 없이 인터넷이 가능한 상태가 됨  
==============================================================================================================

- 숙소 예약 ==> 2021.11.07(일) 완료[♥♡] 
1. 서귀포 JS 호텔디럭스 트윈 (측면 오션뷰) 객실 only ✕ 1,  2박{1월 6일(목) ~ 7일(금)], 가격: 141,360원
https://www.myrealtrip.com/accommodations/stays/14730
==============================================================================================================

- 렌터카 예약 ==> 2021.11.07(일) 완료[♥♡]  --> 취소
1. 아이오닉 (충전비 별도 발생), 땡큐제주렌트카, 1월 6일(목) 10시 ~ 8일(토) 10시, 가격: 186,200원
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.08(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> LG전자 27MK430H, 27인치 모니터 들고 감
 
- LG U+ 게시판 기능 개선 Prj[★]
- 사용하실 CLOUD PC
1. 업무 Cloud PC(통합 OSS)
2. PCPC01S476: 협력사 보안 Cloud PC [172.28.185.102]  
3. PCPC02W164: 협력사 개발 Cloud PC[172.28.49.64]
==============================================================================================================

- 방화벽 해지 신청[협력사 개발 Cloud PC에서] ==>  
1. 협력사 개발 Cloud PC에서 신청 
-----------------------------------------------------------------------------------------------------------------------

- DBMS 권한 신청[협력사 개발 Cloud PC에서] ==>  
1. 협력사 개발 Cloud PC에서 신청
2. 종류
 1) DBsafer 계정 신청 ==> DBsafer 설치
 2) DB 접속 권한 신청
 3) TrustedOrange 계정 신청 ==> Orange 설치
 4) Oracle 설치
 5) Git 설치
==============================================================================================================

- 렌터카 예약 ==> 2021.11.08(월)) 완료[♥♡] 
1. 아이오닉 (충전비별도발생) 2022년 01월 06일 (목) 오전 10:00 ~2022년 01월 08일 (토) 오후 6:00, 56시간, 가격: 231,600원
 1) 차량 대여료: 176,400원, 고급 자차: 67,200원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.08(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근시 비 많이 옴(LG  27인치 모니터 가지고 와서 설치: 만족), 중식(지하 1층 매점: 컵라면 빵[비옴])
 
- LG U+ 게시판 기능 개선 Prj[★] 
- 방화벽 해지 신청 ==> 신청되어 있었음
1. 협력사 개발 Cloud PC에서 확인 
2. 협력사 보안 Cloud PC에서 확인
 1) 개발기
 2) Git
 3) jenkins
==============================================================================================================

6. 시스템 계정 등록(DBsafer 계정) 신청==> 재신청
0. 결재자 변경: 이정우 책임 --> 하태규 책임
1. DBsafer 계정 신청 ==> DBsafer 설치
-----------------------------------------------------------------------------------------------------------------------

7. 시스템 계정 등록(DBMS 권한) 신청==> 재신청
0. 결재자 변경: 이정우 책임 --> 하태규 책임
 1) DNOSS, TNOSS2, POSS4
 -----------------------------------------------------------------------------------------------------------------------

8. Trust Orange 신청 ==> 재신청
0. 결재자 변경: 이정우 책임 --> 하태규 책임 
==============================================================================================================

- 계정 패스워드 신청
0. 협력사 개발 Cloud PC에서 진행
1. 대상
 1) DBsafer, Trust Orange
==============================================================================================================

- 프로그램 설치 후 실행
0. 협력사 보안 Cloud PC에서 진행 
==============================================================================================================

- 새로 구입한 LG  27인치 모니터 셋팅
1. 드라이버 필요함(하단 볼트 2개)
2. 모니터 받침대 시소닉 650 와트 파워 전원 공급 장치 박스로 처리(만족함: 재사용할 것)
3. 출근할 때 비가 와서 박스 비에 약간 젖음
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.09(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> LG U+ Prj 개발 환경 셋팅 완료, 손태기 책임 약센 백신 휴가(내일 출근 예정)
 
- LG U+ 게시판 기능 개선 Prj[★] 
- (주)와이즈인포텍 김춘미 과장(공통) 방문(14:40)
1. 게시판 소스 설명
2. 개발 Cloud PC에서 개발, 통시에 계정 등록 요청 ==> 처리됨
==============================================================================================================

- 보안 Cloud PC에서 eclipse 셋팅
1. wafful 폴더 설정
 1) hptt://localhost:8080 --> AuthCheck 에러 발생
==============================================================================================================

- 보안 Cloud PC에서 GitHub 생성 및 설정
1. 에러 발생 
 1) GitHub 서버 경로 못 찾음
==============================================================================================================

- 로컬 노트북 GitHub 생성 및 설정
https://github.com/JINTAEMAN/WRM   ---> tamario@naver.com/22ta오*!    --> Username: JINTAEMAN
https://github.com/JINTAEMAN/WRM.git
1. 기본 디렉토리:  C:\WEBSQUARE_DEV_PACK\workspace\WRM
==============================================================================================================

- 깃, 깃허브 한번에 이해시켜드리고 포트폴리오 올리는 법[코딩알려주는누나]
https://youtu.be/lelVripbt2M

- 회사에서 개발자들은 어떻게 일할까?[코딩알려주는누나] 
https://youtu.be/cwC8t9dno2s

- 깃, 깃허브 제대로 배우기 (기본 마스터편, 실무에서 꿀리지 말자)[드림코딩 by 엘리]
https://youtu.be/Z9dvM7qgN9s

- Cmder [Windows 콘솔 에뮬레이터] 설치 방법 + 한글사용방법
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=altmshfkgudtjr&logNo=221461221105

- 깃헙(GitHub) 블로그 10분안에 완성하기[테디노트] --> GitHub Pages
https://youtu.be/ACzFIAOsfpM

- Java 기초 Tip - 이클립스에서 Git 사용하기[시니어코딩]
https://youtu.be/TGjjmDZoyB4
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.11.10(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>
 
- LG U+ 게시판 기능 개선 Prj[★] 
- 보안 Cloud PC에서 GitHub 생성 및 설정
1. GitExtensions SW 재설치
==============================================================================================================

- 업무 미팅(09:40, 손태기 책임 자리에서)
1. 게시판 기능 개선.ppt 파일 메일로 보내준다고 함
 1) 내가 검토해보고 개선사항 추가하면 현업과 협의 한다고 함
 2) 출입증은 결재 잘못 신청함: 다시 결재 신청한다고 함
==============================================================================================================

- AS 게시판 요구사항 정의서 메일로 받음(16시, 손태기 책임)
1. DB 설계서 작성
2. 요구사항 정의서 작성
==============================================================================================================
 
- 01. github 블로그 생성
https://jintaeman.github.io
https://github.com
 
 1. 파일 생성
_posts/2021.11.10_first.md
_posts/2021-11-10_second.md
==============================================================================================================

- 이클립스 : 검색할 특정폴더를 지정해서 일치하는 문자열 찾기 
1.  https://stove99.tistory.com/133
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.11.11(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>
 
- LG U+ 게시판 기능 개선 Prj[★] 
- 요구사항 정의서 작성
1. 작성 완료 후 손태기 책임, 노동연 이사에게 메일로 보냄  ==> 완료[♥♡]
==============================================================================================================

- NTOSS 소스 분석
localhost:8880/goLogin
==============================================================================================================

- 오라클 오렌지 쿼리 포맷
1. Ctrl + shift + f (Ctrl + F): 라인 정리, 쿼리 정렬 이중쿼리나 뭐 여러 조건 쿼리를 작성하다보면 쿼리문이 보기에 더러워지는데...
 (select 할때부터 이미 더러워짐..) 해당 단축키로 라인정리
==============================================================================================================

- 파일 가져오기 후 OCR 처리(vFlat에서)
1. vFlat 화면 ==> 라이브러리 ==> 01. main_vFlat(메인 폴더명)
 1) 가져오기 ==> 이미지: 클릭 --> 2021.05~10_농협 Memo(폴더): 모두 선택: 클릭 
   ==> 01. main_vFlat(메인 폴더명)에 생성됨 ■
2. OCR 작업 및 내보내기(01.  main_vFlat(메인 폴더명)에서)
 1) test.jpg 파일: 텍스트 인식하기: 클릭 --> 텍스트: 클릭
 2) 내보내기: 클릭 ==> TXT 파일(.txt) 클릭 ==> TXT 내보내기: 클릭 ==> 텍스트 파일 생성됨 ■
  --> Documents/vFlat/01. main_vFlat_1.txt 파일에 저장된 ==> 공윺하기: 클릭 ==> OneDrive에 저장하기
==============================================================================================================
 
- 크롬 개발자도구
1. 크롬 개발자도구 창 활성화 단축키 : F12, Ctrl+Shift+I
2. Toggle device toolbar: Ctrl+Shift+M 
 1) Device Mode 는 모바일 브라우저 개발을 위해 지원 하는 기능으로 다양한 기기와 기능을 시뮬레이션 할 수 있습니다. 
 2) Device Mode 아이콘이 파란색 () 이면 ON 상태[모바일 테스트], Device Mode 아이콘이 회색 () 이면 OFF 상태
https://jamesdreaming.tistory.com/108
==============================================================================================================

- 엑토 노트북 도난방지 케이블 재 설치
1. 오피스디포 상암DMC점에서 새 제품으로 교환해줌 ==> 사업장에 와서 1시간 만에 설치 완료(까다로움)
==============================================================================================================

- 엑토 노트북 도난방지 케이블 사용법
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=uci_uci&logNo=221094842118
1. 비밀번호 설정하기
 1) 도난방지 케이블의 초기 비밀번호는 0-0-0-0 으로 설정되어 있음
 2) 케이블을 잡고 삼각형홈 부분을 락 본체 쪽으로 밀면서 오른쪽 방향으로 돌려 측면에 위치하게 함
 3) 숫자 다이얼을 돌려 원하는 비밀번호로 설정(03**)
 4) 비밀번호 설정이 끝나면 케이블을 다시 왼쪽 방향으로 돌려 삼각형 홈 부분이 제자리에 위치하도록 함 
2. 설치 방법
 1) 도난방지 케이블의 연결고리 부분을 책상다리 등의 튼튼한 곳에 고정
 2) 숫자 다이얼을 돌려 설정된 비밀번호를 맞추고 해제 버튼을 누른 상태에서 노트북 보안 슬롯에 끼워넣음
   ==> 해제 버튼 누르지 말것[필수]
 3) 완전히 삽입 후 도난방지 락(LOCK) 본체를 90도로 돌린 후에 락(LOCK) 버튼을 놓음
  ==> 여기서 딱깍 거리는 소리나 느낌이 나야 숫자 다이얼이 변경됨
 4) 숫자 다이얼을 이용하여 다른 번호로 돌려서 완전히 잠기게 함
3. 해제 방법
 1) 숫자 다이얼로 설치된 비밀번호를 맞춘 후 락(LOCK) 버튼을 누른 상태에서 도난방지 본체를 설치방법 방향의
  반대 방향 90도로 돌려서 해제함
------------------------------------------------------------------------------------------------------------------------

- actto 폴리스 노트뷱 도난방지 케이블 NBL-04(LG U+ Prj용), 오피스디포 상암DMC점에서 직접 구입, 가격: 18,000원
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2190198713&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.11.12(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>
 
- LG U+ 게시판 기능 개선 Prj[★] 
- NTOSS 소스 분석
1. TOSS3-SWA-AND-02_개발자가이드- UI-PC_v1.0.pptx 파일 분석 ==> 완료[♥♡]
2. 01. NTOSS 소스 분석.docx 문서 작성
==============================================================================================================

- 개발자도구 console 설정 방법 문의
1. (주)인스웨이브 W5지원팀 최지수 연구원
 1) /WebContent/websquare/config.xml 파일에서
<!-- 	<debug value="true" remoteConsole="false" console="false" errorConsole="true" /> -->
<debug value="true" remoteConsole="true" console="false"  errorConsole="true" /> 	
<!--// 개발자도구에서 console 안보이게 설정[2021.11.12, by 진태만] //-->
==============================================================================================================

- 스프링 프레임워크 Part2 AOP 강좌 01강 - AOP(Aspect Oriented Programming) 이란?[뉴렉처]
https://youtu.be/y2JkXjOocZ4
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.13(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:50 기상
05:15 조식
05:54 집출발: LG 모니터(M2450D-PN)  가지고 감 ==> 짐 조금 무거움
06:00 남서울중학교 정류장 도착
06:02 643번 버스 승차
06:40 고속버스터미널 하차
07:20 포항행 고속버스 승차 ==> 버스 좌석 등받이 젖히늠 문제로 뒷사람과 싸움이 일어남(뒤에 앉은 할매가 제 3자인데로 나서서 
		 더 열받음)
11:20 포항 고속버스 터미널 도착
11:30 고속버스 터미널 정류장(209번 버스 승차)
11:42 두호동 주민센터 하차
11:50 포항집 도착
12:00 중식 
12:20 실내도보
13:58 종료
14:30 TV 설치(엄마 방) ==> TV 모드 설정 후 채널 자동 검색 처리
15:30 완료
15:33 고구마(4개) 취식
15:40 도보
16:00 종료
16:10 거실, 주방 실측 ==> A4지에 평면도 그림
17:10 종료
18:00 석식
18:30 집출발(수종)
19:19 큰누나 미용실 도착 ==> 큰 누나는 내가 올 줄 모르고 일찍 퇴근함(이발 못 하고 돌아감)
19:51 다이소 포항두호점 방문 ==> NEW 슬림테두리 아트 프레임(A4) B(액자: 수종) (2천원), 사각 스틸 후크(4P/SET) (천원)
		, 롯데 허쉬 라지바 쿠키앤 크림(100g, 초코렛): 수종 (2천원) 구입
20:10 귀가
20:15 인터넷 서핑
22:30 샤워(수종)
22:50 종료
23:10 취침
======================================================================================================================

- [팩트체크] 버스좌석 '나의 권리' 범위는? 확인해보니
https://news.jtbc.joins.com/article/article.aspx?news_id=NB11229646
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.14(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:22 기상
06:40 조식
07:00 실내도보
08:40 종료
08:50 인터넷 서핑
12:00 중식
13:35 집출발(수종)
13:15 큰누나 미용실 도착
13:35 큰누나(매형) 도착  
14:00 이발(매형도 같이 함)
14:25 종료
14:45 귀가
15:03 집 출발 
15:10 다이소 포항두호점 방문 ==> 리엔 흑모 비책 한방 크림 염모제(흑갈색) (5천원), TPE 치간 브러쉬 SSSS(0.5 mm)(5 개입) (천원) 구입
15:20 귀가
15:40 염색
16:10 종료
16:15 석식
16:38 집출발 ==> 수종 커플 체어 가지고 옴(수종 사용 안함)
16:44 두호주민센터 정류장 ==> 209번 버스 승차
17:00 포항 고속버스터미널 도착
17:30 포항 출발
21:30 서울 강남터미널 도착
21:38 고속 터미널 정류장 ==> 643번 버스 승차
22:15 남부초 정류장 하차
22:23 귀가
22:40 청소
22:50 인터넷 서핑 ==> 즐겨 찾기 생성: BraveB_앱_21.11.15.html
02:30 취침
======================================================================================================================

- [당뇨약사] 당뇨환자를 위한 믹스커피 완전분석
https://youtu.be/--eo3cyi9T0

- 믹스커피를 절대로 먹어야 하는 이유! 커피믹스 한잔의 비밀 [건나물TV]
https://youtu.be/p4sAIHrA5u8

- 믹스커피 절대 안심하고 드셔도 됩니다
https://youtu.be/zEwF0qLQKDs
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.15(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>
 
- LG U+ 게시판 기능 개선 Prj[★] 
- NTOSS 소스 분석
1. 01. NTOSS 분석_v01.docx 문서 작성
======================================================================================================================

- 현미 쌀 20kg 구입
1. 가가호호 종합 미곡 처리장 2020 농사꾼 양심쌀 현미 [20kg], 가격: 48,410원
http://www.enuri.com/detail.jsp?modelno=55784927
http://www.tmon.co.kr/deal/6107763822?opt_deal_srl=6107763854&utm_source=enuri&utm_medium=affiliate&utm_term
=205013_%EC%97%90%EB%88%84%EB%A6%ACDB&utm_content=&utm_campaign=%EC%97%90%EB%88%84%EB%A6%AC_DB
======================================================================================================================

- 이스트라 쿠카 TV 구입
1. 이스트라 쿠카 UC431UHD 더 스마트 AI PRO [스탠드], 가격: 377,540원
http://www.enuri.com/detail.jsp?modelno=44584804
http://www.tmon.co.kr/deal/3413008642?opt_deal_srl=3413046858&utm_source=enuri&utm_medium=affiliate&utm_term=
205013_%EC%97%90%EB%88%84%EB%A6%ACDB&utm_content=&utm_campaign=%EC%97%90%EB%88%84%EB%A6%AC_DB
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.16(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주식의 정석 76강_대가들의 투자비법(2021109): 총 6번 수강 종료
 
- LG U+ 게시판 기능 개선 Prj[★] 
- NTOSS 소스 분석
1. 01. NTOSS 분석_v01.docx 문서 작성
======================================================================================================================
 
- 이스트라 쿠카 TV 도착 및 설정
0. 이스트라 쿠카 UC431UHD 더 스마트 AI PRO [스탠드], 가격: 377,540원 ==> 생각보다 엄청 큼(거실에 책꽃이에 겨우 올려놓음)
1. 이스트라 쿠카 TV에 설치된 안드로이드 10에서 이름 설정: 01. TAMA_TV_HART_404
2. 갤럭시 탭(갤럭시 탭 S7 FE)에서 Smart View 설정 ==> 01. TAMA_TV_HART_404 인식 못함
3. 갤럭시 노트 S9 에서 Smart View 설정 ==> 01. TAMA_TV_HART_404 인식함(사용 가능)
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.17(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 실내도보에서  이스트라 쿠카 TV  처음 사용(갤럭시 노트 S9 에서 Smart View 설정: 넓은 TV화면으로 주식의 정석 유튜브
									방송 시청 ==> 혁신적[공부, 돈, 운동을 함께 잡기])
 
- LG U+ 게시판 기능 개선 Prj[★] 
- NTOSS 소스 분석
1. 메뉴별 권한 조회(M5008)
 1) 프로그램 정보, 메뉴 정보 데이타 등록하는 곳 없음 ==> 김춘미 과장(공통)에게 이메일 보내기
  가. TB_EACM_PGM_M(EACM_프로그램 기본 TB), TB_EACM_MENU_M(EACM_메뉴 기본 TB)
======================================================================================================================
 
- Smart View(스마트뷰)로 기기들이 검색되지 않을 때(휴대폰 미러링 안될때) 조치 방법
https://applemedia.tistory.com/130
1. 구글 홈 앱 설치

- 이스트라TV와 삼성 덱스를 무선으로 연결하고 사용하는 방법 및 활용!!
https://youtu.be/pjwcTip_NAo

- OOCAA AI PRO] 블루투스 연결 방법(이어폰, 게임패드) [이스트라TV]
https://youtu.be/luUXRTvkYQ8
======================================================================================================================

- [삼성 갤럭시 스마트폰 공장초기화 방법, S20, S10, S9, S8, S7 전부 가능] 핸드폰 포맷하는 법
https://youtu.be/z3rksm-DCWY
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.18(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 갤럭시 S8(구형 폰)에서 Smart View 설정(06시) ==> 01. TAMA_TV_HART_404 인식함(사용 가능)
									, KT 위즈 한국 시리즈 우승(두산에 4승으로 우승, MVP 박경수)
 
- LG U+ 게시판 기능 개선 Prj[★] 
-  통시_202111118_메뉴권한요청서_FLSO_진태만.xls 작성  ==> 김춘미 과장(공통)에게 이메일 보냄
======================================================================================================================

- 연세미래치과
1. http://www.ysmirae.com
2. 주소: 서울시 관악구 신림동 1641-2번 포도몰 6층, 전화: 02-882-8250 ==> 진료: 월 ~ 목: 10시 ~ 21시, 토: 10시 ~ 15시
======================================================================================================================

- 안드로이드 스마트폰 미러링이 안 된 다면? 구글 홈(Google Home)을 이용한 미러링 방법!![이스트라TV]
https://youtu.be/oNs4SzHnNHE
1. 갤럭시 탭(갤럭시 탭 S7 FE)에서 Google Home을 사용하여 설정 이스트라TV 연결 ==> 01. TAMA_TV_HART_404 인식함
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.19(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  
 
- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일 NTOSS 소스 분석
1. 검색 기능 추가,  댓글 기능 추가
2. 모바일공지사항 화면(/eacmAcMossComulListBbs.xml)에서 검색 기능 추가
======================================================================================================================
 
- 엑셀 Excel 다중 IF 함수로 현당상황 칼럼 수정(77. 혈당관리 수첩_2021.01.xlsx 파일에서)
=IF(D7="","", IF(H7="","", IF(D7>=180, IF(H7>=180, IF(F7>=180, "▲▲",  IF(F7="", "▲▲", "")), ""), IF(D7<180, IF(H7<180, IF(F7<180, IF(F7="", "▼", "▼"), ""), ""), "▲▲"))))
=IF(D7="","", IF(H7="","", IF(D7>=180, IF(H7>=180, IF(F7>=180, "▲▲1_1",  IF(F7="", "▲▲1_2", "N_1")), "N_2"), IF(D7<180, IF(H7<180, IF(F7<180, IF(F7="", "▼1_1", "▼1_2"), "N_3"), "N_4"), "▲▲_E"))))
// D7, H7이 널이 아니고, D17, F17, H17 칼럼(3개 모두)이 180보다 크거나 같으면 ▲1, D17가 180보다 작으면 ▼을 반환(F7 칼럼  널 가능)
==> F7 칼럼 값이 존재하지 않으면 D7, H7 2개 칼럼으로 비교
------------------------------------------------------------------------------------------------------------------------------

- 엑셀 Excel 다중 IF 함수 와 IF 함수 구현하는 방법 - 녹두장군
https://mainia.tistory.com/3271
=IF(F2>=90, "A", IF(F2>=60, "B", "C"))
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.20(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:30 기상 
05:00 조식 
05:33 집출발(혈당계, 핸드폰 충전기, 칫솔, 장갑)
05:40 남서울중학교 정류장 도착
05:43 643번 버스 승차
06:22 고속버스터미널 하차
06:40 대구행 출발 
10:18 동대구 도착 
10:22 동대구 ==> 정택이 아제 옛날 집터(동원 아파트 신축됨) ==> 범어 네거리
11:00 중식(김밥, 편GS25 신천솔렌스점)
11:10 범어 네거리 ==> 방천시장 
12:10 방천시장 도착
13:00 고을(카페: 대구 중구 달구벌대로446길 23-10) 도착 ==> 아메리카노 주문
13:00 광석, 태용, 상환, 일남, 호수, 현용 도착
15:07 고을에서 나감
15:10 김광석 거리(방천시장내) 구경
15:30 택시(방천시장 --> 대구 중구 골목 투어 근대문화 골목(2코스)) ==> https://place.map.kakao.com/1645121358
15:40 근대로의 여행 ==> 계산 성당, 청라언덕, 시인 이상화 고택
16:50 대통조계찜(https://place.map.kakao.com/19585541) 도착 ==> 종환 합류
17:00 석식(조개, 문어): 최인선 합류, 배가 물러서 냉면 다 못 먹음
18:52 팔공 막창집(삽겸살) ==> 해외 여행 계획(몽고, 괌, 사이판 등), 회비 3만원으로 인상
21:02 와인바 ==> 인선이 귀가
23:06 토요코인 호텔 동성로점 입실(https://place.map.kakao.com/1550195731,: 체크인)
23:10 조개집(다들 술 많이 먹음, 일남이 술 많이 먹어ㅗ 먼저 호텔로 감)
		==> 내 이혼 문제, 아들 문제 논의
24:50 종료 ==> 호수, 현용이가 노래방 가자고 했는데 노래방 영업 안함
01:30 호텔 입실
01:40 샤워
01:50 현용이가 편의점에서 맥주, 소주 사옴 ==> 내  방에서 종환, 광석이랑 같이 한잔 더 함 
03:00 취침(내가 피곤해서 먼저 잠): 현용, 종환, 광석 계속 술 마심
04:00 전체 종료
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.21(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
07:00 기상
07:20 조식(호텔 7층 식당: 괜찮았음)
07:37 도보: 호텔 ==> 대구약령시장 ==> 약령 서문 ==> 서성 네거리 ==> 중앙 네거리 ==> 2.28기념중앙공원 ==> 동성로 ==> 호텔 ==> 계산오거리
		==> 청라언덕역 ==> 대구 남산초 ==> 계명 네거리 ==> 계명대학교 대명캠퍼스 ==> 계명 네거리  ==> 명덕 네거리 ==> 반월당역 ==> 호텔
08:40 호텔 입실
09:10 샤워
10:20 호텔 프런터에서 체크인 10시까 하라고 전화옴 ==> 현용이 샤워 한다고 늦어짐)
10:35 호텔 프런터에서 전화가 와서 추가 비용 만 1천 내라고 함
10:45 호텔 7층에서  체크 아웃(태용이가 만 천원 추가로 회비에서 지불함)
11:00 택시(호텔 ==> 수성못)
11:10 스타벅스 수성레이크점 도착 ==> 아메리카노, 빵
12:04 종료 ==> 종환이 귀가
12:10 중식(갈비탕: 아주 특별한 해장국)
		==> 태용이가 셀트리온 주식 삼성 때문에 안 오른다고 함(그래도 장기 보유하면 이익이라고 주장함) ==> 현용 셀트리온에 대해 부정적인 의경
			(30만원대 밑으로 간다고 함): 현용 삼성전자 7만원대 밑으로 가면 매수 한다고 함
13:10 종료 ==> 일남이 귀가 
14:20 수성못역 ==> 헤어짐
14:25 도보: 수성못역 ==> 동대구 고속버스터미널
14:40 동대구 고속버스터미널 도착
15:00 동대구 고속버스터미널 출발(맨 뒷좌석: 불편)
19:08 서울 강남터미널 도착
19:30 석식(유부초밥: 이마트24 고속터미널영동선1호점)
19:50 고속 터미널 정류장 ==> 643번 버스 승차
20:22 남부초 정류장 하차
20:27 귀가
20:30 실내도보 ==> 주식의 정석 시청
20:10 종료
20:30 청소
20:50 종료
21:00 인터넷 서핑 
01:00 취침
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.22(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 연세미래치과 방문(19:30, 오른쪽 위쪽 어금니 충치로 깨짐: 신경 치료(5주) 후 크라운 씌우기(40만원) 하라고 함)
 
- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일공지사항 화면(/eacmAcMossComulListBbs.xml) 수정
1. 검색 기능 추가 ==> 검색 파라미터 못 가져와서 조회 안됨
======================================================================================================================
 
- 공지사항 화면(/EacmAcComulListBbs.xml) 수정
1. 검색 기능 추가
======================================================================================================================

- 부위별 크라운(보철물) 추천! 내 치아라면 어떤 보철물을 선택할까? [치과의사 부부CHIKABUBU]
https://youtu.be/sIcOfiU7Ix8
1. 보철 재료: 지르코니아(치아색: 강도↑, 약 43만원)
 1) 인조 다이아몬드라고 불리는 큐빅을 깎아서 만든 것이 지르코니아 크라운 입니다. 매우 단단하기 때문에 거의 깨지지 않고,  치아색과 유사
하다는 장점이 있습니다. 하지만 치료비용 및 가격이 비싼편이고, 치아에 지르코니아를 씌우기 위해 치아삭제를 많이 해야 된다는게 단점
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.23(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  이엘치과 예약(14:30)

- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일공지사항 화면(/eacmAcMossComulListBbs.xml) 수정
1. 검색 기능 추가 ==> 완료[♥♡]
======================================================================================================================
 
- 이엘치과
https://el-dent.co.kr  
1. 지르코니아 35만원까지 해준다고 함
======================================================================================================================

- 가상화폐
1. 이더리움, 비트코인
- 이더리움(ETH) : 4,400달러 회복 연말까지 11,000달러(원화 1300만원) 가능할까? [1억맨]
https://youtu.be/5Vn16GZ04IY
======================================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.11.24(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 17:30 ==> 이엘치과 첫 방문(18:20, 어금니 신경 치료)

- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일공지사항 화면(/eacmAcMossComulListBbs.xml) 수정
1. 검색 기능에서 댓글  검색 조건에 추가 ==> 완료[♥♡]
======================================================================================================================
  
- 모바일공지사항 화면(/eacmAcMossComulListBbsAtcl.xml) 수정
1. 댓글 등록 기능 추가 ==> 완료[♥♡]
--------------------------------------------------------------------------------------------------------------

2. 댓글 삭제 기능 ==> 모바일공지사항 상세 화면(/eacmAcMossComulListBbsAtcl.xml) 수정
scwin.btn_deleteRpl_onclick = function() { 
	console.log("[/WF001M.xml] [btn_deleteRpl_onclick()] ==> [TEST_01] [댓글 삭제 버튼 클릭 이벤트]");
	
	dm_deleteRplParaam.setEmptyValue();
	
	var idx = this.getUserData("idx");
	dm_deleteRplParaam.set(bbsId", dl_rpl.getColumnData(idx, "dd): ):	// 게시판ID
 
	com.sbm.execute(sbm_commonGroup);   // 코드관리 조회
}; 
======================================================================================================================
 
- 치과 치료(18:00 이엘치과 첫 방문)
1. 오른쪽 어금니 충치로 깨짐: 신경 치료(5주) 후 크라운 쓰우기(40만원) 예정
2. 프런트 여직원이 지르코니아 35만원이 아니라 40만원이라고 함
 1) X 재촬영: 신경 치료(2만 3천원)  ==> 1번만 신경 치료 하면 된다고 함
 2) 예약 이번주 토욜이 안되고 다음주 목요일 가능하다고 함(환자가 많다고 함)
 3) 지르코니아 보철비(40만원)을 결제하라고함 ==> 결제 거부하고 치료 안하기로 함
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.25(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출입증 나옴(12층 출입 권한이 없다고 나옴): CNS 출입증 --> U+ 결재가 필요하다고 함
								, 연세미래치과 예약(지르코니아(4만원) + 추가 덧 씌우기(5만원): 총 45만원)

- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일공지사항 상세 화면(/eacmAcMossComulListBbsAtcl.xml) 수정
1. 현상: 해당 게시판이 존재하지 않습니다.
2. 원인: 게시물 Table이나 메타 Table에서 해당 메뉴가 존재하지 않음
======================================================================================================================
  
- 이클립스(eclipse) 성능개선 및 Validation 최적화 설정 
1. https://ssd0908.tistory.com/entry/이클립스eclipse-성능개선-및-Validation-최적화-설정 [에스제이]

- 이클립스 속도 개선 eclipse.ini / Preference
https://hailey0.tistory.com/42
======================================================================================================================

-  무선 키보드 마우스 세트 구입
1. 로지텍 MK245/MK240 무선 키보드 마우스 세트(수종 선물), 가격: 18,770원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2083565832
 ======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.26(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> (주)와이즈 인포텍 박원상 부사장이 NTOSS 유비보수 문제점 자료 요청(14시, ppt로 작성)

- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일 수정
1. 공통 메타 속성 수정, 게시판 메타 설정 수정
2. 메뉴 권한 설정
======================================================================================================================
  
- 기존 무선 키보드 마우스 세트에 한글 입력
1. 유성펜으로 직접 한글 입력 ==> 카스킨에서 습기가 많이 나와서 유성펜 잉크가 번짐(다이소에서 한글 스티커 구입할 것)
===================~===================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.27(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:30 인터넷 서핑
11:33 집출발(자전거)
11:45 다이소 보라매점 방문 ==> 한글 스티커 없음
12:06 GS25 보라매타워점) 방문 ==> 원형 마스킹 라벨(8mm) 15장(천원) 구입
12:18 중식(햄버거, 컵라면: 가격 3,950원, GS25 보라매타워점) ==> 혈당: 114
13:10 귀가
13:18 실내 도보
14:30 종료
14:35 인터넷 서핑 
18:00 석식
18:20 실내 도보 
18:50 종료 
19:10 인터넷 서핑
23:00 취침
======================================================================================================================
 
 - (보고서) NTOSS 유지보수의 문제점과 향후 방향 설정 작성
1. 제목: NTOSS 유지보수의 문제점과 프로세스화를 위한 방안 제시
Ⅰ. 프로세스화되지 않은 유지보수
	Ⅰ-1. 로컬 서버(eclipse)의 속도 문제 
	LG U+ 보안 클라우드내 로컬 서버(eclipse)의 속도가 너무 느림(서버 부팅 시간 평균 10분 내외)
로컬 서버(eclipse)에서 로그인 후  메인 화면 접속 속도가 1분 44초 소요되고 화면 이동 시간도 10초 내외로 심각하게 느림
현재의 로컬 서버 속도는 개발에 심각한 지연과 효율성 저하를 초래하고 있음 
==> 로컬 서버(eclipse) 관리 담당자에게 개선 요청을 반드시 해야 함

	Ⅰ-2. 개발 DB와 DB와 데이타 불일치
	정상적인 SM 프로세스라면 개발 서버에서 충분한 테스트를 한 후 스테이지 서버로 넘어가서 고객 확인 과정을 거침
로컬 서버(eclipse)가 속도가 느려서 개발 DB에서 테스트를 제대로 안하고 바로 스테이지 서버로 넘어가서 개발을 하지 않았는 지 추정됨

	Ⅰ-3. 메뉴 등록에 필요한 필수 데이타 등록 화면 미존재
로컬 DB는 개발자가 직접 INSERET 처리, 스테이지, 운영 DB는 엑셀로 요청서 작성하여 공통(김춘미 과장)에게 요청해서 처리
 ==> 극단적인 업무의 비효율: 메뉴 등록에 필요한 필수 데이타 등록 화면 조속하게 개발해야 함
	
▣ "전체 AS매뉴얼"이라는 메뉴를 추가하려고 했을 때 INSERT 해줘야 할 데이타
1.  프로그램 등록 TABLE 1개 등록
2. 메뉴 등록 TABLE 1개 등록
3. 옵션 등록 TABLE 1개 등록
4. 기능 등록 TABLE 1개 등록
5. 권한 등록 TABLE 20개 등록
	 	 
	Ⅰ-4. 실무에 맞게 문서화 되지 않는 산출물
현실적으로 SM에서는 SI 개발자가 급하게 개발을 완료하고 철수한 후 남기고 간 형식적인 산출물 밖에 없지만 
여기는 그런 산출물도 거의 존재하지 않음
==> SM 프로세스 고도화를 위해 필수 산출물 현행화가 반드시 필요함
▣ 최소한의 필수 산출물
화면 정의서
요구사항 정의서
3. DB 설계서
4. 개발자 가이드
		
	Ⅰ-5. Websquare SW 개발 툴에 대한 이해 부족
 개발자 도구에 전체 Websquare console 로그 안 보이게 설정하고 해당 로그 만 보면서 개발을 해야 하는 데 모든 로그를 보고 있음
 로컬 서버 속도에도 영향을 끼침
 	
	검색 기능에 댓글 추가하려고 하면 자바 소스까지 수정해야 함
 웹스퀘어 샘플 가이드를 임의로 수정한 것으로 추정됨

Ⅱ. 유지보수 프로세스화를 위한 방안
	Ⅱ -1. 유지보수 관련 전문가 영입
	▣ 관련 분야 경험이 풍부한 PL급 개발 전문가 영입
	의사 소통 능력과 개발 능력, 관리 능력이 뛰어난 전문가를 통한 유지보수의 프로세스화
	교육을 통한 담당 업무 전문화 및 고도화

	Ⅱ -2. 로컬 서버(eclipse)의 속도 현실화
	▣ 로컬 서버(eclipse) 관리 담당자에게 개선 요청 
	장기적인 관점에서 철저하게 원인을 분석하여 반드시 개선 해야 함
	==> 거시적인 관점에서 LG U+ 보안 클라우드 성능 향상을 요청해야 함
	(Ex. 개인 보안 클라우드 서버 RAM 추가 요청)
 
	Ⅱ -3. 프로세스화를 통한 관리 강화
	▣ 유지 보수 프로세스 기반 마련 및 관리 강화를 통해 효율성 증대 
	▣ 유지 보수 프로세스 기반 마련 및 관리 강화를 통해 효율성 증대 
	관리 전문가를 통한 개발 서버, 스테이지 서버 변경 관리 강화
	1명에게 집중되어 좌우되는 시스템이 아니라 체계적인 프로세스에 
	의해 관리되도록 기반 마련	
------------------------------------------------------------------------------------------------------------------

Ⅲ. 체계적인 프로세스화 후 기대 효과
  가. 유지보수의 효율성 증대
  나. 유지보수의 효율성 품질 확보
==> 4차 산업혁명 시대의 바람직한 에너지 정책방향 논의[출처] 대한민국 정책브리핑(www.korea.kr)
--> https://www.korea.kr/news/pressReleaseView.do?newsId=156182089&pageIndex=232
======================================================================================================================

- 피티 무료 템플릿 30종 모음 (새별 ppt)ㅣ
https://post.naver.com/viewer/postView.nhn?volumeNo=30269002&memberNo=6532296

- 미리캔버스
https://www.miricanvas.com/design

- 보고서작성법 문서작성법 기획서쓰는법[책 읽어 주는강사]
https://youtu.be/pSEvHUi3p8c

- 직장인 1page 보고서 작성방법
https://youtu.be/b5bNJ3-71oU 
======================================================================================================================

- 숨길 수 없는 일잘러의 3가지 특징│내가 경험한 일 잘하는 사람들은 이것이 다르다 │콘텐츠위드(Contents With)
https://youtu.be/UheQDgss_Xc
======================================================================================================================

- 나이 오십 넘어 비참해지고 싶지 않다면 당장 시작해야 할 것[책식주의]
https://youtu.be/FuqVGAl1bVc
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.28(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:30 인터넷 서핑 ==> 포항집 주방 장판 크기 계산
12:00 중식 ==> 포항집 김장(큰누나와 화상 통화)
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 셀프로 장판 시공 동영상 분석
18:00 석식
18:20 실내 도보 
19:30 종료
20:10 청소(빗자루, 밀대)
20:50 인터넷 서핑 ==> 포항집 주방에 시공할 장판, 벽지 주문
23:00 취침
======================================================================================================================
 
- 지금 안 쓰면 후회하는 아이폰 무료 녹음 앱!! [당신의 생존기술]
https://youtu.be/ecPy_BmARGw
======================================================================================================================
 
- 진양화학 장판(장판닷컴)  ==> 2021.11.28(일) 구입 @@@
https://smartstore.naver.com/mat001/notice/detail?id=2002394281
장판종류 : 장판종류 : 5. 고급형 모노륨장판 / 장판선택 : 진양 히트륨 MG70331 / 68개 (+88,400원), 총 가격: 134,300원 ■■
추가상품 : 부자재 : 장판용본드 / 1개 (+3,000원)옵션 삭제
추가상품 : 부자재 : 용착제 세트 / 1개 (+3,000원)옵션 삭제
추가상품 : 부자재 : 커터칼 - 9mm / 1개 (+4,000원)옵션 삭제
추가상품 : 부자재 : 플라스틱 밀대 / 1개 (+700원)
사은품 : 모노륨장판 5m 이상 구매시 사은품 제공 
======================================================================================================================
 
- 만능 풀바른벽지 셀프도배 친환경 합지 단색 도배지(월풀)
https://smartstore.naver.com/wallplan/products/344644255?
1. 제품번호: G39346-1 다나 화이트, 참조: H084-2
http://gi.esmplus.com/achim1005/paper2020/trendy/39346-1.html
 1) 제품번호입력 : G39346-1 / 풀바름 종류선택 : 만능풀바른벽지(합지벽지) / 벽높이선택 : 230cm / 10개 (+58,800원), 총 가격: 56,550원 ■■
 2) 추가상품 :  
사은품 : 5폭이상구매시 도배에 필요한 헤라,작업장갑을 보내드립니다
-======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.11.29(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 17:00 ==> 치과 치료(18시, 연세미래치과)

- LG U+ 게시판 기능 개선 Prj[★] 
- NTOSS 유비보수 문제점 작성(9시, ppt로 작성): 박원상 부사장에게 메일로 보냄
01. NTOSS 유지보수의 문제점과 프로세스화를 위한 방안 제시-진태만-V01.pptx
======================================================================================================================

- 스텐레스 철자 구입
1. 스텐레스철자 다보톱 수평자 수평스퀘어 직각자 기억자, 가격: 20,900원 
 1) 제품선택: 철자100cm(1000mm) (+8,100원)
https://blog.naver.com/tamario/222581533278 
======================================================================================================================
 
- #1 Git 설치 (Git & Git extensions) _ Git 환경에서 S/W 개발하기 첫번째 git 환경 구축[개발자를 꿈꾸다]
https://www.youtube.com/watch?v=AcKLz2_tGuw&list=PLk3PkBqRCyIEzFyMMrbxPo02JcfvVVtU5&index=2
https://youtu.be/ESePPSQSh24
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.11.30(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 가계부 월말 결산(21시, 집)

- LG U+ 게시판 기능 개선 Prj[★] 
- 모바일 수정
1. 공통 메타 속성 수정, 게시판 메타 설정 수정
2. 메뉴 권한 설정
======================================================================================================================





■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //------------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
1. OX ↑↓ ↔  ⇒ ⇔  ==> 완료[♥♡]  ==> 개발 중[☞☜]＃＆＠ § ※ ☆ ★ ○ ●◎ ◇ ◆ □ ■ △ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣





















