

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2023.07) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.07.01(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:17 기상
06:30 조식(수종: 돈까스 2개) 
06:51 실내 도보
07:55 종료
08:00 집 출발(자전거: 수종, 반팔, 반 바지)
08:10 보라매 공원 도착
08:10 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
08:33 종료
08:40 물통에 떠 옴(보라매 공원 놀이터)
08:47 귀가
09:00 샤워(찬물)
09:40 집 출발(자전거: 수종, 반팔, 반 바지)
09:48 최희정 내과 방문 ==> 혈당: 116
10:00 진료: 김민아 원장(당뇨약 3개월치 처방 받음) ==> 혈압: 135/90 
10:05 5층엔 약국 방문 ==> 조제(당뇨약[누메트 엑스 알서방]: 3달치 일치: 28,300원)
10:08 착한 미용실 원투쓰리(신림역 1번 출구 방문 ==> 대기 0명
10:30 이발(커트: 6천원): 남하 헤어 드자이너(문신): 짧게 커트 해달라고 함(만족)
11:10 귀가
11:30 중식 
11:45 실내 도보
12:55 종료
12:50 수종 귀가
13:20 인터넷 서핑
17:00 집출발(수종, 자전거):  작은 백팩(음료수 2개]: 수종
17:22 신림역 -> 종합운동장역
17:43 종합운동장역 5번 출구(사람 너무 많음)
17:50 GS25 잠실 구장점 도착
18:00 석식(피자, 빵, 과자): 수종 --> 11,800원
18:10 종료
17:45 잠실 야구장 입장(1루석 레드석 210 E58): 수종이와 함꼐 앉음 --> 잠실 구장 올해 처음 만원
		==> 07.01 KIA 5 : 3 LG , 기아 김건국 투수 4회 교체, LG 플렛코  5회 5실점
21:10 종료 
21:20 종합운동장역 -> 신림역
22:00 귀가
22:15 염색(누나가 선물한 염색약 사용), 샤워
22:55 취침
==============================================================================================================

- 파이썬 강의 수강
- 파이썬 코딩 무료 강의 (기본편) - 6시간 뒤면 여러분도 개발자가 될 수 있어요 [나도코딩]
https://www.youtube.com/watch?v=kWiCuklohdY&list=RDCMUC7iAOLiALt2rtMVAWWl4pnw&index=1
1. python 다운로드 및 설치
 1) python-3.11.4-amd64.exe  
2. VisualStudio Code 설치
 1) VSCodeUserSetup-x64-1.78.2.exe
3. PythonWorkspace 폴더 생성 및 설정
 1) D:\PythonWorkspace
  2) \helloworld.py 파일 생성  
  ==> python
==============================================================================================================

- [2023-07-01] KIA VS LG[잠실 야구장]
https://www.koreabaseball.com/KboTv/Highlight/View.aspx?leagueId=1&seriesId=0&gameId=20230701HTLG0&boardSe=22242
1. 잠실 야구장 입장(1루석 레드석 210 E58): 수종이와 함꼐 앉음 --> 잠실 구장 올해 처음 만원
 1) 07.01 KIA 5 : 3 LG , 기아 김건국 투수 4회 교체, LG 플렛코  5회 5실점
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.07.02(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
07:23 기상
07:30 조식
07:49 실내 도보
09:30 종료(설사 3번: 화장실에서 시간 많이 보냄)
10:00 인터넷 서핑
11:30 집 출발(자전거: 수종, 반팔, 반 바지)
11:35 GS25 신대방 노블점 방문
11:35 중식(편의점: 김혜자 도시락 2 개. 콘): 수종, 11,000원 
11:55 다이소 난곡 사거리점 방문 ==> 일본제 손잡이 배수구망(둥근 타입) 지름(약14 cm), 천원: 구매 잘못 함
12:30 귀가
12:32 실내 도보
13:00 수종료
13:20 인터넷 서핑 
16:00 파이썬 강의 수강 ==> 파이썬 코딩 무료 강의 (기본편) - 6시간 뒤면 여러분도 개발자가 될 수 있어요 [나도코딩]
17:30 석식: 버너에 돼지 왕 구이 구워 먹음(맛있음): 수종
17:50 실내 도보 
19:05 종료 
19:20 청소(청소기, 밀대)
20:00 샤워(찬물: 체중: 67.8kg ==> BMI: 23.46[과 체중])
20:25 인터넷 서핑
22:30 취침
==============================================================================================================
     
- 냉동 돈가스 주문
- 하프클럽/동원 동원 프리미엄돈까스 840g 4개, 가격: 15,350원(30,700원[8봉], 봉 당: 3,838원)
http://item.gmarket.co.kr/Item?goodscode=2400142514
https://www.enuri.com/detail.jsp?modelno=2384630
  ==============================================================================================================
  
- 변기 크리너 구입
- 탐사 오래가는 변기세정제, 10알: 가격: 13,940원--> 실재 구입
https://smartstore.naver.com/pet-shoppingmall/products/7426949349
- 진짜 한달동안 유지될까? 탐사 오래가는 변기세정제 한달사용 리뷰!
 https://www.youtube.com/watch?v=DuR1zQHk3U0
 
- 탐사 오래가는 변기세정제, 10알: 가격: 9,590원(100g당 2,398원) --> 검토
https://www.coupang.com/vp/products/1898771223
1. 손잡이 타입 씽크대 배수망(2개, 천원) 
2. 씽크대 배수망에 변기세정제 2개 넣고 수조 위에 매달아둠 
==============================================================================================================

■■■■■■■■■■■■■ 2023.07.03(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 종합소득세 지방세(주민세) 환급금(관악구 지방 소득세)  42.320원 입금, 스쿼트 500개만 하기(하절기에 자기 전 100개 중단)

- LG U+ CRM_PDA 현행화 Prj[★] 
- LG U+ CRM_PDA 현행화 Prj 비밀번호 변경
1. 이전 비밀번호: 8a60d5c85c(마당 최초 비밀번호) ==> 비밀번호: qw**223*!!
 1) 8a60d5c85c(마당 최초 비밀번호)
==============================================================================================================

- CSV 파일 정보 확인 처리(파이썬 SW 사용)
1. csv_info_tama.py
2. csv_info_tama2.py
==============================================================================================================

- 파이썬 non-ASCII
# -*- coding: utf-8 -*-
==============================================================================================================

- IndentationError: unexpected indent 파이썬 에러 해결하기
https://guslabview.tistory.com/347
1. Notepad++의 설정 >> 환경 설정을 누르면 아래와 같이 기본 설정 창이 뜨게됩니다.
여기에서 탭 설정 부분으로 옮기신 후 탭을 공백으로 대체에 체크를 하게 되면 탭 자체가 공백으로 인식이 되기 때문에 컴파일에 
문제가 없어진답니다. 
 1) 모든 소스에 탭이 들어 가야 함 ==> Notepad++에서 보기(V) > 기호 보기 > 공백과 탭 표시 --> 모든 줄에 탭이 보여야 함
==============================================================================================================
 
- [Python] 파이썬으로 csv 다루기 (읽기,쓰기,수정,추가)
https://devpouch.tistory.com/55

f = open('example.csv','r')
rdr = csv.reader(f)
lines = []
for line in rdr:
    if line[0] == "림코딩":
        line[1] = "서울"
    lines.append(line)
 
f = open('example.csv','w',newline='') #원본을 훼손할 위험이 있으니 다른 파일에 저장하는 것을 추천합니다.
wr = csv.writer(f)
wr.writerows(lines)
 
f.close()
------------------------------------------------------------------------------------------------------------------------------

- [python] 파이썬 리스트(list) 정리 및 예제 (1탄 기본편)
https://blockdmask.tistory.com/425
 
 간단하게 예제를 보면리스트 a = ['b', 'l', 'o', 'c', 10, 11] 라 하면
a[0]는 'b'를 가리키고a[1]은 'l'을 가리킵니다. 

list[0], list[1]
==============================================================================================================

- 파이썬 기초 - txt 파일 불러오기 & 리스트, 데이터 프레임으로 저장하기 -
aa = pd.read_table('test.txt',sep="!")
print(aa)
==============================================================================================================

- 텍스트 파일 불러오기와 리스트 활용\
https://formal.hknu.ac.kr/Gongsu-DataSci/notebooks/GongSu08_Files_and_Lists.html

result_f = open("data/scores_list.txt")

highest_score = 0                   # 1등 점수 저장

for line in result_f: 
    record = line.split()

    try:                           # 첫줄 제외 용도
        score = float(record[1])
    except:
        continue

    if highest_score < score:       # 1등 점수 갱신 경우 확인
        highest_score = score
    else:
        continue

result_f.close() 

print("1등 점수는", highest_score, "입니다.")
==============================================================================================================

■■■■■■■■■■■■■ 2023.07.04(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 김일기 PM 휴가, 변기 크리너 화장실에 셋팅(20:40, 1알로 한 달 사용, 마음에 듬)

- LG U+ CRM_PDA 현행화 Prj[★] 
- CSV 파일 정보 확인 처리(파이썬 SW 사용)
1. csv_info_tama.py
2. csv_info_tama2.py
==============================================================================================================

 - 파이썬 날짜 함수  
 import time

now = time
print("현재 : ", now)
print("현재 : ", now.localtime())
print("timestamp : ", now.time())
print("초 : ", now.localtime().tm_sec)
print("요일 : ", now.localtime().tm_wday)
print("올해로부터 경과된 일 : ", now.localtime().tm_yday)
print("문자열 변환 : ", now.strftime('%Y-%m-%d %H:%M:%S'))	# ■■■
-----------------------------------------------------------------------------------------------------------

import datetime

# 오늘 날짜를 구해서 today에 할당
today = datetime.date.today()
print(today)

# 어제 날짜: 오늘 - 1일
yesterday = today - timedelta(days=1)
print(yesterday)

print(today.strftime("%Y.%m.%d"))
-----------------------------------------------------------------------------------------------------------

from datetime import datetime, timedelta

now = datetime.now()
print("현재 :" , now)	# 현재 : 2021-01-09 19:41:03.645702

before_one_day = now - timedelta(days=1)
print("1일 전 :", before_one_day)	# 1일 전 : 2021-01-08 19:41:03.645702
after_one_day = now + timedelta(days=1)
print("1일 후 :", after_one_day)	# 1일 후 : 2021-01-10 19:41:03.64570
==============================================================================================================

■■■■■■■■■■■■■ 2023.07.05(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(13:30), 최성오 책임에게 7월 말 철수 통보(17시)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 수정 작업
1. No. 01(CRM 포함), No. 03(CRM 포함), No. 36(CRM)
==============================================================================================================

- CSV 파일 정보 확인 처리(파이썬 SW 사용)
1. 한글 꺠짐
with open("test.csv", "wt", encoding = 'utf8') as file:  ==> 사용 불가
==============================================================================================================

 - [ Python ] csv 파일 읽고, 쓰기 ( pandas / csv 모듈 )
https://pydole.tistory.com/entry/Python-pandas-csv-%ED%8C%8C%EC%9D%BC-%EC%9D%BD%EA%B3%A0-%EC%93%B0%EA%B8%B0

- names 옵션으로 컬럼명 지정하기
import pandas as pd

df = pd.read_csv(r'C:\Python\SC\example.csv', skiprows=[0], names=['학생', '수학', '컴퓨터', '영어'])
print(df)
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.07.06(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★]
-  문서 작업
01. 데이타마이그_진행현황(DEV).xlsxs 수정(gcp, csv 데이타 조회, 기입)
==============================================================================================================

- 수정 작업
1. No. 03(CRM 포함), No. 266
==============================================================================================================

- CSV 파일 정보 확인 처리(파이썬 SW 사용) 
- [Oracle] REPLACE 함수 사용법 (문자열 치환, 엔터 제거)
https://gent.tistory.com/228

SELECT REPLACE('Oracle Database', 'Oracle', 'Ora')  AS result1
     , REPLACE('Oracle Database', 'Database', 'DB') AS result2
     , REPLACE('Oracle Database', 'D', 'd')         AS result3
  FROM dual
;

CHR(10) : line feed(new line) 커서가 위치한 줄의 아래로 이동
CHR(13) : carriage return 현재 커서가 위치한 줄의 맨 앞으로 커서 이동
==============================================================================================================

- 파이썬 프로그램에서 유닉스 명령어 실행하는 법
https://code.tutsplus.com/ko/how-to-run-unix-commands-in-your-python-program--cms-25926a

import subprocess 
time = subprocess.Popen('date', stdout=subprocess.PIPE, stderr=subprocess.PIPE)
output, err = time.communicate()
print 'It is', output
------------------------------------------------------------------------------------------------------------

import subprocess 

time = subprocess.check_output('date')
print 'It is', time
==============================================================================================================

- 1화. AA 건전지 10 종 비교 테스트
https://www.youtube.com/watch?v=YtnknYN8jH8
1. 네오 셀 알카라인, 벡셀 플래티넘, 듀라셀 디럭스
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.07.07(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★] 
- CSV 파일 정보 확인 처리(파이썬 SW 사용)
1. 
==============================================================================================================

- 파이썬 분석
- 패키지
1. pypi  
https://pypi.org   ---> 검색:beautifulsoup

pip list
-------------------------------------------------------------------------------------------------------------------------------

- 내장 함수
dir: 어떤 객체를 넘겨줬을 때 그 객체가 어떤 변수와 함수를 가지고 있는 지 표시

print(dirrandom()) 
import random
print(dir(random)) 
print(inspect.getfile(random)) 
------------------------------------------------------------------------------------------

- 내장 함수
https://docs.python.org/ko/3/library/functions.html

- Python 모듈 목록(외장 함수)
https://docs.python.org/ko/3/py-modindex.html
------------------------------------------------------------------------------------------
 
import os		# 운영 체제에서 제공하는 외장 함수
print(os.getcwd())			# 현재 디렉토리

folder ="smple_dir"

if os.path.exists(folder):		# 폴더가 존재하면 
	 print("이미 존재하는 폴더입니다.,")
	os.rmdir(folder)
	print(folder, "폴더를  삭제했습니다.,")

else:		# 폴더가 존재 안하면 
	os.makedirs(folder)		# 폴더 생성
	print(folder, "폴더를 생성했습니다.,") 
==============================================================================================================
  
 - 인생은 짧아요 엑셀 대신 파이썬 - 이승준[PyCon Korea]
https://www.youtube.com/watch?v=w7Q_eKN5r-I&t=1447s
==============================================================================================================

- find : 결과를 날짜 순으로 정렬
https://www.nemonein.xyz/2020/10/4424/

$ find <Dir> -maxdepth 1 -name 'turned_on_by_cubietruck*' -printf "%T@ %p\n"
1601907123.4714274210 /storage/turned_on_by_cubietruck-20201005-2310
1601968924.0174839570 /storage/turned_on_by_cubietruck-20201006-1620

-maxdepth 는 현재 디렉토리에서만 검색하라는 뜻이다.
%Tk : 파일의 최종 수정 시간을 k 형식으로 나타낸다. k 는 다음과 같다.
----------------------------------------------------------------------------------------------------------------

find <Dir> -maxdepth 1 -name 'turned_on_by_cubietruck*' -printf "%T@ %p\n" | sort -nr | cut -d " " -f 2-
/storage/turned_on_by_cubietruck-20201005-2310
/storage/turned_on_by_cubietruck-20201006-1620

sort :
-n : 숫자를 기준으로 정렬
-r : 역순 정렬 (내림차순)
-h: human(2K, 1G)

cut :
-d ” ” : Deliminator, 즉 필드 구분자로 공백을 사용.
-f 2- : 몇번째 필드부터 끝까지 출력할지 여부. 2- 이므로, 두번째부터 끝까지.
==============================================================================================================
 
- 파이썬 초보 탈출하기 #3 | 구글링 Googling
https://www.youtube.com/watch?v=PEtjVQa_LEA&list=RDCMUC7iAOLiALt2rtMVAWWl4pnw&index=3
------------------------------------------------------------------------------------------------------------

- 검색 조건 site 추가(구글에서)
1. 검색 조건(구글에서): python write file site: stackoverflow.com
 1) Stack Overflow ==> https://stackoverflow.com/questions/35120899/python-writing-text-to-a-FILE
==> Ctrl + 클릭 --> Tab이 생성됨
==> +포함 -제외(특정 단어 포함, 제외)
==============================================================================================================
  
- 파이썬 초보 탈출하기 #2 | 디버깅 Debugging
https://www.youtube.com/watch?v=_1HM6MJMYPw&list=RDCMUC7iAOLiALt2rtMVAWWl4pnw&index=22
==============================================================================================================

 - 파이썬 초보 탈출하기 #1 | 물어보기
https://www.youtube.com/watch?v=LZQC9mEzdtk

- 나도코딩 티스토리 ==> [파이썬 기본편] 자주 묻는 질문 (FAQ) 정리
https://nadocoding.tistory.com/16
==============================================================================================================

- 색상 RGB 및 RGBA
https://www.w3schools.com/colors/colors_mixer.asp
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.07.08(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:15 기상
06:21 조식(수종: 돈까스 3개)
06:50 집 출발(자전거: 수종, 반팔, 반 바지)
06:17 보라매 공원 도착
06:53 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
07:17 종료
07:20 물통에 떠 옴(보라매 공원 놀이터)
07:30 귀가
07:50 샤워(찬물)
09:30 인터넷 서핑 ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 수강
10:40 수종 센터로 감 
11:30 중식 
11:45 실내 도보
12:55 종료
12:30 수종 엄마집에 놀러감
13:20 인터넷 서핑 ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 수강
17:30 석식
17:45 실내 도보 
19:10 종료
20:10 집 출발(자전거: 수종, 반팔, 반 바지) 
20:20 다이소 보라매점 방문 ==> 1. 배수망 2P(중), 천원), 2. 은나노 수세미 3P(17X9 cm,  천원)
		3. PET 손잡이 바가지(소, 천원) , 4. 은나노 수세미 3P(17X9 cm, 2천원)
20:30 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(2,840원), 썬 연료 1줄(4개, 5300원) ==> 총: 19,940원) 구입
21:00 귀가
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 파이썬 코딩 무료 강의 (활용편4) - 업무자동화(RPA), 이제는 일하는 척(?)만 하세요[나도 코딩}
https://www.youtube.com/watch?v=exgO1LFl9x8&list=PLMsa_0kAjjrd8hYYCwbAuDsXZmHpqHvlV&index=5

-  업무 자동화
1. 엑셀 자동화(openpyxl)
2. 데스크탑 자동화(pyautogui)
3. 웹 자동화(selenium)
4. 이메일 자동화(smtplib, imap_tools)
==============================================================================================================

- 파이썬(Python)을 배우면 삶이 이렇게 바뀝니다
https://www.wanted.co.kr/community/post/8651
1. 명절 기차 자동 티켓팅
==============================================================================================================

- 경주 캘리포니아 비치 얘약
https://www.gjw.co.kr/California/contents.php?cmsNo=WA0300
1. [골드 시즌] 70,000원, 48,000원 ==> 118,000원  --> 대인: 29,900원, 소인: 12,900원  --> 가격: 42,800원(KB PAY 제휴 우대권)

- [vlog] 피부관리사 일상ㅣ워터파크 브이로그💦ㅣ경주 캘리포니아 비치 개장후기
https://www.youtube.com/watch?v=ECv8KPoxogk

- 올 여름 마지막 물놀이는 역시 워터파크!! (Feat:경주 캘리포니아비치)
https://www.youtube.com/watch?v=AanaYSgNex0
-------------------------------------------------------------------------------------------------------------------

- 경주월드 풀코스 완전정복 - 드라켄부터 파에톤까지
https://www.youtube.com/watch?v=Y7VTpopvAuc
==============================================================================================================

- 기차표 예매
- 경주행[서울(19:19) -> 신경주(21:20), KTX 4005]: 수종
1. [23.07.27(목)] 경주행[서울(19:19) -> 신경주(21:20), KTX 4005], 9호차, 4A, 4B, 가격: 65,900원(포인트 8천원 할인) 
=============================================================================================================

- 서울행(19:21) -> 서울(21:59), KTX-산천 252]: 수종 
1. [23.07.30(일)] 서울행(19:21) -> 서울(21:59), KTX-산천 252] 6호차 9C, 9D, 가격: 80,400원(53,600원, 26,800원) 
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.07.09(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:47 기상
06:54 조식
07:32 집 출발(흐름: 우산 소지)
07:32 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
08:55 귀가
09:00 샤워(찬물)
10:00 인터넷 서핑  ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 수강
11:30 중식
11:45 실내 도보(비 많이 옴)
12:55 종료
13:20 인터넷 서핑  ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 수강 ==> 완료[♥♡]
17:30 석식: 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
19:05 종료 
20:00 수종 귀가 
20:03 청소(청소기, 밀대)
20:30 샤워(찬물: 체중: 68.4kg ==> BMI: 23.53[과 체중])
20:50 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 파이썬 무료 기초 강의 - 1강 파이썬이란 무엇인가? [조코딩]
https://www.youtube.com/watch?v=yytWGELNeOI
1. 파이썬 에디터: IDLE, VS Code(무료) PyCharm(유료)
==============================================================================================================

- 파이썬(python) 설치와 실행, IDLE(아이들) 사용 방법
https://www.youtube.com/watch?v=3KyPi18PlPk
1. IDLE (Python 3.11 64-bit)
==============================================================================================================

- Visual Studio 이전 버전 다운로드
https://code.visualstudio.com/docs/supporting/faq#_previous-release-versions

1. VSCode-win32-x64-1.50.1.zip ==> https://update.code.visualstudio.com/1.5/win32-x64-archive/stable
==============================================================================================================

- 7zip 분할압축 방법 @@@ 
1. 압축 파일에 추가.
 1) 파일:  마우스 오른쪽 버튼 --> 7-zip -> 압축파일에 추가: 클릭
 2) 압축파일애 추가(새창)
  가. '볼륨 나누기, 바이트(V)': 20M: 입력 
  나. 확인: 클릭 ==> 분할 압축이 가능
----------------------------------------------------------------------------------------------

2. 분할압축 풀기.
 1) 파일:  마우스 오른쪽 버튼 --> 7-zip -> 압축 풀기: 클릭   
  가. 7zip으로 분할 압축한 파일은 001, 002, 003과 같이 숫자가 순서대로 붙게 되는데 반드시 첫 번째 파일인 001을 선택하여 풀어야 
  정상적으로 압축이 풀리게 된다
----------------------------------------------------------------------------------------------

- VSCode-win32-x64-1.50.1.zip 파일  분할압축
VSCode-win32-x64-1.50.1.7z.001 --> 20M
VSCode-win32-x64-1.50.1.7z.002 --> 20M
VSCode-win32-x64-1.50.1.7z.003 --> 20M
VSCode-win32-x64-1.50.1.7z.004 --> 20M
VSCode-win32-x64-1.50.1.7z.005 --> 4.44MB
==> tamario@lgupluspartners.co.kr로 메일 발송
==============================================================================================================

■■■■■■■■■■■■■ 2023.07.10(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 출근할 때 비(05:30, 우산)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 추가 수정, 요구 사항 처리
 1. No. 06, No. 16, No. 71, No. 257, No. 262
==============================================================================================================

- 애버커스 이성민 담당(엉업)과 면담(08:20, 회의실)
1. 8월 연장 관련: 거부 함
2. 연장하게 되면 8월부터 서울역에서 근무해야 한다고 함
==============================================================================================================

- [VSCode] 확장 플러그인(Extension) 오프라인 설치 방법
https://haenny.tistory.com/329

- VSCode 확장 프로그램 설치(파이썬에서)
좌측 하단 → 설정(톱니바퀴 아이콘) 클릭
Command Pallete... 클릭 (Ctrl + Shift + P)
'Install from VSIX' 검색 후 클릭
원하는 vsix 파일 (확장 프로그램 설치 파일) 선택 
==============================================================================================================

- 파이썬에서 빠져 나오기 
tamar@TAMA-INO-PC MINGW64 /d/PythonWorkspace
$ py
Python 3.11.4 (tags/v3.11.4:d2340ef, Jun  7 2023, 05:45:37) [MSC v.1934 64 bit (AMD64)] on win32
Type "help", "copyright", "credits" or "license" for more information.
>>> ^Z     ---> Ctrl + Z    ===> 또는 exit()
==============================================================================================================

- 확장판 openpyxl 설치(파이썬에서)
tamar@TAMA-INO-PC MINGW64 /d/PythonWorkspace
$ pip install openpyxl
Collecting openpyxl
  Downloading openpyxl-3.1.2-py2.py3-none-any.whl (249 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 250.0/250.0 kB 7.7 MB/s eta 0:00:00
Collecting et-xmlfile (from openpyxl)
  Downloading et_xmlfile-1.1.0-py3-none-any.whl (4.7 kB)
Installing collected packages: et-xmlfile, openpyxl
Successfully installed et-xmlfile-1.1.0 openpyxl-3.1.2 
==============================================================================================================

■■■■■■■■■■■■■ 2023.07.11(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>

- LG U+ CRM_PDA 현행화 Prj[★] 
- 추가 수정, 요구 사항 처리
==============================================================================================================

- 확장판 openpyxl 설치 후 실행 에러(파이썬에서) 
import "openpyxl" could not be resolved from source Pylance(reportMissingModulesource)
==> PC 조회 정보: C:\Python38\Lib\site-packages
$ cd /c/Python38/Scripts
$ pip install openpyxl
Requirement already satisfied: openpyxl in c:\python38\lib\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\python38\lib\site-packages (from openpyxl) (1.1.0)

$ python -m pip install --upgrade pip
Requirement already satisfied: pip in c:\python38\lib\site-packages (23.1.2)

- openpyxl Lib 경로
C:\Python38\Lib\site-packages\openpyxl, openpyxl-3.1.2.dist-info

1. reportMissingModuleSource 정보 ==> https://github.com/microsoft/pyright/blob/main/docs/configuration.md#reportMissingModuleSource
=============================================================================================================

- [Python] subprocess 모듈 사용법 및 예제 - A6K 개발노트
https://hbase.tistory.com/341

comm_delete = 'rm -f'+ delete_file_nm 
popen = subprocess.Popen(comm_delete, shell=true. stdout = subprocess.PIPE).stdout
comm_delete = popen.read().strip()
delete_res= comm_delete.split('\n')
=============================================================================================================

- 고속버스 예매
- 포항행[서울(06:00) ->포항(10:00), 우등B]: 수종
1. 23.07.27(목) 서울(06:00), 4번, 5번 좌석, 가격: 51,600원
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.12(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(09:30): 보류(아무도 안 함)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 추가 수정, 요구 사항 처리
==============================================================================================================

- [서울시] 2023년 07월 재산세(주택1기분) (정기분) 납부
1, 세목: 재산세(주택1기분), 금액: 74,340원 ==> 카카오 페이(현대카드)로 납부
==============================================================================================================

- 서울행(19:21) -> 서울(21:59), KTX-산천 252]: 수종  ==> 취소: 잘못해서 다음날 코레일 고객 센터에 전화해서 난리침
1. [23.07.30(일)] 서울행(19:21) -> 서울(21:59), KTX-산천 252] 6호차 9C, 9D, 가격: 80,400원(53,600원, 26,800원) ]
 1) KTX 마일리지: 8,000원  ==> 카카오 페이(현대카드 연계) 결제 금액: 74,340원 
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.13(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 중식(비, GS25 발산 파크점에서 김밥으로 중식 후 퀸즈파크9에서 토보), 퇴근할 때 비

- LG U+ CRM_PDA 현행화 Prj[★] 
- 추가 수정, 요구 사항 처리 ==> 완료[♥♡]
==============================================================================================================

- 파이썬 작업(파이썬 SW 사용) 
1. /ob_excel_fm_conts_edit.py		# OB 엑셀 파일 내용 수정 ==> 완료[♥♡]
=============================================================================================================
 
- 서울행(19:21) -> 서울(21:59), KTX-산천 252]: 수종[모바일 결제]
1. [23.07.30(일)] 서울행(19:21) -> 서울(21:59), KTX-산천 252] 4호차 2A, 2B, 가격: 72,400원[80,400원(53,600원, 26,800원)]]
 1) KTX 마일리지: 8,000원  ==> 카카오 페이(현대카드 연계) 결제 금액: 72,400원 
=============================================================================================================
 
■■■■■■■■■■■■■ 2023.07.14(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 오전 10시 이후 계속 비, 예술과 기술 유승현 전무한테 전화(14시, 프로젝트 연장 안 한다고 통보)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 이성진 담당 CRM 재작업 요청 건(7건) 처리
1. No. 21, No. 26, No. 28, No. 29, No. 30, No. 32, No. 48 
=============================================================================================================

- 시분 초 형식 수정 처리
1. No. 35, No. 37, No. 47
=============================================================================================================

- 파일과 ETL 서버 테이블 구조가 다름
1. No. 21 
=============================================================================================================

- 파이썬 작업(파이썬 SW 사용)
1. /ob_sql_fm_copyt.py		# OB sql 파일 복사 처리
=============================================================================================================
 
- 카카오 뱅크 세이프 박스(파킹통장)에 추가 입금
1. 연계 계좌번호 3333-02-3808954(3333023808954)이 계좌에 입금 후 세이프박스에 넣기 처리해야 함
2023.07.14(금): 500만원 입금 --> 합계: 26,039,654원(연 2.4%) 
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.07.15(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:46 기상
06:57 조식(수종: 돈까스 3개)
07:30 실내 도보 
08:00 종료
08:06 집 출발(자전거: 수종, 반팔, 반 바지): 비 조금 옴
08:17 보라매 공원 도착
08:20 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
08:30 종료
08:35 물통에 떠 옴(보라매 공원 놀이터)
08:40 귀가
09:00 샤워(찬물)
09:30 인터넷 서핑
10:40 수종 센터로 감 
11:30 중식
11:45 실내 도보 ==> 주남이형한테 전화 옴(윈도우 업데이트 무한로딩 오류 발생 --> 그 후 PC 청소 후 부팅 안됨)
12:55 종료
12:30 수종 엄마집에 놀러감
13:20 인터넷 서핑 ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 수강
17:30 석식
17:45 실내 도보 
19:10 종료
20:00 집 출발(자전거: 수종, 반팔, 반 바지) 
20:10 다이소 보라매점 방문 ==> 1. 스틸 빨래 건조대(5천원), 2. 일본제 깔대기(소)(천원),	3. 디자인 캐리어 벨트(2천원)
20:30 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원)
20:40 진로 마트 방문 ==> 적 상추(2봉투, 5천원)
21:00 귀가
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 윈도우준비중컴퓨터를끄지마세요, 컴퓨터를 끄지 마세요, 윈도우업데이트무한재부팅
https://www.youtube.com/watch?v=swavReNn4Hw

- 윈도우 업데이트 무한로딩 오류 해결하는 꿀팁!
https://www.youtube.com/watch?v=OM9Ljh7xSv0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.07.16(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
07:16 기상
07:25 조식
07:50 집 출발(흐름)
07:50 도보(도림 도보교 => 낙성대역(2번 턴) => 구로디지털단지역(2번 턴) => 낙성대역): 도림천 호우로 출입 금지됨
09:05 귀가
09:20 샤워(찬물)
10:00 인터넷 서핑  ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 엑셀 자동화(openpyxl) 수강
11:30 중식
11:45 실내 도보
12:55 종료 ==> 책상위에 나무 받침대 2단을 1단계로 조정하여 재배치
13:10 베란다에 스틸 빨래 건조대 설치
13:20 인터넷 서핑 ==> [나도 코딩] 파이썬 - 업무자동화(RPA) 엑셀 자동화(openpyxl) 수강 ==> 완료[♥♡] 
17:30 석식: 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
19:05 종료 
20:20 수종 귀가
20:03 청소(청소기, 밀대) ==> 화장실 청소(과탄산소다 사용: 별 효과 없음)
20:30 샤워(찬물: 체중: 67.1kg ==> BMI: 23.22[과 체중])
20:50 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 욕실타일 찌든때 오염제거
https://www.youtube.com/watch?v=QVc6lImF1PE&t=684s\
1. 과탄산소다 1컵 반, 뜨거운 물, 2. 거품을 내고 바닥에 뿌리기, 3. 5분 방치, 4. 바닥 청소

- 바이칸 테이블솔 미디움(4589), 가격: 13,800원
https://www.enuri.com/detail.jsp?modelno=63404584
==============================================================================================================
 
- 비쥬얼 스튜디오 코드 신규 기능 + 필수 익스텐션 추천
https://www.youtube.com/watch?v=XMfyfNZooi4&t=137s

1. 익스텐션(Extension) 추천
stick: 함수 경로 파악
Settings Sync: 사용 안함(유료 전환 추정)
ES Lint: 코드 에러 확인
GitLens: git 이력 확인
Import Cost: import한 정보(크기 등) 확인
Multiple cursor case preserve: 대소문자 확인
CodeSnap: 코드 복사, 캡처
TODO Highlight: 주석(//) 하이라이트
==============================================================================================================
 
- 테마 변경(비주얼 스튜디오 코드에서)
1. 단축키(F1) 누른 후 "theme"라고 입력 ==> "Preferences: Color Theme" 클릭
 1) 어듑게(Visual Studio): 기존에 어듑게(Visual Studio)가 선택 되어 있음 --> 원하는 테마 선택 가능
 2, /settings.json 파일에서(파일 찾기: Ctrl + P --> settings.json) 테마 설정 여부 확인
{
	"workbench.startupEditor": "none",
	"security.workspace.trust.untrustedFiles": "open",
	"editor.fontFamily": "함초롱돋움",	    // 01. 함초롬돋움 폰트 설정 ■■  
	"editor.fontLigatures": false, 
	"workbench.colorTheme": "Visual Studio Dark"  // 테마 설정  ■■
} 
==============================================================================================================

- launch.json(디버깅 환경설정 파일) 
1. 실행(R) > 디버깅 시작(F5)
D:\PythonWorkspace\.vscode\launch.json(디버깅 환경설정 파일) 
{
    "version": "0.2.0",
    "configurations": [
        {
            "name": "Python: 현재 파일",	// Python 현재 파일 ■■
            "type": "python",
            "request": "launch",
            "program": "${file}",
            "console": "integratedTerminal",
            "justMyCode": true
        },
        {
            "name": "Python: File",
            "type": "python",
            "request": "launch",
            "program": "${file}",
            "justMyCode": true
        }
    ]
}
==============================================================================================================

- 자산 검증 개발
1. 01_ast_vrfc/ast_vrfc.py  ==> D:\PythonWorkspace\01_ast_vrfc\ast_vrfc.py
-------------------------------------------------------------------------------------------------------

- Unix에서 개발
2. 51_Unix/csv_info_tama.py
=============================================================================================================

- 프로젝트 용어집(네이밍 룰) [23.07.16(일)]
01. 공공데이터 공통표준용어(2022.7월).xlsx
02. 프로젝트용어집_통합_V0.3.xls
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.17(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 편의점 충전(5만원)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 이성진 담당 CRM 재작업 요청 건(2건) 수정
1. No. 26, No. 32
2. No. 21 ==> 칼럼 늘리기(최성오 PL이 DBA에 요청)
=============================================================================================================

- [VSCode ] VSCode - VSIX 설치, Extension 오프라인 설치
https://goddaehee.tistory.com/291

1. F1 > Install from VSIX 검색 > 클릭
2. VS Code를 시작하고 Python extension을 설치
=============================================================================================================

- VS코드 확장 오류 수정
https://jung-max.github.io/2020/03/23/VS%20%EC%BD%94%EB%93%9C-%ED%99%95%EC%9E%A5-%EC%98%A4%EB%A5%98-%EC%88%98%EC%A0%95/

1. 파일 이름 C:\users\yourname\.vscode\extensions\name-of-extensions
 1) 폴더를 삭제하면 languageServer.0.3.xx확장 프로그램이 다시 다운로드됩니다.
=============================================================================================================

- python에서 git 명령 실행 및 자격 증명 구성
https://stackoverflow.com/questions/67623395/execute-git-commands-in-python-and-configure-credentials

import subprocess
import os

def movefileAndPush():
    try:
        x = subprocess.run(['cp','Project_Repo_Details.csv','bitbucket_repo_report/Project_Repo_Details.csv'])
        print(x.stdout)
        print(x.stderr)
        os.chdir("/dirs/Repo-report_scripts/bitbucket_repo_report")
        subprocess.run(['git','config','--global','user.email','test@gmail.com'])
        subprocess.run(['git','add','Project_Repo_Details.csv'])
        subprocess.run(['git','commit','-m','PQR-99 adding repo report'])
        subprocess.run(['git','push','https://username:password@gitreporul','--all'])

    except Exception as e:
        print("Error occured :".format(e))
if __name__ == '__main__':
-------------------------------------------------------------------------------------------------------------

import subprocess
import os

def movefileAndPush():
    try:
        x = subprocess.run(['cp' ,'Project_Repo_Details.csv', 'bitbucket_repo_report/Project_Repo_Details.csv'])
        print(x.stdout)
        print(x.stderr)

        os.chdir("/dirs/Repo-report_scripts/bitbucket_repo_report")
        subprocess.run(['git', 'config','--global', 'user.email', 'tamario@lgupluspartners.co.kr'])  # Git Config 설정 확인 및 변경(전역 email 설정)
        subprocess.run(['git', 'add', 'Project_Repo_Details.csv'])	# Git 스테이지 영역에 추가
        subprocess.run(['git', 'commit', '-m', 'CRM TESTDD'])	# commit 에 대한 설명 메시지
        subprocess.run(['git',' push', 'origin', 'develop'])		# 원격 저장소에 반영
	 
    except Exception as e:
        print("Error occured :".format(e))

if __name__ == '__main__':
   movefileAndPush()
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.18(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> Office Lens 핸드폰에 설치 및 OCR

- LG U+ CRM_PDA 현행화 Prj[★] 
1. No. 26, No. 32 다시 수정
=============================================================================================================

- 일일 회의(08:15, 회의실)
1. 여름 휴가 3일 사용 가능: 07.28(금), 07.31(월)
 ==> 07.27(목), 07.28(금) 예정
 ==> 1. 초기 적재 데이타 추출(전체 조회), 2. 운영 적제 대아타 추출(일 배치): 다음주 까지
==============================================================================================================

- 51_Unix(D:\PythonWorkspace\51_Unix)
1. /csv_info_tama.py
2. /csv_info_tama_RD.py
---------------------------------------------------------------------------------------------

- 52_OB_work_local(D:\PythonWorkspace\52_OB_work_local)
1. /excel_fm_conts_edit.py
2. /ob_excel_fm_copy.py  
3. /ob_sql_fm_copy.py
---------------------------------------------------------------------------------------------

- 01_ast_vrfc(D:\PythonWorkspace\01_ast_vrfc)
1. /ast_vrfc.py
=============================================================================================================

- OCR 처리(이미지를 문자 인식 변환)
A. Office Lens 핸드폰에 설치 및 OCR(핸드폰에서)
1. Office Lens 어플 실행
 1) 이미지 촬영 ==> 완료
 2) 제목: 2023_07_18_오전 8:39  Office Lens
 3) 저장 위치: 갤러리, PDF: 체크 ==> 저장
 4) 2023_07_18_오전 8:39  Office Lens.pdf로 저장됨

B. pdf 파일 다운로드(PC에서)
1. ALPDF_OCR_Plugin30.exe SW 설치
2. 알 PDFSW 실행(.pdf 파일 열기)
 1) 문자인식(OCR) 수행: 클릭
 2) 문자인식(OCR) (새창)
  가. 스캔 옵션
   가) 이미지에서 검색 가능한 텍스로 스캔: 체크 ==> 적용
=============================================================================================================

- Git] git config --global 설정 (유저 Name, Email 설정)
git config --global --list

git config --global user.name "JINTAEMAN"
git config --global user.email "tamario@naver.com"
-------------------------------------------------------------------------------------------

- 원격 저장소 주소:
origin --  https://github.com/JINTAEMAN/01_Git_TAMA.git
origin -- https://github.com/JINTAEMAN/01_TAMA_Work

https://github.com/JINTAEMAN/01_Git_TAMA.git
-------------------------------------------------------------------------------------------

- 로그 보기
git log --oneline --all --graph 
===========================================================================================================

- 깃 허브 비번 변경
1./ https://github.com/login  ===> JINTAEMAN/ asas12@@!!tam@
===========================================================================================================

■■■■■■■■■■■■■ 2023.07.19(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 수종 은천 아동 센터에서 음식(라면, 햇반, 반찬) 받아옴(18시)

- LG U+ CRM_PDA 현행화 Prj[★] 
1. No. 26, No. 32
=============================================================================================================

- git 원격 저장소 추가
- 기존 원격저장소를 삭제하고 새로 추가
git remote remove origin;
git remote add origin https://github.com/JINTAEMAN/PythonWorkspace.git

git remote -v			# 원격저장소 목록 조회
 
git log --oneline --all --graph 		# 로그 보기

git pull origin main; 
git add -A;
git commit -m "Add to Python Work space[22.07.19(T_04)], by 진태만];";
git push origin main;		# origin으로 이름지어진 저장소에 현재 master Branch를 push

tamar@TAMA-INO-PC MINGW64 /d/PythonWorkspace (main)
$ git log --oneline --all --graph 
* c963f12 (HEAD -> main, origin/main) Add to Memo(2023.07).sql 추가[22.07.19(T_03), by 진태만]
* 0c4445f Add to Python Work space[22.07.19(T_02), by 진태만]
* 697ce28 Add to Python Work space[22.07.19(T_01)], by 진태만];
* 71740c0 Add to Python Work space[22.07.19(T_01)], by 진태만];
* 340b240 v1_test
=============================================================================================================

- [Visual Studio Git] 깃(Git)에 올리지 말아야 할 파일 제외 하는 방법 - gitignore
https://blog.danggun.net/7702

D:\PythonWorkspace\.gitignore
.git/
.vscode/
.vscode/launch.json 
.vscode/settings.json
.gitignore
=============================================================================================================

- Memo(2023.07).sql 수정
cp  /D/'01. TAMA_DATA'/'01. TAMA Work'/'01. Memo'/'Memo(2023.07).sql'  /D/PythonWorkspace/'01. Memo'

git add -A;
git commit -m "Add to Memo(2023.07).sql 수정[22.07.18(T_01_2), by 진태만]"; 
git push origin master;		# origin으로 이름지어진 저장소에 현재 master Branch를 push
===========================================================================================================

- 영문 주소 변환
https://www.jusoen.com
1. 한글 주소: 여수시 무선로50 신동아파밀리에 107동405호 
2. 영문 주소: Room 405, Building 107, Shindong A Familie APT, 50, Museon-ro, Yeosu-si, Jeollanam-do, Republic of Korea 
============================================================================================================= 

- branch 확인
$ git branch  # 전환한 브랜치인 testBranch 앞에  '*' 표시
$ git checkout 'master'		# 브랜치 전환(main, master) ■■■
$ git branch 'master'		# 브랜치 생성  
$ git checkout -b <branch>   # 브랜치 작성과 체크아웃을 한꺼번에 실행 
============================================================================================================= 

■■■■■■■■■■■■■ 2023.07.20(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 신한 직불 카드로 ATM기에서 5만원 출금(11:50, LG 사이언스 빌딩 지하 1층[E13])

- LG U+ CRM_PDA 현행화 Prj[★] 
1. ob_sql_fm_copy.py 개발 ==> 완료[♥♡]
2)  git bash를 사용하여 python 실행
p$ ython D:\PythonWorkspace\02_0B_Windows\ob_excel_fm_copy.py
=============================================================================================================

- 수영모 구입
- 아레나 스판 수영모자 ATAAS01. 색상: 블루, 블랙, 가격: 10,360원(2개)
https://item.gmarket.co.kr/DetailView/Item.asp?goodscode=1300313932
https://www.enuri.com/detail.jsp?modelno=28871524
=============================================================================================================

- 청소 솔 구입
- 바이칸 테이블솔 미디움 녹색 45892. 테이블솔: 미디움/녹색, 가격: 13,800원
https://www.11st.co.kr/products/664788264
https://www.enuri.com/detail.jsp?modelno=63404584
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.21(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 류규식(대리, DBA) 철수(13시)

- LG U+ CRM_PDA 현행화 Prj[★]  
- DTTM 쿼리 변경 및 SQL 수정
1. sql 수정(ob_dsgn, ob_dsgn_CRM)
2. 매핑 테이블(excel) 수정
3. 매핑 정의서(변수 리스트)
 1) p_ymd: 금일  ==> @p_from 
 2) p_ymd_n1: 익일 ==> @p_to
 3) p_ymd_1: 전일 ==> @p_to  --- 사용 안함
===========================================================================================================

- ob_sql_fm_copy.py 개발 중지
1. Git Lab서버에 develop 브랜치 데이타 모두 삭제됨
 1) git push -f origin develpo # 5.원격 저장소에 반영 사용 --> git push -f 절대 사용하지 말 것
2. 이성민 담당이 이 문제로 난리침 --> 어제 저녁에 PM에게 전화 했는데 안 받아서 열받았고 최 PL이 전홤\
 1) 아침에 (주)애버커스 SM이 복구 ==> 다행히 LG U+ 임원에셔 보고도 안하고 문제 없이 지나갔다고 함
===========================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.07.22(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
05:50 기상
06:12 조식(수종: 짜파게티 2봉, 돈까스 2개)
06:30 집 출발(자전거: 수종, 반팔, 반 바지)
08:40 보라매 공원 도착
08:40 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격): 운동장 자리 옮김(기존 장소: 에어로빅으로 사용 중)
07:05 종료
07:08 물통에 떠 옴(보라매 공원 놀이터)
07:15 귀가
07:50 샤워(찬물)
08:30 인터넷 서핑 ==> python_ws_pu.py 개발 
10:40 수종 센터로 감 
11:30 중식
11:45 실내 도보
12:30 수종 엄마집에 놀러감
13:00 종료 
13:20 인터넷 서핑 ==> python_ws_pu.py 개발
17:43 태용이 우리집에 도착 ==> 돈가스 한 박스 싣고 옴(냉동장에 보관)
18:00 집 출발(태용이 차): 비 조금씩 내림(우산 소지)
18:10 명륜 진사갈비 서울대림점 도착
18:17 석식(고기 부페): 배 많이 부름
18:50 종료 ==> 내가 쏨(37,800원)
19:10 종료 
19:45 세븐일레븐 관악평화점 도착 ==> 냉동 만두 2봉, 음료수 2개 구입(태용이가 계산)
20:00 귀가 ==> 태용이에게 스쿼트 챌린지 어플 사용법 알려줌
21:00 태용이 집으로 감
21:05 실내 도보 
22:00 종료
22:10 샤워(찬물)
22:56 취침
==============================================================================================================

- python_ws_pu.py 개발
1. /python_ws_pu.py   # python Workspace 처리 파일 
 -----------------------------------------------------------------------------------------------------------
 
# python Workspace 처리 파일 실행(Git bash에서 처리) ■■■■■■ 
#  python /D/PythonWorkspace/python_ws_pu.py
#  python /D/PythonWorkspace/python_ws_pu.py get
==============================================================================================================

- [Python 팁] py파일을 바로 실행시킬 수 있는 batch 파일 만들기
https://blog.naver.com/sangja84/221572597615 
1. 01_python_ws_pu_get.bat 파일 생성(D:\PythonWorkspace\)
"C:\Python311\python.exe" "D:\PythonWorkspace\python_ws_pu.py get"
2. 02_python_ws_pu.bat 파일 생성(D:\PythonWorkspace\)
"C:\Python311\python.exe" "D:\PythonWorkspace\python_ws_pu.py"
==============================================================================================================
 
- Git] .gitignore에 .vscode 추가해도 .vscode가 사라지지 않을 때
1. https://velog.io/@bky373/Git-gitignore%EC%97%90-.vscode-%EC%B6%94%EA%B0%80%ED%95%B4%EB%8F%84-.vscode%EA%B0%80-%EC%82%AC%EB%9D%BC%EC%A7%80%EC%A7%80-%EC%95%8A%EC%9D%84-%EB%95%8C
2. 원인: 이미 캐시 안에 파일이 추가되어 있던 것

D:\PythonWorkspace> git rm -r --cached .vscode/ 
rm '.vscode/launch.json'
rm '.vscode/settings.json'
===========================================================================================================

■■■■■■■■■■■■■■■ 2023.07.23(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:41 기상: 비옴
06:45 조식 
07:01 실내 도보
08:23 종료
08:50 샤워(찬물)
09:10 인터넷 서핑 ==> 52_OB_work_local 개발
11:30 중식
11:45 실내 도보
12:55 종료
13:50 인터넷 서핑 ==> 52_OB_work_local 개발
17:30 중식
17:50 실내 도보
18:23 수종 귀가
19:00 종료
20:03 청소(청소기, 밀대) ==> 화장실 청소(바이칸 테이블솔 사용)
20:30 샤워(찬물: 체중: 69.4kg ==> BMI: 24.01[과 체중])
20:50 인터넷 서핑
22:30 취침
==============================================================================================================

- 52_OB_work_local 개발
1. ob_sql_fm_copy.py: OB SQL 파일 복사 쳐리 파일(복사, Git 처리)  ==> 완료[♥♡]
2. ob_excel_fm_copy.py: OB 엑셀 파일 복사 쳐리 파일(복사)  ==> 완료[♥♡]
3. ob_excel_fm_conts_edit.py: OB 엑실 파일 내용 수정 파일  ==> 완료[♥♡]
 1) 파일명
01. L0BIM_DCT_CALENDAR
02. L0BIM_DKV_GC_PP
03. L0BIT_OHW_DCF_SBGN_MART
04. L0BTM_ORG_USER
05. L0CPT_CC_APP_WASLOG_V3
06. L0CR_TB_CMCE_CMPN_RSPN_RSLT_H 
==> D:\ob_dsgn\01_L0BIM_DCT_CALENDAR\		# 복사할 파일 경로(ob_dsgn 폴더): 1. 복사 대상 피일
/01_L0BIM_DCT_CALENDAR.xlsx, /grape_odl_cr_002_l0bim_dct_calendar_001_bq2gcswithfin.sql
==> D:\PythonWorkspace\dlk_airflow_01\l0\bi 		# 복사할 파일 경로(2. 복사 결과 피일) 
/01_L0BIM_DCT_CALENDAR.xlsx, /grape_odl_cr_002_l0bim_dct_calendar_001_bq2gcswithfin.sql

 2) 에러 발생
 가.  batch_value = '8 2'			# 배치 스케줄 값 수정을 영어로 인식 못 함
 [@_T] ■■ [/ob_excel_fm_conts_edit.py] ==> [T_99] [End] ■■■■
Traceback (most recent call last):
  File "D:\PythonWorkspace\52_OB_work_local\ob_excel_fm_conts_edit.py", line 142, in <module>
    write.writerows(csv_res)
UnicodeEncodeError: 'cp949' codec can't encode character '\u2022' in position 25: illegal multibyte sequence
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.24(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 김일기 PM, 전 책임(코로나 확진), 이재만 책임(코로나 확진), 박 책임(시아버지 상) 휴가

- LG U+ CRM_PDA 현행화 Prj[★] 
- DTTM 쿼리 변경 및 SQL 수정
1. sql 수정(ob_dsgn_CRM 수정 후 ob_dsgn 수정) 
=============================================================================================================

- 매핑 테이블(excel) 수정
1. /ob_excel_fm_conts_edit.py(OB 엑실 파일 내용 수정 파일)) 사용
=============================================================================================================

- Back up_■
99. 다운로드 Back up_■■
99. Back up_■
01. Memo gita Back_up
------------------------------------------------------------------------------------------

D:\01. TAMA_DATA\01. TAMA Work 
\01. Memo
\01. Memo Gita Back_up\
=============================================================================================================

- Sorry, we cannot cherry-pick this merge request automatically
https://stackoverflow.com/questions/49670336/gitlab-sorry-we-cannot-cherry-pick-this-merge-request-automatically
=============================================================================================================

■■■■■■■■■■■■■ 2023.07.25(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★] 
- DTTM 쿼리 변경 및 SQL 수정
1. 메타 텝플릿 파일 수정(No. 21 ~ )
=============================================================================================================





■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 