

- 법원 경매[1치] (10시, 현아트빌 404호)
1, 매각기일 및 매각결정기일
 가. 제 1회 매각기일: 22.10.06(목) 10시, 매각결정기일: 22.10.13(목) 10시
 나. 제 2회 매각기일: 22.11.10(목) 10시, 매각결정기일: 22.11.17(목) 10시
 다. 제 3회 매각기일: 22.12.15(목) 10시, 매각결정기일: 22.12.22(목) 10시
 라. 제 4회 매각기일: 23.02.02(목) 10시, 매각결정기일: 23.02.09(목) 10시

2, 최적 매각 가격
매각 물건			제 1회			제 2회			제 3회			제 4회
1			 302,000,000원		 241,600,000원		 193,280,000원		 154,634,000원
 가. 제 1회 매각기일: 22.10.06(목) 10시, 매각결정기일: 22.10.13(목) 10시
 
3, 매각 및 매각 결정 장소
가. 서울중앙지방법원 (매각)경매 법정(제4별관 211호), (매각 결정)배당 법정(제4별과 3층 7호) 
============================================================================================================

- 법원 경매[1치] (10시, 현아트빌 404호)
1, 제 1회 매각기일: 22.10.06(10시)  매각 기일(제 4별관 211호) ==> 감정 평가액: 302,000,000원, 최저매각 가격: 302,000,000원
22.10.13(14시)  매각 결정 기일(제4별과 3층 7호)
==> 매각기일에 입찰장소에서 입찰자에게 입찰가격을 기재한 입찰표를 넣고 봉함한 입찰봉투를 제출하게 한 후 
그중에서 최고가의 신고를 한 자를 최고가매수신고인으로 정한 다음 매각결정기일에서 매각허가결정을 하는 방법
==> 전세가: 2억 8백 5백 만원
============================================================================================================