 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// 51. 메인 소스 분석 //-------------------------------/ 2022.07.20(수) /-----+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 로그 보기 ●●●
1. 콘솔창(브라우저)에서 로그 보기 
console.log("\n\n\n\n [@_T] ■■■ [/CommonController.java] [getCodeList()] ==> [T_01] [공통코드 조회 Start] ■■■");
console.log("\n\n [/CBSC101P.xml] [btn_Login_onclick()] ==> [조회] [TEST_01]"); 
$w.log("[/CM_CmmCdMngm.xml] [doInit()] ==> [화면 초기화 정의] [TEST_01]");  	// 사용하지 말 것 @@@@@@@ 
$w.log("\n\n[######################### [/SB_AgvCostNoRegInqy.xml Start] #########################] ===============================================> ");  
----------------------------------------------------------------------------------------------------------
 
2. java에서 로그 보기
System.out.println("\n\n\n\n [@_T] ■■■ [/CommonController.java] [getCodeList()] ==> [T_01] [공통코드 조회 Start] ■■■ "); 

System.out.println("[@_T] [/CommonController.java] [getCodeList()] ==> [T_98] [resultMap]"+ resultMap );  
System.out.println("\n\n\n\n[@_T] ■■■ [/CommonController.java] [getCodeList()] ==> [T_99] [공통코드 조회 End] ■■■ "); 
--------------------------------------------------------------------------------------------------------------------------

System.out.println("[/STD000050Controller.javal] [lfn_Search()] ==> [조회 처리] [TEST_30_1]  [obj에 Ds 칼럼 담기] [i_번째]"+ i 
	+"[Obj ID]"+ obj.id +"[Obj 값]"+ obj.Obj.getValue() +"[obj.Obj.getValue()]"+ obj.Obj.getValue() ); 
 
logger.info("[/STD000050Controller.java] [selectTiBlSave()] ==> [TEST_01]" );  
logger.info("[/STD000050Controller.javal] [lfn_Search()] ==>  [조회 처리] [TEST_41] [obj에 Ds 칼럼 담기] [i_번째]"+ i +"[Obj ID]"+ obj.id +"[Obj 값]"+ obj.Obj.getValue()  ); 
==============================================================================================================

// 추가: 22.06.02, by 진태만 
// 수정[ds_itemInfoSub -> ds_itemInfoSub로 변경]: 22.06.04, by 진태만
----------------------------------------------------------------------------------------------------------

- Mybatis 쿼리 주석 @@@
/* 조회품목별 수주현황 조회 ==> [/ORD000140_mapper.xml.selectOrd000140] [22.06.06, by 진태만] */  
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

