 	

10:43 당뇨 상담 ==> 당화혈색소 검사, 피 검사(39,200원): 혈당치: 181, 혈압: 120.80(혈압 정상)
09:40 건강검진 결과 상담(4,700원) ==> 대체로 정상(콜레스테롤 수치 ↑{약 복용}): 한 달 후 상태 확인 
10:20 윤약국 방문 ==> 조제(콜레스테롤 + 당뇨약: 1주달 일치: 3,300원)
10:45 다이소 신림점 방문 ==> 오릭스 핸드로션(350 ml, 2개, 6천원), 메모리폼 방석(약40X40cm, 효성 PMS Prj 사업장용, 5천원) 구입
10:60 귀가
12:00 중식
12: 
22:30 취침
==============================================================================================================

- 건강검진 1862611003] Cholesterol), Total, 249, H, 참고치: Desirable[바람직한] < 200
1. [D1860003] AST(SG0T), [결과] 29, <= 40 U/L ==> 간기능 정상 ■
2. [D2611003] Cholesterol, Total, [결과] 249, H, 참고치: Desirable[바람직한] < 200
3. [D2614003] LDL-Cholesterol, [결과] 145, H, 참고치: Optimal[최적] < 100   --> 70이하로 낮출 것(의사 권유, 고지혈증) ■■■
4. [D3063003] HbA1c, [결과] 6.7, H, 참고치:정상] < 5.6    -->  당뇨 >= 6.5% ■■■
6. [D4902023] 25-CH Vitamin D, Total, [결과] 41.47,  ,Desirable[바람직한] < 20.00
7. [D3250013] TSH, [결과] 1.140,  , 0.270 ~ 4.200 u IU/mL--> 감상선(정상)
==> Deficiency(부족한), Insufficiency(불충분), Sufficiency(충분한), Toxicity(독성)
==============================================================================================================
 
 
 
 
 
10:43 당뇨 상담 ==> 당화혈색소 검사, 피 검사(39,200원): 혈당치: 181, 혈압: 120.80(혈압 정상)
09:40 건강검진 결과 상담(4,700원) ==> 대체로 정상(콜레스테롤 수치 ↑{약 복용}): 한 달 후 상태 확인 
10:20 윤약국 방문 ==> 조제(콜레스테롤 + 당뇨약: 1주달 일치: 3,300원)
10:45 다이소 신림점 방문 ==> 오릭스 핸드로션(350 ml, 2개, 6천원), 메모리폼 방석(약40X40cm, 효성 PMS Prj 사업장용, 5천원) 구입
10:60 귀가
12:00 중식
12: 
22:30 취침
==============================================================================================================
	
- 건강검진 1862611003] Cholesterol), Total, 249, H, 참고치: Desirable[바람직한] < 200
1. [D1860003] AST(SG0T), [결과] 29, <= 40 U/L ==> 간기능 정상 ■
2. [D2611003] Cholesterol, Total, [결과] 249, H, 참고치: Desirable[바람직한] < 200
3. [D2614003] LDL-Cholesterol, [결과] 145, H, 참고치: Optimal[최적] < 100   --> 70이하로 낮출 것(의사 권유, 고지혈증) ■■■
4. [D3063003] HbA1c, [결과] 6.7, H, 참고치:정상] < 5.6    -->  당뇨 >= 6.5% ■■■
6. [D4902023] 25-CH Vitamin D, Total, [결과] 41.47,  ,Desirable[바람직한] < 20.00
7. [D3250013] TSH, [결과] 1.140,  , 0.270 ~ 4.200 u IU/mL--> 감상선(정상)
==> Deficiency(부족한), Insufficiency(불충분), Sufficiency(충분한), Toxicity(독성)
==============================================================================================================
 
 

	콜레스테롤(cholesterol) | 알기쉬운의학용어 | 의료정보 | 건강정보


■■■■■■■■■■■■■■■■■■ 2022.01.22(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
07:00 기상
07:40 조식
08:10 실내 도보
08:40 종료
09:10 집출발(자전거) 
09:20 연세의원(서울 관악구 신원로 23) 방문
09:25 건강검진 결과 상담(4,700원) ==> 대체로 정상(간 수치가 당뇨 환자라면 약간 낮게 유지 해야 한다고 함): 비타민D 부족(25.91ng/ml, 햇볕 쪼일 것) 
		==> 10 ~ 12ng/ml: 비타민D 절대적 결핍(12 ~ 20ng/ml 이면 정상이라고 함) ■, 당화혈색소 결과: 6.1%
10:00 다이소 신림3호점 방문 ==> 크레신 이어폰 107 화이트(100원 포인트, 4천 9백원: 다이소 이어폰), 컬러풀 손톱깎이(대 )(천원)
		, 휴대용 칫솔세트(치실 1개 + 스틱 치실 6개 포함: 천원) 구입
10:30 귀가
11:10 인터넷 서핑 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 서핑
18:00 석식
18:20 실내도보
20:00 종료   
21:30 인터넷 서핑
23:30 취침
======================================================================================================================