 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// 01, 윈도우 10 설치 방법 //--------------------------/ 2021.07.18(일) /-----+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 01. 윈도우 10 설치 방법 ■■■ 
A. 부팅 USB 사용 ==> PC 켜서 ==> F2 또는 Del키 누름 ==> Boot 탭
 1. Boot
  1) UEFI Hard Disk Drive BBS Priorithes: 클릭
  2) Boot Option #1 --> UEFI: OS(SanDsik Cruzer Blade 1.27): 클릭 ■ 
 2. F10: Save & Reset: 클릭
---------------------------------------------------------------------------------------------------------------------

B. Windows 지금 설치
1. Windows 정품 인증
 1) 제품키가 없음: 선택
 
2. 설치할 운영 체제 선택(S)
 1) Windows 10 Pro: 선택(Home 보다 1.5배 비쌈)
 
3. 관련 통지 및 사용 조건
 
4. 설치 유형
 1) 사용자 지정: Windows만 설치(고급) (C)

5. Windows를 설치할 위치 지정 
 1) 할당되지 않는 공간: 삭제(D) ==> 삭제 후 다시 설정
 
6. 계속하려면 Windows를 다시 시작해야 합니다. 
 1)  USB 무조건 빼기 ■■■

7. Windows  설치 중
--------------------------------------------------------------------------------------------------------------
