

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------// LG U+ CRM_PDA 현행화 Prj 정보 //-----------------------------------/ 2023.04.10(월) /----+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- LG U+ CRM_PDA 현행화 Prj 정보 @@@@ 
1. 프로젝트 명 : LG U+ CRM_PDA 현행화 프로젝트
2. 고객사 : LG U+
3. 수행사 : (주)에버커스
4. 계약사 : (주)예술과 기술
5. 계약기간 : 2022-05-01 ~ 2022-10-31 (6개월)
6. 근무장소 : 퀸즈파크10 7층(716호) (마곡역 9번 출구)
7. 프로젝트 내용 : GCP 데이터(BigQuery) CRM 연동을 위해 이관 후 Netezza DB로 마이크레이션
   GCP(Google Cloud Platform)
   --> LG U+ CRM 연동 개발 Prj 3개월 단위로 재계약 --> 잘하면 12월까지 간다고 함
8. 월단가 : ***만원
9. 월용역비 지급일시 : 매 익월 10일 (휴일일 경우 전일지급)
10. 계약방식 : 개인 3.3 % 공제방식 (산재보험료 추가 차감 : 13,780원 + 고용 보험)
11. 메인 업무
 1) BigQuery에서 GCS로 파일 추출 => ETL 서버로 전송
 2) ETL을 이용하여 PDA에 적재
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 
 
- 프로젝트 인원(총 9명. 팀원)
0. 홍진경(책임, 고객 PM, LG U+)
1. 김일기(수석, (주)애버커스 미래사업본부 Data 서비스 운영팀
 ■
2. 권용성(책임, P2 PL) ♠
3. 이병욱(책임, P2, (주)인포젠, 현장 관리인[010-2798-0775])
4. 송재혁(책임, P2)
5. 김영식(책임, P2, 04.20(목) 추가 투입, 계대 경영학과 91학번) 
6. 최성오(책임, PL P1) ■
7. 오재영(책임, P1, 신림)
8. 전필관(책임, P1, 84년생, (주)인포젠 --> (주)예술과 기술)
9. 박묘숙(책임, P1, 계대 컴공과 97학번, (주)인포젠 --> (주)예술과 기술)
- (주)애버커스[LG U+ 1차 협력 업체]
http://www.iabacus.co.kr
- (주)인포젠[LG U+ 1차 협력 업체]
http://www.infogen.co.kr
============================================================================================================== 

- 업무 관련
성경환(선임: LG NS 유플러스 빅데티아팀): 010-9114-2218
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 
 
- U Cloud(LG U+)
1. https://ucloud.lguplus.co.kr, tamario/8a60d5c85c 
2. 외부 접속 IP: 211.44.220.135
==============================================================================================================

- Cloud PC 재 신청(결재 처리)
https://ucloud.lguplus.co.kr/vmCube/Management/Desktop/RequestCreate
1. Cloud PC 사양: 업무 Cloud PC(통합OSS-WIN10)
[업무클라우드 신청]
1. 신청사유: CRM 데이타 현행화 프로젝트 수행
2. 외부 접속 IP: 211.44.220.135

[보안클라우드 신청]
1. 신청사유: CRM 데이타 현행화 프로젝트 수행
2. 접근제어시스템 : DB
3. 접근제어시스템 ID : tamario
4. 담당업무: CRM 데이타 현행화 프로젝트 수행
-------------------------------------------------------------------------------------------------------------------------------

- 외부접속/모바일앱사용 재 신청(결재 처리)
https://ucloud.lguplus.co.kr/vmCube/Management/VPN/VPNRequest
1. 요청사유(상세히) : CRM 데이타 현행화 프로젝트 수행
============================================================================================================== 

- Cloud PC 결재 후 조치
1. 업무 클라우드 실행
 1) 정보보안 교육(17시)
 2) 메신저 실행(M Messenger)
2. 보안 클라우드 실행
==============================================================================================================

- LG U+ CRM 연동 개발 Prj 정보
1. 와이파이: Airport 5G/abcd1234ok!
2. 도어락: 0130*
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 

- 다시 그리는 데이터 웨어하우스 그리고 BigQuery[Google Cloud APAC]
https://www.youtube.com/watch?v=JT52dzuBpPE
==============================================================================================================
 
- BigQuery를 효과적으로 사용하는 방법
https://www.youtube.com/watch?v=y1mcayr1G_4&t=264s 
==============================================================================================================
  
- GCP 빅쿼리(BigQuery) 코딩없이 데이터 전송하기ㅣ 실전! 구글 클라우드(GCP) 가이드 - Data & AI 편 01[클루커스].
https://www.youtube.com/watch?v=oz2rEEq_aI0
1. GCP
https://console.cloud.google.com
==============================================================================================================

- [Korea] Cloud OnBoard -Google Cloud Fundamentals (Jan 2022) [Google Cloud APAC]
https://www.youtube.com/watch?v=eZCnpzMPnpw&list=PLWYw-NqNglu78PvB3PmUBbaCBAom6spTT

- 모듈 4: 빅데이터와 머신러닝[Google Cloud APAC]
https://www.youtube.com/watch?v=OKeYaYWrlWc&list=PLWYw-NqNglu78PvB3PmUBbaCBAom6spTT&index=4
============================================================================================================== 
==============================================================================================================
 
- 실전! 구글 클라우드(GCP) 가이드[클루커스]
]https://www.youtube.com/watch?v=dTt3Nknsq68&list=PLQ1xZQIEWsHcBRoR0eGnU1TMJMP26dSdV
==============================================================================================================

- BigQuery 시작하기[SKplanet Tacademy]
https://www.youtube.com/watch?v=MILy4dzSGk4&list=PL9mhQYIlKEhc42aoo-zvaSVOFCqGBD4ev
==============================================================================================================

- Bigquery Netezza
(1). ETL TOOL :  informatica(인포메디카)
============================================================================================================== 
 
- IBM Netezza 데이터 웨어하우스 어플라이언스를 Oracle Autonomous Data Warehouse로 이전
https://docs.oracle.com/ko/solutions/migrate-netezza/index.html
1. PDA 솔류션(IBM) 
 1) Google Bigquery ==> IBM PDA(PureData Analysis) DB(Netezza)
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 
- 결재 신청 @@@@
12-1. 방화벽 신청 ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: CRM 데이타 현행화 프로젝트 수행
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.18.195.34 		6. TCP: 6005~6009,6014-6114
7. 사용 목적: INFORMATICA 관련 방화벽 해제 요청 
==============================================================================================================

9-2. DBsafer 접속권한  ==> 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 개인계정 신청 > 신규계정 신청(화면) 
1. 운영 + 개발 ==> 신청하기
1단계
1. DBMS 신청정보
 1) DBsafer
 2) TrustedOrange_new
2단계: DB접근제어(DBsafer) 신청
1. 승인자 선택: 이유미(선임)
2. 신청사유: CRM 데이타 현행화 프로젝트 수행
3. 요청IP: 172.28.185.187(보안 클라우드 IP) 
 ■ 요청처리 결과 조회
1. 요청구분 ==> 계정 등록,  시스템 타입: DBACCESS, 승인상태: 요청(1)
==============================================================================================================

9-3. DBMS 접속 신청  ==> 결재 완료[♥♡]
■ 마당 > See All > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청
 > DBMS 접속 신청(DBSAFER 접속권한 신청)  ==> DBsafer 접속권한이 결재가 나야 신청 가능 ■■■
1. 관리유형: 빅데이타 플랫폼
2. 시스템명: dadm1  					3. 시스템 계정: METASEL

시스템명, 							시스템유형, 		시스템계정, 		계정 분류
bdpdadm1_bdppda, 			PDA, 				METASEL			DBMS(BDP) Software	---> 운영기
sbdpdadm1_sanboxpda, 	PDA, 				METASEL			DBMS(BDP) Software	---> 운영기

 4. 승인자 선택
 1) 결재자 선택: 하늘(책암): PDA
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
 
 5. DBMS 공용계정 접속 신청 정보
 1) 시스템명: bdpdadm1_bdppda			2) 시스템유형: PDA
 3) 계정명: METASEL			 					4) 서버 IP: 172.18.192.55(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 5480■
 7) 신청 구분: DBMS
 
 1) 시스템명: sbdpdadm1_sanboxpda	2) 시스템유형: PDA
 3) 계정명: METASEL			 					4) 서버 IP: 172.18.192.65(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 5480■ 
 7) 신청 구분: DBMS
 
 ■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(2)
------------------------------------------------------------------------------------------------------------

9-3. DBMS 접속 신청   ==> 완료[♥♡]
■ 마당 > See All > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청
 > DBMS 접속 신청(DBSAFER 접속권한 신청)  ==> DBsafer 접속권한이 결재가 나야 신청 가능 ■■■
1. 관리유형: 빅데이타 플랫폼
2. 시스템명:  dbm1 					3. 시스템 계정: METASEL

 시스템명, 							시스템유형, 		시스템계정, 		계정 분류
bdptdbm1_PUBD1, 			Oracle, 				METASEL			DBMS(BDP) Software	 ---> 운영기
tbdptdbm1_DUBD, 			Oracle, 				METASEL			DBMS(BDP) Software   ---> 운영기

 4. 승인자 선택
 1) 결재자 선택:  이유미(선임)
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
 
 5. DBMS 공용계정 접속 신청 정보
 1) 시스템명: bdptdbm1_PUBD1			 	2) 시스템유형: ORACLE
 3) 계정명: METASEL			 						4) 서버 IP: 172.18.192.171(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 1521
 7) 신청 구분: DBMS
 
 1) 시스템명: tbdptdbm1_DUBD				2) 시스템유형: ORACLE
 3) 계정명: METASEL			 						4) 서버 IP: 172.18.195.201(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 1521
 7) 신청 구분: DBMS
 
 ■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(2)
==============================================================================================================

9-1. DB Safer설치  ==> 완료[♥♡]
[ 전사 공용 소프트웨어(보안망용) ] -> [ 03.업무용 SW ] -> [ 04.BDP ] -> [ PDA 어질리티 ]의 
AginityWorkbenchSetupx86.exe 실행 후 계속 다음 클릭하여 설치 완료
==============================================================================================================

11-2. 계정 신청
■ 마당 > See All > 시스템계정통합관리(EPD) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청
 > DBMS 접속 신청(DBSAFER 접속권한 신청)  ==> DBsafer 접속권한이 결재가 나야 신청 가능 ■■■
 
1. 관리유형: 빅데이타 플랫폼
2. 시스템명:   					3. 시스템 계정: METASEL 

시스템명, 							시스템유형, 		시스템계정, 		계정 분류
bdpdadm1_bdppda, 			PDA, 				METASEL			DBMS(BDP) Software	---> 운영기
sbdpdadm1_sanboxpda, 	PDA, 				METASEL			DBMS(BDP) Software	---> 운영기

 4. 승인자 선택
 1) 결재자 선택: 하늘(책암): PDA
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
 
 5. DBMS 공용계정 접속 신청 정보
 1) 시스템명: bdpdadm1_bdppda			 	2) 시스템유형: PDA
 3) 계정명: METASEL			 						4) 서버 IP: 172.18.192.55(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 5480■
 7) 신청 구분: DBMS
 
 1) 시스템명: sbdpdadm1_sanboxpda		2) 시스템유형: PDA
 3) 계정명: METASEL			 						4) 서버 IP: 172.18.192.65(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 5480■ 
 7) 신청 구분: DBMS
 
 ■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(2)
==============================================================================================================
 
12-2. 계정 신청  ==> 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > 서버 접속 신청
1. 관리유형: 빅데이타 플랫폼
2. 시스템명: tbddcetl1 					3. 시스템 계정: infaadm    ---> 검색
4. 승인자 선택: 이유미(선임)
5. 신청사유: CRM 데이타 현행화 프로젝트 수행
6. 서버 접속 신청 정보
 1) 시스템명: tbddcetl1			2) 시스템: Linux
 3) 계정명: infaadm					4).서버 IP: 172.18.195.34
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)		 6) 신청 구분: SSH[체크], SFTP[체크] --> 신청
 ■ 요청처리 결과 조회
1. 요청구분 ==> 서버 접속, 승인상태: 요청(1)
==============================================================================================================

12-3. 계정 신청  ==> 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청(화면)
==> 미등록 시스템 신청(버튼): 클릭 > 미등록 시스템 신청(DBSAFER 접속권한 신청)
1. 시스템명:PINS 					2. 시스템 유형: ORACLE(아무 거나 선택)
3. 시스템 계정: usr_dlk_own, usr_dlk_svc
4. 미등록 시스템 접속 신청
1) 승인자 선택: 이유미(선임)
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
3..요청IP: 172.28.185.187(보안 클라우드 IP) 
5. DBMS 접속 신청 정보
 1) 시스템명: PINS					2) 시스템 유형: ORACLE:
 3) 계정명: usr_dlk_own		4).서버 IP: 172.31.94.7
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 10005
 
 1) 시스템명: PINS					2) 시스템 유형: ORACLE:
 3) 계정명: usr_dlk_svc			4).서버 IP: 172.31.94.7
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 10005
  
■ 요청처리 결과 조회
1. 요청구분 ==> DBMS 접속, 승인상태: 요청(2)
==============================================================================================================

14-1. 방화벽 해제 요청(이메일) 
1. Airflow 접속 정보  
(S DAG): http://172.31.94.2:9090/ --> 연결 안됨(사용 안함)
(D DAG): http://172.31.94.61:8080/    
(Jupyter): http://172.31.94.2:8080/ -->  사용 안함

2. 대상 보안 클라우드 IP: 172.28.185.187(진태만)
==============================================================================================================

15-2. Airflow 계정 생성 요청(이메일)
============================================================================================================== 

16. LOG DB 접속 신청  ==> 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청(화면)
==> 미등록 시스템 신청(버튼): 클릭 > 미등록 시스템 신청(DBSAFER 접속권한 신청)
1. 시스템명: ppow, dpow 			2. 시스템 유형: ALIBASE
3. 시스템 계정: usr_dags_svc

4. 미등록 시스템 접속 신청
1) 승인자 선택: 이서경(책임)
 2) 신청사유: Airflow Log 확인을 위해 DB 접속을 신청합니다.
  
5. DBMS 공용계정 접속 신청 정보
 1) 시스템명: ppow			 	2) 시스템유형: ALIBASE
 3) 계정명: usr_dags_svc		4) 서버 IP: 172.31.94.7(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	6).서버 포트: 10002■
 7) 신청 구분: DBMS
 
 1) 시스템명: dpow				2) 시스템유형: ALIBASE
 3) 계정명: usr_dags_svc		4) 서버 IP: 172.31.93.131(운영기)
 5) 사용자 IP: 172.28.185.187(보안 클라우드 IP)	6).서버 포트: 10008■ 
 7) 신청 구분: DBMS
 
■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(2)
==============================================================================================================

9-1. DB Safer설치  ==> 완료[♥♡]
[ 전사 공용 소프트웨어(보안망용) ] -> [ 03.업무용 SW ] -> [ 04.BDP ] -> [ PDA 어질리티 ]의 
AginityWorkbenchSetupx86.exe 실행 후 계속 다음 클릭하여 설치 완료
==============================================================================================================

11-3. PDA ODBC Driver 설치 ==> 완료[♥♡]
 [ 전사 공용 소프트웨어(보안망용) ] -> [ 03.업무용 SW ] -> [ 04.BDP ] -> [ PDA 어질리티 ]의 
 nzodbcsetup.exe 실행 후 계속 다음 클릭하여 설치완료 
 --> 속성(R) ==> 호환성(Tab) > 호환모드 --> Window 7: 변경 --> 확인
1. Data Soruce: PDA_DEV, 	Server: 172.18.192.55, port:.5480
 1) User Name: METASEL, 	PW: metasel2021
==============================================================================================================

11-4. PDA Client Tool(Aginity) 설치 설치 ==> 완료[♥♡]
[ 전사 공용 소프트웨어(보안망용) ] -> [ 03.업무용 SW ] -> [ 04.BDP ] -> [ PDA 어질리티 ]의 
AginityWorkbenchSetupx86.exe 실행 후 계속 다음 클릭하여 설치 완료 
1. Conmnec to PureData System for Analytics(새창)
 1) Saved: PDA_DEV
 2) Server: 172.18.192.65(개발계),  172.18.192.55(운영계),			Ssl Mode: Allow
 3) User ID: METASEL, PW: metasel2021
 4) Database:   ---> 2개 중에 선택
 5) Port: 5480
==============================================================================================================

- GCP 비밀번호 초기화(Data Lake에서)
1. GCP 계정 상태 --> 비밀번호 초기화 
==> 01. GCP --> https://console.cloud.google.com, tamario@lgupluspartners.co.kr
==============================================================================================================

13-1. GITLA 방화벽 신청 ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: GITLAB 접근을 위한 방화벽 해제 요청
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.20.45.201 		6. 서버 포트: 5480■
7. 사용 목적: GITLAB 접근을 위한 방화벽 해제 요청
1. 03. GitLab ==> http://gitlab.lguplus.co.kr, tamario/as**12**!!로 변경
 1) dlk_airflow_01 ==> project/nedp[/dlk_airflow_01
 
02. DLK(Data Lake)   ==> 완료[♥♡]
1. https://gitlab.dlk.lguplus.co.kr, tamario@lgupluspartners.co.kr/8a60d5c85c(마당 최초 비밀번호)
 --> #dlk1234 --> as**12**!!로 변경
 1) dlk_old2new ==> project/nedp[/dlk_old2new 
2. 새 비밀번호 설정에서
 1) 현재 비밀번호:#dlk1234
 2) 새 비밀번호: as**12**!!
 3) 비밀번호 확인:  as**12**!!
============================================================================================================== 
 
16-1. DBeaber 접속  ==> 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청(화면)
==> 미등록 시스템 신청(버튼): 클릭 > 미등록 시스템 신청(DBSAFER 접속권한 신청)
1. 시스템명: PEDC 					2. 시스템 유형: ALTIBASE(선택)
3. 시스템 계정: usr_dags_own
4. 미등록 시스템 접속 신청
 1) 승인자 선택: 홍진경(책임)
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
 3) 요청IP: 172.28.185.187(보안 클라우드 IP) 
5. DBMS 접속 신청 정보
 1) 시스템명: PEDC					2) 시스템 유형: ALTIBASE
 3) 계정명: usr_dags_own			4).서버 IP: 172.31.94.7
 5).사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 10001
   
■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(1) 
==> DB명: db_dags, 시스템 계정: usr_dags_own, PW: own@1234
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

==============================================================================================================
■1. OX ↑↓ ↔  ⇒ ⇔  ==> 완료[♥♡]  ==> 개발 중[☞☜]＃＆＠ § ※ ☆★ ○ ●◎ ◇ ◆ □ ■ △ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣ ╊ ■ 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
