

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2019.02) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2019.02.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 한승완 대리 노트북 배인철 차장님에게 전달(김유진 대리 수락), 석식(치즈돈가스 포장, 집에서 먹음)
								, 아시안컵 결승전(일본 1: 3 카타르[아랍에미리트 아부다비] --> 카타르 첫 우승)

- 본사 대기[★]
- M-CRM 솔루션 구축 분석
- 화면정의서 작업
1. 예약관리 작업
2. 화면정의서_예약관리_01. 예약현황 작업
3. 화면정의서_예약관리_02. 메모 작업  
---------------------------------------------------------------------------------------------------------------------------

- M-CRM 솔루션 구축 회의(12:40 ~ 16:00) 
1. 각자 업무 분야 설명
 1) 김정률 부장: 분석, 설계 설명
 2) 배인철 차장(서버 부분 설명)
 3) 강전관 과장(MIRECO 차세대 통합경영시스템 구축 프로젝트 산출물 가지고 옴)
  ==> 한국 광해관리공단 ==> https://www.mireco.or.kr
 4) 박 대리(캘린터 컴포넌트 설명)
 5) 진태만 차장(Websqure 설명, 예약관리 설계 부분 설명)
  ==> 예약관리에서 놓치고 있는 부분이 많음(캘린터 컴포넌트의 액션 기능, 메모)
  ==> 3월달까지 끝낼지 의문: 배인철 차장이 걱정을 많이 함
2. 추후 작성해야 할 문서
 1) D170 개발표준정의서(개발환경).doc, D170 개발표준정의서(프런트 엔드).doc
==============================================================================================================  

- 지아이데이타 파일 서버
1. \\GIDATA-SERVER03
==============================================================================================================  

■■■■■■■■■■■■■■■■■■ 2019.02.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 주말
07:30 기상
08:10 조식
09:00 집출발
09:10 도림천 도보
09:40 귀가
10:00 목재 3D 굴삭기 조립
12:00 중식  
12:30 도림천 도보
13:30 종료
13:40 귀가
14:00 목재 3D 굴삭기 조립 ==> 수종 엄마랑 이모네집에 놀러감 
17:30 종료 
18:20 석식
19:20 도림천 도보
19:50 종료
20:00 목재 3D 굴삭기 조립
21:00 종료
21:20 TV 시청
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>  

- 주말2
07:30 기상
08:10 조식
08:34 인슐린 약 교체(220U) ==> 주사기로 인슐린 260U 주입해서 오토 세터에서 넣음
		--> 1. 에러 현상: 오토 세터에서 에러(E 20) 뜨면서 멈춤
		--> 2. 조치: 당내과 간호사에게 전화: 오토 세터 밧데리 뺏다 꽃아다 해보고 안되면 수일개발에 A/S 보내라고 함.
		--> 3. 원인: 연결 나사가 너무 길어서 오토 세터가 인식 못 하고 멈춤
   		--> 4. 조치2: 연결 나사의 길이를 손가락  한마디 크기로 줄여서 오토 세터에 다시 넣으니깐 정상으로 처리 함.
		==> 오토 세터가 문제가 있으면 주사기에 안에 있는 인슐린 양을 눈으로 확인(예 200ml 이면 2.0으로 표기됨)하고
				인슐린 펌프에서 공기 빼기하기 전에 주사가 눈금(디폴트 3.0)을 수동으로 조절(2.0으로 셋팅) 가능
09:00 운동(워킹 머신에서 빠르게 걷기: 6km) --> 비옴
09:20 종료
10:00 목재 3D 굴삭기 조립
12:00 중식  
12:30 도림천 도보 --> 비 조금 옴
13:30 종료
13:40 귀가
14:00 인터넷 서핑
15:00 목재 3D 굴삭기 조립 ==> 완료
17:30 종료
18:20 석식
19:20 운동(워킹 머신에서 빠르게 걷기: 6km) --> 비옴
19:50 종료
21:20 TV 시청
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>

- 설 연휴
05:00 기상
05:20 샤워 ==> 인슐린 펌프 바늘 왼쪽 배에서 뺏다가 다시 근처 왼쪽 배에 꽃음(1번 다시 꽃음)
05:30 조식
06:00 집출발
06:30 KEB 외환은행 ATM에서 30만원 인출
07:00 귀가 
07:10 집출발 ==> 루옌, 수종
07:15 대림역 ==> 서울역
07:45 서울역 도착(35분 소요)
08:10 서울 출발(08:10, KTX 산천)
10:45 포항역 도착
11:00 택시(포항역 -> 포항집)
11:20 포항집 도착 ==> 아버지 쇼파에 앉아 있음
11:30 중식
12:00 영일대 해수욕장 도보
12:30 종료
14:30 다이소 두호점 ==> 목재 3D 탱크/ 미사일 구입
15:30 다이소 두호점 ==> 아로빌 자동 분사기 구입(포황집 화장실에 설치)
16:30 집출발
16:50 승표집 도착
15:10 승표집 출발(승표차)
15:20 태정이 태움
15:40 꽃돼지 보쌈 족발 문덕점 도착 ==> 석식(보쌈, 족발)
18:30 포항계 계원 모임 ==> 주남이형, 정철, 봉춘, 태정, 승표
		--> 최진호형 이혼(우현동 형 반점에서 일하고 있다고 함)
		--> 주남이형이 많이 걸어서 다리 아프면 다리 근력 키우라고 (내가 살 빠졌다고 함)
		--> 봉춘이 차 바꾸는 것에 관심 만음(장기 렌트)
		--> 오성이형(태정이 둘째형) 당뇨 합병증으로 죽었다고 함
20:30 종료
20:40 문덕 출발(승표차)
21:00 승표집 도착
21:10 도보(승표집 -> 창포동 -> 작은굴 -> 창포지(마장지) -> 창포사거리)
22:00 귀가 ==> 작은 누나네 집에 와 있음(매형, 은아, 령경)
22:20 TV 시청
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>

- 설날
09:00 기상
09:40 차례 지내기(수종이와 루옌이 도와줘서 편했음)
10:10 종료
10:24 조식
10:50 도보(창포동 -> 작은굴 -> 창포지(마장지) -> 창포사거리)
11:40 귀가
14:20 큰누나네 방문 ==> 엄마에게 돈 빌려서 은아 용돈 5만원 줌,  령경이에게 용돈 5만원 줌
		--> 큰누나네 큰집에서 베트남 다낭에 갔다 왔는데 너무 좋다고 함: 푸라마 리조트 다낭 
		--> 아버지 요양병원 2월 8일 입원(내가 월 20만원, 큰누나, 작은누나 월 10마원씩 분담할 예정)
		--> 작은누나가 내 살 빠져서 보기가 좋다고 함
14:40 중식
15:00 도보(영일대 해수욕장)
15:40 귀가 ==> 수종 큰누나랑 홈플러스에 감
15:50 작은 누나네 여수로 출발
17:30 석식(떡국)
17:40 수종 귀가 ==> 큰누나가 베블레이드 선물로 사줌
18:10 도보(영일대 해수욕장)
18:40 귀가
18:45 집출발(매형 차)
19:00 포항역 도착(15분 걸림)
19:20 포항 출발(KTX)
21:50 서울역 도착
22:50 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 설 연휴2
08:00 기상
08:10 조식
09:30 도림천 도보
10:00 귀가 
12:00 중식
12:30 도림천 도보
13:30 종료 ==> 오전, 오후 혈당 엄청 높음
14:14 왼쪽 배에 꽃았든 바늘을 근처 왼쪽 배에 꽃음(2번 다시 꽃음) ==> 이후 혈당이 조절됨(샤워 후 반창고가 약해서 져서 시간이 흐르면 
		약이 흡수가 잘 되는 것을 추정됨)
14:20 보라매공원(자전거): 수종  ==> 루옌 친구 만나러 조계사로 놀러감
16:20 남구로시장: 식당이 설 연휴라 모두 문 닫음
17:30 귀가
18:00 석식
19:40 도림천 도보 ==> 수종이와 같이 갔다가 수종이 화장실 때문에 귀가
19:50 귀가
20:00 운동(워킹 머신에서 빠르게 걷기: 6km) 
20:30 종료
21:20 루옌 귀가
22:10 취침
==============================================================================================================

- 특수 문자 수[Memo(2018.05).txt] ==> 갯수(줄 수) 설정
1. 개인 노트북(MSI GE60_2OE)
1) [Memo 줄] --> 57개(■), 46개(-)], 46개(■), 57개(■)
2) [년월일(요일) 줄] --> 16개(■), 16개(■) 
3) [ '=' 줄(긴줄)] --> 110개(=)
============================================================================================================== 
4) [ '-' 줄(긴줄)] --> 123개(-)
---------------------------------------------------------------------------------------------------------------------------
5) [End 줄] --> 57개(■), [53개(-), 53개(-)], 57개(■)
==============================================================================================================

- [G마켓] 대용량 강냉이, 3.백옥 강냉이 5.3kg(+9,900원), 가격: 18,780원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=887332158
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 김유진 대리 휴가(외삼촌 상)

- 본사 대기[★]
- M-CRM 솔루션 구축 분석
- fullcalendar-scheduler 분석
1. fullcalendar-scheduler-1.9.4 ==>  /vertical-resource-view.html
==============================================================================================================   

- Websqure 라이센스 갱신
1. 배인철 차장이 보유한 교육용 라이센스(3개월)로 변경
2. 라이센스 만료일
 1) Expiration: Tue Apr 30 00:00:00 KST 2019[2019.04.30]
==============================================================================================================   

- 06:04 인슐린 약 교체(186U)
1. 주사기로 인슐린 220U 주입해서 오토 세터에서 넣었는데 오토 세터에서 209U 인식한데 인슐린 펌프에서 인식을 못 하고 멈춤
 1) 나중에 오토 세터에서 E 14가 표기됨
==> 수일 개발에 전화해서 오토 세터 A/S 요청(다나 인슐린 펌프 AS[수일개발]: 02-3463-7577, 점심시간: 13~14시)
==> E 14 에러: 오토 세터 교체를 해준다고 함(E 12 에러: 밧데리 교체 후 확인) 
==============================================================================================================   

- WS5_SAMPLE Flow 분석(Websqure 에서[Websqure 분석])
6.1.1	Web.xml
1. welcome-file에 /websquare/websquare.do를 등록하십시오.  
<welcome-file-list>
    <welcome-file>/websquare/websquare.do</welcome-file>
</welcome-file-list> 
---------------------------------------------------------------------------------------------------------------------------

6.1.2	InitController.java
1. InitController.java에서 movePage의 viewName 및 value 설정
@RequestMapping("/websquare/*.do")
public String webSquareIndex(HttpServletRequest request, HttpServletResponse response, Model model) throws Exception {
	System.out.println("[//InitController.java] [webSquareIndex()] ==> [TEST_01]" );  
	
	String jspUrl = request.getServletPath().replaceAll("(.*websquare/)(.*)(.do)", "$2");
	HttpSession session = request.getSession();
	String movePage = request.getParameter("w2xPath");

	// case 1 : /, case 2 : /websquare/websquare.do
	if (jspUrl == null || jspUrl.equals("/") || jspUrl.equals("")) {
		jspUrl = "websquare";
	}
 
	// session이 없을 경우 login 화면으로 이동.
	if (!userInfo.isLogined()) {
		System.out.println("[//InitController.java] [webSquareIndex()] ==> [TEST_21][session이 없을 경우 login 화면으로 이동]
			[userInfo.isLogined()]"+ userInfo.isLogined() );  
		
		movePage = PageURIUtil.getLoginPage();

		// session이 있고 w2xPath가 없을 경우 index화면으로 이동.
	} else {
		if (movePage == null) {
			// DB 설정조회 초기 page 구성
			movePage = PageURIUtil.getIndexPageURI(userInfo.getMainLayoutCode());
			System.out.println("[//InitController.java] [webSquareIndex()] ==> [TEST_70] [DB 설정조회 초기 page 구성][movePage]"+ movePage );  
			
			// DB에 값이 저장되어 있지 않은 경우 기본 index화면으로 이동
			if (movePage == null) { 
				movePage = PageURIUtil.getIndexPageURI();
			}
		}
		System.out.println("[//InitController.java] [webSquareIndex()] ==> [TEST_72][session이 있고 w2xPath가 없을 경우 index 화면으로 이동]
		[userInfo.isLogined()]"+ userInfo.isLogined() +"[movePage]"+ movePage );  
	}

	model.addAttribute("movePage", movePage);
	return jspUrl + "Jsp";
}
---------------------------------------------------------------------------------------------------------------------------

6.1.3	PageURIUtil.java 
Login 및 index 페이지를 설정하십시오. websquare.do 로직에서 사용합니다. 
package com.inswave.util;
import org.springframework.beans.factory.annotation.Value;
import org.springframework.stereotype.Component;

@Component
public class PageURIUtil {
    private static String DEF_INDEX_PAGE;
    private static String TAB_INDEX;
    private static String WIN_INDEX;
    private static String LOGIN_PAGE;
    private static String AUTH_CHECK;
	
    @Value("${w5xml.defIndex}") 		// websquareConfig.properties 사용
    private void setDEF_INDEX_PAGE(String def_index) {
        DEF_INDEX_PAGE = def_index;
    }
    @Value("${w5xml.main.tab}") 		// websquareConfig.properties 사용	 ==> Tab 호출 URL @@@
    private void setTAB_INDEX(String tab_index) {
        TAB_INDEX = tab_index;
    }
    @Value("${w5xml.main.win}") 		// websquareConfig.properties 사용
    private void setWIN_INDEX(String win_index) {
        WIN_INDEX = win_index;
    }
    @Value("${w5xml.login}") 		// websquareConfig.properties 사용 ==> 로그인 호출 URL @@@
    private void setLOGIN_PAGE(String login_page){
        LOGIN_PAGE = login_page;
    }
    @Value("${w5xml.auth.check}")		// websquareConfig.properties 사용
    private void setAUTH_CHECK(String auth_check){
        AUTH_CHECK = auth_check;
    }
    public static String getIndexPageURI(String pageNm) {
        String rsURI =  DEF_INDEX_PAGE;
        if(pageNm != null){
            if(pageNm.equals("T")){
                rsURI = TAB_INDEX;
            }else if(pageNm.equals("W")){
                rsURI = WIN_INDEX;
            }
        }
        return rsURI;
    }
    public static String getIndexPageURI() {
        return getIndexPageURI("T");
    }
    public static String getLoginPage(){
        return LOGIN_PAGE;
    }
    public static String getAuthCheck(){
        return AUTH_CHECK;
    }
} 
---------------------------------------------------------------------------------------------------------------------------

6.1.4	websquareConfig.properties 
PageURIUtil.java를 사용하는 Properties를 정의하십시오. 
w5xml.login=/cm/main/login.xml
w5xml.defIndex=/cm/main/index_tabControl.xml
w5xml.main.tab=/cm/main/index_tabControl.xml
w5xml.main.win=/cm/main/index_windowContainer.xml
w5xml.auth.check=/cm/main/auth_check.xml
main.setting.default.layout=T
main.setting.default.favoriteLocation=D
main.setting.code.DB=D
main.setting.code.LS=L
---------------------------------------------------------------------------------------------------------------------------
 
6.1.5	spring-views.xml
websquare.do에서 리턴된 movePage의 viewName에 맞는 bean id를 호출하십시오.
<?xml version="1.0" encoding="UTF-8"?>
<beans xmlns="http://www.springframework.org/schema/beans"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xsi:schemaLocation="http://www.springframework.org/schema/beans 
    http://www.springframework.org/schema/beans/spring-beans-2.5.xsd">
    <bean id="websquareJsp"
       class="org.springframework.web.servlet.view.JstlView">
        <property name="url" value="/WEB-INF/jsp/websquare/websquare.jsp" />
    </bean>
    <bean id="I18NJsp"
       class="org.springframework.web.servlet.view.JstlView">
        <property name="url" value="/WEB-INF/jsp/websquare/I18N.jsp" />
    </bean>
    <bean id="defW5" 
	   class="org.springframework.web.servlet.view.RedirectView">
           <property name="url" value="/websquare/websquare.do" />
    </bean>
 </beans>
---------------------------------------------------------------------------------------------------------------------------

6.1.6	websquare.jsp
websquare.do에서 리턴된 movePage 값으로 해당 페이지를 호출합니다.
<script type="text/javascript">
    var WebSquareExternal = 
{"baseURI": "/websquare/", 
"w2xPath": "<%=(String)request.getAttribute("movePage")%>" };
    if(parent.WebSquare){
        if((WebSquareExternal.w2xPath).toLowerCase().indexOf("login")<0){
            WebSquareExternal.w2xPath = "";
        }
    }
</script>
<script type="text/javascript" src="/websquare/javascript.wq?q=/bootloader"></script>
<script type="text/javascript">
    window.onload = init;
    function init() {
        try{
            WebSquare.startApplication(WebSquareExternal.w2xPath);
        } catch(e) {
            alert(e.message);
        }
    }
</script>
---------------------------------------------------------------------------------------------------------------------------

6.1.7	실행 화면
아래와 같이 URL을 숨길 수 있습니다. 
적용 전: http://localhost:8080/websquare/websquare.do?w2xPath=/cm/main/index_tabControl.xml
적용 후: http://localhost:8080  
============================================================================================================== 

- [도서] 실전 DB 모델링과 SQL for ORACLE
1. 혜지원, 이호상 지음, 가격: 23,000원, 중고가: 15,000원 ==> 관악 도서관에서 대여 가능
http://www.yes24.com/24/UsedShop/Goods/69322099?scode=048_002
---------------------------------------------------------------------------------------------------------------------------

- [도서] (개발자와 DBA를 위한) real MySQL 
1. 위키북스 이성욱 지음, 중고가: 28,000원(38% 할인) ==> 관악 도서관에서 대여 가능
http://www.yes24.com/24/goods/69397219
==============================================================================================================   

■■■■■■■■■■■■■■■■■■ 2019.02.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 아버지 요양병원 입원(14시, 병원)

- 본사 대기[★]
- M-CRM 솔루션 구축 분석
- 문서 작업
1. D170 개발표준정의서(개발환경).doc
2. D170 개발표준정의서(프런트 엔드).doc
==============================================================================================================   
 
- jQuery 동영상 시청 ==> https://www.youtube.com/watch?v=EQ48ZpnN3ug
1. jQuery - 소개 ==> https://opentutorials.org/course/53/45
 1) jQuery 문법
 $(제어대상).method1().method2();
 $('.welcome').html('hello world! coding everybody!').css('background-color','yellow');
 
<html>
     <body>
         <div class="welcome"></div>
         <div class="welcome"></div>
         <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.6.2/jquery.min.js"></script>
         <script type="text/javascript">
                 $('.welcome').html('hello world! coding everybody!').css('background-color','yellow');
         </script>
     </body>
 </html>
---------------------------------------------------------------------------------------------------------------------------

- jQuery ==> https://jquery.org
- jQuery EasyUI ==> https://www.jeasyui.com/demo/main/index.php
- w3schools.com  ==> https://www.w3schools.com/jquery/default.asp
============================================================================================================== 
 
- 창원 HSD 엔진 Prj 투입 예정
1. HSD 엔진 Prj(HDS 엔진): Websquare로 자재 관리 개발(추가 개발), 기간: 4.5개월
2. 이석부 사장, 오태범 이사가 강력 추천, 구종식 부장은 더케이 추천 ==> 파견비 많이 달라고 함(허민준 대리와 같이 개발함)
3. 김남열 과장에게 전화해서 HDS 엔진에 대해 물어 볼 것(경험자): 근무 여건(출퇴근), 숙소 위치
==> 오태범 이사가 M-CRM에서 손 떼라고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 주말
07:30 기상
08:10 조식
09:00 집출발
09:10 도림천 도보
09:40 귀가
10:00 목재 3D 탱크 조립
12:00 중식  
12:30 도림천로 도보
13:30 종료
13:40 귀가
14:00 집출발(자전거, 수종)
14:10 영림초교 정류장(150번 버스)
15:00 서울역 -> 남대문시장 방면 -> 종로5가역(하차): 태극기 시위 때문에 버스 우회
15:10 쌍봉 종합의료기 도착 ==> 연두색 케어센스N 혈당지 5통(1통 100개, 500매, 10만원) 구입
		==> 케어센스N 혈당측정기 무료로 받음
15:50 서울대의대 가정의학과 구경(날씨 추움)
16:00 혜화역 -> 혜화도 로터리 -> 명륜3가.성대입구 정류장 -> 150번 버스
16:20 세종문화원 정류장(150번 버스, 집회 끝나서 버스 다님)
17:20 영림초교 정류장
18:00 김밥천국 남구로점
18:10 석식(비빕밥, 치즈돈가스, 김밥천국): 수종
18:30 귀가 
19:00 도림천로 도보
19:30 종료
20:00 목재 3D 탱크 조립
21:00 종료
21:20 TV 시청
23:10 취침
==============================================================================================================

- 부모님 용돈 계좌 변경
1. 신한은행 자동이체 해지
2. MG새마을금고 등록
 1) 카카오 송금으로 MG새마을금고, 9002-1865-4701-0(9002186547010), 예금주: 진기숙, 20만원 송금 ==> 월말에 보낼 것
==============================================================================================================

- 케어센스N 혈당지 구입
1. 케어센스N 100개입, 당뇨나라(dang****) ==> https://cafe.naver.com/joonggonara/557651589
 1) 주황색 케어센스N 혈당지와, 천개 10만원, 010 9556 8601로 문자, 쌍봉 종합의료기(02-763-8601, 종로5가: 종로구 종로5가 98-5 1층)  
---------------------------------------------------------------------------------------------------------------------------

- 케어센스N 혈당지 구입 검토
1. 케어센스 N 시험지 팝니다, 	zcashboxz(zcas****): 판매 완료 됨 ==> https://cafe.naver.com/joonggonara/550223618 
 1) 직거래 경기도 오산에서 저녁 10시 이후, 20개 20만원, 010-2029-3521로 문자  
2. 혈당측정검사지 팝니다, 둥근소리 ==> https://cafe.naver.com/joonggonara/555536502
==============================================================================================================   
 
- 아이센스 케어센스N 혈당측정기
1. 기본 구성, 가격: 5,690원 (배송비 2,000원), 총가격: 7,690원
==> Nhttp://prod.danawa.com/info/?pcode=874275 
==============================================================================================================   

- 쌍봉 종합의료기(종로5가역) 혈당지 구입 방법
1. 처방전 사진 카톡으로 전송 ==> 2. 쌍봉 종합의료기에서 혈당지, 서류(계산서) 택배로 보냄 ==> 3. 건강보험 공단에  서류 제출
---------------------------------------------------------------------------------------------------------------------------

- 인슐린 투여 환자 당뇨병 소모성재료 건강보험 환급 규정
1. 1일 2,500원, 월: 22만 5천원(202,500원 입금됨(90% 환급됨)
일 금액		일개수		월개수		개월		총가격
 2,500 			1			30			3		 225,000 		1일 2,500원, 월: 22만 5천원(202,500원 입금됨(90% 환급됨) 
 240 				7			30			3		 151,200 		케어센스N 혈당지 ==> 쌍봉 종합의료기 제안 금액  
 200 				7			30			3		 126,000 		케어센스N 혈당지 
 300 				7			30			3		 189,000 		다나 혈당지 금액  
==============================================================================================================  

■■■■■■■■■■■■■■■■■■ 2019.02.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 68.7kg 

- 주말2
08:00 기상
08:10 조식
09:30 집출발
09:30 도림천로 도보
10:00 귀가 
10:10 목재 3D 탱크 조립
12:00 중식 ==> 수종 엄마따라 놀러감
12:30 도림천로 도보
13:30 종료
14:00 목재 3D 탱크 조립
15:20 목재 3D 탱크 조립: 완료
15:30 인슐린 펌프 제거
15:40 집출발(자전거)
15:50 대림운동장
16:00 축구 게임(은혜교회팀: 어울림팀) ==> 3쿼터 뜀(1시간 반): 컨디션 약간 괜찮음, 날씨 추움
		==> 다리 스트레칭을 해줘서 그런지 안 아픔
18:00 종료
18:10 플러스 마트 방문 ==> 우유 2통 구입 
18:20 귀가
18:30 샤워
18:51 인슐린 약 교체(162U) ==> 오토 세터 정상 작동함
18:55 인슐린 펌프 착용
19:00 석식
19:30 운동(워킹 머신에서 빠르게 걷기: 6km)
19:50 종료
21:20 TV 시청
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 16:30 ==>  

- 본사 대기[★]
- Websquare 소스 분석
==============================================================================================================   

- 교자상 구매
1. 상나라 몰딩 테상: 상나라 ==> 중 원목 스틸형)02_B 75*47*26 CM, 실 결제금액: 13,125원(네이버페이 포인트: 2,775원 차감)
 1) 교자상(고장난 상) ==> 70*50*26 CM
https://smartstore.naver.com/sangnara/products/233840057 
==============================================================================================================   

- 롯데카드 일반결제 비밀번호 변경
1. 카드명: 뉴 CJ헬로 롯데카드
2. 일반결제 비밀번호: h*수*16*1
============================================================================================================== 

- 크린토피아 대림물가에점(세탁, 드라이)
1. T) 02-831-153, 서울시 영등포구 도림로 192 동성빌딩 ==> www.cleantopia.com
2. 영업시간: 평일: 09:30 ~ 20시, 주말: 10:00 ~ 18시
3. 겨울 코트: 6천 8백 ~ 8천 5백 
==============================================================================================================   

- 대동초 유치원 활동사진 다운로드
1. 네이버 클라우드: cloud.naver.com
2. 아름반 학급 아이디: ddpreschool6 / dd8350796
==============================================================================================================   

- 신한은행 자동이체 등록(22시, 집) 
1. 루옌 생활비,핸드폰비 자동이체(이체 시작일: 2019.02.28)
 1) 백 6만 원 자동이체[국민은행, 037401-04-130647, 예금주: 강아현] 자동이체 [★]
2. Sh 쑥쑥크는 아이적금 자동이체(이체 시작일: 2019.02.28)
 1) 10만원 자동이체[수협, 410-0874-5755, 예금주: 진수종] 자동이체 [★]
 2) [적금 계좌번호: 1410-0874-5755, 예금주: 진수종] 통장으로 22일에 자동이체됨.   
3. Sh보고싶다! 명태야 적금2 자동이체(이체 시작일: 2019.02.28)
 1)  10만원 자동이체[수협, 40010-3072-0898, 예금주: 진태만] 자동이체 [★]
 2) [적금2 계좌번호: 0010-3072-0898, 예금주: 진수종] 통장으로 22일에 자동이체됨. 
4. 카카오뱅크 자유 적금 자동이체(이체 시작일: 2019.02.28)
 1) 10만원 자동이체[카카오뱅크 ,3333-02-3808954, 예금주: 진태만] 자동이체 [★]
 2) [자유 적금 통장 계좌번호: 33355-05-5779104 예금주: 진태만] 통장으로 1일에 자동이체됨.   
5. 부모님 용돈(20만 원) 자동이체(이체 시작일: 2019.03.28)
 1) 20만원[MG새마을금고, 9002-1865-4701-0(9002186547010, 예금주: 진기숙] 자동이체 [★]
==============================================================================================================

- 세탁물 맡기기
16:30 퇴근
16:30 지하철(선릉역 -> 구로디지털역)
17:15 귀가 
17:20 자전거 
17:30 크린토피아 대림물가에점 도착
		==> 세탁물 맡기기: 롱코트(루옌, 밤색): 8,500원, 다운점퍼(수종, 파랑): 6,700원 --> 토요일날 찾으러 갈 것
17:40 대동초교 유치원(수종 데리고 옴)
17:50 구로리 놀이터
18:20 김밥천국 남구로점 ==> 3. 석식(비빕밥, 치즈돈가스, 치즈 라뽁이): 포장
18:30 귀가 
18:50 석식(루옌, 수종하고 같이 먹음)
19:30 도림천로 도보
20:00 종료
21:00 인터넷 서핑
23:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 진수종 대동초 유치원 아름반 수료식(10시)

- 본사 대기[★]
- Websquare 소스 분석
==============================================================================================================   

- 양재 최의원 진료(12시 반, 매봉역 1번 출구)
0. 혈당 수첩 가지고 감
1. 박황현 원장 진료
 1) 아침 식후 혈당이 너무 높음(20U 주입) ==> 그럴 수도 있다고 함. 상관 없다고 함
 2) 인슐린 주입 후 2일 이상 지나면 적용 못 할 때가 있음 ==> 바늘을 잘못 꽃아서 그럴 수 있다고 함
    (간호사에게 교육 받으라고 함)
2. 간호사 교육
 1) 배에서 바늘을 뺏다가 다시 꽃음 ==> 뭉친 곳에 다시 꽃지 말라고 함(바늘을 뺀 곳에 연고 발라주라고 함)
  가. 배에 바늘을 꽃을 때 배를 최대한 세게 당겨서 꽃을 것
  나. 반창고를 2번 째 붙일 때는 수퍼 라인 줄을 반대로 방향으로 붙일 것
  다. 샤워 전에 바늘을 뺀 후 다시 꽃을 때는 종이 반창고를 사용하여 단단히 붙일 것
 2) 바늘 다른 곳으로 옮길 때 종이 반창고 붙여주라고 함
 ==> 원장이 좀 불친절하지만 간호사는 경륜도 있고 친절하게 잘 가르쳐 줌(전체적으로 만족함)
--------------------------------------------------------------------------------------------------------------------------------

- 조제
1. 인슐린 6병[노브레피트]) ==> 39,100원[매봉약국: 실비보험 청구요]
2. 이너솔 연고(배 바늘 상처 치료, 일동제약) ==> 4,000원[매봉약국]
3. [3M] 마이크로포어 종이 반창고, 1533-1 / 2.5cm x 9.1m ==> 1,500원[매봉약국]
==============================================================================================================

- 의료기상(다나 메디칼)에서 구입한 목록 ■■■
1. 다나알(dana R)용 건전지	8 	 4,000 	 32,000원
2. 메픽스 반창고	 				1 	 6,500 	 6,500원
 ==> 금액				 38,500원
3. 영업 시간
 1) 평일: 오전 9시 ~ 오후 6시,  토: 오전 9시 ~ 오후 3시, 월~토 점심시간: 13시 ~ 14시
==============================================================================================================   

- 다나 A/S 센터 업무시간 
1. 평일: 오전 9시 ~ 오후 6시,  토: 오전 9시 ~ 오후 1시, 점심시간: 13시 ~ 14시
2. 오토 세터 추가 구입: 5만원
==============================================================================================================   

- 당뇨 소모성 재료 의료보험 청구안내
1. 공단 구비 서류
 1) 등록 신청서(최초 1회만), 소모성 처방전
 2) 영수증, 거래명세서
 3) 본인 통장 사본(최초 1회만)
 4) 본인 신층증(최초 1회만)
 ==> 건강보험 청구는 3개월에 한 번 신청합니다. 총액 225,000원 한도내 90% 지원 
2. 건강보험 적용(확대) 품목
 1) 인슐린 펌프용 주입세트, 인슐린 펌프용 주사기, 혈당 시험지, 채혈침, 펜니들, 인슐린 주사기(건전지 악세사리 등 제외)
3. 제출처: 지역 건강 보험 관리 공단
 1) 국민건강보험공단 관악지사(T)1577-1000, 서울시 관악구 보라매로3길 23 대교타워 13층) 
 2) 국민건강보험공단 강남동부지사(T)1577-1000, 서울시 강남구 테헤란로 328 6층) 
4. 전화 1577-1000
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2019.02.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 김유나 대리(영업) 첫 출근

- 본사 대기[★]
- Websquare 소스 분석
==============================================================================================================   

- WS5 소스 URL 연결
1. 01.xml 파일 클릭 후 단축키 F7 누름 ==> http://localhost:8080/ws5/?w2xPath=/ws5/sample/compList/01.xml
==> C:\WS5\eduWorkspace\ws5\WebContent\sample\compList\01.xml
 ==============================================================================================================   

-  HDS 엔진 Prj 원룸(창원 중앙동, 상남동) 조사
1, 조건: 코쿤하우스가 월세 200/30
 1) 관리비 월 3만 5천원(공과금 별도) 
 2) 코쿤 하우스 ==> https://dabangapp.com/room/5757daf4dd650d26388b45a7 
 3) 창원 천일 부동산 주소: 경남 창원시 성산구 용지로 70 성원오피스텔 1층 134호
==============================================================================================================   

■■■■■■■■■■■■■■■■■■ 2019.02.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>  

- 본사 대기[★]
- Websquare 소스 분석
==============================================================================================================

- 여행용 캐리어 구입
[iPRAVES: 아이프라브] 여행용 하드캐리어 여행캐리어 여행가방 MK-710228, 가격: 61,670원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=2060923612
==============================================================================================================

- 포토몬 사진 인화 주문
1, 진수종 대동초 유치원 활동사진 34장, 3*4, 장당 69원 ==> 4,846원(포항집에도 보냄)
http://www.photomon.com, tamario2 / h*수*16*1
==============================================================================================================

- 혈당 이상 @@@
2019.02.13(수) 05:48 인슐린 약 교체(205U)시 공기 빼기할 때 30초도 안되서 인슐린 2~3방울 나오고 그 이후 5분 지나도 안 나옴
--> 그 이후 식후 혈당이 300이 넘음
2019.02.13(수) 23시경에 인슐린 펌프에서 주입을 누르고 인슐린 나오는지 확인(약하지만 정상적으로 나옴), 바늘 위치를 왼쪽 배로 바꿈,
2019.02.14(목) 6시경 식사 후 배를 확인해 보니 바늘이 빠져 있음. 바늘 위치를 오른쪽 배로 바꿈, 인슐린 10U 추가 주입
--> 아침 식후 혈당이 370 나옴
2019.02.14(목) 12시에 다나 A/S 센터 방문하여 공기 빼기 다시하고 착용 후 인슐린 10U 추가 주입
--> 점심 식후 혈당이 149 나옴(완전 정상으로 돌아 옴)
--------------------------------------------------------------------------------------------------------------------------------

- 다나 A/S 센터 방문(12시)
1. 혈당 이상이 주사기 공기 빼기를 잘못해서 공기가 남아 있어서 그렇다고 함 ==> 인슐린 펌프 바늘 배에서 빼고 주사기 안 공기를 빼내줌
2. 양재 최의원 간호 부장 교육 => 인슐린 펌프 착용시켜 주고 배에 반창고 발라줌 -> 배를 최대한 세계 당겨서 풍선 모양으로 크게 만들어 
바늘 찌를 것, 주사기에 공기 빼기 확실히 할 것, 배에 반창고를 정확하게 고정시킬 것, 뭉친 배는 마사지해 줄 것
3. 오토 세터 추가 구입: 5만원
4. 종이 반창고  2개 구입: 4천원
==============================================================================================================   

- 직장인 건강검진 신청서 작성
1. 1년에 한번씩 의무적으로 건강검진 받아야 한다고 함.(경리가 비사무직으로 신청)
==============================================================================================================   

- 직장인 건강검진
1. 리더스 헬스케어(역삼동 상록회관 1층, T) 02-284-3000
 1) 진료시간 ==> 예약/상담: 07:30 ~ 17:00, 검진/외래: 07:30 ~ 16:30
 2) www.leadershealthcare.co.kr
==============================================================================================================   

- 채용 건강검진(일반건강검진) 
A. 구로 보건소
1. 구로구보건소 3층 건강검진센터(☎ 860-2442, 3266)
2. 담당부서 : 의약과 검진팀   |   담당자 : 조경선 [Tel. : 02-860-3266]
http://www.guro.go.kr/health/clinic_information/medical_checkup_guide/health_record.jsp
--------------------------------------------------------------------------------------------------------------------------------   
 
- 채용 건강검진(일반건강검진)
1. 비용: 2018년 8월 6일 기준으로는 35세 이상은 22,700원
 1) 첫 번째: 키와 몸무게, 시력검사, 색약검사, 혈압 등을 체크
 2) 두 번째: 흉부 엑스레이 촬영
 3) 세 번째: 소변검사와 피검사를 실시(피검사를 통해서는 간 기능, 빈혈, 콜레스테롤 등을 검사)
==> 소요시간은 한 5분 걸림
==> 결과는 검사일 포함하여 평일기준 4일 소요(온라인 공인인증서로 발급 가능)
==> 주의사항: 검진전일 오후 10시 이후 금식하시기 바랍니다. 신분증 지참 필수 
==> 이용시간: 매주 월요일부터 금요일 오전 중에 검진 가능
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 16:00 ==> 출퇴근 길 눈 조금 옴, 석식(19시: 비빕밥, 치즈돈가스, [김밥천국]): 수종

- 본사 대기[★]
- Websquare 소스 분석
==============================================================================================================

- HSD 엔진 Prj 준비 서류
1. 주민등록 등본
2. 반명함사진(스캔본 가능) 
3. 보안서약서 작성(서류 일반비_DGS-KFO-02-보안서약서(제3자용).pdf)
==============================================================================================================

- 윈도우 10 PC 부팅 시 자주 쓰는 프로그램 자동 실행하는 법
1,  시작 버튼을 오른쪽 클릭해서 ‘실행(R)': 클릭 > 실행(새창) > 열기(O): shell:startup: 입력
==> C:\Users\tamar\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup 폴더에 프로그램 바로 가기를 복사하여
붙여넣기
 1) 확인: 작업 관리자[Ctrl + Shift + Esc) > 시작프로그램 탭에서 부팅 시 프로그램 실행 여부를 결정
==============================================================================================================   

- 다문화가정 자녀 방문학습지 신청(17시, 대림2동 주민센터)
1. 대림2동 주민센터 갔는데 귀화한 외국인은 기본증명서 제출하라고 해서 열받아서 화냄(기본 증명서 무료로 해주고 신청 받아 줌)
---------------------------------------------------------------------------------------------------------------------------

- 다문화가정 자녀 방문학습지 신청(
0. 다문화/외국인 가정 자녀의 눈높이 회비를 선착순 지원합니다.
1. 준비물: 주민증, 가족관계증명서 ==> 귀화한 외국인은 기본증명서를 추가로 제출해야 함
2. 선발 방법: 700명 정도 추첨으로 선발
3. 신청기간: 2019년 2월 11일 ~ 15일(금)
4. 대상: 다문화가정 자녀(만 2세 ~ 13세)
5. 학습기간: 2019년 3월 ~ 12월(10개월)
6. 교육
 1) 한국어 교육
 2) 기초학력 교육 ==> 과목: 국어, 영어, 수학, 과학 중
7. 혜택
 1) 매월 3만원 무상 지원
==> 눈높이 대동센터 --> 02-842-9509
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 주말
07:30 기상 ==> 금식 --> 집에서 혈당 측정: 124 --> 117 나옴
08:10 도림천 도보
08:40 귀가
08:50 집출발(자전거)
09:00 연세준내과 방문
09:10 직장인 건강검진 설문서 작성(힘한 운동 주 1회, 2시간, 땀나는 운동 주 7회, 2시간)
09:20 직장인 건강검진 ==> 신체 계측, 혈압 측정, 안과 검진, 청각 검진, 피 뽑기, 소변, X-ray
		==> 처음 혈압 측정(139 나옴: 자전거 타고 가서 많이 나온 것으로 추정) --> 이후 측정 117 나옴
09:40 종료
09:50 영인약국 방문 ==> 네오시덤 연고(퓨시드산 나트륨, 배 바늘 상처 치료, 태극제약), 3,000원    
10:00 세탁물 찾기(크린토피아 대림물가에점)
10:20 귀가
11:00 주사기 공기 빼기 연습 ==> 빈 인슐린 병에 물 넣어서 사용한 주사기로 테스트(공기가 차는 원인을 파악 --> 이제 공기 빼기를
		정확하게 할 수 있음: 만족)
11:40 루옌 치과 방문 후 언니집 놀러감 	
12:00 석식 전 인슐린 주입 이상 발생 ==> 다나 A/S 센터 직원이 인슐린 양을 눈 짐작으로 보고 공기 빼기를 해서 인슐린 양이 34U 정도
		남았다고 판단 했는데 실제는 전혀 안 남아 있었음
12:18 인슐린 약 교체(210U) ==> 오른쪽 배에 뭉친 부분 근처에 바늘을 찔러서 인슐린 흡수가 안됨(약 주입시 야간 따끔함)
12:30 중식
12:50 도림천로 도보
13:30 귀가
14:00 낮잠
16:30 기상
16:50 집출발(자전거, 수종)
17:10 다이소 대림2호점(모던 그레이 메모리 폼 발매트, 미니 수납박스(B형, 2개): 당뇨 박스, 세탁용 세제) 등 구입
17:50 구로리 공원(수종)
18:30 김밥천국 남구로점
18:40 석식(비빕밥, 치즈돈가스, 김밥천국): 수종
18:50 귀가 
19:30 도림천로 도보
20:00 귀가
21:40 루옌 귀가 ==> 로또 10개 중 한 개가 5천원 당첨됨
23:10 취침
==============================================================================================================

- 직장인 건강검진(09시, 병원)
1. 연세준내과(서울시 영등포구 도림로 48길 4 대림스타빌딩) ==> https://yonseijoon.modoo.at/
2. 직장인 건강검진
 1) 1차 검진(8시간 금식) 
  가. 신체 계측, 소변, X-ray
  나. 위암 검진(안 나옴): 수면내시경 필요
 2) 구강 검진(치과: 모아치과): 안함
 3) 검사 결과 ==> 다음주 화요일 나옴(이메일 발송 가능) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 69.2kg

- 주말2
08:00 기상
08:10 조식
09:30 집출발
09:30 도림천로 도보
10:00 귀가 
10:10 스쿼트 시작 ==> 림포 스쿼트를 설정이 불편해서 삭제함
12:00 중식
12:30 도림천로 도보
13:30 종료 ==> 귀가할 때 엘리베이트 고장
14:00 귀가
14:10 인터넷 서핑
15:00 인슐린 펌프 제거 ==> 오른쪽 배에 뭉친 부분 근처에 바늘 제거시 아프고 피가 남
15:10 집출발(자전거)
15:20 G 마트 ==> 당첨된 5천원 로또로 다시 5장 구입
15:25 다이소 대림2호점 ==> 욕실화 교환(EVA 원형 메쉬 욕실화), 가위 구입
15:40 길 가다가 창호(애인 생김), 태우 만남 ==> 신년회 한다고 다솜에서 회식, 내가 당뇨로 투병한다고 이야기함
15:50 대림운동장
16:00 축구 게임(은혜교회팀: 어울림팀) ==> 3쿼터 뜀(1시간 반): 컨디션 좋음, 날씨 따듯
		==> 다리 스트레칭을 해줘서 그런지 안 아픔
18:00 종료
18:10 플러스 마트 방문 ==> 밀크 플러스 900ml(우유, 4통, 2통 3,300원으로 인상): 수종
18:20 귀가
18:30 샤워
18:51 인슐린 펌프 착용 ==> 축구 후 왼쪽 배에 바늘 다시 꽃음(정상화됨)
19:00 석식 ==> 로또 루옌에게 줌
19:30 운동(워킹 머신에서 빠르게 걷기: 6km)
19:50 종료
21:20 TV 시청
23:10 취침
==============================================================================================================

- 오토 세터 없이 인슐린 약 교체 방법 ●●●
1. 준비물: 인슐린(냉장고에서 꺼내 2~30분 정도 실온에 보관), 주사기, 슈퍼라인, 인슐린 펌프, 반창고, 가위, 알콜 솜
2. 방법
  1) 주사기에 원하는 양(예: 220U)만큼 인슐린을 넣은 후 손가락으로 주사기를 쳐서 공기가 가운데로 모이게 한다.
  2) 주사기를 위로 올려서 공기를 빼준다.
  3) 주사기 바늘을 빼고 흰 캡을 씌운다. 이때 주사기에 공기가 남아 있으면 주사기를 위로 올려서 공기를 빼준다.
  4) 주사기 눈금을 다시 확인(예: 210U)을 확인 후 인슐린 펌프에서 주사기 눈금 3.0을 190U로 내려서 조정한다. 
  ==> 인슐린 펌프에서 공기 빼기할 때 소모되는 인슐린 양(약 20U)를 빼야 함.
  5) 인슐린 펌프에 '공기'를 누른다.
  6) 인슐린 펌프에서 인슐린이 2방울 정도 나올 때 까지(약 3분) 정도 기다린다.
  7) 인슐린 펌프에서 확인을 누른다.
  8) 인슐린 펌르를 배에 착용한다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 200030 ==>  

- 본사 대기[★]
- Websquare 소스 분석
============================================================================================================== 
  
- 크롬 개발자 도구를 이용한 자바스크립트 디버깅 ●●●
1. break point 처리: 소스(Sources)에서 마우스로 소스 왼쪽에 포인트 찍기
function greeting()
{
	var h = hello();
	var w = world();		// break point 처리 @@@
	
	document.getElementById('message').setAttribute('value', h + w);    // helloworld
}
 1) bugger[맨 오른쪽 창]에서 Breakpoints에서 break point 처리한 라인 체크하고 보여줌
  가. exampl1.html.html:16
		var w = world();
2. Hello world 버튼 클릭 
3. world() 함수에서 실행이 멈춤
var w = world();		// break point 처리 @@@
4. Step over(F10)를 사용하여 한 라인씩 차례로 디버깅함
5. Step out(Shift + F11)를 사용하여 첫 번째 코드로 진입해 들어가 다시 하나씩 라인별 코드를 실행
6. Pause (F8)를 사용하여 프로그램 종료
----------------------------------------------------------------------------------------------------------------------

- 테스트 파일(/exampl1.html)
<html>
<script type="text/javascript">

var gHello= '';		// Watch: 감시 설정 @@@

function hello()
{
	return 'hello';	
}

function world()
{
	return 'world';	
}

function greeting()
{
	var h = hello();
	gHello = h;
	
	var w = world();
	gHello = w;
	
	document.getElementById('message').setAttribute('value', h +' '+ w);    // message value값 속성 변경 --> helloworld 
	
	gHello = h +' '+ w;
}
</script>

<body>
	<input type="text" value="" id="message" />
	<input type="button" value="Hello world" onclick="greeting()" />
</body>
</html> 
==============================================================================================================

- bugger[맨 오른쪽 창] 설명
1. Watch: 감시
 1) + 클릭(Add Expression)  ==> gHello
2. XHR/fetch ==> Ajax 통신을 사용할 때 사용
 1) Any XHR or fetch 체크:  Ajax 통신을 사용하면 모두 디버깅 걸림
3. DOM Breakpoints
 1) 트리 변경, 속성이 변경, 노드 삭제를 감시하고 싶을 때 사용 
 2) Elements > 소스: 마우스 우 클릭 > Break on
Break on > subtree modifications[하위 트리시 디버깅]
Break on > attribute modifications[속성시 디버깅]  --> 주로 사용 @@@
Break on > node remove[노드 삭제시 디버깅]
 3) Sources > DOM Breakpoints에 처리된 Breakpoints가 보여짐 
4. Event List Breakpoints
 1) 이벤트가 발생할 때 디버깅 되도록 설정
==============================================================================================================

1. 크롬 브라우저 > F12 > 소스에 debugger; 입력 후 로컬 서버(톰캣) 실행[F12 대신 Ctrl키 + Shift 키 + i 누름]  
 1) 디버깅시: 왼손 가운데 손가락(중지)을 F9에 넣고 디버깅할 것(약지: F8, 검지: F10) 
Pause / Continue, F8: 멈춤 / 계속 ==> 다음 break point가 나타날 때까지 실행
Step over, F10: 라인의 함수를 실행한다.
Step into, F11: 실행 라인의 코드에 함수가 있다면 함수안의 첫 번째 코드로 진입해 들어가 다시 하나씩 라인별 코드를 실행한다.
Step out, Shift + F11: Step into로 들어온 함수를 끝가지 실행하고 밖으로 나와 해당 함수를 실행한 함수로 돌아간다.
Toggler breakpoints: 브렉포인트를 끄거나 켤수 있음(소스 번호에 클릭하여 설정 -> F8 누르면 브렉포인트가 설정됨)
Pause on exception: 자바스크립트에 예외가 발생하면 해당 위치에 브렉포인트를 잡아준다.
Capture async stack trace: 함수의 비동기 호출을 추적한다.

if(objId =="A1500_1_1_0") {  // 13.위험지역 출국(rad_A1500_1_1_0) radio 이면 ==> Websquare에서
	console.log("[/CBSC129P.xml] [lfn_Search()] ==> [조회 처리] [TEST_30_1]  [obj에 Ds 칼럼 담기] [i_번째]"+ i 
	+"[Obj ID]"+ obj.id +"[Obj 값]"+ obj.Obj.getValue() +"[obj.Obj.getValue()]"+ obj.Obj.getValue() ); 
	debugger;    // 디버깅 설정_01[/CBSC015M.xml] [lfn_Search()] ==> [조회] [TEST_91] 		// TEST @@@ ===>
}
if(i > 242) {
	debugger;   	// ==> 최초에 디버깅이 걸리고 F8을 누르면 디버깅이 해제 됨 --> F8 대신 F10 나 F11을 눌러야 함 @@@
}
==============================================================================================================   

- [생할코딩] 크롬 개발자 도구 5 - sources[디버깅]
https://www.youtube.com/watch?v=L52UucF_y0U

- [생할코딩] 크롬 개발자 도구 9 - console
https://www.youtube.com/watch?v=LEcExA5TGZg
==> fire bug API ==> https://gist.github.com/corpix/5866271#help

1. 크롬 콘솔 처리
> WebSquare.xml.serialize(dlt_MemberBasic.getAllXML()); 
> dlt_MemberBasic.getAllJSON();		// dlt_MemberBasic Ds JSON값 얻기
 (3) [{…}, {…}, {…}] 
0: {chk: "", EMP_CD: "100001", EMP_NM: "진태만", EMP_CN_NM: "", EMP_EN_NM: "", …}
1: {chk: "", EMP_CD: "100002", EMP_NM: "개발자", EMP_CN_NM: "", EMP_EN_NM: "", …}
2: {chk: "", EMP_CD: "100003", EMP_NM: "박명근", EMP_CN_NM: "", EMP_EN_NM: "", …}
length: 3
__proto__: Array(0)

> dlt_MemberBasic.getCellData(0, "EMP_CD");						// dlt_MemberBasic Ds에서 EMP_CD(사원코드: 칼럼) 값 확인
"100001"
> dlt_MemberBasic.setCellData(0, "EMP_CD", "100004");		// dlt_MemberBasic Ds에서 EMP_CD(사원코드: 칼럼) "100004"를 셋팅
undefined
 > dlt_MemberBasic.getCellData(0, "EMP_CD");					// dlt_MemberBasic Ds에서 EMP_CD(사원코드: 칼럼) 값 확인
"100004"
WebSquare.util.getComponentById("ibx_EmpCd").getValue();   	// ibx_EmpCd(사원코드: Input Box) 값 확인
"100004" 
==============================================================================================================  

- WEB3-Ajax-1.수업소개
https://www.youtube.com/watch?v=w077w7FN-pg&list=PLuHgQVnccGMA9-1PvblBehoGg7Pu1lg6q

- Ajax 원리 @@@@
 <!doctype html>
<html>
 
<body>
	<article>
	</article>
	 
	<input type="button" value="fetch" onclick="
	/*
	fetch('html').then(function(response) {
		response.text().then(function(text) {
			document.querySelector('article').innerHTML = text;
		})
	})	
	*/
	 
	 // Asynchronous
	 fetch('html').then(function(response) {			// 서버에서 html 파일을 요청
		if(resonse.status == '404') {
			alert('Not found')
		}
		
		console.log(1);
		console.log(2);
	">
</body>
</html>
==============================================================================================================

- 로지텍 무선콤보 MK240 NANO 키스킨 구입
1. [로지텍코리아] MK240 전용 키스킨, 가격: 3,600원(2개), 실제 가격: 3,400원(2개, N Pay 포인트 차감)
http://www.joyzen.co.kr/product/sInfo.html?fid=1&uid=47&Pnum=337030&optsid=ENR
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 16:30 ==> 눈 옴(날씨 따뜻해서 다 녹음)

- HDS 엔진 Prj[★]
- 창원 숙소 구하기
05:20 기상
05:40 인터넷 서핑 ==> '짐싸기' 유투브에서 동영상 시청
07:30 짐싸기 시작
08:10 조식
08:40 도림천로 도보
09:10 귀가 
09:20 짐싸기
10:40 짐싸기 종료 ==> 여행용 캐리어(28인치) 2개, HP 백팩 1개(짐 너무 많음, HP 백팩은 줄이고 캐리어 2개만 가지고 다닐 것)
11:00 중식
11:40 집출발
11:50 눈 와서 길이 젖어 있음 ==> 오이사에게 전화(광명까지 택시비 회사에 청구한다고 함 ==> OK함)
12:00 택시(문영A --> 광명역): 10,900원
12:30 광명역 도착
13:06 광명역 출발
15:38 창원중앙역 도착
15:45 허민준 대리 만남(허대리 차(QM6) 차타고 감)
16:00 천일부동산 방문(성원 그랜드 오피스텔 134호): 주인 없음
16:20 코쿤하우스 546호 방문(창원시 성산구 중앙동 95-3 공성사가 5층), 김선태(010-3885-2221)
			==> 마음에 듬(의자, 매트리스, 발매트, 빗자루 있음)
16:40 천일부동산 방문 ==> 계약서 작성
		1. 계약 기간: 2019.02.19(화) ~ 07.05(금), 4. 5개월 ==> 1,575,000원 일시불 지급
		2. 보증금: 10만원(마지막 달 관리비에서 차감후 반환할 예정)
		3. 부동산 수수료: 22만원(상가 건물이라 비싸다고 함)
		 1) 관리비 ==> 공용 관리비, 물 전기 난방(개별 계량기)
		 ==> 김유진 대리가 꼼꼼하게 잘 처리함 
		 ==> 코쿤하우스 현관 비번 ==> 경비얼굴 + 열쇠 + 6912 + 종
		 ==> 코쿤하우스 546호 비번 ==> *5*8#(5자리)
17:40 종료
18:10 코쿤하우스 짐 풀기
18:30 석식(설렁탕): 허민준 대리에게 사줌
18:50 종료
19:00 산책(이마트 -> 교육청 -> 시청)
19:30 귀가
19:40 짐정리 ==> 주사기, 슈퍼라인 안 가지고 옴(맨붕)
20:40 양재 최의원 간호사에게 전화 ==> 1회용 인슐린 주사기 구입해서 인슐린 맞으라고 함
20:50 이마트 병원, 롯데마트 병원 방문 ==> 1회용 인슐린 주사기 판매 안함
21:30 창원병원 근처 창원세계로 약국 방문 ==> 1회용 인슐린 주사기(10개, 2,500원) 구입
22:00 귀가
22:20 인터넷 서핑
23:10 취침
==============================================================================================================

- 부동산 숙소 계약시 본사에 보내야할 문서 
1. 계약서
2. 영수증
3. 통장 사본(부동산)
4. 명합(부동산)
==> (주) 지아이데이타 팩스 번호: 02-527-3889
============================================================================================================== 
  
- 구겨지지 않게 셔츠 개는 방법
1. 옷 뒷면에 준비해둔 쇼핑백을 깔고 소매부터 개어줌
2. 두 팔 정리 후 옷을 반으로 접음
============================================================================================================== 
  
- 프로젝트 파견 준비물[2019.02.18(월), 짐싸기]
A. 개발 사무실에서 필요한 물품
1. 노트북 장비 ==> 반입 불가 
2. 당뇨 물품
 1) 체혈기 셋트(체혈기, 체혈침, 체혈지)
3. 기타
 1) 핸드폰 충전기, 우산, 슬리퍼, 컵, 칫솔, 치약, 이어폰, USB 선풍기, 수첩, USB(반입 가능)
--------------------------------------------------------------------------------------------------------------------

B. 숙소에서 필요한 물품
1. 옷
 1) Y셔츠 2벌, 반팔 T-셔츠, 숏팬츠, 7부 바치, 체육복(상하), 양발 20벌, 속옷3벌, 수건 2개(발 걸래 1개), 바지(1벌), 세탁용 세제
2. 새면 도구
 1) 칫솔, 치약, 떼 타올, 면도기, 비누, 빗, 남성 크림, 과도(칼), 컵, 물병
3. 노트북 장비
 1) 노트북, USB 키보드 세트, 마우스(예비)
4. 당뇨 물품
 1) 체혈기 셋트(체혈기, 체혈침, 체혈지), 인슐린 약 교체 장비(오토세트, 주사기, 슈퍼라인, 반창고), 당뇨병 먹는 약, 인슐린(6병, 냉장 보관)
 ==> 주사기, 슈퍼라인 안 가지고 옴(밤 12:30 창원병원 근처 약국에서 1회용 인슈린 주사기 구입(10개, 2,500원))
5. 기타
 1) 핸드폰 충전기, 우산, 슬리퍼, 컵, 칫솔, 치약, 이불(침낭, 매트, 베게), 샌들, 옷걸이(4개), 빗자루 세트, 멀티탭, 면도기
    , 옷걸이 5개, 멀티탭, 과도, 효자손, 비닐 봉투(10개) ==> 걸레 가지고 올 것
==> 여행용 캐리어 2개, HP 백팩에 담아서 갈 것
==> 필수: 인슐린은 집에서 나가서 전에 냉장고에서 6병 빼내서 갈 것(냉장 보관), 먹는 약 챙기기
==============================================================================================================

- 투입시 이삿짐 @@@
1. 여행용 캐리어(28인치, 스위스 밀리터리)
 1) 이불(침낭, 매트, 베게)
 2) USB 선풍기, 빗자루 세트
--------------------------------------------------------------------------------------------------------------------

2. 여행용 캐리어(28인치, 아이프라브)
 1) 옷(셔츠, 양말, 속옷), 세면 도구
 2) 잡다한 물건(숙소, 사업장)
--------------------------------------------------------------------------------------------------------------------

3. 백팩(hp) ==> 다음 부터는 백팩(hp)을 사용하지 말 것(물건 최대한 줄일 것)
 1) 노트북 장비(숙소)  ==> 스위스 밀리터리 캐리어에 담을 것
 2) 잡다한 물건(사업장)  ==> 스위스 밀리터리 캐리어 손잡이에 걸치는 1회용 가방에 담을 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> HDS 엔진 Prj 투입 , 중식(매운탕[횟집], 구윤모 부장, 김보훈 대리, 오태범 이사, 허민준 대리)
								, 인슐린 펌프(오전, 오후, 저녁 10U 주입 후 밧데리 끔): 정상 혈당 나옴, 야근하지 말라고 함
								, HDS 엔진 잠바(동복, 추계복) 지급 받음(철수시 반납할 것)

- HDS 엔진 Stock 운영 시스템 구축 Prj[★] 
- HDS 엔진 Stock 운영 시스템 구축 KICK OFF(11시, 회의실)
1. 프로젝트 추진 범위
 1) 부품사업 Stock 운영 프로세스
  가. Stock 구매 ==> Stock 관리 ==> Stock 판매
2. 추진 일정 및 조직
 1) 추진 일정
   가. 02월 20일: 착수 보고
   나. 04월 25일: 중간 보고
   다. 05월 31일: 개발 완료
   라. 06월 17일: 오픈
   마. 07월 11일: 완료 보고
  2) 추진 조직
   가. Project Owner: 권칠상 부장 ==> 1. 단순, 2. Data 정합성, 3. 속도, 4. 팀 플레이, 5. 심플한 산출물, 6. 현업참여
   나. Project Manager: 오은식 차장
   다. Project Sponsor(현업): 부품사업 박점근 부장, 엔진IT팀: 구윤모 부장
   라. PMO: 부품사업 정진용 과장, 엔진IT팀: 김보훈 대리
   마. ERP 및 I/F 개발: 김명옥 차장, 김보훈 대리
3. 기타
 1) 김보훈 대리가 Websquare에서 java 스케줄(배치) 처리 문의
==============================================================================================================  

- HDS 엔진Prj 교육(17시 ~ 17:30)
1. 김보훈 대리
==============================================================================================================  

- 크롬 로그인 안됨(21시, 집) 
taemario@gmail.com// 해피태만1*0*@ --> 사용할 것 @@@ 
tamario1004@gmail.com --> 신규 생성(사용하지 말 것)
==============================================================================================================  
 
- Notepad++에서 빨간 줄 생김
==> https://dodnet.tistory.com/495 
==============================================================================================================  
 
- Notepad++에서 폰트
1. 함초롬 돋음으로 변경 ==> https://eslife.tistory.com/799
==============================================================================================================  
 
 - [Eclipse] 이클립스 탭(Tab), 띄어쓰기(Space) 등 공백문자 표시 설정
1. 이클립스 상단 메뉴에서  Window > Preferences(새창)
2. General > Editors > Text Editors에 들어가서 show whitespace characters에 체크
==============================================================================================================  
 
- OTP 설치 방법
[단계 1] 스마트폰 OS별 Store 에서‘RSA Securid’로 검색하여 해당 App 을 설치함
[단계 2] 본 메일을 스마트폰의 메일 App 을 통해 열람함
[단계 3] 스마트폰에서 열람한 이메일 내용 중 '6. 설치 URL' 을 클릭함
[단계 4] 토큰파일 암호는 본인의 AD 계정명(AD계정의 암호가 아님)을 입력하면 설치 완료됨
==> URL: email.doosan.com, taeman1/asas1212@
==============================================================================================================

- 내 손으로하는 당뇨병 관리 올바른 인슐린 주사법 [1회용 인슐린 주사기]
https://www.youtube.com/watch?v=krChAciujYU
--------------------------------------------------------------------------------------------------------------------

- 인슐린 보관
1. 냉장 보관: 사용하지 않는 인슐린
2. 실온 보관: 사용 중인 인슐린은 개봉 후 한 달까지 실온 보관
--------------------------------------------------------------------------------------------------------------------

- 초속효성 인슐린: 식사 전 15분 이내
- 냉각지갑 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.02.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 ==> 05:49 인슐린 약 교체(83U): 1회용 주사기 사용, 슈퍼라인 재사용(혈당 괜찮게 나옴): 성공적 재사용
								 , HDS엔진까지 도보 출근(처음, 50분 걸림), 식권 4장 구입(만 8천원), 18:30 창원용지공원 첫 도보

- HDS 엔진 Stock 운영 시스템 구축 Prj[★] 
- HDS 엔진 Prj 교육(08:40 ~ 10:30)
1. 참석자: 오은식 차장(PM), 부품사업팀 정진용 과장(현업), 김보훈 대리 ==> PI회의실
2. 내용 ==> 교육: 정진용 과장
 1) 견적등록 ==> 견적작성 ==> 견적회신
 2) 수주생성 ==> 수주등록 ==> BOM생성(BOM[Bill Of Material]: 사양 설명서)
3. Stock 관리(신규 개발)
 1) Stock Master ==> 가용 수량(Batch 사용): 시간 단축 요구(최대한 빨리 반영될 것)
 2) Stock 사용
 3) Stock 운용, 판매
4. 이슈 사항
 1) WAS(i-Biz, e-Biz) 2개를 띄우면 하나가 죽음(간혹 발생)
   가. 윈도우 서버, Weblogic 서버
 2) Grid 편의 기능 요구
 3) 화면 시작시 속도 느림
  가. init 함수 사용시 초기화 함수 속도가 느림
  나. 시스템 자체 속도가 느림   
============================================================================================================== 

- 견적등록(/INQ000110.xml)
============================================================================================================== 

- HDS 엔진 Biz URL
01. HSD(i-Biz) ==> http://localhost:8080, taeman1.jin / as**12**@ 
02. HSD(i-Biz_개발S) ==> http://10.10.11.162:7010/
03. HSD(e-Biz_개발S) ==> http://10.10.11.162:7020/  
04. HSD(i-Biz_운영S) ==> http://i-biz.hsdengine.com:7010/
05. HSD(e-Biz_운영S) ==> http://e-biz.hsdengine.com:7020/ 
taeman1.jin@hsdengine.com 
============================================================================================================== 

- PL SQL Developer 사용법
1. plsqldev902.exe 실행
2. C:\Orawin95\NETWORK\ADMIN\tnsnames.ora 복사하여 붙여넣기
==============================================================================================================

- HDS 엔진 Stock 운영 시스템 구축Prj DB 정보
1. i-Biz_개발 서버
IP: 10.10.11.91, PORT: 1610, DB: LEGACY_DEV_NEW, SID: CRM
ID: ebiz_new / ebiz_123#
 --------------------------------------------------------------------------------------------------------
 
2. i-Biz 운영 서버
IP: 10.10.11.191, PORT: 1531, DB: LEGACY, SID: CRM
ID: ebiz / ebiz_2017p
==============================================================================================================

- HDS 엔진 통근 버스 노선
1. 출근 노선 ■
17.사파동성: 사파동성A(06:58) - 사파삼거리(07:00) - 무궁화A(07:04) - 은아A 정문(07:06) - 삼일상가(07:11) ? 회사 ==> 보경[★]
	
3. 퇴근 노선(17:20) ■
2.팔용동: 회사 - 창원시외버스터미널 - 대동A - 극동A - 팔용동사무소 - 임진각 - 오성A - 창원역 - 한전 - 
북면화천슈퍼 - 북면GS주유소 - 북면도원슈퍼- STX칸 2단지-STX칸 1단지-휴먼빌 1/2단지-휴먼빌 3단지 ==> 보경[★]

3.중리삼계: 회사 - 봉덕 - 대림하이빌A - 한일2차 - 마산역 - 북성초 - 교도소 - 중리삼거리 꽃집 - 코오롱2차
- 동신A LG주유소 - LG마트건너편 - 숲속마을주공A ==> 성산[★]

4.법원(1): 회사 - 두대 - 씨티세븐 - 반지사거리 - 노블파크북문 - 반송시장 - 일동A - 사림동 사무소 - 도청 - 신월동 
- 법원 - 동성A - 성원3차A ==> 보경[★]

5.법원(2): 회사 - 창원병원 - 삼일상가 - 정우상가 - 상남은아그랜드 - 성원주상가 - 중앙탕 - 남양초등 - 개나리2,3차
- 대방동 - 황토방A ? 유니온빌리지 ==> 보경[★]

9.장유(2): 회사 - 창원병원 - 외동A - 소라A - 남산터미널 - 삼성테크윈2공장 - 면사무소 - 두산위브 - 기숙사
- 두부마을 - 젤미 삼문우체국 - 삼문초 - 월산초 - 서희스타힐스 ==> 성산 [★]

5. 퇴근 노선(18:20) ■
4.법원(1): 회사 - 두대 - 씨티세븐- 반지사거리 - 노블파크북문 - 반송시장 - 일동A - 사림동 사무소 - 도청
- 신월동 - 법원 - 동성A - 성원3차A ==> 보경[★]

9.장유(2): 회사 - 창원병원 - 외동A - 소라A - 남산터미널 - 삼성테크윈2공장 - 면사무소 - 두산위브 - 기숙사
- 두부마을 - 젤미 삼문우체국 - 삼문초 - 월산초 - 서희스타힐스 ==> 성산 [★]
	
6. 퇴근 노선(19:20) ■
장유: 회사 - 창원병원 - 외동 월드메르디앙 - 소라아파트 - 남산터미널 -한화테크윈 2공장 - 장유면사무소
- 두산위브 - 기숙사 - 두부마을 - 젤미 삼문우체국 - 삼문초 - 월산초 - 한림풀에버 -중앙하이츠 - 모아2차
- 대우 1차 - 팔판주유소 ==> 성원[★]
============================================================================================================== 

- 비밀번호 관리
1. 라스트 패스(LastPass) ==> https://lastpass.com/misc_download2.php, tamario@naver.com / hp태*1*0*@
==============================================================================================================

- LG CNS 보안서약서 작성
1. http://securityplus.lgcns.com,  DEV109094 / hptnwhd1212@
2. 더케이 손해보험 투입용(투입 안되도 형식적으로 작성)
============================================================================================================== 

- 윈도우10 폰트 글꼴 추가 하는 방법
https://extrememanual.net/6963 ==> C:\Windows\Fonts
-------------------------------------------------------------------------------------------------------------------------

- [폰트, 한글과컴퓨터] 함초롱돋움 다운로드 
==> https://m.blog.naver.com/PostView.nhn?blogId=rmflt&logNo=110143506746&proxyReferer=https%3A%2F%2Fwww.google.co.kr%2F
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2019.02.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 17:00 ==> 06:45 인슐린 약 교체(70U): 1회용 주사기 사용, 슈퍼라인 재사용[오토 세터 사용: 용량 정확함]
								, 새마을금고에서 식권 4장 영수증 발급(18,000원), 서울행(18:23 ~ 20:44, KTX)

- HDS 엔진 Stock 운영 시스템 구축 Prj[★]
- 소스 분석
============================================================================================================== 

- HDS 엔진Prj 교육(08:20 ~ 10:30)
1. WebSquare 개발 관련 교육(김보훈 대리)
 1) Maver update ==> pom.xml(Nexus 사용 안함)
 2) 젠킨스(Jenkins)로 배포
  가. 빌드 후 개발 서버에 적용됨
  나. Maven 빌드 아님(ANT 빌드 사용)
 3) websquareConfig.properties
  가. login.setting.service.type=IBIZ  ==> ibiz로 로그인(EBIZ)
  나. JAVA 1.8 사용
 4) Storage
  가. 10.10.11.50 --> 자동 파일 upload
 5) db.properties
  가. oracle.driver=oracle.jdbc.driver.OracleDriver
	oracle.url=jdbc:oracle:thin:@10.10.11.91:1610:CRM 
	oracle.username=ebiz_new
	oracle.password=ebiz_123#
 6) spy.properties
  가. 로그 설정
 7) 개발 소스 샘플
  가. 수주등록 및 상세내용(/ORD000050.xml)
  나. 견적작성(/INQ000150.xml)
 8) Weblogic WAS 서버 사용
  가. 윈도우 실시간 디버깅 툴 요청(김도훈 대리)
  나. UI 서버 호출 > 서버 통신 > 통신 결과 오류발생 시 UI 오류메시지 이전에 서버 오류메시지 우선적으로 남. (wqmodel)
	==> Doosanengine>decom>com>adapter>WqModel.java
 9) 공통
  가. USER_AD: 사용자 정보
  나. 공통 JS: common.js
 10) 기타
  가. Modal로 창 띄웠을 때 창이 3개이면 모달이 안 먹음
  나. scwin, promise, scope, UDC, snap shot
============================================================================================================== 

- eclipse console log 다른 프로그램에서 모니터 하기(윈도우용 Tail 프로그램)
1. i-Tail 사용법 
 1) 파일(F) > 열기 ==> tomcat8_fsp-stdout.2018-10-18.log
2. 명령어
 1) CLR(ESC): 화면 Clear
 2) 시작
 3) 중지
3. 참조
 1) http://mainia.tistory.com/169
============================================================================================================== 

- Websquare에서 console 로그 설정
1. /config.xml 파일에서  
<debug value="true" remoteConsole="false" console="false" />		<!--// console="false": Engine console log OFF //--> 
-------------------------------------------------------------------------------------------------------------

- 크롬에서 console 로그 변경 내용 반영 안됨 
1. 개발자 도구(D): Shift + Ctrl + I > Network Tab에서 Disable cache 체크 해야 됨(cache가 싸이지 않게 체크)
==============================================================================================================

- 핸드폰 사진 잘 찍는 법 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 주말
07:30 기상
08:10 조식
09:00 집출발
09:10 도림천 도보
09:40 귀가
10:00 인터넷 서핑 ==> 루옌, 수종이와 같이 언니집에 놀러감
12:00 중식  
12:30 도림천로 도보
13:30 종료
13:40 귀가
14:00 인터넷 서핑 ==> 2018년 귀속 연말정산(2019.01) 분석
16:10 낮잠
17:20 기상
18:00 석식
19:00 도림천로 도보
19:30 종료
20:00 다이소 대림2호점 ==> 로션, 가위, 컵 구입
20:10 우유(2개) 구입
20:20 귀가
20:30 인터넷 서핑 ==> 2018년 귀속 연말정산(2019.01) 분석
21:20 종료 ==> 루옌, 수종이 귀가
22:30 취침
==============================================================================================================

- 케어센스N 혈당지 구입
1. 케어센스N 혈당측정지 6통(300개), 택포 가격: 49,000원[개당, 163원]
https://cafe.naver.com/joonggonara/563026485
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 69kg 

- 주말2
03:40 기상
03:50 인터넷 서핑 ==> 2018년 귀속 연말정산(2019.01) 분석
06:00 종료
06:10 휴식
08:00 석식
09:30 도림천로 도보
10:00 귀가 
10:10 인터넷 서핑 ==> 2018년 귀속 연말정산(2019.01) 분석
12:00 중식 ==> 수종 엄마따라 놀러감
12:30 도림천로 도보
13:30 종료
14:00 인터넷 서핑 ==> 2018년 귀속 연말정산(2019.01) 분석
15:20 다이소 대림2호점 ==> 가위 교환
15:30 인슐린 펌프 제거
15:40 집출발(자전거)
15:50 대림운동장
16:00 축구 게임(은혜교회팀: 어울림팀) ==> 4쿼터 뜀(4시간): 컨디션 약간 괜찮음, 날씨 따듯(봄날씨), 선수 많이 안 나옴(13명)
		--> 드로링하다고 어깨 삐긋, 10번 수비하다가 넘어져서 어깨 더 삐긋함(참고 뜀)
18:00 종료
18:20 귀가
18:30 샤워
18:55 인슐린 펌프 착용
19:00 석식
19:30 운동(워킹 머신에서 빠르게 걷기: 6km)
19:50 종료 ==> 루옌, 수종 귀가
21:0 TV 시청
23:10 취침
==============================================================================================================

- HSD 엔진 출근 방법
1. 택시로 당일 광명역 출발(문영A --> 광명역(20분, 18.8km, 택시비: 14,100원) ■■ 
 1) 04:30 문영A 출발 ==> 05:00 광명역 도착 ==> 05:21 광명역 ==> 08:00 마산역 ==> 08:20 HSD 엔진 출근 
2. 버스로 당일 광명역 출발(불가능함)
 1) 05:17 구로D환승C 5627번 버스 탑승 ==> 06:00 광명역 도착 ==> 05:56 광명역 ==> 08:49 마산역 ==> 09:20 HSD 엔진 출근
3. 전일 창원 출발(피곤함)
 1) 20:00 집출발 ==> 20:20 영림초교 ==> 20:40 광명역 도착 ==> 20:56 광명역 ==> 23:51 창원중앙역 ==> 24:20 숙소 귀가(도보 30분)
==============================================================================================================

- 집에서 가져올 것(19시, 집)
1. 주사기(7개), 슈퍼라인(7개), 혈당지(9통), 알콜솜
2. 와이파이, 걸레, 방석, 로션, 양치컵(작은 것), 칼 
3. 로지텍 USB 무선 콤보 MK240, 마우스 패드, 키스킨(2개), 건전지(20개), 수첩(작은 것)
4. 현금 카드(신한은행): 식권 1주일에 4,500원(1일 2장 ==> 1주일 10장 => 2주 단위 구입(20장)) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00 ==> 04:20 택시(문영A -> 광명역), 창원행[광명(05:21) -> 마산(08:00), KTX], 새마을금고에서 식권 8장 영수증 발급
									(36,000원, 현금)

- HDS 엔진 Stock 운영 시스템 구축 Prj[★]
- 소스 분석
1. wframe: JSP의 include처럼 웹스퀘어 xml화면 파일을 현재 화면에 include할 때 사용하는 컴포넌트
주로 화면마다 항상 쓰이는 영역을 별도의 파일로 구성하여 사용하거나 공통이 되는 top, left의 메뉴 구성시 사용
일반적으로 wframe에 로딩 된 화면을 동적으로 변경해야하는 경우는 iframe 컴포넌트 사용을 권장

2. iframe: HTML의 iframe과 같은 기능을 제공하는 컴포넌트로 웹스퀘어로 만들어진 화면 이외 웹 컨텐츠들을 화면에 출력할 수 있다.
본 컴포넌트는 SPA모드 적용이 가능한 컴포넌트이며 제약사항을 반드시 숙지해야한다.

3. tabControl: 다건의 탭과 컨텐츠를 생성할 수 있는 레이아웃용 컴포넌트로 동적으로 탭을 생성하거나 삭제할 수 있다.
하위 컨텐츠는 iframe으로 구성(페이지 링크)하거나 컨텐츠 영역에 하드코딩할 수 있다.
본 컴포넌트는 SPA모드 적용이 가능한 컴포넌트이며 제약사항등을 반드시 숙지해야한다.
본 컴포넌트는 최상위에는 div Tag로 이루어져있으며 하위로 복합 Tag들로 구성되어있다. 최상위에는 div Tag로 이루어져있으며 
하위로 복합 Tag들로 구성되어있다. 
==============================================================================================================

- 창원행
04:00 기상
04:10 카카오 택시 호출
04:15 집출발
04:20 카카오 택시 탑승(칸타빌레 슈퍼 앞)
04:40 광명역 도착(택시비: 14,100원)
05:21 KXT 탑승
08:00 마산역 도착
08:10 허민준 대리 차 탑승(마산역 택시 정류장 근처)
08:30 출근(HSD 엔진)
09:10 조식(빵, 컵라면[새마을금고 매점], 혈당248: 빵 먹지 말 것) ==> 다음부터 마산역 앞 편의점에서 김밥 사서 먹을 것
==============================================================================================================

- ellipse 실행 에러
1. 현상: [오류]The Eclipse executable launcher was unable to locate its companion shared library
2. 원인: launcher가 실행될 때 필요한 공유라이브러리를 찾을 수 없어 실행하지 못하는 오류
3. 조치: 이클립스 경로>eclipse.ini 파일을 수정한다.
-launcher.library=[이클립스경로]\plugins~
-startup=[이클립스경로]\plugins~
==> https://zzangprogrammer.tistory.com/262
==============================================================================================================

- 건강검진 결과 병원(연세준내과)에 문의
1. 고혈압 전단계(119/84) 문의 ==> 형식적으로 120/80 넘으면 고혈압 전단계라고 기록 한다고 함
2. 당뇨병 유질환자라는 표현도 건강검진 전 작성지를 보고 기록한다고 함
2. 건강검진 결과 출력물(3장) 집에 와서 스캔할 것
==============================================================================================================

- 2017년 귀속(2018년 01월) 연말정산 수정 신고
1. 아버지 장애인 공제 추가 신고할 것(7만원 환급 받는다고 함) ==> 홈텍스에서 민원 신청할 것
==============================================================================================================
 
- 연말정산 결과 확인(20시, 숙소)
1. 소득세:  583,340원, 지방소득세: 58,400원
 ==> 총 납부금: 641,740원
==============================================================================================================

- 숙소(코쿤 하우스) 와이파이 설정
1. SSID: olleh_GiGA_WiFi_1806 --> 0000000508
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 도보(06:55 ~ 07:55): 남천 방향으로 해서 후문 출근

- HDS 엔진 Stock 운영 시스템 구축 Prj[★] 
1. 견적작성(/INQ000150.xml) 조회 소스 분석
 1) Inquiry No.(질의 번호): LBN941, ==> 데이타 존재 
==============================================================================================================

- 테이블명이 'TB_BOARD' 인 테이블의 생성 스크립트 확인
SELECT DBMS_METADATA.GET_DDL('TABLE','TB_BOARD') FROM DUAL;
==============================================================================================================

- jQuery - ajax[생활코딩]
https://www.youtube.com/watch?time_continue=57&v=fiqApu1t1Vc

- WEB3-Ajax-1.수업소개
https://www.youtube.com/watch?v=w077w7FN-pg&list=PLuHgQVnccGMA9-1PvblBehoGg7Pu1lg6q
----------------------------------------------------------------------------------------------------------------------

fetch('html');				// 서버에서 html를 요청
.then   // 

fetch('html').then(clallbakcme);
console.log(1);
console.log(2);

function callbackme()
{
	console.log('resonse end');
} 
==============================================================================================================

- Promise
1. 정의: 프로미스는 자바스크립트 비동기 처리에 사용되는 객체입니다. 여기서 자바스크립트의 비동기 처리란 ‘특정 코드의 실행이 
완료될 때까지 기다리지 않고 다음 코드를 먼저 수행하는 자바스크립트의 특성’을 의미합니다.  
 2. 목적: 프로미스는 주로 서버에서 받아온 데이터를 화면에 표시할 때 사용합니다. 일반적으로 웹 애플리케이션을 구현할 때 서버에서 
 데이터를 요청하고 받아오기 위해 아래와 같은 API를 사용합니다.
$.get('url 주소/products/1', function (response) {
  // ...
}); 
==============================================================================================================   

■■■■■■■■■■■■■■■■■■ 2019.02.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 09:30 출입증 나옴, 23:20 인슐린 약 교체(190U)

- HDS 엔진 Stock 운영 시스템 구축 Prj[★]
- 소스 분석 자료 정리
1. 메일 보내기 
==============================================================================================================

- 메뉴 등록(기준정보 > 시스템관리)
1. 프로그램관리 ==> Stock Master(STD000050): /bizcom/std/xml/STD000050.xml
2. 메뉴관리 ==> Stock Master 등록
3. 권한관리 ==> 1.권한:  IBIZ Manager, 2.  Stock Master: 사용 체크
==============================================================================================================

- 공통코드 등록(기준정보 > 공통정보관리)
1. 공통코드 관리 
 1) 공통코드 관리 ==> MS_CODE: STD004, 코드명: Status, 설명: Status, 사용여부: 체크
 2) text > 행추가 ==> 
	MS_CODE: STD004, 상세코드: 01, 코드명: 적용, 사용여부: 체크 
	MS_CODE: STD004, 상세코드: 02, 코드명: 미적용, 사용여부: 체크  
==============================================================================================================

- Stock Master(/STD000050.xml) 개발
1. No. 칼럼 보기 ==> rowNumVisible="true", Status 칼럼 보기 ==> rowStatusVisible="true" 
<!-- Stock 품목등록 그리드 뷰 -->
<w2:gridView autoFit="lastColumn" dataList="ds_list" fixedColumnWithHidden="true" id="grd_view" ignoreCellClick="false" ignoreToggleOnDisabled="false" rowNumHeaderValue="No."
	contextMenu="true" rowNumStatusResize="false" rowNumVisible="true" rowNumWidth="40" rowStatusVisible="true" rowStatusWidth="50" rowStatusHeaderValue="" scrollByColumn="false" scrollByColumnAdaptive="false"
	showSortableUseFilter="false" style="height: 430px;" summaryAuto="false" summaryOnlyAuto="false" useFilterList="false" useShiftKey="true" visibleRowNum="20"
	ev:oncellclick="scwin.grd_view_oncellclick" ev:oneditend="" ev:onafteredit="scwin.grd_view_onafteredit">
</w2:gridView>
==============================================================================================================

- 세션소스관리 의견 요청 메일 받음
1. (주)인스웨이브 이성복 수석(010-9292-1964, 02-2082-1410, sb5069@inswave.com)에게 기술 지원 요청하라고 함.
 1) 01. 두산_웹스퀘어 _공통기술.xlsx
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.02.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 서울행[마산(18:11) -> 광명(20:44), KTX]

- HDS 엔진 Stock 운영 시스템 구축 Prj[★]
- Stock Master(/STD000050.xml) 개발
==> STD_STOCK_MASTER_V 
1. ref[데이타 바인딩할 때 사용]: data:ds_search.I_CATEGORY  ==> 2개 이상 칼럼에 사용하면 콤보 데이타 선택이 안됨
 
<!--// 10. 조회(input) dataMap(ds_search) //-->
<w2:dataMap baseNode="map" id="ds_search" style="">
	<w2:keyInfo>
		<w2:key dataType="text" id="I_CATEGORY" name="카테고리"></w2:key>
		<w2:key dataType="text" id="I_ITEM_GROUP" name="품목그룹"></w2:key>
		<w2:key dataType="text" id="I_STOCK_DIV" name="Stock 구분"></w2:key> 
		<w2:key dataType="text" id="I_STATUS" name="상태"></w2:key> 
		<w2:key dataType="text" id="I_STOCK_SHORT_YN" name="재고부족 여부"></w2:key> 
	</w2:keyInfo>
</w2:dataMap>
 ==============================================================================================================

- Websquare license 업데이트
1. 2019년 8월31일 만료 웹스퀘어 데모라이선스로 업데이트 함 ==> license_2019.08.31
 1) 경로 1 반영 ==> C:\DOOSANENGINE_CORE_PKG\STUDIO\eclipse\license
 2) 경로 2 반영 ==> C:\DOOSANENGINE_CORE_PKG\RESOURCE\websquare_home\license
==============================================================================================================

- DBeaver 버전 확인 및 테스트
1. DBeaver ==> ver 5.0.3 ==> 2018년 4월 16일(월)
 1) Tab에 파일명만 나옴(정상)
==============================================================================================================  
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
