

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2019.07) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2019.07.01(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 본사 대기[★]
- LG 노트북(LG 15UD470-GX50K)에 SW 재설치
1. Window10 Pro 정품 인증
==============================================================================================================

- LG노트북 15UD470-GX50K 하드디스크 (HDD) 추가하는 방법
http://blog.naver.com/PostView.nhn?blogId=nland21&logNo=220892369331&parentCategoryNo=&categoryNo=9&viewDate=&isShowPopularPosts=true&from=search
==============================================================================================================

-  LG 노트북(LG 15UD470-GX50K)에 HDD 추가(1TB)
1. LG 서비스 센터에 전화 ==> 케이블, 베이 2개 구입하는데 7천 5백원 비용 발생(LG 서비스 센터 강남역점에 가서 구매해야 함) 
 1) LG 서비스 센터 강남역점 ==> https://www.lgservice.co.kr/center/selectCenterSearchDetail.do?cSeq=231
==============================================================================================================

 - 17강: 독서습관을 만드는 7가지 방법 - [완벽한 공부법] 저자, 고영성 작가 특강 | [인생공부 X 체인지그라운드]
 https://www.youtube.com/watch?v=g231AZ9sTGU&feature=youtu.be
==============================================================================================================

- 독서법 | 속독의 달인이 되려면 반드시 봐야할 영상 //독서법#7(속독법)
https://www.youtube.com/watch?v=motch5OJthc&feature=youtu.be
==============================================================================================================

- 예스병원 진료(어깨 수술 후)
15:00 퇴근
15:15 선릉역.선정릉정문 정류장
15:20 6411번 버스 탑승
16:40 구로4동 우체국.고대 구로 병원 정문 정류장 하차
16:50 예스병원 4층 접수
17:00 어깨 소독(우성종 원장)
17:10 물리치료(전기 치료, 열 치료)
17:40 종료 ==> 어깨 보조기 다시 착용(안전판을 꺼꾸로 착용 했음) 
18:10 귀가
19:00 석식 
19:30 도림천로 도보
21:00 어깨 자가운동(30분)
21:30 종료
21:40 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.02(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 본사 대기[★]
- LG 노트북(LG 15UD470-GX50K)에 개발용 SW 설치
1. Nexacro 설치(/nexacro14_SetupDeveloper.exe)
2. VisualStudio 2019 Community 설치
 0) 내 Microsoft 계정으로 로그인 ==> tamario@naver.com, hp태*16*01@
 1) vs_community__127145148.1562032218.exe 더블 클릭
 2) Visual Studio 2019 설치(비주얼 스튜디오 2019 설치) ==> https://www.youtube.com/watch?v=F-FNih33PAE&t=340s
 3) Visual Studio 2019 설치(비주얼 스튜디오 2019 설치) ==> https://sosobaba.tistory.com/221
==============================================================================================================

 - 크롬 pig toolbox 대체 
1. 우클릭 차단 해제를 대체하는 확장 프로그램: Right-Click enabler 
 ==============================================================================================================

- Sh 쑥쑥크는 아이적금 ) 자동이체 재 설정
1. 2019.07.02(화) 자동이체 재 설정 ==> 2019.07.28 ~ 2020.10.31 
==============================================================================================================

- 롯데카드
1. 2018.04 ~ 2019.02 카드 명세서 요청  ==> 이메일로 받음
==============================================================================================================

- 당뇨 소모품비 구입
1. 쌍봉 종합의료기(종로5가역)에서 카카오톡으로 구입
 1) 스트립지(케어센스N 혈당지)  7통(통당: 12,000원, 개당: 240원) 총 가격: 168,000원 송금 ==> 택배로 보내준다고 함(소모품 재료 청구할 것
2. 다나 메디칼에서 구입(11시에 본사에서 도보로 걸어 가서 구입)
 1) 슈퍼라인-ST[바늘 길이: 6.5mm]	 10 	 3,500 	 35,000 
 2) 다나 3cc 주사기(다나 플러스, 다나 용)	 10 	 1,500 	 15,000   ==> 총 5만원(소모품 재료 청구할 것)
 3) 다나알(dana R)용 건전지(6개, 24,000원) 
 4) 주머니 팬티(남) 구입 ==> 2장(만 4천원, 2장, 100호)
==> 2019.07.02(화) 현재 혈당지 9통 보유 중(쌍봉 종합의료기에서 7통 구입 전 상황)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.03(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 본사 대기[★]
- C#으로 살아남기 강의
1강. 닷넷프레임워크와 C# 언어
2강. C# 프로그래밍의 기본 구조 
==============================================================================================================

-  Visual Studio Community 2019에서 win32 콘솔 응용 프로그램이 없을 때 
1. Visual Studio Installer 실행(새창)
 1) 위크로드 > 기타 도구 집합 > .NET Core 플랫폼 간 개발: 체크 ==> 재 설치
 ==============================================================================================================

- LG 노트북 HDD 추가 부품 구입(14:30, LG 전자 강남 대리점) 
1. LG 서비스 센터에 전화 ==> 케이블, 베이 2개 구입하는데 7천 5백원 비용 발생(LG 서비스 센터 강남역점에 가서 구매해야 함) 
 1) LG 서비스 센터 강남역점 ==> https://www.lgservice.co.kr/center/selectCenterSearchDetail.do?cSeq=231
==============================================================================================================
 
 - 예스병원 진료(어깨 수술 후)
14:00 퇴근
14:10 도보(삼설제일빌딩 -> LG 서비스 센터 강남역점)
14:20 LG 서비스 센터 강남역점(서울시 강남구 역삼동 820-9 GLASS TOWER 글라스타워 16층) 도착
14:30 HDD 케이블, 베이 2개 구입(KLG 노트북 HDD 추가용)
14:40 643번 버스 탑승(강남역 정류장)
16:00 구일아파트 정류장 도착
16:40 예스병원 4층 접수
17:00 어깨 소독(우성종 원장)
17:10 물리치료(전기 치료, 열 치료)
17:40 종료 ==> 어깨 보조기 다시 착용(안전판을 꺼꾸로 착용 했음) 
18:10 귀가
19:00 석식 
19:30 도림천로 도보
20:30 종료
21:00 루옌이 베트남 1년에 한번씩 간다고 해서 화남 ==> 5년에 한번씩 가라고 통보(수종이 여권 만들지 말 것)
21:00 어깨 자가운동(30분)
21:30 종료
21:30 취침(수종)
==============================================================================================================

- [서울성모병원] 어깨관절 수술 후 재활운동법  
1. https://www.youtube.com/watch?v=kPvaN-Y21nw&feature=youtu.be
==============================================================================================================
  
- [기획취재] 어깨 통증, 오십견과 회전근개파열   
1. https://www.youtube.com/watch?v=FGQLIvKo7Uk&feature=youtu.be

- [시연용] f0006aako 어깨수술 후 재활운동 안내  
1. https://www.youtube.com/watch?v=BRGu3Q449Ow&feature=youtu.be
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.04(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 김정률 부장이 출근할 때 커피 4잔 사옴

- 본사 대기[★]
- Win10 USB 부팅 디스크 만들기
1. WIN10설치_1,  WIN10설치_2, WIN10설치_3 USB 만듬
 1) 윈도우10 ISO 파일(/MediaCreationTool1903.exe) 만 실행해서 만들면 됨.
==============================================================================================================
 
- LG 노트북(LG 15UD470-GX50K) HDD 추가
1. 구입한 케이블, 베이 2개로 내가 소유한 HDD로 LG 노트북에 추가 ==> LG 노트북 인식 못 함
2. LG노트북 15UD470-GX50K 하드디스크 (HDD) 추가하는 방법
http://blog.naver.com/PostView.nhn?blogId=nland21&logNo=220892369331&parentCategoryNo=&categoryNo=9&viewDate=&isShowPopularPosts=true&from=search
==============================================================================================================
 
- 당뇨 소모품비 청구(11:30, 건강보험 강남지사)
1. 2019.04.06(토) 250,000원 청구 ==> 2019.07.05(금) 218,000원 환급 완료 @@@
2. 2019.07.02(수) 218,000원 청구 ==> 2019.07.05(금) 196,200원 환급 완료 @@@
==> 우편 접수하는 방법도 있다고 함
==============================================================================================================

- 1천권 독서법, 전안나 작가 강의 
 https://youtu.be/IwOfeRBkssk
 
- 주의! 누구나 할 수 있는 ‘책을 통째로 외우는 방법' | 수험생의 성지 1편 
https://www.youtube.com/watch?v=y4fyL8vAdbs&feature=youtu.be
 
- 누구나 할 수 있는 엄청난 기억력
https://www.youtube.com/watch?v=g0nVsgD8pvY&feature=youtu.be

- 기억력스포츠 강의 1강 - 정계원의 기억법 기초 (기억의 궁전, 기억력대회, 기억력 감퇴)
https://www.youtube.com/watch?v=jL57jI0BLEo&feature=youtu.be

- 조던 피터슨 #공부 조언 #완벽한 공부법
https://www.youtube.com/watch?v=P2rpSiACoVQ&feature=youtu.be
==============================================================================================================
 
- LG 서비스 센터 AS 처리
16:00 퇴근(LG 노트북 메고 감)
16:05 도보(삼설제일빌딩 -> LG 서비스 센터 강남역점)
16:20 LG 서비스 센터 강남역점(서울시 강남구 역삼동 820-9 GLASS TOWER 글라스타워 16층) 도착
16:30 LG 노트북 HDD 케이블 인식 못하는 문제 AS 요청 ==> AS 기사가 노트북 연결 케이블(파란색)이 제대로 장착 안되서 인식 못 했다고 함
16:40 종료
17:00 강남역 --> 대림역
17:40 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.05(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- 본사 대기[★] 
- Windows 10 백업, 복원
1. [컴퓨터] 윈도우 백업 & 복구 (Windows10) - Game Developer W ==> https://mrw0119.tistory.com/87
2. 윈도 10을 안전하게 백업하고 복원하는 방법(Windows 10, How to Backup and Restore)
https://www.youtube.com/watch?v=YauxTZ6fnJ0&t=50s

1. 백업
 1) 시스템 이미지 만들기 --> 복구용
2. 복원
---------------------------------------------------------------------------------------------------------------------------

- 윈도우10 시스템 이미지 백업 만들기 (언제든 지금 상태로 복원할 수 있도록 백업 
1. 제어판 > 시스템 및 보안 > 백업 및 복원 ==> 백업을 저장할 위치 선택
https://m.blog.naver.com/unlimited_pc/220728310458
https://blog.naver.com/unlimited_pc/220728341722

- 윈도우즈10에서 시스템 이미지 만들기(백업) USB 사용 에러 발생
1. 현상: USB 메모리를 선택하면 "드라이브가 올바른 백업위치가 아닙니다"고 나타납니다.
2. 원인: USB는 제조사의 제조 방식에 따라 단순히 이동식 미디어로 인식되는 장치와, 대용량 장치로 인식되는 장치로 나뉘며, 이는 USB의 실제 
용량과 상관없이, 각 장치를 시스템에서 인식하는 방식에 따라서 달라지는 것입니다. 이 방식에 따라 단순 이동식 미디어로 인식되는 USB들은
언급하신 메세지가 발생할 수 있습니다.
3. 조치: USB가 아니라 외장하드에 저장할 것
https://answers.microsoft.com/ko-kr/windows/forum/all/%EC%9C%88%EB%8F%84%EC%9A%B0%EC%A6%8810%EC%9D%84/eca71d82-2e62-4009-891a-4b08d995a2fa
==============================================================================================================
 
- 예스병원 진료(어깨 수술 후)
15:00 퇴근
15:15 선릉역.선정릉정문 정류장
15:20 6411번 버스 탑승
16:40 구로4동 우체국.고대 구로 병원 정문 정류장 하차
16:50 예스병원 4층 접수
17:00 어깨 실밥 풀기(우성종 원장) ==> 어깨 보조기 2주 더 착용하라고 함, 3개월 동안 자가운동 열심히 하라고 함.
17:30 물리치료(전기 치료, 열 치료)
17:55 종료 ==> 어깨 보조기 다시 착용(안전판을 꺼꾸로 착용 했음) 
18:10 귀가
19:00 석식 
19:30 도림천로 도보 ==> 어깨 보조기 착용 안함(문제 없음)
21:00 어깨 자가운동(30분)
21:30 종료
21:40 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
07:00 의료 실비 자료 스캔 
08:00 종료
08:05 조식
08:15 어깨 자가운동(30분)
08:45 종료
08:05 조식
09:00 도림천로 도보
10:00 귀가 
10:20 집출발(자전거: 어깨 보조기 착용 안함) 
10:10 조원 도서관 ==> <<48분 기적의 독서법>>, 김병완 저( 미다스북스,  2013.05.10) 대출
11:30 귀가  
12:00 중식
12:30 도림천로 도보
13:00 귀가
14:10 집출발(수종, 도보)
14:30 대림역 정류장(6511번 버스)
15:10 서울대 정류장
15:20 관악 도서관(1층: 수종 혼자서 책 봄)
16:00 관악 도서관(3층: 소설 구경)
16:20 종료
16:30 서울대 정류장(6511번 버스)
17:30 대림역 정류장
17:40 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종
18:00 종료
18:10 구로리 공원(수종)
19:20 종료 
19:30 귀가
21:15 어깨 자가운동(30분)
21:50 취침
==============================================================================================================

- 크롬에서 펌방지 해제
1. 구글 크롬으로 해당 페이지 접속
2. 해당 페이지 내에서 F12 키를 눌러 주세요.
3. Setting 메뉴에서 Debugger > Disable Javascript 항목 체크(맨 아래로 이동하여 찾음)
4. 펌 방지 해제 된 것을 볼 수 있습니다.
==> https://klahan.tistory.com/67
--------------------------------------------------------------------------------------------------------------

==> 크롬 Pig Toolbox 대체 
0. https://bclivinginformation.tistory.com/31
1. Right-Click enabler 
2. crxMouse Chrome™ 제스처 
3. 구글 크롬에서 오른쪽 마우스 클릭 제한 해제 [Allow Right click 확장]  ==> 참조
==============================================================================================================

- IE 펌방지 해제
1. IE > 도구(T) > 인터넷 옵션(D) > 인터넷 옵션(새창)  
==> 보안(Tab) > 사용자 지정 수준(C) > 보안 설정(새창)
==> 설정 > 스크립팅 > Active 스크림팅(사용 --> 사용 안함): 체크 ==> 확인: 클릭
==> https://www.youtube.com/watch?v=iUQoA6h9cAs
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.07(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 

- 주말2
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청 
08:10 조식
09:00 도림천로 도보
09:40 귀가
10:00 어깨 자가운동(30분)
10:20 야구(아파트 놀이터, 수종) 
11:20 귀가
12:00 중식
13:00 도림천로 도보
13:50 귀가 
14:30 루옌(수종) 놀러감 
15:00 녹두꽃 11회(21, 22회), 12회(23, 24회), 13회25, 26회) 시청 ==> 14회 예정
18:00 종료 
18:00 석식
18:30 도림천로 도보
19:0 엘마트  ==> 푸르밀 검은콩 우유 900ml(우유, 2통): 수종
19:30 귀가
19:50 독서 <<48분 기적의 독서법>> 완독
20:00 인터넷 서핑
21:00 루옌, 수종 귀가
21:30 어깨 자가운동(30분)
21:50 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.08(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 어깨 보조기 착용 안하고 출근

- 본사 대기[★] 
 - 윈도우10 시스템 이미지 백업 만들기 (언제든 지금 상태로 복원할 수 있도록 백업 
1. 제어판 > 시스템 및 보안 > 백업 및 복원 ==> 백업을 저장할 위치 선택56	  
https://m.blog.naver.com/unlimited_pc/220728310458
https://blog.naver.com/unlimited_pc/220728341722

- 윈도우즈10에서 시스템 이미지 만들기(백업) USB 사용 에러 발생
1. 현상: USB 메모리를 선택하면 "이 드라이브에 백업을 저장할 공간이 충분하지 않습니다." 고 나타납니다.
 1) 엠지텍 외장 HD 2.5(80G) HDD 사용함
2. 원인: 이 드라이브에 백업을 저장할 공간이 부족합니다 사용 가능한 공간 94.55GB 있어야 합니다. ==> 1TB 이상 외장하드 사용 해야 됨
==> NTFS로 포맷되어 있어야 하며, USB에는 백업이 불가능
==============================================================================================================

- 원키 고스트 사용 방법
A. 프로그램 다운로드
1. OneKey_V14.5.8.215fix_Kor.zip 파일 다운로드 
 1) OneKeyGhost(원키고스트) 사용하여 원도우 백업/복원 하기 ==> https://innks.github.io/2017/05/16/IT/OneKeyGhost/
-----------------------------------------------------------------------------------------------------------------------

B. 백업
1. OneKey_V14.5.8.215fix_Kor.zip 파일 압축을 풀고 OneKey_V14.5.8.215fix_Kor 폴더에서 OneKeyGhost.exe 파일 더블 클릭==> 실행
2. OneKey_V14.5.8.215 fix(새창)
 1) 백업(B) 라디오 박스: 체크, Ghost64: 선택
 1) GHO/WIM/ISO 이미지 파일: D:\GHOST\Win10_LG 15UD470-GX50K0_190708.GHO		--> 파일명(직접 입력) @@@
   ==> 저장(S): 클릭
   ==> 외장 메모리는 불가능 @@@
 2) 프로그램을 실행해 주고, 우측 위에 설치(I)를 체크
 3) 팝업이 뜨는데, 아무것도 건드리지 않고 확인버튼 클릭하면 됩니다. 
 4) 실행버튼 클릭.
3. 예 클릭. 자동으로 재부팅될텐데, 아래의 고스트화면 나올때까지 아무것도 안건드리셔도 됩니다. 
4. 고스트로 넘어와서 자동 백업되는 과정이고, 컴퓨터 성능과 용량에 따라 오래걸릴수도 있습니다.
 1) 가만히 놔두면 끝나고 재부팅해서 윈도우로 부팅됩니다. 백업 완료.
 ==> Win10_LG 15UD470-GX50K0_190708.GHO 파일이 생성됨
 
- 윈도우 설치가 안돼요, GPT 파티션 오류 해결법, 윈도우10, 윈도우7, 윈도우8, GPT, 컴퓨터무료배우기
https://www.youtube.com/watch?v=ow8sRNfcYOo
==============================================================================================================
 
- Star UML
1. StarUML Setup 3.1.0.exe 설치 ==> https://sourceforge.net/projects/staruml/
==============================================================================================================

- 노트북 DDR4 8G 교환[17시, 용산]
15:20 퇴근
15:30 서울상록회관.한국기술센터 정류장
15:30 740번 버스 탑승
17:00 용산꿈나무종합타운.보건분소 정류장 하차
17:01 선인프라자 21동까지 도보로 이동(16분, 1.1km 이동)
17:20 피씨사자 도착(선인상가 21동 4층 75, 76호)
17:22 삼성전자 노트북 DDR4 PC4-21300 [8G]로 교환(천 5백원 추가 지불)
17:30 종료
17:40 신용산역 정류장 
17:41 507번 버스 탑승
18:00 대동초등학교 정류장 하차
18:10 영웅 태권도 도착(3층): 수종이 데러고 옴
18:20 귀가
19:00 석식 
19:30 도림천로 도보 
20:10 귀가
20:30 수종이 눈높이 한글 공부 지도
21:10 종료
21:30 어깨 자가운동(30분)
22:00 종료
22:10 취침(수종)
==============================================================================================================
 
- 노트북 DDR4 8G 교환[17시, 용산]
1. 서울시 용산구 선인상가 21동 4층 75, 76호, 피씨사자 02-2120-2322, G마켓
 1) 교환품 ==> 삼성전자 노트북 DDR4 PC4-21300 [8G], 노트북용(SO-DIMM), 가격:32,470원
http://www.enuri.com/detail.jsp?modelno=30149852&condiDelivery=N
 2) 이전 주문품  ==> 삼성전자 DDR4 PC4-21300 [대량구매,8G], 데스크탑용(DIMM)|, 가격: 32,300원
http://www.enuri.com/detail.jsp?modelno=34769813&condiDelivery=N 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.09(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 12:00 웬티하랑 통화, 13시: 김금숙 매니저와 통화(루옌 베트남 1년 만에 가는 문제 상의)

- 본사 대기[★]  
- ghost 부팅 USB 만들기(백업 처리, USB(샌디스크 Ultra Z48 USB3.0 128G) 사용)
1. WIN10_LG 15UD470-GX50K0_190709.GHO 생성[용량: 47.3GB]  
2. WIN10_GIGABYTE.GHO 생성[용량: 57.8GB]  
--------------------------------------------------------------------------------------------------------------

- [노씨아저씨] ♥ghost 부팅 usb 만들기 완성♥
https://www.youtube.com/watch?v=fm8jm-ZQUlc
 
- [노씨아저씨, 백업] ghost 이미지 파일 저장 완성
https://www.youtube.com/watch?v=you1KPJ3VN4

- [노씨아저씨, 복원] ghost 이미지 파일 불러오기 완성
https://www.youtube.com/watch?v=FXkNrURjG78
--------------------------------------------------------------------------------------------------------------

- UltraISO for Windows 다운로드	
https://ko.softonic.com/download/ultraiso/windows/post-download 
==============================================================================================================

- [Ghost] 고스트 부팅 USB 만들기
http://bictoselfdev.blogspot.com/2018/02/ghost-usb.html

- 고스트 부팅 USB 만들기 - It's Real!
https://timereal.tistory.com/195
==============================================================================================================

20:00 TV 녹두꽃 14회(27, 28회) 시청 ==> 15회 예정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.10(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 05:43 인슐린 약 교체(241U, 27U 남음), 체중: 71, 4kg, 도서상호대차 요청(2권), 허대리 철수(17시)., 장마비(18시)

- 본사 대기[★]   
- ghost 부팅 USB로 복원 처리 ==> 완료 @@@
1. GIGABYTE 노트북에서 WIN10_GIGABYTE.GHO를 사용하여 복원 시도
 1) GIGABYTE 노트북에서 Beyond, Daum Cleaner SW 삭제 후 WIN10_GIGABYTE.GHO 파일로 복원 시도
 2) 백업한 시점[2019.07.09] 이전으로 복원 됨 ==> Beyond, Daum Cleaner SW 설치되어 있음: 성공
==============================================================================================================

- 실비 보험 청구서 작성(회사, 집) ==> 완료 @@@
접수번호 : 201907J9509
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병
청구내용: 
2019.01.05 영등포구 도림천 운동기구에서 운동을 규칙적으로 하다가 어깨에 통증이 와서 계속 참고 있다가 너무 통증이 심해져서   
2019.05.11 병원에 가서 진단을 받으니 어깨의 유착성 피막염(M75.0), 어깨의 충돌 증후군(M75.4), 회전근개 파열이 발생하여 수술을 하라고 함.
==> 외래 치료(5.11 ~ 6.15) 진료비 세부 내역서 추가 요청(한화손해보험에서 전화 옴) --> 예스병원에 전화해서  진료비 세부 내역서 회사 팩스로 
받아서 핸드폰으로 찍어서 필요서류 추가를 함
---------------------------------------------------------------------------------------------------------------------------------
 
접수번호 : 201907J9560
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병
청구내용: 
2019.06.20 병원 입원 후 어깨 수술을 함
==============================================================================================================
 
- 의료 실비 등록 방법
0. 한화손해보험 질병 보험금청구 ==> htps://goo.gl/n8BnG7
1. 로그인 방법
로그인 > 카카오인증으로 로그인 > 카카오인증(새창) ==> 주민번호, 폰번호 입력 > 카톡에서 인증 확인: 클릭
2. 상해/질병보험금청구 -> 보험금청구신청-> 간편본인인증 -> 상해/질병보험금청구 -> 보험금청구신청- > 피보험자선택 -> 
조회 -> 신규접수 -> 개인정보동의 -> 인적사항+ 청구유형 + 사고일시 입력후 청구가능계약 조회
-> 청구내용입력+ 계좌번호 입력후 다음 클릭 -> 파일추가 클릭 후 갤러리에 저장된 서류를 첨부하시거나 카메라로 촬영하신 후  
등록버튼을 클릭 하시면 됩니다.
==============================================================================================================

- 카카오 페이  
1. 카카오페이 인증서(카카오 인증) ==> 인증 비밀번호: s*p***16*1@
2. 카카오 페이 인증서 재발급
 1) 핸드폰 > 카카오톡 > 더보기 > Pay: 이미지 클릭 > 인증 > 인증서 발급하기: 클릭 : 인증서 발급(재발급)
3. 카카오 인증 비밀번호: 52**0*
==============================================================================================================
 
- 실비보험청구, 귀찮다면 이렇게 
https://m.post.naver.com/viewer/postView.nhn?volumeNo=14000416&memberNo=34561115&vType=VERTICAL 
==============================================================================================================
  
- 질병분류기호 3
M75		어깨 병터(Shoulder lesions)
M75.0	어깨의 유착성 피막염(Adhesive capsulitis of shoulder) 
M75.4	어깨의 충돌 증후군(Impingement syndrome of shoulder) 
==============================================================================================================

- LG 유플러스 기가와이파이 공유기, GAPD-7100 설정 변경(대림동 문영 아파트 180호에 설치된 와이파이)
https://m.blog.naver.com/nicefleet/221133114813

1. AP 설정 웹 페이지: http://192.168.219.1 접속
 1) 위쪽에 적어둔 주소로 들어가면 저런 창이 나오는데 공유기 옆쪽에 있는 버튼을 눌러주시면 됩니다

2. admin 암호와 보안코드(?) 입력
 1) 공유기 admin 패스워드와 보안코드(?)를 입력하면 되는데 admin 암호는 공유기에 적혀 있습니다
  가. 무선랜 2.4G: U+NetA2BF
  나. 무선랜 5G: U+NetA2BF_5G
  다. 무선랜 암호: 0137001437
==> LGU_A2BF --> 18:C5:01:37:A2:BF(MAC 주소)

3. 네트워크 설정을 클릭
 1) 위쪽에 있는 '네트워크 설정'에 들어가셔도 되고 무선 네트워크에 있는 '설정 바로 가기'를 눌러도 됩니다
(아래쪽에서 들어가셔도 됩니다)

4. 와이파이 이름과 비밀번호 변경 (完)
 1) 여기서 와이파이 이름과 비밀번호를 바꿔주시면 됩니다. (네트워크 이름, 보안 암호를 바꾸어 주시면 됩니다) 
  가. U+NetA2BF_5G ==> 00. U+NetA2BF_5G_1806
==============================================================================================================

21:20 TV 녹두꽃 15회(29, 30회), 16회(31, 32회) 시청 ==> 17회(33, 34회) 시청함, 18회(35, 36회) 시청 예정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.11(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  장마비(7시, 조금 옴)

- 본사 대기[★]   
- 2017년 귀속(2018년 01월) 연말정산 경정 청구
1. 아버지 장애인 공제 추가 신고할 것(7만원 환급 받는다고 함) ==> 홈텍스에서 민원 신청할 것 
2. 경정청구: 납세의무자가 보정기간(3개월)이 경과하여 과다납부한 세액을 바로잡을 것을 요청하는 행위이며 납세신고를 한 날부터 5년 이내에 
대통령령이 정하는 바에 따라 세관장에게 청구하여야 함.
==> 2017년 근로소득 ==> 귀하의 종합소득세 신고내용이 존재합니다(근로소득 경정청구 대상 아님). 종합소득세 '일반신고서 또는 단일소득' 
경정청구를 이용하여 주시기 바랍니다. 
3. 2017년 귀속(2018년 01월) 종합소득세 신고(5월)할 때 아버지 장애인 공제 추가 처리함 ==> 경정 청구 취소할 것
 1) 매출액: 4,800,000원[ 지아이데이타 2월 급여],  환금액: 158,400원 ==> 환급 받음
2017년 2월 ==> 한 달간 지아이데이타에서 프리랜서로 활동[종합소득세 대상]
2017년 3월 ==> 지아이데이타 재입사[근로소득세 대상]
--------------------------------------------------------------------------------------------------------------

- 연말정산 누락분 경정청구 기간과 방법 ==> http://moraeb.com/221473864621
귀하의 종합소득세 신고내용이 존재합니다(근로소득 경정청구 대상 아님). 종합소득세 '일반신고서 또는 단일소득' 경정청구를 이용하여 주시기 바랍니다.	 
==> 근로소득, 종합소득 2개가 존재함
==============================================================================================================

- 실비 보험 청구서 처리 완료 
접수번호 : 201907J9509  ==> 완료 @@@ 
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병 
청구내용: 
2019.01.05 영등포구 도림천 운동기구에서 운동을 규칙적으로 하다가 어깨에 통증이 와서 계속 참고 있다가 너무 통증이 심해져서 
2019.05.11 병원에 가서 진단을 받으니 어깨의 유착성 피막염(M75.0), 어깨의 충돌 증후군(M75.4), 회전근개 파열이 발생하여 수술을 하라고 함 
진료비 세부 내역서:
총액: 1,018,030원
본인부담금: 47,210원, 공단부담금: 70,820원, 비급여: 900,000원  
==> 실제 지급 금액: 250,000원 입금됨
------------------------------------------------------------------------------------------------------------------------------
 
접수번호 : 201907J9560 ==> 완료 @@@ 
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병
청구내용: 
2019.06.20 병원 입원 후 어깨 수술을 함
진료비 세부 내역서:
총액: 3,324,200원
본인부담금: 450,360원, 공단부담금: 1,435,030원, 비급여: 1,411,200원 --> 1,889,170원[병원비(오른쪽 어깨 수술, 입원비)]
==> 실제 지급 금액: 863,973원 입금됨
==> 실제 지급 금액: 1,056,580원 입금됨 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.12(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 17시: 구부장 본사 방문

- 본사 대기[★] 
- HDS 소스 업데이트 ==> 완료 @@@ 
1. 03. Service 재 활용성, 14. 페이징 처리 소스 업데이트 처리
==============================================================================================================

- 모바일팝(GS25 편의점) 설치
1. https://www.popcard.co.kr, tamario, h*수*16*1@
2. 잔액충전 > 계좌이체 간편충전 > 본인인증(처음 사용시)
==============================================================================================================
 
- 신한은행 모바일 통장 개설
1. 계좌명: 제축예금, 계좌번호: 110 506 324105, 예금주: 진태만 
==> 계좌 이체에 사용할 것
==============================================================================================================

- 어린이 교통카드 구입 예정[GS25 편의점에서)
1. 어린이교통카드 편의점에서 등록했어요 ==> https://beryun214.blog.me/220710898952
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.13(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청
08:00 종료
08:05 조식  
09:00 도림천로 도보  
09:40 귀가 
10:15 어깨 자가운동(30분)
10:20 집출발(자전거: 어깨 보조기 착용 안함): 수종
10:30 조원 도서관 방문
		<<48분 기적의 독서법>>, 김병완 저(미다스북스,  2013.05.10) 반납
		<<부동산 버블 마지막 기회를 잡아라>>, 조현철 저(매일경제신문사, 2019.02.25)[대여기간: 07.13(토) ~ 08.03(토)] 대출
		<<칭기즈칸의 위대한 장군, 수부타이>>, 리처드 A.가브리엘 저(글항아리, 2014.09.23)[대여기간: 07.13(토) ~ 08.03(토)] 대출
11:00 종료
11:20 이마트 구로점 방문  ==> 수종 수영복(2만 5천원0, 구경(9,800원) 구입
12:00 종료
12:20 귀가 
12:30 중식
13:00 도림천로 도보
13:40 귀가
13:40 어깨 자가운동(30분)
14:10 집출발(자전거, 수종)
14:30 대림역 정류장(6511번 버스) 
15:20 서울대 정류장 하차
15:40 관악산 어린이 물놀이장 도착(7월 18일 개장)
15:50 화장실(수종 수영복 갈아 입음)
16:00 수종 물놀이
16:50 종료
17:10 서울대 정류장(6511번 버스)
18:30 대림역 정류장
18:40 석식(비빕밥, 치즈돈가스, 김밥천국 남구로점): 수종
19:00 종료
19:10 구로리 공원(수종)
19:40 종료 
20:00 귀가
21:15 어깨 자가운동(30분) 
21:50 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.14(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 체중: 72.8kg

- 주말2
06:00 기상
06:10 인터넷 서핑 ==> 야구 시청 
08:10 조식
09:00 도림천로 도보
09:40 귀가
10:00 어깨 자가운동(30분)
11:00 휴식
12:00 중식
13:00 도림천로 도보
13:50 귀가 
14:00 인터넷 서핑 
14:39 수종이 눈높이 한글 공부 지도
15:15 루옌(수종) 물놀이감 
15:20 인터넷 서핑
16:20 TV 시청
17:30 종료
18:00 석식
18:30 도림천로 도보 
19:30 귀가 
20:00 인터넷 서핑
21:00 루옌, 수종 귀가
21:30 어깨 자가운동(30분)
21:50 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.15(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 다나 혈당지 모두 사용(05:10), 19:20 도림천로 도보 중 소나기(마트에 우산 가지고 가서 루옌 데리고 옴)

- 본사 대기[★]  
- 2018.04.16_현대제철 apqms_OffLine_11.20(Nexacro) 셋팅 ==> 완료 @@@
 A. Nexacro 환경 설정(현대제철 APQMS 바로가기 바탕 화면에 셋팅)
 1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창) 
  1) Environment > General Tab
   가. Working Folder: D:\01. TAMA_DATA\03. TAMA Project Source\2018.04.16_현대제철 apqms_OffLine_11.20	 ==> OK: 클릭
  2) Environment > Build Tab
  가. General Path[결과물]: D:\01. TAMA_DATA\03. TAMA Project Source\2017.05.15_HDO_OffLin\WebContent
  나. Base Lib Path: D:\01. TAMA_DATA\03. TAMA Project Source\2018.04.16_현대제철 apqms_OffLine_11.20\nexacro14lib
  ===> Generate Applicatin: 클릭   
nexacro generator (10652): Start Generate Project : APQMS
nexacro generator (10652): [Warning] Not exist default layout : <Div>
nexacro generator (10652): ====== Generate Project [APQMS] : Success 334, Fail 0, Copy 258 ======
nexacro generator (10652): Total Time : 16.859 sec
 
  ===> 실행(Ctrl + F5: 누름)
			[/APQMS.xadl] ==> [######################### [01. 현대제철 AP 품질관리 시스템 Main Frame 
			Start(현대제철 apqms_OffLine_11.20)] #########################]  
uxs (14320): UD 10:5:30:937  [/APQMS.xadl][application_onload()]==> [최초 로딩][TEST_01_3][T: 현대제철 AP QMS Prj]
uxs (14320): UD 10:5:30:938  [/APQMS.xadl][afn_setXupServer()]==> [TEST_04][접속URL 정보(HTML5 일때)]file://D:/01. 
TAMA_DATA/03. TAMA Project Source/2017.05.15_HDO_OffLin/WebContent/APQMS/APQMS.xadl.js
[gv_server_url]http://localhost/[svcurl]http://localhost/
uxs (14320): UD 10:5:30:941  [/APQMS.xadl][application_onload()]==> [최초 로딩] [TEST_02] [av_homeFrame.formurl]frameNx70::frmHome.xfdl
==============================================================================================================

-2017.05.15_HDO_OffLine(Nexacro) 셋팅 ==> 완료 @@@
 A. Nexacro 환경 설정
 1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창) 
  1) Environment > General Tab
   가. Working Folder: D:\01. TAMA_DATA\03. TAMA Project Source\2017.05.15_HDO_OffLine	 ==> OK: 클릭
  2) Environment > Build Tab
  가. General Path[결과물]: D:\01. TAMA_DATA\03. TAMA Project Source\2017.05.15_HDO_OffLin\WebContent
  나. Base Lib Path: D:\01. TAMA_DATA\03. TAMA Project Source\2017.05.15_HDO_OffLine\nexacro14lib
  ===> Generate Applicatin: 클릭   
  nexacro generator (9480): Start Generate Project : xui_hdo
nexacro generator (9480): ====== Generate Project [xui_hdo] : Success 100, Fail 0, Copy 240 ======
nexacro generator (9480): Total Time : 5.313 sec
 
  ===> 실행(Ctrl + F5: 누름)
uxs (14428): UD 9:59:53:660  [/frmLogin.xfdl] [fn_onload()] ==> [application.gv_serverUrl]http://localhost:8080/
uxs (14428): UD 9:59:53:660  [/frmLogin.xfdl] [fn_onload()] ==> [application.gv_serverUrl]A
uxs (14428): UD 9:59:53:734  gfn_cookieInit : http://localhost:8080/
uxs (14428): UD 9:59:54:413  frmBase gv_globalId >> null
==============================================================================================================

- MariaDB 설치 ==> 완료 @@@
0. Windows 10에 MariaDB 설치하기 ==> https://offbyone.tistory.com/199
1. Windows용 MariaDB 다운로드 ==> https://downloads.mariadb.org/
 1) mariadb-10.4.6-winx64.msi 파일 다운로드
2. MariaDB 설치
 1) mariadb-10.4.6-winx64.msi 파일: 더블 클릭 
 2) User settings(새창)
  가. New root password: asas1212@
  나. Use UTF-8: 체크 ==> 
 3) Database settings(새창)
  가. Service Name: MariaDB ==> "Install as service": 체크[MySQL에서 MariaDB로 변경]
  나. TCP port: 3306 입력   ==> 설치하기 
 5) 설치가 완료되었습니다. 
 6) 윈도우즈 시작버튼을 눌러 새로설치된 MariaDB 10.2 프로그램 그룹을 찾습니다. MySQL Client 를 실행합니다. 
 7) root 비밀번호를 입력하고, "show databases;"를 입력하여 기본 설치된 데이터베이스를 확인해봅니다.
 Enter password: *********		---> asas1212@ 입력
Welcome to the MariaDB monitor.  Commands end with ; or \g.
Your MariaDB connection id is 8
Server version: 10.4.6-MariaDB mariadb.org binary distribution

Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MariaDB [(none)]> SHOW DATABASES;
+--------------------+
| Database           |
+--------------------+
| information_schema |
| mysql              |
| performance_schema |
| test               |
+--------------------+
4 rows in set (0.001 sec)

MariaDB [(none)]>   
--------------------------------------------------------------------------------------------------
 
- 01. MariaDB Root 연결
1. Driver Name: org.mariadb.jdbc.Driver
 1) root pwd: asas1212@, port: 3306 	 --> 이전: 1212 @@@
 2) Use UTF8 as default server's character set: 체크 
 3) Install as service ==> Service Name: MySQL
 4) nable networking ==> TCP port: 3306
============================================================================================================= 

- DATABASE 생성, 권한 주기 @@@
1. 윈도우 > 검색 > MySQL Client (MariaDB 10.4 (x64)): 클릭 > MySQL Client (MariaDB 10.4 (x64))(새창(
Enter password: *********     ----> 비밀번호 입력(asas1212@)
Welcome to the MariaDB monitor.  Commands end with ; or \g.
Your MariaDB connection id is 34
Server version: 10.4.6-MariaDB mariadb.org binary distribution

Copyright (c) 2000, 2018, Oracle, MariaDB Corporation Ab and others.

Type 'help;' or '\h' for help. Type '\c' to clear the current input statement.

MariaDB [(none)]>  CREATE DATABASE QMSMGR;			-- 1. DATABASE 생성 @@@

MariaDB [(none)]> SHOW DATABASES;							-- 2. DATABASE 보기 @@@

MariaDB [(none)]> CREATE USER 'apqms'@'%' IDENTIFIED BY 'apqms12';   			-- 3. user 계정 생성  @@@
-- 원격 접속도 필요하다면 아래와 같이 localhost 부분을 '%'으로 변경하시면 됩니다.

MariaDB [(none)]> GRANT ALL PRIVILEGES ON QMSMGR.* to 'apqms'@'%';  		-- 4. user 권한 주기(apqms에 대한 권한)  @@@

MariaDB [(none)]> FLUSH PRIVILEGES;  		-- 5. 설정한 권한 적용 @@@

MariaDB [(none)]> SHOW GRANTS FOR 'apqms'@'%'; 											-- 6. 권한 확인(apqms에 대한 권한)  @@@  
+------------------------------------------------------------------------------------------------------+
| Grants for apqms@%                                                                                   |
+------------------------------------------------------------------------------------------------------+
| GRANT USAGE ON *.* TO 'apqms'@'%' IDENTIFIED BY PASSWORD '*440436EB9897AB3F8C6E8CCEB5E8C1107AFB9909' |
| GRANT ALL PRIVILEGES ON `qmsmgr`.* TO 'apqms'@'%'                                                    |
+------------------------------------------------------------------------------------------------------+
2 rows in set (0.000 sec)
--------------------------------------------------------------// COMMIT, ROLLBACK 
--=========================================================================================================

- dbeaver 셋팅(maria_db 세팅) ==> 완료 @@@
01. QMSMGR[현대제철Prj_Main] ==> 실제 사용하는 DB
1) DB: QMSMGR, username: apqms, username: apqms12  
==> 작업관리자(새창) >> 서비스(Tab)에서 MariaDB(mysqld.exe) 마우스 우 클릭: 시작(S): 클릭 --> 상태: 시작됨(최초 자동 시작됨)

10. QMSMGR[현대제철Prj_Root]
1) DB: MySQL, username: root, username: asas1212@
==> 작업관리자(새창) >> 서비스(Tab)에서 MariaDB(mysqld.exe) 마우스 우 클릭: 시작(S): 클릭 --> 상태: 시작됨(최초 자동 시작됨)

51. WS5_SAMPLE[maria_db.bat 실행] ==> 완료 @@@
1) DB: W_CRM, username: wcrm, username: wcrm1234
==> 작업관리자(새창) >> 서비스(Tab)에서 MariaDB(mysqld.exe) 마우스 우 클릭: 중지(T): 클릭 --> 상태: 중지됨
------------------------------------------------------------------------------------------------------------------------------
 
- 윈도우(W) > 설정 > 환경 설정(P) (새창) ==> 완료 @@@
1. 데이타베이스 > 편집기 > SQL 편집기 > 스크립트 > (새창)
==> Scripts title pattern: ${fileName}로 변/경 --> [이전: <${connectionName}> ${fileName}]
==============================================================================================================	

- WS5_SAMPLE 셋팅 ==> 완료 @@@
1. Websquere 샘플 프로그램 테스트
 1) WS5_SAMPLE 실행[elcipser, 바탕 화면에서], maria_db.bat 실행[바탕 화면에서]
==============================================================================================================	

- 01. MariaDB Dump export & import 방법 ==> 완료 @@@
A. export(백업) 
 1. 실행(R) > 열기(O): cmd --> 확인: 클릭 > 명령 프롬프트(새창)
 Microsoft Windows [Version 10.0.18362.239]
(c) 2019 Microsoft Corporation. All rights reserved.

C:\Users\tamar>  cd C:\Program Files\MariaDB 10.3\bin 
C:\Program Files\MariaDB 10.3\bin> mysqldump -uapqms -papqms12 -A > dump-QMSMGR-201901032128.sql
==>  C:\Program Files\MariaDB 10.3\bin\ dump-QMSMGR-201901032128.sql 파일이 생성됨. @@@ 
------------------------------------------------------------------------------------------------

B. import(복구)
 1. 실행(R) > 열기(O): cmd --> 확인: 클릭 > 명령 프롬프트(새창)
Microsoft Windows [Version 10.0.18362.239]
(c) 2019 Microsoft Corporation. All rights reserved.

C:\Users\tamar> cd C:\Program Files\MariaDB 10.4\bin 
C:\Program Files\MariaDB 10.4\bin> mysql -uroot -pasas1212@ QMSMGR < dump-QMSMGR-201901032128.sql			  -- root @@@
-- 복구할 파일(/dump-QMSMGR-201901032128.sql)을 해당 폴더(C:\Program Files\MariaDB 10.4\bin)에 복사해 둘 것 @@@

C:\Program Files\MariaDB 10.4\bin> 					==> 성공적으로 백업됨 @@@
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2019.07.16(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 본사 대기[★] 
- HP Deskjet 2540 복합기 프린터 설치 방법 ==> 설치 보류 @@@
1. HP Deskjet 2540 seriesHP 고객 지원 - 소프트웨어 및 드라이버 다운로드
==> https://support.hp.com/kr-ko/drivers/selfservice/closure/hp-deskjet-2540-all-in-one-printer-series/5295960\
 1) HP 데스크젯 2540 및 2545 프린터 - 무선 프린터 설정(Windows)
 ==> https://support.hp.com/kr-ko/document/c03899943
 1) HP-Print-93-Deskject 2540 series
 2) 설치 보류: 무선 연결이 안됨(와이파이 문제인 걸로 추정됨
==============================================================================================================	

- C#으로 살아남기 강의
2강. C# 프로그래밍의 기본 구조 ==> 다시 정리
3강. 데이터형 
==============================================================================================================	

- /Program.cs 파일에서 
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConsoleApp1
{
    class Program
    {
		// 2강. C# 프로그래밍의 기본 구조[C#으로 살아남기 강의] @@@
       static void Main(string[] args)
        { 
            Console.WriteLine("");
            Console.WriteLine("@@@@@@@@@@@@@ // 2강 TEST  ===> // @@@@@@@@@@@@@");

            Console.WriteLine("Hello World!");      // 추가 @@@

            Console.WriteLine("{0} {1}", 3.14f, 12);        // 추가 @@@
            Console.WriteLine("{0} + {1} = {2}", 1, 2, 1 + 2);      // 추가 @@@
            Console.WriteLine("{0:C} {1:P} {0:X}", 123, 123.45);      // 추가 @@@ 
            Console.WriteLine("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@");
            Console.WriteLine("");
            Console.WriteLine("");
        }
    }
}

1.  위 내용 작성
2. 빌드(Ctrl + F5) ==> 디버거 콘솔(새창) 창이 뜸
 1) 출력 화면 ==> 출력 보기 선택(S): 빌드
1>------ 빌드 시작: 프로젝트: ConsoleApp1, 구성: Debug Any CPU ------
1>  ConsoleApp1 -> D:\01. TAMA_DATA\03. TAMA Project Source\C#\01. 소스\Solution1\ConsoleApp1\bin\Debug\ConsoleApp1.exe
========== 빌드: 성공 1, 실패 0, 최신 0, 생략 0 ==========

3. 출력 내용
Hello World!
3.14 12
1 + 2 = 3
\123 12,345.00% 7B   ---> \123[C: 통화], 12,345.00%[P: % 단위로 출력], 7B[X: 16진수 출력] @@@
계속하려면 아무 키나 누르십시오 . .  
==============================================================================================================
 
- C# 에러
1. 현상: 심각도	코드	설명	프로젝트	파일	줄	비표시 오류(Suppression) 상태
오류	CS0246	chr' 형식 또는 네임스페이스 이름을 찾을 수 없습니다. using 지시문 또는 어셈블리 참조가 있는지 확인하세요.	
2. 원인: Console.WriteLine("Mun = {0}, 문자 상수값 = {1}, 유니코드 문자 = {2}", (int)Mun, Num, (chr)Num);
3, 조치: (chr)Num ==> (char)Num로 변경
- /Program.cs 파일에서(/ConsoleApp2)
namespace ConsoleApp2
{
    class Program
    { 
		// 3-1 bool형 TEST @@@
		bool LoclaBoolVar = true;

		Console.WriteLine("");
		Console.WriteLine("@@@@@@@@@@@@@ // 3-1 bool형 TEST  ===> // @@@@@@@@@@@@@");
		Console.WriteLine("bool 변수값 = {0}, 지역 bool 변수값 = {1}", BoolVar, LoclaBoolVar);      
		//  3-1 bool형 TEST 추가 ==> 3-1 클래스의 정적 변수 bool형의 기본 값과 지역 bool 변수값 출력    
		Console.WriteLine("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@");

		// 3-2 char형 TEST @@@
		char cMun1 = '7';   // 문자1(유니코드 = 55)
		int iMun1 = cMun1;
		int iMun2 = iMun1 + 1;       
		char cMun2 = (char)iMun2;   // 문자2(유니코드 = 56)

		Console.WriteLine("");
		Console.WriteLine("@@@@@@@@@@@@@ // 3-2 char형 TEST  ===> // @@@@@@@@@@@@@");
		Console.WriteLine("문자1 = {0}, 문자1 유니코드 = {1}, 문자2 = {2}, 문자2 유니코드 = {3}", (char)cMun1, iMun1, (char)cMun2, iMun2);  
		Console.WriteLine("@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@");
		Console.WriteLine("");
		Console.WriteLine("");
        }
    }
} 
==============================================================================================================

- 01. MSDN
https://docs.microsoft.com/ko-kr/dotnet/api/system.console?view=netframework-4.8
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.17(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> GIGABYTE 노트북 정보 김유진 대리에게 반납

- 본사 대기[★] 
- C#으로 살아남기 강의
3강. 데이터형 
2. 변환
3. 표준 입력
4. 사용자 지정형
5. 값 형식과 참조 형식
==============================================================================================================

- SSD 256G 추천(김유진 대리에게 추천해줌)
1. 삼성전자 PM981 M.2 2280 NVMe (병행수입) [벌크,256G], 총 가격: 46,800원
http://www.enuri.com/detail.jsp?modelno=26655861&cate=0713&IsDeliverySum=N
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 052019.07.18(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 7시 출근시 소나기(선릉역에서 30분 도보 후 비 약간 맞으며 출근)

- 본사 대기[★] 
- C#으로 살아남기 강의
4강. C# 기본 문법
1. 연산자
 1) 단항 연산자
  2) 산술 연산자
2. 제어문  ==> chap04_02
3. 반복문
4. 점프문
5. 예외처리문
==============================================================================================================
 
- XMind(마인드맵) 설치
1. 마인드맵, XMIND 디지털 마인드맵으로 [구기모의 스마트워크 #55]
https://www.youtube.com/watch?v=JWUHTQXPdUo
==============================================================================================================

- Mind Meister(마인드맵) 
1 온라인 마인드맵 ==> https://www.mindmeister.com/ko
2. 온라인 마인드맵 - 마인드마이스터(MindMeister) 사용법 (한글자막)  ==> https://www.youtube.com/playlist?list=PLe0Fej9AMKkTTiK_0SOA1_nFO0JqWaJUS
==============================================================================================================

- 허민준 대리 방문(11시)
1.12시 허대리 오이사랑 식사, 13시 내가 커피 한 잔 사줌(다음주 식사하기로 함)
 1) 2019.02.20_DOOSANENGINE_CORE_PKG.7z 소스 파일[3.04GB]을 허대리 메일(silver139@naver.com)로 보내줌
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.18(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 7시 출근시 소나기(선릉역에서 30분 도보 후 비 약간 맞으며 출근)

- 본사 대기[★] 
- C#으로 살아남기 강의
4강. C# 기본 문법
1. 연산자
 1) 단항 연산자
  2) 산술 연산자
2. 제어문
3. 반복문
4. 점프문
5. 예외처리문
==============================================================================================================

- 오이사가 면담(16시)
1. 다음주 부터 한 달간 삼성 코닝 파견 지시 ==> 식대는 지원 해달라고 요청
==============================================================================================================

- 루옌과 이혼 문제 논의
1. 베트남 1년 만에 간다고 해서 내가 반대함(수종이 여권 재발급 안 해줌)
2. 이혼하고 수종이 혼자 키우겠다고 함 ==> 나는 이혼 못 해주고 이대로 살든지 아니면 그냥 혼자 나가라고 함
3. 큰 누나에게 전화 ==> 절대 이혼 해주지 말라고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.19(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 본사 대기[★] 
- C#으로 살아남기 강의
5강. 배열 
  1) 일차원 배열 
==============================================================================================================

- 삼성코닝 Prj 투입시 노트북 설치 목록 
1. Windows10 ==>  완료 @@@
2. Oracle11g Client
3. Filezilla ==>  완료 @@@
4. EditPlus ==>  완료 @@@
5. MS-Office ==>  완료 @@@
6. 7zip ==>  완료 @@@
7. 참고용 소스파일
8. Websquare에서 동적 그리드, 차트 고민
==============================================================================================================

- 실비 보험 청구서 처리 완료
1. 한화손해보험 콜센터에 전화하여 실비 지급액 상세 내역 요청 안 되었다고 항의 ==> 한화손배 실비 지급 담당자[T) 02-751-1273]
한테 전화와서 상세 내역을 알려줌
01. 어깨 수술 진료비 내역 																		
No.	접수번호	치료	본인부담금(병원)	공단부담금(병원)	비급여(병원)	총 본인 부담금(병원)	약 조제비약국)	총 본인 부담금	실비 지급액									
1	201907J9509	어깨 치료(병원)	 47,210 	 70,820 	 900,000 	 947,210 	 30,000 	 977,210 			 250,000 	   						
2	201907J9560	어깨 치료(입원, 수술)	 450,360 	 1,435,030 	 1,411,200 	 1,861,560 	   	 1,861,560 	 863,973 		 1,056,580 	 1,920,553 						
-----------------------------------------------------------------------------------------------------------------

02. 어깨 수술 진료비 계산 내역
05.11 예스병원 진료(통원) MRI 촬영 523,600원  ==> 통원 치료는 하루 25만원 이하로 제한됨
-----------------------------------------------------------------------------------------------------------------

03. 어깨 수술 진료비 계산 내역
No.	총 금액	제한 금액	실제 금액	횟수	총 금액	기타
1	 104,500 	 15,000 	 89,500 	 4 	 358,000원 	2019.05.15 ~ 6.15까지 치료 금액
-----------------------------------------------------------------------------------------------------------------

- 총정리
01. 실제 병원에 납입한 부담금: 1,889,170원, 02. 제외: 153,000원[서류(3천원), 영양제 제외(아연 보충제: 15만원)]
03. 총 지급액(입원, 수술): 1,736,170원,  04. 90% 제외 지급액(입원, 수술): 상해 90%만 보장해줌: 1,562,553원 
05. 실제 지급액(입원, 수술): 2,170,553원3원[04 + 05.11 예스병원  MRI 촬영비 25만원 + 358,000원 [2019.05.15 ~ 6.15까지 치료 금액])
06. 총 본인 부담금:  2,838,770원, 실비 지급액: 2,170,553 원  ==> 99. 총 본인 부담금과 실비 지급액 차익: 668,217원
------------------------------------------------------------------------------------------------------------------------------

접수번호 : 201907J9509  ==> 완료 @@@ 
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병 
청구내용: 
2019.01.05 영등포구 도림천 운동기구에서 운동을 규칙적으로 하다가 어깨에 통증이 와서 계속 참고 있다가 너무 통증이 심해져서 
2019.05.11 병원에 가서 진단을 받으니 어깨의 유착성 피막염(M75.0), 어깨의 충돌 증후군(M75.4), 회전근개 파열이 발생하여 수술을 하라고 함 
- 진료비 세부 내역서:
총액: 1,018,030원
본인부담금: 47,210원, 공단부담금: 70,820원, 비급여: 900,000원  
==> 실제 지급 금액: 250,000원 입금됨
------------------------------------------------------------------------------------------------------------------------------
 
접수번호 : 201907J9560 ==> 완료 @@@ 
접수일자 : 2019.07.10
피보험자 : 진태만
청구유형 : 질병
청구내용: 
2019.06.20 병원 입원 후 어깨 수술을 함
진료비 세부 내역서:
총액: 3,324,200원
본인부담금: 450,360원, 공단부담금: 1,435,030원, 비급여: 1,411,200원 --> 1,889,170원[병원비(오른쪽 어깨 수술, 입원비)]
==> 실제 지급 금액: 863,973원 입금됨
==> 실제 지급 금액: 1,056,580원 입금됨 
==============================================================================================================

- 노튼 고스트(백업)
1. WIN10_LG 15UD470-GX50K0_190719 폴더에 WIN10 LG_190719.GHO로 백업 파일 생성(용량: 3.99GB)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.20(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 7시 비 조금 옴(태풍 다나스 영향)

- 주말
05:40 기상
05:50 어깨 자가운동(30분)
06:20 종료
06:25 샤워
06:48 인슐린 약 교체(255U, 23U 남음)  
06:55 인슐린 펌프 착용 ==> 
06:56 조식 
07:30 도림천로 도보  
08:20 귀가 
08:30 집출발(자전거: 어깨 보조기 착용 안함): 비 조금 옴
08:50 예스병원(4층)
09:10 진료(우성용 원장) ==> 별 말 없음(한 달 후에 오라고 함: 안가도 될 것 같음)
09:20 종료
09:40 귀가 
10:00 이발(스카이 미용실)
10:30 종료
10:40 귀가 
12:00 중식
12:30 집출발(자전거, 수종)
12:40 다이소 대림2호점 ==> EASY 에어 쿠션(52 * 32cm: 베게), 우산, 칼라 용지 21(연두색)[수종 딱지] 구입
13:00 귀가 ==> 수종 친구들이랑 놀러감
13:10 도림천로 도보
13:40 귀가
13:40 어깨 자가운동(30분)
14:00 인터넷 서핑 ==> XMind 설치
15:00 루옌 놀러감
16:00 수종 귀가
17:30 집출발(자전거)
17:40 맛닭꼬(남구로점) ==> 치킨(칼릭 베이크) 포장
18:00 귀가 
18:40 석식(치킨): 수종
19:00 도림천로 도보 
19:40 귀가
20:00 집출발(자전거, 수정)
20:10 기흥마트 ==> 수종 사탕 구입
20:25 엘마트 ==> 밀크 플러스 900ml(우유, 2통) 구입
20:40 귀가
21:15 어깨 자가운동(30분) 
21:50 취침(수종)
==============================================================================================================

- 노튼 고스트(백업, 21시)
1. WIN10_LG 15UD470-GX50K0_190720 폴더에 WIN10 LG_190720.GHO로 백업 파일 생성(용량: 3.99GB)
==============================================================================================================

- VisualStudio 2019 Community 설치 
1. 집에 있는 노트북(MSI GE60_2OE)에 설치
==============================================================================================================

- 다운로드 XMind 8 한국어 버전 설치
1. xmind-kr-8-update7-windows.exe 설치
2. 무료 마인드맵 프로그램 xMind 사용하는 방법
 1) https://mainia.tistory.com/2080
3. XMind 제1강 토픽의 생성과 삭제 
 1) https://www.youtube.com/watch?v=-XHajenPW9g&list=PLZoZYL6CMKQIcvyCaNydPyI0rRfS-wbFx&index=1 
4. XMind 제1강 토픽의 생성과 삭제마인드맵 ==> https://www.youtube.com/watch?v=JWUHTQXPdUo
5. # 마인드맵으로 글을 쉽게 써 보자[공심재] ==> https://www.youtube.com/watch?v=55G6qGLMNto&feature=youtu.be
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.21(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> 6시 비 조금 옴(태풍 다나스 영향), 캐리어 1개로 짐 쌀 것

- 주말2
06:00 기상
06:10 어깨 자가운동(30분)
06:40 인터넷 서핑 ==> 축구 시청(수종)
08:10 조식
09:00 도림천로 도보
09:40 귀가
11:00 낮잠
12:50 기상
13:00 중식
13:40 도림천로 도보
14:20 귀가 
15:00  TV 시청  
18:20 종료
18:30 석식
19:30 도림천로 도보 
20:20 귀가 
20:20 프로젝트 파견 준비 짐싸기 ==> 여행용 캐리어(28인치, 스위스 밀리터리)에 담을 것
21:00 종료
21:30 어깨 자가운동(30분)
21:50 취침
==============================================================================================================

- 간단하게 겨울 이불 압축하기
1. https://www.youtube.com/watch?v=1RTcgHP7OZg
==============================================================================================================

- [옥션] 무배 마카로니 대용량 강냉이, 05_맛강냉이 5kg(+4,400원), 가격: 18,670원
http://www.enuri.com/detail.jsp?similar=Y&modelno=17021066
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=B277910083&frm3=V2
==============================================================================================================   
 
■■■■■■■■■■■■■■■■■■ 2019.07.22(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 코닝 정밀 소재 AMS Prj 투입, 중식(12시, 김현규 부장한테 식권 3장 빌림)

- 코닝 정밀 소재 AMS Prj[★]
- 코닝 정밀 소재 AMS Prj 투입(8시, 아산)
1. 7시 오태범 이사와 문영 아파트 앞에서 만남 ==> 오이사가 삼성코닝[아산]까지 차 태워줌
2. 투입일시: 2019.07.22(월) ~ 08.22(목)
3. 사업장: 코닝 정밀 소재 비전동 4층(담당자: 김승범 프로)
==============================================================================================================

- 코닝 정밀 소재 자재 반입(09시 ~ 11:30): 김현규 부장이 도와줌
1. 노트북 세트 ==> 노트북, 키보드(로지텍 콤보), 마우스, 케이블
2. 모니터 세트 ==> 모니터, 모니터 거치대, 모니터 케이블 반입 물품에 등록
3. USB 선풍기, 노트북 락 반입 못 함
==============================================================================================================
 
- 코닝 정밀 소재 AMS Prj IP 주소 설정(IP 설정) @@@@
1. IP 주소: 58.2.174.114
2. S/M: 255.255.255.0
3. GW: 58.2.174.1
4. 기본 DNS: 58.2.244.231, 보조 DNS: 58.2.243.231
==============================================================================================================  

- AS IS
1. EJB, Gauce
----------------------------------------------------------------------------------------------------------

- TO BE
1. Websquare, Fusion Chart 분석
http://localhost:8080/websquare/websquare.do
==============================================================================================================
 
- 오라클 DB 연결
1. HOST = 58.2.245.101, PORT = 1621, SERVICE_NAME = devsv1, amspjt / qnstjr00
==============================================================================================================

- 원룸 계약(17시, 김현규 부장 차타고 같이 감)
1. 처갓집 통닭 탕정점 3층(303호) 건물(충남 아산시 탕정면 탕정면로 8번길 93-3(명암리 923-9 다가구 상가주택) 303호 서머나빌
 1) 출입문 비밀번호: 경찰 + 키 + 9981 * 종, 303호: 0508*
==============================================================================================================   
 
- 저녁 식사 준비(19시)
1. 햅반, 반찬, 냄비 구입 ==> 젖가락, 숟가락, 김치 가지고 올 것
==============================================================================================================   
 
■■■■■■■■■■■■■■■■■■ 2019.07.23(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 ==> 숙소에서 코닝 정밀까지 걸어서 출근(30분 소요), 주간보고(13시, 김현규 부장 참석): 상황 심각

- 코닝 정밀 소재 AMS Prj[★]
- 조성(/PD01.xml) 화면[분석데이타 [D] > 제품분석] 분석
1. 평균, 표준편차, CPK 아이템 코드 Grid 통합
==============================================================================================================

- WebSquare Engine 로그 콘솔에 안찍기(WS5_SAMPLE에서)
1. Engine console log OFF(/config.xml 파일에서) ==> 웹스퀘어 엔진 로그
<?xml version="1.0" encoding="UTF-8"?>
<WebSquare>
    <allValue value="all"/> 
    <docType value="standard"/
 <!--/ <debug value="true" remoteConsole="false" console="true" />//-->   <!--// debug="false": Engine console log ON //-->
   <debug value="true" remoteConsole="false" console="false" /> <!--// debug="false": Engine console log OFF //-->
    <debugKey value=""/>
    <language value="ko"/>
</WebSquare>
----------------------------------------------------------------------------------------

 1) 로그 확인
[/websquare.jsp] [init()] ==> [######################### [websquare Start] #########################] 
(index):24 [/websquare.jsp] [init()] ==> [TEST_01]
(index):30  [/websquare.jsp] [init()] ==> [######################### [websquare END] #########################] 
--------------------------------------------------------------------------------------------------------------------
 
2. Engine console log ON(/config.xml 파일에서)
<?xml version="1.0" encoding="UTF-8"?>
<WebSquare>
    <allValue value="all"/>
    <docType value="standard"/> 
   <debug value="true" remoteConsole="false" console="true" />  <!--// debug="false": Engine console log ON //-->
    <debugKey value=""/>
    <language value="ko"/>
</WebSquare>
----------------------------------------------------------------------------------------

 1) 로그 확인
07:41:25.388 00000 000000 BootLoader] WebSquare Runtime Engine Version : 5.0_2.2985B.20180302.153706_1.8
javascript.wq?q=/bootloader:10 07:41:25.389 00001 000001 BootLoader]     Copyright 2009  INSWAVE Systems Co., Ltd. All Rights Reserved.
javascript.wq?q=/bootloader:10 07:41:25.389 00000 000001 BootLoader] Browser Information : Mozilla/5.0 (Windows NT 10.0; 
Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/75.0.3770.142 Safari/537.36
javascript.wq?q=/bootloader:10 07:41:25.390 00001 000002 BootLoader] [STEP1][START] Loading Runtime Engine.
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.24(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>

- 코닝 정밀 소재 AMS Prj[★]
- 조성(/PD01.xml) 화면[분석데이타 [D] > 제품분석] 분석
1. Grid에 배경색, 글자색 넣기
2. 샘플 소스 ==> 입고정보(/WA01.xml)[백금분석 >]
- Grid에 글자색 셋팅
for( var i=0; i< dlt_ProGdList.getRowCount(); i++ ) {
	// console.log("[/PD01.xml] [sbm_getSelectPd01TextList1_submitdone()] ==> [TEST_51] [i_번째]"+ i );  
	grd_list2.setCellColor(i, 2 , "#FF0000" );  // 글자색 셋팅(빨간색 셋팅)
	grd_list2.setCellColor(i, 3 , "#FF0000" );  // 글자색 셋팅 (빨간색 셋팅)
	grd_list2.setCellColor(i, 4 , "#FF0000" );  // 글자색 셋팅 (빨간색 셋팅)
	grd_list2.setCellColor(i, 9 , "#0054FF" );  // 글자색 셋팅 (파란색 셋팅)
	grd_list2.setCellColor(i, 10 , "#FF0000" ); // 글자색 셋팅 (빨간색 셋팅)
	grd_list2.setCellColor(i, 15, "#FF0000" ); // 글자색 셋팅 (빨간색 셋팅)
}
==============================================================================================================

- Grid 동적 생성
<!--// 0. 그리드 헤더 Ds //-->
<w2:dataList id="dlt_GlassList" baseNode="list" saveRemovedData="true" repeatNode="map">
 <w2:columnInfo>
  <w2:column id="ITEM_CODE" name="name1" dataType="text"></w2:column>
  <w2:column id="ITEM_NAME" name="name2" dataType="text"></w2:column>
  <w2:column id="HEAD_NAME" name="name3" dataType="text"></w2:column>
 </w2:columnInfo>
</w2:dataList>
 
<!--// 1. 주제별 아이템 코드 Ds //-->
<w2:dataList id="dlt_TarGdList" baseNode="list" saveRemovedData="true" repeatNode="map">
 <w2:columnInfo>
  <w2:column id="GLASS_CODE" name="name1" dataType="text"></w2:column>
  <w2:column id="GLASS_NAME" name="name2" dataType="text"></w2:column>
  <w2:column id="BASIS_DATE" name="name3" dataType="text"></w2:column>
  <w2:column id="START_DATE" name="name4" dataType="text"></w2:column>
  <w2:column id="T1" name="name6" dataType="text"></w2:column>
 </w2:columnInfo>
</w2:dataList>
 
/**  조회버튼 클릭시 이벤트 */
scwin.Search_onclick = function() {
	common.executeSubmission("sbm_getSelectPd01Search");    // 조회
}

/** 그리드 헤더부분 조회 후 데이터셋 동적 셋팅 함수 호츌 */
scwin.sbm_getSelectPd01Search_submitdone = function(e) {
	console.log("[/PD01.xml] [sbm_getSelectPd01Search_submitdone()] ==> [TEST_01]" );

	scwin.setColumnID();  // 데이터셋을 동적으로 할당한다.
};
 
// DataList & Grid 동적 Column 생성
scwin.setColumnID = function() {
	console.log("[/PD01.xml] [setColumnID()] ==> [DataList & Grid 동적 Column 생성]  [TEST_01]" );

	var GlassCount = dlt_GlassList.getRowCount();
	var glass_code = dma_BaseMap.get("GLASS_CODE");

	//주의사항
	//1. 각 DataList, GridView 생성에 사용될 xml tag (<w2:dataList>,  <w2:columnInfo>, <w2:column> 등)들은 
	현재 "Source"탭에 그려져 있는 그대로를 사용해야 함
	//2. <w2:gridView> 생성 시 아래 속성을 필히! 추가하여야 함
	//   <w2:gridView xmlns="http://www.w3.org/1999/xhtml" xmlns:ev="http://www.w3.org/2001/xml-events" 
	xmlns:w2="http://www.inswave.com/websquare" xmlns:xf="http://www.w3.org/2002/xforms"

	// 1. DataList 생성 시작  ===============================>
	// 1.1. DataList 고정 Column 생성     
	var dataListStr = '<w2:dataList baseNode="list" id="dlt_TarGdList" repeatNode="map" saveRemovedData="true" style="">'
	+ '         <w2:columnInfo>'
	+ '       <w2:column dataType="text" id="GLASS_CODE" name=""></w2:column>'
	+ '       <w2:column dataType="text" id="GLASS_NAME" name=""></w2:column>'
	+ '       <w2:column dataType="text" id="BASIS_DATE" name=""></w2:column>'
	+ '       <w2:column dataType="text" id="START_DATE" name=""></w2:column>'
	+ '       <w2:column dataType="text" id="T" name=""></w2:column>'

	// 1.2. DataList 동적 Column 생성 (Grinding)
	for( var g=1; g<=GlassCount+1; g++ ) {
	var T = "T"+ g;
	dataListStr += '  <w2:column dataType="text" id="'+T+'" name=""></w2:column>'
	}

	scwin.makeDataList( "dlt_TarGdList", dataListStr );    // 1. 주제별 아이템 코드 조회 Dt
	scwin.makeDataList( "dlt_ProGdList", dataListStr1 );  // 2. 날자별 아이템 코드 조회 Dt
	scwin.makeDataList( "dlt_TotGdList", dataListStr2 );  // 3. 평균, 표준편차, CPK 아이템 코드 조회 Dt  ==> 추가: 2019.07.23, by 진태만 

	common.executeSubmission("sbm_getSelectPd01TextList1");
};

scwin.sbm_getSelectPd01TextList1_submitdone = function(e) {
	console.log("[/PD01.xml] [sbm_getSelectPd01TextList1_submitdone()] ==> [TEST_01]" );

	var GlassCount = dlt_GlassList.getRowCount();  // 그리드 헤더 정보
	var glass_code = dma_BaseMap.get("GLASS_CODE");
	console.log("[/PD01.xml] [sbm_getSelectPd01TextList1_submitdone()] ==> [TEST_05] [glass_code]"+ glass_code );

	// 1. 주제별 아이템 코드 Grid 생성 시작  ===============================>
	// 1. 주제별 아이템 코드 Grid 생성
	var gridStr = '<w2:gridView id="grd_list" xmlns="http://www.w3.org/1999/xhtml" 
	xmlns:ev="http://www.w3.org/2001/xml-events" xmlns:w2="http://www.inswave.com/websquare" 
	xmlns:xf="http://www.w3.org/2002/xforms" '
	+ '               style="height:185px;" width="100" autoFit="" class="cm_grid1" dataList="data:dlt_TarGdList" 
	defaultCellHeight="30" ev:onafteredit="" ev:oncellclick="scwin.grd_list_oncellclick" 
	ev:onrowindexchange="scwin.grd_customer_onrowindexchange" fixedColumnWithHidden="true" 
	ignoreCellClick="false" overflowX="auto" overflowY="auto" readOnly="true" rowStatusHeaderValue="" 
	rowStatusVisible="" scrollByColumn="false" showSortableImage="" sortEvent="onclick" 
	sortable="true" useShiftKey="true" visibleRowNum="">'
	+ ' <w2:header id="header1" style="">'
	// 1-1. 주제별 아이템 코드 Grid 오른쪽 Header 칼럼명(glass_code: 첫번? 칼럼, TITLE 칼럼) 생성
	+ '<w2:row id="row1" style="">'
	+ '   <w2:column blockSelect="false" id="REQ_NUMBER" removeBorderStyle="false" style="height:25px;" 
	width="100" inputType="text" value="'+glass_code+'" displayMode="label" colSpan="" rowSpan="1" 
	sortLabel="" sortable=""></w2:column>'
	+ '   <w2:column blockSelect="false" id="REQ_DATE" removeBorderStyle="false" style="height:25px;" 
	width="100" inputType="text" value="TITLE" displayMode="label" colSpan="" rowSpan="1" sortLabel="" 
	sortable=""></w2:column>'

	// 1-2. 주제별 아이템 코드 Grid 오른쪽 Header 칼럼명 생성(왼쪽부터 차례로 아이템 코드 데이타 넣기)
	for( var r=0; r<= GlassCount-1; r++ ) {
	var headame = dlt_GlassList.getCellData( r, "HEAD_NAME");   // 그리드 헤더 Ds[SiO2, Al2O3, Na2O, P2O5, Li2O....]
	gridStr += '<w2:column blockSelect="false" id="" removeBorderStyle="false" style="height:25px;" 
	width="100" inputType="text" value="'+headame+'" displayMode="label" colSpan="" rowSpan="1"></w2:column>';
	}

	// 1-3. 주제별 아이템 코드 Grid 오른쪽 Header 칼럼명(TOTAL 칼럼, 특이사항 칼럼) 생성
	gridStr += '  <w2:column blockSelect="false" id="" removeBorderStyle="false" style="height:25px;" 
	inputType="text" width="100" value="TOTAL" displayMode="label" sortable=""></w2:column>'
	+ '     <w2:column blockSelect="false" id="" removeBorderStyle="false" style="height:25px;" 
	inputType="text" width="100" value="특이사항" displayMode="label" sortable=""></w2:column>'
	+ '</w2:row>'
	+ ' </w2:header>'

	// 1. 주제별 아이템 코드 Grid Body 생성 시작 ===============================>
	// 1-4. 주제별 아이템 코드 Grid Body 생성(LOT_NO, TITLE)
	+ '<w2:gBody id="gBody1" style="">'
	+ '<w2:row id="row1" style="">'
	+ '    <w2:column blockSelect="false" id="LOT_NO" removeBorderStyle="false" style="" inputType="text" 
	width="100" value="" displayMode="label"></w2:column>'       -- glass 코드  @@@
	+ '    <w2:column blockSelect="false" id="T1" removeBorderStyle="false" footerDiv="false" width="100"
	inputType="text" displayMode="label" disabled="true"></w2:column>'  -- T1  @@@

	// 1-4. 주제별 아이템 코드 Grid Body 데이타 생성(왼쪽부터 차례로 수치 데이타 넣기)[56.77, 23.74, 9.96, 5.23, 2.77....]
	for( var r=2; r<= GlassCount+1; r++ ) {
	var T1 = "T"  + wconv.toNumber(r);
	gridStr += ' <w2:column blockSelect="false" id="'+T1+'" removeBorderStyle="false" style="" inputType="text" 
	width="100" value="" displayMode="label" textAlign="right"></w2:column>';     -- T2부터 동적으로 Display @@@
	}

	// 1-5. 주제별 아이템 코드 Grid Body 데이타 칼럼(마지막 칼럼) 생성
	gridStr += '  <w2:column blockSelect="false" id="SAMPLE_NO" removeBorderStyle="false" style="" 
	inputType="text" width="100" value="" displayMode="label"> </w2:column>'
	gridStr += '  <w2:column blockSelect="false" id="SAMPLE_NO1" removeBorderStyle="false" style="" 
	inputType="text" width="100" value="" displayMode="label"> </w2:column>' 
	+ '</w2:row>'
	+ '</w2:gBody>'
	+ '</w2:gridView>';  
};
==============================================================================================================
 
- Fusion Chart 분석
1. Fusion Chart(퓨전 챠트) ==> Websquare에서 제공해주는 챠트
 <script type="javascript" lazy="false"><![CDATA[
 //차트 옵션 적용
 scwin.fn_setChartOpt = function() {
	  var options = {
	   startValue : "20000",
	   color : "FF0030",
	   displayValue : "TrendLine"
	  };
	  ui_fusionchart1.addTrendLine(options);

	  ui_fusionchart1.setChartAttribute({
	   Caption : "Quarter2 Data"
	  });
	  var options1 = {
	   color : "20B2AA",
	   font : "15",
	   bold : "1"
	  };
	  
	  ui_fusionchart1.applyStyle("font", "captionFont", options1, ["Caption",
		"YAXISNAME"]);
	  ui_fusionchart1.draw();
	 };
]]></script>

<!-- 01. 2D Chart -->
<w2:fusionchart id="ui_fusionchart1" chartType="Column2D" ref="data:dc_chartData2" style="height: 300px;"
 seriesColumns="[['quarter2']]" drawType="javascript" labelNode="Month">
</w2:fusionchart>
==============================================================================================================

- 01. AMS FTP
1. 프로토콜(T): SFTP
2. 호스트(H): 58.2.245.237
3. 사용자(U): jeusadm,
4. 기본 로컬 디렉토리(L): C:\Users\tamar\Downloads
5. 기본 리모트 디렉토리(E): /scpuser/croc/2019/00. TAMA
==============================================================================================================

- 김유진 대리한테 전화옴(16시)
1. 조식 5만원만 지원 해줌, 석식 10만원 지원 ==> 총 15만원 지원 해준다고 함(10만원 영수증 제출할 것)
==> 숙소에서 냄비에 밥 해먹을 것
---------------------------------------------------------------------------------------------------------------------------

- 오태범 이사에게 전화함(19시)
1. 사장님한테 건의해서 조식 10만원만 지원으로 수정해준다고 함 ==> 총 20만원 지원 해준다고 함(10만원 영수증 제출할 것)
==> 숙소에서 냄비에 밥 해먹을 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.25(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 장마비(06:30 출근시 비 맞아 옷, 신발 다 젖음)
					, 식권 구입(20장[10만원: 장 당 5천원]: 새마을금고(2층, 식권 판매(현금영수증): 목, 08:30 ~ 16:00): 빌린 식권 3장 갚음

- 코닝 정밀 소재 AMS Prj[★]
- Fusion Chart 분석
1. Glass ITEM_CODE 'SIO2'를 기준으로 하여 날짜별 데이타 5개를 지정하여 Fusion Chart 생성
 1) chart 타입을 Line으로 변경 ==> Y축 실제 데이타를 가지고 오지 않는데 차트가 그려짐(오류)
 2) AS IS 챠트에서 5개의 데이타가 나와서 그려짐(Fusion Chart에서도 가능한지 의문)
==============================================================================================================

- SVN 연결(eclipse에서)
1. amspjt3/amspjt3[예전 퍼블러셔 계정)
-----------------------------------------------------------------------------------------------

- 소스 외부망 PC로 옮기는 방법
1. eclipse에서 SVN으로 연결 > C:\CROC\workspace\CROC\doc 폴더에 넣기 ==> 00. Test_2019.07.txt
==============================================================================================================

- 데이타셋 데이타 보기(dataSet)
1. Websquare에서 Ctrl + 마우스 우 클릭 > dataCollection보기: 클릭 > Source - Chrome(새창)
dataCollection: 선택, 데이터 형태: XML --> 조회: 클릭
2. Websquare에서 Console에서
console.log("[/PD01.xml] [sbm_getSelectPd01TextList1_submitdone()] ==> [TEST_11] [dlt_GraphList0.getRowCount()]"+ 
dlt_GraphList0.getRowCount() );
console.log("[/PD01.xml] [sbm_getSelectPd01TextList1_submitdone()] ==> [TEST_12] [dlt_GraphList0.getAllXML()]"+
 WebSquare.xml.serialize(dlt_GraphList0.getAllXML()) );
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.26(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:10 ==> 장마 비(종일), 김현규 부장 휴가(세종시로 이사), 서울행[천안.아산(18:01) -> 광명(18:24), KTX]

- 코닝 정밀 소재 AMS Prj[★]
- Fusion Chart 분석
1. Y축 데이타 삽입 가능
2. 최초 Chart가 그려질 때  시료 데이타값 Graph(가로)와 Min, Max값에 따른 Graph(세로)가 그려짐
 1) 추후 Min, Max값 변경에 따라서 Graph(세로)가 다시 그려져야 함
 2) trendlines(추세선)을 그려야 하는 지 문의할 것 ==> 가로 직선 Graph
  가. trendlines(추세선): Target, +-3o, 조성주의, QUAL, Sellable
3. 시료 ==> SiO2: 이산화 규소, AL2O3:  코닉스, Na2O: 산화 나트툼
4. Fusion Chart 담당자: 인스웨이브 모성종(mosj0110@inswave.com)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.27(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 나눔 동기 모임(17시)

- 주말 
06:40 인터넷 서핑 ==> 축구 시청(수종)
08:10 조식
09:00 도림천로 도보 
09:50 귀가 
10:00 어깨 자가운동(30분)
08:30 휴식
12:00 중식
12:10 루옌, 수종 물놀이감
13:00 도림천로 도보
13:40 귀가
14:00 인터넷 서핑 ==> 콘솔에 sql 로그 찍는 방법 분석 
16:00 종료 
16:10 집출발 ==> 횡단보도에서 뛰다가 핸드폰 떨어 뜨려서 버스 놓침
16:30 대동초등학교 정류장(507번 버스 탑승)
17:30 광희동 정류장 하차 > 굿모닝 시티 > 국민중앙 의료원 뒷편 > 전태일 다리
18:00 진옥화 할매 원조 닭 한마리 본점 도착 ==> 태용, 현용이가 먼저 도착해서 옆집(명동닭 한마리)로 옮김
18:10 식사 ==> 10분 후 호수 도착
19:30 종료
19:40 당구(태용: 1등, 현용: 2등, 호수: 3등[당구비], 4등[내: 호프집 술값])
21:30 종료
18:40 BHC 호프집(내가 쏨): 현용이 쓸개 수술함(예전처럼 술 못 먹음), 55세 퇴직하고 해남으로 내려가다고 한(월 백만원, 10년 3억)
		태용이도 운동 안해서 병 걸릴 것 같다고 걱정함, 호수는 헬스하고 있다고 함
22:50 종료
23:10 지하철(종로4가역: 호수)
23:40 신도림역(호수와 헤어짐) ==> 2번 출구 ==> 도림천 ==> 귀가(30분 걸림)
24:10 귀가
24:30 어깨 자가운동(30분) 
01:00 종료 
01:10 취침(수종)
==============================================================================================================

- 콘솔에 sql 로그 찍는 방법
1. 전자정부프레임워크 log4j2.xml 콘솔에 sql 찍는 방법 ==> https://aljjabaegi.tistory.com/172

- sql 로그에 파라미터로 들어가는 물음표 표시 해결 방법
1. log4jdbc-remix 사용 ==> https://suyou.tistory.com/76
2. log4jdbc-remix 설정 ==> https://sbs20011.tistory.com/entry/log4j-설정
3. log4j2 에서 log4jdbc-remix 도입시 오류가 납니다. ==>
https://www.egovframe.go.kr/uss/olh/qna/QnaInqireCoUpdt.do?qaId=QA_00000000000016747&pageIndex=1
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.28(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==>  

- 주말2
08:00 기상(어제 늦게 자서 피곤함)
08:30 조식
09:00 도림천로 도보 ==> 장마비 조금 옴
09:40 귀가
11:00 휴식
13:00 중식
13:40 도림천로 도보
14:20 귀가 ==> 루옌이 해준 반찬 점검
16:10 집출발(수종)
14:26 무지개 키즈 카페(1시간[4천원], 보호자[2천], 수종)
15:20 종료 ==> 비 조금 옴
15:30 엘마트 방문 ==> 서울우우 저지방 900ml(우유, 2통): 수종
15:50 귀가 
17:00 석식 
17:30 집출발 ==> 가방에 쌀, 반찬(미역국, 진미채), 밥그릇 가지고 감
17:40 영림초교 정류장(505번 버스 탑승)
18:60 광명역 도착(약 40분 소요)
19:06 아산행 KTX 탑승(19:06, 광명역 -> 천안아산역)
19:30 천안아산역도착
19:40 아산역 정류장(순환5번 탑승)
20:00 트라 팰리스 정류장 하차
20:10 귀가 
20:22 다이소 탕정점 ==> 냄비 20cm(5천원)  구입 
22:00 취침
==============================================================================================================
 
- 집에서 가져올 것
1. 냄비(No), 밥그릇 2개), 김치, 반찬, 쌀, 과도(칼), 물병, 숫가락, 젖가락, 수세미, 랜선, 증명사진, 스위스 밀리터리 여행용 폴딩백 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2019.07.29(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 05:32 인슐린 약 교체(249U, 29U 남음), 밥 짓기(05:40, 2인분), 조식(6시), 사업장에 USB 선풍기 반입
- 코닝 정밀 소재 AMS Prj[★]
- Fusion Chart 분석
1. Y축 데이타 삽입 가능
2. 최초 Chart가 그려질 때  시료 데이타값 Graph(가로)와 Min, Max값에 따른 Graph(세로)가 그려짐
 1) 추후 Min, Max값 변경에 따라서 Graph(세로)가 다시 그려져야 함
 2) trendlines(추세선)을 그려야 하는 지 문의할 것 ==> 가로 직선 Graph
  가. trendlines(추세선): Target, +-3o, 조성주의, QUAL, Sellable
3. 시료 ==> SiO2: 이산화 규소, AL2O3: 코닉스, Na2O: 산화 나트툼
4. 가우스 Chart 고객 설명 요청(현업이 직접 방문하여 설명해줌)
 1) 가우스 Chart는 가로 직선 Graph 6개,  세로 직선 Graph 1개로 구성된다고 함.
==============================================================================================================

- sql 로그에 물음표 해결 방법
1. /pom.xml 파일 설정 수정
 1) log4jdbc-remix-0.2.7.jar, log4jdbc-remix-0.2.7.jar파일을 repository에 넣어 주면 됨
2. /context-datasource.xml 파일 설정 수정
==============================================================================================================

- 조성(/PD01.xml) > 분석데이타 [D] > 제품분석)
1. 저장 처리
==============================================================================================================
 
- 냄비에 밥 짓기
1. 전날 밤에 쌀(2인분 300ml: 1인분 컵 2/3)을 씻어서 불어 놓을 것
2. 가스레인지에 냄비를 올려 놓고 10분간 끓일 것
3. 10분이 지나면 불을 끄고 5분간 놔둘 것
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.30(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==> 주간보고(13:30, 김현규 부장 참석)
- 코닝 정밀 소재 AMS Prj[★]
- 조성(/PD01.xml) > 분석데이타 [D] > 제품분석)
1. 저장, 신규입력, Data Import 처리
 1) 형변환 ==>  nTotal = parseInt(valLib.nvl(coldValue, 0)) + nTotal;  // 총합
 ar v_rt_exchange  = parseFloat(valLib.nvl(ds_general.get("RT_EXCHANGE"), 0) );   // 환율
==============================================================================================================

- Fusion Chart 분석
1. 김현규 부장이 해결했다고 함(Min, Max 팝업도 김부장이 한다고 함)
==============================================================================================================

- 01. CROC eclipse SVN 에러
1. 이전 소스로 Update 됨 ==> 백업 소스 받아 놓을 것
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2019.07.31(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 ==>
- 코닝 정밀 소재 AMS Prj[★]
- 조성(/PD01.xml) > 분석데이타 [D] > 제품분석)
1. 신규입력, 특이사항 팝업(/PD01P03.xml)
 1) 형변환 ==>  nTotal = parseInt(valLib.nvl(coldValue, 0)) + nTotal;  // 총합
 ar v_rt_exchange     = parseFloat(valLib.nvl(ds_general.get("RT_EXCHANGE"), 0) );   // 환율
==============================================================================================================

- Grid에서 편집을 할 때 더블 클릭 해야만 편집되는 문제
1. editModeEvent="onclick": 클릭하면 바로 편집 가능
 1) Grid 에서
 <w2:gridView id="grd_mmList" autoFit="allColumn
" class="cm_grid" dataList="data:dlt_GraphMinMaxList" editModeEvent="onclick">
==============================================================================================================

- 02. AMS eclipse 다시 받기
1. FTP로 박인선 폴더에서 AMS.zip 파일 다시 받아서 셋팅(eclipse_AMS.exe 실행 에러가 나서 시간 많이 빼앗김)
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 
 