

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2020.01) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2020.01.01(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 설날(휴일), 가계부 월말 결산(16시)

- 휴가[★]
08:00 기상 
08:20 조식
09:00 실내 자전거 타기(1시간)
10:20 종료
10:30 인터넷 서핑
11:50 루옌, 수종 언니집에 놀러감 
12:10 중식
12:30 실내 자전거 타기(1시간)
14:30 종료
14:50 인터넷 서핑
16:00 가계부 월말 결산
17:30 종료
18:20 석식
18:30 루옌, 수종 귀가
19:00 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
23:00 취침
==============================================================================================================
 
- 포토샵 강의
1. 어도비 포토샵 특강 1시간만 배우면 ==> https://www.youtube.com/watch?v=S7CFbDx-yYc
2. 인터넷 온라인 포토샵 사이트 추천 TOP 5 (2019년) - 리틀 자이언트
==> https://makemoneyskills.com/best-online-photoshop/
============================================================================================================== 

- 퇴직 연금 확인
1. (주)지아이데이타 2017.03.16 재입사
 1) 2019.12.31(일) 현재 ==> 평가액: 8,584,346원, 최근1년 누적수익률: 1.77%
2. https://www.youtube.com/watch?v=8F_GReumyj0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.02(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 휴가[★]
05:00 기상 
05:42 조식
06:30 실내 자전거 타기(1시간)
07:30 종료
08:00 인터넷 서핑 ==> 신년 목표 작성
10:00 집출발(자전거): 수종
10:20 서울 가정의학과 의원 방문 ==> 진료(발가락 다침), 항생제 주사
		==> 진료(무좀): 1주일치 약(아침, 저녁) 받음 ==> 1달 후에 방문하라고 함
		==> 진료((귀 근처 피부병): 3일치 약, 보습 크림 --> 하루 2번 7일 연속(3일 쉬고)
10:30 래미안 나나 약국 방문 ==> 조재(발가락 치료, 피부병[3일치 약], 무좀[1주일치 약])
10:50 다이소 방문 ==> 본드, 치약 3개, 멀티탭(부엌용), 건전지(1.5V)
11:20 귀가
11:40 중식
12:00 실내 자전거 타기(1시간)
14:00 종료
14:22 인슐린 약 교체(275U, 12U 남음)
14:40 인터넷 서핑 ==> 중고나라 PC 분석(별로 괜찮은 물건이 없음)
18:20 석식
19:30 실내 자전거 타기(1시간)
20:30 종료
20:35 갤럭시 S8 핸드폰 액정에 금이 감(실내 자전거에 부딪쳐서 깨어진 것으로 추정됨: 액정 강화 유리가 깨어졌는데 착각함)
20:40 인터넷 서핑
23:00 취침
==============================================================================================================

- 수종이 급식비 송금(09:30)
1. 1~2월달에는 학교 급식은 안해서 외부 급식을 받아서 급식비가 비싸다고 함(하루 5천원)
 1) 종일반은 2월 11일(화)에 졸업시기을 해도 2월 28일(금)까지 유치원에 다닐 수가 있다고 함
2, 진수종 원아 1~2월 급식비 77,940원이 미납중이오니 오늘까지 입금바랍니다-대동초병설유치원 
 1) 농협 통장에 잔금 1,779원이 남음 ==> 76,161원 송금(완료) --> 급식비 77,940원 대동초병설유치원에서 출금할 예정.
===================================================================================================================

- 모니터, 짐 확인 전화(09:40)
1. 오태범 이사에게 전화 ==> 현대제철 안전관리 Prj 자리가 그곳이 맞다고 함(업체 관계자에게 전화해서 짐 관리한다고 함)
==============================================================================================================

- 내 Microsoft 계정(마이크로 소프트 계정)
https://account.microsoft.com/?ref=MeControl&lang=ko-KR&partnerId=msn&partnerDomain=www.msn.com&refd=www.msn.com
tamario@naver.com, 2020오*h@
==============================================================================================================

- 달빛조각사 PC로? 멀티에 강한 PC가 이가격 미쳤다.(네이버 중고나라)
https://cafe.naver.com/joonggonara/690056910
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.03(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 휴가[★]
07:42 기상 
08:10 조식
08:30 실내 자전거 타기(1시간)
09:30 종료
08:40 인터넷 서핑
11:40 중식
12:00 실내 자전거 타기(1시간)
14:00 종료
14:40 인터넷 서핑 ==>  
15:00 낮잠
18:20 석식 
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
23:00 취침
==============================================================================================================

- LG서비스 A/S 센테에 전화
1. 김치냉장고 500리터 이동하는데 기사 2명 방문: 3만 9천원 ==> A/S 고민할 것
==============================================================================================================

- [토크멘터리 전쟁사] 15부. 기이한 전쟁사[국방TV]
https://www.youtube.com/watch?v=cOH8h6VYi68&t=20s
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.04(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 휴가[★]
05:00 기상 
05:20 조식
06:00 집출발
06:26 대림역 정류장(6411번 버스 탑승)
07:20 선릉역 정류장 하차
07:30 지아이데이타 본사 도착(삼성제일빌딩 2013호) ==> 11월, 12월 지출결의서 제출(김유진 대리 책상에 놔둠)
08:40 지아이데이타 출발(도보)
09:15 양재최의원 도착
09:30 진료(박황현 원장), 당화혈색소 검사: 5.2%
		==> 인슐린 7병,  에스파손 겔(피부약) 구입[약국]
		==> 슈퍼라인-ST[바늘 길이: 6.5mm]: 30개, 다나 3cc 주사기: 30개 구입[다나메티칼]
		==> 다나 건전지-R(6개), 큐큐 반창고(5천원) 구입[다나메티칼]		
10:00 종료
10:26 군인공제회관/타워펠리스 정류장(6411번 버스 탑승)
11:40 대림역 정류장 도착
11:50 귀가
12:20 중식
13:00 도림천 도보
14:00 귀가
14:30 집출발(자전거, 수종)
14:30 보라매 공원 도착(연날리기 할려고 했는데 수종이가 갑자기 집에 가자고 해서 못함)
14:50 이마트 구로점 ==> 500매 모아 색종이 구입(9천원)]
15:30 귀가
15:40 인터넷 서핑 ==>  
17:40 집출발
17:50 명성 왕족발(남구로 시장) ==> 닭강정(중: 만원) 구입
18:10 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 만 900원) 구입 
18:30 귀가
18:40 석식 
19:00 실내 자전거 타기(1시간)
20:00 종료
20:40 취침
==============================================================================================================

- LG 헬로 비전 가입
https://www.lghellovision.net --> tamario2/202*오*h@
==============================================================================================================

- 11월, 12월 지출결의서
1. 지출금액 총: 585,000원(현금: 471,700, 카드: 113,300원)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.05(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 휴가[★]
07:42 기상
08:10 조식
08:30 실내 자전거 타기(1시간)
09:30 종료
08:40 인터넷 서핑
12:00 중식
12:45 도림천 도보
12:50 루옌, 수종 눈썰매장에 놀러감
13:45 종료
14:40 인터넷 서핑
15:00 낮잠
18:20 석식
18:50 루옌, 수종 귀가
19:30 실내 자전거 타기(1시간)
20:30 종료
20:30 도시가스 검침 ==> 핸드폰으로 사진 찍어서 검침원에게 카톡으로 보냄
20:40 인터넷 서핑 ==> PC 조립 견적 가격 검색
23:00 취침
==============================================================================================================

- 삼성 칼러 복합기(CLX-3175K): 인쇄+복사+스캔(집[문영APT 1806호)에 있는 프린터)
일련번호: 14M7BAISC02031V 
OK캐쉬백: 7,020원 할인, 쿠폰할인: 8,690 원 할인 ==> 실제 가격: 276,640 원 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=32319751&xfrom=&xzone= 
http://www.prinity.com/error/serviceEnd.asp 
--------------------------------------------------------------------------------------------------------------------------------

- 삼성 칼러 복합기(CLX-3175K) 토너 구입
1. [삼성토너] CLT-M409S (빨강)/ 삼성정품토너 구입 ==> 리퍼, 총 가격: 9,900원
http://prod.danawa.com/info/?pcode=698986&keyword=CLX-3175K&cate=1121011#bookmark_cm_opinion

2. [삼성전자] 삼성 CLT-C409S 파랑 정품토너 CLP 310K/CLX 3170FNK ==> 리퍼, 총 가격: 15,690원 ==> 참고
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=1668107834&GoodsSale=Y&jaehuid=200002657&service_id=pcdn
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.06(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전부터 약한 비

- 휴가[★]
05:00 기상
05:42 조식
06:30 실내 자전거 타기(1시간)
07:30 종료
08:00 인터넷 서핑 ==> PC 조립 견적 상담
09:00 집출발(자전거)
09:20 서울 가정의학과 의원 방문 ==> 진료(발가락 다침: 새끼 발가락만 드래싱), 항생제 주사
		==> 보습 크림(삼아 리도 멕스) 요청: 파견용
09:30 래미안 나나 약국 방문 ==> 조재(발가락 치료, 피부병[3일치 약])
09:50 엘마트 방문 ==> 우유 구입
10:00 다이소 방문 ==> 가위(2개)
10:10 귀가
10:20 체혈 스트립지(케어센스N 혈당지) 구입[쌍봉 종합의료기] ==> 8통(1통 50개), 총 가격: 96,000원
10:30 인터넷 서핑 ==> 
11:40 중식
13:00 실내 자전거 타기(1시간)
14:00 종료
14:40 인터넷 서핑 ==> 
18:20 석식
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
23:00 취침
==============================================================================================================

- 일 잘하는 사람들의 다섯가지 특징[관리자, 리더쉽]
https://www.youtube.com/watch?v=Uj08romvMes
1. 통계적 사고를 잘한다.
2. 실행능력이 높다.
3. 동기부여가 잘 되어있다.
4. 동료애가 높다.
5. 학습능력이 있다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.07(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 설 기차 승차권 예매, 오전부터 약한 비

- 휴가[★]
05:45 기상
06:00 조식
06:25 실내 자전거 타기(1시간)
06:50 종료
07:00 설 기차 승차권 예매: 접속대기: 14,679명 ==> 실패(만명이 넘으면 실패라고 판단해야함) 
07:30 인터넷 서핑 ==>   
11:40 중식
12:43 인슐린 약 교체(225U, 16U 남음)
12:50 실내 자전거 타기(1시간)
14:00 종료
14:40 인터넷 서핑 ==> 
18:20 석식
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
23:00 취침
==============================================================================================================

- SRT 기차]로그인 정보 수정
1. https://etk.srail.co.kr --> 1690955250 / 20**오*h@
========================================================================================================= 

- 삼성 칼러 복합기(CLX-3175K) 토너 구입
1. (국민토너) CLT-K406s 리필 파우더(리필킷 카트리지), 검정, 나무 인두기,  총 가격: 8,800원
http://itempage3.auction.co.kr/DetailView.aspx?itemno=A644017484&frm3=V2

- 삼성 CLT-406 리필토너 파우더 충전방법(컴모아, 국민토너)
https://www.youtube.com/watch?v=EQazH8G6VbA

- 삼성 CLT-K406S 프린터토너 셀프충전시 칩교체 방법 (CLP-365/CLX-3305)
https://www.youtube.com/watch?v=6NWWe7bPTF0
==============================================================================================================
 
- 네이버 웨일 주소창 검색
1. 설정 > 주소창 > 주소창 검색 > 주소창 검색 서비스
1) 주소창 검색 서비스:  구글 선택
 2) 여러 검색서비스 사용: 선택
 3) 스페이스 검색 사용: 선택
   가. 왼쪽 스페이스: 구글, 나) 오른쪽 스페이스: 네이버
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.07(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 설 기차 승차권 예매, 하루 종일 강한 비

- 휴가[★]
05:00 기상
05:30 조식
06:00 실내 자전거 타기(1시간) 
06:50 종료
07:00 설 기차 승차권 예매[경부선] --> [IE11 사용] 접속대기: 14,679명 ==> 실패(만명이 넘으면 실패라고 판단해야함) 
07:10 인터넷 서핑 ==> PC 조립 견적 문의 카톡 배인철 차장에게 보냄(매우 훌륭한 사양(부품)이라고 함)
		 --> 이 견적으로 조립하기로 잠정 결론냄
11:40 중식
12:43 인슐린 약 교체(225U, 16U 남음)
12:50 실내 자전거 타기(1시간)
14:00 종료
14:40 인터넷 서핑 ==> PC 조립 동영상 시청
18:20 석식
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 인터넷 서핑
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.08(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전부터 약한 비 후 그침

- 휴가[★]
05:00 기상
05:30 조식
06:00 실내 자전거 타기(1시간) 
06:50 종료
07:00 설 기차 승차권 예매 TEST[호남선] --> [네이버 웨일 사용] 접속대기: 176명 ==> 성공(06:59에 클릭함) 
07:10 인터넷 서핑 ==> PC 조립 동영상 시청  
11:40 중식 
12:50 실내 자전거 타기(1시간)
14:00 종료
14:40 인터넷 서핑 ==> 
15:00 설 기차 승차권 예매[경부선] --> [네이버 웨일 사용] --> 포항행은 예매 못함(대기], 서울행은 예매 성공
15:40 집출발(자전거)
16:00 서울 가정의학과 의원 방문 ==> 휴진(수요일은 13시까지 근무) 
16:20 대동초병설유치원 ==> 수종이
16:25 예비 소집(대동초 멀티미디어실) ==> 입학통지서 학교에 제출하고 입학 등록 
16:35 종료
16:40 조은도서관 ==> 휴관
16:50 귀가 
18:20 석식
19:30 실내 자전거 타기(1시간)
20:30 종료
20:40 (국민토너) CLT-K406s 리필 파우더(리필킷 카트리지) 카트리지에 넣기 작업 ==> 검정색 프린트해도 잘 안나옴(실패)
20:40 인터넷 서핑
22:00 취침
==============================================================================================================

- PC 호환성 확인
1. 아싸컴: http://www.assacom.com --> tamario / 20**손*h@
==============================================================================================================

- 펌 방지 해제
1. C브라우저(구 Spell) 다운로드 - 펌방지 해제 프로그램  ==> CBrowser.exe 실행
https://shakermaker.tistory.com/56
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.09(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
05:45 기상
06:00 조식
06:25 실내 자전거 타기(1시간)
07:20 종료 
07:30 인터넷 서핑 ==>  
08:40 집출발(자전거)
08:50 대림역 도착
08:40 삼성역 도착
08:55 투비소프트 교육장(3층) 도착
09:00 Nexacro17 Mobile 교육
11:40 종료 
11:50 중식(도시락, GS25 S25 S9 봉은사 역점): 3,240원
12:05 잠실 올림픽 주경기장(투비소프트 <--> 봉은교  <--> 잠실 올림픽 주경기장) 도보
12:40 종료 
13:00 Nexacro17 Mobile 교육
16:00 종료 
16:20 삼성역 도착
17:00 대림역 도착
17:10 귀가 
17:15 집출발(자전거)
17:25 서울 가정의학과 의원 방문 ==> 진료(발가락 다침: 새끼 발가락만 드래싱), 항생제 주사 ==> 의사가 안 와도 되다고 함(치료 완료)
17:35 래미안 나나 약국 방문 ==> 조재(발가락 치료) 
17:45 조은도서관 ==> 1. PC 조립 & 하드웨어(김시현 ; 권순만 지음) 대여
		 2. PC 조립 하드웨어 무작정 따라하기 : Windows 10 사용자용 / 이순원 지음 대여
		 3. PC 조립 업그레이드 무작정 따라하기 / 이순원 지음 대여
		 4. PC 조립 업그레이드 무작정 따라하기 / 이순원 지음 CD 대여
18:10 귀가  
18:20 석식
19:40 실내 자전거 타기(1시간)
20:40 종료
20:50 인터넷 서핑
23:00 취침
==============================================================================================================

- Nexacro17 Mobile Education
0. 강사: 조천희 책임
1. 모바일 프로젝트 개요
 1) 모바일 프로젝트 개발 방식, UI기획
  가. 반응형 웹( position 값), 나. 적응형 웹
2. 프로젝트 생성
 1) 모바일 프로젝트 개발 방식, UI기획
 2) 화면 생성과 실행 방법, 모바일 개발환경의 이해
 3) MLM(Multi Layout Manager) 실습
3. DeviceAPI, 앱 빌더
 1) DeviceAPI를 이용한 카메라 연동, 앱 빌더를 이용한 앱 생성
4. Android Studio 앱 생성 
 1) Android Studio를 이용한 앱 생성
5. 바코드 연동 
6. 배포 및 제약사항
 1) 배포방법, 모바일 제약사항
7. 기술지원센터 소개
모니터 모델번호 : P2217H
==============================================================================================================

- 지아이데이타에서 지급받은 장비
사용자 : 진태만
노트북 제조회사 : LG
노트북 모델번호 : LG 15UD470-GX50K(S/N: 703QCLH560576)
RAM : 16GB
HDD : 1TB 
SSD : 256GB
부속품(마우스,가방,키보드 여부) : 마우스 1ea, 가방 1ea,  키보드 0ea
모니터 제조회사 : 델
모니터 모델번호 : P2217H
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.10(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
07:30 기상
07:40 조식
08:00 실내 자전거 타기
08:30 종료 
08:40 집출발(자전거): 수종
09:00 구로 보건소 ==> 수종 예방 접종(DTapP 5차, IPV 4차)
09:10 완료
09:20 대동초병설유치원 ==> 수종 데려다 줌
09:35 귀가
10:00 인터넷 서핑
12:00 중식
12:10 실내 자전거 타기
12:40 집출발(자전거)
13:20 건강보험공단 관악지사(서울특별시 관악구 보라매로3길 23 대교 타워 13층 --> 보험급여1팀)
		 ==> 요양비지급청구서(당뇨병소모성재료) 작성(2019년 10월, 2020년 01월 2장): 접수 완료
13:50 조원도서관 방문
14:00 4층 종합열람실 ==> PC 조립 하드웨어 무작정 따라하기 : Windows 10 사용자용 독서
16:00 갤럭시 S8 핸드폰 액정 강화 유리 벗겨냄(핸드폰 액정이 깨진게 아니고 액정 강화 유리가 깨어졌다는 것을 깨달음) 
17:10 종료
18:00 귀가
18:30 LG유플러스 대림역1점(루옌이 아이폰 구입한 지점)에 전화 ==> 갤럭시 S8 액정 보호 필름 요청 --> 주문해서 다음주 중으로
		문자 준다고 함(다음주에 서비스로 받기로 함)
18:40 석식
19:40 실내 자전거 타기(1시간)
20:40 종료
20:50 인터넷 서핑
23:00 취침
==============================================================================================================

- 수종 예방 접종(09시, 구로보건소)
1. DTapP 5차 ==> 완료
2. IPV 4차 ==> 완료
3. MMR 2차
4. 일본뇌염 4차
==> 2개 접종(2개는 1주일 후에 오라고 함): 무료
==============================================================================================================

- 모드애드온 갤럭시 S8 시리즈 3D이지 필름 2매, 갤럭시 S8 액정 보호 필름, 가격: 14,536원
http://www.enuri.com/detail.jsp?similar=Y&IsDeliverySum=N&cate=&modelno=41042846
http://www.ssg.com/item/itemView.ssg?itemId=1000031573407&siteNo=6004&salestrNo=6004&ckwhere=ssg_enuri&appPopYn=n
==============================================================================================================

- 쿠쿠 회원 가입
1. 보온 상태에서 밥 냄새가 난다고 글 올림
- http://www.cuckoomall.com ---> tamario2 / 2020오*h@
-----------------------------------------------------------------------------------------

- 쿠쿠 CRP-P0610FD 분리형내솥뚜껑(Full스텐커버) 2중모션패킹, 가격: 150,110원[2017.09.10(일)에 구매한 제품]
http://www.enuri.com/detail.jsp?modelno=12878688&cate=&IsDeliverySum=N
============================================================================================================== 

- 개인통관고유부호 발급
1. 개인통관고유부호(진태만): P190020517082
2. 개인통관고유부호(강아현): P200000889579
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.01.11(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
05:23 기상
05:36 조식
06:05 집출발(자전거)
06:50 2020년 설날 기차표 입석 구입(KTX, 6시)
07:20 귀가
07:30 인터넷 서핑 ==> 교재 분석
12:00 중식
12:30 실내 자전거 타기(1시간)
12:40 루옌 놀러감
13:30 종료
13:40 인터넷 서핑 ==> 메인보드 분석
17:00 루옌 귀가
17:10 루옌, 수종 놀러감
17:30 석식
18:00 인슐린 약 교체(238U, 22U 남음)
18:20 집출발(자전거)
18:30 LG유플러스 대림역1점(직원이 갤럭시 S8 액정 보호 필름 무료로 붙여줌)
		==> LG V50 ThinQ(6.2인치, 듀얼 스크린) 구입하면 월 5만 4천원(카드 사용시): 생각해본다고 함
18:50 붕어빵(15개, 3천원) 구입
18:00 종료
19:10 실내 자전거 타기
19:35 종료
20:00 인터넷 서핑
21:30 루옌, 수종 귀가
23:00 취침
==============================================================================================================

- 2020년 설날 기차표 입석 구입(KTX, 6시)
1. 포항행[서울(09:25) -> 포항(11:49), KTX]
 1) 2020.01.24(금) [KTX-산천 457] [서울(09:25) -> 포항(11:49)], 1호차 입석 ==> 91,200원(2명) 
==============================================================================================================

- 내 PC이 성능 확인
1. PC Mark: PC Mark 05를 실행해 나온 '종합 점수'로 PC의 성능 상 위치를 파악
2. 3D Mark: 3D Mark 06를 실행해 3D 성능 테스트(3D 게임 구동 능력 파악)
3. HD Tune: 3. HD Tune, Standard를 실행해 하드 디스크의 평균 읽기 속도 테스트
4. Everest: Everest의 Screen Test로 LCD 상태 확인
5. DVD Info: DVD Info실행하여 DVD 드라이브 성능 확인(사용 안함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.12(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 당진행(19:30 ~ 21:30), 강남C)

- 휴가[★]
07:50 기상
08:10 조식 
08:30 실내 자전거 타기(1시간)
09:30 종료
10:20 집출발
10:30 스카이 미용실(이발: 8천원)
11:10 귀가
11:20 다이소 ==> 꽃을 든 남자 세라 마이드 크리닉 칼라(N5 진한 갈색) [5천원] 구입, 아로마향 자동 분사기(화장실용) [5천원] 구입
11:40 뚜레주르 빵짐 ==> 긴 빵: 루옌 
12:10 귀가
12:20 염색(루옌이 해줌)
12:40 중식
13:00 실내 자전거 타기(1시간)
12:40 루옌 놀러감
14:0030 종료
13:40 인터넷 서핑 ==> 메인보드 분석
17:00 루옌 귀가
17:10 루옌, 수종 놀러감
17:30 석식
18:30 집출발
18:40 대림역(7호선) 도착(지하철 탑승)
19:10 고속터미널역 도착
19:20 강남 터미널(호남선)
19:30 서울 출발
21:00 당진터미널 도착 
21:30 32-1번 버스 탑승
22:00 동곡리 정류장 도착
22:10 귀가
22:30 취침
==============================================================================================================

- 포항행[서울(12:40) -> 포항(14:59), KTX] 예약한 것 결제
1. 2020.01.24(금) [KTX-산천 463] [서울(12:40) -> 포항(14:59)], 3호차 3C, 3D ==> 150,000원(2명)
 1) 56,000원 결제[마일리지(94,000원) 모두 사용]
==============================================================================================================

- 삼성전자(주) C-Type 케이블 구입
1. 삼성전자 정품 USB-C타입 고속충전 케이블 (EP-DN930CWE) [벌크, 1.2m], 가격: 3,900원
http://www.enuri.com/detail.jsp?modelno=14297363&cate=&IsDeliverySum=N
==============================================================================================================

- 02. PC조립의 4단계
1단계: 기본 부품 조립하고 테스트하기 @@@
1. 메인보드에 CPU 설치하기
2. CPU에 냉각팬, 히트 싱크 장착하기
3. 메모리 설치하기
4. 메인보드에 맞는 베젤 선택하
5. 케이스에 메인보드 창작하기
6. 케이스에 파워 서플라이 장착하기
7. 메인보드에 LED 커넥터 연결하기
 1) H.D.D LED, IDE LED: 하드디스크
 2) POWER LED, SYSTEM POWER LED: 전원 ==> -: 흰색, 검은색, +: 유채색
 3) RESET, RESET SW: 리셋 스위치(극성 없음)
 4) POWER LED, SYSTEM POWER LED: 전원
 5) SPEAKER, SP: 스피커  
8. 그래픽 카드 설치하기
9. 제대로 조립되었는지 테스트하기(중간 테스트)
 1) 전원 테스트
 2) 파워 서플라이 테스트
 3) 모니터 테스트
 4) 그래픽 카드 테스트
 5) CPU 테스트
 6) 램 테스트
 7) 메인보드와 케이스 테스트 
2단계: 주변 장치 조립과 연결하기 @@@
1. 하드디스크, CD-ROM 드라이브 연결(케이스 뚜껑만 덮지 않았을 뿐 실제적인 조립은 이 단게에서 모두 끝남)
3단계: 외부 장치 연결하기 @@@
1. 마우스와 키보드, USB 장치를 메인보드 백 패너 연결
2. 스피커, 모니터 연결
4단계: 바이오스 설정하기 @@@
1. 바이오스(BIOS)에 하드디스크 및 메인보드와 관련된 환경을 설정하기
==============================================================================================================

- PC 조립 분석(2020.01.11)
0. 컴퓨터 조립 방법및 선정리 방법 입니다~ 보고 따라 해보세요! DAVEN GT404케이스편
https://www.youtube.com/watch?v=XHDniSdtwCk&t=170s
1. PC 조립 기초부터 차근차근!! 컴퓨터 조립 가이드 [4k]
https://www.youtube.com/watch?v=mhBiUvMHxT4 
2. 왕초보 데리고 PC 조립하기 #1
https://www.youtube.com/watch?v=xmGj7hAjH5M&t=45s
3. 중고부품을 최대한 살려서, '선물' 용 컴퓨터를 만들어 주세요 (＠＾－＾)
https://www.youtube.com/watch?v=2OrPROjtkSg 
4. 왕초보도 할 수 있는 컴퓨터 조립하는 방법! #자세한설명 #처음부터끝까지
https://www.youtube.com/watch?v=zDRuSX1trZk
5. 컴퓨터 파워 케이블 연결하는법 (버튼없이 전원 켜는법)
https://www.youtube.com/watch?v=klKTdmH2Ik8&t=4s
6. 선정리 따라하기 3RSYS J210 해머 정복[컴맹이당]
https://www.youtube.com/watch?v=AYRqeELd_fg
7. 컴퓨터조립 8분안에 기초부터 전부 알려드립니다. (AMD 컴퓨터 조립 하는 방법)
https://www.youtube.com/watch?v=jrkEX95rrEQ
- 메인보드의 모든 것! 미래를 여는 지식 PC편
https://www.youtube.com/watch?v=BrUJdPELmsg
- [PC조립! 어렵지 않아요!] intel편 1부
https://www.youtube.com/watch?v=NMIcLQ7yYNs
- 메인보드 단숨에 파악하기[Hello PC 2회]
https://www.youtube.com/watch?v=XsH2qEVo6FI
- Hello PC 8회.wmv[컴퓨터 조립]
https://www.youtube.com/watch?v=SAHM4CPMTwU
- -2- 컴퓨터 PC조립 메인보드 살펴보기[메인보드]
https://www.youtube.com/watch?v=w5a0EoUwuf8 
- MSI 박격포 보드에 고장 부품을 알려주는 LED 가 있긴 한데.. 딱히 필요가 (￢_￢;)
https://www.youtube.com/watch?v=ahKxlWjWlbQ
- [체험판]개인적인 메인보드 아무거나 사지말자(19년7월기준) [체험판의 컴퓨터 채널_안경 돼지]
https://www.youtube.com/watch?v=dVE449BKW_Q&t=12s
- [체험판] Asrock B365M Pro4 소개 및 리뷰[체험판의 컴퓨터 채널_안경 돼지]
https://www.youtube.com/watch?v=b3bP6sp3U3M
- 컴조립에서 가장 까다로운 부분인 전면패널 케이블 연결법[컴퓨터 조립과 정비]
https://www.youtube.com/watch?v=b3b9f_RtKoQ
- PC 청소 어디까지 해봤나요?[컴퓨터 조립과 정비]
https://www.youtube.com/watch?v=vkZJhbsW-Hw
==============================================================================================================  

■■■■■■■■■■■■■■ 2020.01.13(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 지원문에서 임시 출입증 받고 출입(08:20 안전교육 받고 이수증 소유), 석식(18시: 신규 개발팀, 짜장면[북경])
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
1. 유해물질 원격 모니터링 시스템 구축(NoxiousMatterReMot: NoxMatRetMot)
==============================================================================================================
 
- 회의(09시, 회의실)
1. (주)이노 액티브 김철 부사장 주관: 최종규 팀장(innoa@innoa.co.kr), 배문성 사원, 김황 과장, 전양근 사원[개발], 이수아[디자이너]
2. 내용
 1) 2월말까지 개발 완료(Nexacro 공통 밑 개발 포함), 3월 달은 (주)이노 액티브 본사(서울시 금천구 디지털로 9길 33)에서 근무
 2) 오라클 DB 사용
 3) 3D 이미지를 Nexacro에 뛰우는 작업(투비소프트에 자문 구할 것)
 4) 개발할 화면: 54개 --> 60개
 5) 퍼블리셔가 필요함(2주 예상) ==> 디자인 완료 후 컨펌을 기다리고 있음.
 6) 메인인 Safety Keeper(김현규 부장과 협의가 필요함)
 7) 삼성 노트북 지급 받음(인터넷 가능)
==============================================================================================================
 
- GQMS_Tst 셋팅
A. Nexacro 환경 설정
1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창)
  1) Project
    가. General ==> Base Lib Path: C:\GQMS_Tst\workspace\GQMS_Tst\src\main\nxui\GQMS_Tst\nexacro17lib
    나. Generate ==> Generate Path: C:\GQMS_Tst\workspace\GQMS_Tst\src\main\webapp\GQMS_Tst
    다. Deploy ==> Deploy Path: C:\GQMS_Tst\workspace\GQMS_Tst\src\main\webapp\deploy\GQMS_Tst
  2) Environment
   가. General ==> Working Folder: C:\GQMS_Tst\workspace\GQMS_Tst\src\main
	===> Applicatin: 클릭
-----------------------------------------------------------------------------------------------------------------------------

- LMIS_OffLine 셋팅
A. Nexacro 환경 설정
1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창)
  1) Project
    가. General ==> Base Lib Path: D:\01. TAMA_DATA\03. TAMA Project Source\2019.08.20_미래신용 정보 LMIS_OffLine\nexacro17lib
    나. Generate ==> Generate Path: D:\01. TAMA_DATA\03. TAMA Project Source\2019.08.20_미래신용 정보 LMIS_OffLine\webapp\LMIS
    다. Deploy ==> Deploy Path: D:\01. TAMA_DATA\03. TAMA Project Source\2019.08.20_미래신용 정보 LMIS_OffLine\webapp\LMIS
  2) Environment
   가. General ==> Working Folder: D:\01. TAMA_DATA\03. TAMA Project Source\2019.08.20_미래신용 정보 LMIS_OffLine
  ===> Applicatin: 클릭
==============================================================================================================

- 프로젝트용어집_통합_V0.3.xls
유해	NOXIOUS	_NOXIOUS_	2020.01.01.13, by 진태만 추가

원격	REMT	Remt	2020.01.05, by 진태만 추가
유해	NOXIOUS	Noxious	
==============================================================================================================

- 12.29(일) 근무시 메일로 소스 빼내고 나서 최근에 발각(심각)
1. 오이사에게 전화 옴(15시, 사유서 작성하라고 함)
 1) 몸이 안좋아서 숙소에 가서 작업하려고 빼내고 작업 후 모든 소스 삭제함
2. 퇴근 후 사유서 작성해서 오이에게 메일로 보냄
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.14(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00 ==> 현대제철 식당 식권 구입(10시, 33장 174,900원(장 당: 5,300원), 계좌 이체[농협])
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
1. GQMS_Tst 압축 파일 풀기(반디집으로): GQMS_Tst.vol1.egg ~ GQMS_Tst.vol11.egg
==============================================================================================================

- [Eclipse] 이클립스에서 javaw.exe를 읽지 못하는 오류가 생길 경우
1. 현상: No Java virtual machine was found after searching the following locations:
CC:\GQMS_Tst\eclipse\jre\bin\javaw.exe를 읽기 에러
2. 조치: 
 1) 환경변수 등록
  가. C:\GQMS_Tst\java\jdk1.8.0_211\bin 환경변수 >> Path에 등록
  나. 확인
 C:\Users\HDS> java -version
java version "1.8.0_211"
Java(TM) SE Runtime Environment (build 1.8.0_211-b12)
Java HotSpot(TM) 64-Bit Server VM (build 25.211-b12, mixed mode)
 2) C:\GQMS_Tst\eclipse\jre\bin\ 폴더 생성하여 jre 정보 복사하여 붙여넣기 
==============================================================================================================
  
- Tab 제목(탭 제목) 변경(DBeaver에서)
1. 상위 ==> 윈도우(W) ==> 설정 ==> 환경 설정(P) [새창]
 1) DBeaver ==> 편집기 ==> SQL 편집기 ==> 스크립트
==> Script title pattern: <${connectionName}> ${fileName} --> ${fileName}로 변경
==============================================================================================================
 
- 파일 서버
1. \\10.216.139.194 ==> Z:\4.구현\99. 샘플 소스
 1) \\10.216.139.194\공유폴더\4.구현\99. 샘플 소스
2. \\10.216.139.56
==============================================================================================================

- 배인철(퇴사, 프리랜서 선언) 차장에게 전화
1. 메일로 소스 빼내고 나서 최근에 발각되었다고 이야기 함
 ==> 소스 빼내는 방법이 많이 있다고 함(개인 서버? 문의할 것)
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.15(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 17:30 ==> 모니터 박스 숙소에서 가지고 옴(07:40, 박싱: 드라이버 지하 1층에서 빌려옴(필요 없음))
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
1. 유해물질 원격 모니터링 시스템 사용 매뉴얼 작성
==============================================================================================================
 
- 박민형 PM 
1. 박민형 PM(부장, 오토에버, 010-3039-3538): 드라이버 지하1층에서 빌리려 같이 감
==============================================================================================================

- Safety Keeper DB
개발 : USRSHD MASDB(10.216.133.53)
가동 : USRSHA MASDB(10.216.133.53
-----------------------------------------------------------------------------------------------------------------

<!-- oracle DB 설정 --> 
<bean id="dataSourceSpied" class="org.apache.commons.dbcp.BasicDataSource" destroy-method="close"> 
	<property name="driverClassName"  value="oracle.jdbc.driver.OracleDriver" />
	<property name="url" value="jdbc:oracle:thin:@10.216.133.53:1521:USRSHD" />
	<property name="username" value="USRGQD"/>
	<property name="password" value="GQMSDB"/>
</bean> 
==============================================================================================================

- NoxMatRetMot 셋팅
0. 기존 GQMS_Tst Prj 소스로 NoxMatRetMot Prj로 변경 
A. Nexacro 환경 설정
1. 상단 > Tools메뉴 > Options: 클릭 > Options(새창)
  1) Project
    가. General ==> Base Lib Path: C:\NoxMatRetMot\workspace\NoxMatRetMot\src\main\nxui\NoxMatRetMot\nexacro17lib
    나. Generate ==> Generate Path: C:\NoxMatRetMot\workspace\NoxMatRetMot\src\main\webapp\NoxMatRetMot
    다. Deploy ==> Deploy Path: 사용 안함
  2) Environment
   가. General ==> Working Folder: C:\NoxMatRetMot\workspace\NoxMatRetMot\src\main
  ===> Applicatin: 클릭    
---------------------------------------------------------------------------------------------------------------------------
 
- Java Build Path(기존 GQMS_Tst Prj 소스로 NoxMatRetMot Prj로 변경)
1. JRE System Library 변경
 1) eclipse ==> Properties ==> java Build Path ==> JRE System Library: 더블 클릭 ==>JRE System Library(새창)
  가. Alternate JRE --> Intalled JREs 버튼: 클릭 ==> Intalled JREs(새창) --> Edit 버튼: 클릭 ==> Intalled Definition(새창)
 나. JREs Home: C:\NoxMatRetMot\eclipse(변경) --> Finish 버튼: 클릭
==> 출처: https://yongtech.tistory.com/98 [용테크의 포켓머니]
---------------------------------------------------------------------------------------------------------------------------

2. Maven Dependencies
1) maven이 설치 되어 있는 경로의 conf 폴더 아래 setting.xml 파일을 열어 <localRepository>경로</localRepository> 를 수정해 준다.
- / NoxMatRetMot/mavenRepository/settings.xml 파일에서
<localRepository>C:\GQMS_Tst\workspace\GQMS_Tst\mavenRepository\</localRepository>
<localRepository>C:\NoxMatRetMot\workspace\NoxMatRetMot\mavenRepository\</localRepository>
2) eclipse의 window -> preferences -> maven -> Installations로 들어가 Add를 활용하여 maven이 설치되어 있는 폴더는 지정(안해도 됨)
3) window -> preferences -> maven -> user Setttings 의 user Settings의 부분의 경로를 변경된 settings.xml 로 잡아준다.
user Setttings : C:\GQMS_Tst\workspace\GQMS_Tst\mavenRepository\settings.xml
==> user Setttings : C:\NoxMatRetMot\workspace\NoxMatRetMot\mavenRepository\settings.xml
4) 이클립스 재 실행 한 프로젝트를 생성하여 maven의 경로를 확인
==> 출처: https://developstory.tistory.com/9 [DevelopStory]
==============================================================================================================

- 출입보안준수 서약서 사장 직인 요청
1. 지아데이타 김유진 대리에게 카톡 보내서 사장님 직인 받아서 최팀장님에게 메일로 보냄
==============================================================================================================

- 메인(/MainHS.xfdl) 화면 개발
<Cell col="10" text="bind:IMAGE" displaytype="imagecontrol" imagestretch="fixaspectratio"/>
 <Col id="IMAGE">Images::img_na_korea.png</Col>
==============================================================================================================

- 회식(18시 ~ 20시)
1. 바다 수산(횟집, 광어회, 쭈구미탕) ==> (주)이노 액티브 사장, 최종규 팀장, 팀원
2. 최종규 팀장이 현대제철 프로젝트에 도면이 10%밖에 없는데 새로 제작하는 데 시간과 비용(최소 10억)이 많이 든다고 현업이 100%처럼 
	모델링해서 개발해 달라고 요청한다고 함.
3. 김황 과장이 3D 화면 보여주는 방식 제안 
==> 1. Event, 2. API
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.16(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:30 ==>  
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 메인(/MainHS.xfdl) 화면 개발  
1. 해상도: 1280, 994[Safety Keeper] ==> 해상도: 1920, 964
==============================================================================================================

- nexacro studio 17 정보(nexacro17_SetupStudio.exe 다운받아서 업데이트 처리)
1. Product Version: 17.0.0.2700
2. File Version: 2020.1.14.1
==============================================================================================================

- IP 정보 
IPv4 주소 . . . . . . . . . : 10.216.139.55
기본 게이트웨이 . . . . . . : 10.216.139.1
서브넷 마스크 . . . . . . . : 255.255.255.0
==============================================================================================================
 
- 프린터 설치
1. DocuCentre-IV C2265
==============================================================================================================

- 출입보안준수 서약서 사장 직인 요청
1. 핸드폰으로 찍은 사진 까맣게 나와서 다시 보내라고 함. ==> 김유진 대리에게 팩스로 요청(다시 메일로 받음)
==============================================================================================================

- 소스 반출에 대한 사유서 재작성(2번째)
1. 14시 회의실에서 김현진 부장, 오태범 이사 만남 ==> 현대제철에서 전수 조사를 하니 소스 유출 AE 프로젝트(황원철 부장)에서도 발생
 1) 이 사건이 현대제철 본부장까지, 오토에버 상무까지 보고 되었다고 함 ==> 상황 심각
 2) 김현진 부장이 15시까지 사유서 작성해서 메일로 보내라고 함
2. 소스 반출 내역 작성(16:30,  김현진 부장에게 불러 가서 작성함)
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.17(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 17:40 ==> 출입증 수령(15:20, C지구 2층[정문]), 서울행(20:00 ~ 21:50), 당진T --> 18:05 버스[7번]가 당진T로 출발)
								, 21:50 귀가(기령경 놀러 와서 수종이랑 놀고 있음)
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 메인(/MainHS.xfdl) 화면 개발  
1. Div 설정
==============================================================================================================

- 삼성 노트북 암호(비밀번호) 변경
1. DN119100022, as*s12**!
-------------------------------------------------------------------------------------------------

- Hsteelro, 메신저 로그인
1. 1521666, 71스타*!  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.01.18(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
07:50 기상
08:10 조식
09:00 도림천 도보
10:15 귀가
10:20 2020년 설날 기차표(입석) 찾기: 어디에 놓아 놨는지 기억이 안 남
11:00 기령경 친구 만나러 감
12:20 중식
12:30 실내 자전거 타기
12:40 루옌 놀러감
13:30 종료
13:40 인터넷 서핑 
14:20 집출발(자전거): 수종
14:40 이마트 구로점
15:00 다이소 대림2호점 ==> 사탕
15:20 엘마트 ==> 우유 구입
15:40 귀가
15:50 인터넷 서핑
17:10 집출발(자전거): 수종
17:20 대림역 5번 출구 ==> 수종이 루옌 만나서 이모집에 놀러감
17:40 이마트 구로점 ==> 쿠쿠 압력 밥솥 패킹 구입하려고 했는데 만 5천원이라고 해서 놓고 옴
17:50 귀가
18:00 석식 
18:30 실내 자전거 타기
19:30 종료
19:45 집출발(자전거)
19:55 LG유플러스 대림역1점(직원이 갤럭시 S8 액정 보호 필름[SO EASY 고탄력 TPU필름] 무료로 붙여줌) ==> 품질 우수(마음에 듬)
		 --> SO EASY 고탄력 TPU필름 2장 중 1장은 서비스로 받아와서 서랍에 보관해 놓음[추후 사용]
20:00 종료
20:10 귀가 
20:20 인터넷 서핑 ==> 하루 종일 설날 기차표(입석) 잃어 버려서 멘붕옴
21:50 루옌, 수종 귀가
22:50 령경이 귀가
23:00 취침
==============================================================================================================

- 쿠쿠 압력 밥솥 패킹 구입
1. 쿠쿠 고무 패킹(CRP-P0610FD), 가격: 14,490원 ==> 보온 후 밥에서 냄새 방지
http://www.enuri.com/detail.jsp?modelno=27828725&cate=&IsDeliverySum=N
============================================================================================================== 

- 쿠쿠 압력 밥솥 고무 패킹 설치방법 비디오 - M10 Model
https://www.youtube.com/watch?v=bd_9LsEUFeI&feature=youtu.be

- 쿠쿠 밥솥 패킹교체 방법[하철이TV]
https://www.youtube.com/watch?v=zb-NVyWjYO0

- Sub) 전기밥솥 청소 | 전기밥솥 청소법[별맘TV미니멀라이프]
https://www.youtube.com/watch?v=Z4tOUtPVPuI
============================================================================================================== 

- SO EASY 고탄력 TPU필름|갤럭시S8 (G950), 가격: 9,900원 ==> LG유플러스 대림역1점에서 무료로 서비스 받음
http://www.enuri.com/search.jsp?nosearchkeyword=&issearchpage=&searchkind=&es=&c=&ismodelno=false&hyphen_2=false&from=&owd=&keyword=G950+%EC%9D%B4%EC%A7%80+TPU
http://www.tmon.co.kr/deal/1625949094?opt_deal_srl=1641088266&coupon_srl=2464854&utm_source=enuri&utm_medium=affiliate&utm_term=&utm_content=&utm_campaign=%EC%97%90%EB%88%84%EB%A6%AC_DB
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2020.01.19(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 당진행(19:30 ~ 21:30), 강남C)

- 휴가[★]
07:50 기상
08:10 조식 
08:30 실내 자전거 타기
09:30 인터넷 서핑  
12:10 중식
13:00 실내 자전거 타기(1시간)
12:40 루옌, 령경이랑 밥 먹으러 감
14:00 종료 
14:20 집출발
14:30 집출발(자전거): 수종
14:40 다이소 ==> 수종이 수갑 장난감 구입 
14:50 귀가
15:00 인터넷 서핑  
16:10 루옌, 수종 언니집에 놀러감
17:00 석식
17:20 실내 자전거 타기
18:20 종료
19:10 집출발
19:40 쏘카존 가산디지털단지역 4번출구[삼성 노 빌딩 지하 3층) 도착 ==> (주)이노 액티브에서 빌린 차 얻어 탐(최종규 팀장외 3명)
20:00 서울 출발(팀원들이 금요일 치킨 먹고 장염 걸렀다고 함)
21:06 당진 현대 애비뉴 도착
21:10 귀가ㄴ
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.20(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30 ==> 숙소 노트북(윈도우10) 포맷 처리(20시, 숙소), 인슐린 약 교체(21:24, 188U, 10U 남음)
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 공장화면(/MainHS_Fct.xfdl) 화면 개발  
==============================================================================================================

- 속소 노트북, 메일 삭제 처리(10:30)
1. 오태범 이사에게 전화와서 숙소로 가서 숙소 노트북에서 다음 이메일 받은 메일함 모두 삭제 처리하고 돌아옴
==============================================================================================================

- 자리 이동(15시)
1. 웹 개발 파트(전양근 사원) 옆자리로 이동
==============================================================================================================

- 윈도우10 포맷 및 초기화 간단하게 해결! : 네이버 블로그
https://m.blog.naver.com/PostView.nhn?blogId=lucky_box7&logNo=220921513712&proxyReferer=https://www.google.com/

1. 포맷 여부 확인
C:\Users\HDS> systeminfo
원래 설치 날짜:          2019-12-12, 오전 9:53:18  ==> 설치 날짜로 확인
==============================================================================================================
 
- 숙소 노트북(윈도우10) 포맷 처리(20시, 숙소)
1. 윈도우10 설치 USB 없이 포맷 ==> 속도 느리고 상태 안 좋음: 집에서 윈도우10 USB 가지고 와서 다시 OS 설치할 것
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.21(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==>  
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 공장화면(/MainHS_Fct.xfdl) 화면 개발  
1. 3D 이미지 설정: this.WebBrowser01.set_url("null");
==============================================================================================================

- 다음 메일 삭제(09:50)
1. 20119년 9월부터 2020년 01월 19일까지의 모든 받은메일함, 보낸메일함을 삭제하여 오토에버 PM(박민형)에게 메일 보냄
 1) 박민형 PM 이메일(mhpark4347@hyundai-autoever.com)
==============================================================================================================

- 회의(10:30)
1. 김황 과장이 유해화학물질 MAP 구축 웹 개발 부분 설명
 1) Mess, Area, Layer, Icon
 2) 관리자 화면
  가. 권한 10명(예상)
 3) Main(전체), 공장, 설비(상세도면, 설비 정보)
 ==> 샘플소스(index.html) 받음
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.22(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 서울행(18:20 ~ 20:30): (주)이노 액티브에서 빌린 차 얻어 탐[차 방전으로 늦게 출발, 빵, 커피[편의점] 얻어 먹음)
	, 귀가(21시), 석식(21시, 서울집)
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 공장화면(/MainHS_Fct.xfdl) 화면 개발  
1. WebBrowser 이벤트 확인 
==============================================================================================================

- 왼쪽 메뉴(div_LeftMenu)
1. 트리 뷰
 1) Node 형태
2. 리스트 뷰
 1) Array 형태
==============================================================================================================

/***************************************************************************
 * Even   : st_Title01_onclick
 * Desc   : 공장 제목 클릭 이벤트
 ****************************************************************************/  
this.st_Title01_onclick = function(obj:nexacro.Static,e:nexacro.ClickEventInfo)
{ 
	var sTEST  = "DDD";
	this.WebBrowser01.callMethod("codeAddress", sTEST);	  // WebBrowser의 window 객체에 정의된 메소드를 호출하는 메소드  
	//var Variant = this.WebBrowser01.callMethod("codeAddress", sTEST); 
	//trace("[/MainHS_Fct.xfdl] [st_Title01_onclick()] ==> [TEST_51] [Variant]"+ Variant );  
};
==============================================================================================================

- 크롬(Chrome) 설치 오류
1. 현상: 이 웹페이지를 표시하는 도중 문제가 발생했습니다.
2. 원인: 보안 프로그램과 크롬이 충돌하는 것으로 추정(시작프로그램에서 보안 프로그램 삭제 검토)
3. 조치:  C:\Users\HDS\AppData\Local\Google\Chrome\Application\chrome.exe --profile-directory=Default --no-sandbox
 1) --no-sandbox 옵션은 말그대로 보안 기능인 샌드박스를 비활성하 하는 것 이다. 샌드박스를 활성화 하지 않게되면 악성코드가 PC에 
 침입하는게 쉬워 질 수 있다. 그렇기에 저와 같이 급히 어쩔 수 없이 크롬 사용이 필요해 --no-sandbox 옵션으로 크롬을 사용했다면 
 추후 백신을 돌려서 PC를 검사하고 악성코드나 바이러스를 제거
==> https://chunwoomultimedia.tistory.com/20, https://rdsong.com/673 
==============================================================================================================

- 퍼블리싱 관련 회의(13시, 회의실)
1. 최민준(과장: (주)코드파트너즈, 영업)
 1) 현대제철 유해화학물질 MAP 구축 Prj 관련 설명
 2) 실무 퍼블리셔는 다음주에 온다고 함
==============================================================================================================

- 개발 수정 사항[김황 과장]
1. 작업현황 (외주) 데이타 멕시모 + Safety Keeper DB에서 조인해서 가지고 올 것
2. 왼쪽 메뉴 수정
 1) Item 추가
 2) 왼쪽 메뉴 데이타는 모두 DB에서 불러 옴
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.23(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
05:00 기상
05:40 조식
06:00 실내 자전거 타기
07:30 종료 
08:40 집출발(자전거): 수종
09:00 구로 보건소 ==> 수종 예방 접종(DTapP 5차, IPV 4차)
09:10 완료
09:20 대동초병설유치원 ==> 수종 데려다 줌
09:35 귀가
10:00 집출발(자전거):
10:10 4층 종합열람실 ==> PC 조립 하드웨어 무작정 따라하기 등 3권, CD 반납 
10:35 귀가
12:00 중식 
12:30 실내 자전거 타기 ==> 루옌 퇴근
13:30 인터넷 서핑
15:30 쿠쿠 압력 밥솥 고무 패킹 교체 ==> 밥에서 냄새 안나는 것 같음
18:00 귀가 
18:40 석식
19:40 실내 자전거 타기
20:40 종료
20:50 인터넷 서핑
23:00 취침
==============================================================================================================

- (주)이노 액티브 홍주희 사장이 이마트 상품권(5만원) 보냄
==============================================================================================================

- [2020 연말정산 끝장내기] 1부 - 연말정산이란?[떠먹여주는 세법]
https://www.youtube.com/watch?v=kRrizNor3nA
==============================================================================================================

- 포항계 회비 송금(회비 4만원) ==> 완료 @@@
1. 기간(2019.10 ~ 2020.01) --> 총: 4만원
2. 계좌 이체[농협: 356 1171 1224 23, 예금주: 홍승표]
==================================================================================================================

- 부모님 설 용돈 송금 ==> 완료 @@@
1. 30만원 송금
==================================================================================================================

■■■■■■■■■■■■■■ 2020.01.24(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 설 연휴
05:00 기상 
06:00 조식
06:40 실내 자전거 타기
07:40 종료 
08:00 인터넷 서핑 
10:46 인슐린 약 교체(207U, 25U 남음) 
11:30 집출발 ==> 루옌, 수종
11:40 대림역 ==> 서울역
12:20 서울역 도착
12:40 서울 출발(12:40, KTX-산천 463, 특실)
15:00 포항역 도착 ==> 비 조금 옴
15:20 택시(포항역 -> 포항집)
16:00 포항집 도착 ==> 택시비가 3천 3백원 나옴(택시 기사 포항집까지 찾아옴 ==> 어머니한테 5천원 더 빌려서 계산) 
17:00 집출발 ==> 비 조금 옴(우산)
17:20 승표집 도착
17:22 승표집 출발(승표차)
17:30 태정이 태움
18:05 문덕 한우프라자 도착 ==> 석식(소고기[숯불]: 맛 있음)
18:30 포항계 계원 모임 ==> 주남이형, 정철, 진철, 봉춘, 태정, 승표
		--> 봉춘이 닛산 차 중고로 구입
20:00 종료
20:10 카페(바닐라 라떼: 주남이형이 쏨)
21:00 종료
21:10 문덕 출발(승표차)
21:30 포항집 도착 ==> 승표가 비가 와서 태워줌
21:40 도보 
22:30 귀가
22:30 TV 시청
23:40 취침
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.25(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 설날
07:50 기상
09:40 차례 지내기(수종이와 같이 지냄)
10:10 종료
10:30 조식
10:30 도보(영일대 해수욕장 <-> 환여초교)
10:40 로또 구입(10개, 만원): 루옌 5천원 당첨
11:30 귀가
14:00 큰누나네 방문 ==> 명균이 결혼식(4월 25일(토) 14시, 남산예술원 웨딩홀)
14:00 중식
15:20 포항 휴 요양 병원 방문(201호: 아버지 문병) 
16:00 종료
16:20 우현노인복지센터 방문(김태현 대표: 010-6554-1089) ==> 포항시 북구 아치로 69-32(우현동)
		==> 아버지 시설 입소 상담(가격은 요양 병원과 비슷한데 시설이 더 좋음)
		==> 건강보함공단에 방문해서 재가 등급 ===> 시설등급으로 변경 요청.
17:00 귀가 
18:30 석식(떡국)
19:30 도보(영일대 해수욕장 <-> 환여초교)
20:30 귀가
21:00 TV 시청
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■ 2020.01.26(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 설 연휴3
08:00 기상
08:10 조식 
09:40 집출발: 누나 운전 
10:00 포항역 도착  
10:15 포항역 출발(좌석 3명[루옌, 수종, 내]이 같이 앉음)
12:36 서울역 도착
13:00 서울역(지하철)
13:30 대림역
13:40 귀가
14:00 중식
14:30 실내 자전거 타기 ==> 루옌(수종) 언니집에 놀러감
15:30 종료
18:30 중식
19:30 실내 자전거 타기
20:30 종료 
20:40 TV 시청 ==> 영화 '극한직업' 시청(tvN)
23:40 루옌(수종) 귀가
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.27(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 설 연휴4(대체 공휴일(설날))
07:10 기상
07:30 조식
08:00 실내 자전거 타기
09:00 종료 
09:30 인터넷 서핑 ==> 연말 정산
12:00 중식
12:30 실내 자전거 타기
13:30 종료 
14:00 인터넷 서핑 ==> 연말 정산
17:30 석식
18:00 실내 자전거 타기
18:50 종료 
18:50 집출발
19:00 대림역(7호선) 도착(지하철 탑승)
19:25 고속터미널역 도착
19:40 서울 출발
21:00 당진터미널 도착 
21:30 32-1번 버스 탑승
22:00 동곡리 정류장 도착
22:10 귀가
22:30 취침
22:10 취침
==============================================================================================================

- 연말정산 처리
1. 2019년 귀속 연말정산 자료(2020.01.27) 파일 첨부해서 김유진 대리에게 보냄 
 1) 소득.세액공제신고서(진태만).hwp ==> 회사 담당자에게 메일받은 파일을 직접 작성
 2) 진태만(720625)-2019년도자료.pdf  ==> 국세청 편리한 연말정산에서 내려받기함
 3) 공제신고서  ==> 국세청 편리한 연말정산에서 내려받기함
 4) 장애인증명서(진덕근_부).jpg  
==============================================================================================================

- 사랑의 불시착 1~9회
https://www.youtube.com/watch?v=f7EK8sNfgBY
==============================================================================================================

- Microsoft(마이크로 소프트) 홈페이지 로그인 변경
https://www.microsoft.com, tamario@naver.com/ 71스*트!
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.28(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 06:10 인슐린 약 교체(245U, 18U 남음), 김황 과장 1주일 연장(이번주까지 근무)
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 메인(/MainHS.xfdl) 화면 개발  
1.  Sketch 컴포넌트 사용(자바에서 Canvas[캔버스]와 유사)
 /***************************************************************************
 * Even   : btn_save_onclick
 * Desc   : save 버튼 클릭 이벤트
 ****************************************************************************/
this.btn_save_onclick = function(obj:nexacro.Button,e:nexacro.ClickEventInfo)
{ 
var result = this.skc_sign.saveSketch(); // Sketch에 표시되는 이미지를 Base64로 인코딩 된 데이터로 value 속성에 저장

var skcValue = this.skc_sign.value;

this.skc_view.loadSketch(skcValue);
this.ImageViewer00.set_image(skcValue);
 
var result2 = this.skc_sign.saveSketchToFile( "img_sign_91.png", "png", 100 );   // Sketch에 표시되는 이미지를 파일로 저장 
==> 내문서 폴더에 저장(경로 지정 안됨), nexacro Browser에서만 사용 가능 ==> 사인처리가 되는 외부 모듈을 도입해야 함
trace("[/CompExt_Sketch.xfdl] [btn_save_onclick()] ==> [TEST_91] [result2]"+ result2 ); 
};
==============================================================================================================

- noxMat
Disc: 전체화면 ==> noxMat::MainDisc.xfdl
Fmi: 공장단위 ==> noxMat::Fmi.xfdl
Dmi: 설비단위 ==> noxMat::Dmi.xfdl
-------------------------------------------------------------------------------
Bd: 맹판도면 ==> noxMat::BdPop.xfdl
Esm: 비상대피로 ==> noxMat::EsmPop.xfdl
Moi: 물질정보 ==> noxMat::MoiPop.xfdl
Dd: 상세도면 ==> noxMat::DdPop.xfdl
Vw: 외주작업현황View ==> noxMat::VwPop.xfdl  ==> SMT_CONST(안전작업허가_공사) [안전관리고도화 설계서(테이블).xlsx]
Skl: 공정안전자료 ==> noxMat::SklPop.xfdl
-------------------------------------------------------------------------------

- admin
Mtam: 관리자 셋업 ==> admin::Mtam.xfdl
Mm: 관리자 계정 관리 ==> admin::Mm.xfdl
Mtam-1: 물질정보 관리 ==> admin::Mtam-1.xfdl
Mtss-1: 설비정보 관리 ==> admin::Mtss-1.xfdl
==============================================================================================================

- DB 연결 정보
<Resource name="GQMS_SH" auth="Container"
type="javax.sql.DataSource" driverClassName="oracle.jdbc.OracleDriver"
url="jdbc:oracle:thin:@10.216.133.53:1521:MASDB"
username="USRSHD" password="shdusrdb" maxActive="20" maxIdle="10"
maxWait="-1" /> 
1) 운영계 USRSHA / shausrdb
2) 개발계 USRSHD / shdusrdb
==============================================================================================================

91. Back up_[■▲■]
91. Downlaod_Back_up
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.29(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 당진 현대 에비뉴 관리비(2019년 12월, 85,590원) 납부(숙소) 송금
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- 전양근(1521943) 사원에게 Nexacro, NoxMatRetMot 소스 교육(10시)
==============================================================================================================

- WebBrowser 컴포넌트 분석
1. /CallingHtmlMethod.xfdl
==============================================================================================================

- noxMatPop 화면 개발 
Bd: 맹판도면 ==> noxMat::BdPop.xfdl   ---> noxMat::BdPop.jsp
Esm: 비상대피로 ==> noxMat::EsmPop.xfdl
Moi: 물질정보 ==> noxMat::MoiPop.xfdl
Dd: 상세도면 ==> noxMat::DdPop.xfdl
Vw: 외주작업현황View ==> noxMat::VwPop.xfdl
Skl: 공정안전자료 ==> noxMat::SklPop.xfdl
http://localhost:9000/NoxMatRetMot/noxMatPop/painter.html
==============================================================================================================

- admin 화면 개발 
Mtam: 관리자 셋업 ==> admin::Mtam.xfdl
Mm: 관리자 계정 관리 ==> admin::Mm.xfdl
Mtam-1: 물질정보 관리 ==> admin::Mtam-1.xfdl
Mtss-1: 설비정보 관리 ==> admin::Mtss-1.xfdl
==============================================================================================================

- 왕초보 윈도우10 설치 후 꼭 설치해줘야 할 필수 프로그램 7개
https://www.youtube.com/watch?v=UgbbvwpytFU
1. Everythin: 윈도 파일 검색 엔진,  포토 스케이프
==============================================================================================================

- 개인 PC(TAMA, DJCDN119100022) 정보
1. IP 주소:  10.216.139.55
2. GW: 10.216.139.1
3. SM: 255.255.255.0 
============================================================================================================ 

- 마이크로소프트 윈도우10 프로 정품인증 키
1. 윈도우10 Pro retail version, 제품키만 존재(ESD), 가격: 3,900원(집에 있는 조립 PC에 설치 고려) 
https://www.coupang.com/vp/products/314421213?itemId=997298664&vendorItemId=70202986411&src=1032001
&spec=10305201&addtag=400&ctag=314421213&lptag=P314421213&itime=20200129143031&pageType=PRODUCT
&pageValue=314421213&wPcid=15802758314255434372592&wRef=cr2.shopping.naver.com&wTime=20200129143031
&redirect=landing&isAddedCart=
---------------------------------------------------------------------------------------------------------------------------

- Microsoft 오피스2019 Professional Plus 정품
1. 가격: 3,800원
 https://www.coupang.com/vp/products/1176723439?itemId=2155667653&vendorItemId=70153913546&sourceType=SDP_ADS&isAddedCart=
---------------------------------------------------------------------------------------------------------------------------

- 마이크로소프트 윈도우10프로 + 오피스2019 프로 플러스 합본 이메일 발송
1. 윈도우10 Pro Retail version(평생 영구 사용), 제품키만 존재(ESD), 윈도우10 전용, 1대의 PC에서만 사용 가능, 가격: 5,000원
https://www.coupang.com/vp/products/1183235436?itemId=2163551944&vendorItemId=70161733199&sourceType=SDP_ADS&isAddedCart=
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.30(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 김은아 유치원 교사 최종 합격(경기도)
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- WebBrowser 컴포넌트 분석
1. /CallingHtmlMethod.xfdl
==> http://localhost:9000/NoxMatRetMot/noxMatPop/CallMethod.html
2. /CompExt_WebBrowser.xfdl 
==> http://localhost:9000/NoxMatRetMot/noxMatPop/CompExt_WebBrowser.html
==============================================================================================================

- /CallMethod.html 파일에서
<!DOCTYPE html>

<html>
<meta http-equiv="X-UA-Compatible" content="IE=8" />
<head>
    <meta charset="UTF-8">
    <title>CallMethod TEST</title>
</head>
 
<body>
<header>CallMethod TEST</header>

   <p>버튼을 클릭!</p>
   
<input type="text" id="txtActionRst" style="width:600px; height:50px;"> <!--// 액션 결과값 //--> <br><br>
<input type="button" value="Click" onclick="setContent('click')">
<input type="button" value="Click_02" onclick="setContent_02('click_02')">
 
 <script type="text/javascript"> 
    if (! window.NEXACROHTML) 
	{
		window.NEXACROHTML = {};
	}

/***************************************************************************
* Even   : setContent
* Desc   : 웹페이지에서 nexacro쪽으로 정보를 전달할 때 발생하는 이벤트
****************************************************************************/
function setContent(str)
{
	//alert("[/CallMethod.html] [setContent()] ==> [TEST_01] [Click 버튼 클릭 이벤트]]" ); 
	  
	var sActionUrl = "noxMat::Dmi.xfdl";     // URL
	var sStr = str +"&sActionUrl="+ sActionUrl;  
	alert("[/CallMethod.html] [setContent()] ==> [TEST_51] [Click 버튼 클릭 이벤트] [sStr]"+ sStr ); 
	 
	document.getElementById('txtActionRst').value = sStr; // 액션 결과값

	window.NEXACROHTML.FireUserNotify(sStr);
}

/***************************************************************************
* Even   : setContent_02
* Desc   : 웹페이지에서 nexacro쪽으로 정보를 전달할 때 발생하는 이벤트
****************************************************************************/
function setContent_02(str)
{
	//alert("[/CallMethod.html] [setContent_02()] ==> [TEST_01] [Click_02 버튼 클릭 이벤트] [str]"+ str ); 

	var sActionUrl = "noxMat::Dmi_02.xfdl";     // URL
	var sStr = str +"&sActionUrl="+ sActionUrl;  
	alert("[/CallMethod.html] [setContent_02()] ==> [TEST_52] [Click 버튼 클릭 이벤트] [sStr]"+ sStr ); 
	 
	document.getElementById('txtActionRst').value = sStr; // 액션 결과값

	window.NEXACROHTML.FireUserNotify(sStr);
}

/***************************************************************************
* Even   : FireUserNotify
* Desc   : 웹페이지에서 nexacro쪽으로 정보를 전달할하는 함수
****************************************************************************/
window.NEXACROHTML.FireUserNotify = function(userdata) 
{
	//alert("[/CallMethod.html] [FireUserNotify()] ==> [TEST_01] [Nexacro 전용 브라우저 여부]"+ window.NEXACROWEBBROWSER ); 

	if (window.NEXACROWEBBROWSER)     // Nexacro 전용 브라우저 이면
	{  
	window.NEXACROWEBBROWSER.on_fire_onusernotify(window.NEXACROWEBBROWSER, userdata);
	} 
	else  // Nexacro 전용 브라우저가 아니면
	{ 
	window.document.title = userdata;    // 웹페이지에서 nexacro쪽으로 정보를 전달
	}
}    
    </script> 
</body>
</html>
--------------------------------------------------------------------------------------------------------------------------------------------

- /CallingHtmlMethod.xfdl 파일에서
/***************************************************************************
 * Even   : WebBrowser00_onusernotify
 * Desc   : WebBrowser에 로드된 웹페이지에서 nexacro쪽으로 정보를 전달할 때 발생하는 이벤트
 ****************************************************************************/
this.WebBrowser00_onusernotify = function(obj:nexacro.WebBrowser,e:nexacro.WebUserNotifyEventInfo)
{ 
	trace("[/CallingHtmlMethod.xfdl] [WebBrowser00_onusernotify()] ==> [TEST_01] [데이타 받기] [e.userdata]"+ e.userdata ); 

	if(e.userdata == "click&sActionUrl=noxMat::Dmi.xfdl")    // WebBrowser에서 userdata 속성을 사용하여 click를 받아 왔으면
	{
		this.Edit01.set_value("[Web Browser에서 받아온 데이타]"+ e.userdata );
		trace("[/CallingHtmlMethod.xfdl] [WebBrowser00_onusernotify()] ==> [TEST_51] [데이타 받기_성공]" ); 
	}

	if(e.userdata == "click_02&sActionUrl=noxMat::Dmi_02.xfdl")  // WebBrowser에서 userdata 속성을 사용하여 Click_02를 받아 왔으면
	{
		this.Edit01.set_value("[Web Browser에서 받아온 데이타_Click_02]"+ e.userdata ); 
		trace("[/CallingHtmlMethod.xfdl] [WebBrowser00_onusernotify()] ==> [TEST_52] [데이타_Click_02 받기_성공]" ); 
	}
}; 
==============================================================================================================

- 현대 오토에버 보안팀 회의(10시)
1. 보안팀, 진선철 과장, 박민형 PM
 1) 소스 유출에 대한 경위 질문
 2) 보안팀에서 내자리에 와서 현재 노트북 검사
==============================================================================================================

■■■■■■■■■■■■■■ 2020.01.31(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 15:00 ==> (주)이노 액티브 김철 부사장 방문(10시), 서울행(15:05 ~ 16:30): (주)이노 액티브 팀원들 차 얻어 탐
								--> 16:30 천왕역 1번 출구 도착 --> 16:50 대림역 --> 17시 귀가
 
- 현대제철 유해화학물질 MAP 구축 Prj[★]
- WebBrowser 컴포넌트 분석
1. /CallingHtmlMethod.xfdl
==> http://localhost:9000/NoxMatRetMot/noxMatPop/CallMethod.html
2. /CompExt_WebBrowser.xfdl 
==> http://localhost:9000/NoxMatRetMot/noxMatPop/CompExt_WebBrowser.html
==============================================================================================================

- 모니터 문의
1. 오토에버 이규선 대리가 내자리에 와서 저번 프로젝트 때 사용하든 모니터 문의 ==> 내가 니 자리 옆에 돠뒀다고 함.
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //------------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
