

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2020.07) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2020.07.01(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 ==> 석식(스페설 정식: 김밥천국): 설사 3번 함
 
- 롯데카드 채권 모바일 시스템 구축 Prj[★]
- 개발서버, 로컬 서버 웹스퀘어 라이센스 만료됨
1. 롯데카드 서버 담당자가 16시가 되어서 처리 해줌 ==> 서버 속도가 너무 느려서 18시에 퇴근함
==============================================================================================================

- Websquare 라이선스 키 등록(라이센스 등록)
0. (주)인스웨이브 모성종 연구원이 메일로보내줌
1. eclipse > Help > 웹스퀘어 라이선스 등록 > 라이선스 키(license)
2020년 12월 31일 만료 WebSquare Platform, Hybrid, Push 통합 라이선스 (cpu = 64)
uzf+LOVM9WDw9VFVST0Q3S0k3WU5TM1I=
Q4mf0o04GbuxLgKyCPihbGvTr8BG7uz54KvOJ7jEKzJnqVlpQYuh1dPH5D18Q3i8Wjn6SXc
TqRPbsiSehr1Waw1jzqDXDLfruy0zx8=
--------------------------------------------------------------------------------------------------------

2. Loading License. PATH: C:\WS5_SAMPLE\RESOURCE\websquare_home\license\license 파일에 복사, 붙여넣기
uzf+LOVM9WDw9VFVST0Q3S0k3WU5TM1I=
Q4mf0o04GbuxLgKyCPihbGvTr8BG7uz54KvOJ7jEKzJnqVlpQYuh1dPH5D18Q3i8Wjn6SXc
TqRPbsiSehr1Waw1jzqDXDLfruy0zx8=
================================================================================================================

- 공지사항 파일 업로드 Hybird 처리
1. 파일 다운로드 안됨 ==> 엑셀 다운로드 확인해 볼 것
var url = "http://lottr.com/fileaupload/up/202006300000.xlsx";  	 // URL
==============================================================================================================

- 공지사항 팝업 문제
1. 창닫기를 하고 창을 열면 해당 화면이 refresh 안됨
==============================================================================================================
   
- 파일업드 문서 작성(종이)
==============================================================================================================

- mybatis 쿼리, 쿼리결과 로깅을 위한 log4j.xml 설정 
출처: https://stove99.tistory.com/69 [스토브 훌로구]
<!--// SQL Logger //-->
<!--// 01. SQL문과 해당 SQL을 실행시키는데 수행된 시간 정보(milliseconds) //-->
<logger name="jdbc.sqltiming" additivity="false">
	<level value="INFO" />
	<appender-ref ref="console" />
</logger>
 
<!--// 02. SQL문만을 로그로 남기며 PreparedStatement일 경우 관련된 argument 값으로 대체된 SQL문을 기록함(? 제거) [필수 @@@]  //-->
<logger name="jdbc.sqlonly" additivity="false">
	<level value="DEBUG" />
	<appender-ref ref="console" />
</logger>

<!--// 03. ResultSet을 포함한 모든 JDBC 호출 정보를 로그함[방대한 양] //-->
<logger name="jdbc.resultset" additivity="false">
	<level value="OFF" />
	<appender-ref ref="console" />
</logger>

<!--// 04. SQL 결과 조회된 데이터를 table 형태로 로그에 기록함[필수 @@@]  //-->
<logger name="jdbc.resultsettable" additivity="false">
	<level value="DEBUG" />
	<appender-ref ref="console" />
</logger>

<!--// 05. DB Connection Open/Close 정보 로그 기록함 //-->
<logger name="jdbc.connection" additivity="false">
	<level value="WARN" />
	<appender-ref ref="console" />
</logger>

<!--// 06. ResultSet을 제외한 모든 JDBC 호출 정보를 로그를 기록함. 많은 양의 로그가 생성되므로 특별히 JDBC 문제를 추적해야 
할 필요가 있는 경우 사용함 //-->
<logger name="jdbc.audit" additivity="false">
	<level value="WARN" />
	<appender-ref ref="console" />
</logger>

<!--// Root Logger //-->
<root>
	<level value="DEBUG" />	<!--// 로깅레벨(FATAL, ERROR, WARN, INFO, DEBUG) ==> 수정: 2019.03.19, by 진태만 //-->
	<appender-ref ref="console" />
</root>
================================================================================================================

- 로그 출력 등급표
로그 출력 등급	설명
FATAL	어플리케이션을 중지해야 할 심각할 오류
ERROR	오류가 발생 했지만, 어플리케이션은 계속 실행할 수 있는 상태
WARN	잠재적 위험을 안고 있는 상태
INFO	어플리케이션의 주요 실행 정보
DEBUG	어플리케이션의 내부 실행 상황을 추적해 볼 수 있는 상세 정보
TRACE	디버그보다 더 상세한 정보
================================================================================================================

- 공인인증서 재발급 
1. 신한은행(https://bank.shinhan.com/index.jsp#200101000000) > 인증센터 > 갱신
 1) 비밀번호 변경 ==> 2*2*오*ss@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.02(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:50 ==>  
 
- 롯데카드 채권 모바일 시스템 구축 Prj[★]
- Hybird에서 파일 다운로드 안됨  
 Hybird에서 파일 다운로드 안됨 ction() {
	var uploadFileNm = dlt_getCellData(0, 'AN_FILE_ID');  // 업로드된 파일명

	var url = 'http://lottr.com/fileUpload/up/'+ 
	uploadFileNm;  // Download 모듈 URL

	var opt = {
			'url' = url,
			'progress' = true, 
			'open' = true, 
			'notify' = true
	}

	$h.contents.fileDownload(success, fail, opt}; 	// 파일 다운로드
};   
-----------------------------------------------------------------------------------------------------------

- 실제 URL
http://lottr.com/fileUpload/up/202006300000.xlsx 
==============================================================================================================

- Hybird에서 trigger를 사용하면 style, class 적용 안됨
1. trigger 대신 anchor를 사용하여 해결함
<xf:triggger type='button' id='triger1'	style='width:77px; height:22px';background:url(images/notice/btn_file.gif) no-repeat 0 0; 
	display:inline-block; position:relaltive;'  ev:onclick='scwin.btn_openFile'>
	<xf:label><![CDATA[찾기]]></xf:label>
</xf:triggger>

<w2:anchor id="triger1" class="btn_openFile" ev:onclick="scwin.btn_openFile"   uterDiv="true" style="">
		<xf:label><![CDATA[찾기]]></xf:label>
	</w2:anchor>
==============================================================================================================

- Hybird에서 팝업 문제
1.창닫기를 하고 창을 열면 해당 화면이 refresh 안됨
1. open_close() 함수에 메뉴 ID를 추가해서 해결함
 1) open_close() ==> _open_close('DDD');	// 공지사항 상세하면 닫기
==============================================================================================================

- Hybird 공지사항 테스트 수행
1. 웹에서 공지사랑 등록, 수정, 삭제
2. 웹에서 공지사랑 파일 업로드 등록, 수정, 삭제
3. Hybird에서 공지사랑 등록, 수정, 삭제
4. Hybird에서 공지사랑 파일 업로드 등록, 수정, 삭제
5. 웹, Hybird에서 공지사랑 파일 업로드 등록, 수정, 삭제
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.03(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  롯데카드 채권 모바일 시스템 구축 Prj 철수(18시)
 
- 롯데카드 채권 모바일 시스템 구축 Prj[★]
- Hybird 공지사항 테스트 수행
==============================================================================================================

- Hybird 공지사항 eclipse에 커밋 처리
1. 롯데카드 형상관리 툴 Git 사용
[Git] 형상관리와 Git (1편) - Git 저장소 생성 - https://cornswrold.tistory.com/59
==============================================================================================================

- 운영 서버 배포 리스트(반영리스트) 정리, 전달
1. 진태만(2020.07.03).zip 만들어서 IT 운영팀 장인우 책임에게 메일로 보냄
==============================================================================================================

- Hybird 공지사항 기능
1. 웹에서 그리드로 한번에 5개 업로드 가능
3. 앱에서 한번에 하나씩 저장(5번 등록 가능)
4. 웹과 앱에서 등록된 첨부 파일 서로 수정, 삭제 가능
----------------------------------------------------------------------------------------------------------------------

- 공지사항 개발 목록
1. 공지사항 목록 화면(/ZZUCME0010P.xml)
2. 공지사항 등록, 수정 화면(/ZZUCME0030P.xml)
3. 공지사항 상세 화면(/ZZUCME0020P.xml)
==============================================================================================================

- 롯데카드 채권 모바일 서버
1. 원격관리시스템(일상감사) ==> PJ01620/qwqw1212!
 1) 터미널 접속(FTP, PUTTY) ==> jboss/jboss0718!
2. 로그인(보안, 메일, 메신저) ==> PJ01620/djdnwls1!(어우진1!) 
==============================================================================================================

- 터미널에서 서버 재시작
> cd /sw/jboss/servers/dbapsver01_bapp01
> ./shutdown.sh
> ./start.sh
> tail -f /log/jboss/dbapsver01_bapp01/sever.log			-- 로그 분석 @@@
==============================================================================================================
  
- 롯데카드 채권 모바일 공지사항 검수(17시, 함형국 대리)
1. 무난하게 검수 끝남 ==> 공지사항 파일 업로드는 문제 없음
 1) 공지사항 파일 다운로드는 (주)인스웨이브에서 받은 소스로 가이드 대로 했는데 안됨: 인스웨이브에 문의하라고 함
 ==> 오태범 이사에게 보고, 황원철 부장에게 해당 사항 문자로 보냄
==============================================================================================================
 
- [설명충/보똑스]아직도 쿼티 키보드 쓰니?(Qwerty keyboard) 스마트폰 키보드 설정에 대해 알아보자(feat.천지인 플러스) 꿀팁영상
https://www.youtube.com/watch?v=Q6O63CmXd8Q
=================================================================================================================

- 아직도 기본 키보드기능을 이용하시나요? 추천앱 네이버 스마트보드
https://www.youtube.com/watch?v=xr7_ESQPX8E
=================================================================================================================
 
- 삼성 모아키 한글 키보드
1. 삼성 모아키 한글 키보드 홈페이지 ==> http://www.moakey.com/#userguidePage
https://blog.naver.com/blurayha/221642106361
https://binropic.tistory.com/152
1. 핸드폰 => 설정 ==> 일반 ==> 언어 및 입력 방식
 1) 기본 키보드 ==> 모아키 통합키보드: 양손으로 선택
 2) 키보드 ==> 스크린 키보드 ==> 모아키 통합키보드 ==> 한글 입력 방식 선택: 양속 모아키: 선택 
2. 입력 방식
 1) 긋기 전용
 2) 긋기 + 팝업 입력 모드
 3) 긋기 + 모음 입력 모두(초보자용)
=================================================================================================================

- 현대제철 안전관리에서 보안 사고 났다고 오이사에게 전화 왔다고 함
1. 현대제철 유해화학물질 MAP 구축 Prj에서 운영 서버 DB에 회원 아이디 2개를 임의로 만들었다고 함
 1) 현대제철 유해화학물질 MAP 구축 Prj가 자체가 3D여서 속도가 너무 느려서 아이디 2개를 사용 했다고 함.
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.04(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
07:00 기상 ==> 은영이, 은영이 엄마 어제 밤에 와서 자고 감(14시에 집에 감)
07:40 조식
08:00 실내 자전거 타기
09:00 종료
10:00 인터넷 서핑  
10:20 현대제철 재택 VPN 연결 ==> 현대제철 안전관리 결함 사항 VPN 연결(로그인)이 안되어서 못 함
12:00 중식
12:30 실내 자전거 타기 ==>  VPN 연결(로그인 )완료, 현대제철 제 노트북(10.216.139.55)에 연결을 하면 에러가 나서 일 못함
13:15 종료 
12:20 인터넷 서핑
13:30 루옌 놀러감 
15:10 샤워 ==> 체중: 73.2kg
15:38 인슐린 약 교체(276U, 11U 남음)
18:20 집출발(자전거)
18:30 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 10,900원) 구입 
18:50 귀가
19:10 석식
19:20 루옌 귀가
19:35 실내 자전거 타기
19:35 종료
19:40 인터넷 서핑
21:00 가계부 월말 결산 
22:00 취침
=================================================================================================================

- 현대제철 재택 VPN 연결[2020.07.04(토)]
1. https://hdsteel-vpn.hyundai.com/my.policy, 1521666 / a1521666!0000   ---> asas1212!   
 1) 로그인 에러: "사용자 이름 또는 암호가 올바르지 않습니다. 사용자 정보를 다시 입력해 주십시오."라는 에러가 뜸 
 
- 현대제철 재택 VPN 연결 
1. https://hdsteel-vpn.hyundai.com/my.policy, 1521903/Xodhks104!!  ---> 김태완과장 계정 ■■■
 1) 연결 에러..현대제철 제 노트북(10.216.139.55)에 연결을 하면 에러가 남.
   가. 내 PC 로그인 ==> HYUNDAISTEEL\DN119100022 / asas1212!  
 ==> 박민형PM이 다음주 수요일쯤 당진가서 노트북 확인 한다고 함.(현대제철 안전관리 결함 사항 수정 처리 못 함)
=================================================================================================================

- 포토 스케이프 사용법 강좌 1강 사진편집 기능 소개 동영상 (2019) [마케팅닥터]
https://www.youtube.com/watch?v=xKlVm6NUZuQ
https://www.youtube.com/channel/UComXQoR7S4f5cZcLjkskzEA/search?query=%ED%8F%AC%ED%86%A0
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.05(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말2[★]
07:30 기상
08:40 조식
09:00 실내 자전거 타기 
10:10 종료 
10:05 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료
14:30 집출발(자전거: 수종)
14:40 다이소 대림2호점(방향제 구입)
15:00 이마트 구로점(르카프 신발 깔창 구입) 
15:30 귀가 
15:40 인터넷 서핑 ==> 롯데카드 파일 업로드 문서 정리
16:20 루옌(수종) 보라매 공원에 놀러감
18:10 석식
18:30 실내 자전거 타기
19:30 종료  
19:40 인터넷 서핑 
20:50 루옌(수종) 귀가  ==> 은영 엄마와 같이 와서 짜증남
22:10 루은영 엄마 귀가
23:10 취침
=================================================================================================================
 
- 컴퓨터성능 및 사양 알아보기 dxdiag 실행 
1. 윈도우(Win) 키 + R ==> 실행(새창)
  1) 열기(O): dxdiag 입력: --> 확인 ==> DirectX 진단 도구(새창) [diagnosis: 진단]
=================================================================================================================

- 윈도우 시작 프로그램 관리(msconfig)
http://blog.naver.com/wow_press/221893270767
1. 윈도우(Win) 키 + R ==> 실행(새창)
  1) 열기(O): msconfig 입력: --> 확인 ==> 시스템 구성(새창) ==> 시작프로그램(Tab)
=================================================================================================================

- 윈도우10 시작프로그램 추가 및 제거 관리하는 방법 
 https://prolite.tistory.com/1102
1. 윈도우(Win) 키 + R ==> 실행(새창)
  1) 열기(O): shell:startup 입력: --> 확인 
2) 그럼 시작프로그램 폴더가 뜨는데요. 여기서 부팅 시 실행시킬 파일을 드래그하여 복사 및 이동하면 끝 
C:\Program Files (x86)\Notepad++/notepad++.exe 마우스 우클릭: 바로가기 만들기(S) ==> notepad++.exe - 바로 가기: 복사하여 붙여넣기
C:\Program Files\Q-Dir\Q-Dir.exe 마우스 우클릭: 바로가기 만들기(S) ==> Q-Dir.exe - 바로 가기: 복사하여 붙여넣기
C:\Program Files (x86)\Naver\Naver Whale\Application\whale.exe 마우스 우클릭: 바로가기 만들기(S) ==> whale.exe - 바로 가기: 복사하여 붙여넣기
C:\WS5_SAMPLE\STUDIO\eclipse\01. WS5_SM.exe마우스 우클릭: 바로가기 만들기(S) ==> 01. WS5_SM.exe - 바로 가기: 복사하여 붙여넣기

- 개인 노트북(MSI 노트북: 윈도우7)
C:\Users\Administrator\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup
Q-Dir   ==> 추가 @@@ 
notepad++   ==> 추가 @@@
메모잇(Memoit)   ==> 추가 @@@ 
whale ==> 추가 @@@ 
01. WS5_SM ==> 추가 @@@ 
-------------------------------------------------------------------------------------------------------------

- 개인 노트북(MSI 노트북: 윈도우7)
C:\Users\Administrator\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup
Q-Dir   ==> 추가 @@@ 
notepad++   ==> 추가 @@@
메모잇(Memoit)   ==> 추가 @@@ 
whale ==> 추가 @@@ 
01. WS5_SM ==> 추가 @@@ 
-------------------------------------------------------------------------------------------------------------

- 회사 노트북(LG 노트북: 윈도우10)
C:\Users\tamar\AppData\Roaming\Microsoft\Windows\Start Menu\Programs\Startup
Q-Dir   ==> 추가 @@@ 
notepad++   ==> 추가 @@@
메모잇(Memoit)   ==> 추가 @@@ 
whale ==> 추가 @@@ 
01. WS5_SM ==> 추가 @@@ 
KakaoTalk==> 추가 @@@ 
=================================================================================================================

- 레고 캠핑카 구입(재구입)
1. [해외 배송] 레고 시티 60182 픽업트럭과 캐러밴, 혼합 색상 레고 시티 60182 픽업트럭과 캐러밴, 혼합 색상, 가격: 56,000원 
 1) 7/14 도착 예정 (상품 1개) 판매자 : 데이원
https://www.coupang.com/vp/products/57663116?vendorItemId=70726259978&isAddedCart=
=================================================================================================================

- 지방대 개발 비전공자가 배달의민족 리드 개발자가 되기까지
https://www.youtube.com/watch?v=V9AGvwPmnZU
=================================================================================================================

- 프로그래머로 살아남기 위해 필요한 언어 둘[포프TV]
https://www.youtube.com/watch?v=ESU2IkFj9VM
1. Managed Language(매니지드 언어): 대표적인 언어로는 C,C++로 메모리의 할당과 해제	를 통한 메모리를 관리하여야 메모리의 누수가 
없게 신경을 써줘야 하지만 언매니지드 언어에 비해 속도가 빠릅니다. 또한, 메모리를 구체적인 관리를 할수 있기 때문에 프로그래밍의 
자유도가 높습니다.
--------------------------------------------------------------------------------------------------------------------

- 이것이 C언어다[한빛미디어]
https://www.youtube.com/watch?v=wWJ3koUPPG4&list=PL_TL0F8qj1eiZJp8zzaNyf_w1PE7zwFGh
=================================================================================================================

- App 개발 방법 분석
1. App 종류 
 1) IOS: 애플 --> 아이폰
 2) Android: 삼성, LG --> 안드로이드폰  ==> 안드로이드 스튜디오
2. 기타
 1) Compile: 컴퓨터가 이해할 수 있는 기계어로 변환하는 작업
 2) Build: 소스코드 파일을 실행가능한 소프트웨어 산출물로 만드는 일련의 과정(예: .apk)
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.06(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 지출결의서_진태만(2020.06, 07) 작성, 제출[출력, 64,650원 청구])

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행 모바일 뱅킹(jWEB) 프로젝트 시작
1. 인원: 구종식 부장(PM),  이경일 부장(공통), 이윤석 차장(공통), 박찬형(대리), 박건유(대리), 김유이 사원, 한혜숙 부장(프리)
1. 광주은행 워크플로우(Workflow) 기준 ==> W-XTouch
 1) 본인인증 ==> 동의 약관 ==> 신청 
=================================================================================================================
 
- 충전기, 케이블 구입(드림디포 문구 본점(선릉역 7번 출구에서)
1. 커네틱 CCC-21 C타입 케이블(2.4A, 2M, (주)씨엔에스 파워, 가격: 7,800원)
2. 3M 마이크로 5핀 가정용 충전기(2,100mA, USB 1포트, 1.5M, 충전 케이블 포함: 고속, 가격: 10,000원) 구입
=================================================================================================================

- WS5_SAMPLE 파일 소스 회사 PC에 설정
1. /websquare.jsp 파일에서
<title> WS5_S</title>
<!-- 		<title>Project Template</title> --> 
=================================================================================================================

- Websquare 표준API 검색
1. w3schools.com ==> 검색: date ==> setUTCMinutes(): 클릭 ==> 
 1) Browser Support ==> 모두 YES인 것 만 사용할 것
=================================================================================================================

- Websquare 선택
1. w + Ctrl + Space 바 ==> WebSquare 팝업됨 --> WebSquare 선택
=================================================================================================================

- Websquare Help 활용
1. 화면 ==> 하단 Help Tab --> Related Topics(선택)
 1) Design Veiw ==> Grid: 클릭 
GridView 속성
GridView 이벤트
GridView API
 2) Design Veiw ==> multiupload: 클릭  
Multiupload 속성
Multiupload 이벤트
Multiupload API
=================================================================================================================
 
- WebSquare2 동영상 시청
https://www.youtube.com/user/inswave/videos?view=0&sort=dd&shelf_id=0
1. XPath: HTML에서 특정 부분에서 데이터를 추줄하기 위해 사용하는 코드
 =================================================================================================================
  
- 대동초 e-알리미 어플 설치
1. 이제부터 진수종 알림장 핸드폰으로 보낸다고 함.
=================================================================================================================

- 크롬 개발자 도구
- 크롬 개발자 도구 2 - 1. Elements[생활코딩] [★]
https://www.youtube.com/watch?v=9fkLXo-ALc0

- 크롬 개발자 도구 3 - 2. Resources[생활코딩] [★]
https://www.youtube.com/watch?v=jbbU7UBLiCQ

- 크롬 개발자 도구 5 - 4. Sources(디버깅) [생활코딩]] [★]
https://www.youtube.com/watch?v=L52UucF_y0U&t=5s

- 크롬 개발자 도구 9 - 9. Console(디버깅) [생활코딩]] [★] 
https://www.youtube.com/watch?v=LEcExA5TGZg&t=5s
1. Console Tab 에서
> console.log(1);
> console.log(window);

2. 다른 Tab 에서(Elements Tab)
>=: 클릭
> console.log(1);

3. Chrome 개발자도구 (Command Line API & Console API ) 
 ==> https://softm.tistory.com/entry/Chrome-%EA%B0%9C%EB%B0%9C%EC%9E%90%EB%8F%84%EA%B5%AC-Command-Line-API-Console-API
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.07(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행 모바일 Admin 로컬 서버 셋팅
1. C:\WS5\ 
==> http://localhost:8080, 210001 /1212
2. WS5 정보 ==> 이경일 부장이 광주은행 Workflow 프로젝트로 사용한 걸 모든 개발자에게 공유함
 1) Eclipse IDE for Enterprise Java Developers. Version: 2019-06 (4.12.0) Build id: 20190614-1200
=================================================================================================================

- 제주은행 모바일 Admin 로컬 DB 서버 정보
driver=oracle.jdbc.pool.OracleDataSource
url=jdbc:oracle:thin:@192.168.0.27:1521:xe
username=WORKFLOW
password=qwe123
=================================================================================================================

- 제주은행 워크플로우(Workflow) 설명(14시, 본사 사업장)
1. 이경일 부장(공통)이 설명해줌
 1) Task, 프로세스
 2) 분석, 설계는 제주도에서 하고 있다고 함 ==> 7월말 완료 예정
 3) 전문 통신 신규로 해야 함 ==> 시간이 많이 걸릴 것으로 예상함
 4) 개발 완료 ==> 10월 말
=================================================================================================================

- 메인 화면
1. TASK 관리 ==> /WF001M.xml
2. 프로세스 관리 ==> /WF002M.xml.xml
=================================================================================================================

- 웹표준 기반의 웹 퍼블리싱 HTML5, CSS3 강좌
1. https://www.youtube.com/playlist?list=PLq8wAnVUcTFUffyIZTTV0LZr1RrfQEuHX
=================================================================================================================

- [로지텍 코리아] M325 무선 마우스 구입 검토
http://www.enuri.com/detail.jsp?modelno=7143441&cate=&IsDeliverySum=N
1. 제조사: 로지텍|브랜드: 로지텍|마우스|광|무선|2.4GHz|미니|3버튼|틸트휠(↕↔스크롤)|최대감도:1000dpi|양손형|수신기:초소형(유니파잉),
수납가능|AA건전지x1|전원스위치|색상:블랙,블랙+그레이,블랙+블루,블랙+핑크|크기:6x9x3.2cm,. 가격:  26,860원  
(걸리는 선도 없고, 틸트휠로 편리하고! 건전지는 교체없이 최대 18개월 사용가능)
2. 드림디포 안국점(구입 검토) 
=================================================================================================================

- 이고진 미니 바이크 EM960 구입 검토
1. 제조사: 이고진|브랜드: 이고진|헬스사이클|크기:60x23x38.5cm|무게:8.5kg|저항방식:드럼마그네틱|강약조절:8단계, 금액: 71,900원
http://www.enuri.com/detail.jsp?modelno=42615359
https://www.egojin.com 
 1) 이고진 서울 오프라인 팝업스토어는 롯데마트 서초점(서울 서초구 서초동 1498-5: T: 1544-6312), 이마트 성수점, 명일점
 ==> 롯데마트 서초점 담당자에게 전화: 재난 지원금 사용 불가능하다고 함
=================================================================================================================

- java Decompiler(jd-gui-0.3.3.windows) 
http://code.google.com/p/innlab/downloads/detail?name=jd-gui-0.3.3.windows.zip&can=2&q= 
- jd-gui 자바 디컴파일러 사용법 
1. D:\01. TAMA_DATA\51. TAMA SW\02. 개발용 프로그램\01. JAVA\51. JAVA Decompiler\jd-gui-windows-1.4.0\jd-gui.exe 더블 클릭 ==> 실행 
2. 열기 ==> DataConvertDown.class --> 디컴파일 됨
================================================================================================================= 
 
■■■■■■■■■■■■■■■■■■ 2020.07.08(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행 모바일 Admin 분석
1. Oracle DB 이관
=================================================================================================================

- WS5 Flow 분석 흐릅도 작성
1. WS5 Flow 분석.txt
=================================================================================================================
  
- 포커스 처리
1. ibx_empCd.focus();
=================================================================================================================

- 현대제철 재택 VPN 연결(본사 사무실) [2020.07.08(수), 9시] 
1. https://hdsteel-vpn.hyundai.com/my.policy, 1521903/Xodhks104!!  ---> 김태완 과장 계정 ■■■
 1) 연결 에러..현대제철 제 노트북(10.216.139.55)에 연결을 하면 에러가 남.
   가. 내 PC 로그인 ==> HYUNDAISTEEL\DN119100022 / qwqw1212@ 
=================================================================================================================

- 현대제철 재택 VPN 연결(본사 사무실) [2020.07.08(수), 20시] 
1. 현대제철 재택 VPN 연결[1521903/Xodhks104!!: 김태완 과장 사번]
2, 김태완 과장 노트북 연결 
컴퓨터(C): 10.216.139.197
사용자 이름: HDS / 123
3. 김태완 과장 노트북에서 진태만 노트북(DN119100022) 연결
컴퓨터(C): 10.216.139.55,
사용자 이름: HYUNDAISTEEL\DN119100022 / qwqw1212@
=================================================================================================================

- Eclipse에서 JAVA로 디버깅 하기
1. Degug 실행 ==> 오른쪽 툴 바 ==> Show Degug Toolbar: 클릭
https://data-make.tistory.com/204
1. Resume(F8)  - 디버깅 계속
2. Step Into(F5)  - 한단계씩 수행
3. Step Over(F6)  - 함수단위 수행
4. Step Return (F7) - 호출한 곳으로 되돌아가기 
=================================================================================================================

김태환 메일(KIMTW@partners-steel.com)로
FSP 서버 개발 라이센스 부탁 드립니다.
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.09(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 재택 근무

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 현대제철 안전관리 결함 사항 수정 처리
1. 김황과장 노트북에 환경 설정
 1) eclipse 설정 ==> D:\GQMS_HS(용랑: 4.85GB)
 2) DBeaver SW 설치
=================================================================================================================
 
- 위험기계기구 등록 및 사양 조회 저장 에러 ==> 수정 완료 @@@
1. SPEC_SORT_02: 저장(01: 크레인):  VARCHAR(1) ==> VARCHAR(3) 로 수정
 ==> 01. 위험기계기구 등록 및 사양 조회_01.jpg
=================================================================================================================
 
- 위험기계기구 등록 및 사양 조회 저장2 에러 ==> 수정 완료 @@@
1. 프레스 저장에러(가스 중분류 코드: 34 ==> 33으로 변경)
 ==> 02. 위험기계기구 등록 및 사양 조회_02.jpg
=================================================================================================================
 
- 자율검사 집계표 수정 ==> 수정 완료 @@@
1. 2020년 6월 데이타 좋회를 하면 크레인 집계 안됨  
 1) 원인: SPEC_SORT_02: 저장(01: 크레인) 칼럼에 데이타가 저장이 안되어 있어서 조회가 안됨
 2) 조치: VARCHAR(3) 로 수정로 수정 후 데이타 입력하면 됨
=================================================================================================================

- 현대제철 재택 VPN 연결 
1. 현대제철 재택 VPN 연결[1521903/Xodhks104!!: 김황 과장 사번]

2. 김황 과장 노트북 연결 
컴퓨터(C): 10.216.139.56
사용자 이름: HYUNDAISTEEL\DN114120007 / qwqw1212@ 
 
3. 김황 과장 노트북에서 진태만 노트북(DN119100022) 연결
컴퓨터(C): 10.216.139.55,
사용자 이름: HYUNDAISTEEL\DN119100022 /  qwqw1212@ 

4. 진태만 노트북(DN119100022) 에서 GQMS_HS 정보, eclipse 파일 서버에 복사 ==> 사실상 폐쇄 할 것(사용 불가) @@

5. 김황 과장 노트북에서 d드라이브에 GQMS_HS 붙여넣기, eclipse 환경 설정
컴퓨터(C): 10.216.139. 56
=================================================================================================================
 
- 운영 서버 로그인
id:1515030, PW:이선빈89!! 
=================================================================================================================
 
- 파일서버: 10.216.139.56 ==> 김황 과장 노트북 파일 공유
1. 10.216.139.197의 공유폴더 ==> 안됨
=================================================================================================================
 
- 개발 서버 이관 요청 메일 발송
1. 김태환 과장, 이메일 정보 ==> KIMTW@partners-steel.com, 1521903/ asxzqw104!!, 
=================================================================================================================

D:\01. TAMA_DATA\99. Back up_[■▲■]
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.10(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 재택 근무

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 현대제철 안전관리 결함 사항 수정 처리
- 운영 서버에서 반영 여부 확인 ==> SM이 퇴근해서 확인 못 함
1. 위험기계기구 등록 및 사양 조회(02. 크레인)   
2. 위험기계기구 등록 및 사양 조회(03. 프레스)
3. 자율검사 집계표(02. 크레인)
=================================================================================================================

- [[따배씨] C언어를 제대로 배우는 방법 | 따라하며 배우는 C언어 ,c언어 , 컴퓨터 작동원리, 코딩[홍정모]]
https://www.youtube.com/watch?v=PDM_w2b4UA0&list=PLNfg4W25Tapyl6ahul_8VS_8Tx3_egcTI
https://www.youtube.com/watch?v=PDM_w2b4UA0 
https://www.youtube.com/channel/UCg6IlhycdYiK_nWB3spjIqA/search?query=%EB%94%B0%EB%B0%B0%EC%94%A8
================================================================================================================

- [혼공C_새로워진 이것이 C언어다] 1강-프로그램과 C언어 / 컴파일러 사용법[한빛미디어]
1. https://www.youtube.com/watch?v=XwRmtMYZ_qo&list=PL_TL0F8qj1eiZJp8zzaNyf_w1PE7zwFGh&index=4
=================================================================================================================
  
- 윈도우 업그레이드 윈도우7에서 윈도우10으로 업그레이드 방법
https://www.youtube.com/watch?v=x2PG5VrUIRo
=================================================================================================================

- 윈도우10 최적화 방법 최종판[씨디맨]
https://www.youtube.com/watch?v=qyOxBxViSZE
1. One Drive, One Note
=================================================================================================================

- Microsoft One Drive
1. 5GB 무료로 사용 가능. 매월 2달러를 내면 50G가 제공된다.
https://onedrive.live.com/?id=root&cid=746D42F7CF74156F 
=================================================================================================================

- 대용량 무료 클라우드 저장공간 비교
https://m.blog.naver.com/knrsp3/221310927996 
1. 네이버 클라우드(Naver Cloud)  ==> 30GB 무료 제공
2. 구글 드라이브(Google Drive) ==> 15GB 무료 제공
3. 원 드라이브(One Drive) ==> 5GB 무료 제공
=================================================================================================================
 
- 원노트 간단한 사용법 재택근무,학교수업,화상회의 에 필요한 Microsoft OneNote 원노트 앱 설명
https://www.youtube.com/watch?v=fLfs4dN1lSI
================================================================================================================

- Microsoft(마이크로소프트) 홈페이지 로그인 변경[2020.07.10(금)]
https://www.microsoft.com, tamario@naver.com/30육*h@
================================================================================================================

- 비밀번호(암호) 변경 패턴(비밀번호 변경)
1. 2020오*h@   --> 2020오*ss@[공인인증]
2. 30육*h@  --> 마이크로소프트
3. 40칠*h@
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.11(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
07:00 기상 
07:40 조식
08:00 실내 자전거 타기
09:00 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기
13:15 종료 
12:20 인터넷 서핑  
17:20 루옌(수종) 오이도에 놀러감(자고 옴)
18:50 귀가
19:10 석식
19:20 루옌 귀가
19:35 실내 자전거 타기 ==>  
19:35 종료
19:40 인터넷 서핑
20:40 샤워 ==> 체중: 73.3kg
21:13 인슐린 약 교체(275U, 15U 남음)
23:00 취침
=================================================================================================================

- 로지텍 멀티 디바이스 블루투스 키보드 K380 (정품)등록일 : 2015.10.26신고하기 
1. 로지텍|무선|블루투스3.0|키보드|미니|이지스위치|스마트기기연결|AAA건전지x2|무게:423g|색상:블랙|크기:27.9x12.4x1.6cm, 가격: 37,400원
http://www.enuri.com/detail.jsp?modelno=12661652&cate=071703&IsDeliverySum=N
=================================================================================================================

- 루옌 네이버 클라우드  공유 설정으로 사용
1. 루옌 네이버 클라우드 접속 ==> 공유하기
http://www.naver.com -->  vnluyen@naver.com	lulu339@ 
3. 네이버 클라우드 공유하는 방법 (URL 링크/멤버 초대) 
출처: https://prolite.tistory.com/1152 [내 안의 디지털 세상]
- URL 링크 --> 2020.06(롯데카드 채권 모바일 시스템 구축 Prj) 폴더 위 클릭
암호: 1212
유효기간: 30일
접근 횟수: 100회
http://naver.me/xJn12D5w

- 멤버 초대
2020.06(롯데카드 채권 모바일 시스템 구축 Prj) 멤버 초대 공유 ===> http://naver.me/xJn12D5w
=================================================================================================================

- 개인 MSI 노트북 윈도우7에서 윈도우10으로 업그레드(집에서)
1. 윈도우 업그레이드 윈도우7에서 윈도우10으로 업그레이드 방법
https://www.youtube.com/watch?v=x2PG5VrUIRo
 1) 모든 OS 윈도우10으로 변경함(윈도우7 사용 전혀 안함)
=================================================================================================================

- 핑(PING)에 대한 모든것 (feat. 패스트핑) - [고지식] 거니
https://www.youtube.com/watch?v=xK75hjMoQvg
=================================================================================================================

- 구글 주소 ping 테스트(IP 주소 추적)
C:\Users\Administrator> ping google.com

Ping google.com [172.217.24.78] 32바이트 데이터 사용:
172.217.24.78의 응답: 바이트=32 시간=45ms TTL=111
172.217.24.78의 응답: 바이트=32 시간=45ms TTL=111
172.217.24.78의 응답: 바이트=32 시간=45ms TTL=111
172.217.24.78의 응답: 바이트=32 시간=46ms TTL=111

172.217.24.78에 대한 Ping 통계:
    패킷: 보냄 = 4, 받음 = 4, 손실 = 0 (0% 손실),
왕복 시간(밀리초):
    최소 = 45ms, 최대 = 46ms, 평균 = 45ms

C:\Users\Administrator> tracert google.com 		--> 라우터 추적 ■■■
 1) IP Tracker ==> https://www.ip-tracker.org/locator/ip-lookup.php
  가. 원하는 IP 입력 ==> Get An IP Info 버튼 클릭 
최대 30홉 이상의
google.com [172.217.24.78](으)로 가는 경로 추적:
 
  1    <1 ms    <1 ms    <1 ms  192.168.219.1
  2     2 ms     *        2 ms  112.156.198.1
  3     1 ms     1 ms    <1 ms  1.213.13.25
  4     1 ms     1 ms    <1 ms  1.213.13.25
  5     1 ms     1 ms     1 ms  1.208.12.113
  6     2 ms     2 ms     1 ms  1.208.107.221
  7     *        1 ms     2 ms  61.42.202.129  		--> 경상북도 구미	■■■
  8     3 ms     1 ms     2 ms  1.213.106.121 4  
  9    45 ms    44 ms    45 ms  1.208.145.42
 10    48 ms    47 ms    47 ms  1.208.150.182 --> 서울 	■■■
 11    47 ms    47 ms    48 ms  74.125.118.154 --> 미국 워싱턴	■■■
 12    65 ms    55 ms    56 ms  209.85.244.25  --> 미국 워싱턴 ■■■
 13    46 ms    46 ms    46 ms  172.253.69.225
	 14    45 ms    45 ms    45 ms  hkg07s33-in-f14.1e100.net [172.217.24.78]   --> 미국 워싱턴(구글 IP로 추정) ■■■
	-------------------------------------------

추적을 완료했습니다.
=================================================================================================================

- 아직도 컴퓨터 종료 3번 눌러 끄시나요?
https://www.youtube.com/watch?v=VkYrwImoIZA
1. 바로 가기 만들기 ==> 항목 위치 입력(T):  shutdown -s -t 0 입력 ==> 다음(B)
2. 이름: 00. PC종료
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.12(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말2[★]
07:30 기상
08:40 조식
09:00 실내 자전거 타기 
10:10 종료 
10:05 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료
14:30 집출발(자전거: 수종)
14:40 다이소 대림2호점(방향제 구입) 
15:30 귀가 
15:40 인터넷 서핑 ==>  
16:20 루옌(수종)  귀가
18:10 석식
18:30 실내 자전거 타기
19:30 종료  
19:40 인터넷 서핑 
20:50 루옌(수종) 귀가 
23:10 취침
=================================================================================================================

- 단숨에 스마트폰 속도 2배로 빠르게 만드는 방법[누나IT]
https://www.youtube.com/watch?v=ai4JwveqNvk
=================================================================================================================

- 아직도 사용하지 않는 윈도우10 강력한 기능 3 작업보기, 가상데스크톱, 스티키노트[누나IT]
https://www.youtube.com/watch?v=7xu2eT5IB2Y
=================================================================================================================

- MySQL 삭제후 재설치
https://m.blog.naver.com/PostView.nhn?blogId=eun9522&logNo=220951642644&proxyReferer=https:%2F%2Fwww.google.com%2F
================================================================================================================
 
- 윈도우10 실행하면 에러 창 발생
1. 현상: 내부 프로그램 데이타가 손상되었습니다.
프로그램을 다시 설치하거나 시트템 관리자에게 문의하십시오.
오류 코드: 258
ABBYY Sreenshot Reader
2. 조치: ABBYY 프로그램 삭제 후 OS 재시작
================================================================================================================
 
 - 윈도우10 최적화 2020 -모든사용자용-ㅣ윈도우7느낌, 가벼운 윈도우10.
 https://www.youtube.com/watch?v=J6gJr5jYR1s
================================================================================================================
 
- 윈도우10 Pro 버전 확인
1. 윈도우 검색창: winver:입력 ==> Windows 정보(새창)
Microsoft Windows
버전 2004(OS 빌드: 19041.330)
설치 날짜: 2020-07-11
================================================================================================================
 
- 29살의 C언어 with 거니 [Chapter#9 - 포인터][코딩하는거니]
https://www.youtube.com/watch?v=A7C9-Ea_zBQ
https://www.youtube.com/channel/UCO7g158NWgLyn98z8v3zduA/search?query=29%EC%82%B4%EC%9D%98
================================================================================================================
 
- Dev-C++ - 다운로드, 설치
https://m.blog.naver.com/PostView.nhn?blogId=ndb796&logNo=220621118146&proxyReferer=https:%2F%2Fwww.google.com%2F
================================================================================================================

[따배씨] 1.7 비주얼 스튜디오 2019의 기본적인 사용법 | 따라하며 배우는 C언어, c언어 , 컴퓨터 작동원리, 코딩[홍정호]
https://www.youtube.com/watch?v=L4lW3mkIos0&list=PLNfg4W25Tapyl6ahul_8VS_8Tx3_egcTI&index=19
1. 빌드(B) ==> 솔류션 빌드(B)[Ctrl + Shift + B] 
2. 디버그(D) ==> 디버깅하지 않고 시작(H): 빌드(B)[Ctrl + F5]
================================================================================================================

- C언어 포인터 인강 ① 포인터 때문에 미쳐 버릴 것[양주종의 코딩스쿨]
https://www.youtube.com/watch?v=nQEvGgt1HZ8
================================================================================================================

- 초보자를 위한 기초 C 언어 강좌 #13 : 포인터 (1)
출처: https://studyc.tistory.com/15 [나는 개발자다]
================================================================================================================

- 씹어먹는 C 언어 - <12 - 1. 포인터는 영희이다! (포인터)>
https://modoocode.com/23
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.13(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 하루 종일 비(우산), 웹스퀘어5 고급 과정 교육(10시, 인스웨이브)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 웹스퀘어5 고급 과정 교육(10시, 인스웨이브)
교육명 : 웹스퀘어5 고급 과정
교육일 : 2020.07.13 ~  2020.07.14 
교육시간 : 10:00 ~ 17:00
교육장소 : 본사 교육 센터 (서울특별시 구로구 디지털로 306 대륭포스트타워 2차 414호)
커리큘럼 : 웹스퀘어5 고급 과정
준비물 : 노트북
================================================================================================================= 
 
- WRM  ==> WebSquare5 (SP4) 사용자 가이드.pdf 내용 교육
1. iframe 사용 안함 ==> wframe 사용
 1) WebSquare5 Studio Version: 5.0.4 (Service Pack 4)	Build date: 20200624_1331_x86_B
================================================================================================================= 

- /config.xml 파일에서
<!--   
	initScript,onpageload,postScript의 실행순서를 initScript ==> onpageload ==> postScript 순서로 실행할지에 대한 여부
	자세한 내용은 https://inswave.com/confluence/pages/viewpage.action?pageId=14713701 참고
--
<scriptPrecedence value="true"/> 
================================================================================================================= 

- 퍼블리싱(/main.xml 파일에서)
<body ev:onpageload="scwin.onpageload" ev:onpageunload="scwin.onpageunload">
<xf:group id="" style="padding: 10px;">				<!--// 처음 group에 padding: 10px; 설정 ■■■   //-->
	<xf:group style="padding: 10px;border: 1px solid blue;margin-bottom: 10px;" id="" tagname="">			
		<!--// 2번째 group[검색 창]에 padding: 10px;border: 1px solid blue;margin-bottom: 10px; 설정 ■■■   //-->
		<w2:span style="margin-right:10px;font-size:13pt;font-weight:bold;color:#FF8000;" label="Main : " id=""></w2:span>
			<!--// Main 글자에[검색 창]에 margin-right:10px;설정 ■■■   //--> 
	</xf:group> 
</body> 
=================================================================================================================

- scope 관련 실습
1. /main.xml, /child.xml, /sub.xml 
================================================================================================================= 
 
- Wframe Scope 설정 
/**
 * Child 버튼 클릭 이벤트 ==> 부모 → 자식
 */ 
scwin.btnChild_onclick = function(e) {
	console.log("[/main.xml] [btnChild_onclick()] ==> [TEST_01_3] [Child 버튼 클릭 이벤트]" );  
	console.log("[/main.xml] [btnChild_onclick()] ==> [TEST_51] [Child_ipt1]"+ t1.getWindow(0).ipt1.getValue() ); 
	console.log("[/main.xml] [btnChild_onclick()] ==> [TEST_52] [Child_ipt1]"+ t1.getWindow(t1.getSelectedTabIndex()).ipt1.getValue() ); 
  
	// 부모 → 자식 ==> wframe1.getObj("wframe11").getObj("input1").getValue();   ==> getWindow(): WFrame의 scope를 반환.
	// 자식 → 부모  ==> $p.parent().$p.parent().input2.setValue("test");  		==> parent(): 부모 페이지(WFrame)의 scope를 반환.
};

/**
 * Sub 버튼 클릭 이벤트 ==> 부모 → 자식(2단계)
 */ 
scwin.btnSub_onclick = function(e) {
	console.log("[/main.xml] [btnChild_onclick()] ==> [TEST_01] [Sub 버튼 클릭 이벤트]" ); 
	alert("[/main.xml] [btnChild_onclick()] ==> [TEST_52] [ipt1.getValue()]"+ t1.getWindow(t1.getSelectedTabIndex()).w1.getWindow().ipt1.getValue() );  
};
----------------------------------------------------------------------------------------------------------------------

/**
 * Main 버튼 클릭 이벤트	 ==> 자식 → 부모
 */ 
scwin.btnMain_onclick = function(e) {
	console.log("[/child.xml] [btnMain_onclick()] ==> [TEST_01] [Main_버튼 클릭 이벤트(자식 → 부모)]" ); 
	
	console.log("[/child.xml] [btnMain_onclick()] ==> [TEST_51] [Main_ipt1]"+ $p.parent().ipt1.getValue() ); 	 
	alert("[/child.xml] [btnMain_onclick()] ==> [TEST_51] [Main_ipt1]"+ $p.parent().ipt1.getValue() ); 
};
----------------------------------------------------------------------------------------------------------------------

/**
 * Main 버튼 클릭 이벤트 ==> 자식 → 부모(2단계)'
 
 */ 
scwin.btnMain_onclick = function(e) { 
	console.log("[/sub.xml] [btnMain_onclick()] ==> [TEST_01_3] [Main_버튼 클릭 이벤트(자식 → 부모(2단계))]" );
	
	//console.log("[/sub.xml] [btnMain_onclick()] ==> [TEST_50] [Main_ipt1]"+ $p.main().ipt1.getValue() ); 	// $p.main();	 //  최상위 
	//alert("[/sub.xml] [btnMain_onclick()] ==> [TEST_50] [Main_ipt1]"+ $p.main().ipt1.getValue() );  	 
	
	console.log("[/sub.xml] [btnMain_onclick()] ==> [TEST_51] [Main_ipt1]"+ $p.parent().$p.parent().ipt1.getValue() ); 	 
	alert("[/sub.xml] [btnMain_onclick()] ==> [TEST_51] [Main_ipt1]"+ $p.parent().$p.parent().ipt1.getValue() );  
};
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.14(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:00 ~ 17:00 ==> 웹스퀘어5 고급 교육2(10시, 인스웨이브): 강사가 질문 강의 끝나고 하라고 해서 열받음 

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 웹스퀘어5 고급 과정 교육2(10시, 인스웨이브) 
1. WRM 개요 ==> UI 개발자 가이드_v5.0.4.1_20200225.docx 내용 교육
WRM(WebSquare5 Reference Model)은 웹스퀘어5를 이용해서 UI 시스템을 구축 시 표준화된 UI 공통 기능 및 예제 화면 등을 제공
2.	프레임워크 연계
 1) Message Converter: JSON <==> Map
3.	공통 함수 설명
================================================================================================================= 
 
- WTM eclipse 실행 에러
1. 현상:
WARN : org.springframework.web.servlet.PageNotFound - No mapping found for HTTP request with URI [/] in DispatcherServlet 
with name 'appServlet'
2. 원인: WTM 서버는 테스트용으로 최소 기능만 으로 설정을 해서  http://localhost:9002 하면 위와 같은 에러가 발생
3. 조치: http://localhost:9002/websquare/websquare.html?w2xPath=/cm/main/index.xml
================================================================================================================= 

- /servlet-context.xml 파일에서
<!-- Handles HTTP GET requests for /resources/** by efficiently serving up static resources in the ${webappRoot}/resources directory -->
<resources mapping="/websquare/**" location="/websquare/" />
<resources mapping="/fileUpload/**" location="/fileUpload/" />
<resources mapping="/cm/**" location="/cm/" />
<resources mapping="/ui/**" location="/ui/" /> 

<beans:bean id="interceptorLoginCheck" name="interceptorLoginCheck" class="com.inswave.interceptor.SessionCheckInterceptor" />
 <!--// 세션 체크 //--> 
================================================================================================================= 

- Popup,  동적  실습
1. /parameter.xml, /transaction.xml
================================================================================================================= 
	
/**
 * alert 파라미터 전달 팝업
 */
scwin.btn_alert_onclick = function() {
	console.log("[/parameter.xml] [btn_alert_onclick_02()] ==> [TEST_01] [alert 파라미터 전달 팝업] 
		[ibx_alertSend]"+ ibx_alertSend.getValue() );  

	// 실제 전달 data 
	var _data = { type : "alert", msg : ibx_alertSend.getValue(), callbackFn : "fn_alertCallback" };
	var _option = {"id":"AlertPop", "popupName":"확인", "width":"650", "height":"500"};
	
	com.openPopup(_data, _option, "/ui/exam/confirm.xml"); 	 // 팝업 생성
};
================================================================================================================= 

/**
 * 조회 버튼 클릭 이벤트(2. 동적 Submission)
 */
scwin.btn_search2_onclick = function() {
	console.log("[/transaction.xml] [btn_search2_onclick()] ==> [TEST_01] [조회 버튼 클릭 이벤트(2. 동적)]" ); 
	
	var _obj = [{"cd":"00002", "id":"sel_position"}		// 직급 코드 - 00002
			   ,{"cd":"00004", "id":"sel_religion"}				// 종교 코드 - 00004
			   ];
	
	com.excuteCommonCode(_obj);		// 동적 Submission 처리
};
================================================================================================================= 
 
- WRM Prj 저장
1,  WRM(2.79GB)하여 네이버 클라우드에 등록
 1) C:\WRM
=================================================================================================================
 
- LEGO[레고] CITI - 60182 Pickup truck & Caravan [JJU]
레고 시티 60182 픽업트럭과 캐러밴, 혼합 색상 레고 시티 60182 픽업트럭과 캐러밴, 혼합 색상 56,000원 
 https://www.youtube.com/watch?v=PnYg0ldxtz0
=================================================================================================================

- 강냉이 주문
- [옥션] [B277908010] 정일제과 마카로니 대용량, 03_맛강냉이 5kg(+4,600원), 가격: 19,640원
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=731236368&GoodsSale=Y&jaehuid=200002673
http://www.enuri.com/detail.jsp?similar=Y&IsDeliverySum=N&cate=&modelno=17021066
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.15(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 재직증명서 발급 신청 및 발급(14시, 회사)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 웹스퀘어5 고급 과정 교육 정리
1. WebSquare5 (SP4) 사용자 가이드.pdf
2. UI 개발자 가이드_v5.0.4.1_20200225.docx
=================================================================================================================

- 개발자도구 강좌 - 02. 크롬개발자도구 Elements[웹학교]
https://www.youtube.com/watch?v=dE8KNJNHifQ&list=PLdajQmV2DgoSsqUu5EZFHSeXTi6_DEr88&index=7
=================================================================================================================
 
- 제주은행 모바일 Admin DB 이관(집에서)
1. 개인 노트북(MSI)에서 이관
=================================================================================================================

- WFrame 간의 화면 참조(Scope)
1. 자식 → 부모 (2단계) 
$p.parent().$p.parent().input1.setValue("test");

2. 형제 (2단계) 
$p.parent().$p.parent().wframe2.getWindow().wframe2-2.getWindow().scwin.test1();

3. 부모 → 자식 (2단계)
wframe1.getWindow().wframe1-1.getWindow().input1.getValue();
=================================================================================================================

- WindowContainer에서 각 Window 접근 
$p.main().windowContainer1.getWindow("window2").wframe_header.getWindow().dataList1.getAllJSON();
=================================================================================================================

- 스크립트 실행 순서
0. Scope 기능 사용 시 스크립트는 아래의 순서로 동작합니다. 
1. 외부 JS 파일
2. 로컬 스크립트(config.xml 파일에 정의)
3. <initScript>
4. onpageload
5.<postScript>(config.xml 파일에 정의
=================================================================================================================

- 기본 브라우저 설정
1. Select External Program(새창)
01. 크롬 ==> C:\Program Files (x86)\Google\Chrome\Application
=================================================================================================================

- 디버깅용으로 Scope를 쉽게 찾기 위해 제공하는 API
$p.debug.getScope(domElement); 렌더링된 domElement가 속한 화면의 Scope 객체를 반환.
$p.debug.getFrame(domElement); 랜더링된 domElement가 속한 화면의 WFrame ID를 반환.
=================================================================================================================

- Switch: 여러 상황이 가능한 경우, 각 상황에 대한 화면을 구성하고 해당 상황에 맞는 화면을 출력 
=================================================================================================================
 
- 마이크로소프트 Bluetooth Mobile Mouse 3600[정품] 집 노트북(MSI)에 연결
1. http://www.enuri.com/detail.jsp?modelno=12814281&cate=&IsDeliverySum=N
2. Bluetooth 연결 ==> 우리가 초반에 제품에 샀을때 가이드에 나와있는 방법 페어링 버튼을 3초간 누른다.
=================================================================================================================

- [로지텍 코리아] M325 무선 마우스 구입
http://www.enuri.com/detail.jsp?modelno=7143441&cate=&IsDeliverySum=N
1. 제조사: 로지텍 | 브랜드: 로지텍 | 마우스 | 광 | 무선 | 2.4GHz | 미니 | 3버튼 | 틸트휠(↕↔스크롤) | 최대감도: 1000dpi | 양손형 | 수신기:
   초소형(유니 파잉), 수납가능 | AA 건전지 x 1 | 전원 스위치 | 색상: 블랙 + 블루 | 크기: 6x9x3.2cm| 가격: 26,860원
(걸리는 선도 없고, 틸트휠로 편리하고! 건전지는 교체없이 최대 18개월 사용가능)
2. 드림디포 선릉점 ==> 가격: 35,000원[실제 구입가]
2. 드림디포 선릉점 ==> 퓨전 면도기(질레트), 가격: 18,000원[실제 구입가]
=================================================================================================================

- 양재 최의원 방문(11:45, 양재 최의원(매봉역 1번 출구))
1. 혈당 70(사탕 2개 얻어 먹음)
2. 주사기, 슈퍼 라인 10개씩 구입
 1) 인슐린 6병
 2) 소모품: 다나알(dana R)용 건전지 8개(4천, 3만 2천원), 3M 천 반창고 2통(만원), 팬티 2장(만 4천) 구입
3. 당화혈 핵소: 5.8%
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.16(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 돌봄 교실에 전화(10시: 신청서 접수 요청), 레코 택배 도착

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★] 
- 02. WRM Flow 분석
1. 01. WRM 정보.txt 작성 ==> 완료 @@@
=================================================================================================================

- 회의
1. (주) 인스웨이브 이광철 이사(PM): 프로젝트 PM
2. 명동 이동 ==> 8월 3일(월) 예상
3. 일정
 1) 12월 10일 오픈 ==> 10월 말 개발 완료
  2) 개발자 2명 추가(추후 유지 보수)
  2) 분석/설계(개발자 몫) ==> 퍼블리싱
  3) 업무 분석 ==> 상품 목록이 안나옴(기획자와 퍼블러서 중간 단계 역할을 개발자가 맡아야 함)
  4) TA 역할: 백단(자바) 개발이 필요
  5) I/F 작성? --> 단위 테스트
4. 매주 수요일 오전 주간보고
5. BDT(Branch Digital Transformation): 상품 가입 및 서비스 업무를 디지털化하여 비대면을 통해서도 영업활동이 가능하게 하는 
서비스
=================================================================================================================
 
- 제주은행 모바일 뱅킹 개발해야 할 모듈                                                
1. OCR(전자 명함)
2. BPR/PPR
3. 전자서식/서명
4. 키보드 보안(O)
5. 스크래핑
6. DB 암호화(O)
7. 클라우드 인증서
 ==> 인지 소프트(모바일 미터)
=================================================================================================================
 
- 윈도우10 윈도우 검색 조회
1. 윈도우 10 웹 및 windows 검색, 시작메뉴 옆에 돋보기가 반응이 없네요..
 1) 원인: BleepingComputer 정보에 따르면 Bing 검색이 Windows 10 통합검색에 포함이 되도록 패치해서 발생한 현상
https://kin.naver.com/qna/detail.nhn?d1id=1&dirId=10301&docId=346520008&qb=7JyI64+E7JqwMTAg7JyI64+E7JqwIOqygOyDiQ
==&enc=utf8&section=kin&rank=5&search_sort=0&spq=0
 
- 윈도우10 윈도우 검색 조회2
1. 윈도우10 검색창 오류.. windows 검색 기능 오류 해결 방법
 1) 원인: 악성프로그램걸린 것으로 추정됨 ==> 악성 프로그램으로 추정되는 것 제거 후 상태 확인할 것 
 https://rgy0409.tistory.com/3309
=================================================================================================================

- AJP 프로토콜 모든 것을 분석
https://ehdvudee.tistory.com/20
1. AJP(Apache JServ Protocol)은 Web Server에서 받은 요청을 WAS(Tomcaat)로 전달해주는 프로토콜
https://okky.kr/article/702325
2. 서비스가 Tomcat만 사용하는 것이라면 AJP를 주석처리하셔도 되지만 만약 앞에 웹서버(Apache)가 있다면, AJP를 주석처리하면 
서비스가  안되는 문제가 생깁니다.
=================================================================================================================

- ms오피스 3천원 구매(평생무료)후기-바쁜아빠tv
https://www.youtube.com/watch?v=bVgOge1TRvw
=================================================================================================================

- 제주은행 모바일 Admin DB 이관(집에서)
1. 개인 노트북(MSI)에서 이관 ==> NOXMAT_MAP DB로 이관
# 01. HSCM 개발DB 설정 추가[변경일: 2020.03.20, by 진태만], Oracle DB @@@
driver=oracle.jdbc.pool.OracleDataSource
url=jdbc:oracle:thin:@TAMA_HOME:1521:TAMADB
username=NOXMAT_MAP
password=tama339
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.17(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 제헌절

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 02. WS5 Flow 분석
1. 02. WS5 분석[2020.07].txt 작성 ==> 완료 @@@
=================================================================================================================
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트 개발자 교육
1. 일시: 16시 20분
2. 자료 메일로 보내기
=================================================================================================================

- 동적 Submission 
var searchCodeGrpOption = { id : "sbm_searchCodeGrp",
											action : " /sample/tempSelect",
											target : 'data:json,{"id":"dlt_temp","key":"dlt_temp"}',
											submitDoneHandler : "searchCodeGrpCallback", isShowMeg : false };
											
com.executeSubmission_dynamic(searchCodeGrpOption);
=================================================================================================================
 
- 윈도우10 PIN 번호
1. PIN 번호: 121211
=================================================================================================================
 
- [JAVA] 추상(abstract) 클래스와 인터페이스(interface) 클래스
https://aileen93.tistory.com/107
=================================================================================================================
 
- 오피스 365 학생 계정 생성을 위한 인증코드 요청
1. (주)필라테크에 서식 작성하여 요청 메일 보냄
2. Office 365 ==> tamario@daedong.sen.es.kr / 20*0오*h@
==> Office 365 신청(서울 교육청) ==> https://o365.sen.go.kr/
 1) OneDrive 1TB 사용 가능
https://www.office.com/?auth=2&home=1
https://www.youtube.com/watch?v=a083BSTRPeA
==> 집 노트북에 OneDrive 셋팅 ==> C:\Users\Administrator\OneDrive - 서울대동초등학교
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.18(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
08:00 기상 
08:40 조식
09:00 실내 자전거 타기
10:00 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기
13:15 종료 
13:20 거실 TV 고장 ==> TV 본체에 전원이 안 들어 옴
13:30 인터넷 서핑  
15:00 집출발(자전거: 수종)
15:20 이마트 구로점(루키 야구 배트(수종), 코몽트 19308-1 반팔(티셔츠) 구입) 
16:00 다이소 구로디지털 2호점(줄줄이 스피트 줄넘기[31226] 구입)
16:20 귀가 
16:40 루옌 놀러감
17:10 수종이랑 거실에서 야구
17:40 집출발(자전거)
17:50 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 10,900원) 구입 
18:00 귀가
18:10 석식 
18:30 수종이랑 놀이터에서 야구
19:00 귀가
19:10 실내 자전거 타기
20:00 종료
20:10 인터넷 서핑
20:40 샤워 ==> 체중: 73.9kg
21:32 인슐린 약 교체(265U, 24U 남음)
22:00 취침
=================================================================================================================

- 로지텍 페블 M350 마우스 (정품) 구입 검토 
1. 제조사: 로지텍|브랜드: 로지텍|무선 광 마우스|광|무선|2.4GHz|블루투스4.0|3버튼|최대감도:1000dpi|무소음|수신기:수납가능|
AA건전지x1|색상:시크 블랙,퓨어화이트, 파우더핑크|크기:5.9x10.7x2.7cm|무게:100g 가격: 22,500원(블루투스, USB 둘다 사용 가능)
http://www.enuri.com/detail.jsp?modelno=37724209&cate=&IsDeliverySum=N
=================================================================================================================
 
- [로지텍 코리아] M221 무선 마우스 구입 검토(이마트 구로점에서 발견함) 
1. 제조사: 로지텍 | 브랜드: 로지텍 | 마우스 | 광 | 무선 | 2.4GHz | 미니 | 3버튼 | 틸트휠(↕↔스크롤) | 최대감도: 1000dpi | 양손형 | 수신기:
   초소형, 수납가능 | AA 건전지 x 1 | 전원 스위치 | 색상: 블루 | 크기:6x9.9x3.9cm|무게:75.2g, 건전지는 수평 약 18개월, 가격: 19,290원
http://www.enuri.com/detail.jsp?modelno=14732758&cate=&IsDeliverySum=N
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=1502132599&GoodsSale=Y&jaehuid=200002673
=================================================================================================================
  
- 창맥 5기 진주 캠핑(불참, 카톡으로 확인)
1. 참석자: 김현구(주체), 서상진, 조일현, 최두영, 윤성호, 전현노, 최종윤 ==> 1박
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.19(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전에 비

- 주말2[★]
08:40 기상 ==> 오전에 비
08:40 조식
09:00 실내 자전거 타기 
10:10 종료 
10:15 인터넷 서핑
11:58 루옌(수종) 놀러감
12:10 중식
12:30 실내 자전거 타기
13:30 종료 
15:00 집출발(자전거)
15:20 이마트 구로점(코몽트 19308-1 반팔(티셔츠, 검정색, 파란색) 구입[2벌: 8,900원)
16:20 귀가  
15:40 인터넷 서핑
18:10 석식
18:30 실내 자전거 타기
19:30 종료  
19:40 인터넷 서핑 
19:35 루옌(수종) 귀가
23:10 취침
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.20(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 당뇨 소모품비 제출(15:30, 건강보험공단)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- W-XTouch교육(16시)
1. 이경일 부장
=================================================================================================================

- (제주은행) 모바일 웹 뱅킹 스토리보드 초안 문서 메일로 받음
1. 제주은행웹뱅킹구축설계서_메인v.0.1_200720.pptx, 제주은행_PMO_1110_모바일 웹 뱅킹 구축 사업수행계획서_v1.0.docx
제주은행_화면설계서_회원가입_v0.1_20200716.pptx, 화면레이아웃_기업정보 리스트_v1.0.pptx 
=================================================================================================================
 
 - 5.3. 인력계획
1. PM: 이광철 이사
2. 사업관리: 구종식 부장
3. UX 기획: 이진영(이영진?) 차장, 김은진 과장, 김혜임 과장
4. 퍼블리셔: 송하은 수석, 김다슬 대리, 김현준 사원
5. UI 디자인: 정현아 차장, 이현주 과장
6. UI 공통: 이경일부장
7. 업무공통: 이윤석 부장
=================================================================================================================

- 현대제철에서 반출 못한 모니터(2대) 철수 요청
1. 오태범 이사에서 요청(반입증 카톡으로 보냄)
=================================================================================================================
 
- 50. 당화혈색소(Hemoglobin A1c, HbA1c) 측정 정보
측정일				수치(%)		비고
2018.09.21(토)	11.4%	속편한 내과
2018.10.06(토)	9.3%		희망내과
2018.12.10(월)	5.7%		충주호 당내과
2019.03.06(수)	6.2%		양재 최의원
2019.06.20(목)	5.7%		양재 최의원
2019.09.28(토)	5.4%		양재 최의원
2020.01.04(토)	5.2%		양재 최의원
2020.04.10(금)	5.4%		참 좋은 내과(구로 고대병원 맞은 편)
2020.07.15(수)	5.8%		양재 최의원
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.21(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행 모바일뱅킹 업무별 개발자 배정
1. 구종식 부장이 메일로 보내줌  
2. 공통 TASK
 1) 본인인증(박건유)
 2) 비대면 실명(박찬영) ==> 예금
3. 기타
 1) 금융상품몰(링크, 박건유)
 2) 메인(김유이)
=================================================================================================================  

- (제주은행) 모바일 웹 뱅킹 구축 투입 인력 서류 작성
1. 보안 서약서, 출입 카드 신청서, PC 요청서 작성 ==> 구종식 부장에게 제출
=================================================================================================================  

- 02. WRM Flow 분석 재작성
1. 01. WRM 정보.txt 작성 ==> 완료 @@@
=================================================================================================================

- 02. TASK 관리 Flow 분석
1. 02. TASK 관리 분석.txt 작성 ==> 완료 @@@
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.22(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 오전, 저녁에 약한 비, 주간업무 보고서 작성(제주은행_PMO_2110_주간업무보고_03주차_진태만.pptx)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- TASK 관리, 프로세스 관리 분석
1. 
=================================================================================================================

- 주간업무보고_03주차 주간보고
A. 금주실적 [★]
- W-XTouch 관리자 시스템 분석
1. Wesquare(Front단) 소스 분석
1) 동적 Submission 사용
  가. 소스를 간단하고 통일되게 관리할 수 있음 
2) 암.복호화 사용
  가. 보안성 강화
2. JAVA(Back단) 소스 분석
1) 스프링 컨트롤러(Controller)를 InitController.java로 통일해서 사용
  가. 자원 낭비 최소하여 효율적으로 자원 관리 가능
2)  service단에서 비지니스 로직 구현
  가. serviceImple단 사용 안하면서 자원 낭비 최소화

- W-XTouch 관리자 시스템 분석 산출물 작성 
1. 01. WRM 정보.txt 문서 작성
2. 02. TASK 관리 분석.txt 문서 작성
=================================================================================================================

B. 차주계획 [★]
- 제주은행 모바일뱅킹 업무 분석 
1. 타사이트 모바일 웹 예.적금 사례 분석(신한은행 기준)
 1) 정기예금 분석
 2) 정기적금 분석
 3) 입출금 통장 분석
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.23(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:30 ==> 오전 약한 비, 밤에 강한 비(우산, 바지 다 젖음), 건강보함공단(157,500원 입금됨)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 직장인대출 분석
1. 직장인대출 분석(P002) ==> /ui/xTouch_Sample/sample/P002/P002.xml
 1) 휴대폰 본인인증(P002, 01) ==> /ui/xTouch_Sample/sample_ui/com_phn.xml
 /websquare//ui/xTouch_Sample/sample_ui/com_phn.xml?_XTOUCH_UI_CHK_=Y
=================================================================================================================
 
- 크롬 브라우저로 플로우 차트 그리기
1. 출처: https://blog.embian.com/70 [Embian Blog]
2. Gliffy Diagrams ==> https://chrome.google.com/webstore/detail/gliffy-diagrams/bhmicilclplefnflapjmnngmkkkkpfad
 1) Gliffy Diagrams 로그인 ==> https://go.gliffy.com/go/html5/launch ==> tamario@naver/303*육*h@
 ==> BPRM
 ------------------------------------------------------------------------------------------------------------------------------
 
- 플로우 차트 쉽게 그리기
 https://m.blog.naver.com/PostView.nhn?blogId=yexx&logNo=220323443719&proxyReferer=https:%2F%2Fwww.google.com%2F
=================================================================================================================

-크롬에서 로그인이 안되시는 경우에 해결 방법
https://sir.kr/co_notice/1072
1. 크롬 브라우저의 오른쪽 상단에 있는 Chrome 설정 및 관리 > 설정 > 고급설정표시 > 인터넷 사용정보 삭제 > 쿠키 및 기타 사이트, 
플러그인 데이터 삭제 를 체크하신 후 인터넷 사용정보 삭제 버튼을 클릭하시면 됩니다.
 1) 로그인이 안된 이유는 SIR 의 설정 파일중 쿠키도메인이 .sir.co.kr 이 설정되어 있지 않아 나타난 오류로 확인 됨
2. 크롬 로그인 ==> https://accounts.google.com, taemario@gmail.com, h*태*16*1@
=================================================================================================================

- 제주은행 Prj 회식(18시, 닭꼬치집) 참석
17:30 퇴근(비 엄청 많이 옴)
17:40 윤가 양꼬치 훠궈 도착 ==> 구종식 부장(PM),  이경일 부장(공통), 박찬형(대리), 박건유(대리), 김유이 사원, 한혜숙 부장(프리)
17:50 석식(양꼬치 무한리필 ==> 22개 먹음[생각보다 맛있었음], 맥주)
21:40 종료(비 엄청 많이 옴)
21:45 타이지엔 커피샵(카라멜 마끼야또): 구부장이 쏨 ==> 혈당 체크(86)
20:10 종료(비 엄청 많이 옴)
20:20 선릉역 --> 구로디지털역 
20:50 귀가
21:00 귀가
21:00 실내 자전거 타기
22:00 종료
22:10 인터넷 서핑
23:00 취침
========================================================================================================= 
 
■■■■■■■■■■■■■■■■■■ 2020.07.24(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:30 ==> 

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 직장인대출 분석
1. 직장인대출 분석(P002) ==> /ui/xTouch_Sample/sample/P002/P002.xml
 1) 휴대폰 본인인증(T002, 01) ==> /ui/xTouch_Sample/sample_ui/com_phn.xml
 /websquare//ui/xTouch_Sample/sample_ui/com_phn.xml?_XTOUCH_UI_CHK_=Y
=================================================================================================================
 
- 크롬 콘솔 처리
1. 원하는 소스에 debugger 처리 
debugger; 	// debugger TEST @@@ ===>
2. 조회 버튼 클릭시
/**
 * 조회 버튼 클릭 이벤트
 */
scwin.btn_search_onclick = function() {
	console.log("[/WF001M.xml] [btn_search_onclick()] ==> [TEST_01] [조회 버튼 클릭 이벤트]" );
	
		var setJSON = {
			"TASK_ID": taskId.replaceAll(" " ,"") ,
			"TASK_NM": taskNm.replaceAll(" " ,"")
		}; 
		console.log("[/WF001M.xml] [fn_search()] ==> [TEST_50] [setJSON]"+ JSON.stringify(setJSON) );
		// console.log("[/login.xml] [btn_login_onclick()] ==> [TEST_20] [dataMap값 조회] [dma_loginCheck]"+ JSON.stringify(dma_loginCheck.getJSON()) );
		
		com.exeService(
			{"ServiceID":"T_WF_0001"},		// Sub Info(1. ServiceID: 서비스 ID, 2. URL: 호출할 URL) ■■■
			setJSON,									// INPUT 값(inJSON)
			scwin.fn_search_callback			// 결과 콜백 함수(callbackFn)
		);
	};
};

/**
 * TASK 관리 조회 콜백 처리
 */	
scwin.fn_search_callback = function(rtnJSON) {
	console.log("[/WF001M.xml] [sbm_Login_submitdone()] ==> [TEST_01] [TASK 관리 조회 콜백 처리] [결과 코드]"+ rtnJSON.ERR_CODE +"[rtnJSON]"+ rtnJSON );
		
	if (rtnJSON.ERR_CODE == "S") {   // 조회 성공이면 @@@
 
		dlt_task_main.setJSON(rtnJSON.OUT_DATA); 
		
		debugger; 	// debugger TEST @@@ ===>
	}
};

3. 크롬 ==> 개발자 도구(D) ==> Sources Tab에서
 1) 하단 Console  Tab에서[debugger가 걸린 상테에서 실행]

> dlt_task_main.getAllJSON(); 						---> 조회된 dlt_task_main Ds를 보기 ■■■
(3)?[{…}, {…}, {…}]0: {TASK_ID: "T001", TASK_NM: "예적금 상품안내", TASK_TYPE: "UI", REG_USER_ID: "관리자 (100001)", MOD_USER_ID: "관리자 (210001)",?…}1: 
							{TASK_ID: "T007", TASK_NM: "대출 상품안내", TASK_TYPE: "UI", REG_USER_ID: "관리자 (210001)", MOD_USER_ID: "관리자 (210001)",?…}2: 
							{TASK_ID: "T008", TASK_NM: "자동차 대출 상품안내", TASK_TYPE: "UI", REG_USER_ID: "관리자 (210001)", MOD_USER_ID: 
							"관리자 (210001)",?…}length: 3__proto__: Array(0)
-----------------------------------------------------------------------------------------------------------------------------

console.log("[/WF001M.xml] [sbm_Login_submitdone()] ==> [TEST_51] [dlt_task_main(TAKS 정보 Ds), 조회수]"+ dlt_task_main.getTotalRow() 
+"[dlt_task_main]"+ JSON.stringify(dlt_task_main.getAllJSON()) );
console.log("[/WF001M.xml] [sbm_Login_submitdone()] ==> [TEST_52] [dlt_task_main(TAKS 정보 Ds), 조회수]"+ dlt_task_main.getTotalRow()
+"[dlt_task_main]"+ WebSquare.xml.serialize(dlt_task_main.getAllXML()) );
==============================================================================================================

- stringify 함수
1. stringify: JavaScript 값이나 객체를 JSON 문자열로 변환
 1) console.log(JSON.stringify({ x: 5, y: 6 }));
// expected output: "{"x":5,"y":6}"

 2) console.log(JSON.stringify([new Number(3), new String('false'), new Boolean(false)]));
// expected output: "[3,"false",false]"
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.25(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말[★]
08:50 기상 
09:00 조식
09:20 실내 자전거 타기
10:20 종료
10:30 인터넷 서핑 
12:00 중식
12:30 실내 자전거 타기
12:35 루옌(수종) 놀러감
13:15 종료  
13:30 인터넷 서핑
18:10 석식
19:00 귀가
19:10 실내 자전거 타기
20:00 종료
20:10 인터넷 서핑
21:00 샤워 ==> 체중: 73.8kg
21:25 인슐린 약 교체(257U, 14U 남음)
21:35 루옌(수종) 귀가
23:00 취침
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.07.26(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말2[★]
08:40 기상
08:40 조식
09:00 실내 자전거 타기 
10:10 종료 
10:15 인터넷 서핑
11:58 루옌(수종) 놀러감
12:10 중식
12:30 실내 자전거 타기
13:30 종료  
16:20 귀가  
18:10 석식
15:40 인터넷 서핑
18:30 실내 자전거 타기
19:30 종료
19:40 인터넷 서핑 
2130 루옌(수종) 귀가
23:10 취침
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.27(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 직장인대출 분석
1. 직장인대출 분석(P002) ==> /ui/xTouch_Sample/sample/P002/P002.xml
 1) 휴대폰 본인인증(T002, 01) ==> /ui/xTouch_Sample/sample_ui/com_phn.xml
 2) 요구불계좌조회(T013, 01) ==> /ui/xTouch_Sample/sample_ui/com_account_chk.xml
 3) 비대면 실명 인증(T004, 01) ==> /ui/xTouch_Sample/sample_ui/com_content.xml
=================================================================================================================

- WS5 압축, 백업
1. WS5: 2.59GB   ==> WS5.7z: 1.4GB
=================================================================================================================

- 박민형PM한테 전화 옴(15:30)
1. 현대제철 안전관리 프로젝트 검수 도장 받아서 철수한다고 함(노트북 시건 장치 비번 요청(2222)해서 알려줌)
2. 제 자리에 놔둔 모니터 2대 철수 요청. 
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.28(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 직장인대출 분석
1. 직장인대출 분석(P002) ==> /ui/xTouch_Sample/sample/P002/P002.xml
 1) 휴대폰 본인인증(T002, 01) ==> /ui/xTouch_Sample/sample_ui/com_phn.xml
 2) 요구불계좌조회(T013, 01) ==> /ui/xTouch_Sample/sample_ui/com_account_chk.xml
 3) 비대면 실명 인증(T004, 01) ==> /ui/xTouch_Sample/sample_ui/com_content.xml
=================================================================================================================

- 정기적금 프로세스 생성
1. 프로야구 적금(P008) ==> /ui/xTouch_Sample/sample/P008/P008.xml
01. 에금.적금 가입(T014, 01, 01) ==>  /ui/xTouch_Sample/sample_ui/P008/deposiIinstSavingsJoin.xml
02. 2020 프로야구 적금(T015, 01, 01) ==> /ui/xTouch_Sample/sample_ui/P008/bsb2020instSavings.xml
03. 2020 KIA타이거즈 적금(T016, 01, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavings.xml
04. 모바일 채널 본인 확인_1. 메인(T017, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentification.xml
05. 모바일 채널 본인 확인_2. 약관보기(T017, 02, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationTerms.xml
06. 모바일 채널 본인 확인_3. 휴대폰 인증 요청(T017, 03, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationHp.xml
07. 2020 KIA타이거즈 적금 가입_1. 약관 동의(T018, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinClauseAg.xml
08. 2020 KIA타이거즈 적금 가입_2. 약관 보기(T018, 02, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinClauseView.xml
09. 2020 KIA타이거즈 적금 가입_3. 정보 입력(T018, 03, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinReg.xml
10. 2020 KIA타이거즈 적금 가입_4. 정보 확인(T018, 04, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinView.xml
11. 2020 KIA타이거즈 적금 가입_5. 가입 완료(T018, 05, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinRegDone.xml
12. 적금 가입 완료(T019, 01, 01) ==> /ui/xTouch_Sample/sample_ui/P008/instSavingsJoinDone.xml
=================================================================================================================

- 『2020 신한 KIA타이거즈 적금(자유적립식)』 가입
- 상품명 : 『2020 신한 KIA타이거즈 적금(자유적립식)』
- 계좌번호 : 230-243-281146
- 가입금액 : 10,000원
- 이자: 기본 금리: 연 1.4%,
 1) 한국 시리즈 우승시: 연 1.0%, 포스트 시즌 진출시: 연 0..8%, 그외 구단 선택시: 연 0.5%
- 신규일자 : 2020.07.28
- 만기일자 : 2021.07.28
- 세금우대(비과세) 한도 : 해당사항없음 
- 자동이체 금액 : 10,000원
- 자동이체 시작일 : 2020.08.28 (이체주기:1개월) 
- 자동이체 종료일 : 2021.07.28
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.29(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 하루 종일 비(우산), 주간업무 보고서 작성(제주은행_PMO_2110_주간업무보고_04주차_진태만.pptx)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 정기적금 프로세스 생성
1. 프로야구 적금(P008) ==> /ui/xTouch_Sample/sample/P008/P008.xml
01. 에금.적금 가입(T014, 01, 01) ==>  /ui/xTouch_Sample/sample_ui/P008/deposiIinstSavingsJoin.xml
02. 2020 프로야구 적금(T015, 01, 01) ==> /ui/xTouch_Sample/sample_ui/P008/bsb2020instSavings.xml
03. 2020 KIA타이거즈 적금(T016, 01, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavings.xml
04. 모바일 채널 본인 확인_1. 메인(T017, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentification.xml
05. 모바일 채널 본인 확인_2. 약관보기(T017, 02, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationTerms.xml
06. 모바일 채널 본인 확인_3. 휴대폰 인증 요청(T017, 03, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationHp.xml
07. 2020 KIA타이거즈 적금 가입_1. 약관 동의(T018, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinClauseAg.xml
08. 2020 KIA타이거즈 적금 가입_2. 약관 보기(T018, 02, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinClauseView.xml
09. 2020 KIA타이거즈 적금 가입_3. 정보 입력(T018, 03, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinReg.xml
10. 2020 KIA타이거즈 적금 가입_4. 정보 확인(T018, 04, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinView.xml
11. 2020 KIA타이거즈 적금 가입_5. 가입 완료(T018, 05, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/kia2020instSavingsJoinRegDone.xml
12. 적금 가입 완료(T019, 01, 01) ==> /ui/xTouch_Sample/sample_ui/P008/instSavingsJoinDone.xml
=================================================================================================================

- 제주은행 WBS 일정 작성(14시) ==> 완료 @@@
1. 제주은행_PMO_1120_WBS_v0.65_진태만.xlsx
 1) 프로그램명세서: 인터페이스 설계서(전송 정보)
 2) 개발 기간: 09.01 ~ 10.31
=================================================================================================================

- 삼성SDS smartTogeter 가입
https://www.smart-together.com:2016/srm/index.html, tamario2 / 202*오*h@
1. 학력, 경력 사항 입력 ==> 집에 가서 작성 완료(22시, 등급: 특급2 나옴) @@@
=================================================================================================================

- LG CNS PartnerPlus 수정
https://partnerplus.lgcns.com/lpp/home
https://www.smart-together.com:2016/srm/index.html, DEV109094 / 202*오*h@
1. 학력, 경력 사항 확인
=================================================================================================================

- 아이핀 인증 비밀번호 변경(i-pin)[2020.07.29(수)]
1. 발급기관: 한국신용평가정보 ==> https://www.siren24.com ==> tamario / h202*오*h@ --> 2차 비밀번호: hp수*16*1
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.30(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 정기예금 프로세스 생성 
1. 정기예금(P009) ==> /ui/xTouch_Sample/sample/P009/P009.xml
01. 예금 가입(T020, 01, 01) ==>  /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoin.xml
02. 11번가 정기예금(T021, 01, 01)  ==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsNo11.xml
03. 모바일 채널 본인 확인_1. 메인(T017, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentification.xml
04. 모바일 채널 본인 확인_2. 약관보기(T017, 02, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationTerms.xml
05. 모바일 채널 본인 확인_3. 휴대폰 인증 요청(T017, 03, 01)  ==> /ui/xTouch_Sample/sample_ui/P008/mobileChnIdentificationHp.xml
06. 11번가 정기예금 가입_1. 약관 동의(T022, 01, 01) 	==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinClauseAg.xml
07. 11번가 정기예금 가입_2. 약관 보기(T022, 02, 01) 	==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinClauseView.xml
08. 11번가 정기예금 가입_3. 정보 입력(T022, 03, 01) 	==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinReg.xml
09. 11번가 정기예금 가입_4. 정보 확인(T022, 04, 01) 	==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinView.xml
10. 11번가 정기예금 가입_5. 가입 완료(T022, 05, 01) 	==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinRegDone.xml
11. 예금 가입 완료(T023, 01, 01) ==> /ui/xTouch_Sample/sample_ui/P009/depositSavingsJoinDone.xml
=================================================================================================================

- 신한은행 정기예금 가입
- 상품명 : 『신한 11번가 정기예금』
- 계좌번호 : 200-532-682350
- 가입금액 : 1,000,000원
- 이자: 기본 금리: 연 1.1%(고정금리)
- 신규일자 : 2020.07.30
- 만기일자 : 2020.10.30
- 이자지금방식 : 만기일시지급-단리식
=================================================================================================================

- 와이즈핏 거치대(노트북 거치대)
1. 노트북 거치대 | 높이조절 | 미끄럼 방지 | 접이식 다리 | 재질:알루미늄 | 색상:실버 | 크기: 255x35x13mm | 무게: 230g | 가격: 18,520원
http://www.enuri.com/detail.jsp?modelno=51620130&cate=&IsDeliverySum=N
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.07.31(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:30 ==> 모니터 반출 재요청(09:40: 오태범 이사가 나중에 현대제철(당진) 가서 모니터 반출해 온다고 함)
									, 본사에서 짐싸서 철수(17:30 , 다음주 월요일부터 명동으로 출근)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 접속정보(F/WF004M.xml) 분석
=================================================================================================================

- https://192.168.0.27:443에 대한 서버 인증서 유효성 검사 오류
1. eclipse에서 싱크 맞추면 이런 현상 발생 ==> accept하고 처리함
 Error validating server certificate for https://192.168.0.27:443:
 - Unknown certificate issuer
   Fingerprint: 36:2D:4B:8E:C8:30:44:19:8B:62:24:7A:EF:36:E7:72:D6:EC:D6:35
   Distinguished name: DESKTOP-QQMTNNQ
 - Hostname mismatch (DESKTOP-QQMTNNQ)
=================================================================================================================

- DBeaver에서 한글 깨짐 현상
1. 상단 윈도우(W) Tab ==> 설정 ==> 환경설정(P: 새창)
 1) 일반 > 작업공간 > 텍스트 파일 인코딩(T)
  가. 텍스트 파일 인코딩(T): 기본(MS9490)(U) ==> 기타(O): UTF-8로 변경 
=================================================================================================================

- W-XTouch 구조도 그리기
1. W-Xtouch 화면개발가이드_ver1.0.pptx 파일에서 PPT로 그림
=================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

