

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2020.08) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2020.08.01(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 점심시간에 비 많이 옴(13시, 도림천 안전 사고, 1명 사망, 35명 고립 후 구조)

- 주말[★]
07:00 기상
07:40 조식
08:00 실내 자전거 타기
09:00 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기 ==> 폭우
13:30 종료  
13:30 루옌 놀러감
18:50 귀가
19:10 석식
19:20 루옌 귀가
19:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
21:00 샤워 ==> 체중: 74.8kg
21:26 인슐린 약 교체(280U, 6U 남음)
22:20 취침
=================================================================================================================

- 임대차 3법
1. 전월세 신고제: 계약 후, 30일 이내에 계약 내용을 해당 지역 시.군.구청에 신고
2. 전월세 상한제: 기존 계약 갱신 시, 임대료 상승폭 5%로 제한
3. 계약 갱신 청구권: 세입자의 기존 2년 계약이 끝나면, 추가로 2년 동안 계약 연장 가능(2+2년 보장)
 1) 묵시적 갱신 VS 계약 갱신 청구권 ==> 임대인 권리 주장 여부의 차이
 2) 계약 연장 거부 사유: 임대인, 임대인의 지계 존비속 실 거주
https://www.youtube.com/watch?v=cECP-6QU9xE
https://www.youtube.com/watch?v=uwIEmQx-Ejc
==> 이미 임대차 계약을 연장한 경우: 임대차 3법이 시행(2020.08.01)된 이전 계약 이력은 계약에 신청구권 행사에 아무런 영향을 주지 
않음(새입자가 2년 거주 후 2년 계약 연장을 요구할 수 있음)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.02(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전, 저녘에 비 많이 옴

- 주말2[★]
07:40 기상 ==> 루옌 친구 어제 밤에 우리집에서 자고 감
08:10 조식
08:30 실내 자전거 타기 
09:10 종료 
09:40 인터넷 서핑
10:00 루옌(수종) 서동탄에 놀러감  
11:00 가계부 월말 결산 ==> 01. 자산 검증(2020.07).xlsx
12:10 중식
12:30 실내 자전거 타기
13:30 종료
15:40 인터넷 서핑
18:00 루옌(수종) 귀가  
18:10 석식
18:30 실내 자전거 타기
19:30 종료 
19:40 인터넷 서핑 
23:00 취침 ===> 루옌이 식탁에서 베트남 방송 듣고 있어서 시끄럽다고 화내며 문 꽝 닫음(내가 자는 줄 알았다고 함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.03(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00 ==> 출근시 비 많이 옴(백팩, 명동 첫 출근)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행 모바일 뱅킹(jWEB) 프로젝트 명동 이동
1. 파리바게뜨 명동본점(커피) ==> 신한은행 명동지점 6층[제주은행 ICT지워부 서울 사무소] 이동 ==> 구종식 부장, 이경일 부장
, 박찬형 대리, 박검유 대리, 김유이 사원,한혜숙 부장(프리랜서) ==> (주)인스웨이브 이광철 이사 만남 ==> 기획팀, 디자인팀, 퍼블팀 소개
2. 자리 배정(구석 맨 끝 창문 자리: 박찬형 대리에 옆자리[최선]), PC, 모니터 지급 받음
3. 출입문(2개) 보안 지문 등록(4명) ==> 구종식 부장, 이광철 이사, 박소영 계장(제주은행 ICT 지원부, 고향 제주)
4. 문서 보안 신청 했다고 함 ==> 승인이 나면 추후 통보할 예정
5. SVN 신청 했다고 함 ==> 승인이 나면 추후 통보할 예정 
==============================================================================================================

- PC CMOS 셋업 비밀번호
1. u175087@
--------------------------------------------------------------------------------------------------------------------------------

- PC 비밀번호
1. jjb/u175087 / jjb@3584
==============================================================================================================
 
- IP 주소
> ipconfig
IPv4 주소: 172.16.175.87
서브넷 마스크: 255.255.255.0
기본 게이트웨이: 172.16.175.1
 ==============================================================================================================
 
- 엠 파위[보안 파일 서버] 로그인
1. 사번: 652525/asas12***@
==============================================================================================================

- 큰누나에게 전화하여 루옌과 이혼 문제 논의(21시)
1. 저번주 토요일 퇴근하고 집에 왔는데 밥 달라고 했는데 밥 안 차려줌(요즘 들어 밥 안 차려줌)
2. 저번주 일요욜 상의도 없이 친구 데리고 와서 자고 감(당뇨 걸러서 집에서 팬티 바람으로 있는데 챙피함, 왜 상의도 없어
친구, 언니들을 데리고 오는지 이해 못 함)
3. 큰누나는 절대 이혼 해주지 말라고 수종이도 같이 보내지 말라고 함 
==============================================================================================================

- 루옌과 이혼 문제 논의(23시)
1. 요즘 들어 밥 안 차려줌 ==> 빨래, 밥, 집안 청소는 내꺼는 내가 한다고 함(대신 생활비 50만원 준다고 통보함)
2. 왜 상의도 없어 친구, 언니들을 데리고 오는지 한국 사람으로서 이해 못 하겠다고 함(절대로 사람 데이고 오지 말라고 경고함)
   ==> 베트남에서는 친한 사람을 자기 집에 불러 들이는 것이 문제없다고 주장함 
3. 큰누나가 수종이 맡아 키우면 수종이 1학년 마치면(6개월 후) 이혼하자고 함 ==> 나는 이혼은 절대 안되고 그냥 집 나가라고 함
 1) 수종이 버리고 집 나가겠다는 말에 내가 충격을 받음
 2) 이혼은 절대 안한다고 해도 별거는 각오 해야할 것 같음 ==> 루옌은 자기가 사랑없이 수종이 때문에 계속 참고 살고 있다고 주장함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.04(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근시 비 조금 옴(06:50)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]!
- SW 설치
- 제주은행 통합 로그인 설치
1. 652525 / as**12**@
==============================================================================================================

- Chakra Max Client 설치
1. 감시 대상 DB에 대한 접근 권한을 인증 받기 ==> 652525A / as**12**@
==============================================================================================================

- 쿼리원[DB 관리툴] 설치
1. 652525_T / as**12**@
==============================================================================================================

- 하이팀 5.0[접근통제시스템] 설치
1. t652525 / as**12**@
 1) 개발 서버: jjmbtsad1a[172.16.190.120]
 2) 운영 서버: jjmbswe1a[211.193.255.90]
==============================================================================================================

- 제주은행 XTouch 로컬에서 Oracle DB 접근 권한 문제
1. 제주은행 보안팀에서 로컬에서 Oracle DB 접근 못 한다고 통보: 공통 담당자인 이경일 부장이 고민이 깊어짐 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.05(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 18:30 ==> 출근하 때 비(우산), 주간보고(5주차): 박건유 대라가 일괄 작성

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- WS5_0804.zip 파일 다운로드
1. C:\WS5에 셋팅
 1) jWeb: m.e-jejubank.com
 2) xTouch
==============================================================================================================
 
- Websquare Preview Setting
1. http://localhost:9001/websquare/websquare.html 
==============================================================================================================

- 금융 상품 관리자 화면 관련 회의(17:30 ~ 18:30, 회의실)
1.  참서자: 구종식 부장 외 6명, 이광철 이사, 기확팀, 김준 대리(회의 주관), 박소영 계장, 강승규 차장
2 내용:
 1) 금융 상품을 현재의 시스템[JAVA]에서 등록할수 없음
   가. 이유: 웹시퀘어에서는 html. 지원 안함  ===> src = "/tedt.xml"로 사용
   나. 현재의 시스템[JAVA]에서 금리(DB에서 부러 옴), 나머지는 html 코딩으로 화면이 구성됨
 2) 현재의  xTouch 관리자 시스템에서 금융 상품 관리 기능을 개발한다고 했을 때 문제점
  가. 분석, 설계를 해야하고 개발 기간이 많이 소요됨
==> 결국은 xTouch 관리자 시스템에서 금융 상품관리 기능을 추가해야 한다고 함(이경일 부장) 
==============================================================================================================

- 다문화 전화 상담(15:30)
1. 구로 다문화 센터에 전화: 센타 방문하여 상담은 3개월 걸린다고 함(10번 상담), 토요일 상담 불가
2. 영등포 다문화 센터에 전화: 전화 상담(내 상황 설명), 센타 방문하여 상담은 3개월 걸린다고 함(10번 상담), 토요일 상담 불가
3. 강동구 다문화 센터에 전화: 센타 방문하여 상담은 3개월 걸린다고 함(10번 상담), 토요일 상담 가능
==============================================================================================================

- 강금숙 매니저와 통화(16시)
1. 내 상황 설명
 1) 상담 요청: 8년 동안 살았는데 상담 들어 가도 쉽지가 않을 것이라고 함
 2) 이혼은 해주지 말라고 함
==============================================================================================================

- 이종민(응아 남편)과 통화(22:40)
1. 내 상황 설명
 1) 내가 중심이 되어서 대화하고 설득하고 풀어라고 함
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.06(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 18:00 ==> 출근할 때 비(우산), 실내 자전거 타기(19:20 대왕 세종[86회, 마지막회] 시청)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
~ 스토리보드 분석
==============================================================================================================

- 개발 서버 셋팅(이경일 부장)
1, Weblogic[WAS] 14시에 해당 업체에서 와서 셋팅 해준다고 함
 1) Weblogic 설치 ==> class 파일 복사
2. 웹서버[] 설치
 1) Weblogic 설치 ==> /ui 폴더 밑에 있는 파일 복사, SSL 등록
==============================================================================================================

- 개발 환경 여부 확인
com.isLocal = function() {
	if(WebSqureExternal.profile == "local˚) {	// 서버가 로컬 이면 ==> dev, prod
		return true;
	}
	return false;
}; 
==============================================================================================================

- 담당자
A. 현업
1. 이유석 과장(제주은행 ICT 지원부, 디지털 사업팀)
2. 김준 대리(제주은행 ICT 지원부, 디지털 사업팀)
3, 박소영 계장(제주은행 ICT 지원부, 디지털 사업팀)
4. 강승규 차장(제주은행 모바일 전담팀)
B. 기타
1. 이광철 이사(PM, 기술사, 인스웨이브)
2. 이진영 수석(기획, 인스웨이브)
3. 송하은 수석(퍼블러셔 인스웨이브)
==============================================================================================================

.- 택배 수령(08:50)
1. 박소영 계장앞으로 온 PC 2대, 모니터 3대 수령함 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2020.08.07(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 18:00 ==> 실내 자전거 타기(19:20 육룡이 나르샤[2회] 시청)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 예금 플로우 차트 작성
==============================================================================================================

- 복된장마비 파워포인트레벨업
https://www.youtube.com/channel/UCblqvnN0ZhADyGJnluN6iQA/playlists
=================================================================================================================

- 상품 가입 화면 설계서 초안 리뷰 관련 회의(14:00 ~15:00)
1. 참석자: 구종속 외 6명, 기획팀(이진영 차장, 김혜임 차장), 김준 대리
2. 내용: 
 1) 상품가입 화면 설계서 초안 리뷰: 김혜영 차장
 2) 상품가입 화면 개발 방식에 대한 확인 및 논의
  가. 이용 약관: 상픔별로 각각 하드코딩으로 구성해야 함
  나. 신청 정보 입력: 상품별로 각각 하드코딩으로 구성해야 함
==============================================================================================================
  
- 상품 가입 화면 설계서 초안 리뷰 관련 회의(14:00 ~15:00)
1. 참석자: 구종속 외 6명, 기획팀(이진영 차장, 김혜임 차장), 김준 대리
2. 내용: 
 1) 상품가입 화면 설계서 초안 리뷰: 김혜영 차장
 2) 상품가입 화면 개발 방식에 대한 확인 및 논의
  가. 이용 약관: 상픔별로 각각 하드코딩으로 구성해야 함
  나. 신청 정보 입력: 상품별로 각각 하드코딩으로 구성해야 함
==============================================================================================================

- 루옌과 이혼 문제 논의(23시)
1. 내가 루옌에게 큰누나가 수종이 안 키워 준다고 말함
 1) 나도 수종이 혼자 못 키운다고 함 ==> 고아원에 맡겨야 한다고 함
 2) 내가 잘못 했다고 사과함 ==> 내가 더 노력하고 살겠다고 함
2. 루옌은 계속 이혼 서류 가지고 오라고 함
 1) 나는 이혼은 절대로 못 한다고 말함
3. 더 생각해보고 나중에 다시 이야기 하자고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.08(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 밤에 비 많이 옴 

- 주말[★]
08:30 기상
08:40 조식
09:00 실내 자전거 타기
10:00 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기
13:30 종료   
17:30 집출발(자전거)
17:40 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 10,900원) 구입 
17:50 귀가
18:10 석식
19:20 루옌 언니(은영 엄마)집에 놀러감
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
22:00 샤워 ==> 체중: 74.3kg
22:48 인슐린 약 교체(277U, 28U 남음)
22:20 취침
=================================================================================================================

- 당신이 알아야 할 파워포인트 단축키 Shift(쉬프트)편 - 규쌤 - 파워포인트 강의
- Shift + 마우스: 질서 정연한 친구 
1. 개체 비율 유지 키우기(M, K)
2. 수직/수평 이동
3. 회전 15도씩 가능
4. 객체 다중 선택 및 해제
https://www.youtube.com/watch?v=jFaGuUybcso
----------------------------------------------------------------------------------------------------------------------------------

- 당신이 알아야 할 파워포인트 단축키 Ctrl(컨트롤)편 - 규쌤 - 파워포인트 강의
- Ctrl + 마우스: 정 많고 인심 좋은 친구
1. 객체 복사
2. 개체 자기중심으로 커지기
3. 개체 복수선택 및 복사
4. 슬라이드 확대 및 축소
5. 키보드 방향키로 미세이동
6. Shift와의 콜라보
https://www.youtube.com/watch?v=YHHz3AHS7tA
----------------------------------------------------------------------------------------------------------------------------------

- 당신이 알아야 할 파워포인트 단축키 Alt(알트)편 - 규쌤 - 파워포인트 강의
- Ctrl + 마우스: 똑똑하고 예민한 친구
1. 마우스로 미세이동
2. 개체 회전(15도씩)
3. 다른 실행도구와의 시작
https://www.youtube.com/watch?v=NgSqv0Pw2Xo
=================================================================================================================

- [PPT 시크릿] 파워포인트 빠른 실행 도구 모음 설정│콘텐츠위드(Contents With)
https://www.youtube.com/watch?v=qPWZMppBh8w
01. [PPT] TAMA 빠른 실행 도구 모음_2020.08.08.exportedUI
=================================================================================================================

- 복된장마비 파워포인트레벨업
https://www.youtube.com/channel/UCblqvnN0ZhADyGJnluN6iQA/playlists
=================================================================================================================

- [파워 포인트] 글꼴 생성
1, KoPub  ==> 01. 진태만 글꼴(KoPub)
http://www.kopus.org/biz/electronic/font.aspx
2. Noto Sans ==> 02. 진태만 글꼴(Noto Sans)
https://www.google.com/get/noto/#/family/noto-sans-kore
3. 03. 진태만 글꼴(함초롬돋움)
=================================================================================================================

- 글꼴 등록
1. 원하는 폰트를 구해서 C:\Windows\Fonts 폴더에 붙여넣기
=================================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2020.08.09(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전, 오후에 비 많이 옴

- 주말2[★]
08:20 기상
08:30 조식
09:00 실내 자전거 타기 
10:00 종료 
10:00 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료 
14:00 루옌 커피샵에 언니 만나러 감
15:40 인터넷 서핑 
18:10 석식
18:30 실내 자전거 타기
19:30 종료 
19:40 인터넷 서핑 
20:20 루옌 귀가 
23:00 취침 
==============================================================================================================

- PPT 단축키 끝판왕[피피티프로젝트]
1. Ctrl + Shift + 드래그: 수직, 수평 복사
2. F4: 재실행
https://www.youtube.com/watch?v=liqVnWFg_JY
https://m.post.naver.com/viewer/postView.nhn?volumeNo=16826470&memberNo=15574193
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.10(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 회원가입 분석
1. 휴대폰 인증, 비디면 실명인증, 고개정보 등록, 입출듬계좌 등록
==============================================================================================================

- 로그인 분석
1. 간편 로그인
 1) 휴대폰 인증, 입출금 계좌 등록
2. 클라우드 인증서 로그인
 1) 휴대폰 인증, 비대면 실명인증
==============================================================================================================

- 상품가입 분석
1. 입출금 계좌 존재여부 확인 ==> 고객 정보 등록(신규, 5년 이내 로그인 없으면), 상품 가입
==============================================================================================================

- 예금, 적금 플로두 차트 작성
1. 예금, 적금 플로우 차투.ppt 작성
==============================================================================================================

- 개발 서버 셋팅
1. xTouch: 172.16.190.120:30001/xtouchadmin.do
2. jWeb: 172.16.190.120:26001 
==============================================================================================================

- 쌀 20kg 구입
1. 농협양곡 무안 칠산바다 간척지쌀 20kg, 2019년산, 가격: 52,500원[학생식재료포인트(서울): 40,000원할인], 실제 가격: 12,500원
==> '서울시교육청‘에서 준 농협몰 포인트[4만원]으로 구입
http://www.nonghyupmall.com/BC14010R/viewDetail.nh?wrsC=3000909689&chanC=1101&basketCnt=1
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.11(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근 시 비 (우산), 태훈이형 만남(12시 명동)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 수신 업무 분석
1. 입출금 통장: j간편통장(디폴트)
 1) 입출금 상품리스트: 저축예금
==============================================================================================================

- 제주은행 앱(jeju Bank) 설치 및 회원 가입
1. 비대면 인증실패 후 성공
 1) 사진 촬영 후 성공 ==> 화질 문제로 인장 실패 : 엥상 통화 시도 (상담원 통화): 전화 끈기
 2) 시진 촬영 성공 ==> 화질 좋아서 등록됨
2. 신규 계좌 개설: 탐나는 J주거래통장: 50-01-326658
3. 간편 비밀번호: 333****
==============================================================================================================

- 김혜임 치장 면담(15시, 내자리)
1. 김헤임 차장(기획. 금융상픔. 인스웨이브) ==> 예금, 적금 플로우 관련 문의
 1) 로그인 성공 후 입출입금 계좌 체크(계좌 유효성 체크)
==============================================================================================================

- 신한은행 주거래 통장
1. 신한은행 계좌: 110-437-783130
==============================================================================================================

- 태훈이 만남(12시,명동)
1. 신사 조기회 문제
 1) 태훈이형이 감독 사퇴: 상요형이 회장이여서 평일 운동 문제로 갈등이 싸여서 그만둠
 2) 코로나때문에 2월부터 신구초에서 축구 못함
 3) 10월 칭립 기념식 어떻게 할지 고민이릭 함(총무인 병춘이형도 사퇴함)
2. 개인젝인 일
 1) 딸 교육 문제로 관악구 아파트전세 놓고 강남으로 이사 했다고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.12(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주간보고서 작성(6주차) (13시)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 오라클 DB 기발 서버 계정 생성
1. ID: MWEB
2. PW: ojpbjtwb2008@
3. IP: 172.16.190.120
4. PORT: 1521
==============================================================================================================

- 2020년 08월(정기분) 주민세 납부
1. 롯데카드(페이코)로 납부, 금액: 5,850원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.13(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>. 중식 후 지히도 걷기(12시, 동대문역사문화공원역까지 왕복), 개발팀 회의(09:29 ~ 09:40, 빠리바게뜨, 구부장이 쏨) 
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 수신업무 분석
1. jWEB Flow Chart.ppt 생성
 1) 예금, 적금[1. 간편 로그인] TASK 생성
 2) 예금, 적금[3. 로그인 세션 존재] TASK 생성
==============================================================================================================

- 기획 관련 회의(10:00 ~ 11:00, 회의실)
1. 참석자: 구종속 외 6명, 이광철 이사, 기획팀(이진영 차장, 김혜임 차장), 김준 대리, 박소영 계장
2. 내용:
 1) 제주은행 모바일뱅킹구축 메뉴트리 최종 확정 ? 검토 요청(이지영 차장 주관)
  가. 기획이 관리자 화? 때문에 일관성있게 기획하기 힘들다고 함
 2) 적굼 추가 납입 가능 추가
  가. 우가 입금 가능하도록 기획 벤경 힌다고 함
 3) 예금, 적금 금리 변동 Disolay 기능 추가
  가. 신한은행 Web 침조
==> 이광철 이사와 이진영 차장 다툼
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.14(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00 ==>  
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 수신업무 분석
1. jWEB Flow Chart.ppt 생성
 1) 예금, 적금[2. 클라우드 인증] TASK 생성
 2) 예금, 적금[4. 회원 가입] TASK 생성
==============================================================================================================

- XTouch 수정(17시, 이경일 부장 교육)
1. XTouch 일부 수정(제목, CSS 설정)
2. jWeb Prj은 로컬에서  Oracle DB 접근 가능(XTouch Prj은 로컬에서  Oracle DB 접근 블가능)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.15(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 광복절(휴일), 오전에 종일 비 많이 옴(15시 30분경에 비 그침)

- 주말[★]
07:30 기상
08:00 조식
08:30 실내 자전거 타기
09:30 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑 
15:00 루옌 친구 만나러 감 
18:10 석식  
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
20:20 루옌 귀가
22:00 샤워 ==> 체중: 75.2kg
22:22 인슐린 약 교체(282U, 20U 남음)  
22:20 취침
=================================================================================================================

- 초등돌봄교실 귀가 및 이용 서약서 작성(대동초, 1-1 진수종)
1. 돌봄교실 대리인 동행 귀가 위임장 작성 문의(돌봄 교실 선생에게 문자 보냄)
=================================================================================================================

- 공인인증서 폐지, '전자서명'은 어떻게 대체될까? - 블록체인 주간 이슈 분석(금융인증서비스)
https://www.youtube.com/watch?v=KQUsQ0vvvUc
=================================================================================================================

- 01. 제주은행 jWEB Flow Chart.pptx 작성
01. 예금, 적금[1. 간편 로그인] TASK 생성
02. 예금, 적금[2. 클라우드 인증] TASK 생성
==> 선(화살표) 길이: 높이(E): 0.8cm 
 2) 예금, 적금[3. 로그인 세션 존재] TASK 생성
==============================================================================================================

- MV Motto Diary  [실제 영화]
https://www.youtube.com/channel/UCECxV65jKqyV9Z5KwNqOI9w
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.16(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★]
07:30 기상
08:00 조식
08:30 실내 자전거 타기
09:30 종료
10:00 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료    
14:00 루옌(수종) 은영이집에 놀러 감 
15:40 인터넷 서핑
17:10 집출발(자전거)
17:20 동구로 초교 앞 ==> 은영이집에 놀든 수종이 데리려 갔다 옴
17:50 귀가 
18:10 석식
18:30 실내 자전거 타기
19:30 종료 
19:40 인터넷 서핑 
20:00 루옌 귀가 
23:00 취침 
==============================================================================================================
   
-  2020년 장마 종료 
1, 역대  최장 기간: 2002.06.24 ~ 08.16 ==> 54일
2, 역대  2번째 강수량:897.0㎜  --> 2011년(942.2㎜)
==============================================================================================================

- 01. 제주은행 jWEB Flow Chart.pptx 작성
03. 예금, 적금[3. 세션 존재] TASK 생성
04. 회원 가입 TASK 생성 
 1) 선[선 -> 상하 화살표] ==> 길이: 높이(E): 0.8cm
 2) 사각형 도형[순서도 -> 처리] ==> 높이(E): 0.8 cm, 너비(D): 2.86 cm
==============================================================================================================
 
- 당신이 몰랐던 고려의 요동 정벌 #1탄 (공민왕의 강력한 한 방!) [역사위키 교과서엔 없는 리얼스토리]
https://www.youtube.com/watch?v=ecz322hzwmE
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.17(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 임시공휴일

- 주말3[★]
06:30 기상
07:00 조식
07:30 실내 자전거 타기
08:30 종료
08:35 루옌 출근
09:00 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료 
15:40 인터넷 서핑
17:30 집출발(자전거)
17:40 맛닭꼬 남구로점 ==> 갈릭 베이크(포장: 10,900원) 구입 
17:50 귀가 
18:10 석식
18:30 실내 자전거 타기
18:40 루옌 퇴근
19:30 종료  
19:40 인터넷 서핑  
23:00 취침 
==============================================================================================================

- 정기 예금 TASK, 프로세스 등록
- TAKS 등록
1. TASK ID: T101, 		2. TASK 명: 예금 상품 목록, 
3. 비고 ID: 01. 예금 가입[START] [★]
--------------------------------------------------------------------------------------------

- TAKS 상세 등록
1. TASK URL: /ui/xTouch_Sample/sample_ui/P010/depositSavingsJoin.xml
3. 비고 ID: 01. 예금 가입
==============================================================================================================

- 정기 예금 TASK, 프로세스 등록
01. 예금 상품 목록: 01. 예금 가입[START] [★]  ==> /ui/xTouch_Sample/sample_ui/P010/depositSavingsList.xml
02. 예금 상품 상세 ==> /ui/xTouch_Sample/sample_ui/P010/depositSavingsDtl.xml
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.18(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  개발자 2명 투입(13시, SM 인력(장성진 과장[대구], 전민철 대리[제주 SM]), 개발자 전체 모임(커피) 오태범 이사 
									방문(현대제철에서 반출 다시 요청)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- jWEB 소스 분석
1. 02, jWeb Prj 샘플 분석.txt 파일 작성 
==============================================================================================================

- AOP 분석
1, 로컬 서버 Service 단에서 개발 서버(WAS) DAO 호출
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.19(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 사업장 출입 명부 작성(7시), PC, 모니터 추가 지급(메일, 메신저용), 주간보고서(7주차) 작성(13시)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- jWEB 소스 분석
1. 예금 TASK, 프로세스 생성
==============================================================================================================

1. 프로세스 생성
P003: 예금 가입 ==> 예금 가입[★]
==> * 프로세스 REV:01
==> * 프로세스 URL: /ui/xTouch_Sample/P003/P003.xml
---------------------------------------------------------------------------------

1) 이용 TASK 현황
==> TASK ID: T004, 예금 상품 목록
==> TASK ID: T005, 예금 상품 상세 
? 이어가기 여부:. N     				* 진행단계: 1
? 종료시점 이어가기 체크: N, 	* 진행단게명: STEP1 

2. 예금 TASK 생성
T004: 예금 상품 목록  ==> 01. 예금 상품 목록(T004, 01)
==> TAKS_URL: /ui/xTouch_Sample/sample/ui_deposit1_m.xml
==============================================================================================================

- 백지영 노래모음 30곡 연속듣기(댄스, 발라드), 보고듣는 소울뮤직TV
https://www.youtube.com/watch?v=fhvcXvtDSfk
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.20(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 개발팀 회의(09:20, TASK 구성 및 작성, 전문 표준 개발 고민[이경일 부장])

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- jWEB 소스 분석
1. 예금 TASK 프로세스 생성
==============================================================================================================
 
- 크롬에서 웹 테스트 화면
1. Responsive, 400*850, 100%
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.21(금) 작업 ■■■■■■■■■■■■■■■■■■ 
--> 07:30 ~ 18:00 ==> 

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
-. j간편 통장 TASK 작성
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.22(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==>  

- 주말[★]
07:20 =
08:00 조식
08:30 실내 자전거 타기
09:30 종료
10:00 인터넷 서핑   
12:00 중식
12:30 실내 자전거 타기
13:30 종료 
13:50 루옌(수종) 놀러감(자고 옴) 
13:40 인터넷 서핑
18:10 석식  
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
22:00 샤워 ==> 체중: 75.7kg
23:01 인슐린 약 교체(281U, 28U 남음)
22:20 취침
=================================================================================================================
 
- 5초만에 음악 무료로 다운받기 - 4shared 음악다운받는법 
https://www.youtube.com/watch?v=KZlSqcMSi1g
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.23(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★]
07:30 기상
08:00 조식
08:30 실내 자전거 타기
09:30 종료
10:00 인터넷 서핑
12:10 중식
12:30 실내 자전거 타기
13:30 종료
15:40 인터넷 서핑
16:20 루옌(수종) 귀가 
17:50 귀가 
18:10 석식
18:30 실내 자전거 타기
19:30 종료 
19:40 인터넷 서핑
23:00 취침
==============================================================================================================

- 문영 아파트 주인한테 전화 옴(16:20)
1. 주인이 아파트에 입주해서 산다고 집 비워 달라고 함(2021년 1월 30일 전세 계약 만료)
==============================================================================================================

- 루옌과 이혼 문제 논의(23시) [2020.08.23(일)]
1. 집주인이 아파트에 비워 달라고 해서 내년 1월에 이사 가야 된다고 이야기함
2. 자기는 나와 더 이상 살고 싶지 않다고 함
 1) 나는 이혼은 절대 못 해준다고 함: 수종이 20살까지 같이 살아야 된다고 이야기 함
 2) 이혼 해주면 수종이 20살까지 나와 같이 살겠다고 함 
==============================================================================================================
 
- 스마트폰 사진 동영상 PC로 옮기는 방법...USB 케이블 연결
https://www.youtube.com/watch?v=MSKw991kNhk&t=107s
=============================================================================================================

- 스마트폰과 컴퓨터 연결이 안될때...개발자옵션 활성화하는 방법 (USB 디버깅)
https://www.youtube.com/watch?v=XZWcIIaz8rU 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.24(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 공통 TASK 추출관련 회의(09:50, 회의실, 개발팀), 관리자 화면 개발자(이경민 차장) 투입
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행_TASK_PROCES_정의서 작성
1.  제주은행_TASK_PROCES_정의__수신.xlsx
2.  제주은행_TASK_PROCES_정의_회원 가입.xlsx
==============================================================================================================

- 루옌 생활비 자동이체 취소 완료 
1. 이체금액: 1, 065,000원 자동이체 취소 ==> 월말에 50만원만 직접 송금할 것[국민은행:  037401-04-130647, 예금주: 강아현]  
==============================================================================================================
 
-  큰누나에게 전화하여 루옌과 이혼 문제 논의(22시) [2020.08.24(월)]
1. 루옌과 이혼 문제 엄마한테 이야기 했다고 함
 1) 큰 누나는 수종이 못 키워 준다고 함(나중에 문제 생기면 형제간에 원수가 될 수 있다고 함)
 2) 루옌 집 나가면 엄마가 아버지 입원 시키고 서울와서 수종이 키워줄 수 있다고 함(엄마 다리 인공 관절 수술 문제도 고려해야 됨)
==============================================================================================================

- 3단으로 접히는 블루투스 키보드?! - 피스넷 폴더 노트 리뷰!
https://www.youtube.com/watch?v=aMqXwYG7NP0 
https://newcakecity.tistory.com/33
1. Fn + Q: 안드로이드 기기 연결, Fn + W: 윈도우기기  연결 ==> F11: 밧데리 잔량 확인(4개의 불: 100%) 

1. 키보드를 펼치면 키보드가 켜진다. 초록 불이 켜져있으면 로딩 중이라는 뜻이다. 
초록불이 꺼지면 사용가능하다.  
2. 자판 A/S/D 을 보면 BT1 / BT2 / BT3 이 써있다.  
FN 키와 함께 이 셋 중 하나를 누른다. 해당 버튼에 기기를 등록시키는 과정이다.   
3. 키보드를 사용하고 싶은 기기의 블루투스를 켜면 PISnet Folder 가 있다. 클릭해서 연결한다.  
4. 기기의 OS를 확인하고 자판 Q/W/E 에 해당하는 Android / Window / IOS 중 하나를 FN키와 함께 눌러준다.
5. 그 후에 바로 사용 가능하다. 
등록 후에는 FN + BT1/BT2/BT3 키만 누르면 된다.
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.25(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 중식(12시, 피자 부페(회식 ?체), 미스터 피자)
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행_TASK_PROCES 분석
==============================================================================================================
 
- 긴급 회의(13:40, 회의실, 개발팀)
1. 수도권 코로나19 심각 단계(3단계 검토 중)로 인해 개발팀 일부를 제주로 파견 보내는 것을 고객이 검토하고 있다고 함
 1) 프로젝트 자체를 1~2주 연기하는 것도 검토하고 잇다고 함 
==============================================================================================================
  
- 긴급 회의(14:50, 회의실, 전체)
1. 수도권 코로나19 심각 단계(3단계 검토 중)로 인해 개발팀을 조별로나누어 격주로 재택 근무 검토중(집에서 VPN 연결해서 업무) 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.26(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  
 
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 제주은행_ 제주은행_TASK_PROCES_정의서 작성(회원 가입)
1. 예적금
2. 입출금 계좌
3. 회원 가입 
==============================================================================================================
 
- 개발 관련 회의(09:50, 회의실, 개발팀)
1. 추천 검색 문제
 1) 2년치 자료 조회 ==> 필터링, 스크롤링 처리
2. 이메일 발송
 1) jBank 관리자 서버 사용 불가: 처리 방법 고민
 2) 암호화 : HTML 문서
3. 메인 프레임 작업(이경일 부장 역할)
 1) 전문 통신 개발 완료 ==> 전문 등록(jBank 관리자 화면 오픈 요청: 불가하다고 통보 받음)
   가. 턱시도 연결 안됨
4. 우편번호 조회 처리
 1) 카카오 우편 번호 서비스 연결(카카오 API 활용[지점 찾기와 유사, 주소 API])
5. 기타
 1) OCR, 전자명합, 스크래핑 ==> 진행 안되고 있음 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.27(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 태풍 '바비' 상륙(새벽에 강한 비, 바람, 오전에 비), 블루투스 키보드(BK-3001) 핸드폰에서 네이버 메모 어플로
								  한/영 전환됨(Shift + Space Bar)

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 입출금 계좌 TASK_PROCESS 생성     
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.28(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
- 입출금 계좌 TASK_PROCESS 생성   ?
1. 07. 신분증 인증 안내_M(TY0031. 01)까지 설정   
==============================================================================================================

- 키보드 보안 설정 및 테스트
1.  http://localhost:9080/nfilter/sample/sampe-encrytion.jsp
==> C:/WS5/workspace/jWeb\WebContent\WEB-INF\nshc_win
==============================================================================================================
 
- 전문 관련 교육(16:00, 회의실, 개발팀, 이경일 부장)
1. 서비스 호출 방식
 1) xTouch
 2) No xTouch ==> 메인, 금융 상품몰 화면
2. 서비스 호출 방법
 1) M/F: 계정계 호출
 2) Tuxedo: 정보계 호출(대출 여신 심사]
  가. 턱시도(Tuxedo)는 Transactions for Unix, Extended for Distributed Operations의 준말로, 분산 컴퓨팅 환경의 분산 트랜잭션 
  처리를 관리하는데 사용되는 미들웨어 플랫폼이다. 1980년대에 AT&T가 개발한 이 소프트웨어는 2008년 오라클의 소프트웨어 제품이 되었다.
 3). WAS 서버 ==> DB: xTouch 관리자 화면
3. 기타
 1) 개인 개발 일정 등록: 다음주 수요일까지
 2) 개발 완료 예정일: 11월 06일(월)  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2020.08.29(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21:00 ==> 오전, 오후 비 옴

- 주말[★]
08:00 기상
08:10 조식
08:30 실내 자전거 타기
09:30 종료
10:00 인터넷 서핑
11:00 루옌 병원 감
12:00 중식
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑 
18:10 석식  
18:40 실내 자전거 타기
19:40 종료
19:40 인터넷 서핑
20:40 루옌 귀가
21:30 루옌(수종) 언니 집에 가서 자고 온다고 함
22:30 샤워 ==> 체중: 74.5kg
23:01 인슐린 약 교체(277U, 20U 남음)  
22:20 취침
=================================================================================================================
 
- 제주은행 전문 서비스 작성 방법 문서 작성
1. 51. 제주은행 전문 서비스 작성 방법.txt
=================================================================================================================

 - 태블릿 사기 전 꼭 보세요! 가격대별 태블릿 추천제품들 (갤럭시탭, 아이패드 등)
 https://www.youtube.com/watch?v=7mD8f2UL5rA
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.30(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★]
07:20 기상
07:40 조식
08:00 실내 자전거 타기
09:00 종료
09:10 인터넷 서핑
10:10 이발(스카이 미용실)
10:50 다이소 방문 ==> 염색약, 치약 5개, 우산
12:10 중식
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
18:10 석식
18:30 실내 자전거 타기
19:30 종료
19:40 인터넷 서핑
20:00 루옌(수종) 귀가
20:20 염색(루옌이 해줌)
23:00 취침
==============================================================================================================

- 강냉이 주문
- [옥션] [B382623483] 대용량 업소용 강냉이 마카로니 5kg 뻥튀기, 3.백옥강냉이5.3kg(+3,600원), 가격: 19,170원
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=B382623483&frm3=V2 
==============================================================================================================

- 루옌과 이혼 문제 논의(23시)
1. 생활비 50만원 송금해줬는데 다시 보내주면서 혼자 가출 하겠다고 함(수종이 할머니가 맡아 키우라고 함)
 1) 다시 100만원 송금해 주겠다고 달랬는데 잘 안됨 ==> 106만 원 다시 송금 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2020.08.31(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 수종 다니는 영웅 태권도 다음주 1주일 휴관, 코노나 19로 심각으로 인해 사회적 거리두기 2.5 시행 
?
- 제주은행 모바일 뱅킹(jWEB) 프로젝트[★]
-  전문 분석
1. 51. jWeb 전문 분석(XTOUCH).txt
2. 52. jWeb 전문 분석(NO-XTOUCH).txt     
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
