

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.07) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.07.01(월) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 중식(쌀국수: 포 베이, 김팀장), SDS 2차 대응조 편성(오늘 시행), 루옌 요가 수업(모태, 19시, 첫 수업) 

- ChatON 운영 Prj
- WAS 메모리 설정 확인(~18시) 
chaton@ec2-54-242-77-56:~$  cd /service/tomcat/bin 
chaton@ec2-54-242-77-56:~/service/tomcat/bin$  vi catalina.sh 
JAVA_OPTS="  -Xms16g -Xmx16g -XX:MaxPermSize=512m -XX:+HeapDumpOnOutOfMemoryError -verbose:gc -XX:+PrintGCDetails 
-XX:+PrintGCTimeStamps -Xloggc:/mnt/log/gc.log -Dorg.apache.cxf.io.CachedOutputStream.Threshold=10485760 
-Dorg.apache.cxf.io.CachedOutputStream.OutputDirectory=/mnt" 
1. "메모리Min (MB)": -Xms16g 
2. "메모리 Max (MB)": -Xmx16g 
3. "gc log 관련 설정": -verbose:gc -XX:+PrintGCDetails -XX:+PrintGCTimeStamps -Xloggc:/mnt/log/gc.log 

chaton@ec2-54-242-77-56:~/service/tomcat/bin$  cd /home/chaton/service/tomcat/conf 
chaton@ec2-54-242-77-56:~/service/tomcat/bin$  vi server.xml 
4. "server.xml 확인 keepAliveTimeout(초)": N/A 
5. "server.xml 확인 maxKeepAliveRequest": N/A 
6. "server.xml 확인 minSpareThreads": N/A 
7. "server.xml 확인 maxThreads": 1024 
 <Connector port="10080" protocol="HTTP/1.1" 
               connectionTimeout="20000" macd xThreads="1024" 
               redirectPort="8443" />  

chaton@ec2-54-242-77-56:~$  cd /home/chaton/service/tomcat/webapps/ROOT/WEB-INF/lib 
8. "application Lib중복여부": N/A 
==============================================================================================================

- 2차대응 수행조 업무 
1. 1주간격 로테이션(월요일 09시 교대) 
2. 위험관리자가 2차대응 담당자에게 전화 
3. SDS 2차 대응자는 야간/주말 1차대응자 서포트 및 장애분석서 작성 
 1) 1차대응자: 장애조치완료보고서 
==============================================================================================================

- 제니퍼 활용방안 회의(15시) 
==============================================================================================================

- OGG 모니터링 교육(16시) 
$ cd /chatonop/oggmon 
==============================================================================================================

- ChatON 운영 Proj 재계약(아엘포유) 
1. 기간: 2013.07.01(월)) ~ 08.31[ChatON 운영 Proj  2달 단위로 연장됨] 
2. 내용: 정규직(1,050,000원), 프리랜서(4,363,000원, 2,181,500원) 2가지 계약 체결,  
4대보험, 퇴직금(1개월 일해도 수급 가능) 
3. 계약 대행: (주)아엘포유 SI 사업부 김성채 팀장(H: 010-2352-0): http://www.il4u.co.kr  
==============================================================================================================

- 이종진 과장 철수 요청 
1. SMS G/W 업무 힘들다고 김성채 팀장에게 철수 요청 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.02(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 장마비, 결혼 기념일(벳남) 

- ChatON 운영 Prj
- ERD review 후 의견, ERD 확인 후 통계항목 List up (~4)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.03(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 주간회의(PM) 

- ChatON 운영 Prj
- ERD review 후 의견, ERD 확인 후 통계항목 List up (~4) 
==============================================================================================================

- Buddy 가입 중복 가입 문제 
1. aa@삼성.com 가입자가 KR 지역에서 같은 시간에 2번 중복 가입 
 1) OSP(guid 발급) --> Buddy Proxy(2번 동시 가입) --> Buddy(uid 2개 발급됨) 
2. bb@삼성.com 가입자가 CN, KR 지역에서 다른 시간(3분) 중복 가입 
 1) Mobile Account에서 회원 가입(CN) --> 웹 o2에서 로그인(CN은 웹챗온 없어서 KR로 이동) --> DB X --> 회원가입 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.04(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> Buddy와 업무 공유 회의, 치과 방문 --> 루옌 요가(모태) 종료 후 만나서 귀가 

- ChatON 운영 Prj
- ERD review 후 의견, ERD 확인 후 통계항목 List up (~4) 
1. ERD review 통계항목 도출 
 1) Profile, Trunk, PostON 
 2) Profile에서 프로파일 이미지를 등록한 사용자 통계 
 2) PostON에 달린 프로파일 이미지 통계 
 2) Trunk에 달린 코멘트 통계 
==============================================================================================================

- Buddy 문서 분석 
1. Buddy와 업무 공유에 따른 사전 문서 분석 작업(2.2. Registration) 
==============================================================================================================

- 치과 방문2 
1. 아랫 니 1개(본뜸), 잇몸 치료2(연세에이플러스 치과): 259,400원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.05(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 집에서 모니터(M2450D-PN) 가지고 옴 

- ChatON 운영 Prj
- Buddy 문서 분석 
1. Buddy와 업무 공유에 따른 사전 문서 분석 작업(2.2. Registration) 
==============================================================================================================

- ChatON PJT 보안교육  
1. 교육 주최자 : 김원기 수석보 
==============================================================================================================

- 사우디아리비아 SMS 전송 안된다는 VOC 
1. 유럽 서버: pew1sm001m, pew1sm004m ===> 사우디아리비아: 966 
chaton@ip-10-49-5-25:~$  cat /home/chaton/sms/conf/countryRule.txt ===> 사우디아리비아 국가 코드 확인 @@@ 
Saudi Arabia    966 
... 
chaton@ip-10-49-5-25:~$  cd /home/chaton/sms/log 
chaton@ip-10-49-5-25:~/sms/log$ grep countryCallingCode:966 chaton_sms. 
chaton@ip-10-49-5-25:~/sms/log$ grep countryCallingCode:966 chaton_sms.20130701.log  grep result:Send -wc  
===> chaton_sms.20130701.log에서 사우디 전송 성공된 횟수 @@@ 
chaton@ip-10-49-5-25:~/sms/log$ grep recv chaton_sms.201307*.log 
===> chaton_sms.20130701.log에서 업체에서 보내주는 값 @@@ 
chaton@ip-10-49-5-25:~/sms/log$ tail -f chaton_sms.  grep countryCallingCode:966  
==============================================================================================================

- 운영 자산 현황 변경(모니터 교체) 
1. PC ==> 모델명: MSI GT638DX-i7, 시리얼번호(Serial Number): GT683DX-685XKRK111000258 
2. LCD 모니터 ==> 모델명: WIDVIEW MT-202MWT, 시리얼번호(Serial Number): PLEC080424D011(이전 꺼) 
2. LCD 모니터 ==> 모델명: M2450D-PN, 시리얼번호(Serial Number): 11KCHE3Q105(오늘 변경) 
- LG전자 M2450D-PN(24In), 267,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A571944839&frm3=V2 
==============================================================================================================

- 강남터미널(어머니, 19시) 
1. 강남역 -> 강남터미널(360번) 
2. 서초10(강남역. 9번출구) --> 반포자이 아파트: 마을버스 750원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.06(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
08:00 기상 
08:30 조식(식빵) 
09:10 집출발 
09:20 장보기(중앙 마트): 소고기, 오리 2마리 
11:00 귀가 
11:30 음식 준비 
14:00 낮잠 
16:30 대규 부부(아들: 수일, 수완) 도착 ==> 유모차, 옷, 이불 등 선물 받음 
17:40 선희 누나(딸: 나연) 도착 ==> 휴지 선물 받음 
18:00 석식 
20:00 종료 
21:30 정리 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.07(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:40 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 승) 
08:30 게임(5:3 패)  
09:50 종료 
10:20 중식(문경세재: 갈비탕): 조기회에서 쏨, 임원회의(간단하게 함) 
12:00 종료 
12:40 귀가 
13:10 낮잠 
16:00 기상 
16:30 롯데백화점 관악점(보라매 공원 근처): 택시비(3,400원) 
16:40 그릇(코렐): 총 70만원 상당(정기세일이라 30% 할인 받음) ==> 1년간 A/S 해줌 
       --> 그릇 세트, 밥공기, 국 그릇 4개씩 추가(12만원), 반찬통(5만원), 냄비 2개(7만 원), 큰 냄비(7만 원) 
17:20 귀가: 택시비(4,300원) 
18:30 석식 
22:00 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.08(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 자리이동(8-D ==> 9-B) 

- ChatON 운영 Prj
- Buddy 문서 분석 
1. Buddy와 업무 공유에 따른 사전 문서 분석 작업(2.3 Multi Device Management) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.09(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> W28 정기 배포(회의 및 사전 준비: 2일 동안 배포하기로 결정) 

- ChatON 운영 Prj
- BigData관련 통계자료_ListUp 
==============================================================================================================

- port Check 모니터링 체크방법  @@@  
(pkr1sv001)chaton@i-3852-28420-VM:~$  cd /home/chaton 
(pkr1sv001)chaton@i-3852-28420-VM:~$  ./pcheck.sh ===> pcheck.sh로 체크  @@@  
Port Check Start... 
Checking Message Server Port... 
Connection to 46.137.179.60 80 port [tcp/www] succeeded! 

Connection to 46.137.179.60 5223 port [tcp/*] succeeded! 

Connection to 46.137.179.60 5228 port [tcp/*] succeeded! 

nc: connect to 46.137.179.60 port 8100 (tcp) timed out: Operation now in progress 

Connection to 46.137.76.24 80 port [tcp/www] succeeded! 

(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$ nc -zv -w 15 46.137.179.60 8100  ===> 수동 체크  @@@ 
Connection to 46.137.179.60 8100 port [tcp/*] succeeded! 
-------------------------------------------------------------------------------------------------------- 

- ./portcheck.sh를 이용한 모니터링 체크방법  @@@ ===> 조대형 과장이 짠 것(채택 안됨) 
(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$  cd /home/chatonop 
(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$  ./portcheck.sh 
(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$  ./portcheck.sh ms 15 ===> portcheck.sh로 체크  @@@ 
Port Check Start... 
Checking Message Server Port... 
Connection to 46.137.179.60 80 port [tcp/www] succeeded! 

Connection to 46.137.179.60 5223 port [tcp/*] succeeded! 

Connection to 46.137.179.60 5228 port [tcp/*] succeeded! 

nc: connect to 46.137.179.60 port 8100 (tcp) timed out: Operation now in progress 

Connection to 46.137.76.24 80 port [tcp/www] succeeded! 

(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$ nc -zv -w 15 46.137.179.60 8100  ===> 수동 체크  @@@ 
Connection to 46.137.179.60 8100 port [tcp/*] succeeded! 
==============================================================================================================

- 제니퍼(Jennifer) sds 계정 
sds / chaton --> cotdhs+dnsdud(챗온+운영) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.10(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> DB보안 감사(전자 감사팀, 진술서 작성) 

- ChatON 운영 Prj
- BigData관련 통계자료_ListUp 
1. 첨부 워드 파일의 Bigdata 로그표준 포맷 참고하시어 
2. 첨부 Excel에 기재된 통계요건에 부합되는지 분석 
  - 통계요건을 표현할 수 있는 내용이 로그표준에 존재하면 '기존정보 매핑' 에 기재 
  - 통계요건을 표현할 수 있는 내용이 로그표준에 존재하지 않으면 '추가필요' 에 기재 
----------------------------------------------------------------------------------------------------------------------------- 

- 2.2.1 Biz Log & QoS Log Format 예시 
006§001§was-eu-1§28/Feb/2013:16:42:40 +0900§send§703dc025eb57c6d861b78de7a9b7aa5d§0006820lna§KOR§UID=Single¶CntsID=1342568¶TxID=343413 
1. profileImage  ==> 2.2.136. UpdateProfileImgRequest  
2. PostOn ==> 2.2.12. BuddiesSayReceive 
3. Trunk ==> 2.2.136. UpdateProfileImgRequest 
==============================================================================================================

- SMS GW VOC 요청 분석 
1. 번호: 64220892234, 2.일시: 07-04 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.11(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> W28 정기 배포: Buddy 서버만 다음날(11일) 3시부터 시작 

- ChatON 운영 Prj
- W28 비정기 배포 관련 점검 및 교육 
1. ChatON Live3.0 모바일웹 배포 교육(인과장 과장) 
2. 7월 12일(금)에 새벽에 Buddy 배포에 같이 모바일웹을 배포할 예정 
==============================================================================================================

- VDI 환경 설정 
1. 모란 사원 VDI에 supper putty 설치(CN 연결) 
==============================================================================================================

- 환전(1달러 =  1,135원) 
1. 2,000달러 = 2,270,000원==> SC은행 우대 적용 
==============================================================================================================

- 노트북 웹캠(ctrl + F6) 
1. MSI A610-i5 FHD Vegas (500GB), 582,000원[구입], http://prod.danawa.com/info/?pcode=1733427&cate1=860&cate2=869
&cate3=12734&cate4=&keyword=MSI#bookmark_product_information 
MSI 고객센터(1644-4038)로 
http://download3.msi.com/files/downloads/frm_exe/1675_018.zip 
==============================================================================================================

- ROOT 권한 얻기 
(pkr1sv001)chaton@i-3852-28420-VM:~$  su ssmadmin ==> ssmadmin을 Root 권한으로 로그인 @@@  
Password: s**2*11 
(pkr1sv001)chaton@i-3852-28420-VM:~$  sudo su 
[sudo] password for ssmadmin: s**2*11 
(pkr1sv001)root@i-3852-28420-VM:/home/chaton#  crontab -l ==> 권한 생성 완료 @@@ 
0 * * * * /usr/sbin/ntpdate ntp.ubuntu.com 

- ROOT 권한 얻기(이전 것 --> ubuntu 패스워드 걸러서 현재 로그인 불가) 
(connect)chatonop@ip-10-132-5-204:~$ ssh -i  /home/chatonop/keys/ucloud.pem -o StrictHostKeyChecking=no -p 10205 ubuntu@14.63.218.169 
==> ubuntu로 로그인 할 것 @@@ 
ubuntu@ec2-54-242-77-56:~$ sudo su 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.12(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> W28 정기 배포(04시 종료: 익일 휴무) 

- ChatON 운영 Prj
- W28 정기 배포  
1. Buddy 서버만 12일(금) 03:30 시작하여 04:20 종료 
2. W28 정기 배포로 인한 휴무 
==============================================================================================================

- 휴대폰 구입[2013.07.12(금)] 
1. KT[번이]베가R3(팬택 IM-A850K), 할부원금: 0만원, 93일 93일 유지,  
 부가서비스: 기본팩(1,200원) + 안심플랜 파손형(2,700원) 익월말 유지, 가입비, 유심비 없음, http://cafe.naver.com/applanet/782380 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.13(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
06:30 기상 
06:40 조식 
06:50 집출발(어머미 모셔다 드림) ==> 비가 많이 와서 큰방, 중간방에 비가 샘(주인(임대일)에게 전화함) 
07:30 강남터미널(포항행: 어머니) 
08:20 귀가 
09:40 집출발 
09:50 잇몸 치료3(연세에이플러스 치과) 
10:20 귀가 
11:50 비새는 방 점검(주인): 큰방, 중간방에 비가 샘 
12:00 중식 
14:00 집출발 
15:30 마이집: 서울대입구역(7-4) ==> 영등포구청역 ==> 송정역(2번 출구) 
       이사전 집(서울시  강서구 방화 1동 179 -19) 근처로 가서 헤멤 ==> 
       이가간 집(서울시  강서구 방화 1동 260-29 302호)으로 다시 찾아감, 허우씨 부부, 마이 부모님께 노트북, 돈(장인, 장모 
       비행기값, 기타 비용) 2천 달러, 사촌 처제 2명, 조카 용돈 총 5만원 전달, 장인 취업 부탁 
18:00 마이집 출발: 신방화역(7-4) ==> 당산역 ==> 서울대입구역 
19:30 귀가 
19:40 석식 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.14(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
10:30 기상( 비와서 축구 안 감)  
11:40 중식(삼계탕) 
12:50 비새는 방 점검 및 응급 조치(주인, 일꾼) 
13:20 집출발 
14:50 안산역 
15:20 응아 부부 만남 
15:30 장보기  
16:00 석식(베트남 고향 식당) 
17:00 종료 
18:30 귀가 
20:40 석식 
22:00 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.15(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 휴대폰 도착 및 개통(베가 R3) 

- ChatON 운영 Prj
- cron 대상 정리 및 계정 생성 
1. cron 대상 정리, cron 생성 방법 숙지 
---------------------------------------------------------------------------------------------------------------------------- 

01. KR(한국): pkr1sv001, pkr1sv002 ===> chaton, nagios, root  @@@ 
02. US(미국): pue1sv001, pue1sv002 ===> chaton, root(2개)  @@@ 
03. EU(유럽): pew1sv001, pew1sv004, pew1sv007 ===> chaton, nagios, root  @@@ 
04. SG(싱가포르): pas1sv003, pas1sv006 ===> chaton, nagios, root  @@@ 
05. CN(중국): pcn1sv001, pcn1sv002 ===> chaton, root  @@@  
==============================================================================================================

- bigdata 로그 크기 조사(취소됨) 
1.  /mnt/ssm/logs/ChatOn.ServiceServer.BIZ.log  
(pue1sv001)root@ec2-50-19-49-170:/mnt/ssm/logs#  ChatOn.ServiceServer.BIZ.log 
(pue1sv001)root@ec2-50-19-49-170:/mnt/ssm/logs#  ll -S *.BIZ.* ==> 내림차순 정렬  @@@  
(pue1sv001)root@ec2-50-19-49-170:/mnt/ssm/logs#  ll -Sr *.BIZ.* ==> 오름차순 정렬  @@@  
==============================================================================================================
  
- KT 휴대폰 신청 및 개통(24개월)(번호이동: U+ --> KT)  
1. 신청일: 2013.07.12(금)]  
2. 택배 도착일: 2013.07.15(월)(자동 개통됨)  
3. 단말기 사양  
 1) 기종: 베가R3(팬택 IM-A850K)  
 2) 조건: 약정기간: 24개월,  할부원금: 0원, 
            부가서비스(93일 유지: 기본팩(1,200원) + 안심플랜 파손형(2,700원) 익월말 유지, 가입비, 유심비 없음 
 3) 요금제: 모두다 올레35(LTE) 요금제(월 38,500원) 
 4) 가입대리점: M&S 솔루션(Tel:02-1899-4293)  
 5) 가입신청서: http://cafe.naver.com/applanet/782380 
 6) PIN: 6969 
- 베가 R3(팬택 IM-A850K) 젤리빈(android 4.1.2) 업그레이드 ==> 설치완료 
http://www.ivega.co.kr/prt/productInfo.do?intprdseq=1350  
---------------------------------------------------------------------------------------------------------------------------- 

- 베가R3(팬택 IM-A850K)휴대폰 사양 
1. CPU: 1.5H 쿼드코어, 
2. RAM: 2GB 
3. OS:  ics 4.0.x ==> 구입 후 젤리빈(android 4.1.2) 업그레이드 
4. 크기: 5.3인치 
5. 무게: 151g 
6. 내장메모리: 16GB 
7. 외장메모리: 최대 32GB 지원 
8. 배터리: 2,600 mAh 
9. 카메라: 1300만(전 200만)  화소 
10. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등 
   ==> 정상 출고가(공장도 가격): 599,500원 
---------------------------------------------------------------------------------------------------------------------------- 

- 베가 R3(팬택 IM-A850K) 단말기 정보 
제조년월: 2013.02.18 
인증번호: KCC-CMM-SKY-IM-A850K 
IMEI: 353852053115603 
S/N: 0290673(7자리) 
==============================================================================================================

- Samsung Account[ChatON] 
tamario@naver.com / s*p**m8**1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.16(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> W29 비정기 배포(21시 재출근, 다음날 3시 40분 퇴근) 

- ChatON 운영 Prj
- 챗온서버의 port 네트워크 모니터링 설정 수정 
1. Script의 timeout value 15초 -> 20초로 수정 완료 
---------------------------------------------------------------------------------------------------------------------------- 

- ./portcheck.sh를 이용한 port 네트워크 모니터링 체크방법  @@@  
(pkr1sv001)chaton@i-3852-28420-VM:~$  cd /home/chaton 
(pkr1sv001)chaton@i-3852-28420-VM:~$  vi pcheck.sh   

(pkr1sv001)chaton@i-3852-28420-VM:~$  ./pcheck.sh ===> pcheck.sh로 체크  @@@  
Port Check Start... 
Checking Message Server Port... 
Connection to 46.137.179.60 80 port [tcp/www] succeeded! 

Connection to 46.137.179.60 5223 port [tcp/*] succeeded! 

Connection to 46.137.179.60 5228 port [tcp/*] succeeded! 

nc: connect to 46.137.179.60 port 8100 (tcp) timed out: Operation now in progress 

Connection to 46.137.76.24 80 port [tcp/www] succeeded! 

(connect)tamario2.jin@ip-10-132-5-204:/home/chatonop$  nc -zv -w 15 46.137.179.60 8100  ===> 수동 체크  @@@ 
Connection to 46.137.179.60 8100 port [tcp/*] succeeded!   
==============================================================================================================

- Logagent 설치 프라퍼티 수정  
1. Logagent 설치 프라퍼티 수정 후 
CN1, UE1, EW1, AS1(SG1), KR1 
"# Enviroment variables can be set here.JAVA_HOME=""/usr/lib/jvm/java-6-sun"" 
---------------------------------------------------------------------------------------------------------------------------- 

1) flume-env.sh 
# service code. this is 3-digits. 
logagent.service =006 

# category code. this is 3-digits. 
logagent.category =004 

2) logagent.properties 
# settings of file1. path and logtype. 
file1.filepath =/mnt/ssm/logs/ChatOn.ServiceServer.BIZ.log 
file1.logtype =BIZ 
==============================================================================================================

- logagent 설치 
1. LogAgent의 설치 
chaton@ec2-54-242-77-56:~$  vi logagent-install-script.py   
chaton@ec2-54-242-77-56:~$  chmod 755 logagent-install-script.py 
msc@hostname:/home/msc/app$  python logagent-install-script.py PRD UE1 
msc@hostname:/home/msc/app$  ls -al ===> logagent 설치 확인(logagent 디렉토리 생성 여부)  @@@ 

2. JAVA_HOME 설정 
2.1. conf/flume-env.sh 파일에서 JAVA_HOME을 설정 
msc@hostname:/home/msc/app$  cd /home/msc/app/logagent/conf 
msc@hostname:/home/msc/app$  vi flume-env.sh 
JAVA_HOME="/usr/lib/jvm/java-6-sun": 

2.2. 서비스, 카테고리, 로그 파일 위치, 타입 설정 
msc@hostname:/home/msc/app$  cd /home/msc/app/logagent/conf 
msc@hostname:/home/msc/app$  vi logagent.properties 
logagent.service =006 
ogagent.category =014 
file1.filepath =/home/chaton/webapi/tomcat/logs/ChatOn.WebAPIServer.QOS.log 
file1.logtype =QOS 

2.3. LogAgent 등록 --> CN을 제외한 KR, EU, SG, US 만 수행 @@@ 
msc@hostname:/home/msc/app$  cd /home/msc/app/logagent/bin 
msc@hostname:/home/msc/app$  bin/logagent register ===> logagent cron 등록 @@@ 
  
2.4. LogAgent 시작/종료  
msc@hostname:/home/msc/app$  bin/logagent start  
msc@hostname:/home/msc/app$  bin/logagent status 
==============================================================================================================

- 지역별 instance 
US East (N. Virginia) <us-east-1> UE1 ===> 01. US(미국): pue1bd001, pue1bd002 
EU (Ireland) <eu-west-1> EW1 ===> 02. EU(유럽): pew1bd001m, pew1bd002m 
Asia Pacific (Singapore) <ap-southeast-1> AS1 ===> 03. SG(싱가포르): pas1bd001m, pas1bd002m 
https://console.aws.amazon.com/ec2/home?region=ap-southeast-1#s=Instances 
==============================================================================================================

- vim 에서 delimiter (§, U+00A7, UTF-8 로 C2 A7) 를 입력하는 방법 
1. 입력할 위치에 i 를 눌러서 입력모드로 전환하고, 
2. CTRL+v 를 누르고, 
3. 숫자 167 을 누르면, 커서 위치에 § 글자가 생김 
4. 이후에, et fileencoding=utf-8을 해서 파일을 utf-8 로 저장 
---------------------------------------------------------------------------------------------------------------------------- 

/u00A7 문제는 해결되었고 hostname이 나오지 않는 이슈는 hostname을 hardcording 하는 방향으로 진행할 예정입니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.17(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 13:30 ~ 18:00 

- ChatON 운영 Prj
- APP Log 백업관련 점검 
1. 30일 이전 로그 모두 삭제하는 명령어  
$  find /mnt/log/web.* -mtime +30 -exec rm -rf {} \; 
===>  /mnt/log/ 폴더의 web.* 파일에 대해서 30일 이전 파일을 삭제 @@@ 
==============================================================================================================

- 방화벽 테스트 
(pcn1sv001)chaton@cnsy1:~$  telnet s3.amazonaws.com 443 
Trying 72.21.203.148... 
1. 방화벽: 가이드 보시면, 6545, 4181, 443 outbound 다 열어야 합니다. 
 1) 관련 이민규 책임님께서 요청드린것으로 알고 있습니다.(이기원 선임 말) 
2. CN지역 Service 서버 방화벽 요청(내 업무 아님) 
 1) Service 서버 2차 담당자: 최상락 책임, 김영국 선임 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.18(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- ChatON 운영 Prj
- APP Log 백업관련 점검 
1. Service 서버 pre production APP Log 백업 테스트(확인 완료) 
==============================================================================================================

- CRON 정리 작업 
1. 현재 CRON 내역 cronadmin으로 변경 후 영향도 조사 
==============================================================================================================

- Buddy 중복 가입자 확인 
1. eu, us 지역 중복 가입자 확인(작업 후 작업내역 조대형 과장에게 전달) 
==============================================================================================================

- KT 와이파이(WiFi) 설정 
1. 휴대폰 개통하면 자동으로 와이파이 사용 가능할 것으로 추정 
---------------------------------------------------------------------------------------- 
- 개인 와이파이(WiFi) 설정 
1. 강동현 과장: ollehWiFi_R149 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.19(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 남권형 형수에게 전화해서 이자 달라고 함(다음달에 준다고 함) 

- ChatON 운영 Prj
- CRON 정리 작업 
1. W29 비정기 배포시 chaton 권한으로 as1, ew1, ue1, kr1 지역(cn1 제외)에 log agent 관련 cron 생성된 것 확인 
2. 추가된 cron ==> 0,10,20,30,40,50 * * * * /home/chaton/logagent/bin/logagent check 
==============================================================================================================

- SMS G/W VOC 
1. +64220892267 번호로 SMS 발송 여부 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.20(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
08:00 기상 
08:10 조식 
09:00 집출발 
09:20 모태산부인과(정밀 초음파 검사: 컬러), 빈혈 주사(7만원) ==> 120,800원 사용[283,200원 남음]   
배 크림(닥터포스킨 스트레치 라인 크림: 3만원) 
11:00 잇몸 치료6(연세에이플러스 치과, 완료) 
12:00 귀가 
13:00 중식(주먹밥(2개), 김밥)  
17:00 집출발 
18:10 시청역 
18:30 [국결행사]정모(종로, 18:30) : 병천유황오리 
21:00 신부 입국 축하 행사(응아 부부, 헤즈안산 부부: 총 3쌍) 
22:00 종료 
23:30 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.21(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:40 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 승) 
08:30 게임(8:3 승)  
10:30 종료 
10:20 중식(문경세재: 갈비탕): 회비 만원 
12:00 종료 
12:40 귀가 
13:10 낮잠 
16:00 기상  
16:50 프엉씨집: 서울시 관악구 봉천동 661-34 101호(봉천로21 라길 26) ==> 아들(4살), 신랑 IT 
17:20 란씨집: 서울 관악구 봉천동 713-1(당곡6 나길 31) ==> 딸(3살), 신랑(야간 일): 닭 날개 얻어 먹음 
19:30 종료 
20:00 석식(포마토 식당: 부대찌게, 갈비탕) 
21:40 귀가 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.22(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- CRON 정리 작업 
1. pre-prd 서버에 cron 등록 및 검증 
==============================================================================================================
  
- 리눅스 python 버전 확인(리눅스 서버에서) 
$ python -V 
Python 2.7.1+ 
--------------------------------------------------------------------------------------------------------------------------- 

- 리눅스 perl 버전(리눅스 서버에서) 
$ perl -v 
This is perl, v5.10.1 (*) built for x86_64-linux-gnu-thread-multi 
(with 53 registered patches, see perl -V for more detail)  
==============================================================================================================
   
- 날짜 정보(리눅스 서버에서) 
(pcn1sv001)chaton@cnsy1:~$  date +"%G.%m.%e %H:%M:%S" 
2013.07.22 06:03:24 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.23(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 또 중간방에 비가 새서 부동산(윤실장)에 전화함(2번째) 

- ChatON 운영 Prj
- CRON 정리 작업 
1. pre-prd 서버에 cron 등록(cronadm 권한으로 crontab 설정) 및 기존 cron 삭제(chaton 권한으로 설정된 cron 삭제)  
==============================================================================================================

- 리눅스 파일 폴더 용량 확인[du(Disk Usage)의 약자] 
1. 옵션 
 -a : "폴더"의 사용량이랑 총 사용량만 표시되기 때문에, 폴더 내의 파일의 용량을 확인하려면 이 옵션을 넣어야 한다. 
 -h : human readable, 크기 적절하게 알아서 단위를 설정한다. (kb, mb, gb) 
--------------------------------------------------------------------------------------------------------------------------- 

chaton@ec2-54-242-77-56:/mnt/log$  du -ah  
128K    ./web.log ---> 120 Kb로 표기됨(모든 파일과 디렉토리의 용량을 사람이 읽기 좋게 표시한다.) @@@ 
390M     . 

chaton@ec2-54-242-77-56:/mnt/log$  du -h 
390M    .  --> 사람이 읽기 좋게 용량을 표시한다 @@@ 

chaton@ec2-54-242-77-56:/mnt/log$  ll  
-rw-r--r-- 1 chaton chaton    117361 2013-07-23 05:05 web.log   ---> 117361 byte로 표기됨 @@@ 

chaton@ec2-54-242-77-56:/mnt/log$  ls -s 
-rw-r--r-- 1 chaton chaton    117361 2013-07-23 05:05 web.log   ---> 120 Kb로 표기됨( -s : 파일 크기를 1Kb 단위로 나타낸다.)  @@@ 
120 web.log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.24(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- ChatON 운영 Prj
- CRON 정리 작업 
1. pre-prd 서버에서 cron 등록 결과 확인(cronadm 권한으로 설정되어 해당 cron이 실행 안되는 것으로 추정됨) 
==============================================================================================================

- Load Balancer 확인 
(pue1sv001)chaton@ec2-50-19-49-170:~$ wget http://localhost:10080/dummy1 ==> 바로 특정 웹 싸이트내용을  
모두 파일로 받아주는 유용한 유틸리티 @@@ 

--2013-07-24 02:06:36--  http://localhost:10080/dummy1 
Resolving localhost... 127.0.0.1 
Connecting to localhost127.0.0.1:10080... connected. 
HTTP request sent, awaiting response... 200 OK 
Length: 26 
Saving to: `dummy1' 

100%[=====================================================================>] 26          --.-K/s   in 0s 

2013-07-24 02:06:36 (3.14 MB/s) - `dummy1' saved [26/26] 

(pue1sv001)chaton@ec2-50-19-49-170:~/$  cd /service/tomcat/logs 
(pue1sv001)chaton@ec2-50-19-49-170:~/service/tomcat/logs$  tail -f localhost_access_log.2013-07-24.txt 

1. lb 확인(https://console.aws.amazon.com/ec2/home?region=ap-southeast-1#s=LoadBalancers > EC2 >  
NETWORK & SECURITY > Load Balancers에서 
Health Check 간격 조절: Interval: 30초, Healthy Threshold: 2에서 Interval: 30초, Healthy Threshold: 10로 변경 
==============================================================================================================

- 렌터카 대여(장인, 장모님 인천공항 픽업) 
1. 금호 렌터카(https://www.ktkumhorent.com/kor/my/myRentList.do) ==> 예약함 
 1) 예약번호: TL7634, 차종: 아반떼 MD LPG, 대여지점: 관악, 반납지점: 관악, 대여기간: 2013.07.27 16:00 ~ 2013.07.28 16:00 
   할인율: 35%, 내비게이션 요금: 0원, 차량손해면책요금: 8,000원, 총 대여요금: 86,000원(카드 선결제: 81,000원) 
  2) 콜센터:(☎1588-1230, 08:30 ~ 20:00), 관악점:(☎875-8200, 08:30 ~ 22:00) 
2. AJ 렌터카(http://www.ajrentacar.co.kr) ==> 예약 최소함 
 1) 예약번호: L13072261520, 차종: 아반떼 MD LPG, 대여지점: 관악, 반납지점: 영등포, 대여기간: 2013.07.28 00:00  ~ 2013.07.28 23:50 
   할인율: 35%, 내비게이션 요금: 0원, 보험:자차2, 총 대여요금: 80,350원 
==============================================================================================================

- 쇼핑 
01. 휴대폰 충전기 케이블: XGC603 1m ==> R3(듀얼: 1, 충1(듀얼): 2, 충2(듀얼): 1 --> [총 5개, 17,000원]  ==> 구입 완료 
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=212144618 
02. (아로마타임) 네빌 샤기 발매트(40x60), 31,590원  ==> 구입 완료 
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=201322942&GoodsSale=Y&jaehuid=200002657&service_id=estimatedn 
03. 각시상 900중 교자상[노송가구], 46,010원 ==> 구입 완료 
http://www.hyundaihmall.com/front/mpOrderL.do?menu_gb=od&sessionid=1374671543922&EtcGroup=Trans_gnb#mpMain 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.25(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 책상 서랍 열쇠 조대형 과장에게 맡김 

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.26(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

- SMS GW VOC 확인 
1. P130726-0442 분석 
==============================================================================================================

- ChatON 모의 장애훈련(1차 대응 당직으로 참여) 
주제 : ChatON SG지역 가입불가 (5/21일 장애건) 
원인 : SG지역 지연 쿼리 발생으로 부하 집중 
조치 : SMS G/W 발생한 Slow query에 대한 Index 생성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.27(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
07:30 기상 
08:00 조식(식빵) 
08:30 집출발(자전거) 
08:45 관악구 보건소 방문(헤모큐 플러스 3개월치 받음: 3통) ==> 2층 영유아실, 모성실 
09:20 귀가 
09:50 집출발 
10:00 버스(416번) 
10:50 여의도 순복음교회 
11:10 국회 운동장 ==> 국회의원배 시합(공은 못차고 구경만 하다가 옴) 
12:00 시합(신사 3: 1 에이스 --> 승) 
15:00 시합(신사 1: 1 일원 --> 승부차기 패(13명이 킥)): 결승 진출 실패 
16:00 종료 
16:30 버스(416번) 
17:30 KT 금호렌터카 관악점 도착 
17:40 지하 3층 주차장 ==> 아반떼 MD LPG 대여(총: 82,600원) 
18:00 귀가  
18:30 처가집 화상통화(처가집은 장인, 장모 입국 준비로 바쁨 ==> 친인척 많이옴 
19:10 차량 점검 --> 내비 목적지 찍기, 시동 안 걸림(LPG버튼 누르기), 와이퍼 
19:30 마트 장보기 
19:40 석식 
22:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.28(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 비도 오고 장인, 장모님 픽업으로 축구 못 함 

- 장인, 장모님 인천공항 픽업  
04:00 기상 
04:20 집출발(새문빌라 --> 강변북로[한강대교에서 U턴 못해 올림픽대로 못 탐] --> 공항 고속도로[통행료: 7,600원]  
--> 인천공항 단기 주차장) 
05:20 인천공항 단기 주차장 도착(주차장 지하 2층[신호등 건너야 함: 불편] ==> 지하 1층으로 갈 것) 
05:30 입국장(1층 C) 도착 
06:00 베트남 항공 VN416 도착 
07:20 장인, 장모님 입국장으로 나옴(기념 촬영) ==> 짐 80kg(200달러 더 냈다고 함) 
07:30 공항 출발(공항 고속도로 -->이수IC로 나옴[네비 안내 무시] --> 새문빌라): 비 많이 옴  
08:30 귀가, 짐 정리 
10:00 조식 
11:30 집출발 
11:40 주유(SK LPG 충전소 명화 가스 직영[서울 관악구 봉천7동 1594-8(관악로 96)]): 16,096원 나옴 
11:50 KT 금호렌터카 관악점(지하 3층 주차장)에서 차량 반납 ==> 무사고로 50% 쿠폰 받음(PPR130700088027) 
12:30 귀가 
12:35 낮잠 
14:30 기상 
14:50 응아 부부(삼겹살), 프엉 부부, 허우 부부(수박) 도착 
15:20 맥주 파티 
15:20 종료(베트남 부모 선물 주기) 
20:00 석식(삼겹살) 
22:00 TV 시청(개그콘서트) 
23:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.29(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 타오, 토와집에 택배 보냄(우체국 택배), 워킹맘 요가 재등록(8월, 2만원), W31 ChatON 비정기 배포 

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

- 구곡폭포 
01. 강촌 구곡폭포(강원 춘천시 남산면 강촌리 138): http://yjoshjh.blog.me/110169540785 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.30(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- ChatON 운영 Prj
- CRON 정리 작업 
1. cron 등록 및 검증(pre production)  
==============================================================================================================

- s3 업로드된 파일 확인 @@@ 
(pcn1sv001)chaton@cnsy1:~$  cd /home/chaton/s3cmd-1.1.0-beta3 
(pcn1sv001)chaton@cnsy1:~/s3cmd-1.1.0-beta3$  ./s3cmd -r ls s3://chaton-cn1-logs/ 
--config=/home/chaton/bklog/.rlog.s3cfg/rlog.cn1.s3cfg  ==> 업로드된 파일 확인 @@@ 
2013-07-28 17:00    212594   s3://chaton-cn1-logs/prd/wb/pcn1wb002/catalina.out-20130726.gz --> file이 upload 되어 있는지 확인 @@@ 
-------------------------------------------------------------------------------------------------------- 

- pcn1sv002 서버 에러 
1. 현상 
(pcn1sv002)chaton@cnsy3:~/s3cmd-1.1.0-beta3$  ./s3cmd -r ls s3://chaton-cn1-logs/ --config=/home/chaton/bklog/.rlog.s3cfg/rlog.cn1.s3cfg 
WARNING: Retrying failed request: / ([Errno -2] Name or service not known) 
WARNING: Waiting 3 sec... 
2. 조치 
(pcn1sv001)root@cnsy1:/home/chaton/s3cmd-1.1.0-beta3# vi /etc/hosts ==> hosts 파일 수정 @@@ 
“172.16.0.5 chaton-cn1-logs.bj.s3.woscloud.samsung.com.cn”을 추가한 후 저장 
3. 결과 
(pcn1sv002)chaton@cnsy3:~/s3cmd-1.1.0-beta3$  ./s3cmd -r ls s3://chaton-cn1-logs/ 
--config=/home/chaton/bklog/.rlog.s3cfg/rlog.cn1.s3cfg  ==> 업로드된 파일 확인 @@@  
2013-07-28 17:00    212594   s3://chaton-cn1-logs/prd/wb/pcn1wb002/catalina.out-20130726.gz --> file이 upload 되어 있는지 확인 @@@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.07.31(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 -->  

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

- SBC 신청(http://www.samsung.net/portalWeb/ptmanager/ep/desktop) 
tamario2.jin@partner.samsung.com / s*p**m***1 
SBC 사용을 통한 고객 개인정보 취급 전용 업무환경 구축을 위하여 신청 드립니다.(ChatON 서비스 운영) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■