

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.02) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.02.01(금) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:20  --> 823빌딩 7층으로 이사(이삿짐 싸고 퇴근), 김양호 과장(*), 최인택 책임 투입 

- ChatON 운영 Prj
-  ChatON 1차 대응 관련 교육 자료 작성 
1. 참조할 것 
==============================================================================================================

- 검증 서버(SPCS) 확인 
> java -jar SSMEV2.jar 
==============================================================================================================

- alias명 확인 
1. db, fi, gl  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구
06:00 기상 
06:30 신봉천 주유소(태훈이형 차) 
07:00 신구초등학교  
07:10 숏게임(2:3 패) 
08:10 종료 
09:00 귀가 
11:00 용산전자상가(아이패트 로지텍 키보드 AS 센터 방문: 문닫음) 
13:00 아이파크 백화점(용산점): 가구, 침대, 김치냉장고 구경 
14:00 이마트(용산점): 침대, 가구 구경 
15:00 종료 
15:30 새문빌라 301호(방, 창문 치수 재기) 
16:00 귀가 
16:30 중식(라면) 
16:50 낮잠 
21:10 루옌(부인)과 화상통화 
22:20 종료 
23:40 취침 
==============================================================================================================
  
- LG U+ 가입 신청서 작성  
1. 용산 이마트 행사(LG U+ 가입 신청서 작성)  
2. 가입 조건 
 1) 인터넷 + 전화 + TV(tv G): 30,700원(제휴가드 결제시: 21,700원) 
 2) 지원금(12만원 또는 47인치 3D TV) 
 3) 070 Player 2(3년 약정) 총 월: 13,200원 ==> CCTV 보안(월: 3천원)  
 4) LG U+휴대폰 고객 월 5,500원 추가할인 
 5) 황실장: *, 070-4306-4999 ==> 2월 5일(화)에 전화 주기로 함(취소 함) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.03(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 

▦조기축구
07:00 기상 
07:30 신봉천 주유소(태훈이형 차) 
07:50 신구초등학교  
08:50 게임(1:1 무): 논현팀 초청경기 
10:00 게임(3:0 승) 
11:00 게임(4:0 승) 
12:00 종료 
12:50 중식(뚝심한우: 설렁탕 ==> 조기회에서 쏨)  
13:30 종료 
14:00 귀가 
15:00 이발(봉천동: 빅맨) 
19:00 낮잠 
20:00 석식 
21:10 루옌(부인)과 화상통화 
21:20 종료 
21:30 TV 시청(개그콘서트) 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:15 ~ 18:20 --> 823빌딩 7층으로 이사짐 정리 

- ChatON 운영 Prj
- 1차 대응 매뉴얼_ECA 작성 
1. 김태호 사원에게 메일 보낼 것 
==============================================================================================================

- IP 주소(ChatON 운영 Proj) 
1. 제어판\모든 제어판 항목\네트워크 및 공유 센터\네트워크 연결 ==> 로컬영역 연결: 속성 > TCP/IPv4 
1) IP주소: 70.4.78.**, GW: 70.4.**.* 
2) SM: 255.255.255.0, DNS:  
3) 임시 DNS:  
4) 823빌딩 주소: 서울 강남구 역삼1동 823-16 역삼 823빌딩 7층 ChatON 운영팀, ☎070 
----------------------------------------------------------------------------------------------------------------------------

- 프린터 서버(823 빌딩) 
01. Samsung SCX-7635 복합기(7층) --> IP 주소: 70.4.78.163 
http://www.samsung.com/sec/support/model/SCX-7635G-downloads?isManualDownload=true 드라이버 83.46 MB 
02. 교세라 FS-6975DN ECOSYS 프린터(7층) --> IP 주소: 70.4.78.164 
http://www.kyoceradocumentsolutions.co.kr/Customer/Down.asp?srchTxt=FS-6975DN 
==============================================================================================================

- 출입지문등록 
1. 7층, 8층, 14층 출입 가능 
==============================================================================================================

- 용산 방문 
08:15 출근 
08:20 짐정리 
09:30 MSI 노트북 아답타 고장 인지(용산가서 A/S 받기로 결론 냄) 
11:30 회사 출발 
12:00  
12:10 중식(라면 2개) 
12:30 집 출발 
13:30 MSI A/S 센터(나진상가 15동 203호: http://kr-demo.msi.com/service/asrule) 
       - 원인: 모니터 아답타랑 잘못 꽃았다고 함(망신) 
14:10 터미널상가 531호(TGS 용산지점 INFRA운영팀: 1588-3582): 로지텍 A/S 같이 취급 
- 아이패드 키보드 커버 AS(충전안됨 ==> 맡기로 옴: 2월말까지 수리해서 택배로 보내준다고 함) 
: 접수번호: 15711460, 접수자: 이예리, 고객번호:  86742246, 모델명: 820004665(Ultrahtin Keyboard Cover) 
14:30 나이스 스마트케이스(뉴아이패드용: 2만 5천원) 
15:30 귀사 
----------------------------------------------------------------------------------------------------------------------------

- MSI 노트북 아답타 
1. DELTA ELECTRONICS, INC.(OUTPUT:19V, 9.5A): 엄청 큰 직사각형 아답타 
- WIDVIEW MT-202MWT(20.1In) 모니터 아답타 
1. 아남전자(OUTPUT:12V, 4.5A) 
==============================================================================================================
  
- SVN 서버 IP가 변경   
3. 2.5  SVN Repositories ==> 현재 사용 
SVN Repositories = > 오른쪽 클릭 > New > New Repository Location 
URL : svn://70.4.102./CHATON ==> tamario2.jin/sds2012 
URL : svn://70.4.102./SSM_EV ==> tamario2.jin/sds2012  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:20 --> 조대형 과장 반차(전세 계약) 

- ChatON 운영 Prj
- alias명 확인 
1. db, fi, gl 
==============================================================================================================

- 1차 대응 매뉴얼_ECA 작성(Service 파트) 
1. 김태호 사원에게 메일 보낼 것 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:25 ~ 18:20 

- ChatON 운영 Prj
- ChatON 1차 대응 관련 교육 자료 작성 
==============================================================================================================

- 검증 서버(SPCS) 확인 
> java -jar SSMEV.jar ==> 표준 
==============================================================================================================

- Service서버 관련 idle 0.00% 에러 발생 조치 
1. nagios 체크(All Service Problems > Service Status) 
CHATON-pew1sv004 ===> CPU CRITICAL : idle 0.00% 
2. 서버 체크 
> alias  grep sv 
> pew1sv004 
> top ==> CPU 체크 
  PID USER      PR  NI  VIRT  RES  SHR S %CPU %MEM TIME+ COMMAND 
2046 chaton    20   0 17.1g 5.8g 9792 S 397 17.3 3678:56 java ====> %CPU: 397으로 체크됨 
24731 chaton    20   0  197m  85m 4224 S 3 0.3 2217:00 splunkd 
3631 nagios    20   0  643m 211m 9704 S 0 0.6 211:38.08 java 
1 root      20   0 24012 2100 1284 S 0 0.0 0:12.26 init  
3. 로그 확인 
[INFO]  2013-02-06 02:01:56,925  http-bio-10080-exec-15  SecureURIFilter.java:55       - IS-Secure:[false] 
[INFO]  2013-02-06 02:01:56,926  http-bio-10080-exec-15  RequestReceiveInterceptor.java:87       - request:[GET /buddyrecommendee/list] 
[INFO]  2013-02-06 02:01:56,926  http-bio-10080-exec-15  RequestReceiveInterceptor.java:308       - remoteIP:[151.62.89.177] 
[INFO]  2013-02-06 02:01:56,927  http-bio-10080-exec-15  RequestReceiveInterceptor.java:217       - param uid=eff3649d-05b4-4766-ae05-17d327c2e47d 
[INFO]  2013-02-06 02:01:56,927  http-bio-10080-exec-15  RequestReceiveInterceptor.java:232       - param r=-539647440 
[INFO]  2013-02-06 02:01:56,927  http-bio-10080-exec-15  RequestReceiveInterceptor.java:100       
- content-Type:[text/xml;charset=utf-8] Accept-Encoding:[gzip] X-ChatON-Request-Encoding:[null] Content-Encoding:[null] 
[INFO]  2013-02-06 02:01:56,933  http-bio-10080-exec-15  FaultInterceptor.java:86       - Response-Code: 204 
Payload: 
[WARN]  2013-02-06 02:01:56,934  http-bio-10080-exec-15  FaultInterceptor.java:59       - Fault - null 
[WARN]  2013-02-06 02:01:56,934  http-bio-10080-exec-15  FaultInterceptor.java:60       
- Caused by: com.samsungchaton.api.recommendation.buddy.service.BuddyRecommendationServiceImpl.getList(BuddyRecommendationServiceImpl.java:93) 

4. 조치: 상황실에 연락해서 tomcat 서버 재시작 권고(2차 대응이 해야 할 역할) 
==============================================================================================================

- 우체국 EMS 발송 안됨(수취인 부재) 
1. 씨티카드(0509) 하이퐁 루옌집에 보냄 ==> 참똑똑한 A+통장(제축예금) 
2. 3~4일만에 도착(도착 후 알림 메세지 발송) ==> 비용: 13,200원 
3. 찾을 때 금액에 상관없이 무조건 1달러 수수료  
4. 등기번호(EMS번호): EE-277725-338-KR(EE277725338KR) 
5. 진행 절차 
 1) 01.29(화): 보냄 
 2) 02.02(화): 반송(수취인 부재) 
 3) 01.29(화): 상담 메일 발송 
 4) 02.06(수): 역삼1 우체국 항의 방문 
 5) 02.06(수): 베트남 루옌 받음 
6. 기타: http://hotjungboworld.net/245 ==> T)1588-1300 
7) 베트남 콜센터: T) 4 3757 5577 
8) 베트남 우체국 T): 0313-747789 
==============================================================================================================

- ChatON_1차 대응 매뉴얼_v0.1 작성 
1.1 Nagios 모니터링중 CPU idle 0%이 지속적으로 발생 ==> ChatON_운영일지_ODR_CO_021_20130206.docx 파일에서 @@@ 
1.2 db 접속 불가 ==> ChatON_운영일지_ODR_CO_005_20130121.docx  파일에서 @@@ 
1.3 Service, Msgctx 서버의 Cassandra Manager에서 Time Out 발생 ==> ChatON_운영일지_ODR_CO_005_20130121.docx  파일에서  
==============================================================================================================
  
- CASSANDRA DB 교육 
1. 임광기 과장 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:20 

- ChatON 운영 Prj
- ChatON 1차 대응 관련 교육 자료 작성(완료) 
==============================================================================================================

- [ChatON 장애중간보고] 
1. 발생일시 : 2013.02.07 11:44(KST) 
2. 발생위치 : KR 지역 
3. 장애현상 : KR지역 장애당시 서비스 사용자만 이용 불가 
4. 장애원인 : KR DB1 서버 장애(전자 DBA가 buddy, device TB 삭제함) ==> 7개 TB 수정 처리함 
5. 조치내역 : KR DB2로 KR DB1 복구 22시 시작 
       예상소요시간 : 12시간(dump -> 압축 -> 파일 전송 -> 압축 해제 -> 복구 -> ogg동기화) 
6. 발송자: 통합상황실(ChatON)  
==============================================================================================================

- 검증 서버(SPCS) 확인 
> java -jar SSMEV.jar ==> 표준 
==============================================================================================================
  
- 서울용달(*, *: 20시 이후) 
http://cafe.naver.com/2424yd 
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2013.02.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 --> 대체휴무일(11일 설 연휴 근무 대체) 

- 대체휴무일 
06:00 기상 
06:10 조식 
06:30 집출발(5413번 버스) 
07:00 강남터미널 
07:30 서울 출발 
12:00 포항터미널 도착(4시간 반 걸림) 
12:50 LG best shop, 전자랜드 방문 
14:00 포항 공원 산책(옛날집, 과수원) 
15:30 집도착: 용돈(부모님 설) 20만원 드림 
18:00 석식 
23:40 취침 
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2013.02.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 --> 설 연휴 

- 설 연휴 
08:00 기상 
09:00 목욕(포항 창포하와이 사우나): 5천원 
10:30 중식 
17:00 집출발 
18:00 포항계 모임: 장성동 두산위브 102동 옆 맨쿡(진호형 아는 형 가게) 
       - 참석: 주남이형, 동형형, 진호형, 태정, 정철, 진철, 상하 ==> 모임비 2만원 
20:30 종료 
20:50 귀가(진철이 차로 집에 옴)  
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 --> 설날 

- 설날 
07:30 기상  
08:10 작은 아버지, 대규 
08:20 차례(수일 용돈: 만원) 
09:00 작은 아버지집 차례(포항시 북구 풍림 아이원 102동 706호)(수완 용돈: 만원) 
09:20 차례 
13:00 종료 
13:30 이모집(대구 차)  
15:30 성희, 성희 신랑 방문(부산, 아버지 사업체) 
16:30 떡국 
19:00 외가집 출발  
19:40 외가집(42인치 TV, 둘째 이모(은정, 규호: 서울 예전 다님) 
21:00 종료 
21:50 포항집(경태차: 문충까지 신 도로 타고 옴) 
22:00 큰누나 부부(령경에세 용돈 만원 줌) 
23:40 집출발 
24:00 포항 터미널(큰누나가 차로 터미널까지 태워줌) ==> 2013.02.11(월)  
01:00 포항 출발 
04:40 강남터미널(3시간 40분 걸림) 
05:40 출근(걸어서 옴) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 05:40 ~ 21:00 --> 설 연휴 당직 근무(09 ~ 21시) 

- ChatON 운영 Prj
1. message 서버에서 UTC 06:37:37(KST: 3시37분) 경 부터 [ERROR] [CONNECTIONMANAGER_WORKER] Thread-185   
com.sec.ssm.protocol.messaging.AllowChatRequestProtocol   - Uncaught exception! Fix me later! 
==> Uncaught exception. Fix me later! 건은 유저 A가 삼성어카운트 매핑 & sms스킵으로 재가입시 버디서버에서 msisdn을 null로 
세팅하는데, 이후 챗룸 머지 로직에서 해당 msisdn값을 읽어서 매핑 교정정보의 old userId 값으로 내려주기 때문에 발생하는 
에러입니다.  저희 db장애난 날 문의주신 미전실 비서가 old채팅방에서 채팅 안된다는 문제에 해당하는 문제입니다.  
버디, ctx, 메시징쪽 담당이 명절전에 분석 및 재현경로까지 확인한 known 이슈로서 ctx챗룸머지 로직 패치가 prod에 반영되어야 
해결되는 문제입니다.  
문제의 유저A가 매핑되기 전에만에 유효했던 sessionid로 채팅 및 allow요청시 문제가 됩니다. 

2. message 서버에서 UTC 06:37:40(KST: 3시37분) 경 부터 [ERROR] [CONNECTIONMANAGER_WORKER] Thread-204   
com.sec.ssm.common.MessageType   - No Matching Push Service Found: cometpush 
==> web에서는 push를 cometpush로 전송하여 떨어지는 log로 정상적인 case 인데 로그 레벨만 ERROR일뿐 정상케이스 입니다. 
불필요하게 ERROR레벨로 로그 출력되는 부분이 더러 있습니다. 해당부분들 제거 하겠습니다. 

3. pew1gl002m  Disk_usage 워닝에서 크리티컬로 바껴 연락드렷습니다.  ====> 대한 응답 
안녕하세요? 구주 gluster2 서버는 우리 Disk 용량이 91%여서 Critical이 뜨는 것 같습니다. 
구주 gluster2 서버에 대한 공간을 확보 해야할 것 같습니다. 
 1) 구주 gluster2 서버 Disk 용량 체크 
chaton@ip-10-248-89-152:~$ df -k 
Filesystem           1K-blocks      Used Available Use% Mounted on 
/dev/xvda1             8256952   2704020   5133504  35% / 
none                  17557068       152  17556916   1% /dev 
none                  17564676         0  17564676   0% /dev/shm 
none                  17564676        68  17564608   1% /var/run 
none                  17564676         0  17564676   0% /var/lock 
/dev/xvdb            866917368    205024 822675456   1% /mnt 
/dev/md127           2096095232 1886490268 209604964  91% /export/md0 
 2) 조치: 글러스터 담당자가 수요일에 Scale Out 예정인데 일주일에 2% 정도 사용량이 늘어나거 94% 시점에 확장 될 예정 입니다 
그래서 Alert Factor를 를 95% 로 수정해야 할 것 같은데 이건 이정모 선임과 이야기 할테니 그 전까지 95% 이하는 무시 해.주세요 
고 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:10 --> 한일평 과장 허리 아퍼 결근(SDS에 휴가 신청), 정평순 주인 면담(3월 1일에 4천 5백 준다고 함) 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인 
1. Chat View 2개의 창에서 파일 전송시 에러 발생 
[[==================== UploadFileCommand Start ====================] 
[UploadFileCommand URL] = http://182.194.5.63:80/file?imei=111111111111111&filen 
ame=1360646439207.jpg&filesize=314062&filepart=1/4&contenttype=image/jpeg 
Status = HTTP/1.1 500 Internal Server Error 
Error Body Content = [182.194.5.63][2013-02-12 14:20:39.535][CFS-11900] Internal 
 server error 
[==================== UploadFileCommand End ====================] 

> java -jar SSMEV.jar 
- SPCS file 서버(ssk1fi001m) 
chaton@ssk1gt001m:~$ ssk1fi001m 
chaton@ssk1fi001m:~/openapi/log$ cd /openapi/log 
chaton@ssk1fi001m:~/openapi/log$ vi chaton_image.  
chaton@ssk1fi001m:~/openapi/log$ tail -f web.log 
chaton@ssk1fi001m:~/openapi/log$ vi web.log  ==> VI 편집기로 열기 
> ? ERROR 
> ? WARN  ==> ERROR 뒤에서 부터 찾기 
==============================================================================================================

- java Application 환경 셋팅(ecipse에서) 
1. Name: 01.SSMEV 
2. Project: SSMEV 
3. Maiin Class: ssm.emulator.SSMEmulator 
4. Arguments:  
==============================================================================================================

- 임차권등기명령(이사 후 전세금 보호) 
1. 임차권등기명령을 법원에 신청하시어 등기를 경료하고나가셔야합니다. 짐을 빠지전에 등기를 신청하시어,  
등기가 경료된것을 확인한 후 이사. 
2. 신청요건  
㉮ 보증금의 전부 또는 일부를 돌려받지 못한 임차인   
㉯ 계약만기가 지난후 보증금을 못돌려 받은 경우   
㉰ 임대차 종료되기전 보증금을 못돌려 받고 다른 지역으로 주소이전을 해야하는 경우 
3. 소송: 확정판결 및 집행권을 얻은 후 임대인의 재산에 대해 강제집행을 함으로서 소송비용과 보증금 및 지연  
이자 등을 받을 수 있다. 
http://www.ppomppu.co.kr/zboard/view.php?id=house&no=5100 
==============================================================================================================

- 고운얼굴성형외과(눈밑 주름 수술) 
http://www.fine-face.com 
주소: 관악구 낙성대동 856-5 대우 디오슈페리움 B동 3층(서울대입구역 2번 출구), 884-38389 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:10 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인 
==============================================================================================================

- ED 작성 
1. 담당 업무별 TB 연계하여 작성 
==============================================================================================================

- ED를 확인하기 위한 SPCS의 Mysql 접속 
1. Gateway 서버 접속 
2. Alias 이용하여 DB 서버 접속 
ssk1db001m, ssk2db002m 
3. mysql 접속    
chaton@ssk1gt001m:~$ alias  grep db 
chaton@ssk1gt001m:~$ ssk1db001m 
chaton@ssk1sv001m:~/service/conf$ mysql -u coservice -p -h 114.63.222.115 ==> mysql DB에 접속[Stage DB서버] @@@ 
password: daebak#mj.hazin 
mysql> use chaton 
mysql> show tables; 
mysql> desc trunk; 
+-------------+--------------+------+-----+---------------------+-------+ 
 Field        Type          Null  Key  Default              Extra  
+-------------+--------------+------+-----+---------------------+-------+ 
 sessionid    varchar(128)  NO    PRI  NULL                        
 vldenddttm   timestamp     NO    PRI  2038-01-19 12:14:07         
 regdttm      timestamp     YES        NULL                        
 lastupdttm   timestamp     YES        NULL                        
 totitemcnt   int(11)       NO         1                           
 lastcmtdttm  timestamp     YES        NULL                        
 totcmtcnt    int(11)       NO         0                           
+-------------+--------------+------+-----+---------------------+-------+ 

chaton@ssk1gt001m:~$ alias  grep db 
alias lb-ssk1sv='ssh -i /home/chaton/keys/ssk1slb.pem   root@10.11.39.160' 
alias ssk1sv001m='ssh -i /home/chaton/keys/ssk1app.pem -p 2022 chaton@10.11.39.71' 
chaton@ssk1gt001m:~$ ssk1db001m  
chaton@ssk1sv001m:~/service$ cd /home/chaton/service/conf 
chaton@ssk1sv001m:~/service/conf$ ls 
pk-APKAIF3COYG5G5OCJ4YQ.pem  ssm-server.logging.properties  ssm-server.properties  sv_conf.tar 
chaton@ssk1sv001m:~/service/conf$ vi ssm-server.properties  ==> 계정, IP, 비밀번호는 각 서버의 properties 파일에서 확인 
# RDS  
mysql.url=jdbc:mysql:loadbalance://10.11.39.119:5306,10.11.39.116:5306/chaton?loadBalanceBlacklistTimeout
=5000&useUnicode=true&characterEncoding=utf8&autoReconnect=true 
mysql.username=coservice 
mysql.password=daebak#mj.hazin 
mysql.maxactive=100 
mysql.maxidle=100 
mysql.maxwait=600000 
chaton@ssk1gt001m:~$ ssk1sv001m 
chaton@ssk1sv001m:~$ mysql -u coservice -p -h 10.11.39.119 ==> mysql DB에 접속[SPCS DB서버] @@@ 
password: daebak#mj.hazin 
mysql> use chaton 
mysql> show tables; 
mysql> desc trunk; 
+-------------+--------------+------+-----+---------------------+-------+ 
 Field        Type          Null  Key  Default              Extra  
+-------------+--------------+------+-----+---------------------+-------+ 
 sessionid    varchar(128)  NO    PRI  NULL                        
 vldenddttm   timestamp     NO    PRI  2038-01-19 12:14:07         
 regdttm      timestamp     YES        NULL                        
 lastupdttm   timestamp     YES        NULL                        
 totitemcnt   int(11)       NO         1                           
 lastcmtdttm  timestamp     YES        NULL                        
 totcmtcnt    int(11)       NO         0                           
+-------------+--------------+------+-----+---------------------+-------+ 
==============================================================================================================

- Web ChatON 접속 
*, *@*.*   
mysql> select uid from user where emailSamsung like'*@*.*%';  
mysql> UPDATE devicemask set chatonid='1000000000064087077' where uid='dc05f62f-d792-4c3e-9370-60b79e9032bc'; 
smysql> select chatonid from devicemask where uid lik chatonid='1000000000064087077'; 
  
3. Web ChatON 가입 후 DB Table 직접 변경 필요 
     1) SPCS MySQL 접속 
     2) 가입 시 email 주소로 uid 찾기 
       select uid from user where emailSamsung like ‘가입한emailaddr%'; 
     3) uid로 chatonid 찾기 
       select * from devicemask where uid='b915e581-5250-4c8c-93ba-1b2cf7e12442'; 
     4) chatonid 값 중 마지막 자리 값 제외하고 update 
       UPDATE devicemask set chatonid='1000000000064087076' where uid='b915e581-5250-4c8c-93ba-1b2cf7e12442'; 
     
==============================================================================================================
  
- 네트워크 예외를 위한 웹프락시 설정 
1. 프락시(Proxy) 서버 설정 
[인터넷옵션] → [연결] → [LAN 설정] 
‘자동 구성 스크립트 사용(S)’ 체크박스 해제, ‘프록시 서버’ 체크 박스 선택(그림#2) 
‘주소(E):’창에 ‘70.10.15.10’, ‘포트(T):’창에 ‘8080’ 입력 ==> 이 서러정은 전화 연결이나 VPN 연결에는 적용되지 않음 
2. 필수 네트워크 예외 
[인터넷옵션] → [연결] → [LAN 설정] → [고급] 
 1) 예외 항목 창에 아래 스크립트 입력 
필수예외: *.cinerak.com;*.samsung.net;*.sbc-cloud.com 
3. C:\Windows\System32\drivers\etc\host 파일에서 
###### < cinerak(SMS) >###### 
114.108.160.195 www.cinerak.com  ==> 씨네락(SMS) 
==============================================================================================================
  
- 개인 PC에서 공유 걸기 
1. [A 사용자] 폴더 생성(D:\51. TAMA Data) 
2. [A 사용자] 51. TAMA Data 폴더에 TAMA에게 읽기/쓰기 권한 부여 
3. [A 사용자] 파일을 보낼 상대방에 개인 PC IP주소 보내기 \\70.4.78.71 
4. [B 사용자] 탐색기에서 \\70.4.78.71(클릭) 
5. [B 사용자] \\70.4.78.71\51. TAMA Data폴더에 들어가서 전송할 파일(A.txt) 복사하여 붙여넣기 
6. [A 사용자] 51. TAMA Data폴더에서 전송된 파일(A.txt) 확인 
==============================================================================================================

- 장기간 집을 비우신 후에 보일러를 작동할때 주의할 점 
1. 보일러 전원이 켜져 있지  않은상태에서 화장실이나 주방의 수도꼭지(어느쪽이든 무관) 중 한곳을 온수쪽으로  
완전히  튼 상태로 물이 나오는지 확인(배관이든 보일러내든 동파가  되었다면 물이 나오지 않기때문에, 동파유무를  
확인하기 위함) 
2. 만약 물이 나온다면 동파가 된건 아니니 온도조절기 전원을 켜고 난방을 가동시켜 보시고  온수도 틀어보십시오.  
3. 물이 나오지 않는다면 우선 동파가 된것이니 인근 설비점에  연락하시어 해빙을 하셔야합니다.  
4. 해빙이 된 후에 보일러를 가동하십시오.   
5. 보일러  하부쪽에서 물이 떨어지는지 확인 해보시고 특이사항이 없고 보일러가 잘 가동된다면  사용하시면 됩니다.   
6. 롯데 가스보일러 전국 서비스센타 전화번호는 1588-8888번 
-------------------------------------------------------------------------------------------------------------------------- 

- 정지된 보일러는 동파될 가능성이 크구요  
1. 일단 수도계량기에서 보일러까지 원수공급이 얼지 않고 되는지 보일러 밑에 배관중 원수공급되는 배관을 조금  
풀어보면 물이 계속 나오면 원수공급은 이상 없음 
2. 보일러 뚜겅을 열어보시고 보충 물통에(하얀색 사각 플라스틱 통)물이 얼지 않았다면  
3. 도시가스 밸브를 열고 보일러 가동하면서 보일러 안에서도 물 새는것이 없는지 확인해서 이상없으면 OK 
4. 보일러 동파 수리 비용: 5 ~ 25만원 
-------------------------------------------------------------------------------------------------------------------------- 

- 보일러 동파 수리 부품 
1. 송풍기 모터교체 & 풍남?풍담? S/W교체 
2. 콘드롤러교체(워터뉴람? ) 
3. 오일러 청소 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:15 ~ 18:10 --> SDS직원 7층 상주(alias 조사 때문에 열받음, 관리 강화), DBA 실DB scloude(SDS 관리) 서버에 가져 오라고 
				PM이 지시해서 난리남(DBA 거부, 김성채 팀장이 하라고 재지시함) 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인  
1. Configuration Server 
 1) Set Compatibility: 하위 호환성 관련 설정을 저장한다. 
 2) Get Compatibility Buddy Listy: 특정 하위호환성을 가지고 있는 buddy의 ID를 반환한다. 
==============================================================================================================

- ED(Entity Diagram) 작성 
1. 담당 업무별 TB 연계하여 작성 
2. SQLyog DB(Mysql용) 연결(SSH 이용) 
3. Toad for MySQL Freeware 6.3(Mysql용) 연결 실패(SSH 사용 불가) 
------------------------------------------------------------------------------------------------------------------------- 

- ER WIN 
http://xbigfile.naver.com/bigfileupload/download?fid=y9FqWX30WzKXFqUjK3eqFqEjKogwKqgZKxKmFxudKx2jKxKrKqK9ax
Ela3YwKzFoFxbZpxKXFrKlFoKZMx2ZMrp4pA0vFxE/FovwF2==  
erwin data modeler: XW3DJ-PCEGP-DFYNL-FGKMD-CVSAA   
2. 참고적으로 ssk1gt001m(182.194.2.152) 서버에서 db서버 5506 포트 열어놨습니다. 
putty 터널링 하시고 로컬포트 통해서 erwin 접속하시면 됩니다.(5306) 

- ER WIN 연결 
1. putty에서 터널링 
02. SPCS[검증서버]에서 L5506 -->   

2. My SQL용 ODBC 
 1) 제어판\모든 제어판 항목\관리 도구 데이터 원본(ODBC) > 데이터 원본(ODBC) 
 2) Data Souce Name: SPCS, 127.0.0.1, coservice/daebak#mj.hazin, Database: chaton  
==============================================================================================================

- fi 키 생성 수정(alias명조사_편집중.xls 파일 수정) 
alias pue1fi001 ssh -i /home/chatonop/keys/pd.us.pem -p 2022 chaton*@*.com ===>  
alias pue1fi001='ssh -i /home/chatonop/keys/pue1fi.pem -p 2022 chaton*@*.com' 
  
alias pue1fi002  ssh -i /home/chatonop/keys/pd.us.pem -p 2022 chaton*@*.com ===>  
alias pue1fi002='ssh -i /home/chatonop/keys/pue1fi.pem -p 2022 chaton*@*.com' 
==============================================================================================================
  
- 일일 레포트 update 
svn//CHATON//NewDocument//99.Report//daily_report_mobileBC_SMSGW.xlsx 
==============================================================================================================

- putty puttygen 사용  
1. putty key puttygen 다운로드 
http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html 
2. putty key puttygen 사용법 
http://mcchae.egloos.com/5204051 
 1) putty puttygen > iosp-dev-auth: Action: load --> iosp-dev-auth.pem(Save private key 클릭) ==> auth.ppk 생성됨  
Xshell용 public key를 생성해야 함  ===> ssk1adm_public.ppk 
http://blog.dahlia.kr/post/24522452884 
------------------------------------------------------------------------------------------------------------------------- 

key  key generator를 인터넷에서 찾아 설치하시면요 
퍼블릭키로 프라이빗키 생성이 가능합니다.  
Save public key 이걸 하세요 
==============================================================================================================

- 안드로이드 책 
안드로이드 프로그래밍 정복1 
http://book.naver.com/bookdb/book_detail.nhn?bid=6586736    
안드로이드 프로그래밍 정복2 
http://book.naver.com/bookdb/book_detail.nhn?bid=6586782 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 21:00 --> 당직 근무(김상봉 과장) 

- ChatON 운영 Prj
1. Log포맷 정규화(월요일) 
- 대상 정의 및 로그 포맷 정의 ==> 개발자들 의견 필요  
==============================================================================================================

- 디플로이 참관 후 디플로이 전달교육 
내용 : ChatON Deploy 업무 전달교육 
일시 : 12년 02월 15일 (금) 
시간 : 09:30 ~ 12:00 
장소 : 823빌딩 14층 1회의실 
==============================================================================================================
  
- SVN 내려받기 오류 
1. ServiceServer(마우스 우 버튼: 클릭) > Find/Check Out AS 
2. Check Out AS(새창) 
 1) Check out as a project with the name specified(2번째 라디오 버튼) 
ServiceServerorg.eclipse.wst.jsdt.core.javascriptValidatororg.eclipse.wst.common.project.facet.core.builderorg. 
eclipse.jdt.core.javabuilderorg.eclipse.wst.validation.validationbuilderorg.eclipse.m2e.core.maven2Builder 
===> ServiceServer로 변경 
 2) Depth: Recursively 
 3) Revision: Head Revision  ====> Finish 
3. Poject Explore에 ServiceServer Properties 생성 
- ServiceServer 
- ServiceDAO 
- ServiceServer 
- NotificationSender 
==============================================================================================================

- ChatON 대시보드 게시판 
==============================================================================================================

- 공증 
1. 공공정증서 상 지급기일이 지나서 공증사무실에 가셔서 집행문을 부여해달라고 하시면 1, 2만원 비용 지급 후 
집행문을 받아서 강제집행 가능(정확한 재산목록을 파악 후 움직일 것) 
2. 채무자의 재산을 알아보는 방법은 1) 채권자의 직접조사  2) 신용평가정보회사 위임 
3. 약속어음공증 시효 3년  
4. 법인에게 받은 공증 약속어음 강제집행절차( 대법원 홈페이지 > 전자민원센 터> 절차안내 > 강제집행) 
5. 다만 개인이 강제집행 및 추심을 모두 진행하기에는 다소 어려운 부분이 있을수도 있기 때문에 신용정보회사 등을  
통해 추심진행을 권장 
6. 지급명령을 신청하시면 법원에 출석하지 않고 민사소송보다 기간도 단축되고 비용도 아주 저렴  
7. 채무자에게 압박을 주는 것이라면 차라리 최고장(언제까지 갚아라는 내용)을 내용증명 보내기 
8. 곧바로 강제집행절차를 행하지 않고 변제일까지 기다리실것이라면 부동산에 대하여 법원에 가압류 신청하여  
설정하시면 됩니다. 단, 가압류는 채권입니다. 물권에 우선할 수 없고 선순위 근저당에게도 대항할 수 없습니다. 
9. 공정증서에 집행문을 부여받아서 바로 압류 들어 가시면 됩니다.  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

07:00 기상 
09:00 갤럭시s2 젤리빈 업그레이드(http://blog.naver.com/thesca1es?Redirect=Log&logNo=50162287987)  
10:00 업데이트 후 다운되고 Micro SD 카드 에러 발생(포맷 후 인식 못 함)  
13:20 중식 
16:30 신사조기회 한상봉 회장에게 전화 옴(오늘 임원회의에서 참석 못 한다고 함) 
17:00 집출발 
18:30 베트남 신랑 모임 ==> 의정부역 4번 출구(응아 남편, 홍 남편)  
19:00 팔가(중국집: 7만원 정도 나옴): 회비 3만원씩 냄 
21:30 종료 
23:00 귀가 
23:40 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:00 기상 
06:30 신봉천 주유소(태훈이형 차) 
06:50 신구초등학교 
07:00 운동장 눈깨기(얼어서 잘 안깨짐) 
08:10 숏게임(1:1 무) ==> 강동훈, 인호진 과장 처음으로 나옴 
08:40 게임(1:1 무) 
08:10 게임(2:2 무): 청담팀 초청경기 
11:30 종료 
11:50 중식(뚝심한우: 설렁탕 ==> 조기회에서 쏨)  
12:30 종료 
13:00 귀가 
16:10 남권이형하고 통화해서 돈 달라고 함(저녁에 형수하고 협의하고 전화 준다고 했지만 전화 안 옴) 
17:10 루옌(부인)과 화상통화 
19:00 보일러 다시 틈(기온이 7도라 보일러통 안 얼어 있음): 외출로 맞춤(14도) 
20:00 석식 
21:30 TV 시청(개그콘서트) 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> 이정재 과장(*) 출근, 조남권형에게 법적 조치 통보(하라고 함) 

- ChatON 운영 Prj
- Log포맷 정규화(월요일): Bad Case 
1. 대상 정의 및 로그 포맷 정의 ==> 개발자들 의견 필요 
==============================================================================================================
  
- Micro SD 카드 에러 ==> 자동 복구됨 
F: 드라이브의 디스크를 사용하기 전에 포맷해야 합니다. 형식을 지정하시겠습니까? 
응급조치: 현재 상태에서 절대 포맷을 하지마시기 바랍니다. 
복구안내: 파티션 정보가 손상된 것입니다. 
개인복구 진행안내: recover my files, R-Studio 등을 추천합니다.  
http://angrybirds.tistory.com/862 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 중식(금문도: 김성채 팀장 외 4명) 

- ChatON 운영 Prj
1. Log포맷 정규화(월요일): Bad Case 
- 대상 정의 및 로그 포맷 정의 
==============================================================================================================

- ChatON 대시보드 게시판 정리 
0. constants/API_LIST.txt, PROVISION_REGION.txt, SERVICE_TYPE.txt 
1. DashboardTestWindow.txt  
2. cmd/GLDServiceCommand.txt, ContactServiceCommand.txt 
==============================================================================================================

- 남권이형 대여금 조치 
1. 공증서(원본) 주민센터에 가서 초본 뗄 것(현 거주지 파악) ==> 실패 
 1) 공증증서 상의 차용인 초본 발급: 2012년 11월에 법이 개정되어 공증증서 외에 내용증명이나 재산공개명령서가  
 있어야 함.(역삼1동 주민센터에서 발급 거부 당함) 
2. 용길이한테 요청해서 남권이형 부부 자산 파악할 것 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> SDS 직원 7층으로 이사 

- ChatON 운영 Prj
- Log포맷 정규화(13시 회의): Bad Case 
1. 대상 정의 및 로그 포맷 정의  
==============================================================================================================

- 장애 상황 Review 
1. 2월 15일 발생했던 상황 Review(발표) 
==============================================================================================================

- 신규 Deployment 방식 교육(10시 ~11시) 
1. 권영오 책임 
2. Deployment 서버: Scaler 
3. Jenkins: PMD(Jtest), Junit, 개발빌드, 개발배포 
==============================================================================================================

- 지불각서 양식 작성(봉천동 집주인)  
1. 지불각서 작성시 주의점: 지불각서는 특별한 형식이 있는 것이 아닙니다. 당해 채권이 임금인 것, 그 금액,  
날짜, 각서인의 이름과 도장이 들어가면 일단 지불각서로써의 효력을 갖습니다.  
(가급적 체불내역은 자세히 기재하는 것이 좋습니다.) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:15 ~ 21:00 --> 당직 근무(한일평 과장) 

- ChatON 운영 Prj
- ChatON_1차 대응 매뉴얼 숙지 
1. PM 확인(금요일) 
2. 파일 수정 요청할 것 
 1) Service 서버 재시작: /home/chaton/sevice//bin에서 ./kill.sh 실행 후 ./run.sh 실행.(~/service/bin/re.sh과 동일)  
==============================================================================================================

- 디플로이 서버 chatop계정의 권한체크 
1. 윤영훈 사원에게 전달 
==============================================================================================================

- 1.1 Nagios 모니터링 중 Disk Usage Critical이 지속적으로 발생 
> mv /chaton/msgctx/tomcat/bin/java_pidxxxxx.prof /home/chaton/msgctx/mnt/  ===> A폴더의 java_pidxxxxx.prof 
파일을 B폴더로 옮김 
> mv /chaton/msgctx/bin/java_pidxxxxx.prof /home/chaton/msgctx/mnt/  ===> A폴더의 java_pidxxxxx.prof 
파일을 B폴더로 옮김  
==============================================================================================================

- NFC기능을 지원하는 스마트폰만 모바일 카드 사용이 가능 
1. 안드로이드 - 갤럭시 S2, 갤럭시 노트, 갤럭시S3, 베가레이서2, 옵티머스 LTC, 등 
(LG U+ 갤 S2는 유심 자체가 없어서 NFC 기능 사용 불가) 
==============================================================================================================

- 신한카드 교체 발급 신청 
1. SMART9 신한빅플러스 LG U+모바일카드(회비 7,000원) 
2. LG U+ 통신료 제휴가드 결제시 9,000원 할인(30만원 이상 사용시): ww.shinhancard.com 
----------------------------------------------------------------------------------------------------------------------------- 

- LG U+ 가입 신청(이번주 내에 처리할 것) 
1. 용산 이마트 행사(LG U+ 가입 신청서 작성)  
2. 가입 조건 
 1) 인터넷 + 전화 + TV(tv G): 30,700원(제휴가드 결제시: 21,700원) 
 2) 지원금(12만원 또는 47인치 3D TV) 
 3) 070 Player 2(3년 약정) 총 월: 13,200원 ==> CCTV 보안(월: 3천원)  
 4) LG U+휴대폰 고객 월 5,500원 추가할인 
 5) 황실장: *, 070-4306-4999 ==> 2월 5일(화)에 전화 주기로 함(취소 함) 
 http://www.100mb.kr/01_product/lg.php 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 21:00 --> 당직 근무(임정현 과장): 김밥 1줄 사다 줌 

- ChatON 운영 Prj
- ChatON_1차 대응 매뉴얼 숙지 
1. PM 확인(금요일) ==> 개별적으로 남선임 확인 
2. 파일 수정 요청할 것 
 1) Service 서버 재시작: /home/chaton/sevice//bin에서 ./kill.sh 실행 후 ./run.sh 실행.(~/service/bin/re.sh과 동일)  
==============================================================================================================

- SPP PUSH 서버(kr) 불가 로그 분석서 작성 
1. 02.21(목) 21시에 일어난 에러 로그 작성 
2. SPP PUSH 불가 로그 분석 중 vi 3개 열여서 메세지 서버 다운됨(23시 경에 남선임, 이책임 전화 옴) 
==============================================================================================================

- 국민은행 청약저축(055207-04-003873) 해지 
1. 원금: 1,000,000원 
2. 출금액: 1,338,840원 
- 국민은행 장기주택마련저축(470348-01-002266) 해지 
1. 원금: 12,150,00원 
2. 출금액: 2,653,877원 
===> 총 출금액: 3,992,717원 
==============================================================================================================

- GS SHOP 가구류 구매 
http://with.gsshop.com, tamario/s*j**8**1 
==> 커텐 봉 구매, 강화유리 
보험 3개 상담 받을 것 ==> 모네타 
==============================================================================================================
  
- PCA 보험 약관 대출 
1. 납입금: 24,600,000  
2. 가능금액: 13,830,000원 
3. 이자율: 5.8% 
4. 신청하면 다음날 통장으로 보내줌 
- PCA 중도인출  
1. 납입금: 24,600,000  
2. 가능금액: 13,450,000원  
4. 신청하면 다음날 통장으로 보내줌  
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.02.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구 
06:00 기상 
06:30 신봉천 주유소(태훈이형 차) 
06:50 신구초등학교  
07:00 숏게임(0:3 패) 
08:20 종료 
08:40 조식(형들이 나눠서 냄)  
09:30 집출발 
10:00 귀가 
11:00 냦잠 
16:00 기상 
16:30 하이마트 쇼핑(별 것 없음), 노끈 3개 구매 
20:00 석식 
23:40 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.02.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구 
06:30 기상 
07:00 신봉천 주유소(태훈이형 차) 
07:30 신구초등학교  
07:40 숏게임(1:1 무) 
09:00 게임(1:1 무): 분당 샛별팀 초청경기 
10:30 게임(3:0 패) 
12:00 종료 
12:20 중식(문경세재: 갈비탕 ==> 조기회에서 쏨) 
12:30 회칙 개정(회장님 설명) 
12:40 유니폼 결정(아이다스 빨간색): 현대백화점에서 주문 --> 감독(김상권형) 불만이 많음(감독직 사임 주장) 
12:30 종료 
14:00 귀가  
18:10 루옌(부인)과 화상통화 
20:00 석식 
21:30 TV 시청(개그콘서트) 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:15 ~ 18:00 --> 18대 대통령 박근혜 취임 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인 
1. Trunk 에러 해결 안됨 
2. SPCS 서버에서 파일전송 후 Get Trunk List에서 response값을 못 받아옴(서버에 문제가 있는 것으로 추정됨) 
==============================================================================================================

- 은아 노트북 구매 
1. 삼성전자 시리즈3 NT350V4C-A15 (정품), 673,000원, 14인치, 2.26Kg, 펜티엄: B970 (2.3GHz), HD: 500GB, RAM: 4GB 
http://prod.danawa.com/info/?pcode=1720988  
2. 배송지: 전남 여수시 학동 54 신동아파밀리에APT 107동 405호 
3. 김은아: *, 진선숙: * 
4. 691,000원 결제(옥션: 광마우스 추가) 
==============================================================================================================

- 전세 자금 마련 
1. 우리금융저축은행 예금 인출(4,476,840원 -> 4,530,925원) ==> 2월 25일(월): [인터넷 처리완료] 
2. PCA 중도인출(PCA): 13,770,000원 ==> 2월 25일(월): [인터넷] 신청완료 
3. 보험 약관 담보 대출(한화생명): 14,560,000원 ==> 2월 25일(월): [한화생명 CENBRANCH 직접 방문 접수 완료] 
http://www.hanwhalife.com, tamario/s*pe**8**1 
==> 출금가능금액(국민은행): 8,523,642원
==============================================================================================================
  
1. 우리금융 예금 찾기(공인인증서) 
- 우리금융저축은행 예금 가입 ==> 2012년 6월 @@@@@@ 
1. 상품명: 보통예금, 예금주: 진태만(062-01-13-2384510(국민은행 연계: 925890-61-138879)) 
1) 생계형(비과세) 정기예금복리(062-02-24-1882149, 원금: 4,476,840원) 
실수령액: 4,642,963원, 이자율: 연4.38%, 예치기간: 12개월 
만기일자: 2013/06/08 
==> 총실수령액: 4,642,963원 
-------------------------------------------------------------------------------------------------------------- 

2. PCA 중도인출(중도인출: 60%)(인터넷 신청): 13,450,000원 
홈페이지> E-desk > 지급서비스 > 중도인출금 신청 (평일 오전9시~ 오후5시)  
1일 1회, 중도인출 금액 제한 없음  
계약자 본인명의의 자동이체로 3회이상 출금된 자동이체 계좌가 연결되어있는경우, 등록된 자동이체계좌로 신청가능 
==> 1588-4300 
==============================================================================================================

- LG U+ 가입 완료 
1. 용산 이마트 행사(LG U+ 가입 신청서 작성(취소) ==>  http://www.100mb.kr/01_product/lg.php에서 재가입 신청 
2. 가입 조건 
 1) 인터넷 + 전화 + TV(tv G): 33,600원(제휴가드 결제시: 9,000 원 할인) 
 2) 지원금(12만원 + 32 만원)  
 3) LG U+휴대폰 고객 월 5,500원 추가할인(개통 후 대리점에 가서 결합 상품 요청할 것) 
3. http://www.100mb.kr/01_product/lg.php 
==============================================================================================================

- SK 브로드밴드 계약 취소 
1. 위약금: 11만원(3월 25일 청구됨) 
2. 기타    
- SK 브로드밴드 계약 만료일 
1. 신청서비스: B인터넷(광랜W) 
2. 3년 약정: 월 22,000원(장애인 30% 할인) --> 명의자: 진덕근(*) 
3. 계약일: 2011년 01월 21일 ~ 2014년 01월 20일(3년 약정) 
4. 연락처: SK 브로드밴드: T) 6746-0338, 유광현: T)010-9916-4190, 무료상담 전화) 080-8282-106 
5. 인터넷품질테스트: 한국정보화진흥원(http://speed.nia.or.kr/spedtest/default.asp)  
6. SK broadband 해지방법 
 1) 106번(유료) 또는 080-8282-106(무료)에 전화를 걸어 해지신청을 합니다.  
   - 평일 오전9시부터 오후6시까지만 이용가능합니다.(오후6시 정각에 전화하면 안 받습니다)  
   - 토요일 오전9시부터 오후1시까지만 이용가능합니다.(해약문의는 오전12시까지 입니다)  
 2) SK브로드밴드 홈페이지에서 해지신청을 합니다.  
   - SK브로드밴드 홈페이지 : http://www.skbroadband.com 
   - 로그인하여 가입상품관리 메뉴에서 해지신청을 하시면 됩니다. 
==============================================================================================================

- 전세 등기부등본 출력  
1. 하노이 대사관 비자 서류 접수에서 전세 살고있는집 등기부등본 요구 
2. 뚜언 이메일: *@*.* ==> 용산 사장님에게 전달해서뚜언에게 메일로 보냄 
3. 대법원 인터넷등기소(http://www.iros.go.kr, tamario/tama339)  
4. 봉천동집: [건물] 서울특별시 관악구 행운6길 16-20 [봉천동 106-23]  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 --> 조대형 과장 휴가(부친 퇴임식), 신부 사증 접수(발급예정일: 4월 3일[하노이 대사관]) 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인 
1. Trunk 에러 해결 안됨 
2. SPCS 서버에서 파일전송 후 Get Trunk List에서 response값을 못 받아옴(서버에 문제가 있는 것으로 추정됨) 
3. 아마존 S3 계정에서 outbound 연결 요청 
----------------------------------------------------------------------------------------------------------------------- 

- SPCS - EV 설정  
> java -jar SSMEV.jar 
1. New Device 
IMEI: 111111111111111 
IMSI: 222222222222222 
MSISDN: 821043211234 
client version: 3.7.5 
Model: SCH-1234 

2. Config 
gld address: 182.194.5.64, port: 80  ===> SPCS 서버  @@@ 
3. connect 
name: provisioning, address: gld.push.samsungosp.com, port: 5223 
2. Config 
name address: stg.gld1.samsungchaton.com, port: 80  ===> stg 서버(stage: 실서버) @@@ 
3. connect 
name: provisioning, address: gld.push.bada.com, port: 5223 
2. Config 
name address: gld1.samsungchaton.com, port: 80  ===> product 서버 @@@ 
3. connect 
name: provisioning, address: gld.push.bada.com, port: 5223 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 05:50 ~ 18:00 --> 새문빌라 전세 계약서 재작성(12시), 봉천동 106-23(4천 5백 받음, 천만원 지불각서 작성: 정평순 주인) 

- ChatON 운영 Prj
- 검증 서버(SPCS) 확인 
1. Trunk 에러 해결 안됨 
2. SPCS 서버에서 파일전송 후 Get Trunk List에서 response값을 못 받아옴(파일 서버에 문제가 있는 것으로 추정됨) 
==============================================================================================================

- 한국 결혼식 
1. 일시: 2013년 05월 05일(일) 13시 
2. 장소: 포항 목화예식장(웨딩 아이린) 2층 
3. 주소: 포항시 남구 해도동 53-1(T: 277-3111) 
4. URL: http://www.weddingirene.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.02.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> 이사짐 싸기, 인호진 과장 병가 

- ChatON 운영 Prj
- ChatON_1차 대응 매뉴얼 숙지 
1. 15시~ : 담당 모듈 외 나머지 전체 1차대응 숙지 
==============================================================================================================

- 전세금 송금 
00. 국민은행: 50,000,000원 
01. SC은행 : 50,000,000원  
==> 오늘 송금액: 1억 ===> 총 전세금(계약금 포함): 1억 9천 5백(송금 완료) 
농협: 10008151091690, 임주완 --> 진태만_새문전세금 
---------------------------------------------------------------------------------------------------------------- 

- 전세금 수수료(3월 1일 송금할 것) 
1. 국민: 075601 04 161218, 박동재(태화 부동산): 윤실장, 585,000원 
---------------------------------------------------------------------------------------------------------------- 

- 국민은행 키보드 보안 에러 해결 
http://webserver.softcamp.co.kr/scsk 
==============================================================================================================

- ChatON 운영 및 개발 계약(아이엘포유) 
1. 수행업무:  ChatON 운영 및 개발 
2. 기간: 2013.03.01 ~ 04.30(2개월) 
3. 내용: 정규직(1,200,000원), 프리랜서(*,700,000원) 2가지 계약 체결(총: 5,900,000원), 4대보험, 퇴직금 
4. 계약 대행: (주)아엘포유 SI 사업부 김성채 팀장(H: 010-2352-0): http://www.il4u.co.kr 
5. 갑: 주식회사 솔루션허브 대표이사 노영식(서울시 마포구 공덕동 404 풍림브이아이피텔 4층 411호) 
==============================================================================================================

- 이사짐 준비 
18:30 퇴근 
18:50 짐 정리(안방, 거실) 
20:00 석식 
18:50 짐 정리(화장실) 
01:00 종료 
01:10 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■