

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+---------------------------------------------// Memo(2013.04) //----------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á


¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.01(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:20 ~ 18:00 --> ÅÂ¿ë ¹æ¹®(22½Ã) 

- ChatON ¿î¿µ Prj
- Workflow ¸®ºä(13½Ã)  
³»¿ë : ChatON Service Server Workflow ¸®ºä(Trunk ¹ßÇ¥) 
³¯Â¥ : 13³â 4¿ù 1ÀÏ (¿ù) 
½Ã°£ : 13:00 ~ 16:00 
Àå¼Ò : 823ºôµù 14Ãþ 2È¸ÀÇ½Ç 
==============================================================================================================

- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

- ChatON Deploy ÀÌ°ü ½Ã ¼öÇà Á¶ 
1Á¶: ¿À½ÂÇö, ÁøÅÂ¸¸, ÀÌÁ¾Áø, ÀÎÈ£Áø, ÀÓÁ¤Çö 
2Á¶: °­µ¿Çö, Á¶´ëÇü, ÇÏ¹Î±Ô, ³ª¿µÃ¶, ¾çÁ¤ÈÆ 
3Á¶: ÇÑÀÏÆò, ±è»óºÀ, ÀÓ±âÅÃ, È«¿µ¹Î, ±èÈ«¿ø 
==============================================================================================================

- ½ÅºÎ »çÁõ ¹ß±Þ(ÇÏ³ëÀÌ ´ë»ç°ü)  
1. ¹ß±Þ ¿¹Á¤ÀÏ: 4¿ù 3ÀÏ(¼ö) 
2. ½ÇÁ¦ ¹ß±ÞÀÏ: 3¿ù 29ÀÏ(±Ý) 
3. ½ÇÁ¦ ¼ö·ÉÀÏ: 4¿ù 1ÀÏ(¿ù) 
4. ½ÅºÎ ÀÔ±¹ 
 1) 4¿ù 12ÀÏ(±Ý) 23½Ã¿¡ ¾Æ½Ã¾Æ³ª ºñÇà±â·Î Ãâ¹ß, 4¿ù 13ÀÏ(Åä) 05½Ã 20ºÐ¿¡ ÀÎÃµ°øÇ×¿¡ µµÂø ¿¹Á¤ 
 2) ÇÏ³ëÀÌ(23:00) -- > ¼­¿ï(ÀÎÃµ)(05:20), Æí¸í: OZ 734, ±âÁ¾: 333(http://flyasiana.com/reservation/reservation01.asp) 
-------------------------------------------------------------------------------------------------------- 

- ¾î¸Ó´Ï ¼­¿ïÇà 
 1) 14½Ã(¿ìµî) ==> 19½Ã(µ¿¾ç, 31,800¿ø), 15½Ã(ÀÏ¹Ý) ==> 20½Ã(µ¿¾ç, 21,400¿ø) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.02(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:00 ~ 18:00 --> W12 Á¤±â ¹èÆ÷(22½Ã): ¾çÁ¤ÈÆ °úÀå(¼ö¿ø) 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

- Microsoft Outlook 2010 ¼³Á¤(my single ¾ÆÀÌµð »ç¿ë) 
1. tamario2.*@*.*/s*j**8*1 
==============================================================================================================

- ³²±ÇÇü¿¡°Ô °øÁõ ³»¿ëÁõ¸í º¸³»±â(¿ìÃ¼±¹, 12½Ã)   
1. °øÁõ Áõ¼­ 3º» Ãâ·ÂÇØ¼­ °¥ °Í(¿øº» Æ÷ÇÔ): º»ÀÎ 1º» º¸°ü, ¿ìÃ¼±¹ 1º» º¸°ü 
2. 12½Ã ¿ìÃ¼±¹¿¡¼­ º¸³¾ °Í 
3. ºñ¿ë: ÀÍÀÏÆ¯±Þ ³»¿ëÁõ¸í(3,490¿ø), ºÀÅõ°ª(30¿ø) 
4. ¼öÃëÀÎ: ¼­¿ï½Ã ¼ºµ¿±¸ ¼º¼öµ¿ ½£¼Ó±æ 25¹øÁö Çö´ë¾ÆÆÄÆ® 101µ¿ 1002È£ Á¶³²±Ç(¾Õ) 
 ¹ß¼ÛÀÚ: ¼­¿ï½Ã °ü¾Ç±¸ ºÀÃµµ¿ 106-23 101È£(ÀÌÀü ÁýÀ¸·Î ¹Ý¼Û µÉ °Í À¸·Î ÃßÁ¤µÊ) 
5. ÀÎÅÍ³Ý ¿ìÃ¼±¹¿¡¼­ µî±â ¿ìÆí¹° ¹è´ÞÁ¶È¸ °¡´É(http://www.epost.kr)  
   ==> µî±â¹øÈ£: 31105-0103-1929(3110501031929) 
==============================================================================================================

- DB ¾ÏÈ£È­ ¿©ºÎ È®ÀÎ 
- DBEnc.java(com.sec.ssm.common.utils) 
public static int read = 16;   // ºñ¾ÏÈ£È­ 
public static int write = 16;   // ºñ¾ÏÈ£È­ 
-------------------------------------------------------------------------------------------------------- 

- /ServiceServer/src/main/resources/ssm-server.properties 
dbenc.read=10 
dbenc.write=10 
-------------------------------------------------------------------------------------------------------- 

- /IEncryptionType.java 
public interface IEncryptionType 
{ 
    public static final int ENCRYPTION_TABLE = 1;   // ¾ÏÈ£È­ 
    public static final int ORIGINAL_TABLE = 16;  // ºñ¾ÏÈ£È­ 
    public static final int DUALWRITE_TABLE = 17; 
} 
-------------------------------------------------------------------------------------------------------- 

- /TrunkItemDao.java  
public TrunkItem getItem(final DeviceUserInfo du, String sessionid, String itemid, List<String> child, 
boolean hasMixedMessage, boolean hasAms, boolean ischatonid) { 
	TrunkItem item = null; 

	if (DBEnc.read == IEncryptionType.ENCRYPTION_TABLE) {  // ¾ÏÈ£È­ ÀÌ¸é 
		item = getItemEnc(du, sessionid, itemid, child, hasMixedMessage, hasAms, ischatonid); 
	} else if (DBEnc.read == IEncryptionType.ORIGINAL_TABLE) {  // ºñ¾ÏÈ£È­ ÀÌ¸é(DBEnc.read = 16ÀÌ±â ¶§¹®¿¡ ¹«Á¶°Ç ºñ¾ÏÈ£È­¸¦ Å½) 
		item = getItemOrg(du, sessionid, itemid, child, hasMixedMessage, hasAms, ischatonid); 
	} 

	return item; 
}  
==============================================================================================================

(us-connect)ubuntu@:~$ alias  ==> ¼­¹ö È®ÀÎ  @@@ 
(us-connect)ubuntu@:~$ pkr1sv001  ==>  ÇÑ±¹ 1¹ø ¼­¹ö Á¶È¸ 
01. KR(ÇÑ±¹): (KR)pkr1sv001, (KR)pkr1sv002 
02. US(¹Ì±¹): (US)pue1sv001, (US)pue1sv002 
03. EU(À¯·´): (EU)pew1sv001, (EU)pew1sv004, (EU)pew1sv007 
04. SG(½Ì°¡Æ÷¸£): (SG)psg1sv003, (SG)psg1sv006 
05. CN(Áß±¹): (CN)pcn1sv001, (CN)pcn1sv002)  ===> VPN Á¢¼Ó ¿©ºÎ È®ÀÎÇÒ °Í(https://27.106.205.10)  
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.03(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:55 ~ 21:00 --> ´çÁ÷, ±¹°á ÀÜ±Ý 500¸¸¿ø ¼Û±Ý ¿Ï·á((ÁÖ)°¡¿ø Ä¿ÇÃ, ±è±Ý¼÷) 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

- ¼­¿ï µµ½Ã°¡½º(3¿ùºÐ: 2.25 ~ 3.14) ³³ºÎ 
1. »ç¿ë°è¾à¹øÈ£: 60036-24035 
2. °í°´¹øÈ£(ÀÚµ¿ÀÌÃ¼ ½ÅÃ»½Ã): 10015-41745 
3. Áö·Î¹øÈ£: 4000271 
4. https://www.seoulgas.co.kr 
5. Á¦ÈÞÄ«µå ÀÚµ¿ÀÌÃ¼ ½ÅÃ» ¿Ï·á(À¯¼±): 2013.04.24(¼ö), ¢Ï1588-5788 
6. ¼­¿ïµµ½Ã°¡½º KB±¹¹ÎÄ«µå ÇìÅÃ 
 1) ¿ù 30¸¸¿ø ÀÌ»ó 5% ÇÒÀÎ, ¿ù 60¸¸ ÀÌ»ó 10%(ÃÖ´ë 2¸¸¿ø) 
 2) ±³Åë 5%ÇÒÀÎ 
==============================================================================================================

- ¿­Â÷ ¿¹¸Å(hhttp://www.korail.com/servlets/hc.hc11100.sw_hc11111_i1Svt) 
1. 4¿ù27ÀÏ(Åä) ==> ÁÂ¼®Á¤º¸: 12È£Â÷ 14C, ¼­¿ï(10:30) --> ½Å°æÁÖ(12:39)(47,100¿ø) ==> 94,200¿ø, À§¾à¼ö¼ö·á(15%) 
==============================================================================================================

- ¼ºÇü¿Ü°ú(´«¹Ø ÁÖ¸§ ¼ö¼ú) 
0. ÄÚ¸®¾Æ ¼ºÇü¿Ü°ú(http://www.korea-ps.com/advice/counsel/index.jsp), ½Å³íÇö¿ª 3¹ø Ãâ±¸, °­³²±¸ ³íÇöµ¿ 165-8 ÇÑ¹éºôµù 3Ãþ, ¢Ï 543-0076 
1. ÀÌÁö¾Ø ¼ºÇü¿Ü°ú(http://www.izien.co.kr), ¾Ð±¸Á¤¿ª 3¹ø Ãâ±¸, °­³²±¸ ½Å»çµ¿ 597-3¹øÁö ÀÌÁö¾Ø¼ºÇü¿Ü°úºôµù, ¢Ï080-500-2080 
2. ±èÇüÁØ ¼ºÇü¿Ü°ú(http://www.drkim-clinic.com/new/members/login.asp#), °­³²±¸ Ã»´ãµ¿ 84-10 »ïÈÆºôµù 4Ãþ, ¢Ï544-3030 
3. »Úµð ¼ºÇü¿Ü°ú(http://www.petit.co.kr), ¼­ÃÊ±¸ ¼­ÃÊµ¿ 1319-13 ¼­ÃÊ Çö´ëÅ¸¿î 2Ãþ, ¢Ï 3446-7100 
4. °í¿î¾ó±¼ ¼ºÇü¿Ü°ú(http://www.fine-face.com), °ü¾Ç±¸ ³«¼º´ëµ¿ 856-5 ´ë¿ìµð¿À½´Æä¸®¿ò Bµ¿ 3Ãþ(¼­¿ï´ëÀÔ±¸¿ª 2¹ø), ¢Ï884-38389  
==============================================================================================================

´«¾Æ·¡°¡ ºÒ·èÇÑ °æ¿ì ±× °¡Àå  Áß¿äÇÑ ¿øÀÎÀº Áö¹æÀ» °¡µÎ¾î µÎ´Â ¾È¿Í°Ý¸·ÀÌ  
À¯ÀüÀûÀ¸·Î ¾àÇÑ °æ¿ì¿¡ ¸¹ÀÌ ¹ß»ýÇÕ´Ï´Ù.  
±³Á¤ ¹æ¹ýÀº Áö¹æÀ» ¿ø·¡À§Ä¡ÀÎ ¾È±¸¾Æ·¡ÂÊÀ¸·Î Àç¹èÄ¡ ÇÑÈÄ ´Ù½Ã ºüÁ®³ª¿ÀÁö ¸øÇÏµµ·Ï  
'±Ù¸·ÃÊ'¶ó´Â ¾È±¸¾Æ·¡ÂÊÀÇ Áú±ä ÀÚ°¡Á¶Á÷À¸·Î ¸·¾Æ °íÁ¤ÇÏ´Â ¹æ¹ýÀÌ ÀÖ½À´Ï´Ù.   
  
¸¸ÀÏ Áö¹æÀ» Á¦°ÅÇÏ°ÔµÇ¸é ´«µ¿ÀÚ¸¦ ¹ÞÃÄÁÖ´Â Áö¹æÀÌ ¾ø¾îÁüÀ¸·Î½á ¾È±¸°¡ ¾Æ·§ÂÊÀ¸·Î ¶³¾îÁö°í  
»ó´ëÀûÀ¸·Î ´«À§°¡ ¿òÇ«µé¾î°¡ º¸ÀÌ°ÔµË´Ï´Ù.  
½ÇÁ¦·Î 2ccÀÇ Áö¹æÀ» ´«¾Æ·¡¼­ Á¦°ÅÇÏ¸é ´«µ¿ÀÚ°¡ µÚ·Î 2¹Ì¸®,  
¾Æ·¡·Î 1¹Ì¸® ÈÄÅðÇÏ°í ¶³¾îÁø´Ù´Â ½ÇÇè ³í¹®ÀÌ ÀÖÁö¿ä.  
µû¶ó¼­ Áö¹æÀ» Á¦°ÅÇÏ±â º¸´Ù´Â ºÒ°ÅÁ® ³ª¿Â Áö¹æÀÌ ´Ù½Ã ºüÁ® ³ª¿Í Àç¹ßÇÏÁö ¾Êµµ·Ï  
±Ù¸·ÃÊ¶ó´Â Á¶Á÷À¸·Î °íÁ¤ÇØÁÖ´Â°ÍÀÌ Áß¿äÇÕ´Ï´Ù. 
-------------------------------------------------------------------------------------------------------- 

ÀÌ·±°æ¿ì 50~60´ë¿¡ ÁÖ·Î ½ÃÇàÇÏ´Â ÇÏ¾È°Ë¼ö¼úÀº ±× Àý°³¼±ÀÌ ºÎ´ãµÇ¸ç, 
¼úÈÄ ¾Ö±³»ì µîÀÌ »ç¶óÁö¸é¼­ ÆíÆòÇÏÁö¸¸ ¾î»öÇÑ ¸ð½ÀÀÌ µÉ¼ö ÀÖ¾î ÀþÀ¸½ÅºÐ¿¡°Ô´Â ±ÇÇØµå¸®Áö ¾Ê½À´Ï´Ù. 
¿Ü¾È°¢°íÁ¤¼úÀº 1cm~1.5cmÁ¤µµÀÇ ¿ÜÃø ´«°¡ÀÇ ÃÖ¼ÒÀý°³¸¦ ÅëÇØ¼­  
ÇÇºÎ»Ó¸¸¾Æ´Ï¶ó ÇÇºÎ¹Ø ±ÙÀ°À» ´ç°ÜÁÖ¾î ´«¹Ø ÀÜÁÖ¸§À» È¿°úÀûÀ¸·Î °³¼±½ÃÅ³¼ö ÀÖ½À´Ï´Ù. 

¶ÇÇÑ ÇÏ¾È°Ë¼ö¼úÃ³·³ ´«½ç¹Ø Àý°³°¡ ±æ°Ô µé¾î°¡Áö ¾ÊÀ¸¹Ç·Î ¾È°Ë¿Ü¹ÝÁõ(´«²¨Ç®µÚÁý¾îÁü)µîÀÌ ¾ø°í,  
¾Ö±³»ìÀ» º¸Á¸ ¶Ç´Â º¸´Ù °­Á¶½ÃÅ³¼ö ÀÖ´Â°ÍÀÌ ÀÌ ¼ö¼úÀÇ ÀåÁ¡ÀÔ´Ï´Ù. 

¶ÇÇÑ ÀÎ»óÀÌ Å©°Ô º¯ÇÏÁö ¾Ê°í ´«²¿¸®°¡ ¿Ã¶ó°£´Ù´øÁö ³»·Á°£´Ù´øÁö ÇÏ´Â ºÎÀÛ¿ëµµ ¾ø´Â°ÍÀÌ Æ¯Â¡ÀÔ´Ï´Ù. 
´«¹Ø Áö¹æÀº Áö¹æ³ª¿ÂÁ¤µµ, ´«¹°°í¶ûÀÇ ÆÐÀÎÁ¤µµ¸¦ ºÁ¼­ Áö¹æÁ¦°Å ¶Ç´Â Àç¹èÄ¡¸¦ °áÁ¤ÇÏ°Ô µË´Ï´Ù. 
¿Ü¾È°¢°íÁ¤¼ú+´«¹ØÁö¹æÁ¦°Å/Àç¹èÄ¡¹ýÀº Å©°Ô ÀÎ»óÀÌ ¹Ù²îÁö ¾ÊÀ¸¸é¼­ 
´«¹ØÀÇ ÀÜÁÖ¸§ ¹Ø º¼·ÏÇÑ Áö¹æÀ» È¿°úÀûÀ¸·Î Á¦°ÅÇÒ¼ö ÀÖÀ¸¹Ç·Î 
¼ö¼úÈÄ ¹Ýµå½Ã ¸¸Á·ÇÏ½Ç°ÍÀÌ¸ç, ´õ ¾î»öÇØÁö°Å³ª ±×·² ¿°·Á´Â ÇÏÁö ¾ÊÀ¸¼Åµµ µË´Ï´Ù. 
¼ö¼ú½Ã°£Àº 1½Ã°£~1½Ã°£ ¹ÝÁ¤µµ ¼Ò¿äµÇ¸ç, ¼ö¼úÈÄ º×±â´Â °³ÀÎÂ÷°¡ ÀÖÁö¸¸ 
4~6ÀÏÁ¤µµ¸é °¡¶ó¾É°í ½Ç¹äÁ¦°Å°¡ 6~7ÀÏ¿¡ ÀÌ·ç¾îÁö¹Ç·Î ÀÏÁÖÀÏÈÄ¸é »çÈ¸/Á÷Àå»ýÈ°ÀÌ °¡´ÉÇÕ´Ï´Ù. 
-------------------------------------------------------------------------------------------------------- 

- ´õºí·Î¸®ÇÁÆÃ: ÃÊÀ½ÆÄ ·¹ÀÌÀú¸¦ »ç¿ëÇÏ¿© ½Ã¼úÇÔ 
- ¿Ü¾È°¢ °íÁ¤¼ú 
==============================================================================================================

- ½Ö²¨Ç® ¼ö¼ú 
¸Å¸ô¹ý-Àý°³¹ý-ÀÚ¿¬À¯Âø¹ý µî ¾î¶² ¹æ¹ýÀÇ [½Ö²¨Ç®]·Î ½Ã¼úÇÒÁö Àü¹®ÀÇ¿Í ÃæºÐÇÑ »óÀÇ¸¦ ÅëÇØ °èÈ¹ÇÏ´Â °ÍÀÌ Áß¿äÇÏ´Ù. 
-------------------------------------------------------------------------------------------------------------------- 

- ¼ºÇü¿Ü°ú(½Ö²¨Ç® ¼ö¼ú) 
1. º» Å¬¸®´Ð(http://cafe.naver.com/allaboutbeauty1/216101): °­³²±¸ ³íÇöµ¿ 17-5 ±Øµ¿¾ÆÀÌµð¾Øµðºôµù 3F, ¢Ï1599-0966 
¸Å¸ô¹ý+¾ÕÆ®ÀÓ+µÚÆ®ÀÓ ==> 129¸¸¿ø --> ¸Å¸ô¹ý(ÀÚ¿¬½º·¯¿ò): 39¸¸¿ø, Àý°³¹ý:(½Ã¿ø, ¼±¸í): 100¸¸¿ø, ¼­ÃÊ03¹ø 
2. ±×·£µå ¼ºÇü¿Ü°ú(http://www.grandsurgery.com), ¼­ÃÊ±¸ ¼­ÃÊµ¿ 1306-8 ´ëµ¿ºôµù 13Ãþ, ¢Ï1588-5153 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.04(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:05 ~ 18:00 --> olleh KB±¹¹ÎÄ«µå ¹ß±Þ, ¼ö·É 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.05(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 
---> 07:00 ~ 21:00 --> ´çÁ÷ 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

- message ¼­¹ö ·Î±× ÆÄÀÏ GLD º¹»ç ÈÄ »èÁ¦ Ã³¸® 
1. GLD¿¡¼­ ÀÛ¾÷ @@@ 
(connect)chatonop@ip-10-132-5-204:~/msg/log/pew1ms006m$ alias pew1ms006m 
alias pew1ms006m='ssh -i /home/chatonop/keys/pd.eu.pem -o StrictHostKeyChecking=no -p 2022      chaton@*.com' 
(connect)chatonop@ip-10-132-5-204:~/msg/log/pew1ms006m$ scp -i /home/chatonop/keys/pd.eu.pem 
-o StrictHostKeyChecking=no -P 2022 chaton@*.com:/mnt/log/Chaton_message_server.20130306.log /home/chatonop/msg/log/pew1ms006m 
===> GLD¿¡¼­ pew1ms006m ¼­¹öÀÇ /mnt/log/Chaton_message_server.20130306.log ÆÄÀÏÀ» º¹»çÇØ¿È @@@  
Chaton_message_server.20130306.log                             2%  528MB   7.1MB/s   40:06 ETA  ===> ÀÛ¾÷ Áß..... @@@ 
  
2. pew1ms006m ¼­¹ö¿¡¼­ ÀÛ¾÷ @@@ 
(connect)chatonop@ip-10-132-5-204:~/msg/log/pew1ms006m$ pew1ms006m 
chaton@ip-10-62-45-185:~/msg/log$ cd /home/chaton/msg/log 
chaton@ip-10-62-45-185:~/msg/log$ ls ===> Chaton_message_server.20130306.log(º¹»çÇÒ ÆÄÀÏ È®ÀÎ) 
-rw-r--r-- 1 chaton chaton 18556689427 2013-03-06 23:59 Chaton_message_server.20130306.log 
chaton@ip-10-62-45-185:~/msg/log$ rm Chaton_message_server.20130306.log   ===> »èÁ¦ Ã³¸®(GLD¿¡ º¹»ç ¼º°øÇß´Â Áö È®ÀÎ ÈÄ »èÁ¦ÇÒ °Í) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.06(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:00 ~ 18:00 

¢ËÁ¶±âÃà±¸
06:00 ±â»ó 
06:20 ±¹¹ÎÀºÇà ºÀÃµµ¿ÁöÁ¡ ¾Õ(ÅÂÈÆÀÌÇü Â÷) 
06:50 ½Å±¸ÃÊµîÇÐ±³ ==> ºñ¿Í¼­ Ãà±¸ ¾È ÇÔ 
08:00 Á¾·á 
08:20 Á¶½Ä(È­Á¤½Ä´ç: ´ß°õÅÁ): ¿µ¼®ÀÌÇü, º´±ÔÇüÀÌ ½ô 
09:00 Á¾·á 
09:30 ÀÌÁö¾Ø ¼ºÇü¿Ü°ú(10½Ã) ¹æ¹® 
      - ´«¹Ø ÁÖ¸§ ¼ö¼ú ºñ¿ë: ÇÏ¾È°Ë(200), ´«¹Ø ÇÊ·¯((150), ´«¸Å±³Á¤[½Ö²¨Ç®](200) ==> 590¸¸¿ø(³Ê¹« ºñ½Ó) 
10:30 ÀÌ¸¶Æ® Àåº¸±â  
       - ÁÖÀüÀÚ, ¹ßÆÇ, »þ¿ö Å¸¿Ã, ÃÊÄÚÆÄÀÌ 
13:00 ±Í°¡  
19:00 ¼®½Ä 
21:00 ·ç¿º(ºÎÀÎ)°ú È­»óÅëÈ­(¾ÈµÊ) 
24:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.07(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 

¢ËÁ¶±âÃà±¸
06:00 ±â»ó  
06:20 ±¹¹ÎÀºÇà ºÀÃµµ¿ÁöÁ¡ ¾Õ(ÅÂÈÆÀÌÇü Â÷) 
07:10 ½Å±¸ÃÊµîÇÐ±³ 
07:30 ¼ô°ÔÀÓ(3:3 ¹«) 
09:30 °ÔÀÓ(2:0 ÆÐ) ==> ÇÁ·»Áî ¿¬¾ÖÀÎ Ãà±¸´Ü(¹èµµÈ¯ ´ÜÀå) 
10:00 °ÔÀÓ(2:0 ÆÐ): °ñ±âÆÛ 
11:20 °ÔÀÓ(2:2 ¹«) 
12:00 Á¾·á  
12:20 Áß½Ä(¹®°æ¼¼Àç: °¥ºñÅÁ): ¸¸¿ø ³¿ 
12:30 Á¾·á 
14:00 ±Í°¡  
21:00 ·ç¿º(ºÎÀÎ)°ú È­»óÅëÈ­ 
22:00 TV ½ÃÃ»(°³±×ÄÜ¼­Æ®) 
24:20 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.08(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

- ÁÖ¹Î¼¾ÅÍ(¼­·ù ¹ß±Þ) ==> ÀÎÅÍ³Ý¹ß±Þ(¹«·á) 
1. °¡Á·°ü°èÁõ¸í¼­(2Åë) 
2. È¥ÀÎ°ü°èÁõ¸í¼­(2Åë) 
------------------------------------------------------------------------------------------------------------------ 
- Ã³À½ ¿Ü±¹ÀÎ µî·ÏÁõ ½ÅÃ»½Ã 
1. ¿©±Ç¿øº» 
2. ¿©±Ç»çÁø(Å©±â: 3.5 * 4.5 cm) 
3. È¥ÀÎ°ü°èÁõ¸í¼­ 
4. ½Å¶û ÁÖ¹Îµî·Ïµîº» 
5. ¼ö¼ö·á: 40,000¿ø 
6. ½ÅºÎ ¿Ü±¹ÀÎ µî·Ï È®ÀÎ¼­(»ç½ÇÈ®ÀÎ¼­): ÃâÀÔ±¹ °ü¸®»ç¹«¼Ò ==> ÀÇ·áº¸Çè¿¡ µîÀç ¸ñÀû 
------------------------------------------------------------------------------------------------------------------ 

- ¼­¿ï ÃâÀÔ±¹°ü¸®»ç¹«¼Ò 
1. º»»ç, T. 02-2650-6212, ¼­¿ï ¾çÃµ±¸ ¸ñµ¿µ¿·Î 151 
2. ¼¼Á¾·ÎÃâÀå¼Ò, T. 02-732-6220, ¼­¿ï½Ã Á¾·Î±¸ »ïÀÏ·Î 12 (°æ¿îµ¿ 89-4) ¿îÇö±Ã SKÇãºêºôµù 2Ãþ   
3. ½ÃÃ»ºÐ¼Ò, T. 02-723-3208, ¼­¿ï ÇÁ·¹½º¼¾ÅÍ 3Ãþ 
==============================================================================================================

- °¡Á·°ü°èÁõ¸í¼­ ÀÎÅÍ³Ý¹ß±Þ(¹«·á) 
1. http://efamily.scourt.go.kr ===> º»ÀÎ È®ÀÎÀ» À§ÇÑ Ãß°¡ Á¤º¸ ÀÔ·Â¿¡¼­ µî·Ï±âÁØÁö¸¦ ¼±ÅÃÇÒ °Í(±â¸²·Î·Î Á¶È¸) 
2. µî·Ï±âÁØÁö: [790-901]°æºÏ Æ÷Ç×½Ã ³²±¸ ¿ÀÃµÀ¾ ±â¸²·Î 1392¹ø±æ 138[°æºÏ Æ÷Ç×½Ã ³²±¸ ÁøÀü¸® 16] 
http://blog.naver.com/koreacute100?Redirect=Log&logNo=60176836180 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.09(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:05 ~ 18:00 

- ChatON ¿î¿µ Prj
- WorkFlow ¸µÅ© °É±â 
1. ppt ÆÄÀÏ¿¡¼­ excel ÆÄÀÏ·Î ¸µÅ© °É±â 
2. ppt ÆÄÀÏ¿¡¼­ excel ÆÄÀÏ ¼¿·Î ¸µÅ© °É±â 
------------------------------------------------------------------------------------------------------------------ 

- ppt ÆÄÀÏ¿¡¼­ excel ÆÄÀÏ ¼¿·Î ÀÌµ¿ 
1. ppt ÆÄÀÏ¿¡¼­ ¸µÅ©¸¦ °É Text ¹Ú½º(¿ì Å¬¸¯) ==> ÇÏÀÌÆÛ ¸µÅ©(H): ChatON_sv_1.5.%20Trunk_Query.xlsx#Service!C5 
2. Text ¹Ú½º(Å¬¸¯) ==> ChatON_sv_1.5.%20Trunk_Query.xlsx ÆÄÀÏÀÇ Service ÅÇ > C5¼¿·Î ÀÌµ¿ÇÔ 
==============================================================================================================

- Privacy-i Ã¼Å©, °á°ú Àü¼Û 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.10(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:50 ~ 18:00 --> ¹®¼öÇö ¼±ÀÓ ¼ö¿ø 3ÁÖ ÃâÀå(Ãª¿Â °íµµÈ­) 

- ChatON ¿î¿µ Prj
- WorkFlow ¸µÅ© °É±â(¹®¼öÇö ¼±ÀÓ ÀÛ¾÷ ¿µ¿ª) 
1. 3. Memo Management 
1.4. PostON Management 
1.12. Interaction Management 
1.13. Buddy Recommendation Management 
==============================================================================================================

- ¼ºÇü¿Ü°ú ¼ö¼ú ¿¹¾à(18½Ã) 
1. °¡°Ý 
 1) »ó¾È°Ë ¼ö¼ú(´« ´«½ç °Å»ó¼ú) + ¸Å¸ô¹ý: 140¸¸¿ø 
 2) ÇÏ¾È°Ë ¼ö¼ú: 150¸¸¿ø ===> ÃÑ ¼ö¼ú¾×: 290¸¸¿ø, Çö±Ý ÇÒÀÎ°¡: 250¸¸¿ø 
2. ¼ö¼ú ¿¹¾à 
 1) ÀÏ½Ã: 4¿ù 15ÀÏ(¿ù) 18½Ã 
 2) ¼ö¼ú ¿¹¾à±Ý: 50¸¸¿ø(Ä«µå °áÁ¦) 
3. »ó´ã 
 1) ÃÖÁ¤ÀÎ ½ÇÀå: *@*.* 
4. ¼ö¼ú ´ã´ç ¿øÀå: ±èµ¿°ü 
5. º´¿ø: º» Å¬¸®´Ð(http://cafe.naver.com/allaboutbeauty1/216101): °­³²±¸ ³íÇöµ¿ 17-5 ±Øµ¿ºôµù 3F, ¢Ï1599-0966 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.11(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:50 ~ 21:00 --> ´çÁ÷ 

- ChatON ¿î¿µ Prj
- 1.7. Trunk Item Comment ¼Ò½º ºÐ¼®(·ÎÁ÷, DB Å×ÀÌºí ¿¬°ü¼º ºÐ¼®) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.12(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 18:00 --> ½ÅºÎ º£Æ®³² Ãâ¹ß(23½Ã) 

- ChatON ¿î¿µ Prj
- ChatON Deploy Á¡°Ë 
1. warÆÄÀÏ cahtonop°èÁ¤ Æú´õ·Î º¹»ç 
:~$ scp -P22 {path/warÆÄÀÏ} chatonop@10.132.5.204:~/war/sv 
:~$ scp -P22 /home/chatonop/ChatON_Service_Server-v2.1.1-rc0312.war chatonop@10.132.5.204:~/war/sv 

2. warÆÄÀÏ °¢ Áö¿ª¼­¹ö·Î º¹»ç 
:~$ cd /home/chatonop/war/sv 
:~$ ./deploy.sh ChatON_Service_Server-v2.1.1-rc0312.war all 

3. ¼­ºñ½º ¸ðµâ ¹èÆ÷ ´ã´ç: ÃÖ»ó¶ô ¼±ÀÓ(¹Ìµð¿À ¼Ö·ç¼± ¼¾ÅÍ ¼Ö·ç¼Ç°³¹ß 2ÆÀ), sr80.*@*.* 
==============================================================================================================

- ºÐ±âº° ÁÖ¸» ±Ù¹« 
1. ÀÏÀÚ: 4¿ù(27ÀÏ, 28ÀÏ), 7¿ù, 10¿ù ¸¶Áö¸· ÁÖ¸» 
2. Àå¼Ò: »óÈ²½Ç ±Ù¹« 
==============================================================================================================
  
- ¼­¿ï °ü¾Ç ¿ìÃ¼±¹(½Å¸²¿ª 8¹ø Ãâ±¸) 
1. ¼­¿ï °ü¾Ç±¸ ½Å¸²µ¿ 1412-2 3Ãþ, ¢Ï 889-0014 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.13(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 18:00 

- ½ÅºÎ ÀÔ±¹
02:00 ¿°»ö(¹ã»ù) 
04:00 Áý Ãâ¹ß 
04:10 °øÇ×¹ö½º Á¤·ùÀå(¼­¿ï´ëÀÔ±¸¿ª) 
04:37 6003¹ø °øÇ×¹ö½º Å¾½Â 
06:00 ÀÎÃµ°øÇ× µµÂø 
06:10 1Ãþ E °ÔÀÌÆ®(·ç¿º, ÀÀ¾Æ, ÇÁ¾û µµÂøÇØ ÀÖ¾úÀ½): °¡¿ø ¸Å´ÏÀú´Ô, À±»çÀå´Ô 
06:30 À±»çÀå´Ô Â÷·Î ÅÂ¿öÁÜ 
07:30 »õ¹®ºô¶ó µµÂø  
07:50 Ä¿ÇÇ 
08:20 °¡¿ø ¸Å´ÏÀú´Ô, À±»çÀå´Ô µ¹¾Æ°¨ 
09:00 ³·Àá 
16:00 ±â»ó 
16:20 ½ÅºÎ Áõ¸í »çÁø(¼­¿ï´ëÀÔ±¸¿ª): 8Àå¿¡ ¸¸¿ø 
17:00 ±â»ó 
18:00 º£Æ®³² °¡Á·(Àå¸ð´Ô, ÀåÀÎ¾î¸¥, ÇÒ¾Æ¹öÁö, ÇÒ¸Ó´Ï)¿Í ¾ßÈÄ È­»óÅëÈ­  
20:00 ÀÔ±¹ ÃàÇÏ ÆÄÆ¼(ÄÉŸå Àý´Ü) 
23:20 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.14(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 

¢ËÁ¶±âÃà±¸
06:00 ±â»ó(ºñ Á¶±Ý ¿È) 
06:40 ±¹¹ÎÀºÇà ºÀÃµµ¿ÁöÁ¡ ¾Õ(ÅÂÈÆÀÌÇü Â÷): ·ç¿º µ¥¸®°í °¨ 
07:10 ½Å±¸ÃÊµîÇÐ±³(¼öÀÎÀÌÇüÀÌ ½ÅºÎ ÀÔ±¹ ±â³äÀ¸·Î Ä¿ÇÇ, »§ »çÁÜ) ==> ³¯ÀÌ Ãß¿ö¼­ ½ÅºÎ °¨±â °É¸±±îºÁ °ÆÁ¤ 
07:30 ¼ô°ÔÀÓ(3:3 ¹«) 
09:30 °ÔÀÓ(5:5 ¹«)  
11:20 °ÔÀÓ(4:2 ½Â) 
10:40 Á¾·á  
11:10 Áß½Ä(¹®°æ¼¼Àç: °¥ºñÅÁ): ÇÑ»óºÀ È¸Àå´ÔÀÌ ³ª¿Í ½ÅºÎ ½Ä´ë ´ë½Å ³»ÁÜ 
12:10 Á¾·á 
12:20 ÅÂÈÆÀÌÇü Â÷Å¸°í ³»¸®ÀÚ ¸»ÀÚ ¿À¹ÙÀÌÆ® ÇÔ 
12:30 ±Í°¡ 
14:00 ³·Àá 
16:00 ´ëÈ£ ¸¶Æ®¿¡ °¡¼­ ±è¹ä »ç¿È 
18:00 ±è¹ä ¸¸µé±â(¶±¹äÀÌ µÇ¾î¼­ ±è¹ä 2ÀåÀ¸·Î ½Î¼­ ¸ÔÀ½) 
21:00 º£Æ®³² °¡Á·°ú È­»óÅëÈ­ 
24:20 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.15(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 --> ÈÞ°¡ 

- ½ÅºÎ ÀÔ±¹3
07:00 ±â»ó 
08:00 Áý Ãâ¹ß 
08:10 ºÀ¿øÁß(650¹ø ¹ö½º) 
08:50 ¸ñµ¿¿ª(7´ÜÁö ¾Õ) ÇÏÂ÷: ½ÅºÎ ¿À¹ÙÀÌÆ® ÇÔ 
09:20 ¼­¿ï ÃâÀÔ±¹°ü¸®¼Ò µµÂø(¿Ü±¹ÀÎµî·ÏÁõ ¾÷¹« Ã³¸®) 
09:20 1Ãþ ¾÷¹«[¿©±Ç ¿øº», »çÁø, È¥ÀÎ°ü°èÁõ¸í¼­, ÁÖ¹Îµî·Ïµîº»(¹è¿ìÀÚ), ½Å¿øº¸Áõ¼­(¹è¿ìÀÚ) Á¦Ãâ]
09:30 3Ãþ ¾÷¹«[¼öÀÔÀÎÁö ±¸ÀÔ(2¸¸¿ø), ¿©±Ç, ºñÀÚ º¹»ç(200¿ø)] 
09:40 2Ãþ ¾÷¹«[¿Ü±¹ÀÎµî·ÏÁõ ¼ö¼ö·á(2¸¸¿ø), ÅÃ¹è(4Ãµ¿ø) ½ÅÃ»])  
09:50 1Ãþ ¾÷¹«[Ã³¸® ¾÷¹« È®ÀÎÁõ Á¦Ãâ, ½ÅºÎ Áö¹® µî·Ï] ==> ¿Ï·á(2ÁÖÁ¤µµ ¼Ò¿ä) 
10:20 ÀÌ¸¶Æ®(¸ñµ¿Á¡) ¼îÇÎ 
10:20 ½ÅºÎ ¿Ê, Áö°©, ¸ðÀÚ, À½½Ä µî(28¸¸¿ø »ó´ç) ==> ¹Ú½º 2°³¿¡ ½Î¼­ °¡Á®¿È
14:00 ¹ö½º
14:00 »õ¹®ºô¶ó µµÂø ==> ½ÅºÎ ¿À¹ÙÀÌÆ® ÇÏ·Á°í ÇÔ(¸ÔÀº°Ô ¾ø¾î¼­ °ÅÀÇ ¾ÈÇÔ) 
15:00 ½ÅºÎ Ä£Ã´¿¡°Ô ÅÃ¹è º¸³¿(Çà¿îµ¿ ¿ìÃ¼±¹): ¸¸ Ãµ 400¿ø ==> ½ÅºÎ°¡ º£Æ®³²¿¡¼­ ºÎÅ¹¹ÞÀº ¹°°Ç 
1. ¸¶ÀÌ(»çÃÌ ¾ð´Ï): ¼­¿ï½Ã °­¼­±¸  ¹æÈ­1 µ¿  179 _27   1 Ãþ , H) 010  5090 4955 
2. ÇÁ¾û(Ä£±¸): °æ±âµµ ³²¾çÁÖ½Ã È­µµÀ¾ Ã¢Çö¸® µÎ»ê2Â÷ ¾ÆÆÄÆ® 202µ¿ 1803È£  
3. ²Ù¿£(»çÃÌ µ¿»ý): ºÎ»ê½Ã ³²±¸ ¿ëÈ£µ¿ 38~11 °æº¸°ñµç 101È£ 
16:00 °ü¾Ç±¸ ´Ù¹®È­¼¾ÅÍ ¹æ¹®(5~6¿ù´Þ ¹æ¹® ±³À° ½ÅÃ») ==> ½ÅºÎ¶û ÀÚÀü°Å 
16:40 ±Í°¡ 
17:10 ±¹¹Î°Ç°­º¸Çè°ø´Ü °­³²¼­ºÎÁö»ç ¹æ¹®(¿Ü±¹ÀÎµî·ÏÁõÀÌ ÀÖ¾î¾ß ÇÇºÎ¾çÀÚ µî·ÏÀÌ °¡´É) 
17:40 º» Å¬¸®´Ð µµÂø
18:00 ´« ¼ºÇü(»ó¾È°Ë, ÇÏ¾È°Ë): º» Å¬¸®´Ð 
20:20 ±â»ó(¼ö¼ú ³¡³²) 
21:20 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.16(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:40 ~ 18:00 --> ¼ö¼ú ÈÄ ´«¹°ÀÌ ¸¹ÀÌ °í¿©¼­ ¸ð´ÏÅÍ º¸±â Èûµë, Åð±Ù ÈÄ Áý¿¡ °¡´Ï ½ÅºÎ°¡ ±è¹ä ÇØ³õ°í ±â´Ù¸² 

- ChatON ¿î¿µ Prj
- ChatON Deploy Á¡°Ë 

1. W16 Á¤±â¹èÆ÷ °ü·Ã »çÀü È®ÀÎ ¿äÃ» »çÇ× 
/home/chatonop/war/sv/service-dsv-v2.1.3-rc04100.war 
==============================================================================================================

- Àü¼¼±Ý È¸¼ö È®ÀÎ 
1. ºÀÃµµ¿ 106-23 101È£ Á¤Æò¼ø ÁÖÀÎÀÌ 970¸¸¿ø ¼Û±Ý ¿Ï·á(°Å·¡ ³¡) 
2. 30¸¸¿ø ºÎµ¿»ê ¼ö¼ö·á 
==============================================================================================================

- ÈÞ´ëÆù ½ÅÃ» ¹× µµÂø(½Å±Ô(·ç¿º ¼±¹°): U+) 
1. ½ÅÃ»ÀÏ: 2013.04.15(¿ù) --> Á¤È«ÀÌÇÑÅ×¼­ ÇÔ 
2. ÅÃ¹è µµÂøÀÏ:2013.04.16(È­) 12:00(LTEÆùÀÌ¶ó ÀÚµ¿ µî·ÏµÊ ==> ¹Ù·Î »ç¿ë)  
-----------------------------------------------------------------------------------------------------------------------------

- »ï¼º °¶·°½Ã R style(SHW-M250L) ÈÞ´ëÆù »ç¾ç(Á¤È«ÀÌ¿¡°Ô ÁÖ¹®, ·ç¿º¿¡°Ô ¼±¹°)  
1. CPU: ½º³Àµå·¡°ïs4 1.5GHz µà¾óÄÚ¾î 
2. RAM: 1GB  
3. OS: ¾Èµå·ÎÀÌµå4.0(¾ÆÀÌ½ºÅ©¸² »÷µåÀ§Ä¡) 
4. Å©±â: 66.1 x 125.3 x 9.4(mm)  
5. ¹«°Ô: 116g 
6. ³»Àå¸Þ¸ð¸®: 16GB (13.7GB »ç¿ë°¡´É)  
7. ¿ÜÀå¸Þ¸ð¸®: MicroSD, MicroSDHC, TransFlash(ÃÖ´ë 32GB)  
8. ¹èÅÍ¸®: 2000mAh  
9. Ä«¸Þ¶ó: Àü¸é 130¸¸ È­¼Ò (2M), ÈÄ¸é500¸¸ È­¼Ò (8M), 1080p ºñµð¿À ³ìÈ­  
10. µð½ºÇÃ·¹ÀÌ: 4.3ÀÎÄ¡ (960*540) Super ¾Æ¸ô·¹µå 
11. ÇØ»óµµ: 960 * 540  
12. ±âÅ¸: GPS, WIFI, ¿µ»óÅëÈ­, WIFI ´ÙÀÌ·ºÆ®, DLNA, ºí·çÅõ½º 3.0, 2011³â 5¿ù Ãâ½Ã µî  
-----------------------------------------------------------------------------------------------------------------------------

- »ï¼º °¶·°½Ã R style Á¤º¸ 
1. ¸ðµ¨¸í: SHW-M250L  
2. S/N: R18B458049  
3. ÀÏ·Ã¹øÈ£: 016902  
4. Á¦Á¶³â¿ù: 2011.04.27  
5. ÈÞ´ëÆù ºñ¹Ð¹øÈ£: mmm*  
6. »ï¼º°èÁ¤ µî·Ï: *@*.*/ta**3*9  
7. IMEI(International Mobile Equipment Identity): ÀÌµ¿ÀüÈ­ ´Ü¸»±â¸¦ Ãâ°íÇÒ ¶§ Á¦Á¶»ç°¡ ºÎ¿©ÇÏ´Â ´Ü¸»±â ±¹Á¦°íÀ¯  
½Äº°¹øÈ£. 
-----------------------------------------------------------------------------------------------------------------------------

- ·ç¿º gmail »ý¼º 
1. *@*.*, sspeim339 
==============================================================================================================

- »ï¼º °¶·°½Ã R style ¾àÁ¤ 
1. ÇÒºÎ¿ø±Ý/ÇÒºÎ°³¿ù: 213,068¿ø/24°³¿ù(¿ù: 9,625¿ø) ==> °¡ÀÔºñ ¸éÁ¦ 
2, ¿ä±ÝÁ¦: LTE 34(¿ù: 37,400¿ø)  ==> ÃÑ ¿ù³³ÀÔ¾×: 39,325¿ø 
3. USIM: 8,800¿ø(ÀÍÀÏ ¿ä±Ý ÇÕ»ê Ã»±¸) 
4. 3°³¿ù ºÎ°¡ ¼­ºñ½º: Á¤È«ÀÌ°¡ ´ë½Å ³³ºÎÇØÁØ´Ù°í ÇÔ ===> 3°³¿ù ÈÄ ÇØÁöÇÒ °Í 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.17(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 
---> 08:20 ~ 18:00 

- ChatON ¿î¿µ Prj
- ChatON Deploy Á¡°Ë
1. W16 Á¤±â¹èÆ÷ °ü·Ã »çÀü È®ÀÎ ¿äÃ» »çÇ×  
==============================================================================================================

- ÇÑÈ­»ý¸í º¸Çè ¾à°ü ´ëÃâ ÀÏºÎ »óÈ¯ 
1. º¸Çè ¾à°ü ´ãº¸ ´ëÃâ(ÇÑÈ­»ý¸í): 14,000,000¿ø[ÇÑÈ­»ý¸í ½ºÅ¸BRANCH Á÷Á¢ ¹æ¹®] ==> 2¿ù 25ÀÏ(¿ù) 
2. ÀÏºÎ »óÈ¯: 5,000,000¿ø(ÀÌÀÚ47,907¿ø ³³ºÎ) ==> 900¸¸¿ø ³²À½(ÀÌÀÚ: ¿ù 39,945¿ø) 
==============================================================================================================

- °æÁÖ ÄÚ¿À·Õ È£ÅÚ ¿¹¾à  
 1. °æÁÖÄÚ¿À·ÕÈ£ÅÚ[1. ½ºÅÄ´Ùµå(·ë¿Â´Ï)]: ½ÅÈ¥¿©Çà 
 2. ¼÷¹Ú: 2013.05.05 ~05-06(2¹Ú 3ÀÏ) ==> 158,400¿ø 
==============================================================================================================
  
- U+zone(LG U+ WIFI)(ÁöÇÏÃ¶¿¡¼­ ÀÌ¿ë °¡´É) 
1. U+zone: tamario@upluszone/z31ntcq332 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.18(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:15 ~ 18:00 --> ´« ¼ºÇü ¹ÝÃ¢°í ¶À, W16 Á¤±â¹èÆ÷(23½Ã) 

- ChatON ¿î¿µ Prj
- ChatON Deploy Á¡°Ë 
1. W16 Á¤±â¹èÆ÷ °ü·Ã »çÀü È®ÀÎ ¿äÃ» »çÇ×   
- Rollback Plan  
1. Service ¼­¹ö: ¹®Á¦ ¹ß»ý ½Ã ÀÌÀü ¹öÀü WAR·Î Àç Deploy 
# ~/service/bin/stop.sh 
# cp ~/war/service-dsv-v2.1.3-rc03270.war ~/ 
# ~/service/bin/de.sh 
==============================================================================================================

- Service º¯°æ ÀÛ¾÷ ³»¿ª(µðÇÃ·ÎÀÌ ÈÄ Àû¿ë) 
1. Áø´Ü TF¿¡¼­ ³ª¿Â DB ÀÎµ¦½º º¯°æ (COSERV-523) 
2. ±âÁ¸ Set Compatibility API¿¡ br2 ¼Ó¼º Ãß°¡ (COSERV-504) 
3. Trunk DAO ¿¡¼­ ENC Á¦°Å (COSERV-512) 
4. SNS Friend ÃßÃµ API¿¡ RenRen Ãß°¡ (COSERV-527) 
==============================================================================================================

- Áß°£Á¢¼Ó gateway OTP Àû¿ë °Ç 
1. URL: https://www.google.com/chart?chs=200x200&chld=M0&cht=qr&chl=otpauth://totp/chatonop@ip-10-132-5-204%3Fsecret%3D4SWQJ5AXWDUOKZU7 
2. Secret Key: 4SWQJ5AXWDUOKZU7 

- Google OTP(¹ÙÄÚµå ½ºÄµ) 
chatonop@ip-10-132-5-204 ==> 579134[1ºÐ ¸¶´Ù º¯°æµÊ] 

- ÅÍ¹Ì³Î¿¡ ÀÔ·Â 
1. ÇØ´ç °èÁ¤(chatonop)À¸·Î Á¢¼Ó ½Ã, id/pw¸¦ ÀÔ·Â ÇÑ ÈÄ 
2. ´Ü¸»¿¡ Ç¥½ÃµÇ´Â ÀÎÁõ°ªÀ» ¡®verification code:¡¯ ¿¡ ÀÔ·Â ÇÏ¸é Á¢¼Ó ==> verification code:: 579134 
==============================================================================================================

- º¸¾È±³À°(15½Ã) 
1. Àå¼Ò: 7Ãþ 2È¸ÀÇ½Ç 
2. ÀÏ½Ã: 4¿ù 18ÀÏ(¸ñ) 15½Ã 
3. ³»¿ë 
[Series_1] »ç¾÷¼öÇà½Ã PC º¸¾È°ü¸® 
- PC´Â °³ÀÎ ¼ÒÀ¯°¡ ¾Æ´Ñ ÆÄÆ®³ÊÞä ¼ÒÀ¯ ÀÚ»êÀ» ÀÌ¿ë 
- ÇÊ¼ö º¸¾È¼Ö·ç¼ÇÀ» ¹Ýµå½Ã ¼³Ä¡ 
[Series_4] »ç¾÷¼öÇà½Ã ¹®¼­ º¸¾È°ü¸® 
- °³ÀÎ PC Ò® º¸°üÀ» ÃÖ¼ÒÈ­, ¾÷¹«°ü·Ã¹®¼­´Â ¹Ýµå½Ã °í°´»ç ½ÂÀÎ ý­ ¹ÝÃâ 
[Series_5] »ç¾÷¼öÇà½Ã ÃâÀÔ º¸¾È°ü¸® 
- º»ÀÎ¿¡°Ô ÀÎ°¡µÈ ±¸¿ª¸¸À» ÃâÀÔ 
[Series_6] »ç¾÷¼öÇà½Ã ÀÎÅÍ³Ý º¸¾È°ü¸® 
- ¾÷¹«¿Í °ü·Ã¾ø´Â »çÀÌÆ®´Â Á¢¼ÓÀ» ÀÚÁ¦ 
[Series_7] ÆÄÆ®³Ê»ç º¸¾ÈÀ§±Ô ÇöÈ² 
- ÀüÃ¼ À§±Ôñé 43%´Â ÆÄÆ®³Ê»ç ÀÎ·Â¿¡ ÀÇÇÑ ËìÀ¸·Î Áý°è 
[Series_8] APT°ø°Ý ÁÖÀÇ ¾È³» 
- APT(Advanced Persistent Threat)°ø°ÝÀÌ¶õ? Æ¯Á¤ ±â¾÷ÀÇ ³×Æ®¿öÅ© Ä§Åõ ý­ Àå±â°£ Àº¹ÐÇÏ°Ô ±â¹ÐÁ¤º¸¸¦ »©³»°¡´Â ±â¹ý 
- ºÒ¹ý ¼ÒÇÁÆ®¿þ¾î ¹× Ú±ÀÎÁõµÈ ¼ÒÇÁÆ®¿þ¾î »ç¿ë±ÝÁö 
- ÃâÃ³°¡ ºÒºÐ¸íÇÑ ¸ÞÀÏÀº °³ºÀÇÏÁö ¾Ê°í »èÁ¦ÇÏ±â 
- ¹é½Å SW ´Â ½Ç½Ã°£ °¨½Ã¸¦ ¼³Á¤ÇÏ¿© ¾Ç¼ºÄÚµå °¨¿° ¿¹¹æÇÏ±â 
==============================================================================================================

- [»÷µð½ºÅ©Class4] Micro SDHC 32G[Á¤Ç°](¸®´õ±â Æ÷ÇÔ), 34,000¿ø 
http://itempage3.auction.co.kr/DetailviewContainer.aspx?ItemNo=A503256587&frm3=V2 
==============================================================================================================
  
- ÇÑ±¹¾î ±³À° 
1. º£Æ®³²¿©¼º¹®È­¼¾ÅÍ( http://www.vwcc.co.kr ) 
2. http://e-campaign.kdu.edu 
==============================================================================================================

- ¹«·á ±¹Á¦ÀüÈ­ ¾îÇÃ((±¹Á¦ÀüÈ­¸¦ ±¹³»ÅëÈ­·á·Î »ç¿ë) 
1. ¿À¼ÇÄÝ, ANET, bob, oto, Gcall, SK¹«·á±¹Á¦ÀüÈ­ 
==============================================================================================================

- 01. °áÈ¥ ¹ÝÁö ±¸ÀÔ 
1. 2Â÷ ½Å»ó Ãß¾ïÀÇ ´ÙÀÌ¾Æ Ä¿ÇÃ¸µ(18K, 1µ·), 435,000¿ø 
http://www.orodia.co.kr/shop/shopdetail.html?branduid=330357&xcode=030&mcode=003&scode=&type=X&search=&sort=order  
2. ¿ÀÇÁ¶óÀÎ ¿µ¾÷Àå: ¼­¿ï½Ã Á¾·Î±¸ ºÀÀÍµ¿ 157 »ï¼º±Í±Ý¼Ó»ó°¡ 12È£, T:745-1115, *, (ÁÖ)¿À·Î´ÙÀÌ¾Æ 
3. ¹ÝÁöÈ£¼ö ==> ³²: 17È£(61mm), ¿©:12È£(55mm) 
==============================================================================================================

- ³»¿ëÁõ¸í, ÀºÇà 
- °¶·°½Ã R ¾à°ü 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.19(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:00 ~ 21:00 --> µðÇÃ·ÎÀÌ ±Ù¹«ÀÚ ÈÞ¹« 

- ³ªµéÀÌ 
06:00 µðÇÁ·ÑÀÌ ÃÖÁ¾ ¿Ï·á 
06:40 Åð±Ù 
06:50 ÃëÄ§ 
12:00 ±â»ó 
12:20 Á¶½Ä 
13:00 ³ªµéÀÌ(½ÅºÎ¶û) 
14:00 ·ç¿º Á¤Àå(SI ½Å¸²Á¡): ±¸µÎ, ¸ñ°ÉÀÌ ==> ÃÑ 60¸¸¿ø(Çö±Ý°¡ 5% DC) 
15:00 º¸¶ó¸Å°ø¿ø  
17:30 ¼®½Ä(½Ò±¹¼ö(P4), ¸ðµëÁ¤½Ä: Æ÷¸ó½º¼­¿ï´ëÁ¡) ==> ÃÑ 24,500¿ø 
18:00 Á¤Àå(ÆÄÅ©·£µå): Y¼ÅÃ÷, ³ØÅ¸ÀÌ ÇÉ: 30%¼¼ÀÏ==> ÃÑ 55¸¸¿ø 
19:00 ±Í°¡ 
20:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.20(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:00 ~ 18:00 

- Çã¿ì¾¾Áý ¹æ¹® 
08:00 ±â»ó 
09:00 ¼®½Ä(»§) 
10:00 ÁýÃâ¹ß ==> ºñ ¾à°£ ¿È 
12:00 ÀÇÁ¤ºÎ¿ª(207¹ø ¸¶À»¹ö½º) 
12:20 Çã¿ì¾¾Áý µµÂø(À½·á¼ö: ¸¸¿ø) 
14:00 Áß½Ä(»ï°ã»ì: Çã¿ì¾¾Áý) 
15:10 Á¾·á(ÇØ¶ó¿¡°Ô ¿ëµ· ¸¸¿ø ÁÜ)  
15:30 ÂøÇÑ³«Áö(ÀÇÁ¤ºÎ ½Å°îÁ¡): Çã¿ì ½Å¶ûÀÌ ÅÂ¿ö ÁÜ 
18:00 ºª³² ½Å¶û ¸ðÀÓ(¿ë»ê »çÀå´Ô, »ó¾îÆÄÁÖ ºÎºÎ,  ¿Ü 2¸í ÇÕ·ù): È¸ºñ ÃÑ 21¸¸¿ø 
22:30 Á¾·á 
23:00 Á¾¹Î¾¾Áý µµÂø(ÀÀ¾Æ, ÇÁ¾û, ·ç¿º ºÎºÎ) 
23:30 ºñ¾îÄ³ºó(37,000¿ø): È¸ºñ·Î °è»ê 
24:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.21(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 

- ÁÖÁÖ°ø¿ø ³ªµéÀÌ
07:00 ±â»ó
07:20 ÇÁ¾û ºÎ¸ð´ÔÀÌ¶û È­»óÅëÈ­(µ¿Çö¾¾) 
10:50 ÁýÃâ¹ß 
11:15 ÀÏ»ê Ä®±¹¼ö ==> ¸¸ 5Ãµ¿ø 
12:00 ÁÖÁÖ°ø¿ø(½ÅºÎ ¿À¹ÙÀÌÆ® ÇÔ) ==> ÁÖÁÖµ¿¹°¿ø(ÀÔÀå·á+°ø¿¬1): 3¸¸¿ø(2ÀÎ) 
14:00 ¾Ç¾î °ø¿¬ 
16:00 Á¾·á 
16:20 ¹é¸¶¿ª(Çì¾îÁü) 
17:20 ±Í°¡ 
20:00 ¼®½Ä 
24:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.22(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:15 ~ 18:00 --> ´« ¼ºÇü ½Ç¹ä Ç®±â(º» Å¬¸®´Ð ¹æ¹®), Ã»Ã¸Àå ¼ö·É ¹× ¹èÆ÷ 

- ChatON ¿î¿µ Prj
- buddy ¾÷¹« ºÐ¼® 
1. buddy API Work Flow ºÐ¼® 
==============================================================================================================
  
- °íÁ¾ »çÃÌ(²Ù¿£ °áÈ¥½Ä) 
1. 5¿ù 19ÀÏ(ÀÏ) ºÎ»ê °æ¼º´ëÂÊ ¿©¼ºÈ¸°ü 12½Ã(ºÎ»ê½Ã ¿©¼ºÈ¸°ü: ºÎ»ê ³²±¸ ´ë¿¬µ¿ 38-5¹øÁö) 
2. ºÎ»ê¿ª(1È£¼±) ==> ¼­¸é¿ª(2È£¼±) ==> °æ¼º´ë¡¤ºÎ°æ´ë¿ª: 50ºÐ ¼Ò¿ä ==> ²Ù¿£¿¡°Ô Ã¼¿Â°è º¸³»±â 
------------------------------------------------------------------------------------------------------------------------ 

- Ã¼¿Â°è 
1. BET-1000 ==> 74,600¿ø(74,230¿ø) 
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A707725041&cc=AA02&keyword=%ba%ea%b6%f3%bf%ee%20BET
-1000&scoredtype=0&frm2=through&acode=SRP_SV_0301 
2. ºê¶ó¿î ½á¸ð½ºÄµ IRT-4520 ==> 51,340¿ø  
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A602517627&cc=AA02&keyword=%ba%ea%b6%f3%bf%ee
%20%bd%e1%b8%f0%bd%ba%c4%b5%20IRT-4520&scoredtype=2&frm2=through&acode=SRP_SV_0301 
3. ºê¶ó¿î ½á¸ð½ºÄµ IRT-4020 ==> 48,800¿ø  
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A555797224&cc=AA02&keyword=%ba%ea%b6%f3%bf%ee
%20%bd%e1%b8%f0%bd%ba%c4%b5%20IRT-4020&scoredtype=3&frm2=through&acode=SRP_SV_0301 
3. ºê¶ó¿î ½á¸ð½ºÄµ IRT-3520 ==> 0¿ø(´ë±ÔÁý¿¡¼­ »ç¿ë) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.23(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 
---> 07:55 ~ 18:00 --> ¸ð¹ßÀÏB Áß½Ä ¾à¼Ó(PM, Áß±¹Áý), ¾î¸Ó´Ï 300¸¸¿ø ¼Û±Ý(ÅÂ±Ô¿¡°Ô »ç±â ´çÇÔ) 

- ChatON ¿î¿µ Prj
- buddy ¾÷¹« ºÐ¼® 
1. buddy API Work Flow ºÐ¼® 
==============================================================================================================

- G-Chaton T/FÆÀ ÇÃ·Î¿ìÂ÷Æ® ¼³¸í 
1. 7Ãþ 1È¸ÀÇ½Ç 14½Ã 
==============================================================================================================

- ·Î±×Æ÷¸Ë ¹× °ü¸® ¹æ¾È¿¡ ´ëÇÑ ÀÇ°ß 
1. Åð±Ù Àü±îÁö ÀÛ¼ºÇÏ¿© Á¦ÃâÇÒ °Í 
2. ³»¿ë 
1) Service ÆÄÆ®´Â ·Î±× µ¥ÀÌÅ¸°¡ »ó´ëÀûÀ¸·Î ¸¹Áö ¾Ê°í ¼Ò½ºµµ º¹ÀâÇÏÁö ¾Ê¾Æ¼­ ÇöÀçÀÇ ·Î±×´ë·Î »ç¿ëÇØµµ ¹®Á¦°¡ ¾ø´Ù°í ÆÇ´ÜµÊ 
2) ¼öÁ¤ Àü ·Î±× 
[ERROR]  2013-01-21 22:14:05,528  http-bio-10080-exec-26316  AuthServiceImpl.java:53       
- [AuthService] imsi format(0000000000000000) is not valid.  
2) ¼öÁ¤ ÈÄ ·Î±× 
[ERROR]  2013-04-08 01:55:46,817  http-0.0.0.0-8080-150  ServiceServlet.java:171    pew1bd001m  
- param uid : 0c8964ed-208a-4338-8133-49d7400b16b0  - [AuthService] imsi format(0000000000000000) is not valid. 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.24(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:55 ~ 18:00 --> PM ¾ÆÄ§ È¸ÀÇ Âü¼®, Ã³°¡ »õÁý °Ç¼³ 

- ChatON ¿î¿µ Prj
- ¿î¿µ ¾÷¹« Âü¿©(PM ¾ÆÄ§ È¸ÀÇ Âü¼®ÇÏ¿© ¹ßÇ¥) 
1. ÀüÀÚ MSC ¿î¿µ¼¿Àå: ÀÌÈ¿¼º Ã¥ÀÓ(¾÷¹« Áö½Ã ¹ÞÀ½) 
2. Á¶´ÜÀ§: 5¸í 2°³Á¶ 
==============================================================================================================

- buddy ¾÷¹« ºÐ¼® 
1. buddy API Work Flow ºÐ¼® 
==============================================================================================================

- Àü±â¼¼(»õ¹®ºô¶ó 301È£) (4¿ùºÐ: 3.9 ~ 4.8) ³³ºÎ 
1. ³³ºÎÀÇ¹«ÀÚ: Ãß¿¬´ë 
2. ÀüÀÚ³³ºÎ ¹øÈ£(°í°´¹øÈ£): 01 4857 9080 
3. ºÎ°ú³â¿ù: 2013.04 
4. ±âÅ¸: TV ¼ö½Å·á 2Ãµ 5¹é¿ø Æ÷ÇÔ 
5. Áö·Î ³³ºÎ(https://www.seoulgas.co.kr) 
6. ¼­¿ïµµ½Ã°¡½º KB±¹¹ÎÄ«µå·Î ÀÚµ¿ÀÌÃ¼ ¼³Á¤(KB±¹¹ÎÄ«µå È¨ÆäÀÌÁö: ¿Ï·á) 
==============================================================================================================

- ÀÌ¹øÁÖ ÁÖ¿ä ÀÏÁ¤[2013.04.24(¼ö)]  @@@@ 
1. ¹ÝÁö(ÀÌ¹øÁÖ ¼ö·É ¿¹Á¤): ¿Ï·á 
2. º£Æ®³² ¸¶Æ®(¸Á°í) 
3. ÀåÀÎ, Àå¸ð ÃÊÃ»(Ãë¾÷½Ã ºÒÀÌÀÍ: 3Ãµ?): ¿Ï·á 
 1) °í¿ëÁÖ¿¡°Ô ¹ú±Ý 2Ãµ¸¸¿ø ÀÌÇÏ, º¸ÁõÀÎ¿¡°Ô ¹ú±Ý 100¸¸¿ø 
 2) °í¿ëÁÖ¿¡°Ô ¹ú±Ý 200¸¸¿ø, º¸ÁõÀÎ¿¡°Ô ¹ú±Ý 100¸¸¿ø 
 3) º¸ÁõÀÎ¿¡°Ô 1Â÷ Àû¹ß½Ã ¹ú±Ý 70 ¸¸¿ø°ú °æ°í, 2Â÷ º»±¹¼ÛÈ¯ Â÷ÈÄ ÀçÀÔ±¹ Á¦Àç ±âÇÑÀ» µÎ°Å³ª ¿µ±¸ ÀÔ±¹ ¸øÇÒ ¼öµµ ÀÖÀ½.   
4. Ã»Ã¸Àå µ¹¸®±â(º´±ÔÇü, ÅÂÈÆÇü): ¿Ï·á 
5. ¿Ü±¹ÀÎµî·ÏÁõ(»ç½ÇÈ®ÀÎ¼­, ¹ß±Þ ±â°£): °Ç°­°ø´Ü ¹®ÀÇ 
 1) ¿Ü±¹ÀÎµî·ÏÁõÀº ÃâÀÔ±¹°ü¸®»ç¹«¼Ò¿¡ ½ÅÃ»ÈÄ 2-3ÁÖ¾È¿¡ ¿ìÆíÀ¸·Î ¹ß¼Û 
 2) ¿Ü±¹ÀÎµî·Ï »ç½ÇÈ®ÀÎ¼­´Â À¾,¸é,µ¿ ÁÖ¹ÎÀÚÄ¡¼¾ÅÍ¿¡¼­µµ ¹ß±Þ  
6. ³»¿ëÁõ¸í È®ÀÎ(12½Ã) 
7. ±¹¹ÎÄ«µå ÇÑµµ Ã¼Å©: È®ÀÎ ¿Ï·á 
8. ÀÓ»êºÎ ¿±»ê(°ü¾Ç º¸°Ç¼Ò): ÀÓ»êºÎ¿¡ ÇÊ¿äÇÑ °Å 
9. Micro SDÄ«µå Á¤¸®: ¿Ï·á 
10. ±¸µÎ ¾Æ¿ï·¿(±Ý°­Á¦È­ ½Î°Ô »ç´Â¹ý) 
11. ±Ý°­Á¦È­ ¾Æ¿ï·¿ ³²¿µÁ¡: ¼­¿ï½Ã ¿ë»ê±¸ °¥¿ùµ¿ 88-18, ¢Ï 02-719-1681 
http://sosogoodnews.net/371, https://www.kumkangmall.com 
1) ±¸µÎ ½Î°Ô »ç´Â ¹æ¹ý(±Ý°­, ¿¤Ä­Åä, ¿¡½ºÄâÀÌ¾î) 
2) ±Ý°­Á¦È­ ¸®°¥ ³²¼º Á¤ÀåÈ­(MMT0001FC12), 153,630¿ø 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=445120863  
12. Ã¼¿Â°è 
13. ½Å¿ëÄ«µå °áÁ¦ È®ÀÎ 
14. ³²¼º È­ÀåÇ°(¿ì¸£¿À½º): http://item2.gmarket.co.kr/BrandOn/detailview/Item.aspx?goodscode=343188242 
15. –AÁö(½ÅºÎ ²É): ¿Ï·á 
16. °¶·°½Ã R3(¿ä±Ý ¾îÇÃ È®ÀÎ) 
17. ½Å¿ëÄ«µå °áÁ¦³»¿ª È®ÀÎ 
18. ÁÖÅÃ´ãº¸¿¬±Ý(¿ª¸ðÁö±âÁö·Ð: Æ÷Ç×Áý[¿ù 10¸¸¿ø ¿¹»ó]) ==> ÁÖÅÃ±ÝÀ¶°ø»ç(http://www.hf.go.kr) 
½ÅÈ­ÀÚ(*), °æºÏ Æ÷Ç×½Ã ºÏ±¸ µÎÈ£µ¿ ¿ì±¤¸Ç¼Ç ³ªµ¿ 102È£ 1030-13 
19. ¾Æ±â ÀÌ¸§ ÀÛ¸í(http://agiirum.com): 1,500¿ø(http://cafe.naver.com/thaohong/101702) 
 1) ³²: ÁøÀ¯ÅÂ, ÁøÅÂ¿ø 
 2) ¿©: ÁøÀ¯¿¬, ÁøÇÏ¹Î, ÁøÇÏºó 
==============================================================================================================

- ³²±ÇÇü Çü¼ö¿¡°Ô °øÁõ ³»¿ëÁõ¸í º¸³»±â(¿ìÃ¼±¹, 12½Ã)   
1. °øÁõ Áõ¼­ 3º» Ãâ·ÂÇØ¼­ °¥ °Í(¿øº» Æ÷ÇÔ): º»ÀÎ 1º» º¸°ü, ¿ìÃ¼±¹ 1º» º¸°ü 
2. 12½Ã ¿ìÃ¼±¹¿¡¼­ º¸³¾ °Í 
3. ºñ¿ë: ÀÍÀÏÆ¯±Þ ³»¿ëÁõ¸í(3,490¿ø), ºÀÅõ°ª(30¿ø) 
4. ¼öÃëÀÎ: ¼­¿ï½Ã ¼­ÃÊ±¸ ¾çÀçµ¿ 97-1 14/7 ¼­¿ïºô¶ó 102È£ ±è¹Ì¸®(±ÍÇÏ) 
 ¹ß¼ÛÀÚ: ¼­¿ï °­³²±¸ ¿ª»ï1µ¿ 823-16 ¿ª»ï 823ºôµù 7Ãþ ChatON ¿î¿µÆÀ ÁøÅÂ¸¸(ÀÌÀü ÁýÀ¸·Î ¹Ý¼Û µÉ °ÍÀ¸·Î ÃßÁ¤µÊ) 
5. ÀÎÅÍ³Ý ¿ìÃ¼±¹¿¡¼­ µî±â ¿ìÆí¹° ¹è´ÞÁ¶È¸ °¡´É(http://www.epost.kr)  
==> µî±â¹øÈ£: 31105-0103-2427(3110501032427) 
==============================================================================================================

- ¿Ü±¹ÀÎµî·ÏÁõ Ã³¸® 
1. ¿Ü±¹ÀÎµî·ÏÁõ »ç½ÇÈ®ÀÎ¼­ ¹ß±Þ(¿ª»ï1µ¿ ÁÖ¹Î¼¾ÅÍ) 
 1) À§ÀÓÀå°ú ½ÅºÎ ¿©±Ç »çº», ½Å¶û ½ÅºÐÁõ »çº» 
2. ÇÇºÎ¾çÀÚ Ãëµæ½Å°í(±¹¹Î°Ç°­º¸Çè°ø´Ü °­³²¼­ºÎÁö»ç: ¼­¿ï °­³²±¸ ¿ª»ïµ¿ 825) 
 1) °¡Á·°ü°èÁõ¸í¼­, ¿Ü±¹ÀÎµî·ÏÁõ »ç½ÇÈ®ÀÎ¼­ 
==============================================================================================================

- Æ÷Ç×Áý¿¡ °¡Á® °¡¾ß ÇÒ °Í[2013.04.27(Åä)] 
1. ¹ÝÂùÅë, ±³ÅëÄ«µå, Àá¿Ê, ¼±¹°(¿îµ¿È­, ¿Ê, Ä¿ÇÇ) 
2. 5¿ù 4ÀÏ(Åä) ¸ðÀÓ Àå¼Ò ¼·¿Ü 
3. ´ë±Ô ÇÒ¸Å Á¦»ç Âü¼® 
- Æ÷Ç×Áý¿¡¼­ °¡Á® ¿Ã °Í[2013.04.28(ÀÏ)] 
1. ¹ÝÂù(¹°±èÄ¡)  
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.25(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:00 ~ 18:00 --> °áÈ¥ ¹ÝÁö µµÂø 

- ChatON ¿î¿µ Prj
- buddy ¾÷¹« ºÐ¼® 
1. buddy API Work Flow ºÐ¼® 
==============================================================================================================

- º£Æ®³² Á¤º¸ 
0. ¼¼Á¾ÇÐ´ç http://www.sejonghakdang.org  
1. ¾Æ½Ã¾Æ¸¶Æ®: http://www.asia-mart.co.kr  ==> ±×¸°¸Á°í¸¦ ÆÄ´Â ¿Â¶óÀÎ¸ô, ÇöÀç Ç°Àý 
2. º£Æ®³² ¸¶Æ®³Ý: http://www.vnmart.net==> ==> 1kg: ¸¸ 4Ãµ 5¹é¿ø(ÅÃ¹èºñ: 3Ãµ¿ø) 
3. ¸Á°í ¸¶´Ï¾Æ: http://www.mangomania.co.kr  
4. º£Æ®³² ¸¶Æ®(¿ÀÇÁ¶óÀÎ) ==> 1kg:¸¸ 4Ãµ(ÅÃ¹èºñ: 3Ãµ 5¹é¿ø), ³ì¹ø¿ª 4¹ø ­‹±¸ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.26(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:00 ~ 18:00 --> ¿Ü±¹ÀÎµî·ÏÁõÃ³¸® Ãâ·Â(½ÅºÎ °Ç°­º¸Çè µîÀç, ¿Ü±¹ÀÎµî·ÏÁõ µµÂø) 
				, ³²±ÇÇü Çü¼ö ³»¿ëÁõ¸í ¹ß¼Û, Áß½Ä(ÀÌÁ¤Àç °úÀåÀÌ »ýÀÏÀÌ¶ó ½ô) 

- ChatON ¿î¿µ Prj
- buddy ¾÷¹« ºÐ¼® 
1. buddy API Work Flow ºÐ¼® 
==============================================================================================================

- ÀüÀÚ ÀÌÈ¿¼º Ã¥ÀÓ, ±è‚üÃ¤ Ã¥ÀÓ ¸é´ã(11:10) 
1. SDS °³¹ßÀÚ ÆÀÀå: ³ª¿µÃ¶ °úÀå, ±èÈ«¿ø °úÀå 
==============================================================================================================

- ½ÅºÎ °³ÀÎ Á¤º¸ 
1. ½ÅºÎ(·ç¿º) ¿Ü±¹ÀÎµî·ÏÁõ ¹øÈ£: * 
- °Ç°­º¸Çè Á¤º¸ 
2. Áõ¹øÈ£: 8-0300261915, »ç¾÷Àå ±âÈ£: 22087109470 
- ¿©±Ç¹øÈ£ 
1. ¿©±Ç¹øÈ£: B6856408 
==============================================================================================================

- ÇÑ±¹º£Æ®³² °¡Á· ¸ðÀÓ: http://cafe.daum.net/hvfamily 
http://cafe381.daum.net/_c21_/bbs_list?grpid=B3d7&fldid=2oa 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.27(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 18:00 

- °íÇâ ¹æ¹® 
08:00 ±â»ó 
08:40 Á¶½Ä(¶ó¸é) 
09:45 Áý Ãâ¹ß(½ÅºÎ°¡ ´Ê°Ô ÁØºñÇÔ) 
10:30 ¼­¿ï¿ª(30ºÐ¿¡ µµÂø ÇßÁö¸¸ ±âÂ÷ Ãâ¹ßÇÔ) 
10:40 10:50 Ãâ¹ßÇÏ´Â µ¿´ë±¸¿ªÇà ÀÔ¼® ²÷À½ 
10:50 ¼­¿ï¿ª Ãä¹ß(½ÅºÎ ÀÔ±¸ÂÊ ÀÓ½Ã ÁÂ¼Ó¿¡ ¾ÉÀ½) 
12:40 µ¿´ë±¸¿ª µµÂø 
13:00 ÇÑÁø°í¼Ó(µ¿´ë±¸¿ª 2¹ø Ãâ±¸ ¸ÂÀºÆí)¿¡¼­ ´©³ª Â÷ Å½ 
14:20 °æÁÖ ´©³ªÁý µµÂø(½ÅºÎ ¿À¹ÙÀÌÆ® ÇÔ)  
15:10 Áß½Ä(´©³ªÁý) ==> ´©³ª¿¡°Ô ½Å¹ß ¼±¹°, ·É°æ¿¡°Ô ¿ëµ· 3¸¸¿ø ÁÜ 
18:00 ´©³ªÁý Ãâ¹ß 
18:50 Æ÷Ç×Áý µµÂø(ÈÞ´ëÆù ÃæÃµ±â ¾øÀ½) 
19:00 ¼®½Ä ==> ¾ö¸¶¿¡°Ô ½Å¹ß ¼±¹°, ¾Æ¹öÁö¿¡°Ô ¹ÝÆÈ ¿Ê(2°³) ¼±¹°, ÅÂ±Ô¿¡°Ô »ç±â(¾ö¸¶µ· 3Ãµ, ¸¸ÁÖ °í¸ðµ· Ãµ) 
21:30 ´©³ª Â÷ 
21:50 ´ë±ÔÁý µµÂø(Ç³¸² ¾ÆÀÌ¿ø 102µ¿ 760È£) ==> 3°í¸ð, °í¸ðºÎ 
22:30 ´ë±Ô ÇÒ¸Å Á¦»ç 
23:00 Á¾·á 
24:00 ±Í°¡(´ë±ÔÂ÷) 
24:20 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.28(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 06:30 ~ 18:00 

- °áÈ¥ ÁØºñ 
10:00 ±â»ó 
10:30 Á¶½Ä 
11:00 »êÃ¥(ºÏºÎÇØ¼ö¿åÀå) 
11:20 ¿¹¾à(5¿ù 4ÀÏ 18½Ã): ¹é¾Ï ÀüÅë ¼ø´ë(054-241-3831) 
1130 ±Í°¡ 
13:30 Åä¿Í ºÎºÎ ¿ì¸®Áý ¹æ¹®(Áý¹è¿ø, Ã»ÇÏ) 
14:30 Áý Ãâ¹ß(¹°±èÄ¡ ¾ò¾î ¿È) 
15:10 ¸ñÈ­¿¹½ÄÀå µµÂø 
15:20 ¿¹º¹ ¼±ÅÃ(½ÅºÎ µå·¹½º, ½Å¶û ÅÎ½Ãµµ) 
15:50 Á¾·á 
16:20 Á×µµ ½ÃÀå 
16:30 ½ÅºÎ ÇÑº¹ ±¸ÀÔ(30¸¸¿ø(¼±±Ý 5¸¸¿ø ³³ºÎ): Á¶³¢ Æ÷ÇÔ): ¸íÇ° ÁÖ´Ü(*) 
17:20 °æÁÖ Å«´©³ªÁý µµÂø 
17:40 ½ÅºÎ ÀÌ¹ß(Å«´©³ª) 
19:00 Å«´©³ªÁý Ãâ¹ß 
19:30 ½Å°æÁÖ¿ª µµÂø 
19:40 ¼®½Ä(µ·°¡½º): ´©³ª°¡ ½ô 
20:18 ½Å°æÁÖ¿ª Ãâ¹ß 
22:40 ¼­¿ï¿ª µµÂø 
23:40 ±Í°¡ 
24:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.29(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:20 ~ 18:00 --> ºñ ¸¹ÀÌ ¿È, ±×¸° ¸Á°í ÁÖ¹®(17,500¿ø) 

- ChatON ¿î¿µ Prj
- Pre-Production ±¸Ãà °ü·Ã ±³À°(09:30)  
1. Àå¼Ò: 14Ãþ 1È¸ÀÇ½Ç 
2. ÀÏ½Ã: 4¿ù 12ÀÏ(±Ý) 09½Ã 30ºÐ  
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2013.04.30(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:00 ~ 18:00 --> °æÁÖÁ¶¼±È£ÅÚ ¿¹¾à(2¹Ú 3ÀÏ: 5¿ù 5ÀÏ ~ 7ÀÏ) 

- ChatON ¿î¿µ Prj
- Pre-Production ±¸Ãà °ü·Ã ºÐ¼®  
==============================================================================================================

- ÀÌ¹øÁÖ ÁÖ¿ä ÀÏÁ¤[2013.04.26(±Ý)]  @@@@   
01. Ã¼¿Â°è 
02. ¹Í¼­±â 
03. ¼±Ç³±â(2°³) 
04. ³²¼º È­ÀåÇ°(¿ì¸£¿À½º): http://item2.gmarket.co.kr/BrandOn/detailview/Item.aspx?goodscode=343188242 
05. ¼±Ç³±â042. º£Æ®³² ¸¶Æ®(¸Á°í): ¿Ï·á 
06. ½Å¿ëÄ«µå °áÁ¦ È®ÀÎ 
  
51. ÁÖÅÃ´ãº¸¿¬±Ý(¿ª¸ðÁö±âÁö·Ð: Æ÷Ç×Áý[¿ù 10¸¸¿ø ¿¹»ó]) ==> ÁÖÅÃ±ÝÀ¶°ø»ç(http://www.hf.go.kr) 
 1) ½ÅÈ­ÀÚ(*), °æºÏ Æ÷Ç×½Ã ºÏ±¸ µÎÈ£µ¿ ¿ì±¤¸Ç¼Ç ³ªµ¿ 102È£ 1030-13 
52. ¾Æ±â ÀÌ¸§ ÀÛ¸í(http://agiirum.com): 1,500¿ø(http://cafe.naver.com/thaohong/101702) 
 1) ³²: ÁøÀ¯ÅÂ, ÁøÅÂ¿ø 
 2) ¿©: ÁøÇÏºó, ÁøÇÏ¹Î, ÁøÀ¯¿¬  
==============================================================================================================

- °æÁÖ ½ÅÈ¥¿©Çà 
1. È£ÅÚ ¿¹¾à 
 1) °æÁÖ Á¶¼± È£ÅÚ(http://www.gaza82.com)(84,700¿ø ==> 169,400¿ø): ¿¹¾à 
 2) °æÁÖ ÄÚ¿À·Õ È£ÅÚ(79,200¿ø): ¿¹¾à Ãë¼Ò 
 3) ±âÅ¸ ==> Á¶¼±, °æÁÖ°ü±¤, ÀÏ¼º, ÄáÄÚµå, Çö´ë, ÈúÆ° 
2. ÀÏÁ¤ 
 1) 5¿ù 6ÀÏ(¿ù) ===> º¸¹®´ÜÁö, ºÒ±¹»ç, ¼³±¹¾Ï(ÀÚÀü°Å) 
 2) 5¿ù 7ÀÏ(È­) ===> ±¹¸³°æÁÖ¹Ú¹°°ü(ÀÚÀü°Å) 
3. °æÁÖ º¸¹® ÀÚÀü°Å ÇÏÀÌÅ·(http://www.sshiking.co.kr) °æÁÖ½Ã ½ÅÆòµ¿ 400-4¹øÁö Çö´ë»ó°¡, ¢Ï 054-775-2021, * 
 1) ½ºÄíÅÍ: 1¹Ú 2ÀÏ 5¸¸¿ø(¿¹¾àÇÔ) 
4. °æÁÖ¿¡¼­ °¡º¼¸¸ ÇÑ °÷ 
  1) ºÒ±¹»ç(¿ù) ==> ¼®±¼¾Ï, Åä¾Ï»ê  
  2) ±¹¸³°æÁÖ¹Ú¹°°ü(È­: ¿ù¿ç ÈÞ¹«) ==> ¾È¾ÐÁö, ¹Ý¿ù¼º, °è¸², Ã·¼º´ë, Ã·¼º´ë, Ãµ¸¶ÃÑ 
5. Â÷¸Ö¹Ì: ¿ÀÂ¡¾î, ²­, »ý°­Â÷, ¼±±Û¶ó½º, ¸ñÄµµð, ¹ÚÇÏ»çÅÁ 
==============================================================================================================

1. ¿©±Ç(ÀÜ¿© À¯È¿±â°£ 6°³¿ù ÀÌ»ó)
2. Ç×°ø±Ç(ÀüÀÚÆ¼ÄÏ) 
3. ¸ñÀûÁö ºñÀÚ 
4. ÁÖ¹Îµî·ÏÁõ ¶Ç´Â ¿Ü±¹ÀÎµî·ÏÁõ
5. È­Æó È¯Àü  
==> Ãâ¹ß½Ã°£ ÃÖ¼Ò 2½Ã°£ Àü±îÁö °øÇ×¿¡ µµÂøÇÏ¼Å¼­ Å¾½Â¼ö¼ÓÀ» ¸¶Ä¥ °Í
6. Å¾½ÂÀÚ ¿µ¹®ÀÌ¸§ È®ÀÎ ¹Ù¶ø´Ï´Ù.   
( ¼º/ÀÌ¸§,¼ºº° ¡Ø¿©±Ç»óÀÇ ¿µ¹®ÀÌ¸§ µ¿ÀÏ¿©ºÎ ¹Ýµå½Ã È®ÀÎ! )  
DINHTHI/LUYEN,MS  
JIN/SOOJONG,MSTR  
==============================================================================================================
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+--------------------------------------------------------// End //--------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á