

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.05.01(수) 작업 ■■■■■■■■■■■■■■■ 
---> 06:20 ~ 18:00 --> 노동절(공휴일) 

▦조기축구
05:00 기상 
06:00 신구초등학교(버스타고 감) 
06:20 숏게임(2:0 패) ==> 수인이형 결혼 축의금 5만원 줌 
07:20 종료(신구초교에서 신구 가족 한마당 개최) 
07:50 조식(화정식당: 청국장): 영희형이 쏨 
09:00 종료 
09:20 귀가 
09:30 시장(빵, 바나나) 
11:00 대규 방문 
11:20 보험(신부, 애기) 2개 듬 ==> 13만원 상당(아들, 19주 1일) 
12:40 중식(베트남 쌀국수(퍼폰스): 대규가 쏨) 
13:40 관악구 다문화 센터(외국인등록증, 가족관계증명서 제출) 
14:00 모태 산부인과(http://www.motae.net, tamairo/s*pe**8*1*) 검사 --> 김정현 원장(출산 예정일: 2013년 9월 24일) 
  ===> 1. 자궁내막, 난소 초음파 검사 2. 자궁암 검사 
 12. 당뇨검사, 14. 소변 염증 검사, 16. STD 7종 검사 --> 결과 1주일 후 나옴(256,600원) 
15:00 낙성대 공원(강감찬 장군 사당) 
16:30 종료 
17:00 시장보기(삼겹살, 돼지고기) ==> 임신, 삐뽀삐뽀(조대형 과장이 선물) 
17:40 귀가 
19:00 석식(삼겹살 파티) 
22:30 취침 
==============================================================================================================

- 대규 만남(13시): 보험 가입 
1. 무배당플러스유니버설CI보험(한화생명, 루옌) ==> 월납입액: 79,217원 
2. 무배당 굿앤굿어린이CI보험(Hi1304)(진수종) ==> 월납입액: 52,000원(출산 후 만원 할인됨) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.02(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:05 ~ 18:00 --> 결혼 선물(수려한 화장품: 정병인 과장), 고운맘카드 신청(10시, 신한은행 방문) 

- ChatON 운영 Prj
- Pre-Production 구축 관련 분석 
==============================================================================================================
  
- 401 에러  
1. 401 에러는 권한에 관련된 에러입니다 
2. Add Description and Response Example - Common Fault Code: 401 Fault Code 
 1) 401(HTTP Status Code), CCS-00011(Fault Code): Authentication failed. Not registered user(Message) 
 2) 401(HTTP Status Code), CCS-00012(Fault Code): Authentication failed. Invalid user(Message) 
==============================================================================================================

- 근태관리대장(2013.04) 메일 발송 
1. 2013년 1월 ~ 4월 근태관리대장 메일 발송(SDS 배수현 책임 요청) 
==============================================================================================================

- Sinle Sign On 
1. http://www.samsung.net, tamario2.jin / s***m8*1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.03(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 로지텍 울트라 씬 판매(6만 5천원: *), 김원기 수석님(5만원) 

- ChatON 운영 Prj
- Pre-Production 구축 관련 분석
==============================================================================================================

- 이번주 주요 일정[2013.05.02(화)]  @@@@   
01. 체온계 
02. 믹서기 
03. 선풍기(2개) 
04. 남성 화장품(우르오스): http://item2.gmarket.co.kr/BrandOn/detailview/Item.aspx?goodscode=343188242 
05. 베트남 마트(망고): 완료   
06. 신용카드 결제 확인 
07. 코골이 
21. 임신 정보 
22. 모태산부인과(http://www.motae.net/main.asp, tamairo/s*pe**8*1*) 
51. 주택담보연금(역모지기지론: 포항집[월 10만원 예상]) ==> 주택금융공사(http://www.hf.go.kr) 
 1) 신화자(*), 경북 포항시 북구 두호동 우광맨션 나동 102호 1030-13 
52. 아기 이름 작명(http://agiirum.com): 1,500원(http://cafe.naver.com/thaohong/101702) 
 1) 이름: 진수혁, 예명: 망고 
==============================================================================================================

- 경주 신혼여행 
1. 호텔 예약 
 1) 경주 조선 호텔(http://www.gaza82.com)(84,700원 ==> 169,400원): 예약(경북 경주시 신평동 452-1) 
 2) 경주 코오롱 호텔(79,200원): 예약 취소 
 3) 기타 ==> 조선, 경주관광, 일성, 콩코드, 현대, 힐튼 
2. 일정 
 1) 5월 6일(월) ===> 보문단지, 불국사, 설국암(자전거) 
 2) 5월 7일(화) ===> 국립경주박물관(자전거) 
3. 경주 보문 자전거 하이킹(http://www.sshiking.co.kr) 경주시 신평동 400-4번지 현대상가, ☎ 054-775-0, 010-9646-0 
 1) 스쿠터: 1박 2일 5만원(예약함) 
4. 경주에서 가볼만 한 곳 
  1) 불국사(월) ==> 석굴암, 토암산  
  2) 국립경주박물관(화: 월욜 휴무) ==> 안압지, 반월성, 계림, 첨성대, 첨성대, 천마총 
5. 차멀미: 오징어, 껌, 생강차, 선글라스, 목캔디, 박하사탕 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.04(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 고향 방문 
08:00 기상 
08:40 조식(라면) 
09:10 집 출발 
10:00 서울역 
10:30 서울역 출발 
12:40 신경주역 도착(큰누나, 령경 마중나옴) 
13:20 경주 누나집 도착(신부 오바이트 함) 
15:10 포항집 도착(택이형, 고모) 
15:30 작은 누나 도착(매형, 은아) 
15:40 중식 
16:20 포항 고속터미널(현용, 태용 만남) 
16:40 진협이 묘(상환 도착) 
17:00 제사 
17:50 북부해수욕장 도착 
17:55 백암 온누리 순대국밥(경북 포항시 북구 두호동 1009-4), ☎054-241-0 
18:10 창맥 동기 도착(윤성호 부부, 조일현 부부, 최광영) 
18:15 나눔 동기 도착(현용, 태용, 상환, 호수, 재욱(재욱, 준호 부주 10만원 전달 받음)) 
19:20 신부 소개 
21:00 종로(식당비: 257,000원 카드로 계산) 
21:10 해산물집(나눔 동기회에서 계산)  
23:50 종료 
24:00 귀가 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.05(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 결혼식 
08:00 기상 
08:20 조식 
09:20 집출발(매형차) 
09:40 목화예식장(웨딩 아이린) 도착 
09:50 2층 화장실(신부 화장) 
10:50 2층 화장실(신랑 화장, 턱시도 입기) 
11:10 봉춘이 만남(포항계 축의금 30만원 받음) 
11:20 승표 만남 
11:20 일가 친척, 친지들 도착(이모들, 일생이 아제, 숙모) ==> 신사 FC(병규형, 영석이형 참석) 
12:00 신부 대기실(웨딩 비디오 촬영) 
13:00 결혼식 시작(아버지 참석) 
13:10 주례사(박무남 전 동지고 교장 선생님) 
13:50 종료(타오(광주), 타오(포항) 사촌 동생들이 찾아 옴) 
14:10 폐백(택이 고모, 만주 고모) 
14:20 종료 
14:50 식당(4층): 친지들에게 감사 인사 
15:20 결혼식장 결제 
 1) 결혼식 부주명단 : 7,570,000원  
 2) 결혼식장 총 금액: 3,900,000원 
 3) 잡비: 1,300,000원 
==> 총합: 2,370,000원 
16:00 귀가 
16:10 외가집 식구 접대 
17:00 종료 
17:30 석식 
19:00 집출발(큰누나 차) 
20:00 경주조선호텔(2박 3일: 169,400원) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.06(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 신혼여행1 
09:00 기상 
11:00 마트(과쟈, 빵, 사과) ==> 보문단지 상가 
11:50 조식(불고기찜) 
12:20 현대 자전거(스쿠터 대여: 5만원) 
13:00 불국사(스쿠터 주차료: 1천원, 입장료: 4천원) 
14:00 종료 
14:50 설굴암 정상(스쿠터로 올라 오는 것이 위험함) 
16:00 경주조선호텔 
20:20 석식(호텔에서 치킨(만 6천원) 시켜 먹음 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.07(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 신혼여행2 
09:00 기상 
11:00 호텔 출발(스쿠터) --> 경주조선호텔 체크 아웃 
11:20 현대 자전거 짐 맡김 
11:50 조식(갈비탕, 갈비찜): 경주 시내 식당 
12:20 경주국립박물관(무료) 
14:00 종료 
15:00 보문단지 
15:50 현대 자전거 반납(스쿠터 기름값: 만원) 
16:00 보문단지 축발(작은 누나 차) 
17:00 포항집(택이 고모, 만주 고모) 
19:00석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.08(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 

- 신혼여행3 
09:00 기상 
11:00 조식 
13:20 콜택시 도착(경태 삼촌에게 요청함) 
14:30 포항 출발(택시) 
14:20 신경주역 도착(택시비 5만원) 
15:08 신경주역 출발(KTX) 
17:20 서울역 도착 
18:20 귀가(신부 운동화 어머니꺼랑 바뀜) 
19:00 석식(돌솥 비빕밥) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.09(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 루옌 생일, 비옴 

- 신혼여행4 
09:00 기상 
11:00 중식 
11:30 한국어 공부(숙제) 
13:30 한국어 공부(선생님 수업) ==> 시험 위주(거의 다 틀림, 수준 높음(초교 3~4학년 수준) 
15:30 종료 
16:00 집출발 
16:10 국민은행 봉천동점(KB국민행복적금 가입) 
17:20 종료 
18:20 석식(착한고기) ==> 삼겹살 
19:00 종료 
19:20 쇼핑(신부 귀걸이, 청자켓, 티, 반자비(탄텐,라붐아울렛) 
19:30 파리바케트(오후의 카페모카 케익) 
19:50 귀가 
21:00 생일 파티 
23:00 취침 
==============================================================================================================

- [국민은행] 통장 발급 ==> 013.05.09(목) @@@@@@  
- [국민은행] KB종합통장-저축예금, 예금주: 딘티루옌 
1. 계좌번호: 037402-04-279851(03740204279851)  
2. 계좌이체 한도: 1회 천만원, 1일 천만원  
----------------------------------------------------------------------------------------------------------------------------

- [국민은행] KB국민행복적금(정액), 예금주: 딘티루옌 
1. 계좌번호: 037403-04-019218(03740304019218) 
2. 금리: 연 7.5% 수익(기본: 4.5% + 우대: 3%), 봉천동 지점 
3. 계약금액: 6,146,250( 세전), 4. 계약기간: 1년(월 50만원, 9일 자동이체됨) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.10(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 신혼여행5 
09:00 기상 
11:00 중식 
16:20 관악구 보건소 방문(헤모큐 플러스 3개월치 받음) 
17:00 스카프 구입(탄텐,라붐아울렛) 
18:20 귀가  
19:30 석식(김밥: 신부가 만듬) 
23:00 취침 
==============================================================================================================

- 루옌 공인인증서 발급(국민은행)  
1. 계좌번호: 037402-04-279851(03740204279851) 
예금주: DINH THI LUEYN, 비밀번호: 050* 
https://obank.kbstar.com, lueyn94 / 33900 --> 940509 - 6100024 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.11(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
09:00 기상 
11:00 조식(김밥, 케익) 
14:00 중식(갈비쌀 쌈): 내가 요리 
18:40 집 출발 
19:30 명동역 
20:00 종각(연등축제) http://www.llf.or.kr/html/info/info01.asp 
 1) 연등행렬 : 2012년 5월 11일 (토) 오후 7:00 - 9:30 흥인지문(동대문) - 조계사  
21:30 종료 
21:40 을지로입구역 
22:30 서울대입구역 
22:40 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.12(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
06:30 기상  
07:10 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교 
08:10 게임(3:0 패) ==> 강서팀(3팀) 
08:40 월래회의(야유회, 주차문제, 유니폼 교체) 
10:00 게임(3:0 승) 
11:00 게임(2:1 승) 
12:00 종료  
12:20 중식(문경세재: 갈비탕): 병룡 부친상 찬조로 쏨 ==> 상요형 병규형, 이승형하고 싸움 
13:00 종료 
14:00 귀가 
14:10 낮잠  
18:00 장보기(토마토, 참외, 배) 
20:00 석식 
22:00 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.13(월) 작업 ■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 루옌 신한 고운맘 카드 수령 

- ChatON 운영 Prj
- Pre-Production 구축 관련 분석 
==============================================================================================================

- 내부 비기능 테스트를 위해 시나리오 및 에이전트 환경 설정 ==>  [ChatON-긴급] 서버 설정 
1. configuration의 스키마(?) 는 war를 가져온 production 기준으로 그 값들은 다른 비기능 서버들로 맞춰야 할 것  같네요.  
(connect)chatonop@ip-10-132-5-204:~$ ssh -i /home/chatonop/keys/chaton.us.load.pem -p 2022 ubuntu@*.com 
(tue1sv001)ubuntu@ip-10-157-4-133:~$ sudo su - 
(tue1sv001)ubuntu@ip-10-157-4-133:~$ su - chaton   ==> /home/chaton 자동으로 가고... user도 chaton으로 변경됨 
(tue1sv001)chaton@ip-10-157-4-133:~/service/conf$ cd service/conf 
(tue1sv001)chaton@ip-10-157-4-133:~/service/conf$ vi ssm-server.properties  ==> vi로 열어서 해당 해당 경로 buddy 서버를 참조하여 수정 
==============================================================================================================

- Service 서버 DB 환경 설정 변경 
(us-connect)ubuntu@:~$ pkr1sv001  ==>  한국 1번 서버 조회 
(pkr1sv001)chaton@i-3852-28420-VM:~$ cd service/conf 
(pkr1sv001)chaton@i-3852-28420-VM:~/service/conf$ ls 
pk-APKAIF3COYG5G5OCJ4YQ.pem  ssm-server.logging.properties ssm-server.properties 
(pkr1sv001)chaton@i-3852-28420-VM:~/service/conf$ vi ssm-server.properties ==> 파일을 편집함(보기: 
cat ssm-server.properties)]: RDS 접속 정보 수정  
# RDS 
#mysql.url=jdbc:mysql://14.63.222.115:5306/chaton?loadBalanceBlacklistTimeout=5000&useUnicode=true
&characterEncoding=utf8&autoReconnect=true   ===> mysql jdbc 주소 변경(#으로 주석 처리) 
mysql.url=jdbc:mysql:loadbalance://14.63.222.115:5306,14.63.222.203:5306/chaton?
loadBalanceBlacklistTimeout=5000&useUnicode=true&characterEncoding=utf8&autoReconnect=true  
==============================================================================================================

- 목걸이 구입 
1. 자기만의 이니셜 목걸이(14k, 40cm), 318,920원 
http://www.orodia.co.kr/shop/shopdetail.html?branduid=330357&xcode=030&mcode=003&scode=&type=X&search=&sort=order  
2. 오프라인 영업장: 서울시 종로구 봉익동 157 삼성귀금속상가 12호, T:745-1115, *, (주)오로다이아 
==============================================================================================================

- 신사조기회 회비 납부(2013년) 
1. 2013.05.13(월) 송금: 진태만(1~6월): 12만원 ==> 납부 완료 
2. 신한은행 110-379-742870, 예금주: 서정홍 
==============================================================================================================

- LG 시네마 3D 스마트 TV 55LM6100(스탠드형), 2,069,890원 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=529908021&xzone=cart^list&xfrom=cart^list&bcktType=01 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.05.14(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 개인PC내 개인정보 삭제 교육(김성채 팀장, 15시, 7층 3회의실) 

- ChatON 운영 Prj
- Pre-Production 구축 관련 분석 
==============================================================================================================

- 종합소득세 신고(2012년 귀속 종합소득세) 
1. 총 납부(환금)할 총세액[33번 + 45번]: 543,011원 
==============================================================================================================

- 장인 장모 초청 
1. 초청장 및 귀국보증각서(원본, 인감날인) - 공증필요 없음 
==============================================================================================================

- 브라운 체온계 
1. BET-1000 
2. IRT-4520 
3. IRT-4020 ==> 45,800원 
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&firpg=01&sc.prdNo=423461930&sc.dispNo=016001&sc.dispNo=016001 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.15(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 당직 

- ChatON 운영 Prj
- 버디 서버 result code 모니터링 건  
1. 지역별 버디 서버별로 401 리턴 코드 개수를 "ChatON 운영일지" 일일보고에 추가할 것 
- CHATON-pcn1bd001m 
grep -c " 401 " /mnt/tomcat_log/localhost_access_log.2013-05-14.txt 
3047  --> 결과값 @@@ 
- CHATON-pcn1bd002m 
grep -c " 401 " /mnt/tomcat_log/localhost_access_log.2013-05-14.txt 
3111  --> 결과값 @@@ 
==============================================================================================================

- eu ms 서버 발생(pue1ms001) 
1. 현상: eu 메시지서버 1~6번 nagios에 nagios에 Daemon_Check-Bootstrap process is not running 에러가 뜸 
2. 조치: 실제 서버에서 damon check 해봤는데 정상적으로 떠있는 거 확인 ==> nagio 담당자에게 조치 요청 
chaton@ec2-23-21-45-141:~$ ps -ef  grep Daemon_Check-Bootstrap 
chaton    5714  5478  0 07:44 pts/4    00:00:00 grep --color=auto Daemon_Check-Bootstrap 
3. 결과: nagio 플러그인 문제로 추정됨(SDS 정성훈이 해당 jps가 있는 주소에 대해서 argument 값으로 설정해서 조치) 
==============================================================================================================

- cn batch 1번 서버 Memory_Usage 발생 
1. 현상:  CHATON-pcn1ba001m 호스트 Memory_Usage 서비스에서 MEMORY CRITICAL :  
  realused 92.13% Memused 93.45% 발생하는 문제.. 
2. 조치: batch 서버 순간적으로...CPU 87.8%까지 올라 갑니다...2차 담당자에게 연락 요청함 
$ top 
  PID USER      PR  NI  VIRT  RES  SHR S %CPU %MEM    TIME+  COMMAND 
 1097 chaton    20   0  143m  33m 3900 S    0  0.2  10:08.20 splunkd 
 7551 chaton    20   0 14.3g  13g 9796 S    0 87.8   2:46.74 java 
11372 chaton    20   0 19356 1288  968 R    0  0.0   0:00.05 top 
3. 원인: cn batch 1번 서버 Memory_Usage 발생하는 것은 오늘 디플로이 문제로 batch 서버가 
새벽에 안 돌고 지금 돌고 있는 것으로 추정됩니다.  

3. 조치2: Batch 종료 처리 
10.1.2 Action 
1. crontab -e를 실행한다. 
2. buddyRecommender, interaction 관련 crontab 스케줄을 모두 주석처리한다. 
(예) #0 0,3,6,9,12,15,18,21 * * * /home/chaton/interaction-plan-b/interaction.sh 
3. 프로세스 상태점검에서 조회된 두 서비스 중 실행중인 프로세스들을 모두 강제 
종료한다. (kill -9 #PID) 
4. 배치담당자에게 연락한다. 
------------------------------------------------------------------------------------------------------- 

> top ==> CPU, MEMORY 상태를 확인 @@@ 
> ps -ef  grep interaction ==> interaction, buddy 2개 프로세스가 존재 @@@ 
> crontab -e  ==>  또는 crontab -l 명령어 사용 @@@ 
> #0 0,3,6,9,12,15,18,21 * * * /home/chaton/interaction-plan-b/interaction.sh   ==> 스케줄을 모두 주석처리 @@@ 
> kill -9 72222  ==> 프로세스들을 모두 강제 종료 @@@ 
> top ==> CPU, MEMORY 상태를 확인 @@@ 
==============================================================================================================

- 로그 보기(FaultInterceptor 전후 5개 보기) 
> cat /mnt/log/web.log.2013-05-14  grep -B 5 -A 5 "Response-Code: 401"  
[WARN]  2013-05-14 04:58:04,010  http-bio-10080-exec-256  FaultInterceptor.java:58       
 - Caused by: com.samsungchaton.api.notification.service.NotificationServiceImpl.service(NotificationServiceImpl.java:66) 
[INFO]  2013-05-14 04:58:04,010  http-bio-10080-exec-256  FaultInterceptor.java:82       - Response-Code: 400 
[INFO]  2013-05-14 23:41:40,444  http-bio-10080-exec-37  FaultInterceptor.java:83       - Response-Code: 401 
==============================================================================================================

- 초청사유(장인) 
아내 딘티루엔이 2013년 4월 13일 입국하여 서로 사랑하며 열심히 살고 있습니다. 
아내가 현재 임신 5개월째로 접어들고 있으며 9월 24일 출산 예정일입니다. 요즘 
아내가 한국온지 한달이 지났지만 한국말도 서툴고 주위에 친구가 없어서 베트남에 대한  
그리움으로 임신 우울증 증세를 보이고 있습니다. 그래서 베트남에 계신 장인 어른을  
초청하여 새로 태어나는 애기와 행복한 시간을 보내고 계획을 세웠습니다. 
장인 어른이 평소에 위가 안 좋으셔서 한국에 방문 기간 중에 병원 치료를 받고 싶으 
시다고 하니 사위된 입장에서 치료를 받게 하고 싶습니다. 
이러한 이유로 장인 어른을 초정하고자 하오니 허락해주시면 감사하겠습니다. 
------------------------------------------------------------------------------------------------------- 

- 초청사유(장모) 
아내 딘티루엔이 2013년 4월 13일 입국하여 서로 사랑하며 열심히 살고 있습니다. 
아내가 현재 임신 5개월째로 접어들고 있으며 9월 24일 출산 예정일입니다. 요즘 
아내가 한국온지 한달이 지났지만 한국말도 서툴고 주위에 친구가 없어서 베트남에 대한  
그리움으로 임신 우울증 증세를 보이고 있습니다. 그래서 베트남에 계신 장모님을  
초청하여 새로 태어나는 애기와 행복한 시간을 보내고 계획을 세웠습니다. 
저의 부모님이 연로 하시고 신부도 몸이 약해서 장모님을 초청해서  태어날 애기를  
돌보며 함께 살기를 희망합니다. 
이러한 이유로 장모님을 초정하고자 하오니 허락해주시면 감사하겠습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.16(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  

- ChatON 운영 Prj
- ChatON 서버별 Shell Script 현행화 점검 
==============================================================================================================

- KT 통신요금 자동이체 olleh KB국민카드로 변경 신청 
1. KT 통신요금 요청: ☎100[통화중] ==> 홈페이지 이메일 상담 신청 
(http://my.olleh.com/kt12/cs/faq/exMailQuestion.jsp?&&channel=) 
2. olleh KB국민카드: 9445 4206 0086 1060, 2018/03, 402 
==============================================================================================================

- LG TV 구입 
1. LG 시네마 3D 스마트 TV 55LM6100(스탠드형) ==> 2,069,890원(2,049,200원: 신한카드 10개월 무이자) 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=529908021&xzone=cart^list&xfrom=cart^list&bcktType=01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.17(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
09:00 기상 
09:10 조식(식빵) 
10:00 루옌 한국어 공부(보충 수업) 
12:40 중식(생각보다 맛있는 집: 바지락 칼국수, 팥죽) 
13:30 쇼핑(다이소) 
14:50 쇼핑(중앙 마트) ==> 최실장님 오늘 방문 못 한다고 함(연기) 
15:30 귀가 
20:00 석식 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.18(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
06:00 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차)  ==> 전화와서 겨우 읽어 남 
06:30 신구초등학교 
06:40 숏게임(0:0 무)  
07:40 종료  
08:30 귀가 
09:35 모태산부인과 방문(정밀 초음파 검사): 고운맘카드 사용(50,800원 사용, 449,200 남음) 
        ===> 오메가3(모태산부인과): 55,000원 
10:20 약국(감기약 처방)      
10:40 귀가 
11:30 집출발 
13:10 정발산역(응아 부부 만남) 
13:20 일산 호수공원(산책) 
15:30 명식이 아제집(한울4단지 휴먼시아 104동 303호: 경기 파주시 동패동 1753 ) 
16:00 고기집(아제가 쏨): 아제, 숙모, 혜인 
17:30 종료 
18:00 명식이 아제집(LH공사, 22평): 혜인, 혜주 용돈(6만원), 침실 등 선물 받음 
20:00 종료 
20:30 대화역 출발(아제가 역까지 태워 줌) 
23:00 서울대입구역 도착(비 많이 옴) 
23:20 귀가 
00:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.19(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 비와서 축구 못 감 

- 주말 
10:30 기상  
10:50 조식(식빵) 
11:00 대청소  
12:50 쇼핑(중앙 마트), 삼겸살, 돼지 불고기 구입 => 토와씨 부탁으로 망고 스틴(16,500원) 구입 
14:20 허우 부부 도착 
15:00 중식(삼겹살 파티): 허우씨에게 옷 구입(베트남 조차 선물): 3만원 ==> 베트남 부모님 선물 전달 받음 
17:00 시장 구경(허우 부부) 
17:30 종료 
20:00 석식 
22:00 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.20(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  

- ChatON 운영 Prj
- PreProduction 구축 점검 
1. instance 접속 
> rue1sv001 
2. ELB Port forwading 
기본적으로 80 --> 10080 으로 사용합니다. 
서버에서 8080, 2080 등으로 사용한 부분은 10080으로 서비스 하도록 수정하셔야 합니다.  
3. configuration 파일 수정 및 테스트 
ssm-server.properties 
config 파일에 대한 수정 후 서버 기동하고 단위테스트/EV 테스트 진행  
==============================================================================================================

- KT 통신요금 자동이체 olleh KB국민카드로 변경 신청[완료] 
1. KT 통신요금 요청: ☎100[통화로 처리] 
(http://my.olleh.com/kt12/cs/faq/exMailQuestion.jsp?&&channel=) 
2. olleh KB국민카드: 9445 4206 0086 1060, 2018/03, 402 
==============================================================================================================

- 개인사업자 신고 
1. 나이스 데이타: http://www.nicedata.co.kr/cm/main.do 
2. 부가세 10% 안냄 ==> 개인사업자 카드로 결제(식대, 전자제품) 
==============================================================================================================
  
- 베트남 처가 선물  @@@@ 
1. 신신파스 아렉스(10장)[1장 3천원] ==> 3만원(10% DC해서 2만 7천원, 원당약국) 
http://iicah.blog.me/60190077037 
2. 안티푸라민 S로션(4개)[1개 2천 5백원] ==> 1만원 
http://ndrug.druginfo.co.kr/popup/image.aspx?propid=33487&flag=0 
3. 체온계(구급약통에 있는 거 보냄) 
4. 조카 선물(상의 2개, 하의 1개) ==> 3만원 
5. 임신 확인서 재발급 거부(고운맘 카드용이라고 함) 
 1) 임신 진단서 발급(장당 만원, 2장에 만 3천원) 안함 ==> 비용 부담 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.21(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- PreProduction 구축 점검 
1. instance 접속 
> rue1sv001 
2. ELB Port forwading 
기본적으로 80 --> 10080 으로 사용합니다. 
서버에서 8080, 2080 등으로 사용한 부분은 10080으로 서비스 하도록 수정하셔야 합니다.  
3. configuration 파일 수정 및 테스트 
ssm-server.properties 
config 파일에 대한 수정 후 서버 기동하고 단위테스트/EV 테스트 진행  
==============================================================================================================

- PreProduction EV 설정  
> java -jar SSMEV.jar 
1. config 
gld address: 54.225.213.203:80  
name: provisioning 
address: gld.push.samsungosp.com:8089  ===> 46.137.83.144 :5223 
2. New Device 
IMEI: 111111111111111 
IMSI: 222222222222222 
MSISDN: 821043211234 
client version: 3.7.5 
Model: SCH-1234  
==============================================================================================================

- OTP 주소 
http://gauth.apps.gbraad.nl, chatonop@ip-10-132-5-204 / 4SWQJ5AXWDUOKZU7 
==============================================================================================================

- 운영 자산 현황 
1. PC ==> 모델명: MSI GT638DX-i7, 시리얼번호(Serial Number): GT683DX-685XKRK111000258 
2. LCD 모니터 ==> 모델명: WIDVIEW MT-202MWT, 시리얼번호(Serial Number): PLEC080424D011 
==============================================================================================================

- MSI GT683DX-i7 Imperial(750GB) SSD(64G)(회사에서 사용하는 노트북) ==> 2012.01.27(금)구매 @@@@@@@@ 
1. CPU: 인텔 코어i7-2세대 i7-2670QM(동작 속도: 2.2 GHz, 최대 터보 부스트일 때: 3.1 GHz, 스마트 캐시 메모리: 6 MB)  
2. RAM(메모리): 8GB DDR3, 최대 32GB 메모리까지 인식 
3. OS: 운영체제 미포함 
4. LCD 크기: 15.6인치 
5. 무게: 3.5Kg 
6. HDD 용량: 750 GB SATA, 7200 rpm, HDD슬롯 x 1(+ 64GB SSD) 
7. 그래픽 칩셋: 엔비디아 지포스 GTX 570M 
8. 배터리: 1500mAh 
9. 카메라: 전면 VGA, 후면 500만 AF 카메라 
10. 해상도: 1920 x 1080  
11. 웹캠: HD고화질 웹캠(720p) 
12. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등  
-------------------------------------------------------------------------------------------------------- 

- 노트북 구매 
- MSI GT683DX-i7 Imperial(750GB) SSD(64G) + Edition, 1920x1080, 15In, 1,680,000원 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=12734&cate_c4=0&depth=3&prod_c=1515034 
주소: 서울시 용산구 한강로3가 16-9 전자랜드 별관 광장(지하1층) 47호, 703-2861  
==============================================================================================================

- TV겸용 LCD 구매(WIDVIEW MT-202MWT 20인치) 
(주)엠비코아테크: 서울 용산구 한강로2가 나진상가19동 3층 라열 303호  
WIDVIEW MT-202MWT 무결점  51cm (20) / 1680 x 1050 / 5㎳ / 300㏅ / 1000：1 / 무결점 정책 /  220,000원  
http://lcddotcom.co.kr/product/productView.php?cate_c1=&cate_c2=&cate_c3=&cate_c4=&nDepth=&nFirst=&nSecond=
&nThird=&nForth=&sSearchMethod=all&sSearchString=MT-202MWT&sOrderType=&nPage=1&nListPerScreen=20&nProdCode=520449 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.22(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 마이(신부 고향 언니: 김포공항 근처 거주)와 화상통화 

- ChatON 운영 Prj
- PreProduction 구축 점검  
1. Service 서버 EV 테스트 에러 
C:\EasyValidator\00. jar>java -jar SSMEV_51.jar 

- 로딩시 나는 GLD 에러 @@@ 
[==================== GetSSMServerAddress4Command Start ====================] 

[GetSSMServerAddress4Command URL] = http://54.225.213.203:80/prov4?imei=56777463 
7790000&countrycallingcode=82&phonenumber=1043211234&imsi=450019586775555&model= 
ams_dummy&clientversion=3.7.5&platform=ev_dummy 

Status = HTTP/1.1 503 Service Unavailable: Back-end server is at capacity 

Error Body Content = 

[==================== GetSSMServerAddress4Command End ====================] 
--------------------------------------------------------------------------------------------------------- 

- GLD를  GetSSMServerAddress로 선택 후 나는 에러 @@@ 
[==================== GetSSMServerAddressCommand Start ====================] 

[/GetSSMServerAddressCommand.java] [request()] [strClientversion]821043211234[UR 
L]http://54.225.213.203:80/prov?imei=567774637790000&msisdn=821043211234&imsi=45 
0019586775555&model=ams_dummy&clientversion=3.7.5&platform=ev_dummy 
Status = HTTP/1.1 503 Service Unavailable: Back-end server is at capacity 

Error Body Content = 

[==================== GetSSMServerAddressCommand End ====================] 
==============================================================================================================

- 2013. 종합소득세 신고(2012년 귀속) 최종 결과 
1. 종합소득세 환급금: 1,279,216원, 지방소득세 환급금: 127,917원 ==> 총 환급금: 1,407,133원 
2. 수수료 송금 ==> 하나은행 147-910060-36207, 예금주: 고경미, 송금액: 20만원 
3. 최종 실 환급금: 1,207,133원 ==> 1,279,210원 
------------------------------------------------------------------------------------------------------------------------- 

- 종합소득세 신고(2012년 귀속 종합소득세): 개인이 테스트(근로소득 제외) 
1. 총 납부 할 총세액[33번 + 45번]: 543,011원 ==> 납부할 세액 
==============================================================================================================

- 상하수도 요금 납부 
1. 이택스(http://etax.seoul.go.kr)에서 결제 
 1) 사용기간: 2013.2.23 ~ 4.22 ==> 신용카드 납부 
 2) 고객번호: 03696446, 자동납부번호: 036964464, 수용가명: 추연대외1인 
2. 아리수: http://arisu.seoul.go.kr ==> 전자고지, 자가검침 신청  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.23(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:00 

- ChatON 운영 Prj
- 2차 대응 담당자 서버 계정 및 권한 설정 
1. 각 Region ssmadmin 계정 생성 작업 
==============================================================================================================

- 개인별 계정을 생성 @@@@@@ 
(pkr1sv001)chaton@i-3852-28420-VM:~$ su ssmadmin 
Password: s**2*** 
(pkr1sv001)ssmadmin@i-3852-28420-VM:/home/chaton$ ll 
(pkr1sv001)ssmadmin@i-3852-28420-VM:/home/chaton$ sudo useradd  -U -m -d /home/tamario -s "/bin/bash" tamario 
==> /home/tamario 디렉토리를 갖고 bash쉘을 사용하고 admin그룹에 속한 tamario을 만들어라 @@@ 
(pkr1sv001)ssmadmin@i-3852-28420-VM:/home/chaton$ sudo chown -hR tamario:tamario  /home/tamario   
==> 파일의 소유권자를 변경 @@@ 
(pkr1sv001)ssmadmin@i-3852-28420-VM:/home/chaton$ sudo chage -m 0 -M 90 -W 7 tamario 
(pkr1sv001)ssmadmin@i-3852-28420-VM:/home/chaton$ su tamario  ==> tamario 권한 생성된 것 확인 @@@ 
---------------------------------------------------------------------------------------------------------------------------- 

=> ssmadmin 계정이 생성되고나면, 담당자분들은 ssmadmin 으로 로그인하여 각 개인별 계정을 생성해야합니다. (아래 명령어 참조) 
$ sudo useradd  -U -m -d /home/사용자아이디 -s "/bin/bash" 사용자아이디 
$ sudo chown -hR 사용자아이디:사용자아이디  /home/사용자아이디 
$ sudo chage -m 0 -M 90 -W 7 사용자아이디 
==> su: substitute user(다른 사용자의 권한) 
==> sudo: substitute user do(다른 사용자의 권한으로 명령을 이행하라) 의 줄임말이다 
==============================================================================================================
  
(pue1sv001)ssmadmin@ec2-50-19-49-170:/home/chaton$ sudo su - 
[sudo] password for ssmadmin: 
ssmadmin is not in the sudoers file.  This incident will be reported. 
(pue1sv001)ssmadmin@ec2-50-19-49-170:/home/chaton$ 
==============================================================================================================

- 각 Region 
01. KR(한국): (KR)pkr1sv001, (KR)pkr1sv002  
02. US(미국): (US)pue1sv001, (US)pue1sv002  
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1cs.pem ubuntu@*.com 
$ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1cs.pem ubuntu@*.com  
03. EU(유럽): (EU)pew1sv001, (EU)pew1sv004, (EU)pew1sv007 
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.eu.pem ubuntu@*.com 
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.eu.pem ubuntu@*.com 
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.eu.pem ubuntu@*.com 
(connect)chatonop@ip-10-132-5-204:~$ alias  grep pas1sv00 
04. SG(싱가포르): (SG)pas1sv003, (SG)pas1sv006 
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.aps.pem ubuntu@*.com  
$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.aps.pem ubuntu@*.com 
05. CN(중국): (CN)pcn1sv001, (CN)pcn1sv002)  ===> VPN 접속 여부 확인할 것(https://27.106.205.10) 
==============================================================================================================

1. root 권한 획득  ==> US, EU, SG 
 1) ubuntu 접속 후, sudo su 
(connect)chatonop@ip-10-132-5-204:~$ alias  grep pew1sv00 
(connect)chatonop@ip-10-132-5-204:~$ ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1cs.pem ubuntu@*.com 
(pue1sv001)ubuntu@ec2-50-19-49-170:~$ sudo su 
(pue1sv001)root@ec2-50-19-49-170:/home/ubuntu#  
 2.) ssmadmin 계정이 생성  
(pue1sv002)root@ec2-107-20-104-172:/home/ubuntu# cd /home/chaton 
(pue1sv001)root@ec2-50-19-49-170:/home/chaton# vi ssadmin_creation.sh  ===> 파일 생성(ssadmin_creation.sh 내용  
복사하여 붙여넣기) --> :wq 
(pue1sv001)root@ec2-50-19-49-170:/home/chaton# chmod 755 ssadmin_creation.sh ===> 파일 권한 부여 @@@ 
(pue1sv001)root@ec2-50-19-49-170:/home/chaton# ./ssadmin_creation.sh  ===> 실행 @@@ 
Starting ssmadmin user creation script.... 
/etc/motd.tail  Prepared ! 
Modifying ssmadmin account ! 
Key copying to ssmadmin .... 
WARNING: overwriting authorized_keys for chaton 
ssh start/running, process 27654 
Finished ssmadmin user creating script.... 
(pue1sv001)root@ec2-50-19-49-170:/home/chaton# su ssmadmin  ==> ssmadmin 권한 생성된 것 확인 @@@ 
(pue1sv001)ssmadmin@ec2-50-19-49-170:/home/chaton$ 
3. 각 개인별 계정을 생성 
==============================================================================================================

1. root 권한 획득 ==> KR, CN 
 1) chaton 접속 후, su  
(pkr1sv001)chaton@i-3852-28420-VM:~$ su chaton 
Password: s**2*** 
(pkr1sv001)chaton@i-3852-28420-VM:~$ su 
Password: s**2*** 
 2.) ssmadmin 계정이 생성  
(pkr1sv001)root@i-3852-28420-VM:/home/chaton# vi ssadmin_creation.sh  ===> 파일 생성(ssadmin_creation.sh 내용  
복사하여 붙여넣기) --> :wq 
(pkr1sv001)root@i-3852-28420-VM:/home/chaton# chmod 755 ssadmin_creation.sh ===> 파일 권한 부여 @@@ 
(pkr1sv001)root@i-3852-28420-VM:/home/chaton# ./ssadmin_creation.sh  ===> 실행 @@@ 
Starting ssmadmin user creation script.... 
/etc/motd.tail  Prepared ! 
Modifying ssmadmin account ! 
Key copying to ssmadmin .... 
WARNING: overwriting authorized_keys for chaton 
ssh start/running, process 27654 
Finished ssmadmin user creating script.... 
(pkr1sv001)root@i-3852-28420-VM:/home/chaton# su ssmadmin  ==> ssmadmin 권한 생성된 것 확인 @@@ 
3. 각 개인별 계정을 생성 
==============================================================================================================

- 신용카드 
1. 신부 네이버 회원가입 
2, 하노이 대사관 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.05.24(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 중식 못 함(정과장과 오해 생김) 

- ChatON 운영 Prj
- PreProduction 서버 구축 점검 
1. Service 서버 EV 테스트(trunk 테스트) 
 1) 821066791400(조대형), 821094093338(양정훈) 
 2) 821030720898(진태만), 821094093338(양정훈) 
 3) 821080078337(한일평), 821022223333(오승현) 
2. PreProduction 점검결과 작성 
==============================================================================================================

- super putty 환경 설정 
1. Session Name: (KR)pkr1sv001 
2. Host Name: 46.51.247.21, Port: 22 
3. PuTTy Sessopm Profile: 01. ChatON 중계(21번)_chatonop ==> 선택 @@@ 
4. Login Username: chatonop 
5. Extra PuTTy Argumnetst: -pw 1ckeodmd!@ ==> 비밀번호 설정 @@@ 
==============================================================================================================

- 기존 URL 
https://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:443/poston/list?buddyid=821030720898&uid=fd433412-4fac-4b33-a4d5-ffe5cf190f06&imei=567774637790000 
==> - 수정 URL 
http://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:80/poston/list?buddyid=821030720898&uid=fd433412-4fac-4b33-a4d5-ffe5cf190f06&imei=567774637790000 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.25(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
09:00 기상 
10:00 집출발 
10:20 쇼핑(다이소) 
10:30 중식(돌솥비빕밥, 야채김밥): 루옌 
11:20 쇼핑(중앙 마트): 삼겹살, 소고기 
12:00 귀가 
13:00 프엉 부부 도착(서울대입구역): 자전거로 데리려 감 
14:00 응아 부부 도착 ==> 회비 3만원 납부: 총 9만원 
15:00 삼겹살 파티 
16:10 LG TV 도착 
17:00 영화 시청(7번방의 비밀) 
19:00 영화 시청(런닝맨) 
21:00 종료 
00:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.26(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:00 기상 
05:10  결승[도르트문트 1:2 뮌헨](03:45) ==> 뮌헨 우승, 로벤 MVP(1G, 1AS) 
06:30 국민은행 봉천동지점 앞(태훈이형 차) 
07:00 신구초등학교 
08:10 게임(3:2 패)  
09:00 게임(5:4 패) 
09:50 종료  
10:20 중식(문경세재: 갈비탕): 결혼 답례로 쏨 (20만원), 돌솥 포장해서 옴(루옌) 
12:00 종료 
12:40 귀가 
13:10 낮잠 
18:00 석식 
19:00 장보기(휴지통, 돌솥) 
20:00 귀가 
22:00 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.27(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- ChatON 운영 Prj
- PreProduction 서버 구축 점검 
1. Service 서버 EV 테스트(trunk 테스트)  
 1) 1.4.1. Read PostON List 
==> [Response] Payload (HTTP + AES 사용시 AES 암호화 해야함) 
 2) 80 포트 에러 ==> 443 포트로 변경해야 함 
==============================================================================================================

- logging 레벨 설정 
chaton@ec2-54-242-77-56:~/service/conf$ vi ssm-server.logging.properties 
#root long level / appender setting 
#log4j.rootCategory=INFO, stdout, rolling   ====> 원 소스 
#log4j.rootCategory=ERROR, stdout, rolling 
log4j.rootCategory=DEBUG, stdout, rolling    ====> 수정 소스 

#log4j.category.org.springframework.beans.factory=ERROR ====> 원 소스 
log4j.category.org.springframework.beans.factory=DEBUG ====> 수정 소스 
-----------------------------------------------------------------------------------' 

- logging 레벨 @@@ 
0 ERROR 
1 WARNNING 
2 INFO  ====> 실서버 
3 DEBUG 
==============================================================================================================

 1. 방화벽 예외 신청 
  추상연 선임님에게 요청해주세요 
==> 443: 포트 요청(80 포트 현재 사용 중) 

2. 서비스 서버쪽 SSL 설정  
  SSL 설정 후 사설인증서를 추상연 선임님에게 보내주세요 
  추상연 선임님이 ELB에 인증서 등록 예정 
  서비스 서버 SSL 설정은 인터넷 검색 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.28(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> W22 정기 배포 못함 

- ChatON 운영 Prj
- PreProduction 서버 구축 점검 
1. Service 서버 EV 테스트(완료) 
----------------------------------------------------------------------------------------------------------------------- 

- ReadPostOnCommentListCommand.java 파일에서  
public int request(String phoneNumber) { 
url += API_PATH; 
url += '/' + phoneNumber; 
// serverURL += '/' + ssm.getPhoneNumber(); 

List <NameValuePair> nvps = new ArrayList <NameValuePair>();  
       /// nvps.add(new BasicNameValuePair("buddyid", phoneNumber));   
        nvps.add(new BasicNameValuePair("uid", ssm.getUid()));  // uid 첫번째로 배치할 것(중요) 
        nvps.add(new BasicNameValuePair("imei", ssm.getImei())); 
} 

https://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:443/poston/list?buddyid=821030720898&uid=fd433412-4fac-4b33-a4d5-ffe5cf190f06&imei=567774637790000 
==> http://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:80/poston/list/821030720898&uid=c2ff99af-10d7-4d5e-8954-57e8bbc4f454imei=567774637790000 
==============================================================================================================

- W22 정기 배포(23:30)  
1. 장소: 823 빌딩(메세지, 버디, 서비스 모듈)  
2. 일시: 5월 28일(화) 23시 30분 
3. 디플로이 지원: 배수현 책임 
4. 진행사항 
1) DB 작업이 늦어져서 4시 30분에 디플로이 연기 결정 
 2) 6시 30분까지 1회의실에서 자다가 8시 30분까지 모니터링하고 퇴근 함  
==============================================================================================================

- ChatON Deploy 이관 시 수행 조 
1조: 오승현, 진태만, 이종진, 인호진, 임정현 
2조: 강동현, 조대형, 하민규, 나영철, 양정훈 
3조: 한일평, 김상봉, 임기택, 홍영민, 김홍원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.29(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 23:20 ~ 03:50 --> W22 정기 배포 수행(2일 걸림) 

- ChatON 운영 Prj
- W22 정기 배포(23:30)  
1. 12시에 시작해서 3시 50분에 디플로이 종료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.30(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 13:00 ~ 18:00 --> 책상 여분키 양정훈 과장 서랍에 보관 요청, 목걸이 다시 받음 

- ChatON 운영 Prj
- BigData 회의 및 분석 
1. ChatON Service API 명세_v1.67.pdt 파일에서 1.4. Memo Management가 Spec-out 예정이라고 하며 
실제로 poston으로 기능이 이전된 것을 알고 있음. 
그래서 [ChatOn]Big Data Platform_ToBe Log정의서(Activity별)_v0.1.doc 파일에서 
아래 2개의 API의 로그 분석을 하는 것은 무의미하다고 판단됨. 
2.2.16. Write Memo (/memo) 
2.2.17. Delete Memo (/delmemo) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.05.31(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 13:00 ~ 18:00 

- ChatON 운영 Prj
- BigData  분석 
1. 최인택 책임에게 1차 작성하여 메일로 보냄 
==============================================================================================================

- 2차 대응 교육 
1. 일시: 
 1) 오전: ms, gd(MSC 이재영 선임) 
 2) 오후: bd, bp, fi, im(MSC 신규현 책임, 주효진 사원) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■