

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2008.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2008.01.01(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- 포항집 
08:00 기상 
08:20 주유(대구 행복 주유소) 
10:00 포항집  
10:20 아침식사  
19:30 귀가 
==============================================================================================================

- [2008년 무자년 신년 목표]
목표: 미래를 향한 준비(도전, 희망, 긍정적 사고)  
 1. 새 둥지(정보 수집, 상황 분석)  
  - 프리랜서 선언, 서울 이사 
 2. 노트북 구매 
 3. 재테크 
  - 저축: 5천만원 
 4. 인맥 형성 
 - 관련 분야, 조기회 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.02(수) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 23:00   

- A 프로젝트
- 대구집 도착(보일러 켜기): 14:00 
- 대구집 전세 내놓기(주인, 리베라 관리인 연락: 20만원 요구) 
- 취업 관련 업무 처리 
1. (주)예술과 기술: 신한은행 프로젝트, 센텀디지털(주): 삼성전자 프로젝트 
- 세차(2천원) 
- i3shop 방문(떡뽁기 사감: 만원): 17:00 
- 삽겹살집(차호진): 17:00 
- 맥주집(차호진, 여자친구): 21:30 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.03(목) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 23:00 

- A 프로젝트
- 점심(대구시청 정보통신팀 이주임, 홍주임이 쏨)  
- 서적 구매(프로그램 개발자를 위한 Eclipse 3X:2만 8천원): 13:30 
- 여권 발급 신청(10년 5만 5천원), 여권용 증명사진(8천원) --> 여권 수령: 01.09(수) 
- 박찬엽 주임(커피) 
- 취업 관련 업무 처리 
1. (주)펜타크리드: 삼성그룹 1차 전략적 전문 협력사(8년차 개발자 420~450만원 이라 주장) 
-------------------------------------------------------------------------------------------------------- 

- 색상설정(EditPlus) 
폰트: 돋음 10  
색상: 76 채도: 78  명도: 194 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.04(금) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- 펜션 예약(4인 2일 24만원 개인카드 결제: 당일 4만원 추가 납입) 
1. 별을 헤는 밤 http://accommodations.auction.co.kr/Home/Category/Detail.aspx?idLodge=5420  --> 24만원    
    연락처: * 
-------------------------------------------------------------------------------------------------------------------------------

- 나눔90 동기 모임 공지 
1. GS 강촌 리조트 스키장 여행(http://www.gangchonresort.co.kr) 
2. 2008.1.18(금) ~ 20(일): 2박 3일 
==============================================================================================================

- 취업 관련 업무 처리 
1. (주)빅뱅CS 면접 약속(강남구청역 3번 출구 1월 7일 14시) 
2. (주)펜타크리드에서 전화옴: 교보생명 방가라슈 프로젝트 월 450만원 제의, 면담 요청(세금 3%) 
3. 3G CORE 공형진 차장이 8년차 개발자 420~450만원 이라 조언 
==============================================================================================================

- 새마을 금고 예금 해지 
1. 총 36,835,829원 찾음(생계형, 세금우대) 
- 경대 점심 먹으러 감(교직원 식당 식권 1장 환불: 3천원) 
- 제적등본 발급(천원) 
- 나눔90동기계 회계 정리, 포항계 회계 정리  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.05(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- Eclipse 공부 
java 세상을 덮치는 Eclipse: 완료 
==============================================================================================================

- 기차 예매(서울행): 01.06(일) 01: 30 강남 고속 터미널: 완료 
- 선희 누나 전화(*, 02-263-7057), 진대규: *: 완료   
- (주) J.H Dream: PM업무, 회사 관리, 단가 산정: 펑션 포인트(기능점수) 
- 대구 전세집 
1. 햇빛 바람 잘 통함 
2. 물 잘 나옴 
3. 수퍼, 마트 근처 
4. 교통 좋음(기차, 지하철, 고속버스) 
5. 조용함(고층) 
6. 주차 시설 양호함 
==============================================================================================================

- 요금 비교 
1. 철도 요금 
  1) 평일 기준 
KTX: 38,400원 새마을: 29,100원  무궁화: 19,600원 
  2) 주말 기준 
KTX: 41,100원 새마을: 30,400원  무궁화: 20,500원 
2. 고속버스 요금  
일반: 14,600원 우등: 21,600원 심야: 23,800원 
-------------------------------------------------------------------------- 

- 자동차세 선납 
선납신청을 하고 한꺼번에 미리 내면 세금의 10%를 할인받을 수 있습니다.  
차량 등록지 관할 구청에 신청한 뒤 1월 16일부터 31일 사이에 납부하면 됩니다. 
------------------------------------------------------------------------- 
- 상반기 자동차세 납입(마감일) ==> 2007.07.02(월) 
금액: 80,040원(2006년 상반기(기간: 02.09 ~ 6.30)) 
납입방법: 인터넷 지로 납부(http://www.giro.or.kr) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.08(화) 작업 ■■■■■■■■■■■■■■■■
---> 12:20 ~ 23:00  --> 대구 도착 

- A 프로젝트
- 효목 도서관(인터넷 이용 예약 방법 확인) 
- 책 정리(빨간 노끈 한다발: 천원)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.09(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- 효목 도서관(인터넷 이용: 09:10 ~ 13:00) 
 - 자동차세 선납 신청(세금의 10% 할인) 
1. 대구시 동구 징수관리 Tel) 662-2411, 대표 Tel) 662-2000  
2. 1월 중순에 고지서 나옴(1월 31일까지 납부) 
3. 차량번호: 21저6365, 차대번호: 030174(차종: 아반테XD 1.5 GLS) 
4. 납입방법: 인터넷 지로 납부(http://www.giro.or.kr) 
==============================================================================================================

- 기차 운행 조사(포항행) : 통근열차 운행 안함 
- 고속버스 운행 정보(서울행) 
- 이사(서울행)   
- 국민연금 Tel) 430-7851: 1년 납부 유해 신청, 완료 
- 국민건강보험공단(http://www.nhic.or.kr) Tel) 1577-1000 
- 여권 수령: 대구시청  
==============================================================================================================

- 취업 관련 업무 처리 
1. 보험사 차세대 프로젝트/JAVA/중급,  (주) 중앙정보처리 *@*.* 
 1) 01.14(월) 면접 예정, 430만원(1년) 
2. [을지로] 삼성화재 보험갱신 관리시스템, (주) 아이티드림테크: *@*.* 
3. 푸르덴셜생명-강남역,분석,설계 가능자, (주) 솔인텍크: *@*.* 
4. 금융/공공/일반회사 등 골라서 선택, (주) 다른정보기술: *@*.* 
5. 삼성반도체 기흥,화성, 장비의 데이터를 가공하여 레포팅하는 프로그램개발, (주) VAS: *@*.* 
6. 금융/공공/Project 개발, (주) 오메가정보시스템2008-01-09, *@*.*   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.10(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00  --> 저녁(일남(일남 냄): 청국장, 소주) 

- A 프로젝트
 - 효목 도서관(인터넷 이용: 09:00 ~ 13:00) 
 - 헌책 기증(효목 도서관: 문헌정보과) 5 묶음(컴퓨터책) 
1. 헌책방: 컴퓨터책 안 받음 
 - HSBC 인터넷뱅킹: 생활비 전송(국민은행) 
 - 자동차 보험료 비교견적(현대 하이카 다이렉트보험: 예상보험료: 376,170원)  
1. 2008년 1월 15일 부터 견적 가능(만기 전월 15일 전부터 보험료 산출 가능)  
==============================================================================================================

- 취업 관련 업무 처리 
1. java/jsp 경력 개발자, 장기 SM 업무, (주) 메이티, *@*.*  
2. 금융/공공/Project 개발, (주) 보람정보기술, *@*.*  
 1) 삼성화재 --> 연락 없음, 430만원(5개월) 
3. 삼성증권 Miplatform, (주) 천앤지, *@*.*  
 1) 01.15(화) 11시 면접 예정(서울 수서역 근처), 430만원(5개월) 
==============================================================================================================

1. 자바 개발자 단가 : 삼성SDS 기준 단가 
초급하(학사 2-3년차) : 300만원 
초급상(학사 4-6년차) : 340만원 
중급하(학사 7-8년차) : 410만원 
중급상(학사 9년차) : 440만원 
고급(학사 10년차 이상) : 500만원 
----------------------------------------------------------- 
2. 자바 개발자 단가 
초급 270~320만원, 중급 380~420만원, 고급(9년차) 450만원~500만원 
==============================================================================================================

- 전세(서울 관악구) 조사 
http://mirea0870.oneroomclub.com/item/info.asp?no=787399&pg=1&dv=%BF%F8%B7%EB&si=%BC%AD%BF%EF&gu=
%B0%FC%BE%C7%B1%B8&dt=%C0%FC%BC%BC&sort1=1&uc=&dn=%BD%C5%B8%B2%B5%BF&dp= 
http://mirea0870.oneroomclub.com/item/info.asp?no=787418&pg=1&dv=%BF%F8%B7%EB&si=%BC%AD%BF%EF&gu=
%B0%FC%BE%C7%B1%B8&dt=%C0%FC%BC%BC&sort1=1&uc=&dn=%BD%C5%B8%B2%B5%BF&dp= 
http://mirea0870.oneroomclub.com/item/info.asp?no=787714&pg=1&dv=%BF%F8%B7%EB&si=%BC%AD%BF%EF&gu=
%B0%FC%BE%C7%B1%B8&dt=%C0%FC%BC%BC&sort1=1&uc=&dn=%BD%C5%B8%B2%B5%BF&dp= 
http://www.oneroomshop.com/room_view_detail.asp?gb=1&dong=&pre_next=0&page=1&room_type=1
&room_code=2003112100079_f&member_id=apt8245&subway= 
http://www.oneroomshop.com/room_view_detail.asp?gb=1&dong=&pre_next=0&page=2&room_type=1
&room_code=2004061900011_f&member_id=apt8245&subway= 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.11(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- 효목 도서관(인터넷 이용: 09:00 ~ 13:00) 
- 자산관리 정리(1월 10일): 완료   
- 서울 강남 도서관 찾기 
1. 강남 도서관(http://www.gangnamlib.or.kr) 
위치: 강남구청역 1번출구 →선릉역 방향으로 도보 7분 → 정류장① 지점 (주택공사) 지나서 →  
강남도서관 표지판이 있는 골목에서 300m 들어감 
2. 개포 도서관(http://www.gaepolib.or.kr) 
위치: 지하철 분당선 개포동역 7번 출구(도보 10분) 
 서울특별시 강남구 개포2동 139번지 (우)135-802 
3. 종로도서관(http://www.jongnolib.or.kr) 
종로구 사직동(사직공원 뒤) 
==============================================================================================================

- 취업 관련 업무 처리   
1. 단기(3개월) ~ 장기일년이상(프로젝트및 운영), (주) 신진엔.티.에스, *@*.*  
2. 금융분야 (생보,손보,증권,은행등) 프로젝트 수행, (주) 한화에스앤, *@*.* 
3. 삼성전자 글로벌 ERP 구축, (주) 성우정보, *@*.* 
==============================================================================================================

- 이사 관련 업무 
 1. 서울 전세 조사 
 2. 다른 부동산 통보 이나원 * * 053)741-2121 화신부동산 실장 
 3. 현 대구 전세 정보 벼룩시장 올리기 ==> 보류(다음주 서울행) 
 4. 서울 이사 비용 확인(용달) 
 5. 생필품 가격 조사  
   1) LG 동글이 세탁: 27만원  ==> 2005.10.03 구입(2년 3개월 사용) 
   2) LG 싱싱냉장고(237L) R-B241GB: 28만원  ==> 2005.10.19 구입(2년 3개월 사용)  
   3) 장롱2짝(배송비포함)(병호 아제): 30만원  ==> 2006.10.13 구입(1년 3개월 사용)  --> 총 87만원 
==============================================================================================================

- 파견비 정산(위니텍)  
11월 파견비: 255,000원(11.13 ~ 30) 
12월 파견비: 420,000원(12.01 ~ 29) 
합계: 675,000원 
12월 급여 2,326,800원 
01월 급여 2,540,700원 
총 합계: 5,542,500원(HSBC 인터넷뱅킹 500만원 이체)   
==============================================================================================================

- 노트북 도착 
LG전자 Xnote E300-AP75K, 1,300,00원 ===> 희망한 기종(AP50K 대신 AP75K이 배송됨) 
http://shopping.naver.com/detail/detail.nhn?cat_id=01100002&nv_mid=4096964263 
LG전자 Xnote E300-AP50K, 1,209,590원  ===> 현용이 빌린돈 500만원에서 상계(370만원 남음) 
http://shopping.naver.com/detail/detail.nhn?cat_id=01100002&nv_mid=4081058179&frm=nv_model&tc=3 
모델명: 노트북 컴퓨터(LGE23) 
Config No(인증번호): LGE-DMLGE23(B)  
제품번호(Serial Number): 712KSKG022165 
M/N: E300-AP50K, P/N: MFL37846103  
노트북 A/S 센터: 1588-7777(http:/www.lgepc.co.kr) 
사은품: USB 포터, 키스킨, 마우스, 마우스 패드, 모니터 크리너 
구입처: (주)컴퓨터나라(서울 용산구 한강로3가 16-60 한통BD 303)  Tel) 02 705-1616,    
 노트북 반품 신청: IG KIG 이정훈 Tel) 02 705-16167 
------------------------------------------------------------------------------   
OS: 윈도우 Vista  Home Premiunum -> 윈도우 XP Professional 다시 깜 
윈도우 Vista  Home Premiunum:(Product-KEY: 6PXG-7VXHF-3TKMT-B89CJ-Y8M6T) 
CPU: 코어2듀오(메롬)/T5750 (2.0GHz) 
HD: 120GB(Hitachi HTS541612J9SA00) 
RAM: 2GB  
1. Video 카드: ATI Radion Xpress 1250 --> LCD: 13.3"(1280*800)  
2. Audio 카드: Realtek High Definition Audio 
3. Lan(Network) 카드: Marvel Yukon 88E8039 PCK-E Past Ethernet Controller 
4. 무선 Lan 카드: Bluetooth PAN Network Adaptor 
무게(kg): 약 1.97K(배터리 포함) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.12(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 13:00 

- A 프로젝트
- 위니텍 파견비: 541,500원 송금(기업 은행 -> HSBC) 
- 사은품 등록(http:/www.lgepc.co.kr): 노트북 가방, USB 2GB 
==============================================================================================================

- 취업 관련 업무 처리 
1. 은행 자본시장 프로젝트 중급 Java 프로그래머(광화문역),  (주) 에스엠비엔티, *@*.* 
2. 웹기반 프로젝트 개발, (주) 인포웰, *@*.*  
==============================================================================================================

- 전세(서울) 조사 
1. 원룸플러스(http://www.oneroomplus.net): 전국 원룸전세 전문 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.14(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- A 프로젝트
- 취업 관련 업무 처리   
1. 인사업무개발(여의도), (주) 투게더소프트, *@*.* 
2. 신한/LG카드 차세대통합프로젝트(서울 중구), (주) 윈텍, *@*.*  
3. 금융쪽의 Java Project(여의도), (주) 나라정보기술, *@*.* 
 1) 01.16(수) 10시 면접 예정(서울 여의도 2번 출구, 한국투자증권 1층 로비), 430만원(6개월) 
 2) 유종현 사장(*), 신책임(*) 
==============================================================================================================

- 나눔90 동기 모임 취소(GS 강촌 리조트) 
1. 펜션 예약 취소(총 24만원의 위약금 3만 6천원 지불)   
==============================================================================================================

- 연간 저축 현황 
연도 최종 날짜 총금액 총 저축액 
2007년도 08.01.10 133,976,792 27,972,281 
2006년도 07.01.05 106,004,511 22,468,471 
2005년도 06.01.11 83,536,040 15,884,611 
2004년도 05.01.13 67,651,429 15,126,506 
2003년도 04.02.28 52,524,923 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.15(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00  --> 서울행(면접) 

- A 프로젝트
- 취업 관련 업무 처리   
1. 삼성증권 Miplatform, (주) 천앤지, *@*.*  
 1) 01.15(화) 18시 면접 예정(서울 수서역 삼성증권 센타 근처), 430만원(5개월)  
 강남구 수서동에 있는 Fn Family(수서역 4번 출구 로즈데일빌딩 5층)센터  
2. 금융쪽의 Java Project(여의도), (주) 나라정보기술, *@*.* 
 1) 01.16(수) 10시 면접 예정(서울 여의도 2번 출구, 한국투자증권 1층 로비), 430만원(6개월) 
 2) 유종현 사장(*), 신책임(*) 
3. 국가예산 회계 Project(광화문), 재경부, (주) 오메가정보시스템, *@*.* 
 1) Fax로 졸업 증명서, 의료보험 증명서 보낼 것, Fax) 02-2108-1590 
 2) 면접: 01.22(화), 투입: 2.10(월)  ===> 거부하기로 함 
============================================================================================================== 

- 고속버스 예약: 완료 
1. 12:40 일반고속 동대구 -> 서울 
- 수서역 삼성증권 센타 약도 
- 여의도 2번 출구, 한국투자증권 약도 
- 고속버스 예약: 완료 
==============================================================================================================

- 프리랜서 개발자 분석 
회사에 소속되지 않고 업체에게 프로젝트단위로 계약을 하여 일정기간동안 
맡은 업무만을 수행하는 작업을 하는 사람을 말합니다..... 
이해가 되시겟지만...... 자연히 회사가 제공하는 복리후생, 진급, 수당 등등은 
기대할수 없으며......일이 꾸준히 잇다고 확신할수도 없습니다.... 
단, 이런것들이 감안되기 때문에 정규직보다는 높은 단가에서 계약이 됩니다.... 
또한 어느정도 분야에서 인정을 받아야 일이 맡기어 지겟지요..... 

- 프로그래머 프리랜서의 장점  
1. 단기간 높은 인권비 
2. 좀더 자유로운 생활  
3. 다양한 분야의 개발경험 
4. 다양한 업계로의 체험 
5. 다양한 지식의 습득 
6. 폭넓은 인맥구축  
- 프로그래머 프리랜서의 단점 
1. 소속감이 없고 모든것의 책임을 개인이 져야 한다는 위험성, 
2. 경기에 따른 소요(일자리) 감소 
3. 복리후생, 보험의 보장성이 없음 
4. 항상 새로운 환경에 적응해야 하는 부담감 
5. 일관성없는 업무 
- 프리랜서 소득 
매년 5월달에 종합소득세 신고 
월급여의 3.3%를 원천징수 
------------------------------------------------------------------------------ 
- 이랜서 
http://www.elancer.co.kr/ 
==============================================================================================================

- 서울행
12:40 동대구 고속버스(일반고속) 
17:00 강남 터미널 
17:40 을지로 3가역(삼풍빌딩) 
18:40 면접(삼성증권 팀장) --> 통과 
19:30 출근 안하기로 함((주)천앤지 사장에게 통보) 
20:00 왕삼겹살집(현용, 직장동료) 
21:30 맥주집(현용, 직장동료) 
22:30 독도 참치(현용) 
24:30 초원의 집(현용, 직장동료): 20만원 
02:30 종료 
02:50 24시간 찜질방(만원) 
03:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.16(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00  

- A 프로젝트
- 서울행2 
08:00 기상(24시간 찜질) 
10:00 강남 교보생명 네거리 
10:20 나라정보기술 유종현 사장(유종현 사장(*), 신책임(*)) 
11:20 나라정보기술 신책임 면접(여의도 2번 출구, 한국투자증권 1층 로비): 내일부터 출근 
12:00 종료 
12:50 전세 구하기(미래부동산 차과장) 
13:50 전세 구하기(4천 만원에 월9 만원 성사 단계 --> 4천 5백 요구: 실패) 
15:30 전세 구하기(금강부동산 박미숙) 
16:20 전세 구하기(4천 6백만원에 월5 만원 --> 낙성대역에서 너무 멈: 거부) 
17:00 전세 구하기(신축 원룸 4천 5백만원에 월7 만원 성사 단계 --> 주인이 계약 안함: 실패) 
19:20 전세 구하기(4천 5백만원에 월11 만원 성사 단계) 
19:50 계약하기(한솔원룸텔 301호: 낙성대역 8번출구, 
	관리비는 월9만원(모든 공과금 포함/인터넷 별도), 주차료는 2만원으로 선불) 
        전세금 2천만원 송금, 부동산 중계 수수료 20만원 송금 
	주소: 서울시 관악구 봉천6동 1687-38 한솔원룸텔 301호 
	주인: 여정자(*)  하나은행: 583-810032-79907 예금주: 여정자 
	금강부동산 박미숙(02-8888-131): www.oneroomshop.com) 
20:30 계약집 입주(이전 세입자가 침낭 선물) 
22:00 종료 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.17(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 19:30  --> 한국투자증권 첫 출근(나라정보기술 계약직), (5호선 여의도역 2번 출구), 회식 

- 한투. 컴플 Prj
- 컴플라이언스 자문업무 및 법률의견서 통합관리 개발
1. 홍보물 
2. 계약서 
3. 법무법인 의견서 
-------------------------------------------------------------- 
- 관계자 
1. 한국투자증권 고객시스템부 이광영 차장 
2. 나라정보기술 신권선 책임, 정진우 부장, 정철우 과장, 정호근 사원, 여진수 
- BPM(Business Process Management), SOA, BI 
==============================================================================================================

- 전세금 2천만원 추가 송금: 완료 
- 국민은행 송금(HSBC로 660만원 송금): 완료 
- 자동차세 선납(대구 동구청 세무과) 
- 화물운송 업체 알아보기(동대구 --> 서울 이사), 택배 회사  
- 버스 노선 
1. 여의도역 -> 낙성대역(461번, 6513번) 
==============================================================================================================

- 한국투자증권 네트웍(IP 주소)  --------- 
IP: 190.190.183.218 
S.M: 255.255.255.0 G.W: 190.190.183.1 
DNS: 164.124.101.2 DNS2: 168.126.63.1 
------------------------------------------------------------------------------ 
- 공유 서버 
\\190.190.183.227\컴플라이언스 자문업무 및 법률의견서 통합관리 개발    ID/PWD: administrator/2007sys  
\\190.190.183.227\it수요관리   ID/PWD: administrator/2007sys 
- 프린터 설정(신도리코 --> 드라이버: RICOH Aficio 2022)  
\\190.190.183.201(http://190.190.183.201) 
프린터 추가 --> 프린터 추가 마법사 
이 프린터에 연결된 로컬 프린터(L) 체크  --> 새포트 만들기(C) 포트종류: Standard TCP/IP Port 
프린터 또는 IP주소: 192.168.0.201  --> 완료(양면 인쇄 안됨: 양면기를 달아야 함) 
==============================================================================================================

- 노트북 다운(블루 스크린: 시작 프로그램 실행시) 
1. 원인: 바이러스 프로그램 충돌(웜세이버, pms 프로그램 설치 후 발생) 
 1) Symentic 보안 프로그램과 이미 설치된 Ahanlab V3 7.0 프로그램과 충돌(V3 7.0 삭제) 
2. 조치: 시작 -> 실행(R) -> 열기(O): msconfig -> 시스템구성 유틸리티  
-> 시작프로그램: 모두 사용안함(D): 클릭 --> 적용(A) --> 다시 시작(R) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.18(금) 작업 ■■■■■■■■■■■■■■■■
---> 06:30 ~ 19:00 

- 한투 컴플라이언스 Prj
- WEB 작성 
1. 홍보물(진태만)  
2. 계약서(정호근) 
3. 법무법인 의견서(진태만) 
- DB 설계 
홍보물 
- IT 컴플라이언스(Compliance)란 각종 법, 제도적 규제 및 권고의 철저한 대응을 위해 IT 인프라로 구현하는 작업 
1. 컴플라이언스는 준법감시인 이라고도 합니다. 펀드매니저들이 투자시 관계법령을 준수하여 투자하였는지 일반 
적인 부분에 있어 법률에 위배되는 사항은 없는지 하는부분을 감시 하는 업무를 합니다. 이름 그대로 법률을 잘  
준수하였는지 그것을 감시 감독하는 업무를 한다고 보시면 됩니다.  
----------------------------------------------------------------------------------------------------------- 
  
- 전세금 5백만원 송금(최종): 완료 
- 전세 관리비 11만원 송금(매월 15일): 완료 
- HSBC 송금(국민은행으로 20만원 송금: 이사용): 완료 
- 고속버스 예약(21,600원): 완료 
1. 21:30 우등고속 서울 -> 동대구 
- 설날 고속버스 예약(21,600원): 완료 
2. 02.06(화) 21:30 우등고속 서울 -> 동대구 
- 노트북 관련 물품 가져 올 것(대구집) 
- 자동차세 선납(1년치: 10%할인) 
1. 165,280원(10% 할인: 대구시 동구청)  
2. 선납신청을 하고 한꺼번에 미리 내면 세금의 10%를 할인받을 수 있습니다.  
3. 차량 등록지 관할 구청에 신청한 뒤 1월 16일부터 31일 사이에 납부하면 됩니다.  
==============================================================================================================

- 대구에서 낙성대역(승용차로) 
대구 출발(경부고속도로) -> 서울 톨게이트 -> 서초 I.C(사당 방향 : 두번째 진출로) ->  
이후 계속 직진(남부순환로 : 남부터미널 입구, 예술의전당 앞, 사당역 고가, 고개를 넘어서 낙성대역 
서초 I.C에서 서울대까지 평소에는 20~25분 정도면 충분합니다. 
- 편의점 택배(GS25 봉천 중앙점): 취소 
대한통운 택배(www.korex.co.kr) Tel) 1588-1255   
==============================================================================================================

- 경력증명서 요청: 완료 
(주) 위니텍 김미주씨  
팩스번호: 02-3276-6697(한국투자증권 12층 고객스시템부) 
==============================================================================================================

- 인터넷 조사 
1. 하나로: 하나포스 스피드(10M) 3년 약정 24,948원(27,443원) 
2. LG파워콤: 3년 약정 프라임(10M) 24,700원(27,170원) 
   LG파워콤, myLG070 번들: 27,200원(29,920원) 
3. 관악인터넷: 3년 약정 22,000원(24,200원)  ===> 평 안 좋음 
2. KT 메가패스 LITE: 3년 약정(10 Mbps/4 Mbps): 25,500원(28,050원) 
==============================================================================================================

- 서울 이사(교훈): 2008.01.19(토) ~ 20(일) 
1. 자가용으로 2번 이사함(왕복): 서울, 동대구 왕복 
2. 비용 
 1) 톨게이트비 합계: 37,500원 
 2) 톨주유비 합계: 85,000원 
 3) 서울 이사 총 합계: 122,500원 
3. 이사의 문제점 
 1) Y셔츠는 반드시 박스에 쌀 것 
     (기타 물건도 웬만하면 박스에 쌀 것) 
 2) 이불 커버 구매할 것 
 3) 몇일 전에 박스를 구해서 짐을 쌀 것 
 4) 필요없는 물건을 구매하지 말 것 
==============================================================================================================

2008.01.19(토) 이사..자가용으로 
1번째 사고 
난 급브레이 밟았는데...뒤차가 니 닮았는지 쫌 둔해서..  
내차 뒤에서 박아뿌랬다..ㅎㅎ 
그냥 그쪽에서 범퍼값만 물어 주기로 했다. 

2번째 사고 
중부내륙고속도로에서..  
졸음 운전 하다가 중앙 분리대 받아 버렸다.. 
난 차 문짝이라도 나갔는지 알았더니..멀쩡. 
잘못 했으면 지금? 상주병원 중환자실에 누워 있을 꺼다... 
다 나르고 방 정리까지 다 끝냈다. 
이사비 50만원 잡았는데 10만원 정도 나옴.. 
혼자서 이사 다 싸고 나르고....내가 생각해도 대단..ㅎㅎ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.21(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00  --> [Time = Money], Real Pro...눈 옴 

- 한투 컴플라이언스 Prj
- DB 설계 
1. 공통  
BPM90001: 광고심의 개요 정보: 완료  
BPM90002: 광고물 점검표 정보: 완료 
BPM90003: 광고물 점검표 확인 정보: 완료 
BPM90004: 심의.심사 결과 정보: 완료 
BPM90005: 사인 정보: 완료 
2. 홍보물  
BPM90011: 담당자 정보: 완료  
BPM90012: 결재선 정보: 완료 
BPM90013: 결재내역 정보보: 완료 
BPM90014: 계약검토 의견 정보: 완료 
BPM90015: 컴부 의견 정보: 완료 
==============================================================================================================

- 현업 미팅 
14:00 ~15:30 18층 컴플라이언스부 회의(이광영 차장, 컴부 이길승 부장, 컴부 윤선영씨) 
수정 사항: 계약서 부분, 홍보물 부분 
==============================================================================================================

- 개발 테스트 서버 URL 
http://190.190.183.223:8888/sbm/bpmportal/cp/TrueFriend/ulogin.jsp   
==============================================================================================================

- 대구 도시가스 처리(*): 완료 
가스비 관련 이나원실장(*)에게 연락해서 처리 
==============================================================================================================

- 전입 신고, 확정일자 받기(서울시 관악구 봉천 6동 주민센터:600원): 완료 
- 자동차 수리 맡김 
1. 진광자동차공업사 윤영상 사장 Tel)889-6565, H.P) 011-342-0: 수리비 25만원(범퍼, 오른쪽 등 포함) 
2. 가해자(: H.P) 011-233-0)에 수리비 35만원 요청(송금 완료함) 
3. 한솔원룸텔 대문 비밀번호: 2356 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.22(화) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 23:00  --> 눈 옴 

- 한투 컴플라이언스 Prj
- DB 설계 
1. 공통  
 1) BPM17001: 담당자 정보: 완료 
 2) BPM17002: 결재선 정보: 완료 
 3) BPM17003: 결재내역 정보보: 완료 
 4) BPM17004: 계약검토 의견 정보: 완료 
 5) BPM17005: 컴부 의견 정보: 완료 그라면   
 6) BPM17006: 첨부파일 정보: 완료    
2. 홍보물  
 1) BPM17007: 광고심의 개요 정보: 완료 
 2) BPM17008: 광고물 점검표 정보: 완료 
 3) BPM17009: 광고물 점검표 확인 정보: 완료 
 4) BPM17010: 심의.심사 결과 정보: 완료 
 5) BPM17011: 사인 정보: 완료 
3. 계약서 
 1) BPM17012: 계약의뢰 개요 정보: 완료 
 2) BPM17013: 오프라인 계약의뢰 개요 정보: 완료 
 3) BPM17014: 계약서 양식 등록 정보: 완료 
 4) BPM17015: 계약서스캔 정보: 완료  
4. 법무법인 의견서 
 1) BPM17016: 법무법인 의견서 정보: 완료 
 2) BPM17017: 법무법인 정보: 완료 
 3) BPM17018: 보안등급 정보: 완료 
 COMPLE_TYPE CHAR(2)          NOT NULL, /* 컴플유형(01:홍보물, 02:계약서) */  
==============================================================================================================

- 현업 미팅 
14:00 ~15:30 18층 컴플라이언스부 회의(이광영 차장, 컴부 부장, 컴부 윤선영씨, 컴부 김흥관 대리) 
수정 사항: 계약서 부분, 홍보물 부분 수정 사항 확인 
==============================================================================================================

- 한글 깨짐(EditPlus) 
1. 문서(D) -> 인코딩 -> 인코딩 선택: UTF-8(디폴트로 잡혀 있음) 
2. 안잡혀 있으면 epp230.exe 버전 설치할 것 
==============================================================================================================

- 대구 전세금 입금 완료(이나원 실장) 
1.  대구집 전세금: 27,000,000원 
2. 세금, 수수료: 총금액: 219,910원 
 1) 부동산 수수료: 200,000원 
 2) 도시가스료(1월분): 15,420원 
 3) 전기세(1월분): 4,490원 
3. 가전제품 판매: 100,000원 
 1) 냉장고: 50,000원 
 2) 세탁기: 50,000원 
3. 총 금액: 26,880,090원(입금 완료: 이사관련 모든 계산 끝남) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.23(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 한투 컴플라이언스 Prj
- DB 설계 
1. 공통  
 1) BPM90001: 광고심의 개요 정보: 완료 
 2) BPM90002: 광고물 점검표 정보: 완료 
 3) BPM90003: 광고물 점검표 확인 정보: 완료 
 4) BPM90004: 심의.심사 결과 정보: 완료 
 5) BPM90005: 사인 정보: 완료  
3. 계약서 
 1) BPM90021: 계약의뢰 개요 정보: 완료 
 2) BPM90022: 오프라인 계약의뢰 개요 정: 완료  
==============================================================================================================

- 노트북 반품: 용산행(여의도 <-->용산역), 5012번(원효전자상가)  
1. (주)컴퓨터나라(서울 용산구 한강로3가 16-60 한통BD 303)  Tel) 02 705-1616,    
2., 노트북 반품 완료: IG KIG 이정훈 Tel) 02 705-16167  
==============================================================================================================

- 노트북 구입  
제품명: 삼성 센스 NT-Q70A/A1,   가격: 1,313,000원 
(인텔)코어2듀오(산타로사) / T7250 (2.0GHz) / 13.3인치 / 1280x800 / 2.03Kg / 2GB / 160GB / GeForce 8400M G  
http://hantechcni.com/product/productView.php?nProdCode=599812&service_id=pcdn  
판매처: (주) 한테크, Tel) 712-0693  원효전자상가 3층 59호 
-------------------------------------------------  
인증번호: SEC-NT-Q70(B)     모델: NT-Q70A/A1  
제품번호(Serial Number): AV5293BPC0147Y 
사은품: 노트북가방, USB 2GB, 마우스, 마우스 패드(키스킨, 잠금장치 별도 구매: 2만원) 
------------------------------------------------------------------------------   
OS: 윈도우 Vista  Home Premiunum -> 윈도우 XP Professional 다시 깜 
윈도우 Vista  Home Premiunum:(Product-KEY: GD2YW-QBXHR-XQ6BR-XQ3DY-MKBJQ) 
CPU: 코어2듀오(산타로사)/T7250(2.0GHz) 
HD: 160GB(SAMSUNG LH16HJI) 
RAM: 2GB(삼성 램 DDR2 2G PC2-5300S) 
1. Video 카드: NVIDIA GeForce 8400M G --> LCD: 13.3"(1280*800)  
2. Audio 카드: Realtek High Definition Audio 
3. Lan(Network) 카드: Generic Marvel Yukon chipset based Ethernet Controller 
4. 무선 Lan 카드: Intel Wireless Wifi Link 4965AGN 
무게(kg): 12.03KgK(배터리 포함) 
==============================================================================================================

- Video 카드 설치 에러 
1. 삼성 노트북 A/S 사이트(www.zaizen.co.kr)에서 다운 받은 Intel_Int_Graphic_Driver6.14.1.파일 실행시 에러 
 1) 에러내용: 이 시스템은 소프트웨어 설치에 필요한 최소 요청사항을 충족하지 않았습니다.  
 2) 조치: 다른 프로그램 다운 받아서 설치(NT-Q70 XP Geforce) 
 삼성전자 -> 다운로드 센터 -> 개편전 다운로드 자료 
 [비디오]NT-Q70/Q71 윈도우 XP 비디오 드라이버 (Geforce) V.6.14.11.119 
 http://www.sec.co.kr/PCS.svl?CMD=Index_tv&COMM_006=DownloadCenterMain_001&dispNo=012003&dispNoMall=012003&curDepth=2&COMM_001=0000100000 
==============================================================================================================

- 노트북 잠금 장치 비밀번호 설정 
1. 새 비밀번호 설정 
 1) B버튼을 누른 상태에서 자신이 원하는 비밀번호를 설정 
 2) A버튼을 뒤로 밀어주면 B버튼은 원위치로 돌아옴 
 3) 이제 새로운 비밀번호 설정이 완료됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.24(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 22:30 

- 한투. 컴플 Prj
- 프로그램 설치  
==============================================================================================================

- Oracle 설치(Oracle9i 서버) 
Oracle SID: TAMA    tama12  BPM10005: 파일등록 테이블 
- 한투설정 환경 
1. WebServer 
운영서버: 197.198.66.112  weblogic/weblogic 
개발서버: 190.190.155.70 weblogic/bpms01 
개발서버(NT): 190.190.183.223  administrator/2007sys 
2. DB서버 
운영DB: 190.190.151.73  BPMDA,  adbms/adbmsfb0310,  adbms/adbmsfb2006 
운영DB: 190.190.151.102  INFODEV,  adbms/adbms2006,  adbms/adbms0206 
운영DB: 190.190.183.223  BPMS,  adbms/adbms2006,  adbms/adbms0206 
3. 기타 
Source Safe: 190.183.227  administrator/2007sys 
로그 파일 위치: \\190.190.183.223\vocLogs 
==============================================================================================================

- Eclipse 설정 
1. eclipse-SDK-3.2.1-win32.zip 압축을 풀고 eclipse폴더를 C:\eclipse 위치에 복사를 함 
2. 기존에 사용하든 plugin을 C:\eclipse\plugins 위치에 복사를 함 
3. eclipse.exe 더블 클릭하여 실행 
4. 새로작성(W) -> 프로젝트(R) -> java 프로젝트 -> 프로젝트 이름(P): _BPM_TF_Comp  
5. _BPM_TF_Comp(마우스 오른쪽 클릭) -> 팀(E) -> 프로젝트 공유(S) 
   VSS Configration Wizard(다음) -> Share VSS Project 
   username: tamario    password: jtm12 
   VSS Directory: \\190.190.183.227\BPMSourceSafe  ===> 완료(F)  
6. _BPM_TF_Comp(마우스 오른쪽 클릭) -> 팀(E) -> Get Latest Version 
7. _BPM_TF_Comp(마우스 오른쪽 클릭) -> 특성(R) 
 1) 소스(S): 폴더추가(A) -> _BPM_TF_Comp: 확인 
 2) 라이브러리(L): JAR 추가(J)  
------------------------------------------------------------------------------ 

- 테스트 서버에 적용 
1. Eclipse에서 수정을 하고 해당 파일을 복사를 해서 \\190.190.183.223 
sbm\bpmportal\ap\voc\jsp_comp아래 
해당 폴더를 확인한 후 파일을 붙여 넣기함 
2. Eclipse에서 Check out 하면 변경된 내용이 적용이 됨(주의할 것) 

- 소스 구성 
1. BP: (세비온 5.0 -> 6.5로 마이그레이션:2월말 까지 완료할 예정) 
 1) ebmsapps/TF_CMP_AA_1000(홍보물)/jsp/ 
 2) ebmsapps/TF_CMP_AB_1000(계약서)/jsp/ 
 3) ebmsapps/TF_CMP_AB_2000(법무법인 의견)/jsp/ 
2. AP:  
voc 
isr 
comp/adv(홍보물)/ 
        con(계약서)/  TRUE_FRIEND_01   adbms / adbms2006 
law(법무법인 의견)/ 
==============================================================================================================

#---  컴플라이언스 Proj 테스트 DB서버 TNS 연결 DB 환경( adbms / adbms2006)  ==========================  
  TRUE_FRIEND_01 =ㄴ 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST = 190.190.183.223)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SERVER = DEDICATED) 
      (SERVICE_NAME = BPMS) 
    ) 
  )  
==============================================================================================================
     
- 컴플 Prj 담당자  
컴부 이길승 부장,  김흥관 대리 
윤선영씨(T) 3276-4363), *@*.* 
==============================================================================================================

- 컴플 Prj 회의 
1. 16:20 ~16:50 신권선 책임 인수인계 
2. 등록결재 화면 시연(담당자와 협의 후 승인이나면 이광영 팀장에게 보고할 것) 
3. 이광영 팀장에게 일보고 할 것(실적, 예정사항) 
4. 세비아 설치(5.0 -> 6.5) 2월말까지(개발에 영향을 끼칠 수 있음) 
==============================================================================================================

- Proj 계획(예상) 
1. 삼성증권 Project(광화문) 1년,  2. 신한증권 Project(여의도) 1년 
==============================================================================================================

- 인터넷 지로 자동이체 해지 신청 
대구도시가스, 동구케이블방송 
- 전기료 자동이체 해지 신청(한전 홈페이지) 
==============================================================================================================

- 일일 업무 보고(2008.01.24(목)) 
□ 금일 실적 
 - 개발 환경 설정 
 1. Eclipse 설정 
 2. Oracle DB 환경 설정 

□  다음날 계획 
 - 소스 분석 
 1. 계약의뢰 신청 개발  
   1) jsp 화면 작성 
   2) 등록 화면 구성 

□  기타 사항 
- 개발 환경이 안 갖추어져 있어 
개발 착수가 늦어짐 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.25(금) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 22:30 

- 한투 컴플라이언스 Prj
- 페이지 메뉴 등록 
권한관리PM -> 관리 -> 포탈관리 -> 권한/메뉴 관리 ->  
1. 페이지관리    
페이지명: 계약의뢰서 신청 
페이지화면표시명: 계약서 양식등록 
페이지명 등록: /sbm/bpmportal/ap/voc/jsp_cmp/cnt/con_docUpLoad.jsp  
2. 메뉴관리  
상위메뉴명: 계약서 
메뉴명: 계약의뢰서 신청, 메뉴설명: 계약의뢰서 신청, 연결페이지: 계약의뢰서 신청 
3. 권한별 메뉴 연결 
권한명: 시스템 관리자(선택) -> 오른쪽으로 이동  
==============================================================================================================

- 내가 할일 
http://190.190.183.223:8888/sbm/bpmportal/myhome/tasks.jsp 
- 업무계획 등록 - 보기 
http://190.190.183.223:8888/sbm/BizSolo/TF_GEN_AA_1200_Milestone/MilestoneStep.jsp  
- 업무계획 등록 - 수정 
http://190.190.183.223:8888/sbm/bpmportal/ap/voc/jsp_gen/genAA1000/milestonePlanN.jsp 
--> milestonePlanS.jsp 

- 업무계획 등록 - 결재 수정(탭, 결재선 처리) 
http://190.190.183.223:8888/sbm/BizSolo/TF_GEN_AA_1200_Milestone/MilestoneStep.jsp?deptcd=010920&bizno=200712-00182&frominfo=plan  
 1. 승인신청: /sbm/bpmportal/ap/voc/jsp_gen/genAA1000/milestonePlanS.jsp  
 2. 완료: /sbm/bpmportal/myhome/tasks.jsp 
결재라인 팝업: /ap/voc/jsp_genCommon/deptSearch/userDeptSearchP.jsp?fromPop=APPR&deptCd 
==============================================================================================================

- 나의 업무 테이블 
BPM12001: 직원의 소리 정보 
BPM14001: 업무지시 및 업무등록 
BPM14002: 일정계획등록 
BPM14003: 지식분류코드 
BPM14004: 상세계획및실적 
BPM14005: 업무번호채번 
BPM14006: 결재정보마스터 
BPM14007: 결재정보상세 
BPM14008: 첨부파일 분류 
BPM14009: 부서 업무 번호 매핑 
BPM14010: 지식분류코드 
BPM14012: 사용자별 권한 관리  
BPM15001: 수요관리 마스터 정보 
BPM15005: IT검토(협의) 정보 
BPM15015: 업무개발관리 
BPM15017: 업무개발ID관리 
  
- DB 조회 
-- SELECT * FROM BPM14001; 

- 직원의 소리 등록(/ebmsapps/TF_VOC_AB_1000/jsp/EmpEntryStart.jsp) 
 RCVNO           VARCHAR2(11 BYTE)             NOT NULL, 접수번호 
- IT서비스 수요관리 등록(/sbm/bpmportal/ap/voc/jsp_isr/workstep/isr_register.jsp) 
Logger.dbwrap.println(this, "Query:" + query.toString()); 
Logger.dbwrap.println(this, "argValue:" + argValue.toString()); 
==============================================================================================================

- BMP 
1. 키값이나 승인정보는 BMP API에서 주고 받음 
2. 나머지는 Dao 형식의 일반적은 java와 유사 
3. BMP 세비온 실행 --> Process Design(자동으로 화면(html 형식)을 생성해줌) 
==============================================================================================================

- 세션 종료 처리 
에러내용: HTTP 403 권한이 없습니다. 
조치: 테스트 서버(227번 서버)에서 SBM엔진: 종료_1(Portal)(클릭) --> 시작_1(Portal)(클릭) 
==============================================================================================================

- 원룸 관리비 자동이체 설정(HSBC) 
월 11만원, 하나은행: 583-810032-79907 예금주: 여정자, 301호(진태만)_월관리비  
- 상주 곶감 구매(후남이 부탁): 부모님 선물 
779-12-155157 농협 김준태 2만 5천원 
==============================================================================================================

 - 일일 업무 보고(2008.01.25(금)) 
□ 금일 실적  
 1. 계약의뢰 신청 개발 환경 분석  
   1) jsp 소스 분석 
   2) java(Dao, bean) 소스 분석 

□  다음날 계획  
 1. 계약의뢰 신청 개발  
   1) jsp 화면 구성 
   2) 등록 화면 코딩  
==============================================================================================================

- 주간업무 20087년 01월 4째주]  
★ 금주 업무 실적   
1. 개발 환경 설정 
 1) Eclipse 설정 
 2) Oracle DB 환경 설정  
2. 개발 준비 
 1) 소스 분석  
 3. DB 설계 
 1) 공통, 홍보물, 계약서, 법무법인 의견서 DB 작성 
 2) 테이블 목록, 테이블 정의서 작성 
------------------------------------------------------------------- 
  
★ 차주 업무 계획  
1. 컴플라이언스 계약서 업무 개발 
 - 계약서 신청서 업무 개발 
 - 계약서 승인, 반려 업무 개발 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.28(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:30 ~ 23:00 

- 한투. 컴플 Prj
- 계약검토의뢰 신청(/con_deptRegisterN.jsp) 
/src/com/isr/app 
/bean/BPM17012.java 
/dao/CERDAO.java  
- IT서비스 수요관리 등록(/sbm/bpmportal/ap/voc/jsp_isr/workstep/isr_register.jsp) 
- 예정업무관리등록(/sbm/bpmportal/ap/voc/jsp_isr/rscMgt/rscMgt.jsp?isRecent=Y)  
==============================================================================================================

- 나의 업무 테이블  
BPM10099: BPM 시스템의 채번 정보 
BPM15001: 수요관리 마스터 정보 
BPM15002: 수요관리 워크스탭 정보 
BPM15005: IT검토(협의) 정보 
BPM15007: IT검토자  
BPM15008 : 기수별 WEEK 정보 
BPM15015: 업무개발관리 
BPM15016: 업무개발관리 수정이력정보 
BPM15017: 업무개발ID관리 
BPM16005: 수요관리의 첨부파일 정보 관리 

1. 공통  
 1) BPM17001: 담당자 정보: 완료 
 2) BPM17002: 결재선 정보: 완료 
 3) BPM17003: 결재내역 정보보: 완료 
 4) BPM17004: 계약검토 의견 정보: 완료 
 5) BPM17005: 컴부 의견 정보: 완료 그라면   
 6) BPM17006: 첨부파일 정보: 완료     
3. 계약서 
 1) BPM17012: 계약검토의뢰 정보: 완료 
 2) BPM17013: 오프라인 계약검토의뢰 개요 정보: 완료 
 3) BPM17014: 계약서 양식 등록 정보: 완료 
 4) BPM17015: 계약서스캔 정보: 완료  

- DB 조회 
-- SELECT * FROM BPM17012;  
==============================================================================================================

- WebLogic 설치 후 설정 
1. 삼성SDS 최정욱씨가 도와줘서 웹로직은 설정 
2. 기타 환경을 설정 못해서 웹서버로 기능은 못 함(사용 불가능) 
- WebLogic 설정(로컬 서버 세팅) 
1. 콘솔을 실행 . http://localhost:7001/console 
tamario/ssjtm339   domain: BPM_TF_Comp   
2. 설치 에러 
 1) 에러 내용: 로그인시 창이 닫히면서 hs_err_pid 파일 생성  
 2) 원인: Core dump 발생 원인별 테스트 방안  
 3) 조치: 자바 VM 모두 삭제 후 재 설치 
==============================================================================================================

- 웹로직을 이클립스 돌리기 
1. eclipse 사이트에서 webtoolkit  다운 
2. 이클립스에서 아래 설명대로 설치 
이클립스에서 window (창) -> 환경설정 (맨아래) -> MyEcliose -> 
Application Servers -> WebLogic8 하면 
Enable 하고  
웹로직폴더  C:\bea 
C:\bea\weblogic81 
아이디: weblogic 
비번 : 11111111 
C:\bea\user_projects\domains 
mydomain 
myserver 
localhost:7001 
이걸 다하면  WebLogic8안에 들어가서 JDK 에 경로를 잡아줘야한다. 
웹로직폴더에 bea/jdk142_11 폴더만 클릭하면 알아서 들어감.  
웹로직은 jdk 1.4 를 사용해야합니다. 5.0은 안됨! 
Launch -> Run mode 
Paths ->  Log4j 를 사용하기 위해서  jar 파일을 지정해줘야합니다.  
               jar 파일은  commons-logging.jar 과 Log4j.jar 이며 다운받아야함. 
그냥 암데나 지정해놓으면 됨. 저는  bea 안에 lib에 넣었음. 
하지만 배포할때 이클립스가 XML 파일은 만들어 주지 않기 때문에  
WebLogic Builder 에서 classes ( class 파일이 있는곳 ) 에다 놓고 저장만 시키면  
저장!!  xml 파일이 생긴다 . 
==============================================================================================================

- XP 원격 터미널 연결 
http://www.qaos.com/sections.php?op=viewarticle&artid=222  
http://qaos.com/sections.php?op=viewarticle&artid=222&page=2#Server 
개발서버(NT): 190.190.183.223  administrator/2007sys 
==============================================================================================================

- 일일 업무 보고(2008.01.28(월)) 
□ 금일 실적  
 1. 계약의뢰 신청 개발  
   1) jsp 화면 구성  
□  다음날 계획  
 1. 계약의뢰 신청 개발  
   1) jsp 소스 코딩 
==============================================================================================================

- 프라임 저축은행 적금 가입 
상품명: e-골든마우스정기적금 신규계좌번호: 011-02-31-0133712  
예치기간: 36 개월 계약금액: 12,048,750 원  
세금우대여부: 세금우대  월불입금액: 300,000 원  
신규일자: 2008/01/28 기본이율/특별이율: 7.50 % 
만기일자: 2011/01/28 자동이체등록여부: 등록  
다음이체일: 2008/02/25 출금계좌번호: 011-02-13-0086600  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.29(화) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:30 

- 한투 컴플라이언스 Prj
- 계약검토의뢰 신청(/con_deptRegisterN.jsp)  
/dao/CERDAO.java 
Logger.err.println("[/CERDAO.java/insertRSCInfo()]:[rcvno]"+ rcvno +"[BPM17012.getSave_gubun()]"+ BPM17012.getSave_gubun()); 
Logger.err.println("[/con_deptRegisterS.jsp]:[rscMode]"+ rscMode +"[rcvno]"+ rcvno); 
Logger.dbwrap.println(this, "[/CERDAO.java/insertRSCInfo()]:[wsQuery.append]===> \n" + wsQuery.toString());  
Logger.err.println("[/con_deptRegisterN.jsp]: [err]"); 
Logger.info.println(this, "getReportList()");  

- IT서비스 수요관리 등록(/sbm/bpmportal/ap/voc/jsp_isr/workstep/isr_register.jsp) 
- 예정업무관리등록(/sbm/bpmportal/ap/voc/jsp_isr/rscMgt/rscMgt.jsp?isRecent=Y) 
Logger.dbwrap.println(this, "Query:" + query.toString()); 
Logger.debug.println(this, "Query:" + query.toString()); 
Logger.dbwrap.println(this, "argValue:" + argValue.toString()); 
http://localhost:7001/web/bpmportal/cp/TrueFriend/ulogin.jsp 
http://localhost:7001/web/bpmportal/ap/voc/jsp_isr/workstep/isr_register.jsp 
http://localhost:7001/web/bpmportal/ap/voc/jsp_cmp/cnt/con_deptRegisterN.jsp 
http://localhost:7001/web/bpmportal/ap/voc/jsp_cmp/cnt/test.jsp  
==============================================================================================================

- DB 테이블 검증 및 수정(정진우 부장) 
==============================================================================================================

- 자동차 보험 재가입 
1년 341,020원( Tel: 02-368-7771) 
국민은행  839-290114-83859  예금주: 제일화재  
==============================================================================================================

 - LG 파워콤 신청(정홍이에게 가입함) 
경북 포항시 북구 두호동 우광맨션 나동 102호 1030-13 
성명: 진덕근 &  
서울시 관악구 봉천 6동 1687-38 한솔원룸텔 301호  
복지카드: Fax) 02-6917-6300,  HP) * 
==============================================================================================================

 - 일일 업무 보고(2008.01.29(화)) 
□ 금일 실적  
 1. DB 테이블 검증 및 수정: 완료 
□  다음날 계획  
 1. 계약검토의뢰 신청(con_deptRegisterN.jsp) 개발: 진행중(진척도: 60%) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.30(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:00 

- 한투 컴플라이언스 Prj
- 계약검토의뢰 신청(/con_deptRegisterN.jsp) 
결재선, 파일 업로드 
/src/com/isr/app 
/bean/BPM17012.java 
/dao/CERDAO.java 

1. 결재선 지정 
http://190.190.183.223:8888/sbm/BizSolo/TF_GEN_AA_1200_Milestone/MilestoneStep.jsp?deptcd=010920&bizno=200712-00182&frominfo=plan  

결재정보 마스터 정보(BPM17002) --> 결재정보 마스터(BPM14006) 
결재정보 상세 정보(BPM17003) --> 결재정보 상세(BPM14007) 
첨부파일 정보(BPM17007) --> 첨부파일 정보(BPM10005) 
-- 결재정보 마스터 정보 조회 
SELECT * FROM BPM14006 ORDER BY REGDT DESC;  
-- 결재정보 상세 정보 조회 
SELECT * FROM BPM14007; 
-- 첨부파일 정보 조회 
SELECT * FROM BPM10005 ORDER BY RGTDT DESC; 

2. 직원검색(팝업) 
http://190.190.183.223:8888/sbm/bpmportal/ap/voc/jsp_genCommon/deptSearch/userDeptSearchP.jsp?fromPop=APPR&deptCd=010920  
3. 파일등록 
http://190.190.183.223:8888/sbm/bpmportal/ap/voc/jsp_common/comFile/comFileUploadP.jsp?fromPage=CPL&atchFlSeq= 
Logger.debug.println("[/CERDAO.java/insertRSCInfo()]:[rcvno]"+ rcvno +"[BPM17012.getSave_gubun()]"+ BPM17012.getSave_gubun());  
Logger.err.println("[/CERDAO.java/insertRSCInfo()]:[rcvno]"+ rcvno +"[BPM17012.getSave_gubun()]"+ BPM17012.getSave_gubun()); 
Logger.err.println("[/con_deptRegisterS.jsp]:[rscMode]"+ rscMode +"[rcvno]"+ rcvno); 
Logger.dbwrap.println(this, "[/CERDAO.java/insertRSCInfo()]:[wsQuery.append]===> \n" + wsQuery.toString());  
Logger.err.println("[/con_deptRegisterN.jsp]: [err]"); 
Logger.info.println(this, "getReportList()");  
==============================================================================================================

- 직원정보 조회 
SELECT a.empcd, a.empnm, a.emptelno, a.userregno,  a.emptelno, 
a.deptcd, a.dutycd, a.jikgubcd, USERCONTACTS, EMAILADR,  
(SELECT deptnm FROM adbms.bpm10001 WHERE TRIM(deptcd) = TRIM(a.deptcd)) deptnm,  
(SELECT dutynm FROM adbms.bpm10002 WHERE TRIM(dutycd) = TRIM(a.dutycd)) dutynm,  
(SELECT jikgubnm FROM adbms.bpm10003 WHERE TRIM(jikgubcd) = a.jikgubcd) jikgubnm  
FROM adbms.bpm10004 a  
WHERE a.retiredt IS NULL   
   AND a.cotpcd = 'C1' 
--; 
==============================================================================================================

- DB 테이블 검토 회의(고객 시스템부: 이광영 차장, 여진수 대리) 
1. 접수번호 별도 관리(부서별 접수번호 존재 여부 확인) 
2. 검토내역 정보 복수개 저장 가능 
==============================================================================================================

 - 일일 업무 보고(2008.01.30(수)) 
□ 금일 실적  
 1. DB 테이블 검토 회의(고객 시스템부: 이광영 차장, 여진수 대리) 
 2. 계약검토의뢰 신청(con_deptRegisterN.jsp) 개발: 결재선 등록: 진행중(진척도: 80%) 
    
□  다음날 계획  
 1. 계약검토의뢰 신청(con_deptRegisterN.jsp) 개발: 결재선 등록 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2008.01.31(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:00 

- 한투 컴플라이언스 Prj
- 계약검토의뢰 신청(/con_deptRegisterN.jsp) 
결재선, 공람가능인 저장 
/src/com/isr/app 
/bean/BPM17014.java,  BPM17007.java 
/dao/ComplianceDAO.java 
- 계약서 목록(/con_listL.jsp) 
http://190.190.183.223:8888/sbm/bpmportal/cp/TrueFriend/ulogin.jsp  
- 로그 파일 위치(SBM 6.5): \\190.190.183.223\sbm65Web\vocLogs   
--------------------------------------------------------------------------------------------- 

 - 예정업무관리 List(/sbm/bpmportal/ap/voc/jsp_isr/rscMgt/rscMgtL.jsp)    
1. 결재선 지정 
http://190.190.183.223:8888/sbm/BizSolo/TF_GEN_AA_1200_Milestone/MilestoneStep.jsp?deptcd=010920&bizno=200712-00182&frominfo=plan  

결재정보 마스터 정보(BPM17002) --> 결재정보 마스터(BPM14006) 
결재정보 상세 정보(BPM17003) --> 결재정보 상세(BPM14007) 
첨부파일 정보(BPM17007) --> 첨부파일 정보(BPM10005) 
-- 결재정보 마스터 정보 조회 
SELECT * FROM BPM14006 ORDER BY REGDT DESC;  
-- 결재정보 상세 정보 조회 
SELECT * FROM BPM14007; 
-- 첨부파일 정보 조회 
SELECT * FROM BPM10005 ORDER BY RGTDT DESC;  
==============================================================================================================

-- 데이블 수정시 FOREIGN KEY 등록 
 ALTER TABLE BPM17010  
ADD CONSTRAINT RCVNO_FK FOREIGN KEY (RCVNO)  
REFERENCES BPM17014(RCVNO) ;  
-- 데이블 수정 규정 
ALTER TABLE테이블이름  
ADD CONSTRAINT 제약조건명 제약조건유형(컬럼명1,컬럼명2);   
==============================================================================================================

- DB 테이블 검토 회의(신권선 책임, 고객 시스템부: 이광영 차장, 여진수 대리) 
1. 접수번호 별도 관리(홍보물: 20080131-A-001, 계약서: 20080131-B-001, 법무법인 의견서:20080131-C-001) 
2. 광고 종류 정보(기타부분 컴플라이언스부와 협의: 이광영 차장) 
3. 의견 정보들을 결재이력에 통합(자문팀 의견 정보, 컴부 의견 정보, 계약검토 의견 정보) 
4. 첨부파일 정보 이력 관리 
5. 담당자 정보 마스터 정보에 통합 
==============================================================================================================

- 팩스 보내는 법(신도리코 복합기: 한투증권) 
1. 종이를 내용이 뒤로 보이게 복합기 선반(맨 뒤쪽)에 꽂는다. 
2. 9번을 누르고 보낼 팩스번호(02-6917-6300)를 누름 
3. 복사/시작을 누름 
==============================================================================================================

- 일일 업무 보고(2008.01.31(목)) 
□ 금일 실적  
 1. DB 테이블 검토 회의(신권선 책임, 고객 시스템부: 이광영 차장, 여진수 대리) 
 2. 컴플라이언스 자문업무 데이터 모델 ERD 수정: 완료 
  
□  다음날 계획  
 1. 계약검토의뢰 신청(con_deptRegisterN.jsp) 개발: 결재선 등록 
==============================================================================================================

- 고속버스 예약: 완료 
2008.02.05(화) 23:45  서울 -> 동대구  심야 우등: 23,800원 
2008.02.08(금) 24:00  포항 -> 서울     심야 우등: 30,500원(일반:18,600원, 우등: 27,700원) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■