

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2009.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2009.04.01(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 조기축구(06:40 ~ 07:40): 차몰고 감(6:2 승), 이과장 방문(낙성대집)

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(2군데)
==============================================================================================================

- 기술사 왕초보반 동영상 강의
[왕초보_과정안내] 과정 및 입과 안내, 강사: 이성몽
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(1군데)
==============================================================================================================

- 기술사 왕초보반 동영상 강의
[IT인텔리젼스_과정안내] 오픈세미나, 강사: 안상훈
[IT인텔리젼스_맛보기강의] 오픈세미나, 강사: 채승기/ 박동현
IT인텔리젼스_맛보기강의] 시큐리티프레임웍, 강사: 이성몽
[IT인텔리젼스_맛보기강의] 디지털컨버젼, 강사: 이원석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.03(금) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(1군데): 기업은행 SM -> (주)운화 정보시스템
==============================================================================================================

- 기술사 왕초보반 동영상 강의
토픽 정리(하루에 1개: 주말 3개) ==> 이원석 기술사
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 기술사 왕초보반 첫 강의(동국대 혜화관 502호)

[기술사왕초보반]

- 기술사 왕초보반 첫 강의
1. 기술사란
2. 모의 시험(3문제 적기)
3. 자기 소개
-------------------------------------------------------------------------------------------

- 도서 구매
IT Framework (정보처리기술사 학습서) 30% 할인 (6만원-> 42,000원)  ==> 송금 완료
http://www.yes24.com/24/goods/3272640
==============================================================================================================

- 인포레버(http://www.infoever.co.kr) 교육과정
1. IT인텔리전스 교육
25기 교육기간: 09.06.27 ~ 09.09.26(13주) ==> 90회 검정대비(10년 02월 말)
26기 교육기간: 09.05.17 ~ 09.08.30(12주) ==> 89회 검정대비(09년 08월 16(일))
27기 교육기간: 09.08.29 ~ 09.11.14(11주) ==> 90회 검정대비(10년 02월 말)

2. 파워스터디 교육과정
22기 교육기간: 09.10.17 ~ 10.02.06(15주) ==> 90회 검정대비(10년 02월 말)
23기 교육기간: 09.11.21 ~ 10.02.06(12주) ==> 90회 검정대비(10년 02월 말)
==============================================================================================================

- 1회용국(복어국, 미역국), 마우스, 국그릇, 소음방지용 귀마개(이어 플러그), 프린터
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.06(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  --> 관악도서관 첫날(도서대출증 재발급)

- A 프로젝트
- IT Framework (정보처리기술사 학습서): 10H
1. 소프트웨어공학
2. 데이타베이스
==============================================================================================================

- 글빛 정보 도서관(서울시 관악구 삼육길 23,   T)878-7460): 수요일 휴관
- 봉천2동 작은도서관(서울시 관악구 관서길 10 상가건물 5층, T)877-7182): 화요일 휴관
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.07(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00  --> 글빛 정보 도서관 첫날

- A 프로젝트
- IT Framework (정보처리기술사 학습서): 10H
3. 엔터프라이즈 서비스
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 봉천2동 작은도서관

- A 프로젝트
- IT Framework (정보처리기술사 학습서): 10H
4. 디지털 컨버전스
5. 컴퓨터 아키텍처
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 글빛 정보 도서관, 호프집(이과장, 낙성대집)

- A 프로젝트
- IT Framework (정보처리기술사 학습서): 8H
6. 네트워크
7. 시큐리트 프레임웍
8. 수치해석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 14:00  --> 글빛 정보 도서관, 현용, 임모 만남(술: 다음주 부터 현용 CISA수강), 이과장 방문(낙성대집)

- A 프로젝트
- IT Framework (정보처리기술사 학습서): 6H
답안 작성 요령
==============================================================================================================

- 주식
월(3,195), 화(3,170), 수(3,645), 목(3,870), 금(3,935)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.11(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 13:40  --> 기술사 왕초보반 두번째 강의(동국대 혜화관 502호)

- 기술사왕초보반2
- 기술사 왕초보반 강의(2번째)
1. 기술사 시험의 특징
 1) 시험응시 많이 해야 함
 2) 전체적인 View(마인드 맵) 갖기
2. 모르는 문제 해결 방법
 1) 답안 아키텍처
 2) 전체적인 View(마인드 맵) 갖기
3. 기술사 공부 = 토픽 작성(150개) -> 표, 그림
4. 기출문제 분석
5. 원맵으로 토픽장성(6칸 중 1칸은 비워둘 것)
6. 모의 시험(2번째)
7. 자기소개(발표: 프리랜서, ISP 충격, IT기반지숙 숙달 => 전문가)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.13(월) 작업 ■■■■■■■■■■■■■■■■
---> 09:30 ~ 18:00  --> 이과장 방문(맥주집, 낙성대집)

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(5군데)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(3군데)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.15(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 조기축구, (주)인스케어 방문,  (주)한우리시스템(신사장 면담), 이과장 방문(낙성대집)

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(3군데)
==============================================================================================================

- SW기술자 신고제 재접수(3번째 감)
1. (주)시스웹, 인트로시스템(주)  --> 국민연금 증명서 출력(칼라:천원(2장)): 알파 문구(흑백:백원)
2. (주)인스케어 -> 소프트웨어기술업무_전담부서_확인서
3. (주)한우리시스템 -> 기술경력증명서
KOSA 담당: 김경희 T)2188-6987
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.16(목) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 면접(대우증권 AML: 서울역 12번 출구  15시), 이과장 방문(삼계탕, 낙성대집)

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(3군데)
==============================================================================================================

- 마루정보 
상호명 : (주)마루정보, 대표자명: 신유식
사업자번호 :  
본사주소 : 서울시 영등포구 여의도동 14-13 가든빌딩 705호
T) 761-0658, *@*.*
==============================================================================================================

전자공시시스템: http://dart.fss.or.kr/dsab001/main.do?autoSearch=true#
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.04.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 계약서 작성(13시 여의도 (주)마루정보 사무실)

- A 프로젝트
- 기술인력 사용 개별 계약(계약번호: 2009-0417, (주)마루정보)
1. 사업명: 대우증권 AML DATA Mart 구축
2. 계약기간: 2009년 04월 23일(목) ~ 2009년 10월 22일(목)(6개월)
3. 계약금액: 월 430만원
4. 급여일자: 매월(01~30)급여는 익월 15일 지급 
5. 발주처: (주)대우증권
6. 시행사: 케이씨씨정보통신(주)
7. 개발장소: 대우증권IT센터(경기도 과천시 중앙동 38번지)
  지하철 4호선 정부과천청사역 11번출구, 버스 9-3(적), 9(적)(정보과천청사역 2번 출구 정류장)
==============================================================================================================

- 지식창고 자료(인포레버) 다운로드
01. 소프트웨어공학
02. 데이터베이스
==============================================================================================================

- 주식
월(4,145), 화(4,200), 수(4,200), 목(4,830), 금(4,110)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.18(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 조기축구, 이과장 집방문(차로 프린터 가져옴)

- 기술사왕초보반3
- 기술사 왕초보반 강의(3번째): 이승현 기술사
- 몽 서브노트 양식 (원맵) 사용법 안내 및 실습
- 전공서적에서 답안 컴포넌트 도출, 자료에서 답안 컴포넌트 도출 하기 실습
- 인포레버 (기술사 양성기관) 과정 소개 및 왕초보 특별 할인 혜.택. 깜짝 공개^^ 
  IT인텔리젼스, 파워스터디: 총 346만5천원을 총 310만원으로 DC(13%) => 최대 46만5천원까지 할인
- 숙제(토픽) 검토 - 잘한 부분, 부족한 부분 토의
- 기술사 학습에 필요한 자료, 프로세스(학습과정), 관리, 스터디 설명
- 시상식: 사전학습 최우수 학습자 3명, 덧글왕, 참부자상 
==============================================================================================================

- 지식창고 자료(인포레버) 다운로드
이과장이 도와줌
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.04.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 이과장 방문(강남구청장배 수훈상 축하, 낙성대집)

- A 프로젝트
==============================================================================================================

- 원맵 작성
 DATA Mart
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.21(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- KOSA 방문(16:00)
소프트웨어기술 경력증 수령(제 2009-002105호, 등급: 고급 기술사, 등급 취득일: 2008-06-22)
- 키카 본사 방문(서울 동대문운동장역)
서울 관악구 봉천6동 34-6호 / 관동스포츠 / 02) 878-0011
서울 강남구 역삼동 701번지 월드스포츠(공무원 연금공단) 02) 560-3480 
==============================================================================================================

- 지식창고 자료(인포레버) 다운로드
1. 등록 완료
==============================================================================================================

- 프린터 설정(이과장꺼 빌림)
1. 삼성 레이저 프린터(ML-4300i)  ==> 삼성전자 A/S센타 T)1588-3366
http://www.prinity.com/support/problem/check.asp  ==> 프린터 자가 진단
2. 연결 안됨: 
원인: 장치관리자에서 포트 안 보임
조치: BIOS 셋업(DEL)에서 
Onboard Parallel Port에서 Disabled -> 378/1RQ7로 변경
==============================================================================================================

- 빡쎈닷컴(ID: 234969, PW:ssjtm8****)
http://www.bagxen.com
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 대우증권 첫 출근, 이과장 방문(낙성대집, 인도로 3개월 개발 통보)

- 대우증권 AML Prj
- 기술인력 사용 개별 계약(계약번호: 2009-0417, (주)마루정보)
1. 사업명: 대우증권 AML DATA Mart 구축
2. 계약기간: 2009년 04월 23일(목) ~ 2009년 10월 22일(목)(6개월)
3. 계약금액: 월 ***만원
4. 급여일자: 매월(01~30)급여는 익월 15일 지급 
5. 발주처: (주)대우증권
6. 시행사: 케이씨씨정보통신(주)
7. 개발장소: 대우증권IT센터(경기도 과천시 중앙동 38번지)
  지하철 4호선 정부과천청사역 11번출구, 버스 9-3(적), 9(적)(정보과천청사역 2번 출구 정류장)
8. 제안설명회: 2008.12.23
==============================================================================================================

- 대우증권(주) 
류제윤 차장(PJT지원총괄): HP)010-9048-9149, 전진 과장(컴플라이언스부): HP)010-8300-8047
- KCC정보통신(주)
하필숙 차장: HP)010-4337-2647, 여건구 과장: HP)010-7907-9463
구경탁 과장: HP)010-9368-1321, 임재홍 과장: HP)011-9098-0718, 박형준 대리:HP)010-6330-3488
김대광 주임: HP)010-6625-1235, 이혜진 사원: HP)010-9380-3561
- 한국증권정보기술(주)
김영란 차장: HP)016-9244-5137,  윤찬호 대리: HP)018-571-4357
정명철 사원: HP)010-9816-0100
---------------------------------------------------------------------------------------------------------
(주)키엔시스 IT 마케팅본부장 / 이사 박성배(http://www.kiensys.com)
Tel : 070-7019-6010, 070-7019-6120, (02)929-6558(대표)
HP : * Fax:(02)929-6505 mail: *@*.*
주소: 서울시 중구 쌍림동 151-11 쌍림빌딩 6F 619호
==============================================================================================================

- 대우증권 DM Proj 네트웍(IP 주소)
IP: 150.10.197.227 G.W: 150.10.197.1
S.M: 255.255.255.0 DNS: 210.92.0.4
- 프린터 설정
hp cm8060 mfp with edgeline pcl6
프린터 IP: 150.10.197.241
==============================================================================================================

- 대우증권 운영 및 개발을 위해 제공하는 Site
http://open.it.bestez.com
- Norton 백신 설치
http://160.10.181.203:8080/install
http://150.10.197.233
- 미스리 메신저(http://www.misslee.net) 설치
---------------------------------------------------------------------------------------------------------

- 주요 업무
레거시(legacy:유산) 데이타를 ETL을 통하여 SAM File로 내리기(ETL툴 이용, Procedure 이용 고민)
ETL 1단계: 고객, 거래, 계좌, 상품 등의 데이터를 ETL 을 통하여 1차로 SAM File 형태로 전송
ETL툴: 테라스트림은 타사 제품에 비해 최고의 속도를 자랑하며 금융권에서 요구하는 다양한 요구사항을 반영해 
호평을 받고 있다. 특히 새로운 개념의 데이터 처리 아키텍처를 이용, 원천 데이터를 한번 가공해서 여러 용도로 
사용할 수 있어 작업시간을 최소화하는 한편 시스템 자원 부담도 줄인 것이 특징이다.
--------------------------------------------------------------------------------------------

STR(Suspicious Transaction Report): 혐의 거래 보고서
ProFrame: 티맥스소프트(www.tmax.co.kr)에서 개발한 애플리케이션 프레임워크 솔루션이다. 오픈시스템 환경에 
적용할 수 있는 제품이며, TP와 WAS의 두가지 버전이 존재있다.  
AML 시스템: Mantas Solution(거래 모니터링, 혐의거래 상세분석, STR)
KYC(Know Your Customer): 신분 확인
KOFIU(Korea Financial Intelligence Unit, 금융정보분석원) 금융기관을 이용한 범죄자금의 자금세탁 방지 및 외화
의 불법유출을 막기 위해 설립된 재정경제부 소속기관 
ETL(Extraction Transformation Loading, ETT와 동의어): 다양한 소스시스템(Source System)으로부터 필요한 
데이터를 추출(Extract) 하여 전환(Transformation) 작업을 거쳐 타겟 시스템(Target System)으로 전송 및 로딩
(Loading)하는 모든 과정
SAM File(Sequentil Access Method File) 순차 파일로, 직접 파일과 대조되는 것으로 쉽게 말해 레코드를 순차적
으로 기록해 놓은 파일
FSDM(Financial Service DATA Mart): 금융 서비스 데이타 마트
TMS(Transaction Monior System): 거래 모니터 시스템
DIS(Data Interface Specification): 데이타 인터페이스 명세
informatica: Business and Market Schemas를 Mantas Schemas로 바꾸는 과정
LDAP(Lightweight Directory Access Protocol): 조직이나, 개체, 그리고 인터넷이나 기업 내의 인트라넷 등 네트웍 
상에 있는 파일이나 장치들과 같은 자원 등의 위치를 찾을 수 있게 해주는 소프트웨어 프로토콜 
==============================================================================================================

+-------------------------------------------------------------------------------+
 2009.04.23(목) 작업 
■■■■■■■■■■■■■■■■■■ 2009.04.01(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:00  --> 회식(KCC 직원: 호프집)

- 대우증권 AML Prj
- DIS 분석
DIS: 클라이어트가 Ingestion Manager에게 반드시 제공하게 되는 소스 비즈니스 데이타와 마켓 데이타의 형식
을 정의한다. DIS는 Ingestion 매니저가 데이타 도착을 인식하고 그것의 context를 해석하고 Oracle Mantas Beha
-vior Detection Platform 5.7.2 DIS가 어떤행동(xxx)을 하기 위해 사용할 프로토콜을 명시한다.
DIS는 클라이언트가 소스 비즈니스 데이타를 Oracle Mantas에게 전달하기 위해서, 설계하고 구현한 프로세스와 
프로시져의 상세한 인터페이스를 설명해준다. 이 가이드는 Ingestion Manager가 사용하는 데이타의 형식과 내용
을 설명한다. 이 데이타는 텍스트 형태의 마켓 데이타의 형태로 제공되어 있다.
Ingestion Manager는 이 소스 데이타를 수신하고 behavior를 제공하는 다른 Oracle Mantas components가 사용 
가능하게끔 데이타를 가공한다.
--------------------------------------------------------------------------------------------

- DIS Data
1. Account Data
 1) Account 테이블
1 Mantas Account Identifier(ACCT_SEQ_ID) CHAR(50)
2 Account Identifier(ACCT_INTRL_ID) CHAR(50)
3 Alternate Account Identifier(ALT_ACCT_ID) CHAR(50)
4 Account Display Name(ACCT_DSPLY_NM) CHAR(50)
 2) Account Address 테이블
1 Account Identifier CHAR(50)
2 Address Record Number NUMBER(3)
3 Address Purpose CHAR(20)
2. Customer Data
 1) Customer 테이블
1 Customer Identifier CHAR(50)
2 Financial Profile Last Update Date DATE
3 Domiciled Organization CHAR(50)
 2) Customer Address 테이블
1 Customer Identifier CHAR(50)
2 Address Record Number NUMBER(3)
3 Address Purpose CHAR(1)
3. Enterprise Data
 1) Organization 테이블
1 Organization Identifier CHAR(50)
2 Alternate Organization Identifier CHAR(50)
3 Organization Name CHAR(50)
 2) Organization Relationship 테이블
1 Organization Identifier CHAR(50)
2 Related Orga nization Identifier CHAR(50)
3 Relationship Type CHAR(20)
4. Security Data
 1) Security 테이블
1 Security Identifier CHAR(50)
2 Alternate Security Identifier CHAR(50)
3 CUSIP Identifier CHAR(9)
 2) Mutual Fund Breakpoint 테이블
1 Security Identifier CHAR(50)
2 Breakpoint Upper Amount - Issuing NUMBER(28,8)
3 Breakpoint Lower Amount - Issuing NUMBER(28,8)
5. Market Data
 1) Market Center 테이블
1 Market Center Identifier CHAR(50)
2 Market Center Type CHAR(2)
3 Market Center Name CHAR(50)
 2) Market Trading Session 테이블
1 Market Center Identifier CHAR(50)
2 Market Session Identifier CHAR(20)
3 Market Session Name CHAR(20)
6. Trade Data
 1) Order 테이블
1 Order Identifier CHAR(50)
2 Order Event Number NUMBER(10)
3 Order Placement Date DATE
 2) Trade Execution 테이블
1 Trade Execution Identifier CHAR(50)
2 Trade Execution Event Number NUMBER(10)
3 Trade Execution Event Type Code CHAR(2)
7. Transaction Data
 1) Front Office Transaction 테이블
1 Transaction Reference Identifier CHAR(50)
2 Transaction Group CHAR(50)
3 Transaction Type 1 Code CHAR(20)
 2) Insurance 테이블
1 Insurance Transaction Reference Identifier CHAR(50)
2 Insurance Policy Identifier CHAR(50)
3 Mantas Transaction Asset Class CHAR(20)

NUMBER 예제 ====> NUMBER(5,2) is 999.99
--------------------------------------------------------------------------------------------

- Account 테이블 생성 ==> Mantasm 솔루션에서 자동생성해 줌
CREATE TABLE ACCT (  
ACCT_SEQ_ID CHAR(50),
ACCT_INTRL_ID CHAR(50),
ALT_ACCT_ID CHAR(50),
ACCT_DSPLY_NM CHAR(50)
);
-------------------------------------------------------------------

- Account 테이블 저장(Procedure 형태로 등록) ==> Mantasm 솔루션에서 자동생성해 줌
INSERT INTO ACCT
(
  ACCT_SEQ_ID, ACCT_INTRL_ID, ALT_ACCT_ID, ACCT_DSPLY_NM 
)
SELECT
(SELECT COUNT(*) FROM ACCT_legacy) ACCT_SEQ_ID,
ACCT_INTRL_ID,  ALT_ACCT_ID, ACCT_DSPLY_NM
FROM ACCT_legacy
--;
==============================================================================================================

- 조사할 토픽: DATA Mart, KYC, ETL
출입증: 2607
DB담당: 이리스 김대후 차장(HP)*)

- 정품 알람 제거
현상: Microsoft Office 사본은 정품이 아닙니다
조치: C:\WINDOWS\system32\WGATray.exe 파일 삭제(GATray.exe를 잘라내기해서 다른곳에 붙여넣기 
한 다음에 리부팅후 삭제)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.24(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00  --> 이과장 방문(낙성대집)

- 대우증권 AML Prj
- AML 분석
Business_Schema
Matas_Schema
--------------------------------------------------------------------------------------------

- 1차 ETL 작업( 대우증권 legacy DB ==> SAM fIle) 
1. Account 테이블 생성 ==> Mantasm 솔루션에서 자동생성해 줌
1 Account Identifie(ACCT_INTRL_ID)  CHAR(50)
2 Alternate Account Identifier(ALT_ACCT_ID) CHAR(50)
3 Account Type 1(ACCT_TYPE1_CD) CHAR(50) 

2. 대우증권DB를 ETL을 통하여 SAM fIle을 만들어서 내용 저장(ETL툴(informatica) 구매여부 결정 안됨)
==> ETL툴 구매 못 하면 Batch 작업으로 개발해야 함(참조: ProC나 Procedure)
SELECT
(SELECT COUNT(*) FROM ACCT_legacy) ACCT_INTRL_ID,
ALT_ACCT_ID, ACCT_TYPE1_CD
FROM ACCT_legacy
--;

3. SAM fIle Name 형식: Account_<YYYYMMDD>_<BATCH NAME>_<N>.dat
Account_20090423_BCAccount_1.dat, Account_20090423_BCAccount_2.dat

4. Account_20090423_D_1.dat 내용 ==> (D:Daily, W:Weak, M:Month)
1~2~3
1~3~3
==============================================================================================================

- ProC
1. SOURCE에 포함되어 있는 Embedded SQL문을 SQLLIB의 Function으로 SOURCE코드를 생성시켜 C SOURCE로 
전환해 주는 프리 컴파일러
2. *.pc -> *.c -> *.o 순으로 컴파일
http://www.hbkr.net/zboard/zboard.php?id=dev_proc
==============================================================================================================

- 주식
월(4,110), 화(3,815), 수(3,880), 목(3,880), 금(3,830)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.27(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00  --> 인력 투입(구과장, 임과장, 박대리), 이과장 방문(낙성대집)

- 대우증권 AML Prj
- 대우증권 AML Proj PT 및 회의
개발완료 예정: 9월 21일(KYC), 9월 21일(ETL)
ETL: Transaction(거래): 테이블 구조 분석
---------------------------------------------------------------------------------------------------------

- Transaction Data
1. Front Office Transaction: 본사 거래
2. Front Office Transaction Party: 본사 거래 집단
3. Back Office Transaction: 비영업(배후) 부문 거래
4. Insurance Transaction: 보험 거래
---------------------------------------------------------------------------------------------------------

- Basic Scenarios 분석
1. High Risk Transactions - Focal High Risk Entity
2. High Risk Transactions - High Risk Counterparty
3. Journal Between Unrelated Accounts
4. Rapid Movement of Funds - All Activity
5. Escalation in Inactive Account
6. Structuring - Avoidance of Reporting Thresholds
7. Single or Multiple Cash Transactions - Possible CTR
8. Single or Multiple Cash Transactions - Large, Significant Transactions
9. Large Reportable Transactions
10. Large Depreciation of Account Value
==============================================================================================================

- 파일 서버
\\150.10.197.233\daml
kcc/daml123, aml/aml123
==============================================================================================================

- OZ 파워팩 해지 처리 완료
1. 표준요금제, 부가 서비스:  OZ 파워팩(한달 후에 취소할 것)
2. 구매처(한주텔레콤(주) 강남 2호점 김대일 T)070-7548-5519     
   (서울시 강남구 역삼동 82-1 강남역 지하상가 F-8호)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.28(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:30  --> 이과장(김밥, 아침 버스(9-3번) 같이 탐), 중식 식권 구입(장당 3천원:13장): 아라코(주)

- 대우증권 AML Prj
- Basic Scenarios 분석
1. High Risk Transactions - Focal High Risk Entity(고위험 거래 - 초첨 고위험 엔티티)
Uses risk factors identified from Watch List entries for known risky clients. These
entries are specified by an account, customer, name or ID (e.g. tax ID). This scenario
monitors transactions to and from high-risk entities during a specified Lookback Period.
위험 인자들을 알려진 위험 고객들에 대해 Watch List가 출입 하는데 확인용으로 사용하라.
이 출입은 계좌, 고객, 이름, ID에 의해 열거된다. 이 시나리오는 상술된 Lookback 기간
동안 고위험 출입과 거래를 모니터 한다.
2. High Risk Transactions - High Risk Counterparty(고위험 거래 - 고위험 당사자)
Identifies accounts, customers, households, Correspondent Banks, or external entities
that may be considered to be at risk based on the number and amount of transaction
activity involving specified high-risk entities or geographies.
상술된 고위험 엔티티 또는 지리를 포함하는 거래활동의 양과 수에 기초해서 위험을 고려한
계좌와 거래, 가족, 대리 은행 또는 외부 엔티티를 확인하라.
3. Journal Between Unrelated Accounts(관계없는 계좌들 사이의 일지)
Detects an account that conducts journal transactions to one or more unrelated
accounts. A journal transaction is considered unrelated when the transaction
occurs between accounts that are not in the same household, are not known to
have a formal relationship, and have no common customers.
일지 거래가 하나 또는 그 이상 관계없는 계좌들이 행하는 계좌를 탐지하라.
거래가 같은 가족가 아니고, 즉 공식 관계를 가지지는 것이 알려지지 않은, 
공통 거래처를 가지지 않은 계좌 사이에서 일어났을 때 일지 거래가 무관하게
고려 되어 진다.
4. Rapid Movement of Funds - All Activity(자금의 빠른 이동 - 모든 활동들)
Identify funds moving rapidly in and time out of an account or entity within a relatively short period of time. The
scenarios detect aggregate deposits exceeding a conditional threshold that are followed by disbursements
with a similar aggregate value. The velocity of funds may be measured against the balance or net worth of
the account.
상대적으로 짧은 시기에 계좌 또는 엔티티에서 중간 휴식과 빨리 움직이는 자금를 확인하라. 시나리오는
유사한 총 값으로 지출에 따르는 조건 변수를 초과하는 총입금을 탐지한다. 자금 속도는 계좌의 순 가치와
조화를 배경으로 측정되어 진다.
5. Escalation in Inactive Account(활발하지 않은 계좌에서 단계적 확대)
Detects sudden activity in a previously dormant account. The scenario generates
an alert when a transaction exceeding conditional thresholds occurs in an account
that was dormant (no activity) for a specified period of time.
이젠에 휴먼 계좌에서 갑자스런 활동을 탐지하라. 조건 변수를 초과한 거래가 상술된 
기간에 휴먼인 계좌에서 일어났을 때 시나리오는 경보를 뛰운다.
6. Large Depreciation of Account Value(계좌 가치의 큰 가치하락)
This scenario detects situations in which an account experiences a significant
decrease in the net worth due to one or more disbursements. The scenario
monitors for at least one debit transaction during the frequency period. If a debit is
detected, the scenario calculates the account depreciation (total withdrawals less
total deposits) over the look-back period.
시나리오는 계좌가 하나 또는 그 이상의 인출로 인해서 순가치의 중요한 감소를 경험한 상황을 탐지한다.
시나리오는 frequency 기간 동안 적어도 하나의 빚거래에 대해 모니터링 한다. 만약 빚이 탐지되면 사니리오는
계좌 가치하락(총출금이 총입금보다 적게)이 look-back 기간 이상으로 계산한다.
7. Structuring - Attempts to Avoid Reporting Thresholds(구조 - 리포팅 변수들 회피 시도)
Identifies instances a transaction deposit or monetary of transaction, or purchase of instrument
in an amount just under applicable reporting thresholds, or multiple transactions over a
specified look back period that are just under applicable reporting thresholds.
거래 예금 또는 통화 거래 또는 적용할 수 있는 리포팅 변수 아래에 많은 기구 용도 또는 적용할 수 
있는 리포팅 변수 아래 상술된 look back 기간 동안 복수 거래 사례를 알려라.
8. Single or Multiple Cash Transactions - Possible CTR(하나 또는 복수의 현금 거래들 - 가능성 있는 CTR)
These scenarios detect instances of a single deposit or withdrawal over the CTR
threshold, or multiple deposits or withdrawals over the current and previous business
day that aggregate over the conditional threshold.
이 시나리오들은 CTR 변수에 대해 하나의 예금 또는 인출 또는 조건 변수 대해 합계된
현재 이전의 사업일에 대해 복합 입금 또는 인출 사례를 탐지한다.
9. Single or Multiple Cash Transactions - Large, Significant Transactions(하나 또는 복수의 현금 거래들 
   - 크고 중요한 거래들)
This scenario detects a single large cash transaction, or a series of smaller cash
transactions, that aggregate above a conditional threshold during a specified period of time.
시나리오는 상술된 기간 동안 조건 변수 이상으로 모아진 하나의 큰 현금 거래 또는 더 작은 현금 거래들을
탐지한다.
10. Large Reportable Transactions(크고 보고할 만한 거래들)
Scenario detects transactions that exceed regulatory or internal firm reporting
requirement limits. Allows for different thresholds for new versus seasoned relationships.
시나리오는 규제나 내부 회사 리포팅의 요구사항 한계를 넘는 거래를 탐지한다. 새로운 계절 관계에 대해 
다른 변수에 대해 무시하라.  
==============================================================================================================

- ProC
http://tldp.org/LDP/lkmpg/2.6/html/x769.html
http://www.joinc.co.kr/modules/moniwiki/wiki.php/Site/system_programing/proc/ProcFsPrograming
---------------------------------------------------------------------------------------------------------

- IBM MQ Client
1. MQ를 이용하여 다른 곳의 서버와 통신
2. MQ 큐에 PUT, GET
==============================================================================================================

- 제일은행(과천점) 방문
1. 이체비밀번호 제거(T)031-502-0-> 1번 -> 주민번호 -> 상담원)
==============================================================================================================

- 이과장 인도 출장 일정
1차: 5/8 ~ 6/27,  2차: 7/3 ~ 9/15
==============================================================================================================

2009-04-28 이체입금 3,200,000 국민은행에서 동양종금CMA로 송금(기술사 학원비로 사용할 것)
==============================================================================================================

- 원맵 작성
1. Data Mart 
==> 02. 데이터베이스/05. Dataware Housing
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.04.29(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:40  --> 중식(삼계탕 김대광 주임이 상 타서 쏨), 이과장 방문(낙성대집)

- 대우증권 AML Prj
- Basic Scenarios 분석(회의: Scenarios 설명)
CDD(Customer Due Diligence): 고객확인제도(고객 주의 의무) ==> KYC Watch List Filtering
Frequency Period: 시나리오를 돌리는 기간
Lookback Period: alert 내기 위해 데이타를 둘러보는 기간
CIB: Change in Behavior(행위 변경)
journal transactions: 전표 거래
==============================================================================================================

- 야휴 미니(번역기): http://kr.dic.yahoo.com/search/mini
==============================================================================================================

- 원맵 작성
1. ETL(Extraction Transformation Loading)/ETT(Transportation) 
==> 02. 데이터베이스/01. 데이터베이스 모델링
2. 데이터 웨어하우스
==> 02. 데이터베이스/05. Dataware Housing
추후 공부 토픽: Data Minng, Data Cleansing, SEM, BI, OLAP
==============================================================================================================

- 구매 품목(악력기)
아이워너 핸드 & 피아노 그립(25KG)(3,600원)
조은 수셈 악력기(파랑) 강함(5,100원)
http://www.gmarket.co.kr/challenge/neo_goods/goods.asp?goodscode=130206521&interest_group_no=0 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.04.30(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00  --> 이과장 방문(낙성대집)

- 대우증권 AML Prj
- Basic Scenarios 분석
- 대우증권 AML Proj 회의
1. DIS 기준으로 Business 스키마와 Manas 스키마 분석
==============================================================================================================

- 백신 설치(Symantec Endpoint Protection 11): 대우증권 관리자가 해줌
- Visual Source Safe 설치
userName: 진태만
Database: \150.10.197.233\vss_db
==============================================================================================================

- 원맵 작성
1. EDW구축
==> 02. 데이터베이스/05. Dataware Housing
추후 공부 토픽: Data Cleansing, SEM, BI, OLAP
==============================================================================================================

- 자동이체 내역(HSBC)
일자 입금계좌 이체금액 통장표시내용  
2009.05.24 신화자   KRW 200,000   부모님 생활비
2009.05.24 진태만   KRW 100,000   동양펀드 적립식
2009.05.24 진태만   KRW 300,000   프라임B_적립식
2009.05.24 진태만   KRW 750,000   KB각종 공과금
2009.05.28 박태호   KRW 20,000 진태만_월회비
==============================================================================================================

- 주식
월(3,930), 화(3,765), 수(3,765), 목( 3,760)
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
