

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2009.03) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2009.03.02(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30  --> 점심(오PM님이 깐풍기 쏨: 이성준 책임 철수, 별다방 커피: 김과장이 쏨)

- My e-Gov ISP
1.4 전자정부통합서비스 구현방안 수립
1.4.2.1 현황 분석
1.4.2.2 개선모델 수립(국가대표포털 이용자 편의성 제고 방안 수립)
1.4.2.2.3.6 채널별 도입 대상 선정(DTV, 모바일(핸드폰. PDA), IPTV, SMS, FAX, e-Mail)
1.4.2.2.3.7 채널별 서비스 제공 방안 수립
1.4.2.2.3.8 채널별 서비스 구축 방안 수립
My e-Gov   ===> 차별성(민원발급 다양하게 가능하게 할 것) 
==============================================================================================================

- 산출물 시나리오 리뷰(22:00 ~ 23:20)
1. 검색(강대리)
2. 다양한 채널(준비 미흡): 개망신  ==> 시나리오라는 개념을 파악 못 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.03(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00  --> 자리 이동(강태영 대리 옆), 목차 새로 잡아줌(엄정용 과장), 맥주(이과장:낙성대집)

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3. 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)
3.2.3.1 과제필요성
==============================================================================================================

- 예매
2009.03.07(토) 15:23 무궁화호 예약(서울 -> 동대구)
2009.03.08(일) 17:20 고속버스 예약(동대구 -> 서울)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.04(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 23:30  --> 최정훈 이사 만남(My e-Gov Proj 5월 시작 예정)

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3. 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황) 
3.2.3.2  다양한 채널을 이용한 서비스 구현기술 : IPTV
3.2.3.2  다양한 채널을 이용한 서비스 구현기술 : Mobile
==============================================================================================================

1. 접근채널의 검토절차  ==> 제안서 참조
1) 최신기술 검토
2) 적용선진 사례검토 
3) 적용기술 검토
4) 가능서비스 검토 
5) 대상선정 
6) 개선모델 도출
==============================================================================================================

- 제일은행 두드림통장 개설(5백만원 이체)
통장번호: 130-20-502841  광화문점(교보생명B/D)
1. 31일부터 연 4.1% 수익
2. 무제한 수수료면제(영업시간 외 자동화기기(CD/ATM) 인출 및 당행이체수수료(타행ATM 포함)) 
==============================================================================================================

- 방법론 분석
UX 방법론(LG CNS 방법론) ==> 분석/설계(도서관에서 빌릴 것)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.05(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 22:30

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)   
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : PDA
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : Fax 전송 구현
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : e-mail / SMS 발송 구현
==============================================================================================================

- SW기술자 신고제 접수
http://www.dt.co.kr/contents.html?article_no=2008122902010560744001
한국소프트웨어산업협회(KOSA): http://es.sw.or.kr
1. 기술 등급
1) 중급기술자: 기사 자격증 취득 후 관련분야 3년 이상 근무한 자
2) 고급기술자: 중급기술자 자격 취득 후 관련분야 3년 이상 근무한 자
3) 특급기술자: 고급기술자 자격 취득 후 관련분야 3년 이상 근무한 자
4) 기술사
SCJP / SCJD / MCSD, OCP(DBA)
국제공인자격증 http://won.hrdkorea.or.kr/inf/qlf05_0107_p.jsp?jongmok_id=03
썬교육센터 http://www.suntraining.co.kr
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.06(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 20:00  --> 워크샵 취소(강원도 고성), 이과장 방문(낙성대집)

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)   
3.2.3.2 다양한 채널을 이용한 서비스 사례 : MOBILE/PDA 민원신청 서비스
3.2.3.2 다양한 채널을 이용한 서비스 사례 : FAX 서비스
3.2.3.2 다양한 채널을 이용한 서비스 사례 : e-mail/SMS를 이용한 알림이 서비스
==============================================================================================================

- 버스 노선
1. 경복궁역 -> 서울역(1711번, 7016번)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.07(토) 작업 ■■■■■■■■■■■■■■■■
---> 11:00 ~ 19:00  --> 토요근무

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)   
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : 구현 기능 특징 분석
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : 구현 기능 장단점 분석  
---------------------------------------------------------------------------------------------------------

- ISP
BD: 사업방향성 수립
AS-IS: 현황분석
TO-BE: 개선방안 수립
MP: 이행계획 수립
==============================================================================================================

- 산출물 리뷰(12:50 ~ 13:20) 
커버링 메시지: 장의 내용 요약 
과제의 필요성: 논리적으로 재작성
전체적으로 논리가 안 맞음 => 목표이미지를 먼저 설계하고 시작할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.09(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 22:30  --> 이과장 P 확인(수술),  최광필 과장 투입(아키텍처), 김수향 과장 철수

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.3 목표이미지
3.3.1 다양한 채널을 통한 서비스 제공 방안
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립) 
3.4.3.1 서비스 제공 채널 선정
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 구현 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 관리 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 장애 대응 방안
Font: 가는둥근제목체
==============================================================================================================

- 근로자능력개발카드제
http://www.hrd.go.kr/jsp/common/hrdhPopup/jtnet02_02/jtnet02_02_800.jsp?go_pag_url=/jsp/common/hrdhPopup/jtnet02_02/jtnet02_02_800.jsp
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.10(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)  
3.4.3.1 서비스 제공 채널 선정
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 구현 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 관리 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 장애 대응 방안
==============================================================================================================

- fail over: 컴퓨터 시스템 대체 작동(법)(주: 시스템의 작동이 정지되면 예비 장치가 자동으로 대체 작동한다)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.11(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 22:00

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)  
3.4.3.1 서비스 제공 채널 선정
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 구현 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 관리 방안
3.4.3.2 IPTV 서비스 제공 방안 : 서비스 장애 대응 방안

- 스마트폰 플랫폼(정보통신진흥연구원)
Symbian(노키아), LIMO(리눅스폰 스탠더드), Android(구글), Window Mobile(Microsoft)
==============================================================================================================

- 산출물 리뷰(14:30 ~ 16:20): 오PM, 김팀장, 엄과장, 강대리(검색 리뷰)
1. IPTV, 모바일(스마트폰, 휴대폰)으로 분리
2. 과제의 필요성(재 정리)
3. 구현기술, 최신기술동향
4. M-Gov(모바일 인프라(컨텐츠) 언급할 것 ==> pda.egov.go.kr
5. 화면 개발(협의 필요: 화면제공, 컨텐츠 개발)
6. 서비스 유형(제약사항, 예시) 
7. 기타(OCAP + JAVA ==> ACAP + HTML)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.12(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00  --> 엄정환 과장 면담, 워크샵 출력물 정리 도와줌

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)
3.2.3.1 과제의 필요성 : 정보소외계층 정보격차 해소
3.2.3.1 과제의 필요성 : 다양한 채널의 일반화

- M-Gov(http://mss01.mgov.go.kr/mgov_portal/info/introduce04.jsp?flag=3)
- 모바일주소(WINC)(http://www.winc.or.kr/service/guide.jsp)
- IABF(http://www.iabf.or.kr): 정보통신 접근성 향상 표준화 포럼
- e-나라지표(http://www.index.go.kr), 통계청(http://www.nso.go.kr), KOSIS 국가통계포털(http://www.kosis.kr)
==============================================================================================================

- 정보처리기술사
기사의 자격을 취득한 후 응시하고자 하는 종목이 속하는 직무분야에서 4년이상 실무에 종사한 자
1. 정보처리기술사 분야
 1) 정보관리 기술사: 정보의 구조, 수집, 정리, 축적, 검색 등 정보시스템의 설계 및 수치계산, 기타 정보의 분석, 
관리 및 기본적인 응용에 관한 사항 ===> 추천
 2) 전자계산 조직응용 기술사: 하드웨어시스템, 소프트웨어시스템에 관한 분석, 설계 및 구현, 기타 컴퓨터 
응용에 관한 사항
3. 정보처리기술사의 검정방법
 1) 필기: 단답형 및 주관식 논술형(교시별 100분, 총 4교시 400분 시험)
 2) 실기: 구술형 면접(시험시간 30분 정도)
 3) 합격기준: 필기 및 실기 각각 100점 만점에 평균 60점 이상으로 교시별 과락은 없음
가. 정보처리기술사 학원
 가) GIS(http://www.gsion.com(임모 추천) - PCW과정(6개월 기준): 1,818,000원
 나) 인포레버(http://www.infoever.co.kr) - IT인텔리젼스 과정(13주): 1,980,000원
세리(http://www.serigisulsa.com) - 학원비: 660,000원
세리(seri.org)포럼에서 기술사 및 감리사 포럼에 가입하시고,  그곳을 통하여 가입하시면 5%~10% 할인
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.13(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00  --> 관계관 위크샵, 회식(남한산성 근처), 이과장집(맥주 사가지고 갔지만 안 먹음, 수술 후)

- My e-Gov ISP
- 관계관 위크샵
07:00 기상
08:10 출발
09:10 서울올림픽파크텔((8호선 몽촌토성역(1번출구)) 4층 아테네홀), 참석자 등록
10:15 사업 소개 및 추진경과 보고(LG CNS 오경미 PM)
11:00 특강(서비스통합전문위 위원장 숭실대 오철호 교수)
12:00 중식(2층 아리랑홀)
13:00 분임토의(1분임:서비스, 2분임:연계 및 통합인증(김팀장, 강대리))
16:00 분임토의결과 발표(1분임:김영도 과장, 2분임:김윤경 과장)
14:50 선물(USB 4G) 분배 및 종료 
18:00 백원정(남한산성 식당(백숙,닭도리탕)): 위크샵 총평(전문 포탈 담당자들이 통합에 호의적이였음,
                  SSO와 예산 마련에 대해서 담당자들과 더 협의를 하고 고민을 해봐야 함)
20:00 종료
20:10 강변역(강대리 차)
22:00 이과장집(수술, 미래에 대해 이야기 함)
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.14(토) 작업 ■■■■■■■■■■■■■■■■
---> 10:30 ~ 19:30  --> 토요근무, 중식(내가 쏨: 생산성본부 교육), 화이트 데이

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : IPTV
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : Mobile(T-GOV)
==============================================================================================================

- 회원가입
네이트온(http://www.nate.com): tamario3/ss*****9 진덕근
네이트온(http://www.nate.com), 강남구청(http://www.gangnam.go.kr): tamario2/ss*****9 진태규
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.16(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 22:30

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.2 상세 현황 분석(3.2.3 채널 제공 현황)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : PDA(Symbian)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : PDA(LIMO)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : PDA(Android)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : PDA(Window Mobile)
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : 구현 기능 특징 분석
3.2.3.2 다양한 채널을 이용한 서비스 구현기술 : 구현 기능 장단점 분석
스마트폰: 기본적인 휴대폰 기능에 인터넷 기능과 컴퓨터 운영체제를 포함한 제품을 말함
PDA폰: PDA제어를 위한 OS와 휴대폰 제어를 위한 OS가 각기 따로 동작함(스마트폰은 OS가 하나)
==============================================================================================================

- PCCheck 프로그램 체크(PCCheck.exe 실행: LG CNS에서 제공)
==============================================================================================================

- 코난 데스크톱 검색
http://package.konantech.com/download/index.php 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.17(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00  --> 철수 통보(이흥권 부장, 염정환 과장), 호프집(이과장, 낙성대집)

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)
3.4.3.1 서비스 제공 채널 선정
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 구현 방안
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 관리 방안
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 장애 대응 방안
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.18(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:50 ~ 18:00

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 구현 방안
==============================================================================================================

- SW기술자 신고서 작성 요령
SW업체인 경우:  a. SW사업자 신고서 사본 b. 소프트웨어관련 매출신고서
비SW업체인 경우: 소프트웨어기술업무 전담부서 확인서(별지 제2호)
근무경력확인서, 기술경력확인서, 소프트웨어기술업무_전담부서_확인서에 각 3개의 파일에
사업자등록번호 기입, 대표자 서명 또는 인을 해주십시오.
업종, 업태(정확)
÷ 계약한 업체 또는 발주처의 확인을 못 받으면 계약서 원본 제출( (주)한우리시스템)
=========================================================================================================

- SW기술자 신고서 작성(이력서, 기술경력)
2000_01, ,상호명 : 넥스젠어쏘시에이트(주)
본사주소 : 서울특별시 강남구 신사동 503-5 
전화번호 02-547-0556    
-------------------------------------------------------------------------------------------

2000_03, 상호명 : (주)시스웹  ==> 파산간주(폐업)
-------------------------------------------------------------------------------------------

2000_08, 상호명 : 인트로시스템(주)  ==> 해산(폐업)
-------------------------------------------------------------------------------------------

2001_02, 상호명 : (주)엠지애드(대표자:류창영)  ==> 거의 폐업됨
사업자번호 : 211-56-55225, T)02-445-9177
본사주소 : 서울시 강남구 신사동 535-14
조영선실장: *, 김우섭 이사 *
-------------------------------------------------------------------------------------------

2002_02, 상호명 : (주)인스케어(대표자: 최재동)
사업자번호 : 211-86-95251, T)02-2266-9113
본사주소 : (100-748) 서울 중구 저동2가 24-1 쌍용빌딩 1701호 인스케어닷컴 
2호선 을지로3가역 11번 출구, 방철배 이사
-------------------------------------------------------------------------------------------

2002_09, 상호명 : (주)케이티원  ==> 연락처 모름
-------------------------------------------------------------------------------------------

2003_07, 상호명 :  케이와피젠(주)(대표자:박상종)
사업자번호 : 214-86-82***, T)02-3472-8643
본사주소 : (137-871) 서울 서초구 서초3동 1532-7 서울빌딩 5층(3호선 남부터미널역 6번 출구)
==> 폐업(폐업사실증명원, 건강보험자격득실확인서)
---------------------------------------------------------------
상호명 : (주)LG씨엔에스
사업자번호 : 116-81-19***, T)02-6363-5000
본사주소 : (100-725) 서울 중구 회현동2가 10-1 프라임타워 LG씨엔에스 
-------------------------------------------------------------------------------------------

2004_02, 상호명 : (주)아이쓰리샵(대표자:안중현) 
사업자번호 : 504-81-32871, 업태: 도소매, T)053-757-9002
본사주소 : (701-824) 대구시 동구 신천3동 74-1 아이쓰리샵빌딩 
담당자: 기세곤 차장(*@*.*)
- 재고관리 시스템 개발, PDA 물류관리 시스템 개발, 세금계산서 관리 시스템 개발, 쇼핑몰 리뉴얼 개발
정수기 관리 시스템 개발, SMS 전송 시스템 개발
-------------------------------------------------------------------------------------------

2007_02, 상호명 : (주)위니텍(대표자:강은희)   
사업자번호 : 504-81-25346, 업태: 소프트웨어개발외, T)053-659-1704
본사주소 : (705-816) 대구시 남구 대명3동 2139-12 재단법인 대구디지털산업진흥원 본관1층
담당자: 김창욱 팀장(*@*.*), T)053-659-1704
- U-대구, 지진피해 리뉴얼 개발
--------------------------------------------------------------- 
상호명 : 삼성에스디에스(주)
사업자번호 : 110-81-28***, T)02-6484-0120
본사주소 : (135-918) 서울 강남구 역삼2동 707-19 일옥빌딩 23층
-------------------------------------------------------------------------------------------

2008_01, 상호명 : (주)나라정보기술(대표자:유종현)
사업자번호 : 220-81-50345,  T)02-554-4940
본사주소 : (135-080) 서울시 강남구 역삼동 601-16 범다리빌딩4층
-------------------------------------------------------------------------------------------

2008_06, 상호명 : (주)클라우드나인(대표자:신성원)
사업자번호 : 201-81-98557, T)02-774-0031
본사주소 : (100-043) 서울시 중구 남산동3가 34-5 남산빌딩 101호 
---------------------------------------------------------------
상호명 : SK C&C
사업자번호 :  , T)02-6400-0114
본사주소 :  (463-847)경기도 성남시 분당구 정자동 25-1 SK u-TOWER 
-------------------------------------------------------------------------------------------

2008_11, 상호명 : (주)한우리시스템(대표자:신승춘)
사업자번호 : 206-81-17525, T)02-2205-0354, *
본사주소 : (133-834) 서울시 성동구 성수2가3동 300-4 영동테크노타워 1109호(2호선 성수역 3번 출구)
담당자: 김민영
---------------------------------------------------------------
기업명 : 한국후지쯔(주)
사업자번호 : 102-81-17***, T)02-3787-6000
본사주소 : (110-140) 서울시 종로구 수송동 83-1 수송타워빌딩 14~18층
-------------------------------------------------------------------------------------------

2009_02, 상호명 : 다른정보기술(주)(대표자:정존량)
사업자번호 : 120-81-78460, T)02-825-4838
본사주소 : (156-811) 서울시 동작구 대방동 401-7 화영빌딩 3층 
==============================================================================================================

발주처 : 공사를 하는 건축주를 말함
발주자 : 발주처와 같은 의미 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.19(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 삼겹살, 호프(현용)

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 구현 방안
==============================================================================================================

- SW기술자 신고서 작성(출력, 계약서 출력)
==============================================================================================================

- CISA 자격증 무료 공개설명회(현용)
일 시 : 2009년 3월 19일 목요일 오후 7시 20분
장 소 : 라이지움 강의실(강남역 6번 출구 300m 사랑의 교회 앞 강남오피스텔 3층)
http://lyzeum.com/bbs/?temp=view&page=1&idx=45185&code=notice&key=&value=
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.03.20(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> My e-Gov ISP 철수

- My e-Gov ISP
III. 전자정부통합서비스 구현방안 수립
3 국가대표포털 이용자 편의성 제고 방안 수립
3.4 추진방안(3.4.3 서비스 채널 다양화 방안 수립)
3.4.3.2 MOBILE/PDA 서비스 제공 방안 : 서비스 구현 방안
==============================================================================================================

- SW기술자 신고서 작성(출력, 계약서 출력) -> (주)나라정보기술, (주)케이와피젠(폐업 확인)
- 별 보기(예약 완료)
중미산천문대(http://www.astrocafe.co.kr) - 경기도 양평군 산복3리 117-1 중미산천문대(당일 2만원) 
농협: 171502-52-078363, 예금주: 고경옥 => 총 4만원 입금, 진태만 당일2이용료
자연과별 천문대(http://www.naturestar.co.kr) - 경기도 가평(당일 2만원)
- 4륜바이크 양평칠읍산밸리 (http://www.cypvalley.com) - 경기도 양평군 용문면 화전리 1050
국민 220401-04-028715 예금주: 남태우 => 총 5만원 입금, 진태만 ATV이용료
-------------------------------------------------------------------------------------------
- 주식
월(2,920), 화(3,000), 수(2,990), 목(2,870), 금(2,870)
- 벤처 스토리(http://www.venturestory.co.kr), 조현호(*@*.*, *) ==> 공형근 차장 추천
주소: 서울시 구로구 구로동 182-4 대륭포스트 타워 3차 503호(2호선 구로디지털단지역 3번 출구)
-------------------------------------------------------------------------------------------

- 정보처리기술사  @@@@@@@@@@@@
 ■ 정보처리기술사분야 시험분류 
-정보관리기술사
-전자계산조직응용기술사

 ■ 기술사 시험목적
정보처리 업무의 효율성을 높이고, 각 조직에 가장 적합한 시스템을 설치 운영하기 위해서는 컴퓨터에 
관한 전문적인 지식과 기술을 갖춘 인력양성이 필요하게 됨.

 ■ 기술사 시험응시안내
-응시일정 : 2009년 2월/8월 (예정/추후 발표)
-응시료 : 필기>70,000원/실기>65,000원
  
 ■ 기술사 검정절차 
[1차] 필기시험 논술형 필기시험
-시험시간 : 100분*4교시
-합격기준 : 100점 만점에 60점 이상
[2차] 경력심사  
[3차] 면접시험  
-구술형 면접시험 
-면접시간 : 30분 내외
-------------------------------------------------------------------------------------------

- 정보처리기술사 합격방법서(6개월 만에 합격하기)(http://book.naver.com/bookdb/book_detail.php?bid=4473031) 
저자: 이성몽, 출판사: 인포드림 
- 근로자능력개발카드제: 고용보험 피 보험자 비정규직 근로자(프리랜서는 고용보험 못 듬)
- 전직실업자훈련: 고용보험 가입이력이 있는 실직자의 재취업을 위한 직업 
- 직업능력개발계좌제: 근로자(구직자 포함)의 자율적 직업능력개발 지원을 위해서 제공
연간 200만원으로 취업전 1회 지원이 가능하고 교통비와 식비는 별도로 지원하고 20%를 자비
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.23(월) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 현용 PMP 합격 파티(삼겹살(내가 쏨)), 당구(현용 짐, 임모 1등), 맥주)

- A 프로젝트
- 서초세무(http://s.nts.go.kr/sc) 강남역 1번 출구
T) 02-3011-6200 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.03.24(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> WBC 준우승(한국 3:5 일본), 이과장 방문(뼈찜: 이과장이 쏨)

- A 프로젝트
- 배과장 회사에 이력서 냄 --> (주)소프트허브  권문선(*@*.*)
==============================================================================================================

- 병렬주차수정
http://ch.gomtv.com/view.gom?ch=2932&intpid=753&type=3&intbid=9023
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.25(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  --> 중식(현용이 회사: 내가 쏨)

- A 프로젝트
- 아이나비 UZ 4GB 222,000원
http://www.interpark.com/product/MallDisplay.do?_method=Detail&sch=list&sbn=ane_prd&sc.shopNo=0000100000
&sc.dispNo=008001&sc.prdNo=80132275
아이나비(http://www.inavi.com): T)1577-4242, 아이나비 UZ 가죽케이스 주문
==============================================================================================================

- 정보처리기술사 합격방법서(6개월 만에 합격하기) 23,000원 → 20,700원 10%DC
http://kangcom.com/sub/view.asp?topid=1&sku=200803100002
==============================================================================================================

- SW기술자 신고제 접수함
한국소프트웨어산업협회(KOSA): http://es.sw.or.kr
서울시 강남구 삼성동 9-1 대영상호저축은행 빌딩 5층
전략사업실 정책연구팀 장재현 T)2188-6981, 접수담당: T)2188-6987(~0)
-----------------------------------------------------------------------------------------
- 폐업사실 열람: 대법원(http://www.iros.go.kr/icis/index.jsp)  ==> 법인등기 -> 열람
- 폐업 사실증명 떼기: 반포 세무서-> 폐업: (주)시스웹, 인트로시스템(주), 케이와피젠(주)
==============================================================================================================

- 건강보험료 납부 확인서
71071618034   직장가입자   넥스젠어쏘시에이트(주) 2000.01.03   2000.03.06 
71071618034   직장가입자   (주)시스웹 2000.03.27   2000.07.18 
71071618034   직장가입자   인트로시스템(주) 2000.08.07   2001.02.01   서초북부지사     
71200467759   직장가입자   (주)엠지애드 2001.02.12   2002.02.15   강남북부지사   
71245340833   직장가입자   (주)케이티원 2002.09.02   2003.07.16   마포지사     
71270033394   직장가입자   (주)케이와피젠 2003.07.09   2004.01.01   서초남부지사  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.26(목) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 호프집(이과장, 낙성대집)

- A 프로젝트
- CJ인테넷 이은화 과장: FAX) 02-2107-0577  ==> 안됨
==============================================================================================================

- 폐업 사실증명 떼기: 반포 세무서 다녀옴 -> 폐업: (주)시스웹, 인트로시스템(주)
==============================================================================================================

- KOSA 수수료 납부(연간 경력관리비용): 보류
국민은행: 831801-04-007914 예금주: 한국소프트웨어산업협회
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.27(금) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:000  --> 이과장 방문(낙성대집)

- A 프로젝트
- 아이나비 UZ 4GB 구매(배송 도착), 세팅 완료: 222,000원
제품시리얼번호: UZS096055F7UK6T6OF
==============================================================================================================

- SW기술자 신고제 재 접수함(http://es.sw.or.kr) 
1. (주)인스케어(을지로3가역 11번 출구 쌍용빌딩 17층) 방문하여 기술 증명서 발급
2. (주)앰지애드 김우섭 이사 만나서 관련 서류 받음
3. 휴대폰 구매(번호 이동): 공짜
1) 의무 사용기간 2년, LG 텔레콤으로 이통사 이동)
2) 표준요금제, 부가 서비스:  OZ 파워팩(한달 후에 취소할 것) 
3) 기타: 구매처(한주텔레콤(주) 강남 2호점 김대일 T)070-7548-5519
    (서울시 강남구 역삼동 82-1 강남역 지하상가 F-8호)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(4군데)
삼성생명 차세대 JAVA 개발자(초급/중급)  썬인프라(주)  정대진(*@*.*)
==============================================================================================================

- 정보관리기술사 공부
1. 정보처리기술사 합격방법서(6개월 만에 합격하기): ~ p166
==============================================================================================================

- 이과장 주소: 서울시 성북구 장위1동 230-30 201호(대문 우측 반층윗문)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.03.31(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00

- A 프로젝트
- 취업 준비
1. 업체 메일 발송(2군데)
==============================================================================================================

- 기술사 왕초보반
1. 송금: 계좌번호: 816901-04-142425  (은행:국민은행, 예금주:이승현)  11만원 송금
2. 왕초보 18기: 4.4(토), 4.11(토), 4.18(토)  09:30 ~13:30  
3. 왕초보과정 주요정보  
가. 실전 강의 장소: 동국대학교 (3호선 동대입구역 6번출구)  
나. 과정 구성: 실전 강의 3주 + 인터넷 동영상 강의 2주 + 온라인 사전학습 2주 
 - 실전 강의: 총 3주 매주 토요일 4시간 참여식 강의 
==============================================================================================================

- 정보관리기술사 공부
1. 정보처리기술사 합격방법서(6개월 만에 합격하기): p167 ~ 완료 
==============================================================================================================

- 1회용국(복어국, 미역국)
- 삼푸, 린스(포항집), 국그릇
- 차량 수리비(자동차)
1. 외장 도금 및 판금에 120만원
2, 실내 클리닝 20여만원
http://news.chosun.com/site/data/html_dir/2009/03/30/2009033001946.html
==============================================================================================================

- 잡코리아 조회(RSS)
/rss/GI_Search_List.asp?rbcd=38888&rpcd=35300&area=/I000/0/0/0/0/0/&edu1=-1&edu2=0&edu3=0&car1=5&car2=10&car_chk=0
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
