

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2016.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2016.08.01(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 곽차장 자리 이동, 이진욱 과장 투입(옆자리)

- 휠라 코리아 차세대 통합ERP Prj[★] 
- 결함목록_처리결과 [0000002872] 처리
1. DEFC-0000003274 처리 ==> 수정 처리 완료 @@@
1. 결함내역: 메뉴관리 화면에서 좌측, 우측 그리드에서 저장버튼을 누르면 이미지와 같은 팝업 뜸
2. 원인: 좌측 메뉴유형 Grid에 있는 필수코드(메뉴타입코드)를 입력하지 않고 우측 메뉴유형별
메뉴구성 Grid에서도 필수 코드(메뉴ID, 메뉴타입코드, 프로그램ID)를 저장해서 나는 에러 입니다.  
3. 조치: 좌측 메뉴유형 Grid에 있는 필수코드 입력 안하면 우측 메뉴유형별 메뉴구성이 저장 안되게 수정처리
, 우측 메뉴유형별 메뉴구성 Grid에서도 필수코드 체크하게 수정 했습니다.
==============================================================================================================

- 일단위 날짜 차이 검색
var sLginDttmFrom = new Date(ica_lginDttmFrom.getValue().substring(0, 4), + Number(ica_lginDttmFrom.getValue().substring(4, 6))-1);
var sLginDttmTo = new Date(ica_lginDttmTo.getValue().substring(0, 4), + Number(ica_lginDttmTo.getValue().substring(4, 6))-1);
var betweenDay = (sLginDttmTo.getValue() - sLginDttmFrom.getTime())/1000/60/60/24;
$w.log("[/CM_mblCnncStat.xml] [dataSearchmblCnncStat()] ==> [모바일접속현황 조회_40] [betweenDay]"+ 
betweenDay +"[sLginDttmFrom]"+ sLginDttmFrom +"[sLginDttmTo]"+ sLginDttmTo );  
==============================================================================================================

- 월단위 날짜 차이 검색
var sLginDttmFrom = new Date(ica_lginDttmFrom.getValue().substring(0, 4), + Number(ica_lginDttmFrom.getValue().substring(4, 6))-1);
var sLginDttmTo = new Date(ica_lginDttmTo.getValue().substring(0, 4), + Number(ica_lginDttmTo.getValue().substring(4, 6))-1);
var betweenDay = (sLginDttmTo.getValue() - sLginDttmFrom.getTime())/1000/60/60/24/30;
$w.log("[/CM_mblCnncStat.xml] [dataSearchmblCnncStat()] ==> [모바일접속현황 조회_40] [betweenDay]"+
betweenDay +"[sLginDttmFrom]"+ sLginDttmFrom +"[sLginDttmTo]"+ sLginDttmTo );  
==============================================================================================================

- 결함목록_처리결과 [0000002872] 처리
1. DEFC-0000003993 처리 ==> 수정 처리 완료 @@@
1. 결함내역: 조건을 넣어 매장, 협력사, 담당자 검색 가능하도록 수정 요청.(수정 사항)
2. 조치: 조회조건에 사용자구분 Select Box를 추가하고 사용자ID에 담당자를 입력하여 검색하도록 수정 하겠습니다.
==============================================================================================================

- 처가 체류연장 예약 신청
1. 8월 3일(수) 10:20 예약
==============================================================================================================

- 전세 검색
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.02(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 장인 퇴원(루옌이 갔다 옴): 병원비 정산(2,536,560원)  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 결함목록_처리결과 [0000002872] 처리
1j. 완료: DEFC-0000003993, DEFC-0000003993, DEFC-0000003993, DEFC-0000003917, DEFC-0000003917, 

[08/02] [수정 사항] 수정 처리했습니다. --> DEFC-0000003993
[08/02] [수정 사항] 수정 처리했습니다. --> DEFC-0000003939
[08/02] [수정 사항] 수정 처리했습니다. --> DEFC-0000003917
[08/02] [수정 사항] 수정 처리했습니다. --> DEFC-0000003993
[08/02] [수정 사항] 수정 처리했습니다. --> DEFC-0000003993
==============================================================================================================

[08/02][수정 사항] ==> 1. DEFC-0000003993 처리 --> 완료 @@@
1. 결함내역: 조건을 넣어 매장, 협력사, 담당자 검색 가능하도록 수정 요청.(수정 사항)
2. 조치: 조회조건에 사용자구분 Select Box를 추가하고 사용자ID에 담당자를 입력하여 검색하도록 수정 하겠습니다.
==============================================================================================================
 
[08/02][확인 사항] ==> 1. DEFC-0000003993 처리 --> 완료 @@@
1. 원인: 비밀번호 초기화를 할 때는 비밀번호 필드를 DB 저장(Update)을 하기 때문에 Grid에validation check를 하는 것은 맞고 정상적인
	프로세스가 맞습니다. 문제는 사용자(CM_USR) 테이블에서 필수 항목인 휴대전화, 사용시작일을 일괄
	등록하는 과정에서 누락하여 등록한 것이 가장 큰 문제 입니다.
2. 조치: 사용자(CM_USR) 테이블에서 필수 항목인 휴대전화, 사용시작일을 반드시 등록해야 합니다. 
==============================================================================================================

[08/02][확인 사항] ==> 1. DEFC-0000003941 처리 --> 완료 @@@
1. 원인: 처음부터 사용자(CM_USR) 테이블에서 필수 항목인 휴대전화를 등록하지 않고 DB에 일괄 등록을 해서 나는
	문제 입니다.  
2. 조치: 이석상님의 개인 정보에 필수 항목인 휴대전화, 사용시작일을 수기로 등록 후 복사등록 한다음 처리하시면 됩니다.
==============================================================================================================

[08/02] [결함 사항] ==> 1. DEFC-0000004181 처리 --> 완료 @@@
1. 조치: 촬영상품 이미지구분 키인 시 '-전체-'가 함께 나오는 문제 수정했어요. 높이 안 맞는 결함은 추후 수정할 예정 입니다.

[08/02] [수정 사항] ==> 1. DEFC-0000003945 처리 --> 완료 @@@
1. 조치: 재직자 먼저 정렬 되도록 수정 했습니다.

[08/02] [수정 사항] ==> 1. DEFC-0000003939 처리 --> 완료 @@@
1. 조치: 그리드 우클릭이 되도록 수정 했습니다. 

[08/02] [수정 사항] ==> 1. DEFC-0000003917 처리 --> 완료 @@@
1. 조치: 그리드 수정 안되도록 처리 했습니다.  
==============================================================================================================
 
[08/02][수정 사항] ==> 1. DEFC-0000003993 처리 --> 완료 @@@
1. 원인: 업무 상세코드(TSK_CD)가 2자리가 최대값인데 [test1]테스트라는 코드값으로 넣어서 DB 에러가 남.
2. 조치: 최초 업무 상세코드(TSK_CD)가 등록되는 공통코드관리(/CM_CmmCdMngm.xml)에서 코드명이 
	 업무구분(코드)이면 업무 상세코드(TSK_CD)가 최대 2자리를 넘어 등록할 수 없게 처리함.
==============================================================================================================

- 조회 에러
1. 현상:
[/cmCommon.js] [_commExecuteSubmission()] ==> [★★★★★★] [01. 조회 서브미션 실행] [sbmId]sbm_mblCertMngm[sbmType]search
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.769 00001 012617 websquare] WebSquare.ModelUtil.executeSubmission : sbm_mblCertMngm
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.772 00003 012620 websquare] WebSquare.layer.showProcessMessage [true]
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.782 00010 012630 websquare] /cmMblCertMngm/getMblCertMngm.do
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.822 00040 012670 websquare] submission complete. Status[200] sbm_mblCertMngm
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.824 00002 012672 websquare] submission id[sbm_mblCertMngm] start[8:8:34:770] end[8:8:34:823] duration[53ms]
javascriptPluginAll.wq?w2xType=5&postfix=5.0_1.2216B.20160708.111740_1.6&compression=false:10 08:08:34.831 00007 012679 websquare] 작업 도중 오류가 발생하였습니다.
* message     : Cannot read property 'trim' of undefined

8:08:34.832 00001 012680 websquare] [/CM_MblCertMngm.xml] [sbm_mblCertMngm_submitdone()] ==> [조회 후 callback 이벤트] [조회 결과 - 건 조회] [TEST_01]

2. 원인: 숫자값을 trim해서 나는 에러
3. 조치: 공통에서 mCommon.js 파일 수정해야 함.
==============================================================================================================

- 장인 병원비 정산(2,536,560원)
1. 2016.08.02	병원비(장인 입원, 고관절 1차 수술): 명지성모병원 카드 결제	: 2,000,000원 
2. 2016.08.03	병원비(장인 입원, 고관절 1차 수술): 명지성모병원 루옌 통장에 송금: 500,000원
3. 총 병원비: 2,536,560원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.03(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 11:50 ~ 20:30  ==> 처가 체류연장 신청(9시)

- 휠라 코리아 차세대 통합ERP Prj[★]
- 결함목록_처리결과 [0000002872] 처리 
[08/03] [결함 사항] 수정 처리했습니다. --> DEFC-0000004298
1. 조치: 장기인증 메세지는 수기로 등록하는 것이 아니라 장기인증관리(/CM_MblCertMngm.xml) 화면에서 자동으로 등록이 됩니다.
사용자관리 화면에서  장기인증 메세지는 수정 못하도록 수정 했습니다.
참고 ==> 장기인증문자: 사용자ID + 사용자IP + 처리일자(YYYYMMDD)

[08/03] [수정 사항] 수정 처리했습니다. --> DEFC-0000004297
1. 조치: 이메일 입력 값(이메일주소-id: 50자, 이메일주소-도메인주소: 20자) 제한 수정 했습니다.

[08/03] [결함 사항] 수정 처리했습니다. --> 0000004296
1. 조치: 부서 

[08/03] [확인 사항] 전화번호 최소 자리수는 표준은 없습니다. 최대 자리수는 3, 4 ,4로 정상 적용 되어 있습니다. --> DEFC-0000004294
 
[08/03] [수정 사항] 수정 처리했습니다. --> 0000004286
1. 내용:사용시작일이 사용종료일보다 이후날자로 저장 못하게 수정 했습니다. 

[08/03] [수정 사항] 수정 처리했습니다. --> 0000004293
1. 내용: 입력폼 최소화 버튼으로 최소화시키면 가로스크롤이 따라올라옵니다. 표준 해상도(1280*768)에서 테스트하여 수정 했습니다.. 

[08/03] [수정 사항] 수정 처리했습니다. --> 0000004289
1. 내용: 관리자여부 그리드를 위아래 정렬시키면 다른그리드가 위아래정렬됩니다. . 표준 해상도(1280*768)에서 테스트하여 수정 했습니다.. 
 
[08/03] [확인 사항] 비밀번호 초기화는 개인 휴대번호 뒷자리 4자리로 셋팅이 됩니다. 
		휴대폰 번호가 널이면 '1234'로 셋팅이 됩니다. --> 0000004282 

[08/03] [수정 사항] 수정 처리했습니다. --> 0000004289
==============================================================================================================

- 처가 체류연장 신청 @@@
08:00 기상
08:10 조식(라면)
09:00 집출발(장모, 루옌, 수종)
09:10 수종 어린이집 데려다 줌
09:40 대림역
09:30 양천구청역(1번 출구: 6627번 버스)
09:35 목동중(하차)
09:40 출입국관리사무소(3층, 영등포구청 관할은 서울남부라고 함, 예약하고 감, 일반 번호표 뽑음: 문제 없음)
	==> 장인, 장모 체류 연장 신청 서류 제출(수입인지 구입(2층): 12만원(처가에서 냄) 
	==> 주소지 확인서 작성, 아파트 관리비 영수증 제출(다음부터 전세 계약서 원본 지참할 것)
	--> 신청인은 장인, 장모명 기입, 사인할 것, 신청일자를 기입할 것
	==> 출입국관리사무소 팩스 번호: 02 2650 4692
	==> 장인 명지성모병원에서 발급한 결핵진단서 잘못 되어 8월 16일(화) 다시 결핵진단서 가져 오라고 함.
	==> 장인 명지성모병원 3층 간호실에 전화해서 난리침 ==> 퇴근하고 진단서 가지고 원무과에 가면 환불해준다고함.
11:00 종료
11:10 목동중(승차, 6624번 버스)
11:30 신정네거리역(하차)
11:50 출근
12:20 중식(국악원 식당)
13:00 업무
20:30 퇴근
21:10 장인 명지성모병원 1층 원무과 ==> 진단서가지고 가서 환불 요청
	==> 진단서 발급할 때 비용 없었다고 거짓말 함, 후에 루엔에게 전화 걸어 비용 만원 낸 것 확인, 영수증 요구
	==> 3층 간호실에 가서 난리 침 ==> 만원 환불 받아서 옴
21:30 귀가
02:10 취침
==============================================================================================================
  
- 베트남 장인, 장모 체류 연장(추가 연장) 신청 서류
1. 사위(혼인관계증명서/가족관계증명서/주민등록등본, 사유서 각 1통) 
2. 장인, 장모(외국인등록증/여권, 결핵증명서)
3. 신원보증서, 통합신청서(출입국사무소 비치)
4. 수입인지(체류기간 연장): 6만원(인당) 
  ==> 혼인관계증명서/가족관계증명서/주민등록등본, 신원보증서, 통합신청서 집에서 출력해서 감 
  ==> 전세 계약서 원본
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.04(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
[08/04] [결함 사항] 수정 처리했습니다. --> 0000004293
1. 내용: 프로그램관리 화면에서 저장을 하려고하면 이미지와 같은 팝업창이 뜹니다. 

[08/04] [결함 사항] 수정 처리했습니다. --> 0000004370
1. 내용: 조회를 눌렀더니 스크린샷과 같은 오류가 뜹니다.

[08/04] [결함 사항] 수정 처리했습니다. --> 0000004369
1. 내용: 탭 이동 후 요청기간 텍스트박스의 테두리 일부가 사라집니다.
==============================================================================================================

- To Do 리스트 조회(/CM_ToDoListInqy.xml) 수정 ==> 완료 @@@
1. 다른 개발자가 작업 --> 기간 수정 처리 함
==============================================================================================================

- TO-DO 결재건수 조회(/CM_ToDoAppvCntInqy) 개발 ==> 완료 @@@

SELECT /* CmMenu_sqlmap.selectTodoList AS 승인권자별 TO-DO LIST 건수 조회 */ 
 					 COUNT(DISTINCT A.TODO_NO) AS TO_DO_LIST_NUM
FROM CM_TODO_LIST A
WHERE 1 = 1
	AND A.BUKRS = 'F100'   
	AND A.TODO_STTS_CD = '20'   -- To Do 상태(20: 확정요청, 50:확정승인: PN-0106)  
	AND A.APRV_USR_ID = #{usrId}	  -- 승인권자 ID	  
;
==============================================================================================================
 
- SSO 개발
1. sso.fila.co.kr 
http://localhost:8081/websquare/websquare.html?w2xPath=/wqui/cm/MDI.xml

http://localhost:8081/websquare/websquare.jsp?w2xPath=/wqui/cm/MDI.xml

http://localhost:8081/sso/authRequestScm.do   ---> 현광식: gwarari, gwar81@
http://scmdev.fila.co.kr:9090/loginForm.do?error=1&maxFailCount=5&user=TEST51

http://localhost:8081/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginHdof.xml  
http://localhost:8081/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginHdof_02.xml 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2016.08.05(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 이진욱 과장 철수(옆자리)

- 휠라 코리아 차세대 통합ERP Prj[★]
- SSO 개발
1. sso.fila.co.kr   ==> LG CNS SSO 담당자: 최환준 차장(hwjochi@lgcns.com) 
http://localhost:10090/sso/authRequestScm.do   ---> 현광식: gwarari, gwar81@
http://scmdev.fila.co.kr:9090/loginForm.do?error=1&maxFailCount=5&user=TEST51

http://localhost:10090/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginHdof.xml  

- SSO용 로그인 화면
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#81. 로컬S[SCM][♥]

- 기존 로그인 화면
http://localhost:10090/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginHdof.xml#81. 로컬S[SCM][♥]
==============================================================================================================
 
- [Spring 3 - MVC] 핸들러 예외 리졸버
 http://springsource.tistory.com/7

<!-- 	<bean class="org.springframework.web.servlet.handler.SimpleMappingExceptionResolver"> -->
<!-- 	    <property name="mappedHandlers"> -->
<!-- 	        <props> -->
<!-- 	            <prop key="DataAccessException">error/dao</prop> -->
<!-- 	            <prop key="BusinessLogicException">/cmLogin/getLoginHdof.do</prop> -->
<!-- 	        </props> -->
<!-- 	    </property> -->
<!-- 	    <property name="defaultErrorView">error/default</property> -->
<!-- 	</bean> -->
 
		//로그인 validation체크
		SessionToken sessionToken = new SessionToken();
		service.processLogin(paramMap, sessionToken, request, response2);	// 로그인 처리
==============================================================================================================
 
 <!-- ================================================================================================================================== -->
<!-- 예외핸들링 리졸러 목록 -->
<!-- ================================================================================================================================== -->
<!-- 메소드에 @ExceptionHandler annotation을 지정하여 에러를 처리한다.  -->
<bean class="org.springframework.web.servlet.mvc.annotation.AnnotationMethodHandlerExceptionResolver"/>

<!-- HTTP STATUS를 특정 HTTP 응답 상태 코드로 처리한다. 
     예외 클래스에 @ResponseStatus 를 붙이고, HttpStatus 에 정의되어 있는 HTTP 응답 상태 값을 value와 reason에 설명을 붙인다.  -->
<bean name="responseStatusExceptionResolver" class="org.springframework.web.servlet.mvc.annotation.ResponseStatusExceptionResolver" /> 

<!-- 위 리졸버에서 처리되지 않는 spring자체 exception 등을 처리한다. -->
<bean name="defaultHandlerExceptionResolver" class="org.springframework.web.servlet.mvc.support.DefaultHandlerExceptionResolver" />
<!-- 특정 예외를 처리할 뷰를 지정할 수 있는 리졸버  -->
<bean class="com.spro.support.base.exception.handler.CustomSimpleMappingExceptionResolver">
	<property name="exceptionMappings">
		<props>
			<prop key="com.scm.common.exception.XXXXException">/common/notAuthorized</prop>
			<prop key="com.scm.common.exception.AAAAException">redirect:/common/notAuthorized</prop>
		</props>
	</property>
	<property name="defaultErrorView" value="/common/error" />
</bean>
==============================================================================================================

- 크롬 > F12에서 디버깅 로그가 안 나올 때
1. /config.xml 파일에서
C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp\websquare\config.xml

<!-- 개발 -->
<debug value="true" console="true" remoteConsole="false"/>	<!-- F12에서 디버깅 로그가 안 나올 때 --> 
==============================================================================================================

-- SSO 사원 정보 조회 @@@@ 
SELECT A.USER_ID AS 사용자ID, A.EMP_NO AS 사원ID  -- (사원ID = SCM사용자ID)
            , A.*
FROM TB_FILA_SSO_01 A
ORDER BY A.EMP_NO;O;
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2016.08.06(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~21:00 ==> 주말 근무, 브라질 리우 올림픽 개막

- 주말
05:40 기상
06:30 출근
06:40 SSO 개발
12:00 중식(새우 덮밥(만 2천원), noodle): 9명 먹음
12:20 SSO 개발 서버에 적용: 안되어서 LG CNS SSO 최환준 차장에게 전화
	==> 최차장이 개발 서버에 sso-metadata.xml 적용 안 함
18:00 석식(회 덮밥, 어촌식당): 6명 먹음
20:20 SSO 개발 서버에 sso-metadata.xml 다시 적용(완료)
21:00 종료
21:40 귀가
23:00 취침
==============================================================================================================

- 휠라 코리아 차세대 통합ERP Prj[★]
- SSO 개발
1. sso.fila.co.kr   ==> 
http://localhost:10090/sso/authRequestScm.do   ---> 현광식: gwarari, gwar81@
http://scmdev.fila.co.kr:9090/loginForm.do?error=1&maxFailCount=5&user=TEST51

- SSO용 로그인 화면 
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#01. 개발S[SCM]

- 기존 로그인 화면
http://localhost:10090/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginHdof.xml#81. 로컬S[SCM][♥]
==============================================================================================================

- SCM 개발 서버에 SSO 적용하는 방법
1. scmdev.fila.co.kr URL HOST 설정(필수 사항)
 1) C:\Windows\System32\drivers\etc\hosts 파일에서 아래 추가
# 개발 서버(01. SSO DEV)
172.16.41.114    scmdev.fila.co.kr   
-----------------------------------------------------------------------------

2. SCM 로그인 화면
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#01. 개발S[SCM]

3. 휠라 그릅웨어 로그인 화면(휠라 그릅웨어 로그인ID가 존재해야 함)에서 아이디, 패스트워드 기입
http://scmdev.fila.co.kr:9090/loginForm.do

4. SCM용 메인 화면으로 이동 함
http://scmdev.fila.co.kr:9090/websquare/websquare.html?w2xPath=/wqui/cm/MDI.xml  
==============================================================================================================

- SSO 로그인
1. 로그인
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#01. 개발S[SCM]

2. 에러
http://scmdev.fila.co.kr:10090/sso/authRequestScm.do
{"ds_exception":{"errMessage":"서비스 수행중 오류가 발생했습니다.","errCode":"0300"}}
==============================================================================================================

- 터미널에서 에러 내용 @@@@@
13:16:29,227 INFO  [stdout] (ajp-/172.16.41.114:10009-5) [######################### [/websquare.jsp(세션 체크) 
Start] #########################] ===============================================> 
13:16:29,227 INFO  [stdout] (ajp-/172.16.41.114:10009-5) [/websquare.jsp] [init()] ==> [01. 로그인 세션 체크] [sSssnId]null
13:16:29,228 INFO  [stdout] (ajp-/172.16.41.114:10009-5) [/websquare.jsp] [init()] ==> [51. 로그인이 안되어 있으면 -> 로그인 화면으로 URL 이동]
13:16:30,125 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 2016-08-06 13:16:30,125 DEBUG [kr.co.fila.cm.web.CommCodeController] 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) [/CmSSOController.java] [authRequestScm()] @@@@@ ===> [01. 인증 요청 메시지 전송] [TEST_01]
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 2016-08-06 13:16:30,126 DEBUG [kr.co.fila.cm.web.CommCodeController] 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) [/CmSSOController.java] [authRequestScm()] @@@@@ ===> [sSssnId]null
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 2016-08-06 13:16:30,126 DEBUG [kr.co.fila.cm.web.CommCodeController] 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) 
13:16:30,126 INFO  [stdout] (ajp-/172.16.41.114:10009-3) [/CmSSOController.java] [authRequestScm()] @@@@@ ===> [세션이 널이면] 
==============================================================================================================

- SSO 로그인
1. 2개의 폴더에 있는 /sso-metadata.xml 파일이 아래와 같이 설정 해야 함
C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.SCMSystem\src\main\resources\environment\pc\security\sso-metadata.xml		==> 로컬 @@@@
C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.SCMSystem\src\main\resources\environment\DEV\security\sso-metadata.xml		==> 개발 @@@@
C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.SCMSystem\src\main\resources\environment\OnReal\security\sso-metadata.xml	==> 운영 @@@@

2. /sso-metadata.xml 파일에서
<EntityDescriptor xmlns="urn:oasis:names:tc:SAML:2.0:metadata" entityID="scmdev.fila.co.kr">
	<SPSSODescriptor AuthnRequestsSigned="false" protocolSupportEnumeration="urn:oasis:names:tc:SAML:2.0:protocol">
		<NameIDFormat>urn:oasis:names:tc:SAML:2.0:nameid-format:transient</NameIDFormat>
		<!-- 인증확인메세지 받을 URL -->
		<AssertionConsumerService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" 	Location="http://scmdev.fila.co.kr:10090/sso/authResponseScm.do"/>
		<!-- 로그아웃 처리받을 URL -->
		<SingleLogoutService Binding="urn:oasis:names:tc:SAML:2.0:bindings:HTTP-POST" 		Location="http://scmdev.fila.co.kr:10090/sso/singleLogoutRequestScm.do"/>
	</SPSSODescriptor>
</EntityDescriptor>
==============================================================================================================

[08/06] [수정 사항] 수정 처리했습니다. --> 0000004516
1. 내용: 아이디랑 비밀번호 친 다음에 엔터로 로그인할 수 있으면 좋겠습니다.
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.07(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==> 

▦ 조기축구
06:50 기상(새벽에 다리에 쥐가 나서 잠 설침)
07:20 자전거(문영APT -> 안양천 문래1동 운동장(억새 구장(1))
07:40 안양천 문래1동 운동장 
08:00 자체 게임
08:00 게임(문래1동팀) ==> 1게임 뜀(골키퍼, 선심 2번 봄)
11:00 종료
11:30 중식(콩국수, 서울식당)  --> 조기회에서 쏨
12:50 종료
13:20 뼈해장국, 3그릇: 양평해장국: 테이크아웃
13:40 귀가
14:30 낮잠
17:30 기상
18:30 놀이터(수종)
19:30 석식(뼈해장국)
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.08(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 곽차장 자리 복귀

- 휠라 코리아 차세대 통합ERP Prj[★]
- 평균단가 계산(/SB_ClpyAgvCostCalc.xml) 개발  ==> 
- 특수 버튼 이미지 URL
C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp\resources\images\common
==============================================================================================================

- 수불관련 회의(09:30 ~ )
1. 담당자: (주)소프트원 민형기 이사님
==============================================================================================================

[08/08] [수정 사항] 수정 처리했습니다. --> DEFC-0000003909
1. 내용: 스타일코드, 색상코드, 색상순으로 정렬 순서 수정 했습니다.
------------------------------------------------------------------------------------------------------

[08/08] [확인 사항] 수정 처리했습니다. --> DEFC-0000003908
1. 내용: 이미지의 상품중 PINK 색상을 수정 할 경우 두개의 row중 어떤걸 해야할 지 알 수 업음
2. 답변: 같은 브랜드코드, 법인코드, 스타일코드, 색상코드, 연도코드일 경우 같은 PINK 색상이 조회될 수가
	없습니다. 혹시라도, 상품이미지목록조회(/CM_ProdImgListInqy)에서 조회 후 상품 목록 Grid에서 같은
	스타일코드에서 같은 색상이 나오면 캡처해서 보내주시면 즉시 조치하도록 하겠습니다.
==============================================================================================================
 
- PL/SQL 설치
1. plsqldev804
ljqwlh4wrqeuvzp3xwphg29vvlaqjycs6mqj7ybml6yl
Serial: 1100048303
Password : xs374ca 
==============================================================================================================

- Toad에서 edit 명령으로 update 쿼리 없이 데이타를 Grid에서 직접 수정
http://zzznara2.tistory.com/73

EDIT EMP
WHERE ENAME = 'SMITH'
ORDER BY HIREDATE DESC
; 
------------------------------------------------------------------------------------------------------

-- 즐겨찾기  조회 @@@@@@@@@  
SELECT  A.*
FROM CM_USR_MENU A    -- 마이메뉴 TB
WHERE 1 = 1 
	AND A.USR_ID     =  'TEST51' 
	-- AND A.PG_ID     =  'CM_MblCnncStat'
	AND A.MENU_NM =  '(개발중) 모바일접속현황'   -- 메뉴명
ORDER BY A.SRT_SQOR
;   
--------------------------------------------------------------------------------------------

-- 즐겨찾기  수정 @@@
UPDATE  CM_USR_MENU A 
 SET A.MENU_NM = '[01] 수불평균단가계산'   -- 메뉴명
WHERE 1 = 1 
    AND A.USR_ID     =  'TEST51' 
    AND A.PG_ID     =  'SB_ClpyAgvCostCalc'
;    
-----------------------------------------------------------------------------

-- 즐겨찾기  수정 @@@ ==> EDIT 사용
EDIT CM_USR_MENU A    -- 마이메뉴 TB
WHERE 1 = 1 
    AND A.USR_ID     =  'TEST51'  
;     
==============================================================================================================
 
- 에어컨 설치비용
http://www.ppomppu.co.kr/zboard/view.php?id=av&no=17999 
혹시 중고에어컨 설치비 아끼실분들은
1. 앵글 직접 구입
2. 동네 발품
==============================================================================================================

- Apple ID(ipad: 아이패드)    
tamario@naver.com / tama339A		==> 설정됨
tamario@naver.com / ssjtm3390A	==> TEST
luyen94@naver.com / lulu339A		==> TEST

1. 아이패드 비밀번호 분실 시 암호 재설정하는 방법
==> http://hwsecter.tistory.com/1034
==============================================================================================================
 
- TOAD 에서 EXCEL 파일 INSERT 하기
http://joke00.tistory.com/257

- 토드에서 Excel 파일로 Export 하기
http://suein1209.tistory.com/426
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.09(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 20:30  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불마감금액조회(/SB_ClpyClsnAmtInqy.xml) 개발 ==> 완료
==============================================================================================================

- 세션 인증 실패 처리:FAIL_CERT_SESSION1
==> FAIL_CERT_SESSION1("30601", "세션 인증 실패[T_01]"),   
==============================================================================================================

- [Spring 3 - MVC] 핸들러 예외 리졸버(Resolver)
 http://springsource.tistory.com/7

<!-- 	<bean class="org.springframework.web.servlet.handler.SimpleMappingExceptionResolver"> -->
<!-- 	    <property name="mappedHandlers"> -->
<!-- 	        <props> -->
<!-- 	            <prop key="DataAccessException">error/dao</prop> -->
<!-- 	            <prop key="BusinessLogicException">/cmLogin/getLoginHdof.do</prop> -->
<!-- 	        </props> -->
<!-- 	    </property> -->
<!-- 	    <property name="defaultErrorView">error/default</property> -->
<!-- 	</bean> -->
 
		//로그인 validation체크
		SessionToken sessionToken = new SessionToken();
		service.processLogin(paramMap, sessionToken, request, response2);	// 로그인 처리
==============================================================================================================

[08/09] [수정 사항] 수정 처리했습니다. --> DEFC-0000003915
1. 내용: 카테고리 선택 안하고 아이템 선택 시 카테고리를 먼저 선택하라는 alert 띄워줄것.
==============================================================================================================

- Apple ID(ipad: 아이패드) 비밀번호 재설정
1. 아이패드 계정 ==> tamario@naver.com / tama3390A

- 아이패드 비밀번호 분실 시 암호 재설정하는 방법
==> http://hwsecter.tistory.com/1034
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.10(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불마감금액조회(/SB_ClpyClsnAmtInqy.xml) 개발 ==> 완료
1. 조회구분 Combo Box 별로 Grid 숨겼다고 보이기
2. footer 추가 ==> 합계 Display
==============================================================================================================

- 출고/판매 평균단가 미등록 조회(/SB_AgvCostNoRegInqy.xml) 개발 ==> 완료 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.11(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불 마감(/SB_ClpyClsn.xml) 개발(프로시져 호출 예외 케이스) ==> 완료
1. 마감
SP_SB_CLPY_CLSN_EXEC (법인코드, 마감년월, 브랜드코드, 작업구분(M), 프로그램ID, 사용자ID, O_ERR_CD, O_ERR_MSG) 호출 
2. 마감취소
SP_SB_AGV_COST_EXEC(법인코드, 마감년월, 브랜드코드(필수), 작업구분(C), 프로그램ID, 사용자ID, O_ERR_CD, O_ERR_MSG) 호출
==============================================================================================================

[08/11] [결함 사항] 수정 처리했습니다. --> DEFC-0000004957  --> 사번: 2152008
1. 내용:사번을 입력하고 입력상태를 설정하고 저장한 후, 재조회하면 다시 미등록 상태로 돌아와있습니다 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.12(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 20:00  ==> 석식(탕짜면: 8천원, 임광루): 청구할 것 

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불 마감(/SB_ClpyClsn.xml) 개발 ==> 완료
1. 마감 
==============================================================================================================

-- 프로시져 소스의 확인 @@@
SQL> SELECT text 
     FROM USER_SOURCE 
     WHERE name='FORCURSOR_TEST'
; 
-------------------------------------------------------------------------------------------------

-- 수불 마감 프로시저 @@@@  ==> PROCEDURE
EXECUTE SP_SB_CLPY_CLSN_EXEC('F100' -- 법인코드
        , '201607'              -- 마감년월
        , '1100'                -- 브랜드코드
        , 'M'                   -- 작업구분( M:생성, C:취소)    
        , 'SB_ClpyClsn'    -- 프로그램ID _5
        , 'TEST51'           -- 사용자ID
    )
;
==============================================================================================================

- Grid에서 선택(chk) 필드(checBox) 클릭 처리
1. 선택(chk) 필드를 readOnly="false"로 처리

<!-- 그리드뷰 -->
<w2:gridView id="grd_brndClsnNeck" autoFit="allColumn" autoFitMinWidth="1155" dataList="dlt_brndClsnNeck" class="scm-grid auto-height"  
	rowNumVisible="true" rowNumHeaderValue="No" rowStatusVisible="false" rowStatusHeaderValue="상태"  readOnly="true"
	style="height:38px;" summary="" columnMove="true"  ev:oncellclick="" ev:onrowindexchange="scwin.grd_brndClsnNeck_onrowindexchange" editModeEvent="onclick">
	<w2:header>
		<w2:row style="height:20px;">
			<w2:column id="th01" inputType="text" width="30" value="선택"></w2:column>
			<w2:column id="th02" inputType="text" width="100" value="브랜드"></w2:column>
			 
		</w2:row>
	</w2:header>
	<w2:gBody>
		<w2:row style="height:20px;">
			<w2:column id="chk" inputType="checkbox" dataType="text" textAlign="center" readOnly="false"></w2:column>	<!--// 선택 //-->
			<w2:column id="brndCd" inputType="text" dataType="text" textAlign="left"></w2:column>		<!--// 브랜드 //--> 
		</w2:row>
	</w2:gBody>
</w2:gridView>
<!-- //그리드뷰 -->
==============================================================================================================

- 매장&협력사 사용자관리(/CM_UsrMngmShopVndr.xml) 수정  ==> 완료 @@@
1. 현상: 휴대전화 란이 공란이 아님에도 휴대전화가 필수 항목이라는 에러를 띄웁니다.
2. 원인: 첫 줄 직원코드 변경 수정, 직원구분코드(협력사) Select Box 에서 직원구분코드(매장) Select Box로 변
경시 직원구분코드 코드 사라지는 현상 처리
==============================================================================================================
 
[08/12] [결함 사항] 저장 가능하도록 수정 처리했습니다. --> DEFC-0000003211
1. 내용: 휴대전화를 입력 후, 저장클릭하면, 변경사항이 없다는 메시지가 뜨면서 저장이 되지 않습니다.
==============================================================================================================
  
[08/12] [결함 사항] 수정 처리했습니다. --> DEFC-0000005116
1. 내용: 검색폼의 접속일자 항목에도 필수항목표시 * 가 필요합니다.
==============================================================================================================

[08/12] [결함 사항] 수정 처리했습니다. --> DEFC-0000005152
1. 내용: 검색폼의 상품등록기간항목의 날자형식을 잘못된형식으로 조회가능합니다.
==============================================================================================================
  
[08/12] [결함 사항] 수정 처리했습니다. --> DEFC-0000005138
1. 내용: 다운로드기간 잘못된날자 형식으로 조회가능합니다.
==============================================================================================================
 
[08/12] [결함 사항] 수정 처리했습니다. --> DEFC-0000005151
1. 내용: 검색폼의 카테고리항목이 드롭다운리스트를 내려보면 -전체-밖에없습니다. 카테고리항목이 -전체-밖에없어서 아이템항목도 선택이불가한상태侍求?
==============================================================================================================
 
[08/12] [결함 사항] 수정 처리했습니다. --> DEFC-0000005137
1. 내용: 검색폼 이름 ,아이디 ,접속ip항목에 아무거나 넣어도 이미지와같이 조회가됩니다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.13(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~21:00 ==>

- 주말
08:00 기상(수종 감기 걸러서 관악산 물놀이장 못 감)
09:20 집출발(자전거): 수종 밤에 열 많이 남
09:30 진료(서울가정의학과의원): 수종 감기
10:00 조제(래미안 나나 약국): 수종 감기
10:20 이마트 구로점(돗자리, 장난감, 아이스크림)
11:30 귀가
11:50 중식
14:00 낮잠 
17:00 기상
17:20 루옌 자전거 뒷자리 안장 설치(대림자전거, 2만원)
19:00 석식(냉면3그릇, 테이크 아웃): 유가네닭갈비
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.14(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==> 

- 일요일
08:00 기상
08:10 리우 올림픽 축구 8강 시청(한국 0:1 온두라스) ==> 손흥민 때문에 짐
09:00 종료
11:00 자전거(수종이와 자건거 타고 놀이터 감) ==> 루옌 자전거 핸들 고장나서 고침
11:30 중식
14:00 낮잠
17:30 기상
18:30 놀이터(수종)
19:30 석식
21:00 샤워(수종이 열 안 내려서 같이 샤워)
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.15(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 광복절
 
▦ 조기축구
06:20 기상
06:30 자전거(문영APT -> 대림운동장)
06:40 대림운동장
07:20 게임 ==> 5게임함(30대, 40대 게임 --> 40대 승), 컨디션 안 좋았음
10:10 종료
10:30 중식(개고기, 삼계탕: 다솜식당)  ==> 회장님이 쏨
11:00 종료 
11:10 최선형 사무실(훌라 침 --> 구경함)
13:00 대중이형이 5만원 줘서 맥주, 안주 사옴
14:30 종료
14:40 테이크아웃(뼈해장국, 3그릇: 양평해장국)
15:00 귀가
15:30 낮잠
18:30 기상
19:40 석식(뼈해장국)
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.16(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 말복

- 휠라 코리아 차세대 통합ERP Prj[★]
- 스타일 기간 수불부(/SB_StylTermClpyInqy.xml) 개발  ==> 완료 @@@
==============================================================================================================

- UDC 링크 
1. C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.SCMSystem\src\main\webapp\wqui 폴더에서
 1) /wqui(마우스 우 클릭) > New > Folder
 2) New Folder(새창)
  Advanced > Linked to alternate location(Linked Folder)
  C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp\wqui\cm
 입력 ==> Finish(클릭)  
 3) C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp\wqui\cm
폴더가 생성됨
 4) UDC에서 연결 시킴
==============================================================================================================
 
[08/16] [결함 사항] 수정 처리했습니다. --> DEFC-0000005230
1. 내용: 아무런 정보를 기입하지 않고 중복체크 버튼을 눌렀는데 스크린샷과 같이 '가입정보가 이미 존재한다'는 팝업이 뜹니다.
--------------------------------------------------------------------------------------------------------

/**
* String 널 처리 
*/
cmCommon.isNull = function(sValue){
	//$w.log("\n\n [/cmCommon.js] [isNull()] ==> [TEST_01] [sValue]"+ sValue );

	var blnRslt = true;
	var sStrValue = "";
 
	if(sValue == null)
	{
		sStrValue = "";
		blnRslt = true;
	}  
	else
	{
		//$w.log("\n\n [/cmCommon.js] [isNull()] ==> [01. null이 아니면] [sValue]"+ sValue +"[sValue.trim()]"+ sValue.trim() );	
		
		sStrValue = sValue.trim();
		
		if(sStrValue == "undefined" || sStrValue == "")
		{
			blnRslt = true;
		}
		else 
		{
			blnRslt = false;
		} 
	} 
	//$w.log("\n\n [/cmCommon.js] [isNull()] ==> [sValue_91]"+ sValue +"[blnRslt(결과값)]"+ blnRslt );

	return blnRslt;
};
==============================================================================================================

- 2016년 08월(정기분) 주민세영수증
1. https://etax.seoul.go.kr/에서 payco로 결제
==============================================================================================================

- 간편결제
1. 시럽페이(syrup) 등록 --> https://www.syruppay.co.kr  
2. tamario@naver.com / hp수종16**   --> 결제 비밀번호: 03**9*0   --> 2016.08.16(화) 
----------------------------------------------------------------------------------------------------
 
- 페이코(payco) 등록 --> http://www.payco.com ==> 2015.10.28(수) 등록
1. tamario@naver.com / hp수종16**   --> 결제 비밀번호: 03**9*0     --> 2016.08.16(화) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.17(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불 마감(/SB_ClpyClsn.xml) 수정 ==>   
1. 마감 처리 방식 수정 
==============================================================================================================

[08/16] [결함 사항] 수정 처리했습니다. --> DEFC-0000004955
1. 내용: 부서/매장/협력업체 항목 수정
==============================================================================================================
 
[08/17] [결함 사항] 수정 처리했습니다. --> DEFC-0000005249
1. 내용: 기준년월이 필수 입력 항목이면 앞에 빨간 * 표시해주세요..
==============================================================================================================

[08/17] [결함 사항] 수정 처리했습니다. --> DEFC-0000005250
1. 내용: 탭 이동 시 '조회구분'에는 포커스가 가지 않습니다.
==============================================================================================================

 [08/17] [결함 사항] 수정 처리했습니다. --> DEFC-0000005252
1. 내용: 조회구분코드가 창고인지 매장인지 다운로드 엑셀에 표기가 안됩니다.
==============================================================================================================
 
[08/17] [확인 사항] 수정 처리했습니다. --> DEFC-0000005251
1. 내용: 기준년월은 검색한 조건이 그대로 남아있는 것이 정상 입니다.
==============================================================================================================
  
[08/17] [확인 사항] 수정 처리했습니다. --> DEFC-0000005292
1. 내용: 사용프로그램리스트 그리드에서 사용유무를 체크하고 저장해도 조회해보면 저장되어있지않습니다
==> 최초 개발시 점주 권한을 하위 직원에게 부여하는 것이고 목적이였습니다.(박준범 과장 확인 사항)
==============================================================================================================

[08/17] [확인 사항] 수정 처리했습니다. --> DEFC-0000005296
1. 내용: 개인정보 변경을하고 저장을누르면 무한로딩에 들어갑니다.
==> 확인 결과 정상적으로 수정이 됩니다. 네트워크가 불안정할 때 테스트 한 걸로 추정 됩니다.
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.18(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 윤차장이 나 때문에 그만둔다고 조대표에게 이야기 했다고 함

- 휠라 코리아 차세대 통합ERP Prj[★]
- 수불 마감(/SB_ClpyClsn.xml) 수정 ==> 완료 
1. 마감 
==============================================================================================================

- 매장/창고 재고현황(/SB_ShopWrhsInqy.xml) 개발 
==============================================================================================================
 
- 파일 업로드 경로 관련 회의
1. 김희동 차장 참석
==============================================================================================================

- 대림3동 40대 모임
1. 20시 30분 회의 끝나고 출발
2. 오징어 물회집(철의형 가게)에서 5명이서 술 한잔 함(동주형이 쏨)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.19(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 매장/창고 재고현황(/SB_ShopWrhsInqy.xml) 개발2  ==> 완료 @@@ 
==============================================================================================================
  
[08/19] [수정 사항] 수정 처리했습니다. --> DEFC-0000005230
1. 내용: [사용자관리] 중복 체크 알람 "[사용자 중복 체크] 사용자ID 입력 여부(을)를 확인해 주십시오."로 변경 했습니다.
==============================================================================================================

[08/19] [수정 사항] 수정 처리했습니다. --> DEFC-0000005428
1. 내용: [To Do 리스트 조회] 요청기간에 20160819와 같은 형식으로 에러 처리
==============================================================================================================

[08/19] [수정 사항] 수정 처리했습니다. --> DEFC-0000005427
1. 내용: [To Do 리스트 조회] 엑셀 다운로드 처리
==============================================================================================================
 
- oracle 한 줄을 2줄로 변경(가로데이타를 세로로 변환하는 방법) 
http://www.sqler.com/140267
http://www.sqler.com/140187
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2016.08.20(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 10:30 ~21:00 ==> 조기축구(06:00 ~ 08:00), 주말 근무 

- 주말
05:30 기상
05:50 자전거(문영APT -> 대림운동장)
06:00 대림운동장
06:30 숏게임
08:00 종료
08:10 조식(김치찌게: 해장국집), 막걸리 ==> 상희형이 쏨
08:40 종료
08:50 귀가
09:30 진료(서울가정의학과의원): 수종 감기
09:40 조제(래미안 나나 약국): 수종 감기, 코물 빼는 기구 구입(만원) 
10:00 귀가
10:30 출근(김희동 차장(파일 업로드), 이재현 과장, 황정곤 사원 출근)
12:00 중식(회덮밥(특):어촌식당, LG CNS 박재완 부장이 쏨) 
14:00 김희동 차장(파일 업로드), 이재현 과장, 황정곤 사원 퇴근
19:20 로그인 조회 수정 개발서버에서 확인
20:10 퇴근
20:30 석식(탕짜면: 8천원, 임광루): 청구할 것
21:10 대림역 -> 로또 판매점
21:30 귀가
23:00 취침
==============================================================================================================

- 로그인 조회 수정
1. 로그인 문제
 1) TEST51로 로그인 후 TEST01로 다시 로그인하면 TEST51로 로그인됨. 
- /CmLoginHdofController.java 파일에서
@RequestMapping("/cmLogin/getLoginHdof.do") 
public ModelAndView getLogin(Map<String, Object> param, HttpServletRequest request, HttpServletResponse response2) throws Exception
{
	logger.debug("\n\n[/CmLoginHdofController.java] [getLogin()] @@@@@ ===> [TEST_01]" );  
	
	ModelAndView mav = new ModelAndView("wqView");
	
	@SuppressWarnings("unchecked")
	Map<String, String> paramMap = (Map<String, String>)param.get("dma_loginReq");

	//로그인 validation체크
	SessionToken sessionToken = null;

	try {
		sessionToken = sessionUtil.getSession(request);
	} catch(Exception e) {}
	logger.debug("\n\n[/CmLoginHdofController.java] [getLogin()] @@@@@ ===> [paramMap]"+ paramMap +"[sessionToken]"+ sessionToken );  
	
	if( sessionToken == null ) {   // 세션 토큰이 존재하면 ==> 문제
		sessionToken = new SessionToken();
		service.processLogin(paramMap, sessionToken, request, response2);			// 로그인 처리
		
		/*** 세션 설정 ***/
		sessionUtil.setSession(request, sessionToken);
		}
	}
}
==============================================================================================================

- 로그인 프로세스
1. 본사 로그인(/CM_LoginHdof.xml) 화면에서 로그인  --> /cmLogin/getLoginHdof.do 호출
2. Was에서 로그인 처리
- /CmLoginHdofController.java 파일에서
@RequestMapping("/cmLogin/getLoginHdof.do") 
public ModelAndView getLogin(Map<String, Object> param, HttpServletRequest request, HttpServletResponse response2) throws Exception
{ 
	ModelAndView mav = new ModelAndView("wqView");
	
	@SuppressWarnings("unchecked")
	Map<String, String> paramMap = (Map<String, String>)param.get("dma_loginReq");
 
	SessionToken sessionToken = null;

	try {
		sessionToken = sessionUtil.getSession(request);	
	} catch(Exception e) {}
	logger.debug("\n\n[/CmLoginHdofController.java] [getLogin()] @@@@@ ===> [paramMap]"+ paramMap +"[sessionToken]"+ sessionToken );  
	
	if( sessionToken == null ) {   // 세션 토큰이 존재하면 ==> 문제
		sessionToken = new SessionToken();
		service.processLogin(paramMap, sessionToken, request, response2);			// 로그인 처리
		
		/*** 세션 설정 ***/
		sessionUtil.setSession(request, sessionToken);
		}
	}

	//리턴받을 datacollection 명칭으로  Map<String, Object> response 객체에 설정 
	Map<String, Object> response = new HashMap<String, Object>();

	response.put("SSSN_ID", 			sessionToken.getSssnId());			// 세션ID
	response.put("BUKRS", 			sessionToken.getBukrs());				// 법인코드
	response.put("MENU_TYPE", 		sessionToken.getMenuType());	// 메뉴타입
	response.put("USR_ID", 			sessionToken.getUsrId());				// 사용자ID
	response.put("USR_NM", 			sessionToken.getUsrNm());			// 사용자명
 
	mav.addObject("FILAKLG01_SESSION_INFO", response);
	
	return mav;
}

3. 본사 로그인(/CM_LoginHdof.xml) 화면에서 로그인 성공 이면 세션을 처리 후 메인으로 보내기 
if ("" == cmCommon.callAjaxCheck(data)) { 	// 로그인 성공 이면
	sessionStorage.setItem("loginSucYn", "Y"); 	// 로그인 성공 여부 

	// FILAK01_SESSION_INFO 정보를 session Storage에 셋팅 @@@@ 
	sessionStorage.setItem("SSSN_ID", FILAKLG01_SESSION_INFO.get("SSSN_ID") ); 	// 세션ID
	sessionStorage.setItem("BUKRS", FILAKLG01_SESSION_INFO.get("BUKRS") ); 	// 법인코드
	sessionStorage.setItem("MENU_TYPE", FILAKLG01_SESSION_INFO.get("MENU_TYPE") ); 	// 메뉴타입
	sessionStorage.setItem("USR_ID", FILAKLG01_SESSION_INFO.get("USR_ID") ); 	// 사용자ID
	sessionStorage.setItem("USR_NM", FILAKLG01_SESSION_INFO.get("USR_NM") ); 	// 사용자명 
	//-------------------------------------------------------------------------------------------------------------------------------->
							
	//$w.url("/websquare/websquare.html?w2xPath=/wqui/cm/MDI.xml", {"spa": false, "replaceHistory": true});   // 메인 화면으로 URL 이동 
	location.href ="/websquare/websquare.html?w2xPath=/wqui/cm/MDI.xml";	 // 메인 화면으로 URL 이동
	//-------------------------------------------------------------------------------------------------------------------------------->
}

4. 메인(/quickmenu.xml) 화면에서 세션 재 셋팅 후 /cmLogin/getLoginHdof.do 호출 
==============================================================================================================

[08/20] [수정 사항] 수정 처리했습니다. --> DEFC-0000005344
1. 내용: [개인정보변경] 매장사용자ID 변경 수정 처리
==============================================================================================================

[08/20] [수정 사항] 수정 처리했습니다. --> DEFC-0000005342
1. 내용: [개인정보변경] 이메일주소1과 2가 동시에 바뀌는 문제 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.21(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==> 

▦ 조기축구
05:30 기상
05:50 자전거(문영APT -> 대림운동장)
06:30 대림운동장 출발(박본서 회장님 차 얻어 탐)
07:00 광영고등학교(신월동: 운동장 넓고 상태 최상) 도착
07:20 자체게임 ==> 40대, 50대 게임(비행기 소음 엄청 심함)
08:00 게임 ==> 2게임 뜀(골키퍼): 총 3게임 뜀(토요일 운동을 해서 컨디션 좋았음)
	--> 30대 현용이 햄스트링 부상, 형들 수돗가에서 웃통 벗어 샤워 하다 지적 받음
	--> 40대 장갑없이 골기퍼 보다가 손가락 인대 늘어남(수술 예정)
11:10 종료
11:40 중식(삼겹살, 서울식당)  --> 조기회에서 쏨(UFC 디아즈 0:2 맥그리그 경기 시청)
13:30 종료
13:40 다이소(노트2권 구입)
14:10 로또 구입처(루옌 5천원 당첨된 것 5천원짜리로 바꿈)
14:40 귀가
14:50 낮잠
17:30 기상
18:30 바나나, 사과 구입, 햄버거(4개) 구입, 놀이터(수종)
19:30 석식(루옌이 만든 냉면(맛이 없었음))
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.22(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 

- 휠라 코리아 차세대 통합ERP Prj[★] 
- 개발 환경 설정
1. Z:\8500 SCM\8599 파트별 작업 공간\1000. 공통AA\04. 개발환경\FilaKoreaERP.zip 파일 복사
2. 붙여넣기 후 압축풀기 --> C:\FilaKoreaERP 
3. maven 설정
 1) maven clean
 2) maven install ==> 에러시 아래 폴더 밑 데이타 삭제할 것
	C:\FilaKoreaERP\workspace\.metadata\.plugins\org.eclipse.wst.server.core
 3) maven update(Alt + F5)
4. Team Synchronizing에서 Syncronize 철저하게 확인할 것
5. [01_★] FilaKoreaERP.SCMsystem-8081-config > clean
==============================================================================================================

- eclipse 서버 추가 에러
1. 현상: Tomcat version 7.0 only supports J2EE 1.2, 1.3, 1.4, and Java EE 5 and 6 Web modules
2. 원인: 서버 추가 안 됨.
3. 조치: 개발 환경 다시 설정(C:\FilaKoreaERP파일 삭제 후 기존 FilaKoreaERP(07.11).7z 파일 복사 후C:\에 붙여넣기)
==============================================================================================================

- 메인 상단 메뉴 팀명 변경
1. 팀명 -> 부서명
==============================================================================================================

- 세션정보조회[01. 본사] @@@   ==> 보류
SELECT /* CmLoginHdof_sqlmap.selectSessionInfo AS 세션정보조회[01. 본사] */
       B0.BUKRS             AS BUKRS        -- 법인코드 
       , A0.DEPT_CD  -- 부서코드
       ( 
		SELECT B.DEPT_NM
		FROM   CM_DEPT_M   B           -- 등록자 부서 확인용
		WHERE  1 = 1 
		AND    B.BUKRS = 'F100'
		AND    B.DEPT_CD = A.DEPT_CD
		AND ROWNUM  <= 1
		) AS LEFT_MENU_DEPT_NM      -- 왼쪽 부서명   
   FROM CM_USR        A0
	 , CM_USR_BUKRS B0
	 , CM_LGIN_INFR  D0
 WHERE  1 = 1 
       AND A0.USR_ID    = B0.USR_ID(+) 
       AND A0.USR_ID    ='TEST51'            -- 사용자ID
;
----------------------------------------------------------------------

-- 사용자_종류별_부서명가져오기 @@@
SELECT 
       A.USR_ID
,      A.USR_NM
,      A.USR_KD   
,      A.DEPT_CD
,      A.DEPT_CD_4    
,      A.DEPT_CD_5
,      CASE A.USR_KD 
            WHEN '01' THEN
                (
                SELECT B.DEPT_NM
                FROM   CM_DEPT_M   B                  -- 등록자 부서 확인용
                WHERE  1 = 1 
                AND    B.BUKRS = 'F100'
                AND    B.DEPT_CD = A.DEPT_CD
                )
            WHEN '02' THEN
                (
                SELECT B.SHOP_NM 
                FROM   SM_SHOP B
                WHERE  1 = 1 
                AND    B.BUKRS = 'F100'
                AND    B.SHOP_CD = A.DEPT_CD_4
                )
           WHEN '03' THEN
                (
                SELECT B.CORP_NM
                FROM   PN_CSTR B
                WHERE  1 = 1
                AND    B.BUKRS = 'F100'
                AND    B.CSTR_CD = A.DEPT_CD_5
                )
           ELSE 'UNDEFINED'
      END   
FROM  CM_USR A
;

SELECT STRUC_NM
FROM  VW_CM_USR_DEPT_SHOP_CSTR
WHERE  1 = 1 
    AND USR_ID    = 'TEST51'   -- 사용자ID
     AND USR_KD    = '01'   -- 사용자구분
   AND STRUC_CD    = 'F10000040'   -- 조직ID
 ;
==============================================================================================================

- eclipse 실행 에러
1. 현상:
8월 22, 2016 4:33:32 오후 org.apache.catalina.core.StandardContext listenerStart
심각: Exception sending context initialized event to listener instance of class org.springframework.web.context.ContextLoaderListener
org.springframework.beans.factory.BeanInitializationException: Failed to process @EventListener annotation on bean 
with name 'UASToAprvconfigService'; nested exception is java.lang.NoClassDefFoundError: javax/xml/rpc/ServiceException
	at org.springframework.context.event.EventListenerMethodProcessor.afterSingletonsInstantiated(EventListenerMethodProcessor.java:105)
	at org.springframework.beans.factory.support.DefaultListableBeanFactory.preInstantiateSingletons(DefaultListableBeanFactory.java:792)
	at org.springframework.context.support.AbstractApplicationContext.finishBeanFactoryInitialization(AbstractApplicationContext.java:839)
2. 조치: 
==============================================================================================================

- "라이선스 키가 유효하지 않습니다." 에러 발생
1. 조치: C:\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp
lT0oNRUBXM0VDVE1LRVgxMFQ1QzdAPUY=
bESQ9o20gNPQksfVvpCBTYyaAFcw2Po+6XHS4I9GeJjfcy2429dtveoXKzmb0SFaF6QsZl6
h6YQ2+Ca5FJYg53T2uQzDOQbVU1SLhY=
 
--> 이전: 4xA6IWDo4R0lJMTRUVVBUUFhPTDJJPUI=
+dQDiAOP51tI/bSpK6IMBJgUi3YbuJZBmz50YhcAgy/QsDME0tuNxQpenbsnCjg1V8AsTMQ
xBjCmWOUDO3n6bl8to78vPJ9jq9OoyE=
==============================================================================================================

- 잔여석 추석 기차표 예매
1. 2016.09.14(수) 05:45 ~ 08:15, 서울 -> 포항, KTX-산천 801(12호차 4B, 4C), 107,200원
2. 2016.09.16(금) 18:50 ~ 21:25, 포항 -> 서울, KTX-산천 816(11호차 12C[역방향], 12D[역방향], 107,200원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.23(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 중식(조대표님이 쏨): 조대표님이랑 다음주 수요일까지 멀티 업로드 개발완료 하기로 약속

- 휠라 코리아 차세대 통합ERP Prj[★]
- 평균단가 계산(/SB_ClpyAgvCostCalc.xml) 개발  ==> 프로시져 호출(정상적인 케이스)
1. 확정
SP_SB_AGV_COST_EXEC(법인코드, 수불년월, ‘’, 작업구분(M), 프로그래ID, 사용자ID, O_ERR_CD, O_ERR_MSG) 
2. 확정취소
SP_SB_AGV_COST_EXEC(법인코드, 수불년월, ‘’, 작업구분(C), 프로그래ID, 사용자ID, O_ERR_CD, O_ERR_MSG)
==============================================================================================================

[08/23] [수정 사항] 수정 처리했습니다. --> DEFC-0000005517
1. 내용: [개인정보변경] 현재 본사포털 개인정보변경 팝업에 로그인 사용자 기본데이터가없습니다.
==============================================================================================================

[08/23] [수정 사항] 수정 처리했습니다. --> DEFC-0000005537
1. 내용: [스타일 기간 수불부] 수불년월에 시작년월이 종료년월보다 커도 제약이 없습니다.
==============================================================================================================

[08/23] [수정 사항] 수정 처리했습니다. --> DEFC-0000005566
1. 내용: [스타일 기간 수불부] 수불년월의 시작일자가 종료일자를 넘어가도 제약이 없습니다.
==============================================================================================================

- 간편결제 @@@ 
- 써니뱅크(신한은행: 송금 무료) 등록 --> 토스와 유사
1. tamario@naver.com / 03*9*0   -->  2016.08.23(화)
----------------------------------------------------------------------------------------------------
 
- 시럽페이(syrup) 등록 --> https://www.syruppay.co.kr  
1. tamario@naver.com / hp수종16**   --> 결제 비밀번호: 03*9*0   --> 2016.08.16(화) 
----------------------------------------------------------------------------------------------------
 
- 페이코(payco) 등록 -->http://www.payco.com ==> 2015.10.28(수) 등록
1. tamario@naver.com / hp수종16**   --> 결제 비밀번호: 03*9*0     --> 2016.08.16(화) 
==============================================================================================================

- 토스(송금) 비밀번호
1. 토스 비밀번호: 03**A
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.24(수) 작업 ■■■■■■■■■■■■■■■■■■ \
---> 06:30 ~ 21:00  ==> 오후에 에어컨 고장, 4시간 후 고침

- 휠라 코리아 차세대 통합ERP Prj[★]
- 로그인 수정: 장기, 단기 인증 세션 추가(SESSION_INFO 제거)
==============================================================================================================

- 파일 이미지 사용 방법
1. 촬영이미지경로 ==> /web/image/prodimg/YYYY(기획년도)/1100(브랜드코드)/스타일/스타일_칼라/
 1) 실제 전체경로 ==> /image/prodimg/2012(년도)/FILA(브랜드)/F1CDU0212(스타일)_GRY(칼라)/
   가. 예)  ==> /image/prodimg/2012/FILA/F1CDU0172_BYL/F1CDY0002_GPK_01.JPG
 2) Database 저장시 제외 경로(prodImg.image.dbSaveExcludePath) = /image2/web
 3) 터미널에서 확인
[fkerpdev(scmadm):/home/scmadm] cd /image2/web/image/prodimg/2012  
[fkerpdev(scmadm):/image2/web/image/prodimg/2012] ls
==============================================================================================================
 
- 엑셀 다운로드 안됨
1. 현상: Grid에서 엑셀 다운로드가 잘 안됨
2. 원인: cmCommon.getMenuNm() 때문에 발생 ==> 해당 함수 주석 처리
//options.customTitle = cmCommon.getMenuNm() + "-브랜드별 마감 목록";	// 제목(엑셀다운로드)
options.customTitle = "(개발중)수불마감-브랜드별 마감 목록";	// 제목(엑셀다운로드)   
==============================================================================================================

[08/24] [확인 사항] 수정 처리했습니다. --> DEFC-0000005570  ==> 결함 아님
1. 내용: [수불 마감] 기간이 넓을수록 건수가 많아야 되지 않은가요?
2016.05 ~ 2016.07 ==> 2,759건 
2015.05 ~ 2016.07 ==> 1,864건
2016.06 ~ 2016.07 ==> 1,999건
==============================================================================================================

[08/24] [수정 사항] 수정 처리했습니다. --> DEFC-0000005569
1. 내용: [스타일 기간 수불부] 수불년월1, 수불년월2라는 표현 대신 수불년월 시작일자, 수불년월 종료일자와 같은 표현으로 변경해주세요
==============================================================================================================
 
[08/24] [수정 사항] 수정 처리했습니다. --> DEFC-0000005563
1. 내용: [수불 마감] 검색조건에 법인코드나 작업구분이 없는데 엑셀에는 기재해줄 필요가 있는지 확인 부탁드립니다.
==============================================================================================================
 
[08/24] [수정 사항] 수정 처리했습니다. --> DEFC-0000005564
1. 내용: [수불 마감] 마감취소 처리를 했는데 처리 완료 시 '마감 처리가 완료되었다'는 팝업이 뜹니다.
==============================================================================================================

- SRM 서버 운영서버 에러남
1. AA 운영서버 해결 안하고 퇴근해서 박재완 부장에게 짜증냄
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.25(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 밤에 비: 열대야 물러감, 최두영 모친상(5만원 송금함)

- 휠라 코리아 차세대 통합ERP Prj[★]
- 로그인 수정: 장기, 단기 인증 세션 추가(SESSION_INFO 제거)
// 메뉴타입(A00:본사, B00:매장, C00:협력사, M00:모바일)
response.put("MENU_TYPE",	sessionToken.getMenuType());	// 메뉴타입
if(port == 8084 || port ==  13090) {   // M00:모바일
	sessionToken.setMenuType("M00");
}
==============================================================================================================
 
[08/24] [수정 사항] 수정 처리했습니다. --> DEFC-0000005610
1. 내용: [[스타일 기간 수불부] 엑셀폼에서 합계행이 좌로한칸 밀려있습니다.
==============================================================================================================

- POS 서버 debug 로그 안 찍힘
1. log4j2.xml 조회해서 SCM 서버 log4j2.xml 복사해서 붙여넣기 할 것 
==============================================================================================================

- 로그인시 PWD 대소문자 구분하지 말것 ==> 완료 @@@
==============================================================================================================

- 휠라 코리아 운영서버
1. SCM(내부)
http://172.16.41.108:10090
http://172.16.41.109:10090

2. POS
http://222.231.17.68:11090

3. SRM
http://222.231.17.69:12090
==============================================================================================================
 
[08/25] [수정 사항] 수정 처리했습니다. --> DEFC-0000005618
1. 내용: [매장/창고 재고현황] 그리드 엑셀 다운로드 시 재고수량 및 재고금액은 숫자로 표기되게 해주세요.
==============================================================================================================
 
[08/25] [수정 사항] 수정 처리했습니다. --> DEFC-0000005679
1. 내용: [매장&협력사 사용자관리] 매장 협력사 사용자관리 -> 매장 직원 등록
==============================================================================================================

[08/25] [고객 합의] 신규 기능으로 처리하기로 합의함.
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.26(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 20:30  ==> 수종이가 외할아버지에게 물건 던져 피나게 하고 새벽에 잠깨서 울며 보채서 때림

- 휠라 코리아 차세대 통합ERP Prj[★]
- 로그인-모바일(/CM_LoginMbl.xml) 개발  ==> 완료 @@@
==============================================================================================================

- 상품이미지 목록 조회(/CM_ProdImgListInqy_P01.xml) 수정
1. 이미지 업로드 Grid 형식으로 변경(다중 업로드)
==============================================================================================================

[08/25] [수정 사항] 수정 처리했습니다. --> DEFC-0000005680
1. 내용: [매장&협력사 사용자관리] 1. 하단 좌측 그리드 선택 시 우측에 메뉴들이 안뜸
2. 권한 복사 기능 필요
==============================================================================================================
 
- 추가 개발 건
1. 권한그룹별 프로그램권한 일괄등록(/CM_AuthGrpPgAuthBtchInput.xml)   --> 신규
2. 권한그룹별 프로그램권한(/CM_AuthGrpPgAuth.xml)  --> 수정 
3. 권한그룹별 사용자등록(/CM_AuthGrpMngm.xml)  --> 수정 
4. 사용자별 프로그램추가권한/CM_UsrPgAuth.xml)  --> 수정  
==============================================================================================================

- 퍼블리싱요청 방법
1. FILA-AD-CM-05(화면_보고서 정의서)_공통_ONLY_수정보완분_0824.pptx 파일을 파일서버에 올리기
 1) 파일서버: Z:\8500 SCM\8599 파트별 작업 공간\1000. 공통AA\00. 퍼블리싱\10.퍼블리싱요청\CM 공통
2. 패션ERP_Publishing1요청_및_진행현황_V0.6.xlsx 파일에서 내용 작성
 2) 파일서버: Z:\8500 SCM\8120 구축\13 개발 요청서
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2016.08.27(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 20:00 ==> 조기축구(06:00 ~ 08:00), 주말 근무 

- 주말
05:30 기상
05:50 자전거(문영APT -> 대림운동장)
06:00 대림운동장
06:30 숏게임(날씨 시원해짐)
08:00 종료 
08:20 귀가
09:00 출근
09:10 로그인 조회 수정
12:00 중식(회덮밥(특):어촌식당, 혼자 먹었음 ==> 청구할 것)  
19:20 로그인 조회 수정 개발서버에서 확인
20:10 퇴근
20:30 석식(탕짜면: 8천원, 임광루): 청구할 것
20:40 빵 구입(파리바게뜨 방배점)
21:20 귀가
23:00 취침
==============================================================================================================

- 로그인 조회 수정
1. 로그인(본사)(CM_LoginHdof.xml) 화면에서 세션 삭제(FILAKLG01_SESSION_INFO)
2. 로그인(본사)(CM_LoginHdof.xml) 화면에서 인증 정보 세션 추가(장기, 단기 인증용)
3. 로그인(본사)(CM_LoginHdof.xml) 화면에서 로그인(DB 조회) 후 왼쪽 퀵메뉴 화면(/quickmenu.x)에서 다시 DB 조회 
4. 개발서버 반영(16시)  
--> SSO 에러 발생
==============================================================================================================

- 로그인 문제점
1. 메인화면 로그인 후 세션이 끊어지면 에러가 날 수 있음 ==> 메인에서 세션보다 DB 호출을 먼저하기 때문에
설정 불가능  -->  Redirect를 사용하여 로그인 화면으로 보내야할 것으로 판단됨.
- /CmLoginHdofController.java 파일에서
/**
 * SCM 로그인 요청처리 
@SuppressWarnings("unused")
@RequestMapping("/cmLogin/getLoginHdof.do") 
public ModelAndView getLogin(Map<String, Object> param, HttpServletRequest request, HttpServletResponse response2) throws Exception
{
	logger.debug("\n\n[/CmLoginHdofController.java] [getLogin()] @@@@@ ===> [01. SCM 로그인 START] ] [TEST_01] ##########  ===>===>===>===>" );  

  	if(sLginSqor != null && sLginSqor.equals("0"))     //  메인 화면에서 호출 했으면 
	{
		logger.debug("\n\n[/CmLoginHdofController.java] [getLogin()] @@@@@ ===> [20. 메인 화면에서 호출 했으면]" );    
		// Redirect를 사용하여 로그인 화면으로 보내야할 것으로 판단됨.
	}
}
==============================================================================================================

- 로그인-모바일(/CM_LoginMbl.xml) 개발  ==> 완료(개발서버 반영) @@@ 
http://172.16.41.114:11090/websquare/websquare.html?w2xPath=/wqui/cm/CM_LoginMbl.xml#84. 개발S[모바일][♥]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.28(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==> 
▦ 조기축구
05:50 기상
06:20 자전거(문영APT -> 대림운동장) 
06:40 대림운동장
07:30 수춘이형님이 만원 주면서 김치 사오라고 함.(만두, 과자 사옴)
07:20 게임 ==> 4게임함(30대, 40대 게임)
10:10 종료
10:20 회계보고, 간담회(겨울 코트 문제 논의 -> 다시 검토하기로 함, 회 운영자금 천5백 남았다고 함)
 --> 회장님이 임병곤형 글에 대해 기분 나뻤다고함.
10:20 중식(김치찌게: 서울 식당)  ==> 조기회에서 쏨
11:30 종료 
11:40 테이크아웃(뼈해장국, 3그릇: 양평해장국)
12:00 귀가
12:10 루옌, 수종 다문화 행사에 감
12:30 낮잠
15:30 기상
15:40 TV시청
19:30 루옌, 수종 다문화 행사에 갔다옴(휠라 토시)
19:40 석식(뼈해장국)
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.08.29(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 석식(탕짜면(2), 소주:임광루, 곽차장): 청구할 것

- 휠라 코리아 차세대 통합ERP Prj[★]
- 상품이미지 목록 조회(/CM_ProdImgListInqy_P01.xml) 수정  ==> 
1. 이미지 업로드 Grid 형식으로 변경(다중 업로드)
==============================================================================================================

1. 비밀번호 대소문자 수정
 1) 2152026,  / JT9425
/CmLoginHdof_sqlmap.xml 파일에서
<select id="selectLoginInfo" parameterType="HashMap" resultType="HashMap">
	<![CDATA[
		SELECT /* CmLoginHdof_sqlmap.selectLoginInfo AS 로그인 정보 조회[01. 본사] */
						USR_ID
				, PW 
				, USR_NM 
				, NVL(LTERM_CERT_STTS_CD, '00') AS LTERM_CERT_STTS_CD 	--장기인증상태코드
				, LTERM_CERT_MSG   		--장기인증메시지 
		FROM CM_USR
		WHERE 1=1 
	   AND USR_ID = #{usrId}		-- 사용자ID
	]]>
	<if test="usrPwd != null">
			AND LOWER(PW) = LOWER(#{usrPwd})   	-- 비밀번호
	</if>
</select>
==============================================================================================================

- SCM 개발 서버에 SSO 적용하는 방법
1. scmdev.fila.co.kr URL HOST 설정(필수 사항)
 1) C:\Windows\System32\drivers\etc\hosts 파일에서 아래 추가
# 개발 서버(01. SSO DEV)
172.16.41.114    scmdev.fila.co.kr 
------------------------------------------------------------------------------------------------------------------------------
 
2. SCM 로그인
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#01. 개발S[SCM]
 ==> websquare.jsp 파일에서 sessionStorage.setItem("loginSsoYn", "Y"); 	// SSO 로그인 여부 셋팅(세션S) 
3. 휠라 그룹웨어 로그인 화면(휠라 그룹웨어 로그인ID가 존재해야 함, SCM 아이디로 로그인 불가)에서 아이디, 패스트워드 기입
http://ssodev.fila.co.kr:10090/loginForm.do

4. SCM용 메인 화면으로 이동 함
http://scmdev.fila.co.kr:10090/websquare/websquare.html?w2xPath=/wqui/cm/MDI.xml  
==============================================================================================================

- SSO 로그아웃
http://ssodev.fila.co.kr:10090/sso/logoutRequestScm.do 
==============================================================================================================

- 세션 필터 파일(신주호D가 메일로 보냄)
<web.xml 추가 내용>
- 아래 내용은 servlet mapping 상단에 위치해야합니다. 
<filter>
  <filter-name>sessionFilter</filter-name>2016-08-29
  <filter-class>kr.co.fila.common.session.SessionFilter</filter-class>
  <init-param>
    <param-name>avoidUrls</param-name>
    <param-value>/cmLogin/getLoginHdof.do,/cmLogin/getHdofLogOut.do,/cm/leftMenu.do,/sso/authRequestScm.do</param-value>
  </init-param> 
 </filter>
 
 <filter-mapping>
  <filter-name>sessionFilter</filter-name>
  <url-pattern>*.do</url-pattern>
 </filter-mapping>
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.30(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==>  

- 휠라 코리아 차세대 통합ERP Prj[★]
- 상품이미지 목록 조회(/CM_ProdImgListInqy_P01.xml) 수정  ==> 
1. 이미지 업로드 Grid 형식으로 변경(다중 업로드)
  1) 저장 일때
cmCommon.commSaveGridsData("/cmProd/saveUpProdImg.do", [grd_prodImgList], true, 
	"scwin.sbm_saveUpProdImg_submitdone", "1", "", {"dma_requestData":dma_requestData.getJSON()});	
	// 11. 상품 이미지 업로드 저장(삭제) 
==============================================================================================================

- 오라클 등록일이 널 일 때 ORDER BY
ORDER BY (CASE 
                            WHEN  MAX(N.INPUT_DTTM) IS NULL
                                	THEN SYSDATE -365
                            		ELSE MAX(N.INPUT_DTTM)
                            END
                             ) DESC  	-- 등록일자(NULL이면 1년 전일로 설정)
==============================================================================================================

- SCM 개발 서버에 SSO 정상 작동 확인
http://scmdev.fila.co.kr:10090/websquare/websquare.jsp?w2xPath=/wqui/cm/CM_LoginHdof.xml#01. 개발S[SCM] 
==============================================================================================================
 
[08/30] [결함 사항] 수정 처리했습니다. --> DEFC-0000001766
1. 내용: 세션이 없는 경우 버튼, 메뉴 클릭시 로그인 페이지로 이동  
==============================================================================================================

- cmCommon.js 파일에서
cmCommon.callAjaxCheck = function(resObj) {	// 서버 통신시 에러 체크.
	if(cmCommon.onGoingToLoginPage===true){	//로그인페이지로 이동 중이면
		return;
	} 
	var msgType = "";
	var msgBindArr = [];
	var msgCode = "";
	var tmpMsg = "";
	var msgCont = "";
	var errMsg = "";
	var tempObj = resObj;

	if(Object.keys(tempObj).length>0){
		$.each(tempObj, function(key, value){
			if(key === "ds_exception"){	//오류처리
				if(tempObj[key].excep_type && tempObj[key].excep_type==="CustomException"){	// customException
					msgType = tempObj[key].type;
					msgBindArr = tempObj[key].bindArr.split('|');
					msgCode = tempObj[key].code;

					for(var i in msgBindArr){
						tmpMsg += ",\"" + msgBindArr[i] + "\"";
					}
					if(tmpMsg){
						msgCont = eval("cmCommon.formattingMessage(FILAErpMessage[msgCode]" + tmpMsg + ")");
					} else {
						msgCont = FILAErpMessage[msgCode];
					}
				} else {
					msgCont = "["+tempObj[key].errCode+"]"+tempObj[key].errMessage;
				}
				alert(msgCont);

				if($w.comp["txb_ProgramStatus"]){
					txb_ProgramStatus.setValue("");
				}
				errMsg = msgCont;

				// 세션오류인 경우 로그인 페이지로 전환  ===> @@@@@
				if(tempObj[key].errCode*1>=30601 && tempObj[key].errCode*1<=30604){	// 세션인증실패 
					//로그인페이지로 이동
					cmCommon.goLoginPage();
				}
				return false; 
			}
		});
	}

	return errMsg;
};
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.08.31(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00  ==> 윤정희 차장 철수(10:30), 추석 이마트 상품권 수령(10만원, (주)소프트원)

- 휠라 코리아 차세대 통합ERP Prj[★]
- 상품이미지 목록 조회(/CM_ProdImgListInqy_P01.xml) 수정  ==> 완료 @@@
1. 이미지 업로드 Grid 형식으로 변경(다중 업로드) 
==============================================================================================================

- 개인정보변경(/CM_IndiInfrChng.xml) 수정  ==> 완료 @@@
1. 대표 브랜드 추가 --> 권한 체크, GV 세션 설정
GV_RPRS_BRND_CD	-- 대표브랜드코드(rprsBrndCd)
GV_USR_BRND_CD	-- 사용자별 브랜드코드(usrBrndCd)
----------------------------------------------------------------------------------------------------------

- 세션정보조회[01. 본사]
SELECT /* CmLoginHdof_sqlmap.selectSessionInfo AS 세션정보조회[01. 본사] */
               B0.BUKRS             AS BUKRS        -- 법인코드
             , (SELECT LISTAGG(F0.BRND_CD||'/'||F0.SAV_AUTH,'^') WITHIN GROUP (ORDER BY USR_ID)
                  FROM CM_USR_BRND  F0
                 WHERE  1 = 1
                   AND F0.USR_ID    = A0.USR_ID
                   AND F0.BUKRS     = B0.BUKRS
               )                    AS BRND_SAVE_INFO    -- 브랜드저장권한코드= 사용자별 브랜드코드(usrBrndCd)
 FROM CM_USR        A0
	 , CM_USR_BUKRS B0
	 , CM_LGIN_INFR  D0
 WHERE  1 = 1 
       AND A0.USR_ID    = B0.USR_ID(+) 
       AND A0.USR_ID    =  'TEST51' /**P*/            -- 사용자ID
;
----------------------------------------------------------------------------------------------------------

- Select Box 생성 --> 개인정보변경(/CM_IndiInfrChng.xml) 에서
<!--// 21. 대표 브랜드 dataList(dlt_brndAuthList) //-->
<w2:dataList id="dlt_brndAuthList" baseNode="list" saveRemovedData="true" repeatNode="map">
	<w2:columnInfo> 
		<w2:column id="usrId" name="usrId" dataType="text"></w2:column>
		<w2:column id="bukrs" name="법인코드" dataType="text"></w2:column>
		<w2:column id="brndCd" name="브랜드코드" dataType="text"></w2:column> 
		<w2:column id="brndNm" name="브랜드명" dataType="text"></w2:column>  
	</w2:columnInfo>
</w2:dataList> 

<!--// 21. 대표 브랜드 조회 submission 정의(sbm_rprsBrndSearch) ==> ref:전송할 DC, target:받을 DC //-->
<xf:submission id="sbm_rprsBrndSearch" ref="data:json,dma_requestData" target="data:json,dlt_brndAuthList"
	action="/cmAuthBBW/getBrndAuthList.do" method="post" mediatype="application/json" encoding="UTF-8" instance="" replace="" errorHandler=""
	customHandler="" mode="asynchronous" processMsg="" ev:submit="" doneMsg="true" ev:submitdone="scwin.sbm_rprsBrndSearch_submitdone"
	ev:submiterror=""> 
</xf:submission> 
					
<script type="javascript">
	<![CDATA[
	/*
	* 초기화 이벤트
	*/ 
	scwin.doInit = function() { 
		dma_requestData.set("p_bukrs_grdUsrList", "F100"); //법인코드
		dma_requestData.set("p_usrId_grdUsrList", scwin.condition.sUsrId); //사용자ID
		
		scwin.rprsBrndSearch();	 // 대표 브랜드 조회  
	};    

	/*
	* 대표 브랜드 조회 이벤트
	*/
	scwin.rprsBrndSearch = function(e) {
		$w.log("[/CM_IndiInfrChng_P.xml] [rprsBrndSearch()] ==> [대표 브랜드 조회] [TEST_01]");
	 
		cmCommon.searchExecuteSbm("sbm_rprsBrndSearch", true); 	// 대표 브랜드 조회
	};
	]]>
</script>

<xf:select1 id="sbx_brndCd" disabledClass="w2selectbox_disabled" appearance="minimal" direction="auto" chooseOption="true"
	 style="width:130px;" displayMode="label" optionOrder="false" allOption=""
	disabled="false" submenuSize="auto" chooseOptionLabel="- 선택 -" ref="data:dma_indiInf.rprsBrndCd">
	<xf:choices>
		<xf:itemset nodeset="data:dlt_brndAuthList">		<!--// 대표 브랜드 dataList //-->  
			<xf:label ref="brndNm"></xf:label>		<!--// 브랜드명 //-->  
			<xf:value ref="brndCd"></xf:value>	<!--// 브랜드코드 //-->  
		</xf:itemset>
	</xf:choices>
</xf:select1> 
==============================================================================================================

- 매장&협력사 사용자관리(/CM_IndiInfrChng.xml) 수정  ==> 완료 @@@
1. 권한 복사 기능 필요
==============================================================================================================
 
[08/31] [수정 사항] 수정 처리했습니다. --> DEFC-0000005680
1. 내용: [매장&협력사 사용자관리] 1. 하단 좌측 그리드 선택 시 우측에 메뉴들이 안뜸 
						   2. 권한 복사 기능 필요
2. 조치: 1. 하단 좌측 그리드 선택 시 우측에 메뉴들이 안뜨는 이유는 데이타를 일괄로 부어서 권한그룹별 사용자관리(/CM_AuthGrpMngm.xml)에서
사용자 등록을 안해서 조회가 안됩니다. 
          2. 권한 복사 기능은 설명한 대로 권한 추가 개발시 반영하도록 하겠습니다.
3. 조치: 
 1) 권한그룹별 사용자관리(/CM_AuthGrpMngm.xml) 수정
 2) 사용자 관리 정보 수정   @@@@@@@@@@@@@  
UPDATE  CM_USR A  
 SET A.HRNG_DT = TO_CHAR(SYSDATE-30,'YYYYMMDD')         --입사일자
WHERE 1 = 1
    AND A.USR_ID =  'ABC마트'       -- 사용자ID(tamario, 2074028)
;     
==============================================================================================================

- select box 필터링(/CM_UsrMngmShopVndr.xml 파일에서)
scwin.doInit = function() { 
	// 사용자구분 필터링 code가 00, 02, 03 인 것만 출력[사용자구분코드]
	dlt_sbx_usrKdSrch_0005.removeColumnFilterAll();  	//필터초기화 
		
	if(sUsrKd == "01")   // 사용자구분이 '본사' 이면 
	{  
		dlt_sbx_usrKdSrch_0005.insertRow( 0 );
		dlt_sbx_usrKdSrch_0005.setCellData( 0 , "codeNm" , "-전체-" );	// 사용자구분코드(0: 전체)
		dlt_sbx_usrKdSrch_0005.setCellData( 0 , "code" , "00" );		// 사용자구분코드(0: 전체)
		
		dlt_sbx_usrKdSrch_0005.setColumnFilter( {type:'row', colIndex:'code', key:'00', condition:'and'});	// 사용자구분코드(00: 전체) --> 처음은 and
		dlt_sbx_usrKdSrch_0005.setColumnFilter( {type:'row', colIndex:'code', key:'02', condition:'or'});	// 사용자구분코드(02: 매장)
		dlt_sbx_usrKdSrch_0005.setColumnFilter( {type:'row', colIndex:'code', key:'03', condition:'or'});	// 사용자구분코드(03: 협력사) 
		
		dma_requestData.set("usrKdSrch", "00");		// 사용자구분 초기화 
	} 
}		 
==============================================================================================================
 
[08/31] [수정 사항] 수정 처리했습니다. --> DEFC-0000002876  --> 완료
1. 내용: [상품이미지 목록 조회] Grid에서 이미지 업로드 일괄 처리 기능
==============================================================================================================

[08/31] [수정 사항] 수정 처리했습니다. --> DEFC-0000006049  --> 완료
1. 내용: [프로그램관리] Grid에서 cm_pg table에 추가된 컬럼들 grid 에 추가
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■