

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2016.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2016.01.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 새해(공휴일)

- 새해
06:00 기상
07:20 버스(6411번, 대림역 -> 학동역)
08:20 신구초등학교
08:30 게임 --> 역삼 조기회(라이트 윙보다가 빨리 튀어서 다리에 통증 느낌)
11:10 종료 
12:30 귀가
11:20 중식(집에서 먹음)
13:50 낮잠
16:30 기상
19:30 석식
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 
 
- 주말
09:00 기상
09:30 조식(라면)
10:30 진료(서울가정의학과의원: 첫 방문): 수종 감기
10:50 조제(래미안 나나 약국): 수종 감기 
11:10 귀가
11:30 돈 입금(300만원 신한은행에 입금)
13:20 지하철(대림역 -> 홍대입구역 -> 인천국제공항) ==> 장모님, 루옌, 수종
15:00 인천국제공항역 -> 밀리니엄홀(1층) -> 출국장(3층) -> 탑승수속 및 짐부치는 곳(베트남은 보통: D19~36)  
15:20 체크인 수속
15:30 장모님 탑송 수속
15:40 인천공항 출발
16:00 지하철(인천국제공항 -> 홍대입구역 -> 대림역) ==> 수종 잠(안고 온다고 고생함)
17:30 귀가
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.03(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:10 ~ 19:00 ==> 

▦ 조기축구
06:00 기상
07:20 버스(6411번, 대림역 -> 학동역)
08:20 신구초등학교 
08:30 게임 --> 인원이 많아서 첫게임 쉼, 골기퍼 시켜서 짜증냄(2게임 뜀)
09:30 월례회의 ==> 집행부 발표(모두 연임, 감독은 병춘이형 탄핵 당하고 승렬이형이 선임됨)
11:20 종료
11:30 중식(해장국): 류명국해장국에서 국, 밥 찬조(운동장에서 해 먹음)
12:20 종료 
13:20 귀가(성우 트럭 타고 옴)
14:00 낮잠
16:30 기상
19:30 석식(탕수육 셋트, 우동, 테이크아웃): 남구로시장(왕짜장)
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 신년 첫출근(IBK 식당에서 중식 무료 제공) 

- IBK 운영 Risk Proj[★]
1. 왼쪽 메뉴 Grid로 수정
==============================================================================================================

- 배포 파일 버전 변경
XLauncher.key = "HS_ERP"; 
XLauncher.version = "9.2.1";   // XLauncher 버전
XLauncher.xadl = "http://"+ sServerHost + "/XIContent/HS_ERP.xadl";   // xadl(HS_ERP 개발 서버)  
==> http://172.168.110.41:7070/XIContent/HandsomeERP.xadl
XLauncher.componentPath = "%USERAPPLOCAL%\\TOBESOFT\\HS_ERP\\Component\\";   
// component가 로컬 PC에 다운로드되는 경로
==============================================================================================================

- 운영 Risk 프로그램 배포 에러 문제 문의 작성
1. (주)투비소프트 김동규 팀장에게 작성해서 메일로 보냄
==============================================================================================================

- 운영 리스크 디자인 분석 자료 작성
1. (주)IBK 시스템 박성대 차장에게 메일로 보냄
==============================================================================================================

- 개발서버 라이센스 등록(eclipse에서)
1. XPLATFORM_Client_License.xml 라이센스 등록
 1) 00. XPlatform 라이센스(2015.08~09)/XPLATFORM_Client_License.xml 를 다운로드 받음
 2) 개발서버 C:\hsdocs\hse\docroot\XIContent\HsDeploy폴더에 붙여 넣기
2. XPLATFORM_Server_License.xml 라이센스 등록
 1) 00. XPlatform 라이센스(2015.08~09)/XPLATFORM_Server_License.xml 를 다운로드 받음
 2) 이클릭스 C:\HS_ERP\workspace\handsome\src\main\webapp\WEB-INF\lib폴더에 붙여 넣기 후
 커밋할 것
==============================================================================================================

- 화장품 구입
1. 우르오스 스킨 밀크(남성 화장품), 한국오츠카제약, 티몬, 가격: 23,500원
 http://www.ticketmonster.co.kr/deal/245649665?isHistory=Y
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.1.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
1. 왼쪽 메뉴 Grid로 수정
==============================================================================================================

- AD-Spider 처리
1, 시작-실행-msconfig 입력-확인-시작프로그램에서 nd와 PC-Clean 두 개를 체크 해제하고 적용-확인-재부팅
2. 레지스트리에서 adspider, 다잡아를 삭제
 1) 시작-실행-regedit 입력-확인 ⇒ 레지스트리 편집기
 2) 사전에 미리 기존 레지 기록을 백업(저장) ==> 좌측 상단의 '내컴퓨터'를 마우스 우클릭하여 '파일로 내보내기'를 선택 
  (01. register_file.reg 파일 백업할 것)
 3) 편집기를 연 상태에서,,,Ctrl + F 를 누르고, adspider (대/소문자 구별 없음)를 입력하고 엔터칩니다. 
  ==> 나오는 것을 잘 확인한 후 짙은 색으로 표시된 부분을 우클릭하여 삭제 
 4) 그 상태에서 F3 를 누릅니다. 나오는 것을 역시 잘 확인한 후에 삭제  
 5) 다시,,,Ctrl + F 를 누르고 다잡아를 입력하여...작업 반복 해줌
 6) 편집기를 닫고 재부팅
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 중식, 커피(을지로입구역 식당에서 태훈이형이 사줌)

- IBK 운영 Risk Proj[★]
- 왼쪽 메뉴 Grid로 수정 ==> 완료 @@@
- 탭 메뉴 생성
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.01.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- 탭 메뉴 생성 테스트 
==============================================================================================================

- 디자인 관련 회의
1. IBK 현업,  (주)투비소프트 영업 대표, 디자인 팀장
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- IBK 운영 Risk Offline 소스(디자인용) 만들어서 현업에 결재 요청
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 
 
- 주말
06:00 기상
07:20 버스(6411번, 대림역 -> 학동역)
07:30 신구초등학교 
07:40 숏게임
08:35 종료
08:50 임원회의(파리바케트): 김성수 회원 제명안, 차원철 회원 재가입안 --> 성수형과 상요형이 회의장에 와서
        중단됨(총무인 병규형이 상수형 제명해야 한다고 주장 --> 추후 문자로 결과 통보한다고 함)
09:35 종료
09:50 버스(6411번, 학동역 -> 대림역)
10:40 귀가
11:10 진료(서울가정의학과의원: 첫 방문): 수종 감기
11:20 조제(래미안 나나 약국): 수종 감기
11:40 붕어빵(5천원), 한솔교육 팀장 만남
11:50 귀가
12:30 중식
14:30 낮잠 
16:30 기상
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 

▦ 조기축구
06:00 기상
06:20 버스(6411번, 대림역 -> 학동역)
07:20 신구초등학교 
08:30 게임 --> 라이트 윙(1 AS), 3게임 뜀
11:20 종료
11:30 중식(국밥: 뚝심한우): 오세림 고문님이 쏨
13:20 종료 
13:20 귀가(태훈이형이랑 지하철 타고 감)
14:30 귀가
14:00 낮잠
16:30 기상
19:30 석식(짬뽕라면)
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 바둑 공부 시작(동영상)

- IBK 운영 Risk Proj[★]
- 엑셀 다운로드(export) 공통함수 개발(조회 조건 추가)
==============================================================================================================

- 2016년 설 기차표 예매
1. 서울행(KXT)
1) 2016.02.11(목) 05:25 ~ 07:55, 포항-> 서울, KTX-산천 802(2호차 10C, 10D), 96,400원(10,800원 할인) ==> 태만, 루옌, 수종 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- 엑셀 다운로드(export) 공통함수 개발(조회 조건 추가)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- 엑셀 다운로드(export) 공통함수 개발(조회 조건 추가)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.14(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- 개발서버(22번)에 소스 반영
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 수종이가 분무기로 물 뿌려서 TV 고장 냄(LG AS 부를 것)

- IBK 운영 Risk Proj[★]
- 개발서버(22번)에 소스 반영
==============================================================================================================

- 수종 LG TV 고장냄(19시, 집)
1. 수종이가 집에서 분무기로 TV(LG 55LM6100)화면에 물을 뿌렸다고 하는데 화면이 하얀색 줄이 생겨서
전현 안 보이고 소리만 들림.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 
 
- 주말
04:00 기상
05:00 (주)투비소프트 게시판에 질문 올리기(1. top 프레임에서 Main프레임 Grid조회
	2. Active방식(IE 11)으로 배포시 로그인 화면 처리 문제) 
09:30 조식(빵)
10:00 LG 서비스 센터 기사 방문 ==> 전체 패널을 교체 해야 된다고 함(수리 비용: 62만원 예상)
10:20 종료
10:50 내방에 있는 24인치 모니터 거실로 가져옴(TV 대용으로 사용: 화면 너무 작음)
12:30 중식
16:30 쇼핑(쇼핑 ==> TV 구경: 너무 비쌈)
18:00 귀가
18:20 응답하라 1988(19, 20회: 마지막회) 시청
19:00 석식
23:00 취침
==============================================================================================================

- LG 서비스 센터(T: 1577-7777)
https://www.lgservice.co.kr/VisitServiceMainCmd.laf?svcTy=B#step3Location
1. 증상: LG TV 55LM6100, 어제 아들이 분무기로 TV화면에 물을 뿌렸다고 하는데 화면이 전현 안 보임.
2. 관악서비스센터 ==> http://www.lgservice.co.kr/cs_lg/center/service/CSServiceCenterViewCmd.laf?deptCd=PH0064
3. 영등포 서비스 센터 김명훈(010-8396-7030) 엔지니어 방문(10시)
 1) TV 모니터 내부에 물이 들어가서 전체 패널을 교체 해야 된다고 함(수리 비용: 62만원 예상)
 2) 생각 해본다고 함(출장비: 만 8천원 안 받음 ==> 출장 서비스 취소로 처리 한다고 함)
==============================================================================================================

- 로직텍 키보드 구입(K120)
1. 이마트에서 9,900원에 구입
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=652653278&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 

▦ 조기축구
06:00 기상
06:20 버스(6411번, 대림역 -> 학동역)
07:20 신구초등학교 
08:30 게임 --> 라이트 윙(자체 게임), 논현 조기회(늙었지만 잘 참) ==> 3게임 뜀
11:30 종료
11:40 중식(제육 정식: 포도식당): 우리 테이블 상권이형이 쏨(7만원)
13:00 종료 
13:20 버스(학동역)
14:30 귀가(루옌 다오집에 놀러 감)
15:00 이마트(로직텍 키보드 교체하러 감 ==> 고장 안나서 그냥 옴)
15:30 귀가
20:10 루옌, 수종 귀가
20:20 석식(라면)
23:30 취침
==============================================================================================================

- 큐브 333 왕초보 공식 @@@
https://www.youtube.com/watch?v=rQD-SdoJDvs 

1. 1단계는 밑면 십자가를 맞추는 단계 
 1) 중앙 노란색, 나머지 흰색 맞추기
 2) 흰색 기퉁이 기준으로 밑 2개의 색 설정
 3) 맞은 2개의 색을 시계 방향으로 180도 돌리기
 ==> 아랫면이 흰색 십자가가 완성됨, 양끝으로 색 2개씩이 완성됨 

2. 2단계는 밑면 ㅜ자 모양 만들기  
 1) 가운데 밑변의 색과 대각선의 같은 것 찾기(가운데 밑변 위의 색과 아랫 색을 엄지 손가락과 검지 손가락로 잡을 것, 노란색이
   섞여 있으면 안됨)
 2) 위로 1번 돌리고, 오른쪽으로 1번 돌리고, 아래로 1번 돌리기 (U -> R ->  D, 같은 것이 없으면 아무대나 U -> R ->  D으로  돌리기)
 ==> ㅜ자 모양아이 완성됨(아랫면이 흰색 십자가가 완성되어 있어야 정상)
 
3. 3단계는 밑면 2줄 만들기  
 1) 대각변에 흰색을 사이에 두고 밑변의 2개의 색이 같고 옆변 2개의 색이 같은 것 찾기(대각변에 흰색을 사이에 두고 밑변의 2개의 색을 엄지 손가락과 검지 손가락로 잡을 것)
 2) 오른쪽(왼쪽) 옆으로 1번 돌리기, 위로 1번 돌리고, 오른쪽(왼쪽) 으로 1번 돌리고, 아래로 1번 돌리기, 오른쪽(왼쪽) 
 옆으로 2번 돌리고, 위로 1번 돌리고, 오른쪽(왼쪽) 으로 1번 돌리고, 아래로 1번 돌리기(입으로 번호를 세면서 9번을 돌림)
 ==> 밑면 2줄과 아랫면이 흰색이 완성됨

4. 4단계는 윗면 십자가 모양 만들기
 1) 노란색이 일자 또는 반대자 니은이 보이게 설정 (노란색 일자를 왼쪽 검지 손가락으로 고전을 하고 앞면 오른쪽으로 1번 돌림..앞 --> 옆 돌리기)
 2) 앞면 오른쪽으로 1번 돌리고, 오른쪽을 위로 1번 돌리고, 왼쪽으로 1번 돌리고, 아래로 1번 돌리고, 오른쪽으로 1번 돌리고, 
 앞면 왼쪽으로 1번 돌리기(입으로 번호를 세면서 6번을 돌림)
 ==> 윗면 십자가 모양이 완성됨

5. 밑면이 7개 이상 모양 만들기
 1) 밑면이 7개 이상 맞은 것 찾기
 2) 왼쪽 아래로 1번 돌리기, 왼쪽으로 1번 돌리고, 왼쪽  위로 1번 돌리고, 왼쪽으로 1번 돌리고, 왼쪽 아래로 1번 돌리기, 왼쪽으로 2번 돌리고, 
왼쪽 위로 1번 돌리고, 앞면 왼쪽으로 1번 돌리기(왼손 바닥으로 왼쪽을 잡고 무조건 내리고 오른손으로 왼쪽 옆으로 돌리기) (입으로 번호를 세면서 9번을 돌림)
 ==> 밑면이 7개 이상 모양이 완성됨
 
6. 윗면 노란색으로 만들기
 1) 노란색 기준점 찾기(여러개)
 2) 오른쪽 아래로 1번 돌리기, 앞면 왼쪽으로 1번 돌리고, 왼쪽 위로 1번 돌리고, 앞면 오른쪽으로 1번 돌리고, 오른쪽 위로
 1번 돌리고, 앞면 왼쪽으로 1번 돌리고, 왼쪽 아래로 1번 돌리고, 앞면을 오른쪽으로 1번 돌리기(윗면 노란색을  오른손으로 대각선으로 선을 긋고 맨 밑으로 내리기)
(입으로 번호를 세면서 8번을 돌림)
 ==> 윗면 노란색으로 완성됨 

7. 전체 완성
 1) 밑면이 2줄이 같은 것 찾기(맨 윗 줄 한 두개가 틀림) (오른손으로 무조건 위로 올리기)
 2) 오른쪽 위로 1번 돌리고, 뒷면 오른쪽으로 1번 돌리고, 오른쪽 위로 1번 돌리고, 앞면 왼쪽으로 2번 돌리고, 오른쪽 아래로
 1번 돌리고, 뒷면 왼쪽으로 1번 돌리고, 오른쪽 위로 1번 돌리고, 앞면 왼쪽으로 2번 돌리고, 오른쪽 아래로 2번 돌리기(입으로 번호를 세면서 12번을 돌림)
 (옆면 엄지, 검지 손가락으로 설정됨) 
 ==> 전체 완성 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.01.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==>

- IBK 운영 Risk Proj[★]
- 소스 수정
1. 로그인 화면 Frame에 넣기
2. 소메뉴없는 중메뉴 +가 보이기
3. 찾기 메뉴 수정
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.01.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 중식(불고기: IBK 시스템 직원 승진자가 쏨)

- IBK 운영 Risk Proj[★]
- Top Frame에서 새창 띄워서 찾기 검색 --> Main Frame에서 있는 Grid 조회 ==> 완료 @@@
//활성화된 ChildFrame창 접근
var objActiveForm = mainframe.vfs_main.hfs_main.vfs_main2.fs_work.getActiveFrame().form.div_form; 
==============================================================================================================

- 2016년 설 명절 기차표 예매
http://blog.naver.com/PostView.nhn?blogId=tamario&logNo=220592414214&categoryNo=41&parentCategoryNo=0
&viewDate=&currentPage=1&postListTopCurrentPage=&from=postList&userTopListOpen=true&userTopListCount=10
&userTopListManageOpen=false&userTopListCurrentPage=1

1. 5시 반에 기상하여 예매 시도 ==> 대기자 3만 5천 명: 1시간 기다려 예매 실패
2. 코레일(http://www.letskorail.com/)
2016.02.06(토) 05:45, 서울 -> 포항, 열차번호: KTX 801
2016.02.06(토) 06:50, 서울 -> 포항, 열차번호: KTX 803  
2016.02.06(토) 22:10, 서울 -> 포항, 열차번호: KTX 819 -> 1순위   
2016.02.07(일) 05:45, 서울 -> 포항, 열차번호: KTX 801
2016.02.07(일) 06:50, 서울 -> 포항, 열차번호: KTX 803 -> 2순위
==============================================================================================================

- 여행사 예매
 1) 뉴웰관광(서울특별시 중구 수표로 50, 02-2272-7905) 을지로 3가역 11번 출구 근처  ==> 못 찾아서 돌아옴
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.01.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 

- IBK 운영 Risk Proj[★]
- 왼쪽 메뉴 처리
==============================================================================================================

- 그리드에서 엑셀로 copy&paste 샘플 요청
1. TESE.xfdl파일에서 원하는 Grid 영역 drag해서 복사
2. TESE.xlsx파일(엑셀)에서 drag한 Grid 영역 붙여넣기
3. TESET.xlsx파일(엑셀)에서 원하는 엑셀 영역 drag해서 복사
4. TESE.xfdl파일에서 drag한 엑셀 영역 붙여넣기
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.01.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 

- IBK 운영 Risk Proj[★]
- 왼쪽 메뉴 처리
==============================================================================================================
 
- 수종 팬티 구입
1. 대구백화점 I관] [오가닉맘(organic mom)] 마이카남아팬티(기존가13.000)(MYM3UR02), 가격: 14,480원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=354008134
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 연말정산 처리(20시, 집), 붕어빵(천원에 7개: 3천원): 남구로시장 근처

- IBK 운영 Risk Proj[★]
- 디자이너(박덕진 수석)가 디자인 작업해서 메일로 보냄 ==> 박성대 차장에게 전달
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 날씨 너무 추움(-14도)
 
- 주말
06:00 기상
06:30 (주)투비소프트 게시판에 질문 올리기(1. [문의_JTM] 왼쪽 메뉴 클릭시 자동 접기) 
09:30 조식(붕어빵) 
12:30 중식
16:00 빵(긴 빵[1,700원], 롤케익[35,00원]): 남구로시장
16:30 칼국수 2개(테이크아웃): 진주칼국수 ==> 너무 추워서 손이 얼었음
17:00 귀가
17:10 루옌 칼국수 먼저 먹음
19:00 석식(칼국수가 불어 터져서 맛이 없었음)
23:00 취침
==============================================================================================================
 
- 쌀 구입 
1. 시골풍경 국내산 햅쌀100%/쌀20kg, 가격: 31,270원 ==> G마켓
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=751010570&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 날씨(-18도) 너무 추워서 축구하러 안 감, 수도물 온수 안나옴(보일러 얼었음)

▦ 조기축구
09:00 기상
11:30 집출발(보일러에서 온수 안나와서 찬물로 머리 감음)
12:00 서초역 도착(신한은행에서 돈 5만원 찾음)
12:20 아이윌 웨딩홀(서초역 8번 출구): 부주(5만원, 창원이형 아들 결혼)
12:30 중식(지하 1층 부페 식당) ==> 신사조기회 회원들 많이 옴
14:30 종료
15:20 귀가
15:40 목욕(지중해 사우나, 6천원): 처음 감
16:40 종료
17:00 귀가
18:40 석식(짜장면, 우동: 테이크아웃): 남구로시장(왕짜장)
19:00 석식(순대국, 밥: 테이크아웃): 남구로시장(현정이네 토종 순대국)
19:30 석식
22:50 보일러에서 온수 안나옴 ==> 드라이기로 배수로 녹였지만 안됨(배관동결상태로 추정)
23:30 취침
==============================================================================================================

 - 쌀 구입 
1. 원적외선 세라믹/할로겐 전기히터 SF-K14C , 가격: 24,960원 ==> 11번가
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=887822476&xzone=order^list&xfrom=order^list
==============================================================================================================

- 배관동결상태로 추정
1. 온수가 한방울도 안나온다으로 보아 보일러 고장증상이 아닌 배관동결상태로 추정됨
2. 보일러와 연결 되어있는 파이프중 왼쪽으로 부터 세번째 직수파이프의 동결이 많은 편이니 우선적으로 
직수파이프에 드라이기, 스토브등으로 열을 쬐여 배관 해동 작업을 해야함.
http://m.kin.naver.com/mobile/qna/detail.nhn?d1id=13&dirId=13040102&docId=36420731&qb=66aw64KY7J20IOqwg
OyKpOuztOydvOufrCDrj5nqsrA=&enc=utf8&section=kin&rank=26&search_sort=0&spq=0&from=detailSearch
==============================================================================================================

- 집 난방[문영APT 1806호, 린나이 R321-25KF] --> 2016.01.24(일)
1. 난방온도: 22도 ==> 실온난방(방안의 온도을 감지) 설정
2. 온수: 중 ==> 고[씻을 때(목욕)]
3. 혹시 영하 10도 이상 떨어진다면 최소 외출에 권장 온돌 40도, 실온 18도 이상 설정이 좋습니다.
--------------------------------------------------------------------------------------------

- 경동 나비엔 보일러 배관 구조[순서: 오른쪽에서 왼쪽으로]
1. 현재 사용 
2. 침실3(태만방)
3. 거실1
4. 거실2
5. 침실1(안방)
6. 침실1(안방)
7. 침실2(수종방) 
==============================================================================================================

- 실온난방: 실내온도센서로 방안의 온도을 감지하여 실내온도를 조절하는 방식(방안의 온도을 감지)
- 온돌난방: 보일러에서 나오는 물의 온도를 감지하여 방바닥의 온도를 조절하는 방식(물의 온도를 감지)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 문영 APT  탱크 배수관이 얼어서 수도물 안 나옴(경비실에 물 떠러감)

- IBK 운영 Risk Proj[★]
- 로그인 Frame안에 넣기
1. 로그인을 Frame안에 생성 ==> 완료 @@@
2. 디자인 적용 작업 ==> 완료 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 저녁에 수도물 온수 다시 나옴(날이 풀림)  

- IBK 운영 Risk Proj[★]
- 로그인 Frame 안에 넣기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==>   

- IBK 운영 Risk Proj[★]
- 로그인 Frame 안에 넣기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 ==> 보일러 배관 동파 방지제 설치

- IBK 운영 Risk Proj[★]
- 엑셀 다운로드 변경(조회 조건 Grid로 추가)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 ==> 보일러 배관 동파 방지제 설치2  

- IBK 운영 Risk Proj[★]
- 엑셀 다운로드 변경(조회 조건 Grid로 추가)  ==> 완료 @@@
==============================================================================================================

- 2015년 연말정산 정리
① 총급여: 28,340,946원,		② 근로소득금액: 28,340,946원
③ 과세표준: 10,557,933원,		④ 산출세액: 633,475원
⑤ 결정세액: 15,064원,		⑥ 기납부 소득세액(먼저 낸 세금): 868,600원
⑦ 차감징수납부(환급)예상세액(⑤-⑥): -853,530원
근무처 : （주）지아이데이타(220-87-57184)
==============================================================================================================

- 갤럭시 노트5 쉬운 휴대폰 데이터 이동 방법(Smart Switch)
http://www.samsung.com/sec/support/smartswitch/smartswitch.html
==============================================================================================================

- 왼쪽 메뉴 클릭시 메뉴 자동 접기 로직 @@@
1. 왼쪽 메뉴 클릭 ==> 2015_12.15_IBK_ORMS_OffLine/LeftFrame.xfdl 참조
2. dsMenu DS 중에서 Row별 Child가 있을 경우  ==> arrParent[j] Array()에 저장 
for(var i= 0; i <= dsMenu.rowcount; i++)
{ 
	if(obj.getTreeChildCount(i) > 0) 
	{
		arrParent[j] = [i, obj.getTreeChildCount(i)];
		j++;
	}
}

3. arrParent[j] Array()에서 루프를 돌면서 현재 Grid 상의 Row 중에 dsMenu DS에 Row별 메뉴 닫기 이미지(-) 
존재여부를 체크하여 Tree Status 변경 설정(닫기: 이미지(+) 변경됨)
for(var i = 0; i < arrParent.length; i++)
{	
	gRow = obj.getTreeRow(arrParent[i][0]); // 주어진 DataSet Row에 해당하는 현재 Grid상의 Row 

	if(obj.getTreeStatus(gRow) == 1)  // 01. 메뉴 닫기 이미지(-)  이면(닫기 실행)
	{  
		trace("[/Tree.xfdl] [Grid01_oncellclick()] ==> [02-1. dsMenu DS에 Row별 [Tree 닫기] [i_번째]"+ i );
		obj.setTreeStatus(gRow, false); // Tree Status 변경 설정(닫기)	
		gRow2 = obj.getTreeRow(arrParent[i][0]); // dsMenu DS에 Row별 현재 Grid상의 Row
	}
}

4. dsMenu DS에 Row별 메뉴 닫기 이미지(-)가 존재하는 Grid 상의 Row (gRow2)와 현재 Grid 상의 Row(gRow3)가 
같으면 Tree Status 변경 설정(닫기: 이미지(+) 변경됨)로 변경되고 다르면 Tree Status 변경 설정(열기: 이미지(-) 변경됨)로 변경됨)
if(obj.getTreeStatus(gRow) == 0)  // 02. 메뉴 닫기 이미지(+)를 클릭 했으면(열기 실행) 
{
	if(gRow2  == gRow3)  // / dsMenu DS에 Row별 메뉴 닫기 이미지(-)가 존재하는 Grid상의 Row 
	{  
		obj.setTreeStatus(gRow, false); // Tree Status 변경 설정(닫기)	   
		trace("[/LeftFrame.xfdl] [grd_menu_oncellclick()] ==> [03-1-01. dsMenu DS에 Row별 [Tree 닫기]" ); 
	}
	else
	{ 	
		obj.setTreeStatus(gRow, true);  // Tree Status 변경 설정(열기)	 
		trace("[/Tree.xfdl] [Grid01_oncellclick()] ==> [03-1-02. dsMenu DS에 Row별 [Tree 닫기]" );	
	}
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 
 
- 주말
06:00 기상
07:30 자동이체 설정(신한은행에서 설정)
10:00 루옌 다오 딸 생일에 감
11:10 XPlatform 공부(왼쪽 메뉴 클릭시 메뉴 자동 접기 분석)
07:00 루옌 귀가
17:30 봉추 찜닭 테이크아웃(2인분 2만원)
19:00 석식
23:00 우리카드 결산 작업
01:10 2016 AFC U-23 챔피언십 결승 시청( 한국 2: 3 일본)
02:00 취침
==============================================================================================================

- 자동이체 설정(신한은행에서 설정)
1. [국민은행 적금] KB국민행복적금[루옌] 매월 20일 자동이체 설정
2. [기업은행 적금] IBK 사랑나눔 적금 매월 20일 자동이체 설정  
--------------------------------------------------------------------------------------------------------

- [국민은행 적금] KB국민행복적금  재가입[루옌]   ==> 2015.05.08(금) 가입  @@@
1. 계좌번호: 037403-04-029055(03740304029055)
2. 금리: 연 7.5% 수익(기본: 4.5% + 우대: 3%) , 구로 지점
3. 계약금액: 6,146,250(세전),       4. 계약금액: 6,205,647(실수령액)
5. 계약기간: 1년(월 50만원, 신한은행에서 20일 자동이체됨)
6. 만기일: 2016.05.25(월)
-----------------------------------------------------------------------------

- [기업은행 적금] IBK 사랑나눔 적금거입 ==> 가입일: 2015.11.20(금)   @@@
1. 계좌번호: 586-032045-14-001 
2. 금리: 연 5.1% 수익(기본: 3% + 우대: 2.1%), 구로삼성IT 지점
3. 계약금액: 천 만원(세전)
4. 계약기간: 2년(월 41만원, 신한은행에서 20일 자동이체됨)
5. 만기일: 2017.11.20(월) 
==============================================================================================================

- MSI 노트북 조회
1. 조회 조건: 17인치 이상, MSI(17.3 인치)
http://www.enuri.com/view/Listmp3.jsp?cate=0404&factory=MSI
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1414528428
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.01.31(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00 ==> 

▦ 조기축구
06:00 기상
06:40 버스(6411번, 대림역 -> 학동역)
08:20 신구초등학교 
08:30 게임 --> 도곡(3게임함, 2게임 윙: 1골 넣음)
11:40 종료
11:50 중식(부대찌게, 류명국해장국): 창원이형(회장)이 아들 결혼식 답례로 쏨
12:50 종료 
14:00 귀가
14:10 루옌 부채춤 공연하러 다문화센터로 감
14:00 낮잠
16:30 기상
16:40 루옌 귀가
19:30 석식
20:30 이발(루옌이 깍아 줌)
22:30 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■