

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+-----------------------------------------------// Memo(2022.07) //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■



■■■■■■■■■■■■■■■■■■ 2022.07.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- KB카드 Prj[★] 
- 프로젝트 정보
1. 고객: KB카드
2. 프로젝트명: KB Pay 중심의 One-platform 서비스 구축 Prj 
3. 기간: 22.07.01 ~ 22.12.31(6개월)
4. 사업장: 청계3가 청계IT센터(7층)
5. 사번: MS07220
6. 단가: 830만원
==============================================================================================================

- KB카드 Prj 회의(16:10, 회의실)
1. 김현삼 전무가 설명해줌 ==> 개발 PL: 이훈 이사
 1) KB 홈 앱(진태만, 노기수 과장)
  가. 인증, 세션 처리 추가
 2) KB PAY
 3) KB 리브 메이트
==============================================================================================================

- KKB카드 Prj 분석
1. Memo(22.07).doc, 개발(22.07).doc, 분석.doc 파일 생성
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말[★] 
06:30 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:45 귀가  
09:00 샤워  
10:30 인터넷 서핑 ==> 2021.05~10_농협 Memo OCR 처리
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 실내 도보 
19:40 종료
20:00 샤워
21:00 인터넷 서핑 ==> 2021.05~10_농협 Memo OCR 처리(2021.05 ~ 07): ■ 07M_02 없음(확인 필요)
23:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.07.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:30 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:45 귀가  
09:00 샤워  
10:30 인터넷 서핑 ==> 2021.05~10_농협 Memo OCR 처리(2021.08 ~10)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 2021.05~10_농협 Memo OCR 처리(2021.08 ~10)
18:00 석식
18:30 실내 도보 
19:40 종료  
19:45 청소(청소기, 밀대)
20:10 샤워(찬물: 체중: 65.7kg ==> BMI: 22.73[표준 체중])
21:30 인터넷 서핑 ==> 2021.05~10_농협 Memo OCR 처리(2021.08 ~10)
22:00 종료  
22:50 취침
==============================================================================================================

- 프로젝트에서 찍은 이미지 파일 OCR 작업
1. vFlat 어플에서 이미지 생성 ==> Documnets/vFlat 폴더에 생성됨
 1) 2021.05~10_농협 Memo(폴더) 생성
2. 2021.05~10_농협 Memo(폴더) 압축하기
 1)  2021.05~10_농협 Memo.zip 파일로 생성됨
3. OCR 작업 및 내보내기( 2021.05~10_농협 Memo 폴더에서)
 1) 내보내기: 2021.05~10_농협 Memo.zip 파일: 내보내기 ==> 구글 드라이브: 선택 ==> 전송됨 
 4. 구글 드라이브 화면(웨일에서 오픈할 것)에서 ■ 05M_01.jpg 파일을 OCR 처리해서 한글화할 것
https://drive.google.com/drive/folders/1HcN0qEowkOZP1odGRCbvbpCWIM8KdFbw
 1) ■ 05M_01.jpg --> Memo(2021.05).sql
----------------------------------------------------------------------------------------------------------------------------

 - 구글 드라이브 사용법 
 1. 구글 드라이브 화면(웨일에서 오픈할 것)에서 
 1) [▶▶] S분석, No. 01.jpg 파일: 마우스 우 클릭 ==> 연결 앱 --> Google 문서: 클릭
 2) 텍스트 전환된됨 파일 보여줌
  https://docs.google.com/document/d/17wHY3G_1sCyfvUNPqG8cWxtuc5XTORCRWH05mx3PPrM/edit
  3)  텍스트 전환된 파일 내용 복사  
============================================================================================================== 

- 셀트리온 회장 서정진 생애 및 재미있는 이야기[역사비디오]
https://youtu.be/sipfFu3CjTw
==============================================================================================================  
 
■■■■■■■■■■■■■■■■■■ 2022.07.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 포항 동부초 생존 수영 교육(2022. 7.4.(월)~7.8.(금), 9시, 포항 복합 문화 센터 덕업관)

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- UltraEdit Portable 27.00.0.22 (32/64) 한글(무료 버전)
1. 자료실 - IDM UltraEdit Portable 27.00.0.22(32/64) 한글
https://windowsforum.kr/data/13466812
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- KTX 예매(수종)
1. 22.07.31(일) KTX-산천 252 포항(18:21) -> 서울(21:57), 470(7호차 3A, 3B), 77,900원
==============================================================================================================

- 치료 치료[★]
18:00 퇴근(KB카드 청계 IT센터)
18:20 을지로입구역
18:50 신대방역
19:00 귀가
19:00 석식 
19:25 집출발(자전거) 
19:40 연세 미래 치과(신림역 1번 출구 포도몰 6층) 도착
20:10 진료: 왼쪽 아래턱 견치(33번)이 마취 했는데 감각이 없어서 내가 입술을 물어 띁었다고 함, 심하게 부었다고 함(약 발라줌, 식사할
		때 천천히 조심해서 먹으라고 함), 신경 치료[마취[잇빨에 만 함]: 15,100원 결제)
20:30 종료
21:00 귀가
22:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- KB국민카드 펭수 노리 체크 카드(펭카:  플라스틱 카드) 발급 신청
1. 가드번호:  
2. 유효 기간:  
3.  CVC2: 
4. 카드수령지: 국민은행 을지로3가 지점
-----------------------------------------------------------------------------------------------------------------------------

- KB국민카드 펭수 노리 체크카드(펭요미)(모바일 단독카드) 발급
1. 가드번호: 4673-0933-1118-6004
2. 유효 기간:  06/27   
3.  CVC2: 711
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 나눔 서울 모임(19시, 목표수산[신림역 4번 출구], 현용, 호수, 태용 -> 1차 내가 쏨, 2차 호프집: 현용이가 쏨)

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> KB카드 Prj 계약(14시, 스타벅스 청계IT센터 커피숍, SPC 나일도 이사)

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- 국민 체크 카드 재발급
1. 펭수 노리 체크카드(펭카: 플라스틱 카드) [연회비, 교통카드 기능: 없음 ]
2. 카드번호: 9436 4639 0389 80424(94364639038980424) 02/28, [8042]262, 비번: ***1 --> 결제일: 15일, 결제은행: 국민은행 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말[★] 
06:30 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:45 귀가  
09:00 샤워  
10:30 인터넷 서핑 ==> 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
19:30 집출발(자전거)
19:40 진흥마트 방문 ==> 동원-추억 부산사랑 어묵 1kg(4개[개당: 3,650원]) 구입 
19:50 귀가
19:40 종료
20:00 샤워
21:00 인터넷 서핑
23:00 취침
==============================================================================================================

- 공동인증서 재발급[22.07.09(토)]
1. 신한은행 공동인증서 재발급[2021.07.07(수)] ==> 완료[♥♡] 
 1) 신한은행 > 인증센터 > 갱신 ==> https://bank.shinhan.com/index.jsp#200101000000
 2) 신한은행 계좌: 110-437-783130(110437783130), 예금주: 진태만
 3) 공동인증서 유효기간: 2022년 07월 09일 ~ 2023년 07월 09일
 4) 공동인증서 비밀번호: asas1212#^
2. 인증서 스마트폰 복사
 1) PC에서
  가. PC->스마트폰(어플)복사 ==> https://bank.shinhan.com/index.jsp#200202000000
   가) 인증번호: 1234-5678  ==> 입력(8자리)
 2) 스마트폰에서
  가. 신한 쏠(SOL) 실행 > 쏠(SOL)화면 우측상단 ‘전체메뉴(세줄)’선택 > 인증/보안 > 공동인증서(구 공인인증서) > 인증서복사
   가) 인증번호: 1234-5678 ==> 확인
==============================================================================================================

61. 안드로이드 앱 만들(rcLst, 초보코딩)
https://youtu.be/ESBCIgXtVWw

62. 안드로이드 스튜디오 기초 강의 2020(rcLst, 센치한 개발자]0
https://youtu.be/4rTs4i8e9u4
==============================================================================================================

- 90. Ditto 클립보드 매니저
https://comterman.tistory.com/1972
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
05:40 기상
06:00 조식
06:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
07:50 귀가
08:20 샤워 
09:00 어묵 무침(어묵 4kg) 무침: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림
09:40 종료
10:30 인터넷 서핑 ==>
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==>
18:00 석식
18:30 실내 도보 
19:40 종료  
19:45 청소(청소기, 밀대)
20:10 샤워(찬물: 체중: 65.7kg ==> BMI: 22.73[표준 체중])
21:30 인터넷 서핑 ==> 
22:00 종료  
22:50 취침
==============================================================================================================

- 윈도우 메모장에 쓰이는 일반 특수기호, 특수문자 모두 정리
https://itfix.tistory.com/925
1. 메모장을 열어서 키보드에 'ㅁ' 을 먼저 누른 후 한자 키를 눌러주세요. 
==============================================================================================================

- 윈도우 10에서 특수문자, 이모지 쓰는 방법 (단축키)
https://plugin-b.tistory.com/9
1. 윈도우 키 + 마침표(.) 키
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- 치료 치료[★]
18:00 퇴근(KB카드 청계 IT센터)
18:20 을지로입구역
18:50 신대방역
19:00 귀가
19:00 석식 
19:20 집출발(자전거) 
19:30 연세 미래 치과(신림역 1번 출구 포도몰 6층) 도착
19:50 진료: 왼쪽 아래턱 견치(33번) 신경 치료3[마취 안함]: 임시 보철 착용, 보철(지르코니) 본 뜨기(508,500원 결제)
20:40 종료
21:00 귀가 
22:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 서버 개발자 회식(18:20, 자담 치킨: 치킨, 노기수 과장, 백승현 과장, 더치 페이)
 
- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> (주)두베 이훈 이사(개발 PL) 철수(14시), 재활용 컵 8개로 모니터 받침대 만듬(9시, 사업장), 재활용 컵 커피잔으로 사용

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
   
- 국민은행 비밀번호 변경
1. http://www.kbstar.com, tamario/as**12**12
 1) 계좌번호: 640-21-0052-309(640210052309)
==============================================================================================================
   
- 국민카드 비밀번호 변경
1. https://card.kbcard.com, tamario/as**1212@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 착수 보고회(16시): 김현삼 전무 때문에 짜증나는 하루

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- 플러그인이란?
1. 정의: 웹 브라우저의 일부 기능들을 쉽게 설치하여 사용하게 할 수 있는 프로그램. "내가 필요한 프로그램을 제3자가 만든것으로 같다 
붙여 쓴다"  라고 생각하면 된다. 
 1) 브라우저에 의해 자동으로 인식되고, 그것의 기능은 현재 나타나고 있는 주 HTML 파일 내에 통합된다.
 
- 3rd party 써드파티(Third Party)란 ?
1. 정의: 프로그래밍에서의 서드파티란 프로그래밍을 도와주는 plug_in 이나 library 등을 만드는 회사를 말한다. 예로 프로그래밍 개발과 
개발자 사이에 플러그인,라이브러리,프레임워크를 서드파티로 볼 수 있다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 중식(11:40, 김현삼 전무가 쏨, 전골, 오징어 무침, KB카드 앱 개발 서버 파트[총 4명]) 

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- Ditto 클립보드 매니저 사용법
0. 디토, 보안 프로그램 해제, 복사 
1. 사용 방법
 1) Ctrl + ~ (Ditto 활성 단축키) 실행
 2) 엑셀을 열어서 원하는 문서 복사
 3) Ctrl + ~ (Ditto 활성 단축키) ==> 클립보드된 텍스트 확인
 4) 복사를 원하는 텍스트를 마우스롤 끌어서(마우스 더블 클릭도 가능) Notepad++에 붙여넣기
------------------------------------------------------------------------------------------------------------

- Ditto 클립보드 매니저 사용법
https://comterman.tistory.com/1972
 
- Ditto 사용법 꿀팁! 클립보드 제대로 활용하기!
https://youtu.be/DPi-szEdzKU

- Ditto 클립보드 매니저 다운로드
https://ditto-cp.sourceforge.io/
==============================================================================================================

- 끝까지 버티는 최강 멘탈을 만드는 4가지 방법[책갈피]
https://youtu.be/IlNNXa_3LG0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말[★] 
06:30 기상
06:50 조식
07:10 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림(관악교) => 봉림교 => 도림 도보교 => 집)
		==> 신림교 앞 무대 설치(도별빛내린천에서 축제)
08:35 귀가  
08:00 샤워  
08:35 집출발(자전거)
08:55 서울 가정의학과 의원 방문 ==> 혈당 측정: 99
09:00 진료 ==> 당뇨 상담(당뇨약, 미세 당백뇨약  1달치 처방[5,800원]): 다음주 금식하고 A1C 검사 예정
09:15 한독 프라자 약국 방문 ==> 조제(당뇨약, 미세 당백뇨약: 4주치[10,800원])) 구입 
09:3 귀가
10:30 인터넷 서핑
11:00 집출발(자전거) 
11:20 연세 미래 치과(신림역 1번 출구 포도몰 6층) 도착
11:20 진료: 왼쪽 아래턱 견치(33번)이 보철 착용, 한화손보 제출용 실비 보험 서류 발급(수수료: 1,000원 결제)
11:50 종료
12:05 귀가
12:07 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> Win7 USB 부팅 디스크 만들기
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림(관악교) => 봉림교 => 도림 도보교 => 집)
		==> 신림교 앞 무대 설치(도별빛내린천에서 축제)
19:50 귀가 
20:00 샤워
21:00 인터넷 서핑
23:00 취침
==============================================================================================================

- 윈도우7&윈도우10 USB 부팅 디스크 만들기 - Create Bootable USB Drive for Windows[뇽자 TV]
https://youtu.be/4L8Fdy9l_9Q

- 윈도우7 부팅 USB 만들기 윈도우7 usb 설치 window7 usb dvd download tool
https://webserver1.tistory.com/13
============================================================================================================== 
 
- 관악구 전 구민 긴급재난지원금 신청
https://relieffund.gwanak.go.kr/portal/emgcApplyForm.do
1. 지원금: 5만원
- 관악구 전 구민 긴급재난지원금 신청 결과
https://relieffund.gwanak.go.kr/portal/emgcSignResult.do
==============================================================================================================

1. 헌혈 예약
https://www.bloodinfo.net/blood_reserve.do
■ 일시 : 2022-07-17 17:00
■ 예약헌혈종류 : 전혈
■ 장소 : 헌혈의집 구로디지털단지역센터 

2. 전자문진 작성
https://www.bloodinfo.net/emi2/login.do
========================================================================================================== 

- 국민연금, 퇴직연금 그냥 '이렇게' 짜면 평생 '월 400' 이상 나옵니다. | 이영주 대표 풀버전
https://youtu.be/GcxHDNfPfug
========================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2022.07.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:15 기상
06:40 조식
07:10 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림(관악교) => 봉림교 => 도림 도보교 => 집)
		==> 신림교 앞 무대 설치(도별빛내린천에서 축제)
08:35 귀가 
09:00 샤워
09:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:00 순간 정전 발생
13:55 종료
14:00 PC 안 켜짐
14:10 갤럭시 탭으로 서핑
16:30 집출발(자전거)
16:45 헌혈의집 구로디지털 단지역센터 방문
  1. 사전 상담 및 검사
   1) 혈액 검사(헤모글로빈 정상). 콜레스테롤 수치: 212
   2) 혈압 측정: 138/ 80(정상)
  2. 헌혈 
   1) 종류: 전혈 320mL
  3. 헌혈 사은품
   1) 음료수(오렌지), 롯샌 파인애플(315g), 석수(500ml)
   2) 2022년 헌혈자 기념품: 세븐일레븐 또는 emart24 편의점 교환권(2장: 5천원) 총 만원
   ==> 헌혈의집 구로디지털 단지역센터 3번 연속 방문: 해피머니 문화 상품권(5천원) 받음
17:20 종료
17:40 귀가
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림(관악교) => 봉림교 => 도림 도보교 => 집)
		==> 신림교 앞 무대 설치(도별빛내린천에서 축제)
19:45 귀가 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 66.6kg ==> BMI: 22.73[표준 체중])
21:00 PC 켜짐
21:05 인터넷 서핑 ==> 
22:00 종료  
22:50 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.07.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- 다이소 고무장갑 이거 나만 몰랐나?? 대박추천!!![2022년 7월]
https://youtu.be/CniLC6ZgEWU
1. 투톤 컬러 고무장갑(천원, L 사이즈)
 
- 쓰기 편리한 아이디어 고무장갑 / 보관이 편해요 / 고무장갑이 잘 벗겨져요 /인생고무장갑 까지는 아니에요[생활의 꿀팁, 2021년]
https://youtu.be/npogNf9NZX4
1. 면코딩 고무장갑
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.07.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 관악구 전 구민 긴급재난지원금 입금 완료

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- 종이컵 홀더 분석
1.  종이컵 홀더(손잡이), 그래버(Grabber), 가격: 7,600원
http://m.enuri.com/short/70qIa
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- 오웰 투톤 고무 장갑 M 구입
1. 파란색, 천원, M 사이즈(다이소 신림점): 도보로 갔다 옴 ==> 면 코팅을 해서 습기가 덜차서 벗기가 쉬움(대만족)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 상환 만남(19시, 자담치킨[종각역: 치킨, 호프, 오뎅탕], 호수 -> 1차 내가 쏨, 2차 일본 선술집: 호수가 쏨)

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
- 암호화 및 공인인증 솔루션 iSIGN+ PKI | 펜타 시큐리티 시스템(penta security)
1. https://www.pentasecurity.co.kr/isign-pki/ 
 1) 안전하고 효율적인 인증 및 암호화 인프라 제공
==============================================================================================================

- 상환 만남(19시, 자담치킨[종각역])
0. 참석: 태만, 호수 -> 1차 내가 쏨, 2차 일본 선술집: 상환이가 쏨
1. 상환: 무자식이 쌍팔자(부럽다)
2. 호수: 아들 딸 과외비로 돈 많이 듬(100 만원): 외벌이라 힘들다고 함(그래도 부럽다)
 1) 내년에 나주 본사로 복귀
 2) 정년 퇴직 후 알바로 개발 배우고 싶다고 함(배부른 소리)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>

- 주말[★] 
07:00 기상
07:40 조식
08:00 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
09:45 귀가  
10:00 샤워  
10:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:10 샤워
14:20 인터넷 서핑 
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집): 비 옴(우산)
19:00 다이소 신림점 방문 ==>오웰 투톤 고무 장갑 M(4켤레, 4천원), EVA 메모리 폼 발 모양 깔창(260-275 mm, 3천원),
		, 메모리 폼 깔창(275 mm, 천원) 구입
19:30 집출발(자전거)
20:00 진흥마트 방문 ==> 동원-추억 부산사랑 어묵 1kg(5개[개당: 3,650원], 18,250원) 구입 
20:15 귀가
20:30 샤워
21:00 인터넷 서핑
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
05:40 기상
06:00 조식
06:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
07:50 귀가
08:20 샤워 
09:00 어묵 무침(어묵 5kg) 무침: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림
09:40 종료
10:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:10 샤워
14:20 인터넷 서핑 ==> 안드로이드 앱 만들(rcLst, 초보코딩) 시청
18:00 석식
18:20 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집): 비 옴(우산)
19:00 다이소 신림점 방문 ==> 인켈 컴퓨터 스피커 5W(USB 스피커, 5천원),  팬톤_마우스 패드(장패드, 5천원) 구입
19:40 종료  
20:40 청소(청소기, 밀대)
20:50 샤워(찬물: 체중: 65.7kg ==> BMI: 22.73[표준 체중])
21:30 인터넷 서핑 
22:00 종료  
22:30 취침
==============================================================================================================

- 61. 안드로이드 앱 만들기(rcLst, 초보코딩)
https://www.youtube.com/watch?v=ESBCIgXtVWw&list=PLZOm4uzWk9WMqUvfwbPxxG3nbM_dYCT0U
1. 자바, Kotlin
==============================================================================================================

- Do it! 안드로이드 앱 프로그래밍 [개정7판] part01 chapter01 01[Jaegon Jung]
https://youtu.be/SCXQqo0ApKU

- 안드로이드 스튜디오 강좌 1강 (Android Studio Tutorial For Beginners 2017 #01) [동빈나] 
https://youtu.be/oj6DI3PvAr0
 
- Kotlin - val, var의 차이점
https://velog.io/@jojo_devstory/Kotlin-val-var%EC%9D%98-%EC%B0%A8%EC%9D%B4%EC%A0%90
==============================================================================================================

- 설탕의 소리없는 공격. 우리는 왜 단맛에 중독되나 (KBS_557회_2015.10.14 방송) [KBS 생로병사의 비밀]
https://youtu.be/ecN8ujTQCwY
==============================================================================================================
 
- 다이소 5천원 초저렴 인켈 스피커 리뷰[헤이파파 HEYPAPA]
https://youtu.be/mkgQDPsQK0g
1. USB 스피커

- 패브릭 마우스 장 패드
https://shop.daiso.co.kr/mobile_new/product/product.do?prdMstCd=S0016902
1. 크기: 33 * 80cm

- 다이소 나만의 홈코노미 재택근무 환경 만들기[샵다이소]
https://youtu.be/zUapR24cpBk
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 서버 개발자 회식(18:30, 자담 치킨: 전집, 권승기 부장[1차 쏨], 칵테일 바[노 과장이 쏨]: 반란 모의
 
- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- SB C타입 이어폰 젠더 추천 음질비교 측정리뷰[아레지나 테크리뷰]
https://youtu.be/BmAsVSAodIQ

- 삼성전자 정품 C타입 이어폰 젠더, 가격: 15,290원
http://www.enuri.com/detail.jsp?modelno=82400080

- OMT C타입 이어폰 젠더 (OGD-CEP), 가격: 4,900원
http://www.enuri.com/detail.jsp?modelno=79733883
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

- 지역 아동 센터 서울시 지원단
http://sosc.or.kr/?kboard_id=4&mod=document&uid=238

- 청솔 지역 아동 센터
1. 서울 관악구 남부순환로161가길 71

- 은천 지역 아동 센터
1. 02-839-1405, 서울 관악구 관천로 119

- 조원지역아동센터
1. 02-838-9031, 서울 관악구 조원중앙로2길 71
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.07.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- KB카드 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.30(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:00 기상
04:40 조식
05:00 실내도보
05:50  샤워
06:08 집출발(인켈 컴퓨터 스피커, MLB 심플 캠핑 슬리퍼 LV(250m, 센들), 고무장갑(2켤레) 가지고 감)
06:20 남서울중 정류장 도착(5413번 탑승)
07:00 고속버스터미널 하차  
07:20 포항행 고속버스 승차(화장실에 휴지 버리기)
11:35 포항 고속버스 터미널 도착 ==> 포항 태풍 영향으로 구름끼고 바람 많이 붐(서울보다 덜 더움)
11:40 다이소 포항 해도점 방문
11:47 고속버스 터미널 정류장(209번 승차)
11:52 두호동 주민센터 정류장 하차
11:58 포항집 도착 ==> 수종
12:10 중식
12:30 실내 도보
14:00 종료
14:10 인터넷 서핑 ==> 델 노트북에 인켈 컴퓨터 스피커 부착(사운드 잘 나옴: 대만족): 윈도우 7 설치 안 함
		-->  TV 리모콘 찾음(다행)
16:00 집출발(수종) 
15:30 롯데 백화점 포항점 방문
16:00 9층 할인 매장 방문 ==> 수종이 아이더 고어스텍 운동화(139,000원) 쇼핑(살려고 약간 고민함)
16:30 7층 키즈 매장(아디다스 부스) 방문 ==>  아디다스 센들(30,000원) 아디다스 운동화(49,000원), 양말(2쪽: 25,000원)
	--> 총 129,000원 구입(엄마가 10만원 지원 해줌) 
17:20 귀가
17:30 나드리 김밥 두호점 방문 ==> 석식(치즈 돈가스(7,500원): 수종
17:50 귀가
17:51 도보(영일대 해수욕장): 여름 축제 많이 함(3군데)
19:30 귀가
19:40 인터넷 서핑 
20:50 샤워(수종)
22:30 취침(수종)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.07.31(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
07:10 기상
07:32 조식
08:00 도보(영일대 해수욕장)
09:25 귀가
09:40 샤워
08:30 인터넷 서핑
10:30 집출발(수종)
11:00 큰누나 미용실 도착
11:10 이발(나, 수종, 나) ==> 수종 지역 아동 센터 입소 문의(큰누나 부정적), 수종 엄마 아는 언니집에서 나와서 따로 산다고 전함)
11:50 미용실 출발(큰누나 차) 
12:10 귀가
12:22 중식 
12:50 실내 도보 
13:00 집출발(큰누나 차)
13:10 죽도시장(큰누가 태워 줌)
13:20 개풍 약국 방문 ==> 눈 따래끼 약 구입(파노신 정(정우신약): 3천원), 박틴(GC 녹십자), 4천원): 총 7천원)
13:24 도보(죽도시장 --> 영일만항 --> 영일대 해수욕장 --> 귀가)
14:10 귀가
14:30 염색
15:00 샤워
15:10 인터넷 서핑
17:30 석식 
18:25 집출발(수종): 백팩(여름 이불), 작은 캐리어 1개 
18:10 집출발(택시: 수종): 7,300원
18:30 포항역 도착
18:30 도보(수종)
19:00 종료
19:21 포항 출발(KTX 신천 252)
22:07 서울역 도착(10분 연착): 비 옴
22:150 서울역 (지하철)
22:40 대림역(8번 출구: 루옌 만남: 수종 맡김)
22:48 신대방역 하차
23:00 귀가
23:45 청소
24:30 샤워
24:10 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
