

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.01) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.01.01(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 설날

- 주말[★]
04:40 기상(영하 10도: 별로 안 추움)
05:15 조식
06:00 집출발
06:16 남서울중학교 정류장 도착 
06:16 5413번 버스 승차
06:52 고속버스터미널 하차
07:20 포항행 고속버스 승차(8번 좌석: 옆자리 빔[10/45])
11:17 포항 고속버스 터미널 도착
11:27 고속버스 터미널 정류장(209번 버스 승차)
11:37 두호동 주민센터 하차
11:42 포항집 도착(큰누나, 매형, 수종)
12:00 중식(떡국: 큰누나)
12:37 실내 도보(거실)
13:25 종료
13:30 집출발(큰누나 차, 매형, 수종)
14:10 포항 의료원(엄마 문병): 엄마 얼굴 못 보고 물건 만 전달하고 옴
14:20 종료
14:25 출발(큰누나 차)
14:55 구룡포 연오랑 세오녀 테마 공원
14:58 호미반도 해안 둘레길 도보
15:28 카페 니어바이 방문: 아메리카노 2잔, 자몽 메이드, 천혜향 쥬스: 내가 쏨
16:30 마산(학구미) 방파제 도착(회귀)
17:22 종료
17:23 출발(누나 차)
18:10 큰누나 미용실
18:15 이발(매형하고 같이 이발함)
18:42 종료
18:55 귀가
19:09 석식
19:30 실내 도보(거실)
19:50 염색(큰누나: 헤라(빨간색: 2시간 걸림))
22:00 샤워
22:20 종료
22:40 인터넷 서핑(유튜브로 글로벌 라이브 시청)
23:24 취침(수종): 체중 64.70kg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.02(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:33 기상
06:50 조식
07:20 실내 도보
08:50 종료 
09:20 인터넷 서핑
11:20 종료
12:00 중식
12:30 실내 도보(거실)
13:40 큰누나네 귀가
13:50 종료  
14:35 집출발(수종)
15:00 롯데백화점 포항점 방문
		 ==> 7층 네파 대리점: 수종 네파 운동화 밑창 수선 AS 맡김(01월 29일(토) 찾으로 갈 것)
15:30 아디다스 대리점 방문: 수종 아디다스 키즈 운동화(230cm) 구입(7만 9천원)
15:50 종료
15:55 황금 잉어 붕어빵 방문: 슈크림뻥(6개: 3천원), 붕어빵(4개 2천원),  땅콩빵(8개 2천원): 총 7천원 어치 예약(선결제)
16:10 다이소 포항 두호점 방문
16:30 리플러스 방문: 수종 마스크 7개 구입
16:55 황금 잉어 붕어빵 방문: 빵 수거
17:05 귀가
17:20 빵 시식(수종: 1개)
18:00 석식(내가 챙겨서 수종이랑 같이 먹음)
18:20 실내 도보(주식의 정석 28강 시청)
20:00 종료
20:10 인터넷 서핑
23:00 샤워(수종이만 샤워 시켜줌)
23:17 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.03(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 휴가[★]
06:10 기상
06:40 조식
07:00 실내 도보
08:40 종료
08:50 인터넷 서핑: 경매 동영상 시청
11:44 요리(계란말이(댤걀 6개): 처음 만듬)
12:04 중식
13:35 실내 도보(주식의 정석 32강 시청)
14:04 종료
14:10 인터넷 서핑: 경매 동영상(10강) 시청
17:00 반찬, 짐 정리(수종): 
17:40 요리(계란말이(댤걀 6개))
18:00 석식
18:25 집출발(수종): 가방 무게 23.3kg(엄청 무거움), 작은 캐리어 1개, 수종 햄스트 케이지 
18:30 집출발(택시: 수종): 7,700원
18:45 포항역 도착
19:00 포항 출발(KTX)
21:30 서울역 도착
21:38 서울역 
22:15 대림역(루옌 만남: 수종 맡김)
22:20 신대방역 하차
22:30 귀가
22:40 청소
24:30 취침
==============================================================================================================

- 요리[계란말이, 진미채]
- [Sub] 정말 쉬운 달걀말이! [백종원의 요리비책]
https://youtu.be/T7YJviWhquo

- 계란말이(달걀말이) 쉽게 만드는 꿀팁/기본 계란말이 만들기
https://youtu.be/OWIUE2szVsw

- 반찬 순위 넘버 원! 진미채 볶음을 딱딱하지 않고 부드럽게 만드는 법[쿡피아]
https://youtu.be/gaIlS0sLcbI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.04(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 휴가2[★]
05:00 기상
05:40 조식
06:00 실내 도보
07:40 종료
08:50 인터넷 서핑: 제주도 가족 여행 준비
12:00 중식
13:20 실내 도보(주식의 정석 33강 시청)
14:00 종료
14:10 인터넷 서핑: 제주도 가족 여행 준비  
18:00 석식
14:04 종료
14:10 인터넷 서핑
17:00 집출발
17:15 신대방역 
17:45 시청역 하차
17:55 흥국생명 광화문지사 도착: 배상범 만남
18:00 국민 호프(호프, 치킨: 배상범 만남): 내가 쏨
		==> 배상범이 흥국생명 SM 그만둔다고 통보: (주)와이즈인포텍 박원상 부사장과 장영수 상무 만남 --> 2~3개월 더 해보기로 했다고 함
		==> 배상범은 흥국생명 SM이 복잡하고 개발툴이 자바가 아니라 힘들다고 함(리포트 툴도 처음 사용 안 한다고 함): 배부른 소리로 들림
21:00 종료
21:15 삼성생명 본관에서 504번 버스 승차
22:10 시청역 하차
22:30 귀가
23:00 취침
==============================================================================================================
 
- 포항집 현대HCN 인터넷 미납 요금(3개월치) 납부
1. 3개월치 요금 미납(월 납입금: 16,000원) 요금 37,740원 대신 납부
==============================================================================================================

- 도시가스요금 12월 미납분 납부
1. (12월) 미납금액 : 88,350원 대신 납부 ==> 신한은행:5620-2286-362756
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.05(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 휴가3[★]
07:40 기상
08:40 조식
09:00 실내 도보
10:40 종료
10:50 인터넷 서핑
12:00 중식
13:20 실내 도보
14:00 종료
14:10 인터넷 서핑: 제주도 가족 여행 준비
14:00 집출발(자전거)
14:20 다이소 보라매점 방문 ==> 선반, TYPE C 고속 충전 케이블(샤오미 보조 밧데리용)(22cm): for mobile[선이 너무 짧음), 초코렛 등 23,000원 구입
14:20 진로 마트 방문 ==> 컵라면, 빵, 과자 등 15,500원 구입
17:20 귀가
18:00 석식
14:04 종료
14:10 인터넷 서핑: 제주도 가족 여행 준비 (1. 짐정리, 2. 가족관계증명서 출력)
22:23 귀가 
23:00 취침
==============================================================================================================
 
- 엑셀 IF 다중조건 공식
1. A 이면 결과1, B 이면 결과2, C이면 결과3, 나머지는 결과4를 출력! (→ IF함수 다중조건)
= IF(조건1, 결과1, IF(조건2, 결과2, IF(조건3, 결과3, 나머지 결과)))
■ 국적이 한국이면 한국어, 일본이면 일본어, 중국이면 중국어, 나머지 지역[★]은 영어를 출력
= IF(국적="한국","한국어", IF(국적="일본","일본어", IF(국적="중국","중국어","영어[★]")))

2. A와 B를 모두 만족할 때, 결과를 출력! (→ IF함수 AND조건)
3. A 또는 B 둘 중 하나라도 만족하면, 결과를 출력! (→ IF함수 OR조건)
https://www.oppadu.com/%EC%97%91%EC%85%80-if-%EB%8B%A4%EC%A4%91%EC%A1%B0%EA%B1%B4-%EA%B3%B5%EC%8B%9D/
==============================================================================================================

- 엑셀 VLOOKUP 함수, 정말 쉽게 알려드립니다! | 실무자를 위한 핵심 요약 | 기초입문 16강[오빠두 엑셀]
https://youtu.be/ywx14pb0s-E
==============================================================================================================

- VLOOKUP 함수! 이걸로 5분만에 간단정리! (살구TV- 피피티엑셀 -)
https://youtu.be/MlVyz4Q0UxM
1. VLOOKUP(Verticall Lookup)
 1) =VLOOKUP(찾을 값, 데이터 목록(절대 참조: F4 누름), 찾으려는 열, 일치 정확도)  ==> =VLOOKUP(C5, $F$3:$J$11, 4, 0)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.06(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 제주도 가족 여행 1일차[★]
04:30 기상
04:40 조식
05:10 집출발(자전거)
05:30 루옌집 도착(구로구 순영웰라이빌2차: 15분 소요
05:30 택시(루옌집: 루옌, 수종)
06:00 김포공항 도착([택시비: 14,900원]: 35분 소요)
06:05 셀프 체크인 키오스크: 탑승권 발권(3장)
06:10 바이오 인증: 등록(국내선, 5년 유효)
06:15 탑승 수속(수하물 없어서 처리 안함)  
06:17 탑승 검색대 ==> 바이오 인증 검색대(바이오 등록 고객 전용) 통과
06:20 보안 검색(보안 검색대)
06:25 종료
06:30 도보(김포공항 내)
07:10 탑승 시작(17번 게이트)
07:20 김포공항 출발 ==> [에어부산] 김포 -> 제주
08:30 제주공항 도착
09:10 땡큐제주렌트카 도착
09:15 차량 인수 ==> 네이버 지도 앱을 네비게이션으로 사용(만족 스러움, 차량용 충전기 없어서 불편함)
09:25 땡큐제주렌트카 출발: 오랜만에 운전해서 약간 당황함
10:10 아침 미소 목장(영업 안함)
10:45 스누피 가든(입장료(3명): 38,400원)
12:10 함덕해수욕장 도착
12:20 중식(돈까스 송쉡 | 돈까스, 콜라 | 41,000원 | 루옌, 수종, 나)
		==> 식당에서 핸드폰 충전, 샤오미 보조 밧데리 제대로 활용 못함(신뢰를 못 함, 연경선 짧음)
13:00 함덕해수욕장 도보(바람 많이 붐: 추움)
14:10 성산 일출봉(입장료(3명): 12,500원)
14:37 일출볼 정상
15:40 짱구네 유채꽃밭(입장료(3명, 현금): 3,000원)
15:00 서귀포시청 제2청사 도착
17:25 전기차 충전(25km 남음: 급속 충전 40분 걸림(5,000원: 60%충전(160km)) ==> 전기차 주유구 못 찾아서 렌터카 업체에 전화
		==> SMS3 아줌마가 도와줘서 겨우 충전구 찾아서 충전함(EV Infra 앱 설치)
18:15 종료
18:20 서귀포 JS호텔(밸류 호텔서귀포 JS) 도착 
18:35 GS25 방문(수종 도시락 구입(3,610원))
18:00 석식(컵라면, 빵, 편의점 도시락(수종))
18:30 도보(제주 월드컵 경기장 내 이마트 서귀포점 방문)
20:00 종료
22:17 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.07(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 제주도 가족 여행 2일차(서귀포) [★]
05:00 기상
06:00 조식(컵라면, 빵)
06:30 도보(서귀포시청 제2청사 후문)
08:00 종료
08:09 GS25 방문(수종 도시락, 루옌 김밥 구입(6,560원))
08:30 조식(수종, 루옌)
09:00 샤워
09:30 호텔 나옴
09:55 호텔 출발(호텔에서 출차 25분 걸림)
10:30 승마 체험장 도착(신풍 목장승마 체험장[제주 서귀포시 성산읍 일주동로 5417])
19:50 승마 체험(3명: 6만원(계좌 송금))
12:03 귤 체험장(휴애리) (입장료: 51,000원): 흑돼지 먹이 주기, 귤 따기, 동백꽃 축제
13:55 중식(흑돼지 패밀리 | 흑돼지 세트 B, 공기밥 | 61,000원 | 루옌, 수종, 나)
		 ==> 식당에서 핸드폰 충전, 샤오미 보조 밧데리 제대로 활용 못함(신뢰를 못 함, 연경선 짧음)
14:45 윈드 1947 카트: 실속형(수종 & 엄마(2인승: 40,000원)
15:30 서바이벌 체험, 스나이퍼 사격(수종 & 아빠: 15,000원)
16:43 천지연 폭포(입장료(3명): 5,000원)
17:20 서귀포 JS호텔 도착(내일 새벽 전기차 충전: 주차 문제로 약간 늦음)
17:44 숙소 도착
18:15 석식(컵라면, GS25 편의점 도시락(수종), 고기 국수(루옌): 7,600원)
18:45 도보(서귀포시청 제2청사 후문)
20:15 종료
20:40 샤워
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.08(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>

- 제주도 가족 여행 3일차(서부) [★]
05:10 기상
05:40 조식
06:13 도보(서귀포 JS호텔 인도)
07:00 종료
07:15 호텔 직원에게 출차 요청
07:30 서귀포시청 제2청사 도착
07:32 전기차 충전(72km 남음: 급속 충전 40분 걸림(7,000원: 95% 충전(216km)): 차 문 잠그고 옴
08:33 조식(수종, 루옌: 편의점 삼각 김밥 3개: 3,320원)
09:00 호텔 출발(체크 아웃)
10:05 액티브 파크 제주 ==> 클립 앤 클라임(25,000원: 수종)
11:00 클라임 교육 및 실행(수종 힘들어 함: 겨우 하나 정상 등반 성공) 
12:15 중식(어음 밥집 | 한식 부페 | 19,000원 | 루옌, 수종, 나): 맛도 좋고 가격이 싼편이라 마음에 듬
		 ==> 식당에서 핸드폰 충전, 샤오미 보조 밧데리 제대로 활용 못함(신뢰를 못 함, 연경선 짧음)
12:45 아르떼 뮤지엄 제주(3명: 44,000원)
13:50 도두봉 도착(산책: 작은 봉우리(약간 실망)): 루옌 피곤해서 차에서 누움
14:15 종료
14:20 휴식(차 안)
15:35 출발
15:45 땡큐제주렌트카 도착 ==> 반납(전기차 충전량(60%[139km] 남음: 무료로 처리해줌)
		==> 핸드폰 충전기(다이소 핸드폰 고속 충전기(EMAC: C타입 케이블 포함), 검정색) 분실
		==> 차량용 충전기(다이소에서 5천원 구입 가능) 반드시 가져올 것
		==> 제주도 회전 교차로 너무 많음(교차로 진입시 과속 방지턱이 설치되어 있어서 속도 줄어야 함), 도로 대부분 80km 제한
			, 어린이 보호 구역(30km 제한), 노인 보호 구역(50km  제한) 너무 많음
16:22 제주공항 도착(발권: 셀프 체크인)
16:50 석식(1950 에어 차이나(제주공항 4층) | 짜장면2, 짬짜면 | 19,000원 | 루옌, 수종, 나)
17:10 제주공항 도보(가방 무게: 6.7kg)
18:45 종료
20:04 탑승 검색대 ==> 바이오 인증 검색대(바이오 등록 고객 전용) 통과
20:05 보안 검색(보안 검색대)
20:07 종료
21:05 제주공항 출발 ==> [진에어] 제주 -> 김포
22:20 김포공항 도착
22:40 지하철(김포공항역 → 신대방역)
23:22 루옌 숙소에서 출발(자전거)
23:47 귀가
24:30 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2022.01.09(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
07:08 기상
07:40 조식
08:10 실내 도보
09:40 종료
09:50 인터넷 서핑: 제주도 가족 여행 결산(1. 사진 정리, 2. 가계부 정리)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
16.00 보일러 돌림(외출로 설정: 도시가스 사용)
16:05 집출발(자전거)
16:10 다이소 신림3호점 방문 ==> 지퍼백 일회용치실 55P(휴대용 케이스 포함, 천원), 데이터 케이블 TYPE C(100cm): for mobile(3천원, 만족)
		, 디즈니_장목수면양말(친구들: 2천원), 수축 전선 피복12pcs구입(천원) 구입
17:30 귀가 
18:00 석식
18:20 실내 도보 
20:00 종료  
20:50 청소(청소기, 밀대)
21:30 인터넷 서핑: 제주도 가족 여행 결산(1. 사진 정리, 2. 가계부 정리)
23:30 취침
==============================================================================================================

- 01. 제주도 가족 여행 결산(22.01.06) ■■
이용일	이용가맹점	이용금액	비고
2021년 10월 23일	마이 리얼 트립(My Real Trip) 앱	117,100	김포 --> 제주 항공권 예매(에어부산, 2022-01-06 07:20): 가족 여행(3명)
2021년 10월 23일	마이 리얼 트립(My Real Trip) 앱	112,500	제주 --> 김포 항공권 예매(진에어, 2022-01-08 21:05): 가족 여행(3명)
2021년 10월 23일	마이 리얼 트립(My Real Trip) 앱	141,360	서귀포 JS 호텔디럭스 트윈(측면 오션뷰) 객실 only ✕ 1, 2박{1월 6일(목) ~ 8일(토)]
2021년 10월 23일	마이 리얼 트립(My Real Trip) 앱	231,600	아이오닉(충전비 별도 발생), 땡큐제주렌트카, 1월 6일(목) 10시 ~ 8일(토) 10시
2022년 01월 06일	한국정보통신 - (주)인터파크홀딩스	38,400	스누피 가든(입장료(3명): 38,400원)
2022년 01월 06일	(주) 스마트로 - 제주에너지공사	5,000	전기차 충전(25km 남음: 급속 충전 40분 걸림(5,000원: 60%충전(160km))
2022년 01월 06일	GS25서귀신시가지점	3,610	3. 석식(GS25: 수종 도시락 구입(3,610원))
2022년 01월 06일	돈까스송쉡	41,000	중식(돈까스 송쉡 | 돈까스, 콜라 |  41,000원 | 루옌, 수종, 나)
2022년 01월 06일	제주특별자치도청/세외수입	12,500	성산 일출봉(입장료(3명): 12,500원)
2022년 01월 06일	택시-서울 34 아 5812	14,900	택시(루옌집 ==> 김포공항[14,900원], 루옌, 수종)
2022년 01월 07일	GS25서귀신시가지점	7,600	3. 석식(GS25: 수종 도시락, 루옌 고기 국수 구입(7,600원))
2022년 01월 07일	GS25서귀신시가지점	6,560	1. 조식(GS25: 수종 도시락, 루옌 김밥 구입(6,560원))
2022년 01월 07일	농업회사법인고도농원	40,000	윈드 1947 카트 ==> 실속형(2인승: 4만원(수종 & 엄마)
2022년 01월 07일	흑돼지패밀리	61,000	2. 중식(흑돼지 패밀리 | 흑돼지 세트 B, 공기밥 | 61,000원 | 루옌, 수종, 나)
2022년 01월 07일	농업회사법인휴애리주식회사	51,000	귤 체험장(휴애리) (입장료: 51,000원)
2022년 01월 07일	제주특별자치도청/세외수입	5,000	천지연 폭포(입장료(3명): 5,000원)
2022년 01월 07일	에스케이엘이씨	15,000	서바이벌 체험, 스나이퍼 사격(수종 & 아빠: 15,000원)
2022년 01월 08일	(주) 스마트로 - 제주에너지공사	7,000	전기차 충전(72km 남음: 급속 충전 40분 걸림(7,000원: 95% 충전(216km))
2022년 01월 08일	1950에어차이나제주공항점	25,000	3. 석식(1950 에어 차이나(제주공항 4층) | 짜장면2, 짬짜면 | 19,000원 | 루옌, 수종, 나)
2022년 01월 08일	액티브파크	25,000	액티브 파크 제주 ==> 클립 앤 클라임(25,000원: 수종)
2022년 01월 08일	디스트릭트홀딩스	44,000	아르떼 뮤지엄 제주(3명: 44,000원)
2022년 01월 08일	어음밥집	19,000	중식(어음 밥집 | 한국 부페 | 19,000원 | 루옌, 수종, 나)
-	총 합계 65 건	1,024,130원
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 

- 00. 삼프로TV[M]
https://www.youtube.com/c/삼프로tv

- 00-1. 오건영 부부장의 2022년 부의 시나리오[이번 휴일도 삼프로TV와 함께]
https://www.youtube.com/watch?v=xHPJ0P6jeTU&list=PLQvqXcm97CTArUbsSd_uUhtkLdpKOZsvx
==============================================================================================================

- 통화 수신, 발신 후 알림창 안나오게 하는 방법! 후후 설정 바꿔봐요
https://seolkim4.tistory.com/183
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.10(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> DB손보 TM 모바일 전자 청약 시스템 Prj 투입, LG U+ 12월 급여 나옴, 배상범 과장 흥국생명 철수(18시)

- DB손보 Prj[★] 
1. 장소: DB금융센터 18층
2. 연락: 정태웅 이사(010-2209-1870, 개발 PL)
3. 계약에 필요한 서류 제출
 1) 주민등록 등본 1부 
 2) 급여통장 사본 1부
--------------------------------------------------------------------------------------------------------------------- 

- 프로젝트 정보
1. 고객: DB손해보험
2. 플젝: TM 모바일 전자 청약 시스템 I/F 개발
3. 기간: 22.01~22.04(4개월)
4. 사업장: 서울테헤란로 432 DB금융센터 18층
5. DB 손보 사번: 82200037, 10사*!(대)
6. 클라우드 접속
 1) 로컬 PC: eclipse 설치 및 개발
 2) 업무 가상 PC: 산출물 작성, 메신저 설치
7. 실시간 미러링 기술
==============================================================================================================

- DB손보 Prj 전체 회의(10시, 회의실)
1. 고경진((주)유니닥스 ==> http://www.unidocs.co.kr) PM 회의 주제: 팀원 소개
==============================================================================================================
 
- DB손보 Prj 설명(10:35, 회의실)
1. 정태웅 이사(아데나소프트(주)) ==> http://athenasoft.co.kr): 전체 설계 산출물 설명
==============================================================================================================
  
- DB손보 Prj 소스 설명(15:30)
1. 이중재 차장[장기 담당, 의정부]: eclipse 소스 전달 해줌 ==> 내 PC에 셋팅
 1) AS-IS: TM 통합 Sever <==> 기간계(장기, 자동차}
 2) TO-BE: 미러링 <==> 연계 Sever[실제 개발 지점] <==> ESB <==> 기간계(장기, 자동차)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.11(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 엄마 퇴원(10시, 포항 의료원)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- Spring MVC (스프링 웹 MVC) 강의방향 안내[뉴렉처]
https://www.youtube.com/watch?v=JM1PX5xFw-g&list=PLq8wAnVUcTFWhDFFmpJ5fUeoJI53Z83g6
==============================================================================================================

- Spring1[Programming School]
https://www.youtube.com/channel/UCqRTjWqD-ZWHj0ZoPSKVWBw/search?query=Spring
- [Spring] 컨트롤러와 뷰의 연결방법 1[
https://youtu.be/_mQpTJZlf8w
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.12(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 11:30 ==> 협의 이혼 의사 확인 기일(13:40, 서울남부지방법원)

- DB손보 Prj[★] 
- DB손보 소스 분석
==============================================================================================================
 
- 반차[★] 
11:30 퇴근(반차) 
11:48 중식(편의점 김밥: GS25 대치명문점(
12:00 선릉역 --> 목동역(7번 출구)
13:00 서울남부지방법원 2층 도착
13:35 2층 204호 법정에서 대기(대기가 엄청 많음): 루옌 만남
14:20 협의 이혼 완료(재판장에 결정): 협의이혼의사 확인서 발급 받음
14:49 양천구청 도착 ==> 이혼 신청서 작성, 협의이혼의사 확인서 제출 --> 1주일 후 가족관계증명서에 이혼으로 기록됨
15:03 종료
15:20 양천구청 정류장 ==> 5630번 버스 승차
15:40 가산 파출소 정류장 하차
15:30 현미밥 구입 구입: 세븐 일레븐 관악 평화점: 모바일 상품권[만원, 헌혈): 오뚜기) 발아 현미밥 210g(2천 5백): 6개; 14,400원(기획: 증정: 3개): 총 9개
15:40 귀가
18:00 석식
18:20 실내 도보 
20:00 종료
21:30 인터넷 서핑
23:30 취침
==============================================================================================================
 
- DB손보 Prj 설명(10:49, 회의실)
1. 정태웅 이사: 상세 설명(개발 문서 설명): 하동호 차장에게 자동차 개발한 것 인수인계 받아라고 함
==============================================================================================================

- Spring MVC의 동작 구조
https://junu0516.tistory.com/92

- 1강 Spring MVC 5 - Spring MVC 소개[소프트캠퍼스]
https://www.youtube.com/watch?v=ohoibMjtfm8&list=PLSBIrFmNg2JYzeFJQ9WhEHCOZy2KT4HGb
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.13(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석
==============================================================================================================
 
 - 09 IF함수, 다중 IF함수 이해하기
https://youtu.be/UMeKPb2sEJw
1. =IF(조건1, 참1, IF(조건2, 참2, IF(조건3, 참3, 거짓값)))
 
- 엑셀 IF 함수 5강] 다중 IF 사용법 - 여러 개의 조건에 대한 참과 거짓 결과 구하기(자막)
https://youtu.be/xt4hCSlSjwc

- IF함수 중첩사용? 조건이 다중일 경우 IF함수대신 이것 사용해라! [공대녀의 엑셀 천재]
https://youtu.be/lBwPWE2gAH0
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.14(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

- 엑셀 IF 함수 4강] IF 함수에 AND 함수 중첩하기 - 두 조건에 일치하는 참과 거짓의 결과 구하기(자막) [짤막한 강좌]
https://youtu.be/7p5nNHBtRaM
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.15(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보
08:40 종료
08:50 집출발(자전거) 
09:05 연세의원(서울 관악구 신원로 23, 신원시장 내) 방문
09:15 당뇨 상담 ==> 당화혈색소 검사, 피 검사(39,200원): 혈당치: 135, 혈압: 150(혈압 높다고 함)
		--> 당화혈색소 결과: 6.1%
09:30 코로나 예방 접종 3차 완료
09:50 바벨 빌라 분양 방문 ==> 부동산(010-8211-92623): 19평(2층, 남향): 매매가: 4억 9천
10:20 귀가
11:10 인터넷 서핑 ==> 01. 엑셀 IF함수 다중조건 공부(77. 혈당관리 수첩_2021.01_Test.xlsx)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 서핑 ==> 01. 엑셀 IF함수 다중조건 공부(77. 혈당관리 수첩_2021.01_Test.xlsx) 
18:00 석식
18:20 실내 도보 ==> 주식의 정석 85강 종료(8번 시청 완료)
20:00 종료   
21:30 인터넷 서핑 ==> 01. 엑셀 IF함수 다중조건 공부(77. 혈당관리 수첩_2021.01_Test.xlsx)
23:30 취침
==============================================================================================================

- [엑셀 IF 함수 4강] IF 함수에 AND 함수 중첩하기 - 두 조건에 일치하는 참과 거짓의 결과 구하기(자막) [짤막한 강좌]
https://youtu.be/7p5nNHBtRaM

- 셀 21강] IF함수에 AND, OR함수 중첩하기  
https://hantip.net/23
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.16(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
07:00 기상
07:40 조식
08:10 실내 도보 ==> 주식의 정석 1강 시청
09:40 종료
09:50 인터넷 서핑 ==> 01. 엑셀 IF함수 다중조건 공부(77. 혈당관리 수첩_2021.01_Test.xlsx)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 01. 엑셀 IF함수 다중조건 공부(77. 혈당관리 수첩_2021.01_Test.xlsx) 
18:00 석식
18:20 실내 도보 
20:00 종료  
20:30 청소(청소기, 밀대)
20:50 샤워
21:45 인터넷 서핑
23:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.17(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================
 
- 터미널 로그 보기(유닉스, tail -f)
[i3shop@newint i3shop logs]$ tail -f Default_Server_stdout.log		  -- 실시간 로그 보기
1. tail 명령어: 파일 내용을 아래에서 부터 기본 10라인 출력
============================================================================================================== 

- 진양화학 장판(장판닷컴) 구입 @@@
https://smartstore.naver.com/mat001/notice/detail?id=2002394281
1. 장판선택: 고급형 모노륨장판 - MG70331/97개 (+126,100원) , 총 가격: 175,916원 ■■ 
https://smartstore.naver.com/mat001/notice/detail?id=2002394281 
2. 추가상품 : 장판용본드/2개(+6,000원)
==============================================================================================================

- 만능 풀바른벽지 셀프도배 친환경 합지 단색 도배지(월풀) 구입 @@@
https://smartstore.naver.com/wallplan/products/344644255?
1. 제품번호: 만능풀바른벽지 실크 J9423-3 큐브 그레이, 벽높이선택 : 220cm (+2,000원)  15장, 가격: 128,400원 ■
https://www.wallplan.co.kr/goods/goods_view.php?goodsNo=1000011450
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.18(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

- 인증서 파헤치기 2탄! 네이버 인증서 발급방법, 장단점 정리! [정보다이쏘]
https://youtu.be/RSk8-Xdvl3A 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.01.19(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> LG에너지솔루션 공모주 청약(07시, 버스 안: KB증권 계좌 개설), 전승진 부장 투입(09시)

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================
 
- LG에너지솔루션 공모주 일정
http://ssunpick.com/9024
==============================================================================================================

- 당뇨약없이 당뇨치료 및 당뇨 예방하는 방법 3가지! '당뇨유튜브채널 [이혜민 한의사의 당뇨스쿨]'
https://youtu.be/8pL_WGNDkOg
==============================================================================================================

- 스마트폰에서 네이버 페이 계좌를 개설하고..[IB 96]
https://youtu.be/OjmEAfPMsP4
==============================================================================================================

-  KB증권 계좌 개설
1. 종합위틱: 556-857-234 01: 계좌비밀번호: 03**
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.20(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 네이버 페이 앱 설치, 연말정산 처리

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

- 스마트폰 에서 네이버 페이 계좌를 개설....[IB 96]
https://youtu.be/OjmEAfPMsP4
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.21(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================
 
- "LG에너지솔루션 다음엔 이 종목입니다" 현대엔지니어링, 청약하면 얼마나 벌까? | 예상 균등배정수량, 예상 수익금 공개
https://youtu.be/gMl91ZXUpBw
==============================================================================================================

- 01. 테스나라(종합 소득세 신고: 양성희 세무사)
www.taxnara.co.kr
==============================================================================================================

- 신원시장, 신림역, 신대방역 맛집투어 10곳, 관악구 맛집 부수기[하이갱스]
https://youtu.be/1f0L1i5Oe4Y

- 신림동 고시촌, 대학동 맛집투어 BEST 10곳
https://youtu.be/HMib5Lj2z7E
==============================================================================================================

- 갤럭시S 시리즈 액정 크기 비교
https://youtu.be/WoKvAla-hZo

- 갤럭시 노트 시리즈 스펙 비교
https://shimchan2.tistory.com/85
1. 갤럭시 노트 S9: 6.4인치■, 갤럭시 노트 S10: 6.3인치, 갤럭시 노트 S10+: 6.8인치■, 갤럭시 노트 S20 5G: 6.7인치, 갤럭시 노트 S20 울크라 5G: 6.9인치
 1) 갤럭시 노트 S10 이상부터 이이폰 꽃이 없음

- 갤럭시 노트10+ vs 노트20 vs 노트20울트라! 뭘 사야할지 정해드림!
https://youtu.be/RjRhHmN2ec8
==============================================================================================================

- 아직도 갤럭시탭 필기 앱, 삼성노트(추천) | 플렉슬(유료) | 노트쉘프(6천 6백원) | Xodo(추천2)
https://youtu.be/pXhPWjXhtks

- 미친 필기앱의 등장! 안드로이드의 희망? Noteshelf 상세분석[테크몽]
https://youtu.be/OKOLmRPJrk8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.22(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
07:00 기상
07:40 조식
08:10 실내 도보
08:40 종료
09:10 집출발(자전거) 
09:20 연세의원(서울 관악구 신원로 23) 방문
09:25 건강검진 결과 상담(4,700원) ==> 대체로 정상(간 수치가 당뇨 환자라면 약간 낮게 유지 해야 한다고 함): 비타민D 부족(25.91ng/ml, 햇볕 쪼일 것) 
		==> 10 ~ 12ng/ml: 비타민D 절대적 결핍(12 ~ 20ng/ml 이면 정상이라고 함) ■, 당화혈색소 결과: 6.1%
10:00 다이소 신림3호점 방문 ==> 크레신 이어폰 107 화이트(100원 포인트, 4천 9백원: 다이소 이어폰), 컬러풀 손톱깎이(대 )(천원)
		, 휴대용 칫솔세트(치실 1개 + 스틱 치실 6개 포함: 천원) 구입[네이버 페이로 오프라인 상점 처음 결제)
10:30 귀가
11:10 인터넷 서핑 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 서핑
18:00 석식
18:20 실내 도보
20:00 종료   
21:30 인터넷 서핑
23:30 취침
==============================================================================================================

- [명승권의 의학수다 시즌2] #2 ‘비타민 D 검사와 처방, 하지 마세요!’ (국립암센터 명승권 박사]
https://youtu.be/od_CKsLCfFE

- 한국인 결핍 영양소 1위]비타민D 부족하면 면역력 저하? 비타민D 제대로 보충하려면 정제, 액상, 파우더 뭐가 좋을까
https://youtu.be/eaR9Al1598k

- 비타민D 섭취 시 주의할 점 5가지(서울백병원 박현아 교수)
https://youtu.be/HaL4uPGOcOM
1. 비타민D 부족(25.91g/ml, 햇볕 쪼일 것) 
 1) 10 ~ 12ng/ml: 절대적 결핍 ==> 최소: 20 ~ 60ng/ml(12 ~ 20ng/ml 이면 정상이라고 함) ■
==============================================================================================================

- [셀트리온] 분식회계 최종결론, 대박호재, 3년만의 결실, 렉키로나, 유럽수주1조, 셀트리온헬스케어, 자사주매입,
https://youtu.be/RfgvnInKBDU

- [셀트리온 주가전망] 분식회계 3월 끝! 3사합병 이후 50만원! #셀트리온헬스케어 #셀트리온제약(5월 합병 예상)
https://youtu.be/SFy6YPKVtzg
-----------------------------------------------------------------------------------------------------------------------------------------

- 공모주 단기 매매법_오현진의 주식의 정석 41강_대가들의 투자비법 (20210302)
https://youtu.be/gF43IEmrAVg
==============================================================================================================

- 스쿼트 잘못된 방식을 제대로 알려주고 이해하고 쉽게 하는 스쿼트 자세 교정 방법 알려드립니다
https://youtu.be/fy9URmTqNio
==============================================================================================================
 
- [ENG] 믹스커피 먹어야 하는 이유! 진작 먹을걸
https://youtu.be/wLqDnp9Q1ms
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.23(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
07:00 기상
07:40 조식
08:10 실내 도보 
09:40 종료
09:50 인터넷 서핑 
12:00 중식
12:30 실내 도보 ==> 스쿼트 앱으로 스쿼트 다시 시작
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 실내 도보 
20:00 종료  
20:30 청소(청소기, 밀대)
20:50 샤워(체중: 65.2kg ==> BMI: 22.56[표준 체중])
21:10 인터넷 서핑
22:30 취침
==============================================================================================================
   
- 웅크리고 앉기 - Squats Workout[스쿼트 앱]
https://play.google.com/store/apps/details?id=com.northpark.squats&hl=ko&gl=US
==============================================================================================================
   
- LG에너지솔루션 공모주 청약 전략
1. 공모가: 300,000원, 상장 시초가: 600,000원, 목표가: 780,000원, 손절가(매도가): 320,000원
 1) 5분봉 저가 이탈 또는 5분분상 음봉 2개 발생시 매도
 2) 시초가 대비 주가가 높게 마무리될 경우 다음날까지 홀딩
 
- 공모주 단기 매매법_오현진의 주식의 정석 41강_대가들의 투자비법 (20210302)
https://youtu.be/gF43IEmrAVg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.24(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

- PC 비밀번호 변경
1. administrator / [qwqw1212!] --> asas1212!  
2. DB 손보 사번: 82200037, 10사*!(대문) --> asas1212!
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.25(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 주방, 작은방 콘센트 전기 누전 발생(19시, 퇴근 후: 반장이 와서 확인해 줌): 냉장고, PC 안 됨

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

- (주)아데나소프트 장태웅 이사(실제 대표이사}이 설 선물 택배로 보내줌
https://www.lotteon.com/m/product/LM8801047872931?sitmNo=LM8801047872931_001&mall_no=4&dp_infw_cd=SCH%EB%A6%AC%EC%B1%94
1. 동원 튜나리챔 102호, 가격: 44,940원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.26(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 15:00 ==> 

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

 - 전기 누수 처리(16시, 집)
1. 24시전기고장수리전기누전수리전기증설(070-8173-3069)로 전화해서 16시에 출장 요청
2. 15시 퇴근
3. 16시 귀가
4. 17시 업자들 도착 ==> 조성만(010-8768-3805) 사장이 전기 누전이라며 27만원 요청(22만원에 합의[분전반 2번째 누전 차단기 내려감)
5. 분전반에서 주방까지 연결선(빨, 희, 녹) 교체
6. 주방 냉장고에서 작은방까지 연결선(빨, 희, 녹) 교체
7. 작은방 콘센트1에서 책상옆 콘센까지 연결선(빨, 희, 녹) 교체
8. 화장실 콘센트 교체
==> 가장 큰 원인은 주방에서 사용하든 멀티탭에 물이 들어가 누전이 된 것으로 추정됨(다이소 멀티탭 덮게 구입할 것)
==> 냉장고, PC 사용 가능
9. 전기 누전 공사에 따른 부품비, 수리비 총 22만원 송금해 줌(17시 40분 작업 완료)

- 14. 가정전기, 누전점검 어떻게 하는가?
https://m.blog.naver.com/jjbs1228/150137234674
==============================================================================================================

- MY LG ID 서비스 가입
1. https://www.mylgid.com ==> tamario@naver.com / 202*오*h
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.27(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 네이버 페이 앱 설치, 연말정산 처리

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.01.28(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★] 
- DB손보 소스 분석 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.29(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★]
04:52 기상
05:15 조식
06:00 집출발(수종)
06:11 남서울중학교 정류장 도착 
06:17 643번 버스 승차
06:50 고속버스터미널 하차
07:00 조식(참치 삼각김밥(천원), 이마트24 서울고속터미널2호점 편의점): 수종
07:20 포항행 고속버스 승차(27, 28번 좌석)
11:20 포항 고속버스 터미널 도착
11:30 고속버스 터미널 정류장(209번 버스 승차)
11:45 두호동 주민센터 하차
11:52 포항집 도착 
12:00 중식
12:37 연세 신치과(수종) 방문 ==> 수종 이빨 불소 도포 처리(3개월 후에  다시오라고 함, 48,800원)
13:45 종료
14:00 집출발
14:20 네파 키즈(롯데백화점 포항점): 수종 운동화 A/S 수거
14:35 펫마트 포항2호점 방문 ==> 햄스터 사료 구입
16:00 귀가 
17:30 석식
18:00 집출발(수종)
18:30 큰누나 미용실 방문
18:40 이발(수종, 나)
19:40 종료
19:41 나드리 가게(수퍼, 대동 우방) ==> 강정(한 봉지, 오꼬시) 
19:45 출발(큰누나 차)
19:50 탑마트 방문 ==> 큰누나가 12만원 어치 구입
19:55 귤(한 박스)
20:10 귀가
20:20 TV 시청
23:24 취침(수종)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.30(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 설날 연휴

- 설날 연휴[★]

07:48 기상
08:05 조식(수종이와 같이 식사)
08:30 실내 도보
10:00 종료 
11:07 집출발
11:18 다이소 포항 두호점 방문 ==> 인켈 알루미늄 C타입 이어폰 IK-TS-01(5천원), 네트망(3326 cm) (천원), 심플 흡착 휴지 걸이(천원)
		, 펄컬러 스텐레스 양식기 디저트 스푼(2개) (2천원), 배수관 클리어(천원) 구입
11:50 귀가
12:40 중식 
12:50 실내 도보
14:20 종료
15:00 리플러스: 주방 롤걸이 구입 시도(없음)
15:20 다이소 포항두호점 방문 ==> 심플 흡착 휴지 걸이(2개, 2천원)
15:30 귀가
15:40 집출발(큰누나 차, 수종)
16:00 죽도 시장 주차장
16:10 포항 큰길 약국: 엄마 감기약, 언친약, 연고(3만원)
16:20 울릉 상회: 오징어 진미채(3만원)
16:25 미역 줄기(만원)
17:00 귀가
17:20 주방 롤 걸이 설치(주방)
18:11 석식
18:20 실내 도보
19:20 종료
19:20 큰누나 귀가
22:00 취침
=================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.01.31(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
07:00 기상
07:30 조식
08:00 거실 도배 시작(수종이가 도와줌) ==> 벽지 11장 바르기
		==> 거실 인터폰(코콤 인터폰[DP-202H) 전선 다시 연결하니 안됨
11:50 종료
12:08 중식
12:30 낮잠(피곤)
14:00 기상
14:10 거실 장판 시공 ==> 1번째: 430 cm, 2번째: 340cm, 번째: 남은 장판 절반로 잘라서 시공
17:10 주방 장판 2장 이음매 절단(Edge Cutting): 자 대고 칼로 장판을 잘라도 삐뚤하게 잘림(초보자의 한계)
18:25 장판 시공 종료
18:34 석식 
19:00 장판 정비
23:00 종료
23:05 샤워(매우 피곤함): 수종
23:40 취침(수종)
================================================================================================================ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
