

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.06) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.06.01(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  2022 지방선거(임시 공휴일)

- 주말2[★] 
05:00 기상
05:40 조식
06:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
07:20 귀가
09:30 집출발(자전거) => 조원로 => 구로 전화국 => 구로 전화국 교차로 => 남부 순환로 => 구디지털단지 오거리 => 가산 로데오 오거리
09:45 로또 5장 구입(디지털단지 오거리 근처 매장)
09:57 마리오아울렛 1관 도착(영업 시작: 10:30)
10:10 한섬 팩토리 아울렛 도착(영업 시작: 10:30)
10:20 롯데 팩토리 아울렛 도착(영업 시작: 10:30) ==> 2F 아웃도어ㅣ스포츠ㅣ남성패션 도착
10:40 블랙야크 매장에서 패딩(이월 상품) 구입(모자 달린 거, 하나 남은 거 운이 좋게 골라서 구입함)
11:00 종료
11:20 귀가
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
15:00 낮잠
16:50 기상
17:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집) 
19:45 귀가 
21:20 샤워(체중: 67.2kg ==> BMI: 22.60[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================

- 블랙야크 B제로 스팟 후디 다운자켓(겨울 패딩, 잠바) 구입
1. 롯데 팩토리 아울렛 가산점에서 107,100원에 구입
https://www.lotteshopping.com/branchShopGuide/floorGuideSub?cstr=0356
 1) 정가: 299,000원 ==> 할인가: 109,000원 ==> 할인가(회원 가입 후): 107,100원
-----------------------------------------------------------------------------------------------------------------------------

- [블랙야크] 남성 무봉제 후드 탈부착 구스 패딩 B제로 스팟 후디 다운 자켓#1 1BYPAW1002, 사이즈: 100, 검정색, 가격: 119,000원
https://www.coupang.com/vp/products/6202327572?itemId=12313960340
==============================================================================================================

- 블렉야크 회원 가입 
BYN 맴버십 번호: 	90000047122 
회원번호: 11504400369
□ 블랙야크 공식 온라인몰
www.byn.kr/blackyak
==============================================================================================================

- 수일 작전 시작(06시, 집)
1. 당뇨 혈당 체크 매주 수, 일만 체크(위급할 때 수시로 체크 가능)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.02(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 중식(11:40, 짜장면, 탕수육[짱뽕 상회]: 김정윤 부장이 쏨): C언어, VS 닷넷 공부할 것[외국계 은행]

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.03(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 05월 급여 수령(7,238,720원, 신한은행 일본 신단말 Prj, (주) 제이앤에스팩토리)		

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.04(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- 주말[★] 
04:50 기상
05:10 조식
06:00 집출발(오이, 새로 산 파란색 잠바, 기능성 바지
      ==> 필립스 믹서기,  블루투스 스피커, 이어폰 가지고 감
06:10 남서울중 정류장 도착(643번 버 탑승)
06:40 고속버스터미널 하차
06:50 도보(고속버스터미널 실외)
07:20 포항행 고속버스 승차
11:48 포항 고속버스 터미널 도착(연휴여서 차 많이 막힘) 
11:57 고속버스 터미널 정류장(209번 버스 승차)
12:10 두호동 주민센터 하차
12:15 포항집 도착
12:30 중식
12:30 실내도보
14:00 종료
14:10 인터넷 서핑
15:00 델 노트북 포맷 후 윈도우10 설치
18:00 석식
18:30 집출발(수종) ==> 작은굴 고가도로 ==> 포항 철길 숲
19:25 큰누나 미용실 도착
19:30 이발(수종, 나)
20:10 미용실 출발(큰누나 차) 
20:20 귀가 ==> 큰누나한테 산달기 2팩 얻어 옴
20:45 다이소 포항 두호점 방문 ==> 알카라인 건전지 LR03(AAA, 4개입, 천원),  TH-투톤 의자(5천원), 적재식 뚜껑 휴지통(약 20 L, 5천원) 구입
21:05 귀가
21:10 인터넷 서핑
22:30 염색
22:50 샤워
23:10 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.05(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- 주말2[★]
05:40 기상
06:10 조식
06:30 도보(집 => 마장지 => 포항 우현 중해 마루힐 센텀 아파트 => 귀가)
08:15 귀가 
08:20 인터넷 서핑 
12:10 중식 ==> 비옴
12:30 실내 도보
14:00 종료
14:00 인터넷 서핑 ==> 델 노트북 환경 셋팅
18:00 석식
18:30 집출발(수종)
18:40 실내 도보==> 비옴
20:00 종료 
23:00 취침(수종)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.06(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 현충일[★]
05:40 기상
06:10 조식
06:30 도보(집 => 마장지 => 포항 우현 중해 마루힐 센텀 아파트[약한 비: 우산])
07;50 귀가 
08:10 인터넷 서핑  ==> 델 노트북 환경 셋팅
12:10 중식 
12:30 실내 도보(비 조금 와서 걷기 포기함) ==> 엄마 수종이 나무람(밥을 손으로 먹고 반찬 투정이 심함: 아들에게 기대하지 말 것)
14:00 종료
14:00 인터넷 서핑 ==> 델 노트북 환경 셋팅(사운드 문제 포기: 왼족 스피커가 깨진 것으로 추정됨)
15:00 로지텍 MK240 NANO 무선 콤보 마우스 고장내서 교체해줌(내가 노트북 들고 다니지 말라고 꾸증을 함)
17:30 석식 
17:58 집출발(도보: 작은 백팩[노스 페이스] (김치, 미역국, 통자반, 생선)): 구름끼고 바람 블어서 상쾌했음
18:44 포항 고속버스터미널 도착
19:10 포항 출발
23:18 서울 강남터미널 도착
23:40 고속 터미널 정류장(643번 버스 탑승)
24:20 남부초 정류장 하차
24:25 귀가
24:40 청소
03:00 취침
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2022.06.07(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.06.08(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 로지텍 M331 무선마우스 회사에 가져가서 사용

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 솔직히 에어팟급 편리함을 맛봤습니다. 입문용 무선 게이밍 헤드셋 로지텍 vs 레이저 사용기! [TSub잇섭]
https://youtu.be/9OzpHsx-TFE
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.09(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.10(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 델 서비스 센터
 https://www.dell.com/ko-kr, tamario@naver.com/aaascsA111!
 ==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.13(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:40 ==> 

- 주말
06:56 기상
06:10 조식
06:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:00 귀가
09:20 집출발(자전거)
09:40 서울 가정의학과 의원 방문 ==> 혈당 측정: 134
09:45 진료 ==> 당뇨 상담(당뇨약, 미세 당백뇨약  1달치 처방[5,800원]): 혈당치 보고 좋아 졌다고 함(1달 후 A1C 검사 예정)
09:55 래미안 나나 약국 방문 ==> 조제(당뇨약, 미세 당백뇨약: 4주치[9,800원]), 덴드로프 쿨액(만원, 비듬방지약) 구입
10:00 종료
10:05 이마트 구로점 방문 ==> MLB 심플 캠핑 슬리퍼 LV(250m, 센들, 19,800원[실외 도보용]) 구입 
10:30 귀가
12:00 중식
12:30 실내 도보(MLB 심플 캠핑 슬리퍼 처음 신고 도보: 가격 대비 대만족)
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 실내 도보[소나기 옴: 도보 포기)
19:07 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 집)
20:15 종료
20:25 집출발(자전거)
20:40 이마트 구로점 방문 ==> MLB 심플 캠핑 슬리퍼 LV(250m, 센들, 29,600원[2개, 실내 도보용, 포항집 실내 도보용]) 구입 
21:00 다이소 구로  디지털2호점 방문 ==> 혀 크리너 부착 칫솔(5P, 2천원), 우드 느낌 롤 브러시(머리빗, 2천원) 구입 
21:20 귀가
21:00 인터넷 서핑
23:00 취침
============================================================================================================== 

- Dell 코리아 서비스 로그인(델 노트북)
https://www.dell.com/ko-kr, tamario@naver.com/aaascsA111!
==============================================================================================================

- 니조랄, 덴드로프 쿨액
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=sin8984&logNo=220696718842

- 비듬은 도대체 왜 나만 생길까?🔥 지긋지긋한 지루성두피염 클리어 해드립니다 (원인, 습관교정) [피알남 피부과전문의 김홍석]
https://youtu.be/CdNgcOoxC7w

- 약국에서 파는 '비듬용 샴푸'가 있다?! 지루성두피염 샴푸 완벽 정리! [피알남 피부과전문의 김홍석]
https://youtu.be/YXzrUE1qUwc

- 지루성두피염의 올바른 샴푸법을 알려드립니다. 잘못된 샴푸법의 유형들[묘한의사]
https://youtu.be/DmY8MhzlKQA

- 비듬의 원인, 치료법 ※피부과전문의※ [이지스킨TV 피부과전문의]
https://youtu.be/3Dusl_to2CQ
1. 약산성 샴푸 사용: pH 4.5 ~ 5.5
============================================================================================================== 
 
- [2시간 순삭] "23살 아이유"의 "역대급 연기력"으로 역주행했던 레전드 드라마 1위[목소리 이쁜 언니]
https://youtu.be/QfR-Ai0oqLA
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2022.06.12(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말2[★] 
05:30 기상
05:40 조식
06:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
07:20 귀가
07:30 머리 감기 ==> 덴드로프 쿨액(비듬방지약) 처음 사용(만족함)
07:40 인터넷 서핑 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 마인드 맵 분석
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:52 귀가
20:30 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 66.8kg ==> BMI: 23.11[표준 체중]) ==> 오른쪽 발바닥 물집 생김(떼어냄: 구급약 없어서 크림 바름)
21:20 인터넷 서핑
23:00 취침
==============================================================================================================

- 로지텍 MK240 NANO 무선 콤보 구입
- [로지텍 코리아] 로지텍 MK240 NANO 무선 콤보[블랙,화이트][키스킨 포함], 블랙, 가격: 27,400원
http://www.11st.co.kr/products/1187813726/share
1. 배터리리 수명: 키보드 36개월, 마우스 12개월
==============================================================================================================

- [DELL] 클릭 몇번으로 한번에 모든 드라이버를 업데이트, SupportAssist 활용 방법[Dell Korea
https://youtu.be/Ls2XMDY_2hU

- SupportAssist SW 다운로드
https://www.dell.com/support/home/ko-kr/?app=drivers

- Dell 고객지원 서비스(카카오톡 문의) ==> https://pf.kakao.com/_Wqfxds
- 페이스북 문의사항  ==> https://dell.to/2wP2U4v
--------------------------------------------------------------------------------------------------------------------------------

- [DELL] 블루투스의 연결, 끊김, 장치 없음 등, 문제가 발생했을 때 꼭 봐야하는 영상[Dell Korea]
https://youtu.be/ZwvIkD90LXU

- [DELL] 블루투스의 연결에 문제를 해결하는 간단한 방법! [Dell Korea]
https://youtu.be/gmxr3E_mmj8

- [DELL] 델 온라인 진단테스트 실행하기[Dell Korea]
https://youtu.be/ahpKXnInFmg
==============================================================================================================

 - 한끼농산 국산 서리태 [2kg], 가격: 16,490원
 https://youtu.be/ahpKXnInFmg 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.13(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 점심시간에 다이소 대방점(12:40)
1. 일상 닥터 가정 상비 구급 키트(5천원: 센들 맨발로 신어서 오른쪽 발바닥 물집 생김) 구입
2. 쿨썸머_단색 냉감 이불(100x150, 여름 이불): 구입
3. 쿨접지형 스위치 콘센트3구 (1.5 m, 안방 선풍기용): 구입
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.14(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> IRP 투자(09시), Prj 전체 회의(14시, 김정윤 부장: 개발 진척도가 낮아서 계속 쪼인다고 함: 비상 시국)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 퇴직연금 IRP 투자[22.06.14(화)] @@@	 
No. 	 주식코드 	 주식명 	 					매입수량 	 매입단가 	 매입금액 	 		현재가 	 	평가금액 	 		평가손익 	 손익률(%) 
 1 	329650		KODEX TRF3070	 		280 	 		10,550 			2,954,000 	 	10,550 	 	2,954,000 			0 	0.00 			
 2 	360750		TIGER 미국S&P500	 	260 	 		12,200 	 		3,172,000 	 	12,300 	 	3,198,000 			26,000 			0.82 			
 3 	133690		TIGER 미국 나스닥100	 32 			65,490 	 		2,095,680 	 	66,280 	 	2,120,960 			25,280 			1.21 			
 4 	395400		SK 리츠	 					100 	 		6,680 	 		668,000 	 	6,720 	 	672,000 			4,000 			0.60 			
						합계 	 						672 	 		94,920 	 		8,889,680 	 	95,850 	 	8,944,960 	 		51,280 	   		   	   
		1.  안전자산■ 	 2,954,000 	 33% 	 2. 위험 자산■ 	 	5,990,960 	 	67%																 
==============================================================================================================
 
- 뱃살 빠지는 최고의 운동 BEST[Thankyou BUBU]
https://youtu.be/eg_DipJ7UVk
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.15(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 중식 후 도보(11:40, 비옴: 보라매역에서 처음 도보: 만족)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.16(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 로지텍 MK240 NANO 무선 콤보 회사에 가져가서 사용 , 주식의 정석 100강 시청 종료(15번 시청 완료)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 검은 콩 구입
1. 한끼농산 국산 서리태 [2kg] 속청 2021년산, 가격: 16,490원
1) Smile Pay 캐시 충전 결제(현금성): 16,480원
http://www.enuri.com/detail.jsp?modelno=50822096
https://youtu.be/ahpKXnInFmg 
==============================================================================================================

- 커피 포터 구입
1. 무선 유리 전기주전자 커피 포트 보온 2.3L KK-903NZ, 가격: 24,700원 
 1) Smile Pay 캐시 충전 결제(현금성): 23,504원, Smile Pay 캐시 충전 결제(이벤트성): 1,196원
http://www.enuri.com/detail.jsp?modelno=87279406
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C534404774&frm3=V2 
------------------------------------------------------------------------------------------------------------------------------

- 결제 수단 : 스마일 캐시(Smile Pay, 자동충전)
- 결제 금액 : 306,234원
- 결제일 : 2022-04-24
==============================================================================================================

- 옥션 비밀번호 변경
https://escrow.auction.co.kr, tamario/a@@scs111!
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.17(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> Prj 면담(16시, 김정윤 부장이 내 개발 진척도는 괜찮은데 미리 당겨서 속도 내라고 해서 짜증냄)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.18(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:40 ==> 주말 근무

- 주말
04:50 기상
05:40 조식
06:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
07:20 종료
07:33 집출발(자전거)
07:45 사업장 도착(신한은행 보라매역 금융 센터점 3층)
07:50 근무 ==> 단위 테스트 화면 3개 완성(팝업 위주)
11:30 중식(건빵, 초코파이, 과자, 컵라면)
12:00 도보(대방 공원) 
12:45 종료
12:50 다이소 대방점 방문 ==> 쿨썸머_냉감 타월 이불(약100x70 cm), 5천원), 프린팅 냉감 방석(약40*40 cm, 5천원) 구입
13:00 귀사
13:00 근무 
17:58 퇴근(자전거)
18:10 진흥마트 근처 야채가게 방문 ==> 느타리 버섯(한 바구니, 2천원) 구입
18:12 진흥마트 방문 ==> 동원-조이락 알뜰 어묵 1kg(2개[개당: 3,650원]), 동원-추억 부산사랑 어묵1kg(2개[개당: 3,650원]) 구입 
18:18 귀가 ==> 커피 포터, 검은 콩 도착 
18:23 석식
18:40 실내도보
20:20 인터넷 서핑
23:00 취침
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2022.06.19(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
05:40 기상
06:00 조식
06:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
07:50 귀가
10:50 느타리 어묵 무침(어믁 2kg) 무침: 느타리 버섯 넣음(어믁, 느타리 버섯 뜨거운 물에 넣고 찬물에 식힌 후 버무림)
10:10 종료
12:00 중식(건빵, 초코파이, 컵라면)
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 66.8kg ==> BMI: 23.11[표준 체중])
21:30 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 모토이슈] 제비표 우의 Si-901 리뷰 l 모터사이클 우비 테스트 2탄 l 가성비 최고 국내 기술 우비! [모토이슈]
https://youtu.be/f6cUg8uiWk8

- [모토이슈] 라이딩 우비 종합 테스트 & 리뷰! 장마철 라이딩 고민 해결! [모토이슈]
https://youtu.be/rTDVIsKRrLM
==============================================================================================================
 
- 비옷 구입
- 제비표 하이패션 우의 세트 (SI-901), 선택 블루 + M, 가격: 54,190원
http://www.enuri.com/detail.jsp?modelno=7490885
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.06.20(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 김정윤 부장 면담(09시, 할리스 커피(아메리카노 아이스): 서로 오해를 품: 개발 속도 낼 것)

- DB손보 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.21(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.22(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 신한은행 Prj[ 철수(14시, RD 설치 문제로 김정윤 부장과 충돌) 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 신한은행 Prj 철수(14시, RD 설치 문제로 김정윤 부장과 충돌)
1. 글로벌 RD 7.0 설치 안됨 ==> 이현정 주임에게 문의 ==> 3번 PC 재부팅 했는데도 설치 안됨
 ==>  이현정 주임에게 문의: 일련번호 잘못 입력해서 설치가 안되었다는 말에 약간 짜증냄 ==> 김정윤 부장에 RD 설치가 이주임 업무가
 아니라는 말에 확 짜증이 남 ==> 내가 그만둔다고 성질냄 --> 김정윤 부장 면담(그만 두기로 함) ==> 김준형 대표와 통화: 오늘까지 일
 한 것으로 하고 철수하고 합의됨 ==> 짐싸서 철수
==============================================================================================================

- 신한은행 Prj 문제점 
1. 형식적인 개발 가이드 외에 실제 개발에 필요한 분석 자료 전혀 없음
 1) AS-IS 소스(기존 Flex 소스)에 대한 분석 자료가 전혀 없음 
2. 기존 개발된 소스(USB: 미국)가 현황화가 안되어 있어서 실제 실행이 안되는 경우가 많음
 1) 실행되는 소스도 급하게 개발해서 그런지 소스 자체 퀄러티가 떨어짐
3. 등록이 안되어서 JIRA에 등록 방법, 테스트 데이타 요청을 해도 현업 직원의 답변이 없음
 1) 나중에 통합 테스트할 때 품질 문제가 쏱아질 것을 추정됨
4. 기존 개발된 소스(USB: 미국)를 참조해서 JSB(일본)으로 전환을 하는데 추가, 수정해야 하는 부분이 너무 많음
 1) VSB(베트남) 전환 때를 생각하고 일정을 잡은 것은 문제가 많은 것으로 판단됨
 2) 작년 4월부터 VSB(베트남) 전환 했는 개발자들도 말도 안되는 일정이라고 주장함
5. 주임급 개발자가 소스 설명을 해주는데 자기의 실력 만큼만 가이드 해줌
6. 처음 면접할 때 스크립트만 알면 문제없이 쉽게 개발할 수 있는 말이 사기로 판명됨
==============================================================================================================

- 2021년 귀속 종합소득세 환급금(관악세무서) 수령
1. 수령액: 1,854,000원
==============================================================================================================

■■■■■■■■■■■■■■■■ 2022.06.23(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 오후부터 비 많이 옴(장마)

- 임시 휴가[★]
1. 
==============================================================================================================

- 프로젝트 면접(15시, 서울역 근처 카페드 콘서트 카페)
1. (주)두베 김현삼 전무(14:50 ~ 15:30)
 1) 개방적이고 긍정적인 마인드가 마음에 듬: 7월 1일(금)부터 출근하기로 함
------------------------------------------------------------------------------------------------------------------------------

- KB Pay 중심의 One-platform 서비스 구축 프로젝트
1. KB Pay 
2. KB 카드(홈): 내 업무
3. kb 리브모바일
=============================================================================================================

- 경력증빙서류 출력
1,. 증명서 출력 수수료: 2천원(현대카드 결제)
=============================================================================================================

■■■■■■■■■■■■■■■■ 2022.06.24(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  밤에 비 많이 옴(장마, 도림천 산책로 많이 망가짐)

- 임시 휴가[★]
06:20 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 집)
07:59 귀가
08:00 인터넷 서핑 ==>  프로젝트 투입관련 제출서류 작업
10:10 종료
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:30 귀가 
21:30 인터넷 서핑
22:30 취침
==============================================================================================================
 
- KB Pay 중심의 One-platform 서비스 구축 프로젝트 투입관련 제출서류 작업
1.개인이력카드(파일첨부01)  ==> 완료[♥♡]
   > 경력은 최근이력순으로 작성
2.신원보증서 (파일첨부02)  ==> 완료[♥♡]
   > 개인정보만 기 술
3. 투입인력 명단 (파일첨부03)  ==> 완료[♥♡]
4. 개인정보 및 고유식별 정보 수집이용 동의서 (파일첨부04)   ==> 완료[♥♡]
   > 날짜는 비워두고 자필서명 후 스캔파일로 제출해주세요.   ==> 04 개인정보 및 고유식별정보 수집이용 동의서.jpg
5. 증명사진  ==> 완료[♥♡]
   > 출입증 등록용/ 반드시 JPG 파일로 제출 ==> 05. 증명사진(진태만).jpg
6. 기술등급 산출근기(파일첨부06)  ==> 완료[♥♡]
7. 투입인력 요약표 (파일첨부00) ==> 완료[♥♡]
8. 최종학력증명서  ==> 완료[♥♡]
    > 졸업증명서(신사동 주민센터에 가서 발급 받아옴(수수료: 천원))
  08. 졸업증명서(진태만).jpg
9. 자격증 사본 (소지자 해당)  ==> 완료[♥♡]
   > 정보처리기사 ==> 09. 정보처리기사 자격증(진태만).jpg   
10 경력증빙서류  ==> 완료[♥♡]
 > 10. 소프트웨어기술자 경력증명서(진태만) 출력(수수료: 2천원)
 > vFlat으로 스캔 후 10. 소프트웨어기술자 경력증명서(진태만)_01.jpg 파일(3개 파일)로 만듬
11. 91. 건강보험자격득실확인서(진태만) pdf 파일 제출
==============================================================================================================

- 정부24 로그인[22.06.24(금)]
https://www.gov.kr/nlogin/?cu, 2020오*@
==============================================================================================================

- 분노조절
- [토크콘서트 화통] 화를 많이 내는 사람들의 특징 I 마음아, 넌 누구니? 내 마음 대화법 I 마음 치유 전문가 박상미[ 캐내네 스피치]
https://youtu.be/0_5wzLBZOtA

- [법륜스님의 즉문즉설 제 1507회] 욱하는 성격이 있습니다
https://youtu.be/ii8GBthiYv4
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.25(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  
 
- 주말[★] 
04:55 기상
05:20 조식
06:00 집출발(방석(여름용), 키보드 셋트(로지텍 MK240 NANO), MLB 심플 캠핑 슬리퍼 LV(250m, 센들) 가지고 감
06:05 남서울중 정류장 도착(643번 탑승)
06:40 고속버스터미널 하차
06:50 도보(고속버스터미널 실외)
07:20 포항행 고속버스 승차
11:24 포항 고속버스 터미널 도착
11:30 다이소 포항 해도점 방문 ==> 접지형 스위치 콘센트3구(1.5 m, 2개: 만원), 리엔 흑모 비책 한방 크림 염모제(흑갈색, 5천원) 구입
11:38 고속버스 터미널 정류장(209번 승차)
11:55 두호동 주민센터 정류장 하차
11:59 포항집 도착
12:10 중식
12:30 실내도보
14:00 종료
14:10 인터넷 서핑 ==> 델 Support AssistLauncher 설치: PC 다운됨 SW 삭제함 
17:30 석식
18:00 집출발(수종) 
18:20 다이소 포항 우현점 방문 ==> 접지형 스위치 콘센트3구(1.5 m, 2개: 만원), 실리콘 잠수경(분리형, 5천원) 구입
19:00 큰누나 미용실 도착
19:10 이발(수종, 나) ==> 내 머리 비듬 약 사용 후 많이 좋아졌다고 함
20:00 미용실 출발(큰누나 차) 
20:10 탑 마트 도착 ==> 수박(17,900원), 아아스크림 구입: 큰누나가 쏨
20:30 귀가
20:40 큰누나 수박 약간 먹고 집에 감
21:00 다이소 포항 두호점 방문 ==> 사각 스틸 후크(4P/SET: 모기장용, 천원), 수예용 고무줄(2.5 mm*4 m, 천원) 규입
21:15 귀가
21:20 인터넷 서핑
22:30 사랑방에 모기장 설치(사각 스틸 후크 2개 설치)
22:50 샤워(수종)
23:10 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.26(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- 주말2[★]
06:20 기상
06:30 조식
07:00 도보(집 => 마장지 => 마장지 근처 도보 => 귀가)
08:20 귀가 
08:20 인터넷 서핑 
12:00 중식 
12:30 실내 도보
14:00 종료
14:00 인터넷 서핑 ==> 수종 수영복 구매 분석
16:00 집출발(수종) 
16:05 두호동 주민센터 정류장 도착(207번 탑승)
16:25 죽도시장 도착 ==> 수영복  조사: 시장에서 판매 안함 
16:50 CU 두호점 편의점 도착 ==> 수종 CU 교통카드(티머니) 만원 충전(현금)
17:00 다이소 포항 두호점 방문 ==> 2단계 필터 샤워기(5천원), 고급 스텐레스 샤워기 호스(2 m, 5천원), 롯데 자일리톨 오리지날(32g, 
		16g*2, 껌, 천 5백원, 수종) 구입 
17:20 귀가
17:30 화장실 샤워기 교체(이전 꺼 손잡이 근처 부분 깨짐: 교체 후 만족)
18:00 석식
18:30 실내 도보
19:40 종료
20:40 집출발
21:10 다이소 포항 우현점 방문 ==> 실리콘 잠수경(분리형, 5천원) 반품
21:30 귀가
21:34 인터넷 서핑 ==> 수종 수영복 구입 
22:50 샤워(수종) ==> 새로 설치한 샤워기 사용(만족)
23:10 취침(수종)
==============================================================================================================

- 수종 수영복 구입
1. 꾸미 렛츠서프 래쉬 가드 아동수영복 어린이 래쉬 가드, 36,600원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2414489553
옥션: Smile Pay 캐시 충전 결제(현금성)
2. 스키즈 남녀 아동 큐티 수영모자 SKH-401, 색상:블루 + 사이즈:FREE (0원), 가격: 8,950원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2159832641
옥션: Smile Pay 캐시 충전 결제(현금성)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.06.27(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 임시 휴일[★]
06:09 기상
06:20 조식
06:30 도보(집 => 마장지 => 마장지 근처 도보 => 귀가)
08:20 귀가
08:30 인터넷 서핑 ==> 선풍기 청소 도와줌
10:30 델 노트북 AS 센터에 전화 ==> 블루투스 드라이버 다운로드 받음: R226750.exe 파일 설치 안됨(윈도우 7용이여서 설치 안됨)
		 ==> 델 노트북에 윈도우 7 OS 다시 설치할 것
12:00 중식 
12:30 실내 도보 ==> 비옴
13:00 집출발(우산)
13:10 포항 동부초 후문(보안관실): 수종 기다림
13:34 수종 혼자 집에 왔다고 전화 옴(길 엇갈림)
13:40 귀가
14:00 인터넷 서핑 ==> 트래킹 센들(크래커) 구입
17:30 석식 
18:10 집출발(도보: 작은 백팩[노스 페이스] (고추장, 수육 약간))
19:00 포항 고속버스터미널 도착(45분 걸림)
19:10 포항 출발(6명 탑승)
20:48 서울 강남터미널 도착
23:05 고속 터미널 정류장(643번 탑승)
23:40 남부초 정류장 하차
23:48 귀가
24:20 청소
24:50 취침
============================================================================================================== 

- 트래킹 센들(크래커) 구입[재고 부족으로 주문 취소함]
1. 블랙 야크 트래킹 샌들 트래커(ABYSHX9908), BLACK(블랙)/260mm, 가격: 80,000원
https://with.gsshop.com/prd/prd.gs?prdid=1014023520&
============================================================================================================== 

- 트래킹 센들(크래커) 분석
- [칸투칸 리뷰] KQKB70 레전드 아쿠아 트레킹화
https://youtu.be/tvNjdi5Q1gs

- 블랙야크 트래킹 샌들 트래커, 가격: 89,500원
 https://smartstore.naver.com/bybucheon/products/5337557554

- 네파 남성 스칼로 트레킹샌들 7F37652, 가격: 51,900원
https://search.shopping.naver.com/catalog/32165797828

- 블랙야크 남녀공용 라이트 트레커 샌들 (ABYSHX0016), 가격: 76,050원
http://www.enuri.com/detail.jsp?modelno=70512634
 
- 아웃도어 아쿠아슈즈 남녀 메쉬 통기 등산화 낚시화\, 가격: 76,050원
http://www.enuri.com/detail.jsp?modelno=79586002

- 르까프 현대충청점 NV 플로리다 안정적인 착화감 벨크로 아쿠아 트레킹 스포츠샌들 1118DL210, 가격: 40,000원
http://www.enuri.com/detail.jsp?modelno=51932675 
============================================================================================================== 

■■■■■■■■■■■■■■■■ 2022.06.28(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 2022년 06월지침[(22.06.28(화)]: 0634 / 사용량 2 ㎥ ==> 실수로 자가 검침 못함(전화로 통보함)

- 임시 휴가[★]
- 2021.05~10_농협 Memo 정리 @@@
1.  
==============================================================================================================

- 대형가전 무료 수거 예약
https://www.15990903.or.kr/portal/reserve/selectPageListMyReserve.do
폐가전무상방문수거 무상방문수거 서비스를 이용해 주시어 감사드립니다.
고객님이 예약하신 예약정보는 아래와 같습니다. 
- 예약일자 : 06월, 29일(수)
- 예약번호 : 123732, 진행절차 확인 가능
- 예약취소 및 변경 : www.15990903.or.kr 접속 → "예약조회, 변경"에서 고객명, 예약번호 입력 → 정보 변경
==> 수거 거분(방문 기사에게 전화옴): 소형가전은 5개 이상이 되어야 수거해 간다고 함
==============================================================================================================

- 프린터 버리기 어떻게 할까? 분리 배출 방법
1. 버려야 할 소형 폐가전이 5개 미만일 경우
 1) 지역 동 행정복지센터에 배출하시면 되는데요. 보통 일반 가정용 프린터는 높이가 1m 미만인 소형 가전에 해당하므로 동 주민센터에 
있는 무상수거함에 배출하면 된다고 합니다. 찾기 어렵다면 알맞은 재활용 배출 지정구역에 내놓으시면 되고요. 
https://www.gwanak.go.kr/site/gwanak/07/10703010200002016051206.jsp
==============================================================================================================

- 매트리스 커버 구입 후 취소 처리(이미 존재)
- 솔리드 호텔식 매트리스 커버 모음 워싱 마이크로 방수, 가격: 25,850원
08.방수 매트리스커버 / Q-그레이(퀸사이즈) [취소 처리]
03-2.클레어 누빔매트커버 + Q-블루 (+14,000원), 가격: 31,900원[구입 검토할 것 ■]
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C331456245&frm3=V2
옥션: Smile Pay 캐시 충전 결제(현금성)
==============================================================================================================

20:00 다이소 난곡점 방문 ==> 2단계 필터 샤워기(5천원), 고급 스텐레스 샤워기 호스(2 m, 5천원), 멍키 스패너(10인치) 구입
20:30 귀가
20:40 서울집 화장실 샤워기 교체
21:00 샤워(만족)
==============================================================================================================

■■■■■■■■■■■■■■■■ 2022.06.29(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 후남 만남(12시, 신사역 8번 출구)

- 임시 휴가[★] 
05:27 기상
06:00 조식
06:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:20 귀가
08:25 샤워
08:40 인터넷 서핑 ==> 여름 이불 셋트 분석
10:00 집출발
10:05 남서울중 정류장 도착
10:10 5413번 탑승 ==> 고급 임페리얼 데니쉬 버터 쿠키 셀렉션 500g(대용량): 김은아 생일 선물(9,900원: 카카오톡으로 보냄)
11:15 고속 터미널 정류장 하차(강남에서 차 많이 막힘)
11:45 한성 돈까스 도착(갑자기 비 많이 옴)
11:50 생선까스(만 4천원: 2인분, 2만 8천원 ==> 내가 쏨) 주문
12:00 중식(후남이 도착) 
12:20 종료
12:40 가로수길 도착
12:50 청수당 커피숍 도착 ==> 커피(2잔): 후남이가 쏨
15:00 종료(2시간 가량 인생 이야기 함)
15:10 신구초등학교 둘러보기
15:20 현대백화점 압구정점: 후남이가 떡갈비(3개) 쏨
15:30 압구정역에서 후남이와 헤어짐
16:15 고속 터미널 정류장 도착(643번 승차)
17:00 신림역 정류장 도착
17:10 연세 미래 치과(신림역 1번 출구 포도몰 6층) 도착
17:15 진료: 왼쪽 아래턱 견치(33번)이 가로 칫솔질로 10년 전에 떼어 놨는데 다시 가로 칫솔질을 해서 떼어 놓은 부분이 파여서 신경을 
		건들임: 신경 치료(5주) 후 크라운 쓰우기(50만원) 하라고 함, 신경 치료(마취: 12,000원 결제)
17:45 종료
18:00 귀가
19:00 석식 
19:20 실내도보
20:50 종료
21:00 인터넷 서핑  
22:50 취침
============================================================================================================== 

- 신사동 돈까스 맛집! '한성 돈까스'의 몰랐던 이야기
https://youtu.be/bjeQZSCmg5Y
==============================================================================================================
 
-  [신사동 가로수길 카페] 청수당 갤러리 : 그냥 다 예쁜 카페
https://hanis.tistory.com/44
==============================================================================================================

- 여름 이불 셋트 분석
- 2022년 인기 많은 시원한 여름이불 추천순위 TOP10[세상의 모든 쇼핑]
https://youtu.be/dgDFAuXeBGA

- 고급 호텔 시어서커 썸머 여름 이불 단품 풀세트 SS/Q, 가격: 122,900원
https://www.coupang.com/vp/products/5342416374
==============================================================================================================
 
■■■■■■■■■■■■■■■■ 2022.06.30(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 법원에 전화(09:40, 서울중앙법원 집행관(경매2계): 현아트빌 4040호 경매 5~6개월 더 걸린다고 함)
- 임시 휴가[★]
1.이미지 CCR 한글 변환
============================================================================================================== 

- 트래킹 센들(크래커) 구입
1. 블랙 야크 트래킹 샌들 트래커(ABYSHX9908), BLACK(블랙)/270mm, 가격: 80,500원
https://www.coupang.com/vp/products/5690894830
============================================================================================================== 

- 코스닥 개미귀신 [풀영상] | 창 376회[KBS 시사기획 창]
https://youtu.be/SRURTsMMCdo
============================================================================================================== 
 
- 한글 OCR 프로그램
1. OCR:l광학문자인식: Optical Character Recognition)
1) 보통 컴퓨터가 2진법(0/1) 데이터를 폰트를 통해 인간이 인식할 수 있는 형태로 글자를 보여 준다면, OCR은 그 반대로 인간이 종이 
위에 써 놓은 글씨를 인지하여 텍스트 데이터로 치환한다.
------------------------------------------------------------------------------------------------------------------------------

- 구글 드라이브를 이용한 PDF, 이미지를 텍스트로 변환!! 그리고 한글 번역까지[디지털 생활제안]
https://youtu.be/isg7wQAqcMU
------------------------------------------------------------------------------------------------------------------------------

- synap soft OCR
https://www.synapsoft.co.kr/ocr/
============================================================================================================== 

- 프로젝트에서 찍은 이미지 파일 OCR 작업
1. vFlat 어플에서 이미지 생성 ==> Documnets/vFlat 폴더에 생성됨
 1) 2021.05~10_농협 Memo(폴더) 생성
2. 2021.05~10_농협 Memo(폴더) 압축하기
 1)  2021.05~10_농협 Memo.zip 파일로 생성됨
3. OCR 작업 및 내보내기( 2021.05~10_농협 Memo 폴더에서)
 1)  내보내기: 2021.05~10_농협 Memo.zip 파일: 내보내기 ==> 구글 드라이브: 선택 ==> 전송됨 
============================================================================================================== 
 
- 파일 가져오기 후 OCR 처리(vFlat에서): 이전 작업
1. vFlat 화면 ==> 라이브러리 ==> 01. main_vFlat(메인 폴더명)
 1) 가져오기 ==> 이미지: 클릭 --> 2021.05~10_농협 Memo(폴더): 모두 선택: 클릭 
   ==> 01. main_vFlat(메인 폴더명)에 생성됨 ■
2. OCR 작업 및 내보내기(01.  main_vFlat(메인 폴더명)에서)
 1) test.jpg 파일: 텍스트 인식하기: 클릭 --> 텍스트: 클릭
 2) 내보내기: 클릭 ==> TXT 파일(.txt) 클릭 ==> TXT 내보내기: 클릭 ==> 텍스트 파일 생성됨 ■
  --> Documents/vFlat/01. main_vFlat_1.txt 파일에 저장된 ==> 공윺하기: 클릭 ==> OneDrive에 저장하기
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
