

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.04) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.04.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 화공과 동기 정영수와 통화(12시, 대구 수성구 시지동 근처에 함)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- (주) 제이앤에스팩토리 프로젝트사업팀 김준형 대표와 통화
프로젝트 : 신한은행 글로벌 해외지점 화면단말 HTML5 전환
장소 : 보라매역 근처
기간 : 4월초~11월말 (4월~5월초까지 투입기간 조정가능)
포지션 : 화면개발
단가 : 월 750만원
업무 내용 : 해외지점 화면 UI에 한정하여 기존 Flex 소스를 웹스퀘어로 전환하는 프로제트
==============================================================================================================

- 브레이브 브라우저 동기화(북마크: 즐겨찾기)
https://iboxcomein.com/brave-browser-synchronization
1. TAMA-HAART-404 (이 장치) (태만 PC)
sign amount balcony tell sleep remember enable smooth gauge state search clerk naive tribe client creek flat ski alien 
husband royal best grace alien
2. SM-N960N(갤럭시 노트9: 태만 폰)
3. SM-T733(갤럭시 탭 S7 FE)
==============================================================================================================   
 
■■■■■■■■■■■■■■■■■■ 2022.04.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
06:00 기상
06:40 조식(과자: 정크 푸드)
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
08:30 귀가
09:00 집출발(자전거)
09:38 쿠쿠 구로점 방문 ==> 수리 맡김
10:05 다이소 구로시장점 방문 ==> 매직 흡착 알루미늄 6련 후크(벽 걸이, 3천원), 10련 컬러볼 도어 후크(방문 걸이, 3천원)
		, 14색 조리 도구(긴 스푼, 천원)구입
10:20 자연을 사랑하는 형제들(남구로 시장 내) 방문 ==> 어묵 400g(2천원: 3개, 6천원), 양파(한 봉지, 2천원), 당근(한 봉지, 2천원)
		 , 마늘(한 봉지, 3천원), 오이(5개, 3천원) 구입(미역 줄기 가격: 300g, 천원 --> 3kg: 만원)
10:38 쿠쿠 구로점 방문 ==> 쿠쿠 밭솥 수리비 4만 4천원 나옴(자동 증기 배출기 교체, 2. 다이어 프레임(압연 제어) 교체, 3. 패킹 교체)
11:10 귀가
12:00 중식
12:30 실내 도보 ==> 주식의 정석 93강 시청 종료(13번 시청 완료), 주식의 정석 1강 시청
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
19:50 종료
20:00 인터넷 서핑
20:00 종료
==============================================================================================================
 
- 고혈압, 이것만 끊으면 해결![방태환원장의 건강강의]
https://youtu.be/1lY15p8bbBg
1. 중성지방, 콜레스트롤 ==> 고기, 계란 끊기
==============================================================================================================
 
- 진정한 의미의 육채전쟁! 가공식품의 위협 #SBS스페셜 | SBS NOW
https://youtu.be/Cwli1z1Nxv4

- 정크푸드, 먹어도 먹어도 배고픈 이유? [하늘마을 힐링센터 TV]
https://youtu.be/OYEr2zbtegY

- EBS 다큐프라임 - Docuprime_맛의 배신(중독을 부르는 향)
https://youtu.be/BuQIKoZ_SUY
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식(과자: 정크 푸드)
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
08:30 귀가
09:00 고추장 어묵 볶음 반찬 요리 ==> 처음 요리 했는데 만족(맛있음)
10:50 종료
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 
18:00 석식
18:20 집출발(자전거) 
18:28 도림 도보교 근처에 자전거 주차 
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집) 
19:30 종료 
19:43 다이소 신림 3호점 방문 ==>
20:10 정림시장(신원시장 내) 방문 ==> 오뚜기) 압착 올리브유 500ml(8,130원), 삼부자 볶음 참깨 200g(3,650원) 구입
20:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(체중: 66.5kg ==> BMI: 22.94[표준 체중])
21:30 인터넷 서핑
23:10 취침
==============================================================================================================
 
- 고추장 어묵 볶음 반찬 요리(09시, 집)
[재료]
어묵 6장(600g),  고추 3개, 양파 1개 반, 홍당무 1개
[양념]
고추장 3숟갈, 올리고당 3숟갈, 다진 마늘 3숟갈, 진간장 1숟갈, 설탕 1숟갈, 참기름 1숟갈
1. 커피 포트에 끓인 뜨거운 물애 어묵 잠깐 담궜다고 차가운 물에 담그기(어묵 연해짐)
2. 그릇에 양념장 재료 넣고 양념장 만들기
3. 불을 켜고 후라이팬에 참기름에 3숟갈 넣고 양파, 홍당무 볶기
4. 어묵 넣고 볶기
5. 불을 끄고 참기름 넣기
-----------------------------------------------------------------------------------------------------------------------------

- 매콤하고 맛있는 고추장 어묵 볶음 이젠 쉽게 만드세요[엄마의 손맛]
https://youtu.be/i4hs5n_kMFA

- 매운어묵볶음. 저희 집에선 이렇게 해먹어요~ [쿡피아]
https://youtu.be/7jZbrCDlz_4

- 어묵요리[고추장 어묵 볶음] 절대 불지 않는 찰지고 보들 보들한 밑반찬 오뎅 볶음[양장금 주부]
https://youtu.be/BX7aqR2OD6s

- 알콩달콩 어묵볶음 | 함께 요리해요 | 영자씨의 부엌
https://youtu.be/UI27VK5Os2Y

- 평범한 어묵볶음에 유부를 추가하면 벌어지는 일 [귀열이네 반찬가게]
https://youtu.be/RVea64HeNy0
============================================================================================================== 

- 미역 줄기 반찬 구입
1. [지온수산] 완도 염장 미역 미역줄기 쇠미역 곰피 10kg, 옵션: 염장미역줄기 10.0kg/1개 (+3,000원), 가격: 17,140원
https://smartstore.naver.com/jion_/products/4861014607
==============================================================================================================

- 현미 쌀 20kg 구입
1. 가가호호 종합 미곡 처리장 2020 농사꾼 양심쌀 현미 [20kg], 가격: 43,250원(2포): 총 가격: 86,500원
http://www.enuri.com/detail.jsp?modelno=55784927
http://www.tmon.co.kr/deal/6107763822?isHistory=Y
======================================================================================================================
 
- 헹켈 쌍둥이칼 올스테인리스 7종 검토
http://www.enuri.com/detail.jsp?modelno=78047183
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2196447315&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.04(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- (주) 제이앤에스팩토리 프로젝트사업팀 김준형 대표와 통화
1. 신한은행 글로벌 해외지점 화면단말 HTML5 전환 Prj에 투입되기로 합의함(이번주 수요일 면졉 예정)
 1) 퇴근 후 기술 경력 프로필 김준형 대표 메일(director@jnsfactory.com)로 보냄
==============================================================================================================

- 일본 니켄 목금도 칼라식도 타공식도 급식 업소용 학원 색상식도 컬러식도 위생식도, 가격: 15,120원, 가격(2개): 27,640원
http://www.11st.co.kr/products/1812254057/share
==============================================================================================================

- 알텐바흐 엑스클립스 통5중 스텐팬(프라이팬 궁중팬)_ 프라이팬 통5중 30cm, 가격: 45,500원(실 구매가: 10,420원[스마일 캐시 사용])
[스마일페이 결제] Smile Cash(이벤트성)	2022-04-04 21:51:48	35,080원
http://www.enuri.com/detail.jsp?modelno=51855126
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2387455967&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.05(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> (주)SG C 장종식 상무 통화(21시, 현대 오토에버, 근무지 군포)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 일본 니켄 목금도 칼라식도 타공식도 급식 업소용 학원 색상식도 컬러식도 위생식도, 가격: 15,120원, 가격(2개): 27,640원
http://www.11st.co.kr/products/1812254057/share
1. 색상: 파랑, 초록(포항집)
==============================================================================================================

- 코멧 홈 단열 아일렛 암막 커튼, 다크블루 (작은 창문용), 135 x 170 cm, 색삭: 다크 블루, 가격: 21,280원(안방 창문용)
https://www.coupang.com/vp/products/180352941?vendorItemId=70296014932&isAddedCart=
1. 안방 창문 크기(120*120cm)
==============================================================================================================

- 칼질 채소썰기 기본영상 조리기능사동영상 기초잡이 입니다[마스터박사부 -마스터요리]
https://youtu.be/SpY3oWC8g4I
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.06(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 동부초 진학지원금(체육복비) 지원 동의서 작성(21:30, 집)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
- 다이소 보라매점 방문(19:30. 자전거)
1. 벽걸이 커텐봉(100~180 cm) (3천원) 구입
2. 귀가해서 다이소에 가서 커텐봉 구입해서 설치 ==> 마음에 듬(총 3만원 미만에 이 정도 품질이면 강추)
==============================================================================================================

- 실내 야채 재배기
- 집에 스마트팜을 들여 놓았습니다. (이나프 스마트팜 야채재배기 실제 사용기)
https://youtu.be/O_SFXyAkCUg

- 뉴스에서 보던 식물공장이 우리집에?! 식물재배기 두 달 사용후기 [호기심리뷰]
https://youtu.be/gKm4gNqUiNw

- 식물재배기 금액대별 추천(LG틔운, 이나프, 콩나물재배기, 파테크)
https://youtu.be/FSGnM63z-dI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.07(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  (주)인터솔루션테크놀로지(IST) HR팀장 이송희에게 프로필 발송(20:30)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
- 신한은행 면접(19시, 보라매역 7번 출구)
고객사 : 신한은행
수행사 : 신한DS
계약사 : 제이앤에스팩토리
계약기간 : 2022-05-01 ~ 2022-10-31 (6개월)
근무장소 : 보라매역 신한은행 건물
프로젝트 내용 : 기존 화면(Flex) 단말 HTML5(Websquare) 전환 개발
월단가 : 750만원​
월용역비 지급일시 : 매 익월 05일 (휴일일 경우 전일지급)
계약방식 : 개인 3.3 % 공제방식 (산재보험료 추가 차감 : 13,780원)
==============================================================================================================

- 삼성노트(Samsung Notes) 사용법
- 삼성노트 이 정도까지 쓸 수 있다니? [테크몽]
https://youtu.be/KuY69BN9H3A

- 마트폰 메모 기능 삼성 노트앱 을 이용하면 아주 유용 합니다, [IB 96]
https://youtu.be/g4UXTEgkhvc
==============================================================================================================

- 다이소 선풍기 싹다 구매해서 리뷰하고 분해하기
https://youtu.be/uTVtVETzW4I
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.08(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> (주) 제이앤에스팩토리 프로젝트사업팀 김준형 대표에게 주민등록등본 사본과 통장 사본 보냄(22시, 집)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 정태웅 이사 면담(10:30)
1. KB국민은행 API 프로젝트 취소 요청 ==> 4월말 철수하기로 합의함
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
05:00 기상
05:40 조식
06:08 집출발
06:20 남서울중학교 정류장 도착
06:20 643번 버스 승차
07:15 신분단선.강남역 정류장 하차
07:30 누네안과병원(선릉역 1번 출구) 도착==> 계단으로 15층까지 걷어감 ==> 코로나19 사전 문진표 스캔 확인(핸드폰으로 미리 등록
		한 거 직원에게보여줌)  ==> 15층 데스크 접수 
07:55 안과 검사(15층): 1번(안압 검사), 2번(시력 검사)
08:07 망막 검사(13층): 눈약 넣기, 1번(망막 CT 촬영: 파란 십자가), 2번(망막 전체 사진 촬영(볼 데기): 파란 원), 3번(안저 퇄영(노란 X표))
		==> 광각 형광 안저혈관 조영술[편축]: 형광 물질 주사기로 투입 후 측정(노란 오줌) ==> 매년 4월달에 실시
08:50 혈압 측정: 141 ~ 95
08:55 종료
09:30 진료(김주영 원장 10번 진료실, 13층): 당뇨약도 안 먹는 상황에서 망막이 정상이라고 칭찬함(백내장 증상 야간 존재, 방심하지
		말고 꾸준히 관리하라고 함) ==> 실비 보험 청구 서류 발급 받음(2020.04.11 ~ 22.04.09)
09:42 수납(13층) ==> 진료비: 총 131,200원(다음 예약: 8월 20일(토))
10:30 신분단선.강남역 정류장: 643번 버스 승차
11:20 신림역 하차
11:35 진흥마트(신사시장 내) 방문 ==> 동원-조이락 알뜰 어묵 1kg(2개 7,300원[개당: 3650원]) 구입
11:45 진흥마트 근처 상점 방문 ==> 오이(4개, 2천원), 깻잎(3묶음, 3천원) 구입
10:50 귀가
12:00 중식
12:30 실내 도보
12:30 종료
13:40 인터넷 서핑
19:00 석식
19:25 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
20:45 종료
20:30 인터넷 서핑
22:30 종료
22:55 취침
======================================================================================================================

- 코로나19 사전 문진표(누네안과 병원)
http://www.noon.co.kr/COVID19_Interview/st.php?ch=V5Xn1&cno=9AVO8wKlOWU%3d&dt=20220408&ph=J0UVgD9qvFO1PKzG1iVjsQ%3d%3d
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
09:30 고추장 어묵 볶음 반찬 요리 ==> 동원-조이락 알뜰 어묵 1kg 2개 2번 볶음(후라이팬 2번 사용, 양념 1번 준비)
 ==> 처음 요리, 양이 너무 많이서 힘듬(후라이팬 4번 사용, 양념 2번 준비) 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 오이 무침
14:30 인터넷 서핑 ==> 한화손보 질병 보험금 청구(당뇨 막망증 치료: 2020.04.11 ~ 22.04.09) 작업: 총 1건 접수 완료
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
19:50 종료  
20:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(체중: 65.3kg ==> BMI: 22.60[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================

- 칼질 잘하는 방법! 제대로 배웁시다. (야채 썰기) [일식 조리 기술원]
https://youtu.be/QWJzDOUpqZk
==============================================================================================================

- 리퍼브 폰(헬로모바일)
https://direct.lghellovision.net/phone/list.do?pgNum=0101&phoneGubun=RPK
==============================================================================================================

- 알텐바흐 엑스클립스 통5중 스텐팬(프라이팬 궁중팬)_ 프라이팬 통5중 30cm, 가격: 45,500원(포항집에 선물)
[스마일페이 결제] Smile Cash(이벤트성)	2022-04-04 21:51:48	35,080원
http://www.enuri.com/detail.jsp?modelno=51855126
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2387455967&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.11(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
- [javascript 코딩] JSON.stringify() 사용방법 - JSON 가독성 높이기
https://jamesdreaming.tistory.com/m/172
==============================================================================================================

- Javascript JSON.parse(), JSON.stringify() 사용하는법
https://ithub.tistory.com/m/54
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.12(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 퇴근할 때 맥심 커피 박스(빈통) 가지고 옴(18시, 집), 보일러 끄기(18시, 난방 안 함)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 소비자 동향지수(CSI)
https://www.index.go.kr/potal/main/EachDtlPageDetail.do?idx_cd=1058
https://biz.chosun.com/site/data/html_dir/2015/03/20/2015032000443.html
소비자 심리지수는 17개 소비자동향지수(CSI: consumer survey index) 항목 중 현재생활형편, 가계수입전망, 생활형편전망, 소비지출전망
, 현재경기판단, 향후경기전망 등 6개 주요 수치를 합쳐 하나의 숫자로 만들어 놓았다.
=============================================================================================================

- 채권시장은 이미 경기침체 예고 [허란의 경제한끼]
https://www.hankyung.com/finance/article/202203298273i

- 미국 10년물 국채 금리 - Investing.com
https://kr.investing.com/rates-bonds/u.s.-10-year-bond-yield
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.13(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
    
- 2022-04-12_진태만_신한은행 일본 신단말 재구축 프로젝트 서명 
0. 요청자: (주)제이앤에스팩토리[곽혜진](khj0920@jnsfactory.com)
프로젝트 명 : 신한은행 일본 신단말 재구축 프로젝트
고객사 : 신한은행
수행사 : 신한DS
계약사 : 제이앤에스팩토리
계약기간 : 2022-05-01 ~ 2022-10-31 (6개월)
근무장소 : 보라매역 신한은행 건물
프로젝트 내용 : 기존 화면(Flex) 단말 HTML5(Websquare) 전환 개발
월단가 : 750만원​
월용역비 지급일시 : 매 익월 05일 (휴일일 경우 전일지급)
계약방식 : 개인 3.3 % 공제방식 (산재보험료 추가 차감 : 13,780원)
------------------------------------------------------------------------------------------------------------------------------

- 싸인 오케이 
https://www.signok.com
==============================================================================================================

- 실비 보험 청구서 지급 완료
접수번호 : 202204I4838
접수일자 : 22.04.10
사고(진단)일자: 22.04.09 ■■■ 
청구금액: 412,500원 ==> 실 지금액: 111,800원(지급일자: 22.04.13(수))
청구내용: [누네안과병원] 
22.04.09 지병인 당뇨 막망증 치료한 것에 대한 실비 보험을 청구합니다.  
- 누네안과 치료  @@@@
치료일자			치료명					병원비
2020.04.11 	 당뇨 막망증 치료 	 51,600 
2020.10.17 	 당뇨 막망증 치료 	 51,600 
2021.01.12 	 당뇨 막망증 치료 	 52,300 
2021.04.17 	 당뇨 막망증 치료 	 131,200 
2021.08.07 	 당뇨 막망증 치료 	 52,300 
2021.12.11 	 당뇨 막망증 치료 	 52,300 
22.04.09 	 당뇨 막망증 치료 	 131,200  
==============================================================================================================
  
- 이렇게 차이나는데.. 호갱 당하지 마세요! | 자급제+알뜰폰 핵심 요약[라이 브렉스]
https://youtu.be/bKRosbrv1rE

- 고고모바일: 알뜰폰 비교 플랫폼
https://www.gogofactory.co.kr
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.04.14(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 문자 찾기(리눅스에서)
> grep 가계정 System_22.04.14.log -n
--------------------------------------------------------------------------------------------------------------------------------

- 리눅스 기본명령어 - grep
http://www.incodom.kr/Linux/%EA%B8%B0%EB%B3%B8%EB%AA%85%EB%A0%B9%EC%96%B4/grep

- 리눅스 명령어 삼대장: find, grep, awk
https://jybaek.tistory.com/704
==============================================================================================================
 
- 10년 젊어지는 5가지 생활습관의 법칙은? (KBS 20220406 방송) [KBS 생로병사의 비밀]
https://youtu.be/Cu_aU1pemFg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.15(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 삼성 리퍼브 갤럭시노트10+ 가입 상담(LG 헬로 모바일)
1. 현재 사용하고 있는 갤럭시노트9(2021.02.05(금) 가입: 2년 약정) 해지시 위약금 총 22만원(4개월 후 현재의 알뜰폰으로 기기 변경으로
해주 후 가입하면 위약금 모두 면제된다고 함짐)
 1) 가입 희망하는 폰: U삼성 리퍼브 갤럭시노트10+(U+SM-N976R)
https://direct.lghellovision.net/phone/detail.do?idx=353&pgNum=0101
==============================================================================================================

 - 비밀번호 변경 패턴[22.04.15(금)]
1. aascs32!! --> aa성공[9자리]
2. bbnfafa32@@ --> bb성공[11자리]
3. bbscs37!!, ccscs44!!, ddscs55!!		--> bb성공[9자리]
==============================================================================================================

- 한국보건산업진흥원 비밀번호 생성규칙 안내
 https://www.khidi.or.kr/includes/password.jsp
 ==============================================================================================================

A. 비밀번호 생성규칙 안내   
1. 비밀번호 최소 길이: 영대 문자(A~Z, 26개), 영소 문자(a~z, 26개), 숫자(0~9, 10개) 및 특수문자(32개) 중 3종류 이상으로 구성하여 최소
9자 이상으로 입력합니다.
※ 특수문자 32개 예시: ~ ․! @ # $ % ^ & * ( ) _ - + =  [ ] [ ] | \ ; :‘ “ < > , . ? /
2. 추측하기 어려운 비밀번호 생성:생성한 비밀번호에 12345678 등과 같은 일련번호, 전화번호 등과 같은 쉬운 문자열이 포함되지 않도록 합니다.
love, happy 등과 같은 잘 알려진 단어 또는 키보드 상에서 나란히 있는 문자열도 포함되지 않도록 합니다.
3. 비밀번호의 주기적인 변경: 비밀번호에 유효기간을 설정하고 적어도 6개월마다 변경함으로써 동일한 비밀번호를 장기간 사용하지 않습니다.
4. 동일한 비밀번호 사용 제한:: 2개의 비밀번호를 교대로 사용하지 않습니다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.16(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:30 기상
04:35 조식
05:24 집출발
05:27 남서울중학교 정류장 도착
05:29 5413번 버스 승차
06:10 고속버스터미널 하차
06:20 도보(고속버스터미널 실외)
06:40 포항행 고속버스 승차
10:30 포항 고속버스 터미널 도착
10:33 다이소 학산점 방문 ==> BH 핸들 채소다 지기(대, 5천원) 구입
10:50 고속버스 터미널 정류장(209번 버스 승차)
11:15 두호동 주민센터 하차
11:20 포항집 도착 ==> 엄마한테 다이소 믹서기, 다이소 칼 갈이, 칼(목금도) 선물
12:00 중식
12:30 실내 도보
14:10 종료
14:20 인터넷 서핑
14:25 집출발(수종)
14:45 다이소 포항 두호점 방문 ==> 10런 컬러볼 도어 후크(부엌문 걸이용, 3천원), 베스트 봉 이불 집게 2P(2개, 커튼 고정용, 2천원)
		, 다용도 케이스 2P(건전지 보관 검용, 2천원), 네모셀 알카리인 건전지 LR03(AAA) 4개앱(천원), 걸이형 스텐 집게(4P, 천원)
		, 스텐S후크8P(5.8 cm, 천원), 변기 커버 손잡이 2P(서울, 포항집 변기에 설치, 천원), 롯데햄 키스틱(60g, 2개, 2천원, 수종) 구입
15:00 창포 시장 방문
15:30 GS 슈퍼 방문 ==> 오이 구입하려다고 포기(5개: 3천 2백원)
16:00 귀가
16:20 부엌문에 도어 후크 달기(조리 도구 설치), 화장실 변기 커버 손잡이 설치, 싱크대 밑에 칼 집 설치
16:50 종료
18:00 석식
18:30 도보(영일대 해수욕장)
19:50 종료
20;30 집출발
21:00 다이소 포항 두호점 방문 ==> C타입 메틸 이어폰(with SK m&service, 5천원, 소리 조절 안됨), 향균 위생 칼집(3천원) 
		, 스텐S후크8P(5.8 cm, 천원), 걸이형 스텐 집게(4P, 천원) 구입
21:10 귀가
21:15 화장실문에 도어 후크 달기, 싱크대 밑에 칼집 설치
21:30 칼 갈기(3자루 갈기); 마음에 듬 ==> 오른쪽 중지 칼에 베임(피 약간 남): 고무 장갑끼도 칼 갈이 할 것
22:50 종료
23:10 샤워(수종)
23:30 취침(수종)
==============================================================================================================

- 칼 가는 법, 칼 연마 법, 비밀 공개 영상, 숫돌 칼 연마법[캐삼. Food & Cooking]]
https://youtu.be/cZYzw8ktf60
1. 천방 숫돌

- 전문가가 알려주는 쉽고 정확한 숫돌로 칼 가는 법 소개! [정성쿡TV 외식 창업의 모든것]
https://youtu.be/lZyhW2dkLIg

- [장사로 돈버는 방법 공개] 눈감고도 할수있는 칼가는 법! [거제도 수아아빠TV_생선회 sashimi 이야기]
https://youtu.be/OI7PE8n3afo
==============================================================================================================

- 칼 가는 법
1.우선 숫돌을 알맞은 것을 구입하십시오(800과 1000 정도를 추천합니다.)
2. 물에 숫돌을 충분히 3~5분 정도 담궈주십시오. 숫돌이 물을 빨아드립니다.
3.그리고 숫돌 고정대가 있으시면 고정대에 고정하시고 아니면 걸레나 수건 등으로 숫돌이 안 움직이도록 고정해주십시오.
4.숫돌에 물이 조금씩 흐르게 하거나 자주 손으로 물을 뿌려 주십시오. 가는 동안 계속 물을 적셔주세요.
5.칼을 용도에 맞게 가는 방법을 선택해주십시오. (옥갈기 벗갈기) 그리고 칼의 모양에 따라 칼날과 숫돌과의    
각도를 결정(무조건 각도가 몇도다 하는 방법은 틀린 것입니다. 칼마다 날이 선 각도가 다 다릅니다)
6. 오른 손에 칼을 쥐고 칼날이 본인의 몸쪽으로 향하게 한 다음 밀면서 힘을 주십시오[★]. 잡아 당길 때는 숫돌에
안 닿고 돌아오는 느낌으로 밀면서 힘을 주십시오. 칼날 위치를 옮겨가며 밀면서 계속 갈아줍니다.
1~3분 정도 무뎌진 정도나 칼날의 강도에 따라 더 오래(10분이상) 갈아주셔도 됩니다. 800기준으로 걸리는 시간입니다.
7. 반대로 뒤집어 칼날의 모양 용도에 따라 다시 각도를 숫돌에 밀착하거나 각도를 조금 또는 많이 결정합니다.
칼등이 본인의 몸 쪽으로 향하게 한 칼을 잡아 당길 때 힘들 주며 갈아냅니다.밀 때는 숫돌에 안 닿게 하는
느낌으로 잡아 당길 때만 힘을 줍니다. 힘을 주는 요령이 가장 어렵죠^^
8. 도마에 대고 밀어서 안 밀려야 날이 제대로 섰다고 봄(칼 날을 손톱위에 얹어놓고 살짝 밀었을때 미끌어지면 덜 갈린 것)
==> 고무장갑 사용, 다이아몬드 숫돌 구입 검토
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.17(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
07:00 기상
07;35 조식
08:00 도보(영일대 해수욕장)
08:30 종료
09:10 인터넷 서핑
10:10 TV 점검: 현대 HCN에 전화할 것
10:45 종료
12:08 중식 
12:30 실내 도보
14:00 종료 ==> 혈당 385(오전에 쑥떡 2개 먹음)
14:10 인터넷 서핑
14:30 집출발(수종)
14:45 농협 방문 ==> 수종 농협ATM에서 통장으로 13만원 입금
15:00 다이소 포항 두호점 방문 ==> 일상 닥터 가정 상비 구급 키트(5천원), 에이스 밴드 에스 표준형 55매(천원), 케이블 정리선 6P/SET(천원)
		, 말랑이 손목 쿠션(2000, 2천원, 수종), 크리넥스 수앤수 실키 소프트 라이언 캡형(80 매입, 2천원, 수종): 구입
15:35 귀가
15:40 인터넷 서핑
17:50 석식
18:16 집출발(김치 1통, 오이 무침용 양념장, T셔츠(5벌), 바지(2벌))
18:26 두호동 주민센터정류장(207번 버스 탑승)
18:40 죽도 파출소 정류장 도착
19:10 포항 출발
23:07 서울 강남터미널 도착
23:17 고속 터미널 정류장(643번 버스 탑승)
23:47 남부초 정류장 하차
23:53 귀가
24:10 청소
24:50 인터넷 서핑
03:00 취침
============================================================================================================== 

- 건전지 새것과 헌것 구분하는 초간단 방법
https://youtu.be/r6nFUY_2Ys0
1, 다 쓴 밧데리: 딱딱한 고체 상태(따딱 소리가 남), 새 밧데리: 액체(딱 소리가 남)
==============================================================================================================
 
- 이스트라 쿠카 TV 검토
- 이스트라 AN433UHD SMART THE ULTRA [스탠드], 가격: 302,720원
http://www.enuri.com/detail.jsp?modelno=74186664
-------------------------------------------------------------------------------------------------------------------------

- 이스트라 쿠카 TV 구입[2021.11.15(월)]
1. 이스트라 쿠카 UC431UHD 더 스마트 AI PRO [스탠드], 가격: 377,540원  ==> 851,400원[ 22.04.17(일) 현재]
http://www.enuri.com/detail.jsp?modelno=44584804
http://www.tmon.co.kr/deal/3413008642?opt_deal_srl=3413046858&utm_source=enuri&utm_medium=affiliate&utm_term=
205013_%EC%97%90%EB%88%84%EB%A6%ACDB&utm_content=&utm_campaign=%EC%97%90%EB%88%84%EB%A6%AC_DB
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.18(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 코로나19 사회적 거리두기 해제(09시, 마스크 착용은 제외)

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.19(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:20 ==> DB손보Prj 가 오픈(18시, DB금융센터)  ==> 야근(00:45 퇴근), 퇴근 후 오이 무침(20:40, 오이 2천원 5개(총 20개)
							, 마늘(2천원))

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- 미래에셋 IRP 투자 상담(15시, 콜센타로 내가 전화함)
1. 예금, SK 리츠, SMP 500(분할 매수)
 1) IRP 900만원 세금 공제 가능
==============================================================================================================

- 다이소 휴대용 선풍기 | 가성비 휴대용 선풍기 단돈 5000원에 다이소에서 만나는 행복
https://bondablog.com/blog/
==============================================================================================================

- Java 입문 수업 (생활코딩)
https://www.youtube.com/watch?v=jdTsJzXmgU0&list=PLuHgQVnccGMCeAy-2-llhw3nWoQKUvQck
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.20(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- ArrayList와 HashMap을 이용한 중복키 허용 방법
https://jfbta.tistory.com/95
==============================================================================================================

- 무릎아픈 3인, 3주간 근육운동 결과는? (KBS 20211103 방송) [KBS 생로병사의 비밀]
https://youtu.be/YZic9wEnqVg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.21(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
- IRP 계좌개설 쉽게 따라하기 (ft.상품매수, 한도변경) [할미 언니]
https://youtu.be/Nch1hMk09b0

- [ETF마스터] KINDEX, TIGER 미국S&P500 ETF 매일 1주씩 매수했을 때 수익률이 더 높은 것은? 
https://youtu.be/-_4Ya2d0-Gk
==============================================================================================================
 
- SK리츠 분석. 본격적으로 분기마다 배당주는 시대 도래!!
https://youtu.be/AuajZRMxyKw
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.22(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 서울 아리수 수도물 자가검침(23시, 집): 2022년 04월지침[22.04.22(금)]: 0631 / 사용량 2 ㎥

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- jQuery의 each() 메서드 알아보기
https://webclub.tistory.com/m/455

// 객체을 선언[배얼]
var arr= [
    {title : '다음', url : 'http://daum.net'},
    {title : '네이버', url : 'http://naver.com'}
];

// $.each() 메서드의 첫번째 매겨변수로 위에서 선언한 배열은 전달
$.each(arr, function (index, item) {
    // 두 번째 매개변수로는 콜백함수인데 콜백함수의 매개변수 중
    // 첫 번째 index는 배열의 인덱스 또는 객체의 키를 의미하고
    // 두 번째 매개 변수 item은 해당 인덱스나 키가 가진 값을 의미합니다.

    var result = '';
    result += index +' : ' + item.title + ', ' + item.url;
    console.log(result);
    // 0 : 다음, http://daum.net
    // 1 : 네이버, http://naver.com
})
------------------------------------------------------------------------------------------------------------------------------

// 객체를 선언[Object)
var obj = {
    daum: 'http://daum.net',
    naver: 'http://naver.com'
};

// $.each() 메서드의 첫번째 매겨변수로 위에서 선언한 객체를 전달
$.each(obj, function (index, item) {
    // 객체를 전달받으면 index는 객체의 key(property)를 가리키고
    // item은 키의 값을 가져옵니다.

    var result = '';
    result += index + ' : ' + item;
    console.log(result);

    // daum : http://daum.net
    // naver : http://naver.com
})
==============================================================================================================

- 블로그로 월 천만원 버는 현실적인 방법 (리남 1부) [신사임당]
https://youtu.be/RV_TAVl6-4o
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
09:10 집출발(자전거)
09:25 서울 가정의학과 의원 방문: 혈당 181
09:30 당뇨 상담 ==> 당화혈색소 검사, 오줌 검사(총 병원비: 27,100원)
09:40 종료
09:50 철물점(남구로시장) 방문 ==> 숯돌(4천원) 구입
10:05 다이소 구로시장점 방문 ==> 청풍 블루와풍 공기(약11 cm, 자전거 타다 깨짐, 천원), 내츄럴 직사각(10 L)(손잡이형, 반찬통, 3천원) 구입
10:20 자연을 사랑하는 형제들(남구로 시장 내) 방문 ==> 양파(한 봉지, 2천5백 원), 당근(2봉지, 2천원), 마늘(한 봉지, 3천원) 구입
11:00 귀가
11:10 집출발(자전거)
11:15 다이소 보라매점 방문 ==> 청풍 블루와풍 공기(약11 cm, 천원), 컬러 패턴 공기(약12 cm, 밥 그릇, 2천원) 구입
11:40 귀가
12:00 중식
12:30 실내 도보
13:55 종료
14:30 인터넷 서핑  
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
20:30 귀가 
21:00 인터넷 서핑
23:00 취침
==============================================================================================================

- 구글 지도(유럽)
https://www.google.co.kr/maps/@49.3514568,21.6541986,5z?hl=ko
- 구글 지도(미국)
https://www.google.co.kr/maps/@37.9389899,-105.2716574,5.5z?hl=ko
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
09:30 인터넷 서핑 ==> IRP 투자 분석
12:00 중식
12:30 실내 도보
13:55 종료 
14:00 인터넷 서핑 ==> IRP 투자 분석
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집) 
19:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 67.7kg ==> BMI: 22.60[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================

- 미래에셋 증권
https://www.miraeasset.com
1. 투자정보 ==> m.자문통
==============================================================================================================

- [풀버전] 디지털 자산 투자를 위해 반드시 알아야 할 블록 체인 생태계ㅣ박성준 교수(암호 화폐) [카이로스북클럽]
https://youtu.be/MDQdRMA5j60
=============================================================================================================

- 이스트라 쿠카 TV 구입(포항집)
- 이스트라 AN433UHD SMART THE ULTRA [스탠드], 가격: 306,240원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2242363267
http://www.enuri.com/detail.jsp?modelno=74186664
-------------------------------------------------------------------------------------------------------------------------

- 삼성파브 LCD TV 모니터 40인치
https://www.hellomarket.com/item/170997695 
1. 크기: 가로 110, 높이 74cm(포항 집 TV: 큰누나가 엄마에게 선물한 TV)
==============================================================================================================

- 이스트라 쿠카 TV 구입[2021.11.15(월): 서울집]
1. 이스트라 쿠카 UC431UHD 더 스마트 AI PRO [스탠드], 가격: 377,540원  ==> 851,400원[ 22.04.17(일) 현재]
http://www.enuri.com/detail.jsp?modelno=44584804
http://www.tmon.co.kr/deal/3413008642?opt_deal_srl=3413046858&utm_source=enuri&utm_medium=affiliate&utm_term=
205013_%EC%97%90%EB%88%84%EB%A6%ACDB&utm_content=&utm_campaign=%EC%97%90%EB%88%84%EB%A6%AC_DB
1. 크기: 95 * 56cm
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.04.25(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.26(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:20 ==> 주식의 정석 96강 시청 종료(14번 시청 완료), 주식의 정석 1강 시청

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================

- [미래에셋증권] 권리 단수주대금 입금
010-30**-**98-7
A096770 SK이노베이션 보통주 209,385원 배당단수주대금 입금 되었습니다.
==============================================================================================================

- 서울 가정의학과 의원 진료 결과 문자
1. 비타민D 29.39 (정상>30)로 부족합니다. 
2. 당화혈색소 6.9 (평균당 151)로 경계입니다. 
3. 미세 단백뇨 66.1 (정상<30)로 높습니다. 콩팥보호약 필요합니다. 

- 단백뇨가 조금만 나와도 경각심을 가져야 하는 이유[기역]
https://youtu.be/BMi7R8kk3Kc
A1: <30, A2: 30 ~ 300, A3: >300

- 당뇨병성 신증, 초기에 잡아야 한다.[기역]
https://youtu.be/nKTlHJncIvo

- 건강한 소변관리를 위한 3가지 생활습관 | 요당, 단백뇨가 덜 나오는 꿀팁 [당뇨스쿨]
https://youtu.be/NT6C20H-mM0
==============================================================================================================

- 당뇨와 단백뇨 l 당뇨 환자에서 알부민뇨가 확진된 경우 l 닥터딩요
https://youtu.be/3CdySgKeGpo
1. 당백뇨가 나왔다는 게 이미 콩팥이 거름망이 벌어졌다는 것, 거름망을 다시 회복시키는 치료는 없음(그래서 더 안 벌이지게 하는 
것이 최선의 치료)
2. 조치: 철저한 혈당 관리
 1) 당화혈 색소 6.5 미만
 2) 식후 혈당 180 미만
 3) 공복 혈당 130 미만
----------------------------------------------------------------------------------------------------------------------------

- 당뇨 환자의 단백뇨 관리 총정리
1. 매일 매번 소변 거품을 확인한다.
2. 소변검사/피검사를 자주한다.
3. 혈압/혈당 관리를 철저히 한다.
4. 혈압약(ACEI/ARB)를 잘 복용한다.
5. (사구체여과율 30까지는) 답백질 섭취를 제한할 필요는 없다.
==============================================================================================================

- 01.설계산출물 작성 ==> 완료[♥♡]  
A. 대내인터페이스 목록(전문 8개)
1. /TMM-2021-0_12 인터페이스설계서-16자동차)_(MMTI0310_x1.0.15x
B. 프로그램(서비스) 목록대장(프로그램 3개)
1. /TMM-2021-D_27_프로그램(서비스)명제서-42.연계 설계 조회(자동차)_v1, 3.xlsx
PTMMML101: 연계-설계 조회(자동차) ==> 01 자동차설계조회(MMTI0310)
2. /TMM-2021-D_27_프로그램(서비스)명세서~43.연계_주행거리사진 조회(자동차)_v1.xlsx 
PTMMML102:연계-주행거리사진 조회 ==> 02. 채널이미지정보관리(MATI0547) 
3. /TMM-2021-D_27_프로그램(서비스)명세서-43.연계_보험로수납(자동차)_v1.3.xlsx 
PTMMML202: 연계 보험료수납
==> 11. 실시간출금(AACT0O64)
ifllog isDebugEnabled(1)
==> 12. 카드 승인/취소(AACT0015) 
==> 13 카드 수납 확정(AACT0065)
==> 14. 실시간이체 개좌확인 - 실시간 계좌이체(AACT0023)
==> 06 채널가계정조회(MMTI0312) 
==> 05. 채널자필서명저장(MMTI0311)
==============================================================================================================

- 02. 개발 산출물 작성(로컬PC)  ==> 완료[♥♡]
1/1. 자동차설계 조회
1. 개발-자동차,postman. collection.ison 
2. DINLE 전문기술(채널HUB)_인터페이스설계서_미러링 V0.97.xlsx
==============================================================================================================

- 전문테스트(04.26) ■■■ 
11800490N0401133[계약확정] --> 영수확정(가계정) 테스트(TEST서버에서) ==> ESB에서 에러 발생(추후 다시결제 후 성공)
1, 산출보험료: 918,940원 ==> 초회보험료: 725 490원, 분납 보험료: 193,450원
2. 보험료영수(새창) ==> 영수대상액: 725,490원 차액: 551,070원, 영수액(가계정): 174,420원
==> 결제액(551,070원) = 초회보험료(725,490원) - 가계정(174,420원)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.27(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 백팩 메고 출근(06시, 쓰레기), 백팩 메고 퇴근(18시, 우산 2개)

- DB손보 Prj[★]
- 인수인계(14:20, 내 자리)
1. 이중훈 부장, 전승진 부장에게 인수인계 함
==============================================================================================================
 
- DB손보 Prj 총 정리(9시, DB금융센터)
1. 문서 정리 및 화면 캡처
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.28(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 22:00 ==> DB손보Prj Grand 오픈(18시, DB금융센터[야근])

- DB손보 Prj[★]
- DB손보 소스 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.04.29(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 14:00 ~ 17:00 ==> DB손보 철수(18시, DB금융센터)

- DB손보 Prj 철수
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림1교[반환점] => 도림교 => 신림1교[반환점2] => 도림교 ==> 서원도보교 => 도림 도보교 => 집)
		: 비 조금 옴(우산 씀)
08:45 귀가
09:00 인터넷 서핑
11:20 중식
12:00 집출발
12:05 남서울 중학교 정류장 도착
12:08 643번 버스 탑승
13:40 DB손보 18층 도착: 출근
13:55 이호준 부장 면담: 회의실(커피)
14:20 인수인계 완료 
14:38 철수
15:20 도곡초 정류장 도착
15:24 4613번 버스 탑승
16:24 패션문화의 거리 정류장 도착
16:30 귀가
18:00 석식
18:30 실내도보
19:50 종료   
20:00 인터넷 서핑 
23:00 취침
==============================================================================================================
 
- 카카오 통합 로그인 비밀번호 변경
https://accounts.kakao.com/weblogin/account --> tamario/asas1@12!!
==============================================================================================================

- 헌혈 예약
https://www.bloodinfo.net/blood_reserve.do
■ 일시 : 2022-04-30 10:30
■ 예약헌혈종류 : 전혈
■ 장소 : 헌혈의집 구로디지털단지역센터
■ 헌혈 지원시에는 신분증 지참 부탁드립니다.
1. 전자문진표 작성
https://www.bloodinfo.net/emi2/emi4.do?lang=ko
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.04.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:40 ==> 

- 주말
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
08:50 집출발(자전거)
09:07 서울 가정의학과 의원 방문 ==> 혈당 측정: 158
09:15 당뇨 상담 ==> 당뇨 상담(당뇨약, 미세 당백뇨약 처방): 비타민D는 거부함, 2주치 약 처방 받음
		==> 혈압 측정: 116/90
09:25 종료 
09:30 래미안 나나 약국 방문 ==> 조제(당뇨약, 미세 당백뇨약: 2주치[5,800원])
10:00 다이소 구로시장점 방문 ==> 접이식 바구니(39,8 * 30 * 14.5cm, 3천원): 자전거 뒷자리 짐 싣기용
10:25 헌혈의집 구로디지털 단지역센터 방문
  1. 사전 상담 및 검사
   1) 혈액 검사(헤모글로빈 정상)
   2) 혈압 측정: 127/ 81(정상)
  2. 헌혈 
   1) 종류: 전혈 320mL
  3. 헌혈 사은품
   1) 음료수(오렌지), 롯데 ZEC(150g)
   2) 2022년 헌혈자 기념품: 세븐일레븐 또는 emart24 편의점 교환권(2장: 5천원) 총 만원
11:06 종료
11:10 야채 가게(진흥마트 앞) 방문 ==> 오이(2천원: 5개[5봉자]): 25개 구입
11:20 현아트빌 도착 ==> 자전거 뒷자리 짐 싣기용 바구니 설치(약해 보임)
11:25 귀가
12:00 중식 ==> 식후 처음으로 당뇨약, 미세 당백뇨약 먹음
12:30 실내 도보
13:55 종료
14:20 집출발(자전거)
14:30 다이소 신림3호점 방문
15:10 소녀폰 대리점 방문 ==> 갤럭시 S8 공기계 판매(소녀폰 신림역 7번 출구: 한서빌딩 302호), 만원(액정 화면이 변질되었다고 함)
		--> 현재 사용하고 있는 갤럭시 노트9는 10만원에 판매 가능하다고 함
15:30 다이소 보라매점 방문==> 청풍 블루와풍 공기(약11 cm, 밥 그릇, 3개, 3천원), 오릭스 핸드로션(350ml, 프로젝트용, 3천원) 구입
16:25 귀가
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
19:50 종료  
20:30 귀가
21:00 인터넷 서핑 ==>  가계부 월말 결산
23:00 취침
============================================================================================================== 

- 폰베이
http://www.phonemoa.co.kr/nhc/shop/list.php?ca_id=10
1. 영등포본점(010-5338-2265): 서울특별시 영등포구 양평로21가길 19 선유도 우림라이온스밸리 B
2. 갤럭시노트10플러스 5G, 가격: 348,000원
---------------------------------------------------------------------------------------------------------

- 소녀폰
https://www.snphone.co.kr/page/?BCD=1&MCD=1
1. 신림역점(010-4220-2173): 서울시 관악구 신림동 1421-45번지 한서빌딩 302호
 1) 갤럭시 S8 공기계 만원에 판매(소녀폰 신림역 7번 출구: 한서빌딩 302호)
==============================================================================================================
 
01. 카카오(다음) 로그인[22.04.30(토)]
https://accounts.kakao.com/login/kakaostory --> tamario@naver.com / asas1212!!
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 