

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2022.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.11.01(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetail_02?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 당해세의 종류와 배당순위
1. 당해세: 당해세는 그 부동산 자체에 부과된 세금, 결론적으로 당해세가 상속세일 가능성이 있고, 대항력있는 임차인이 있는 경우가 아니라면 당해세를
너무 두려워 할 필요는 없습니다.다 만, 압류한 기관이 세무서이고 등기부상 상속된 부동산인 경우에는 주의할 필요가 있습니다.

- 경매부동산의 복병 당해세
https://sinilyu.tistory.com/30
1. 당해세: 당해 부동산을 소유하고 있다는 사실 자체에 근거하여 부과하는 국세와 지방세 및 그 가산금
=============================================================================================================

- 면접(16:40,  회의실)
1. 허평강 부장(69년생): 개발 기간 2년 공백(개발 능력 의심): 마음에 안듬
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.02(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 개발 3명 출근, 현업 출근

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetail_02?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 효성 PMS Prj 개발자 교육(10시, 하지연 부장)
1. 프로젝트 전반에 대한 설명
 1) 영업
 2) 상품 기획
 3) 개발(프로젝트)
=============================================================================================================

- 효성 PMS Prj 개발자 교육(13:40, 유지현 대리)
1. 프로젝트 표준 교육
=============================================================================================================

- 효성 PMS Prj 개발자 교육(17:40, 진태만)
1. 프로젝트 샘플 교육
=============================================================================================================

- HI WARE 로그인
1. bp0063912/bp0063912
=============================================================================================================

- IB SHEET Grid 문의(20시, 집)
1. 김빌리 책임 요청:  IB SHEET에서 동적 Grid 문의
https://www.ibsheet.com/service.html
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.03(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 표준 작업
=============================================================================================================

- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

 - 노트패드++(Nodepad++) 개행문자, 줄바꿈, 라인피드, 캐리지리턴을 텍스트에서 간단하게 제거하기
 https://mainia.tistory.com/6264   --> n)\r\n
=============================================================================================================

- 면접(14:40,  회의실)
1. 서상민 부장(74년생, 대구 경원고, 금오 공대):  개발 능력↑): 마음에 듬
=============================================================================================================

- WBS 회의(15시  회의실)
1. 이상영 팀장, 하지연 부장, 김빌리 책임
 1) 추가 요구 사항, 개선 사항 논의
=============================================================================================================

- 면접(16:20,  회의실)
1. 김동현 차장(90년생, 광양고, 한양대):  웹 개발 능력 약함): 김빌리 책임이 마음에 들어 함
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.04(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 표준 작업
=============================================================================================================

- 개발자 교육(09시,  회의실)
1. 정우진 과장, 양건우 대리, 김성철 대리, 심용보 사원
==> 커피(아아, 대박 커피: 6천 5백원[내가 쏨])
=============================================================================================================

- 법원 4별관 경매 2계 뱡문(13시, 현아트빌 404호)
1. 압류 금액 열람 신청(수수료 500원): A4 자료 많아서 찾기 힘들었음
 1) 송파구 압류 문건(자동차세: 100만원, 건강 보험료: 10만원 미만): 해당세에 해당 안되는 것으로 판단됨
 2) 강동구 압류 건은 못 찾음
============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.11.05(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★] 
04:00 기상
04:35 조식
05:20 집출발(백팩: 작은 가방)
05:30 5413번 버스 탑승(남서울중 정류장)
06:06 고속버스터미널 하차  
06:40 포항행 고속버스 출발
10:45 포항 고속버스 터미널 도착
10:50 다이소 포항 해도점 방문 ==> 단색 손목 조임형 장갑(2000, 2천원) 구입
10:56 고속버스 터미널 정류장(209번 승차)
11:00 두호동 주민센터 정류장  
11:06 포항집 도착 
12:00 중식
12:30 도보(집 => 창포사거리 => 마장지 => 작은굴 우회 도로 => 포항 철길숲 => 우창동 주민센터 => 집)
14:00 다이소 포항 두호점 방문 ==> 코듀로이 두꺼운 방석(약 40x40 cm: 2개, 만원) 구입
14:30 귀가
14:35 운동화 세탁(엄마가 해줌)
14:40 인터넷 서핑
15:50 다이소 포항 두호점 방문 ==> 동파 방지용 파이프 보온재(두께10 mm*내경30 mm: 3개, 3천원) 구입
16:00 귀가
16:10 베란다에 바닥 케이블에 보온재 3개 설치
16:30 종료
17:30 석식 
17:55 집출발(수종)
18:20 꾀꼬리 미용실 도착(큰누나)
18:30 이발(수종, 나)
19:05 미용실 출발(수종, 도보)
19:30 귀가
19:40 인터넷 서핑
22:00 취침(거실): 피곤해서 잠듬
=============================================================================================================
 
 - 콘센트 교체 방법 너~무 간단하쥬?? [백가이버 Baek gyver]
 https://youtu.be/mDZM-3zPx04
 =============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 202211.06(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>

- 주말2[★]
03:50 기상
04:00 염색, 샤워 ==> 체중: 70.5kg ==> BMI: 24.22[표준 체중] --> 심각
04:30 취침
07:38 기상
07:50 조식
08:20 도보(영일대 해수욕장)
09:50 귀가
10:00 TV 시청
11:00 큰누나네 도착(매형, 령경)
11:07 큰누나 차(매형, 령경, 수종)
12:04 도리 마을(경북 경주시 서면 도리)도착 ==> 단풍 구경(길이 좁고 별로 볼 것 없음)
13:01 부용(중국집) 도착 ==> 중식(짜장면[별로 맛이 없음], 탕수육[매형이 쏨])
14:23 운곡 서원 도착 => 은행 나무(330년) 장관
14:53 운곡 서원 출발(큰누나 차)
15:35 귀가
15:40 수종 샤워 시킴
16:00 TV 시청
17:25 석식 
18:01 집출발(수종이 카트에 고구마, 고기 가지고 옴)
18:51 포한 터 도착 
18:10 집출발(반찬 4통)
18:50 포항 고속버스 터미널 도착
19:10 포항 출발
23:13 서울 강남터미널 도착
23:24 고속 터미널 정류장(643번 버스 탑승)
23:58 남부초 정류장 하차
23:04 귀가
24:20 청소
01:30 취침
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.07(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 표준 작업 소스 반영(14:25)
1. SVN에 등록
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 사양설명회 일정 공지(09시, 하지연 부장 주관, 줌): 연기됨

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- pms-global.js 참조(이클립스에서)
1. 프로젝트 우클릭 > properties > javascript > include path > source 에서 pms-global.js 추가
추가 후 초기 validation이 좀 오래 걸릴 수 있습니다.  ==> 적용 안됨
-------------------------------------------------------------------------------------------------------------------------------

- [JAVASCRIPT/JQUERY] eclipse 자바스크립트 자동 완성 플러그인(tern)
https://madinthe90.tistory.com/21
1. tnspms 프로젝트 [우클릭] >  Proerties: 클릭 ==> Proerties for tnspms(새창)
 1) javaScript > Term > Script Paths ==> Script Paths 새창)
  가. Add File: 클릭 --> pms-global.js: 선택 & 추가 ==> Apply and Close: 클릭
=============================================================================================================

- [자바 웹을 다루는 기술] 30.7 EXERD 이용해서 이미지 정보 저장 테이블 만들기(eXERD 사용법)
https://youtu.be/b3TrUAD2PlU
=============================================================================================================

- 초간편 자바1 - 준비운동(인텔리제이 설치 및 첫 프로그램 만들어보기) (초간단 자바)
https://www.youtube.com/watch?v=4Mug4AQ8tyY&list=PLxrznogUyUm3rBNuyAQXw979NoHh91W2y

- [01] 인텔리제이 기초 - 처음 만난 인텔리제이 / 프로젝트와 모듈 이해하기(개발라디오 PSD)
https://www.youtube.com/watch?v=nCwUc57Clsk&list=PLdLE3qChyyU6E0FYbZXkQAb25uPI6lWad

- 인텔리J 단축키 잘 쓰는 방법(백기선)

https://www.youtube.com/watch?v=0D-YYVfUxFM

- 생산성을 높여주는 Intellij 꿀 명령어 정리(성지채널)
https://www.youtube.com/watch?v=0HQkGMJOxwo

- [IntelliJ] Intellij 학생 인증, 무료 설치 방법
https://goddaehee.tistory.com/215
=============================================================================================================

- 솔리드 호텔식 매트리스커버 모음 워싱 마이크로 방수, 가격: 42,300원
http://itempage3.auction.co.kr/DetailView.aspx?itemno=C331456245
=============================================================================================================

- 11. 개요/추진계획
localhost:9090/Anyfive_E-Brain/prjct/exec/mst/SumryPrtnPlan/viewList

- 12. 추진계획(팝업)
localhost:9090/Anyfive_E-Brain/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=761836ZLPE3ECD8320&processStatus=B1
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.09(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 경매 준비(13시, 신한은행 구로디지털금융센터 방문: 수표 발행[2천 5백]), 김동현 과장 첫 출근(공통)

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 11. 개요/추진계획
localhost:9090/Anyfive_E-Brain/prjct/exec/mst/SumryPrtnPlan/viewList

- 12. 추진계획(팝업)
localhost:9090/Anyfive_E-Brain/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=761836ZLPE3ECD8320&processStatus=B1
=============================================================================================================

- 김빌리 책임 노트북 IP 수소 변경
# 효성 PMS Prj 사업장(대륭1차 12층) 개발 DB(김빌리 책임 노트북) 변경[22.11.09, by 진태만]
    url: "jdbc:sqlserver://192.168.0.7:1433;SelectMethod=cursor;DatabaseName=HanwhaAM_HPMS"
    username: "HanwhaAM_HPMS"
    password: "anyfive1@"
=============================================================================================================

- exERD 사용법
1. 15. 프로젝트_변경요청(TB_PJT_CHG_REQ 테이블): 마우스 우 클릭 ==> 특성 ==> 특성(새창): DDL Tab에서
 1) 공통 Tab: 체크 없음
 2) 테이블 Tab: 테이블 생성 체크
 3) 제약사항 Tab: PK 생성 체크
 4) 인덱스 Tab: PK 인덱스 생성 체크
 5) 트리거 Tab: 트리거 생성 체크, 트리거 삭제 체크
 6) 코멘트 Tab: 코멘트 생성(코멘트가 없을 경우 논리 이름 사용) 체크
=============================================================================================================

- 효성 PMS Prj 개발자 교육(15:40, 유지현 대리)
1. 표준 준수 사항 교육
=============================================================================================================

- WBS 회의(15:50  회의실)
1. 이상영 팀장, 하지연 부장, 김빌리 책임
 1) 추가 요구 사항, 개선 사항 논의
=============================================================================================================

- jq GRID 수정 처리
<div any-jqgrid id="ResrceDstbList" fullHeight></div>
<script ${AI}>
var footerNum = 9;
this.addGroupHeader({start:"dstbPlan01" ,end:"dstbPlan025" ,label:"<n:message code="lbl.researcher" text="연구원" escape="js" />" });
this.setOption({ rownumbers:true, cellEdit:true, multiselect:true});   	//  cellEdit: Grid 수정 가능
</script>
=============================================================================================================

- 토스뱅크에서 경매 비용 신한은행 계좌로 송금	
1. 토스뱅크 파킹 통장 예금액: 44,370,147원 ==> 2천 5백만원 신한은행 계좌로 송금(07:45, 토스뱅크 인증서 때문에 집에 와서 처리함)
=============================================================================================================

- 크롬에서 console 로그 안 나옴
1  /Main.form.jsp에서 
<%@ page contentType="text/html; charset=utf-8" pageEncoding="UTF-8" %>
<%@ include file="/WEB-INF/views/common/include/PageHeader.jspf" %>

<script type="text/javascript" src="<n:url/>/common/main/Main.Menu.js"></script>	 <!--// js 설정 ■■■ //-->

2. Main.Menu.js에서
<script type="text/javascript">
 function load(menuKnd, callback)
{
	console.log("\n\n\n\n [@_T] ■■■ [/Main.Menu.jsp]  [load()] ==> [T_01] [전체 목록 조회(메뉴)] ■■■");

	o.ds.init(); 
}
</select>
--------------------------------------------------------------------------------------------------------------------

1. 현상:
 DevTools failed to load source map: Could not load content for chrome-extension://gighmmpiobklfepjocnamgkkbiglidom
 /browser-polyfill.js.map: System error: net::ERR_FILE_NOT_FOUND 
extension://gighmmpiobklfepjocnamgkkbiglidom/browser-polyfill.js.map 파일을 찾을 수 없다는 것.
2. 원인: 구글 확장 프로그램 중에 하나에서 문제가 있는 것 같아 확장 프로그램을 하나씩 테스트 해보았다.
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.11.10(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 14:30 ~ 17:30 ==> 법원 경매 참여(10시, 현아트빌 404호 2천 8천 만원에 낙찰 받음), 출근(14:40 ~ )

- 법원 경매 참여[★] 
06:30 기상
07:00 조식
07:20 실내보도
08:25 집출발(자전거, 가죽 크로스백) ==> 보라매역 => 신대방 삼거리역 => 장승배기역 => 노량진역 => 노들역 => 동작역 => 반포천 1교
		 => 가톨릭대학교 서울성모병원 => 삼호 가든 사거리 => 서울 회생 법원 4별관
09:28 4별관 앞 도착
09:40 4별관 201호 도착(사람 별로 없음): 법원 게시판 글씨가 작아서 못 봄(신문[매일 옥션]에 경매 물건 나와 있음)
10:00 경매 시작
10:25 입찰 신청서 작성(칸 막이에서): 사건번호: 2021 타경 110333번 현아트빌 404호
		 --> 입찰 가격: 2천 8천만원, 보증 금액: 2천 5백만원으로 작성
10:35 종료
11:12 개찰 시작(사람들이 201호 가득참)
12:05 2천 8천만원에 낙찰 받음(혼자 입찰), 보증 금액 추가 납입금 84만원 송금으로 돌려 받음
12:11 종료
12:25 중식(왕 김밥(2,550원): GS25 서초 반포점)
12:35 도보(법원 근처)
13:00 종료
13:01 상계 신청서 작성 후 제출(2번에서 작성: 경매 2계에 전달 예정)
12:11 법원 출발(자전거)
14:40 귀사(대륭포스트 타워1차 12층 202호): 1시간 반 걸림
=============================================================================================================

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 03. 개요/추진계획
http://localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewList
=============================================================================================================

- [Java] 날짜(Date, Calendar) 계산 예제 총 정리(개발시 유용한 메소드 모음)
https://ddolcat.tistory.com/536

- [Java] 자바 날짜 더하고 빼는 계산 방법 알아보기.
https://seeminglyjs.tistory.com/379

- [Java] 특정 날짜의 요일 구하기 (숫자, 영문, 한글)
https://hianna.tistory.com/610

- [Java] 두 날짜 사이에 주말 제외한 평일 일수 구하기
https://donggu1105.tistory.com/213
=============================================================================================================

- 서울 자전거 따릉이
https://www.bikeseoul.com, tamario2, as**1212!
 =============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.11(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 김성철 대리 코로나 확진, 심용보 사원 장염으로 결근

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- dhx_security 에러 발생
1. /dhtmlxgantt.js 파일에서 에러 발생
 load.js:144 Uncaught TypeError: Cannot read properties of null (reading 'dhx_security')
=============================================================================================================

- 전세 사기 유형별 정리, 예방 그리고 대처법 1부[설마 안정일 경매T]
https://youtu.be/pKOa7IWKdOY

 - 20년 경매 전문가가 알려주는 깡통전세 사기 예방법과 사후 대처법[설마 안정일 경매T]
1/ https://youtu.be/aiv5BGsAwTY
 =============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.12(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
04:35 조식
05:00 조식(컵라면, 고구마)
05:10 실내 도보
06:30 종료
07:10 집출발(자전거, 상의 비옷) => 신림역 => 사당역 => 이수역 => 내방역 => 서리풀 터널 => 서초역 => 교대역 ==> 강남역 => 선릉역
08:22 누네안과 병원 도착
08:25 15층 도착 ==> 접수, 시력 검사(오른쪽 눈: 0.9, 왼쪽 눈: 0.8)
08:35 13층 망막 센터 도착 ==> 안약 투여, 3가지 안과 검사 
09:30 진료(망막 상태 양호하다고 함, 백내장 증상이 약간 있다고 함)
09:20 수납(52,900원) ==> 예약(22년 03월 11일(토) 08:40)
09:25 종료
09:30 안과 집출발(자전거) ==> 르네상스호텔 사거리 => 경복 아파트 사거리 => 언주동역 => 학동역=> 학동역 => 강남을지병원 사거리
10:14 신사동 도착
11:10 중식(김밥,  껌: 압구정 화인점 편의점)
12:40 도보(신사동 주변) 
12:45 종료
12:50 신사중학교 정류장(휴식)
14:03 아우어 베이커리 가로수길점 도착 ==> 후남, 문정 만남 
14:10 커피, 빵 구입(29,300원: 내가 쏨) ==> 대화
16:50 종료
16:54 몽글몽글 카레집 도착 ==> 비옴
17:02 석식(비건 카레, 44,000원: 내가 쏨)
17:25 종료(비 많이 옴)
17:45 신사역 도착 ==> 후남, 문정과 헤어짐
17:46 신사동 출발(자전거 비옴) ==> 길 잃어서 한강공원 찾으려고 30분 동안 헤멤
16:15 신잠원나들목 => 한강공원 => 잠수료 => 반포 한강 공원 => 동작대교 => 한강대교 => 노들역
		--> 인도에서 속도 내어 달리다가 여자 피한다고 핸들 꺽다가 젖은 낙엽에 미끄러짐: 오른쪽 무릎, 팔꿈치 깨져서 피남
		=> 노량진역 => 장승배기역 => 신대방삼거리역 => 당곡역 ==> 도림천
19:05 귀가
20:10 샤워(찬물(상처 때문에 아림]: 체중: 71.5kg ==> BMI: 24.74[표준 체중]) 
20:20 인터넷 서핑 
22:00 취침
==============================================================================================================

- [한정식맛집]살이 꽉찬 암꽃게 연평도간장게장 1.8kg 외 양념꽃게장(살수율 90%이상) #수라예찬, 가격: 3만원(후남이가 카톡으로 보내줌)
https://www.11st.co.kr/products/2830932408
==============================================================================================================

- 황금 올리브 반반+콜라1.25L, 가격: 23,500 원(문정이가 카톡으로 보내줌)
https://gift.kakao.com/giftbox/inbox/detail/1883592137?input_channel_id=1830
https://www.11st.co.kr/products/4395148350?\
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.13(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:30 ~ 17:00 ==> 휴일 근무(07:12 ~ 17:00), 맛닭꼬 신대방점 치킨 주문(16:15)

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /PrjctMgtWBS.form.jsp
=============================================================================================================

- 50. 개요/추진계획(AS-IS)
http://localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewList
1. /SumryPrtnPlanListR.form.jsp

- 51. 추진계획(AS_IS)
localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=10000001&processStatus=30
1. /ProjectWbsMainR.form.jsp ==> 간트 차트
=============================================================================================================

- 주말2[★] 
06:23 기상
06:30 조식
07:15 출근(자전거)
07:20 도보(12층 복도)
08:35 종료
08:40 업무
11:30 중식(컵라면, 과자)
11:45 도보(도림천 => 보라매공원 ==> 도림천)
12:55 종료
13:00 업무
17:15 퇴근
17:32 맛닭꼬 신대방점 방문 ==> 치킨 테이크 아웃(갈릭 베이커: 11,900원)
17:40 귀가
17:45 노기수 과장 방문(비타 500, 과자(3봉) 사들고 옴)
17:55 석식(컵라면, 치킨, 맥주, 소주)
20:30 Anyfive_E-Brain 소스 설명
20:45 종료
20:50 Anyfive_E-Brain 소스 백업(노기수 과장 핸드폰으로 백업)
21:00 종료
21:05 노기수 과장 귀가
21:30 청소(청소기, 밀대)
21:35 인터넷 서핑
22:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.14(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 51. 추진계획(AS_IS) [팝업]
localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=10000001&processStatus=30
1. /ProjectWbsMainR.form.jsp ==> 간트 차트
=============================================================================================================

- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /ProjectWbsMainCU.form.jsp ==> 간트 차트
=============================================================================================================

- 쓸만한 4K 32인치 모니터 뭐가 좋아요? 최고 인기있는 50만원대 삼성 vs LG 모니터[IT Sub 잇섭]
https://youtu.be/g6am6lmonu8
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.15(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==> 김동현 과장 어제 결근 후 10시 출근, 일정 문제로 김빌리 책임과 충동(13:30, 회의실) => 커피샵(15:30)에 가서 커피 먹고 품

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /ProjectWbsMainCU.form.jsp ==> 간트 차트
=============================================================================================================

- 진행상태코드정리(221114) 작업
1.
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 진행상태코드정리(221114) 작업	==> 완료[♥♡]
1. 프로젝트 접수(/ProjectRecListR.form.jsp)
2. 프로젝트 관리(/PrjctMgtListR.form.jsp)
3. 과제개요 화면(/PrjctMgtRUD.form.jsp)
=============================================================================================================

- 1. WBS 코드 관리(//ProjectWbsTemplateMgtUD.jsp) 수정
1.  현상: 수정화면 데이타 못 가지고 옴
2. 좇:
@RequestMapping(value = "/read", method = RequestMethod.POST)
public String read(@RequestParam String wbsTmplatId, Model model) {
	logger.debug("\n\n\n\n [@_T] ■■■ [/ProjectWbsTemplateMgtController.java] [read()] ==> [T_01] [조회(프로젝트 WBS 템플릿 관리) ■■■ ");

	model.addAttribute(projectWbsTemplateMgtService.read(wbsTmplatId));  // 조회(프로젝트 WBS 템플릿 관리)
	
	return Views.JACKSON_VIEW;   	// Views.GRID_VIEW;에서 Views.GRID_VIEW;로 변경 ■■■
}
=============================================================================================================

- 51. WBS 계획Tab
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewTab?pjtMstId=10000001&devCl=E&devGrade=A
=============================================================================================================
 
- WBS 회의(15:50  회의실)
1. 이상영 팀장, 하지연 부장, 김빌리 책임
 1) 일정 지연에 대해서 약간 열받아서 설명함 ==> 다음주 까지 WBS 화면 보여 주기로 함
=============================================================================================================

- 낙찰 후 절차
https://webonlinestory.tistory.com/455

- 부동산경매 낙찰후 잔금납부하기[투자하는 스티브]
https://youtu.be/97fIaKPQo6Q

- 경매 셀프등기 소유권이전등기 촉탁[임팀장]
https://youtu.be/wCEwnrf8a18
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.17(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. /ProjectWbsMainCU.form.jsp ==> 간트 차트
//    private String          planBgnDe;      // 계획 시작 일자 추가[22.11.15, by 진태만]
//    private String          planEndDe;      // 계획 종료일자 추가[22.11.15, by 진태만]
private Date            planBgnDe;      // 계획 시작 일자 추가[22.11.17, by 진태만]
private Date             planEndDe;      // 계획 종료일자 추가[22.11.17, by 진태만]
=============================================================================================================

- 프로젝트 일자 타입 변경
 beginDe  ==>  pjtBgnDe: 프로젝트 시작 일자
 endDe  ==> pjtEndDe: 프로젝트 종료일자
==>  "PLAN_BGN_DE" DATE, 	// 계획 시작 일자(VARCHAR2 --> DATE)로 변경 ■■■
=============================================================================================================

- 진행상태 코드 정리 소스 반영(07:10)
1. SVN에 등록
=============================================================================================================

- 네이버 부동산(동대구)
https://new.land.naver.com/houses?ms=35.8736104,128.6246831,16&a=VL:DDDGG:JWJT:SGJT:HOJT&e=RETAIL
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.11.18(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
=============================================================================================================

- 카카오 뱅크 세이프 박스(파킹 통장) 계좡에 추가 입금
1. 연계 계좌번호 3333-12-38089543(이 계좌에 입금 후 세이프박스에 넣기 처리해야 함 
 1) 2022.11.18(금): 500만원 입금 ==> 총 2,200만원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.18(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 양건우 대리 결근, 노기수 과장 강남 쇼핑몰 프로젝트 Drop 되어 오늘 천수한다고 문자 옴(17시)

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
<!-- 등록 -->
<insert id="create">
/* [@_TM] [T_01] 등록(프로젝트 - WBS) ==> [/TbPrjctWbsMapper.xml.create()] [22.11.08, by 진태만] */
	<![CDATA[
		INSERT INTO TB_PJT_WBS_PLAN (       /* 12. 프로젝트_WBS_계획 TB */
				 , PJT_MST_ID           /* 프로젝트 마스터 ID */
				 , UPPER_WBS_PLAN_ID      /* 상위 WBS 계획 ID */
		) VALUES (
				  (SELECT TO_CHAR(SYSDATE, 'YYYYMMDD') || LPAD(TO_NUMBER(SUBSTR(NVL(MAX(WBS_PLAN_ID), '000'), -3)) + 1, 3, '0')
				  FROM TB_PJT_WBS_PLAN)         /* WBS 계획 ID */
				 , #{tbPrjctWbs.pjtMstId}                /* 프로젝트 마스터 ID */
				 , (SELECT TO_CHAR(SYSDATE, 'YYYYMMDD') || LPAD(TO_NUMBER(SUBSTR(NVL(MAX(WBS_PLAN_ID), '000'), -3)) + 1, 3, '0')
	]]>
</insert>
=============================================================================================================

- JavaScript에서 코드 한 줄로 날짜 형식 지정하기
https://www.freecodecamp.org/korean/news/how-to-format-dates-in-javascript/
------------------------------------------------------------------------------------------------------------------------

- 날짜 타입 분석_03 @@@
var prjctBgnDate_02 = prjctBgnDate.getFullYear() +""+ AddZero(prjctBgnDate.getMonth() + 1) +""+ AddZero(prjctBgnDate.getDate()); 
console.log("\n\n[@_TM] ■■■ [/PrjctWbsMainCU.form.jsp] [onBeforeLightbox()] ==> [T_42] ■■■ [프로젝트 시작 일자]"+ 
prjctBgnDate_02 );
    /**
 * 0 추가 함수
 *
 * @author 진태만
 * @return
 */
function AddZero(str) {
	if ((str + "").length == 1) {
		return "0" + str;
	}
	return str;
}
=============================================================================================================

- 커피 타입(14시,  대박 커피)
1. 커피(아메키라노[정우진 과장이 쏨]) ==> 개발자들 설계서가 부실하고 담당자가 바빠서 개발을 힘들어 한다고 함
=============================================================================================================

- 카카오 뱅크 세이프 박스(파킹 통장) 계좡에 추가 입금
1. 토스 뱅크에서 19,438,634원 출금  
2. 2022.11.18(금): 2,000만원 원 입금 ==> 총 4,200만원 
=============================================================================================================
 
- 모바일 신협 온뱅크 다운로드 및 통장 개설(핸드폰으로 처리_
http://finance.moneta.co.kr/saving/popup/detail/goodsDetailPop.jsp?prod_cd=S02841
1. 1년 예금 금리: 5.7%
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.19(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 휴일 근무(07 ~ 17:30), 정우진 과장 출근(09:40 ~ 14:00)

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. 저정, 조회 성공 ==> wbsGantt Display 성공
=============================================================================================================

- 주말[★]
04:30 기상
05:00 조식
05:30 출근(자전거)
05:45 도보(12층 복도)
07:00 종료
07:10 업무
09:40 정우진 과장 출근
11:30 중식(왕김밥: GS 편의점 구로 벤처점)
11:45 도보(도림천 => 보라매공원 ==> 도림천)
12:55 종료
13:00 업무
14:00 정우진 과장 퇴근
17:30 퇴근
17:45 귀가
17:55 석식
18:20 실내 도보
19:40 종료 
20:30 인터넷 서핑
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.20(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 휴일 근무(08:20 ~ 17:00)

- 효성 PMS Prj[★]
- 51. Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. 템플릿 유형 조회 수정 ==> 완료[♥♡]
2. Grid Head에 추가 버튼 생성 ==> 완료[♥♡]
3. links 추가
 1) 선행 ACTIVITY, 후행 ACTIVITY
wbsGanttTask.setId(tbPrjctWbs.getWbsPlanId());   // WBS 계획 ID(WBS 코드 ID)  셋팅 추가[22.11.18, by 진태만) ■■
wbsGanttTask.setSource(tbPrjctWbs.getPreActivity());   // 의존관계가 시작되는 작업 ID[선행 ACTIVITY] 셋팅 추가[22.11.20, by 진태만] ■■
wbsGanttTask.setTarget(tbPrjctWbs.getEscActivity());    // 의존관계가 끝나는 태스크의 ID[후행 ACTIVITY] 셋팅 추가[22.11.20, by 진태만] ■■
wbsGanttTask.setType("0");    // 링크 연결 셋팅 추가[22.11.20, by 진태만] ■■
wbsGantt.addLinks(wbsGanttTask);    // wbs Gantt Task를 wbsGantt에 Data 셋팅
logger.debug("\n [@_TM] ■■■ [/ProjectWbsMainServiceImpl.java] [read()] ==> [T_76] [setId]"+ wbsGanttTask.getId() +"[Source]"+
wbsGanttTask.getSource() +\"[Target]"+ wbsGanttTask.getTarget() );
=============================================================================================================

- 주말2[★] 
06:00 기상
06:30 조식
07:10 출근(자전거)
07:15 도보(12층 복도)
08:30 종료
08:30 업무 
11:40 중식(컵라면, 과자)
11:55 도보(도림천 => 보라매공원 ==> 도림천)
12:55 종료
13:00 업무
17:00 퇴근(자전거)
17:10 남구로 시장 방문
17:20 혼수방 이불 방문 ==> 침대 패드 구입(퀸사이즈: 봄, 가을용, 4만원)
17:45 귀가
17:55 석식
18:20 실내 도보
19:40 종료
20:00 청소(청소기, 밀대)
20:30 샤워: 체중: 71.9kg ==> BMI: 24.88[표준 체중]
20:50 인터넷 서핑
22:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.21(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 2022 카타르 월드컵 개막 --> 카타르 0:2 에콰도르(0시)

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
 1. 코드 값 통일
TB_COM_WBS_CD TB ==> WBS 코드 ID(WBS_CODE_ID), 상위 WBS 코드 ID(UPPER_WBS_CODE_ID)
TB_PJT_WBS_PLAN TB ==> WBS 계획 ID(WBS_PLAN_ID), 위 WBS 계획 ID(UPPER_WBS_PLAN_ID)
=============================================================================================================

- WBS 코드 관리(시스템관리 ==> 코드관리) 개발
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
2. /ProjectWbsCodeMgtListR.form.jsp

<select id="wbsCodeId" resultType="com.anyfive.framework.core.support.collection.CamelKeyData">
	/* [@_T] WBS 코드 ID 생성[채번] ==> [/GeneralMapper.xml.wbsCodeId()] [22.11.21, by 진태만] */
	<![CDATA[
		SELECT  TO_CHAR(SYSDATE, 'YYYYMMDD') || LPAD(TO_NUMBER(SUBSTR(NVL(MAX(WBS_CODE_ID), '000'), -3)) + 1, 3, '0') 
		AS WBS_CODE_ID  ==> 20221123001 ■
		FROM TB_COM_WBS_CD    /* 01. 공통_WBS_코드 */
		WHERE TO_CHAR(CREAT_DT,'YYYYMMDD') = TO_CHAR(SYSDATE,'YYYYMMDD')         /* 생성 일시 */
	]]>
-------------------------------------------------------------------------------------------------------------------------

 - 채번
/* [@_T] 생성(프로젝트 관리) ==> [/TbPrjctMasterMapper.xml.create()] [22.10.14, by 진태만] */
INSERT INTO TB_PJT_MST      /* 프로젝트_마스터 TB */
		(
		PJT_MST_ID          /* 프로젝트_마스터 ID */
		, PRD_PLN_ID    	/* 상품기획ID */
		, PJT_STAT    		/* 프로젝트 상태 */
		, PJT_NO      		/* 프로젝트번호 ■ */
) VALUES (
		#{tbPrjctMaster.prjctMastrId}           /* 프로젝트 마스터 ID */
		 , #{tbPrjctMaster.prdPplnId}            /* 상품기획ID */
		 , #{tbPrjctMaster.pjtStatCd}            /* 프로젝트 상태(30:개발계획 수립) ■ */
		 , (SELECT 'P' || FN_FORMAT_DATE(SYSDATE, 'YYYYMMDD') || LPAD(NVL(MAX(TO_NUMBER(SUBSTR(PJT_NO, 10, 20))), 0) 
		 + 1, 3, '0') FROM TB_PJT_MST
		 WHERE PJT_NO LIKE 'P' || FN_FORMAT_DATE(SYSDATE, 'YYYYMMDD') || '%' AND LENGTH(PJT_NO) 
		 = LENGTH('PYYYYMMDD') + 3)   /* 프로젝트 번호 생성[채번]  ■ */
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.22(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. 일자 수동 입력  데이타 저장(상위 WBS 계획 ID)  ==> 완료[♥♡]
2. 태스크 추가/수정 화면 구분 처리  ==> 완료[♥♡]
3. Activity별 필수여부 체크
=============================================================================================================

- 표준 작업 소스 반영(16:40)
1. SVN에 등록
=============================================================================================================

- 77. 간트 차트(Grid 수정)
https://docs.dhtmlx.com/gantt/samples/07_grid/11_inline_edit_basic.html
=============================================================================================================

- 2022 카타르 월드컵
https://www.google.com/search?q=%EC%9B%94%EB%93%9C%EC%BB%B5+%EC%9D%BC%EC%A0%95
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.11.23(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- Tab 02. WBS Tab 화면[프로젝트 > 프로젝트 관리] 개발
localhost:8080/tnspms/prjct/projectprjct/prjctmgttab/viewDetailWBS?pjtMstId=10000001&devCl=1&devGrade=1
1. Activity별 필수여부 체크: 필수 여부(1: 필수, 2:옵션, 3: 미실행) 셋팅  ==> 완료[♥♡]
=============================================================================================================

- WBS 회의(15시  회의실)
1. 하지연 부장, 김빌리 책임
 1) WBS 계획 소스 반영 건 결함 논의 ==> 총 13건
=============================================================================================================

- 건강보험료 변동 안내문 도착
1. 2020년 10월: 66,830원 ==> 2020년 11월: 이후: 134,200원
=============================================================================================================

- 프리랜서분들 일 끝날 때마다 ‘해촉증명서’ 반드시 발급 받으세요[크랩]
https://www.youtube.com/watch?v=7a_Hcl6yiqs
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.24(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 사업장(1202호) 파티션 2개 증설, 책상 설치(10:30), 2022 카타르 월드컵 조별리그 H조 1차전, 한국 0:0 우루과이
								(22시, 집(현아트빌)에서 시청)

- 효성 PMS Prj[★]
- WBS 계획  결함 수정
1. 프로젝트 진행상태 코드(Tab 02. WBS Tab 화면에서) 처리  ==> 완료[♥♡]
3016: WBS계획 임시저장, 3017: WBS계획 작성완료
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.25(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==>

- 효성 PMS Prj[★]
- WBS 계획  결함 수정
1. 임시저장, 작성완료시 시작일, 죵료일 체크  ==> 완료[♥♡]
2. 템플릿 유형을 바꾸면 이전 내용이 클리어가 안됨   ==> 완료[♥♡]
3. 일자수동입력시 Grid의 표준공수칸은 숨김처리  ==> 완료[♥♡]
 1) Grid의 표준공수 데이터 널 처리로 대체: 김빌리 책임이 동의함
4. acitivity 필수여부 = "옵션" 인 항목은 미실시 처리
 1) TB_PJT_WBS_PLAN(프로젝트_WBS_계획) Tabel에 삭제 여부(DELETE_YN) 필드 추가  ==> 완료[♥♡]
 ==> DB에서 DELETE_YN = 'Y', PD(기간) = 0 이여도 무조건 공수 0으로 셋팅함
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.26(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 휴일 근무(07:00 ~ 17:00)

- 효성 PMS Prj[★]
- WBS 계획  결함 수정
1. Activity간 선후행 관계가 표시안됨 ==> 완료[♥♡]
 1) links 처리
	gantt.parse({	// gantt 데이타 parse 처리
		data: [     // 데이타 처리
			{ id: "20221121001", text: "T_01[SC}", start_date: "2022-10-04", duration: 5, progress: 0, open: true },
			{ id: "20221121002", text: "T_01_S1", start_date: "2022-10-04", duration: 2, progress: 0, parent: "20221121001 },   // Task #1 ■■■
			{ id: "20221121003", text: "T_01_S2", start_date:"2022-10-04", duration: 3, progress: 0. parent: "20221121001"}       // Task #2
		],
		links: [    // 링크 종속성 유형 처리
			// {id: 1, source: 1, target: 2, type: "1"},       // Project #2: 1에서 2로 링크 연결 ■ ==> 레벨1(1: syslog_to_start)
			{id: "20221121002", source: "20221121002", target: "20221121003",, type: "0"}  	// Task#1에서 2로 링크 연결(0: start_to_start) ■■■
		]
	});
	console.log("[]@_T] ■■■ [/01_basic_init.html] ==> [T_99]");
=============================================================================================================

- links된 20221121003 ID의 시작일자를 프로젝트 시작일자가 아니라 종료일자로 가지고 오는 방법
if( wbsGanttLink.getTarget().equals(tbPrjctWbs.getWbsPlanId())) {  	 // wbsGantt Link 타켓 ID와 상위 WBS 계획 ID가 같으면
	// Link 종료일자(자동 계산 안함: 개발)를 시작일자로 셋팅  ■■
	  wbsGanttTask.setStart_date(twbsGanttLink.getEnd_date("));    // 시작일(Link 종료일자 셋팅) ■■
 }
=============================================================================================================

- 임시저장, 저장 수정
if(StringUtils.isEmpty(tbPrjctWbs.getWbsPlanId()) || "1".equals(wbsDbSrchRst)) {    // WBS 계획 ID가 널 또는 WBS DB 조회 결과가 1이면
	tbPrjctWbsMapper.update(tbPrjctWbs);     // 수정(프로젝트 - WBS)
 }
 else
 {
	tbPrjctWbsMapper.create(tbPrjctWbs);   // 등록(프로젝트 - WBS)
 }
=============================================================================================================

- 데이터 추출(DBeaver에서)
1. Grid 조회 완료
 1) Grid 선택: 마우스 우 클릭 ==> 데이터 추출 ==> 데이터 추출(새창)
  가. TXT: 선택, 다음(N) >: 클릭 ==> Output
   가) 디렉토리: X:\01. TAMA_DATA\02. TAMA Project\2022.09(효성 PMS 구축 Prj) [41. JAVA T ■]\61. DB query\73. 테이블_Data
   나) File name pattern: ${table}_${timestamp}
   다) Timestamp pattern  yyyy-MM-dd HH mm(수정■■), 진행(P) >: 클릭  ==> /TB_COM_WBS_CD_2022-11-26 08 23.txt파일이 만들어짐
=============================================================================================================

- 주말[★]
05:05 기상
05:10 조식
05:40 출근(자전거)
05:45 도보(12층 복도)
07:10 종료
07:10 업무 
11:40 중식(컵라면, 감(1개), 과자)
11:45 도보(도림천 => 보라매공원 ==> 도림천)
12:55 종료
13:00 업무 
17:00 퇴근(자전거)
17:10 남구로 시장 방문
17:20 혼수방 이불 방문 ==> 침대 패드 구입(히프 누스[극세사 패드), 퀸사이즈: 겨울용, 5만원)
17:45 귀가 
17:55 석식
18:20 실내 도보
19:40 종료 
20:30 인터넷 서핑
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.27(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 휴일 근무(08:20 ~ 17:00)

- 효성 PMS Prj[★]
-  태스크 추가/수정 화면(/ProjectWbsTaskCU.form.jsp) 수정
A. 종료일 날짜 계산 ■
1. 종료일_02 = 종료일 + 기간
2. 휴일 = 주말 + 공휴일 + (자체 휴일 DB[갤린더 유형별])
3. 종료일_03 = 종료일_02 - 휴일 ==> for()
4. 종료일_04 = 종료일_03이 휴일 여부 확인(휴일이면 다음날 체크)

function fnCalEndDe()
{
	console.log("[@_T] ■■■ [/ProjectWbsTaskCU.script.jsp] [fnCalDate()] ==> [T_01] [종료일 날짜 계산 함수 호출] ■■■" );
}
=============================================================================================================
 
- 주말2[★] 
05:05 기상
05:10 조식
07:10 출근(자전거)
07:15 도보(12층 복도)
08:30 종료
08:30 업무 
11:30 중식(컵라면, 과자)
11:40 도보(도림천 => 보라매공원 ==> 도림천) 
13:00 종료
13:05 자전거(출발)
13:06 대림 종합 자전거(010-5398-6720: 문영 APT 1806호 근처) 방문 ==> 자전거 핸들 바구니 교체(만 3천원), 기아 줄(2개) 교체(만원) 
		 ==> 뒷 좌석 바구니(2만 5천원 구입 검토할 것: 중고 자전거 4만원에 판매 한다고 함
14:00 종료
14:05 귀사
14:00 업무
17:00 퇴근(자전거)
17:15 귀가
17:25 석식
18:00 실내 도보
19:20 종료
19:35 청소(청소기, 밀대)
20:20 샤워: 체중: 72kg ==> BMI: 24.88[표준 체중]
20:50 인터넷 서핑
22:00 취침
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.11.28(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 스쿼트 매일 200개 시작(22시 이후: 108개에 증가), 중식(11:20, 한신 IT타워 지하 보쌈(비빕밥): 개발팀, 김빌리 책임[쏨])
									, 2022 카타르 월드컵 조별리그 H조 1차전, 한국 2:3 가나(22시, 집(현아트빌)에서 시청)

- 효성 PMS Prj[★]
- 태스크 추가/수정 화면(/ProjectWbsTaskCU.form.jsp) 종료일 수정
A. 종료일 날짜 계산 ■
1. 종료일_02 = 종료일 + 기간
 cal.add(Calendar.DATE, intDuration);   // 종료일 = 시작일 + 기간
2. 휴일 = 주말 + 공휴일 + (자체 휴일 DB[갤린더 유형별])
3. 종료일_03(휴일 추가)) = 종료일_02 + 휴일 ==> for()
4. 종료일_04 = 종료일_03이 휴일 여부 확인(휴일이면 다음날 체크) ==> for()
function fnCalEndDe()
{
     while (calBgnDe.before(calEndDe)) {
             logger.debug("\n\n [@_T] ■■■ [/PrjctmgtServiceImpl.java] [readCalEndDe()] ==> [T_71] [시작일]"+ bgnDe  );
             if (Calendar.SATURDAY != calBgnDe.get(Calendar.DAY_OF_WEEK) && (Calendar.SUNDAY != calBgnDe.get(Calendar.DAY_OF_WEEK))) {
			 // 휴일이 아니면
                  logger.debug("\n[@_T] ■■■ [/PrjctmgtServiceImpl.java] [readCalEndDe()] ==> [T_72] [휴일이 아니면] [시작일◆]"+ bgnDe );

                  try {
                      dtBgnDe = df.parse(bgnDe);    // 시작일 dt
                  } catch (ParseException parseException) {
                      System.out.println(parseException.getStackTrace());
                  }

                  if(rtnEndDe == null) {     // 종료일이 널이면(처음이면)
                      calEndDeLs.setTime(dtBgnDe);
                      rtnEndDe = df.format(calEndDeLs.getTime());   // 종료일 dt
                  }
             }

             calBgnDe.add(Calendar.DATE, 1);    // 하루 추가
             bgnDe = df.format(calBgnDe.getTime());
         }  // enf of while()
		   logger.debug("\n\n\n [@_TM] ■■■ [/PrjctmgtServiceImpl.java] [readCalEndDe)] ==> [T_90] [6. 종료일(최종) ◆◆]"+ rtnEndDe
		   +"[1. 요청 시작일]"+ reqBgnDe +"[2. 기간]"+ duration +"[3. 종료일]"+ endDeOri +"[4. 휴일]"+ notWorkingdays
		   +"[5. 종료일(휴일 추가)◆]"+ bgnDeHoli );
}
=============================================================================================================

- 표준 작업 소스 반영(08:15) ==> 완료[♥♡]
1. SVN에 등록
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.11.29(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 출근할 때 비 조금(자전거, 비옷 상의 착용), 새로운 프로젝트팀 사업장에 투입(10시, 사업장 공유)

- 효성 PMS Prj[★]
- 태스크 추가/수정 화면(/ProjectWbsTaskCU.form.jsp) 종료일 수정
A. 공휴일 계산 ■
public class HolidayUtil {
    static final Logger logger = LoggerFactory.getLogger(PrjctmgtController.class);

    private static String[] solarArr = new String[]{"0101", "0301", "0505", "0606", "0815","1003", "1009", "1225"};    // 양력 공휴일
    private static String[] lunarArr = new String[]{"0101", "0102", "0408", "0814", "0815", "0816"};    // 음력 공휴일(설[0101], 부처님 오신날[0408], 추석[0815])
	
    public static boolean isHoliday(String date) {
        // logger.debug("\n [@_TM] ■■■ [/HolidayUtil.java] [isHoliday)] ==> [T_01] [공휴일 여부 체크] [요청 일자]"+ reqDe +"[요청 일자_길이]"+ reqDe.length() );

        String reqDe = date;   // 요청 일자

        if(reqDe.length() > 8) {
            reqDe = reqDe.substring(0, 4) + reqDe.substring(5, 7) + reqDe.substring(8, 10);   // 요청 일자(20111114) 셋팅
        }

        try {
            logger.debug("\n [@_TM] ■■■ [/HolidayUtil.java] [isHoliday)] ==> [T_51■■] [요청 일자_0]"+ date +"[요청 일자]"+ reqDe +"[1.
			양력 법정공휴일 체크]"+ isHolidaySolar(reqDe) +"[2. 음력 법정공휴일 체크]"+ isHolidayLunar(reqDe)
            +"[3. 대체공휴일 체크]"+ isHolidayAlternate(reqDe) +"[4. 주말 체크]"+ isWeekend(reqDe) );

            return isHolidaySolar(reqDe) || isHolidayLunar(reqDe) || isHolidayAlternate(reqDe) || isWeekend(reqDe);

        } catch (ParseException e) {
            e.printStackTrace();
            return false;
        }
    }
}
=============================================================================================================

 /* [@_TM] [T_14] 휴일 리스트 조회(프로젝트 - WBS) => [/TbPrjctWbsMapper.xml.readHldyDeList()] [22.11.29, by 진태만] */
	SELECT A.HLDY_DE        /* 휴일 */
	---  A.CND_TY "캘린더 유형", A.HLDY_DE "휴일", A.HLDY_NM "휴일 명"     -- 캘린더 유형(10: 공통, 20: 영어, 30: 효성TNS)
	FROM TB_COM_HLDY A          /* 52. 공통_일정관리 TB */
	WHERE A.CND_TY = #{cnTy}     /* 캘린더 유형 */
=============================================================================================================

- 어묵 무침 요리[★] 
17:30 퇴근(자전거, 많이 추움)
17:45 진흥 마트 방문 ==> 12월 5일 폐장(어묵 없음)
17:50 진로 마트 방문 ==> 샘표 금F-3 진강장 1.7L(8,900원), 오뚜기 올리고당 700g(3,750원) 구입
17:57 귀가
18:05 석식
18:20 실내 도보
18:45 종료
18:55 퇴근(자전거)
19:15 정림 마트 방문 ==> 알뜰 어묵 사각 1kg(5개: 19,900원[개당 3,980원]), 순수 부산 볼 어묵 1kg(3,630원) 구입
19:50 귀가
20:00 어묵(6kg[6개: 봉 어묵 1개]) 무침: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림
20:20 종료
20:30 인터넷 서핑
22:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.11.30(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 한파(영하 7도), 가계부 월말 결산(20:30, 집)

- 효성 PMS Prj[★]
- 태스크 추가/수정 화면(/ProjectWbsTaskCU.form.jsp) 종료일 수정
A. 공휴일 계산 ■  ==> 완료[♥♡]
 /* [@_TM] [T_14] 휴일 리스트 조회(프로젝트 - WBS) => [/TbPrjctWbsMapper.xml.readHldyDeList()] [22.11.29, by 진태만] */
	SELECT A.HLDY_DE        /* 휴일 */
	---  A.CND_TY "캘린더 유형", A.HLDY_DE "휴일", A.HLDY_NM "휴일 명"     -- 캘린더 유형(10: 공통, 20: 영어, 30: 베트남, 40: TNS)
	FROM TB_COM_HLDY A          /* 52. 공통_일정관리 TB */
	WHERE A.CND_TY = #{cnTy}     /* 캘린더 유형 */
=============================================================================================================

- JavaScript / Object / Location / URL 정보 가져오는 객체
https://www.codingfactory.net/10438

    function getContexFolder() {
        // console.log("[@_T] ■■■ [/PrjctMgtListR.form.jsp] [getContexFolder()]  ==> [T_01] [폴더 경로 설정] ■■■");

        var hostIndex = location.href.indexOf(location.host) + location.host.length;
        console.log("[@_T] ■■■ [/PrjctMgtListR.form.jsp] [getContexFolder()] ==> [T_02] [HOST]"+ location.host +"[HOST명 ]"+
		location.hostname +"[location.href.]"+ location.href );

        var contextPath = location.href.substring(hostIndex, location.href.indexOf('/', hostIndex + 1));
        var contexFolder = "/common/images/tree/";  // 폴더 경로

        if((location.hostname == "localhost") || location.hostname == "127.0.0.1") {   // 로컬 서버 이면
            contexFolder = contextPath +"/common/images/tree/";  	// 폴더 경로
        }

        return contexFolder;
   }
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 