

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.03) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.03.01(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 삼일절(공휴일)

- 삼일절[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 집): 비 약간 옴(우산X)
08:40 종료
08:50 인터넷 서핑 ==> 01. 자산 검증(2022.03).xlsx 처리
12:00 중식
12:30 실내 도보
13:55 종료
13:57 화장실 세면기 막힘 처리: 과탄산소다 사용(뜨거운 물): 그래도 안 중식
14:00 인터넷 서핑
16:30 화장실 세면기 막힘 뚫기: 많이 중식
		1. 페트병(퐁퐁 8번 넣기), 2. 세면대 배수호스 이물질 제거
18:00 석식
18:20 실내 도보
20:00 종료 
21:10 인터넷 서핑: 포항집 거실 인터폰 수리 방문 분석
22:30 취침
==============================================================================================================

- 나눔푸드 국내가공 오징어실채 [500g]
http://www.enuri.com/detail.jsp?modelno=35033854
[미강착한먹거리] 국내가공 오징어실채 500g [가락시장 직배송], 가격: 14,500원
https://front.wemakeprice.com/product/100170181?utm_source=enuri&utm_medium=PRICE_af&utm_campaign=null

- [북극해]국내가공 백진미채 1KG 대용량 백진미 백 진미채 진미 볶음 일미 오징어실채 
https://smartstore.naver.com/drytry/products/5460912798
 (잘린)백진미채1KG 1+1/1개 (+9,800원), 가격: 19,600원
==============================================================================================================

- 잠은 몇시에 자야 할까? [방태환 원장의 5분 건강정보]
https://youtu.be/Tx10zzXNWGs
==============================================================================================================

- 박지성, 포기를 모르는 인생 스토리🔥 / (*포기가 쉽다면 꼭 봐야하는 영상)
https://youtu.be/ZFDEkQcGozA
==============================================================================================================

- 50부터는 속도가 아니라 방향이다(북올림 몰아보기)
https://youtu.be/i02j6BPgiZ4
==============================================================================================================

- 절대 볶지마세요X, 촉촉하고 부드러운 진미채, 물과 마요네즈를 넣어요.[요리왕 비룡]
https://youtu.be/lSyT_G-N2gg
==============================================================================================================

- 세면기 막힘 뚫기
- 세면대 막힘 5초 해결 초보자도 가능[너도나도TV] ==> 강추
https://youtu.be/THAN1JS4eXw
1. 페트병(퐁퐁 8번 넣기)

- 막힌 세면대를 뚫는 꿀팁[공대 아저씨]
https://youtu.be/L7SfX0ontoU

- (초간단) 세면대 물 안내려 갈때 시원하게 뚫는 방법.
https://youtu.be/wnOmhrL9UA0
1. 새면대 100% 뚫는 방법  
 1) 세면대 팝업 이물질 제거
 2) 세면대 배수호스 이물질 제거

- 세면대 막힘?! 머리카락 한올 안나오게 뚫어버리는 방법!!! (ft.이지펑)
https://youtu.be/84U0MGw787c
1. 세면대 팝업 이물질 제거
2. 트랩 청소  
 1) P트랩(벽으로 물 배수): 구부러진 부위만 해체 후 칫솔로 청소[오래되어 고무 패킹 삭았는 지 확인]
 2) S트랩(바닥으로 물 배수)[포항집 화장실 세면기]: 구부러진 부위만 해체 후 칫솔로 청소
 3) 주름관(벽으로 물 배수): 주름관 분리후 칫솔로 거름망 청소
 4) 주름관(바닥으로 물 배수)[서울집 화장실 세면기]: 주름관 분리후 칫솔로 거름망 청소
 
- 누구나 손쉽게 세면대 뚫는법 - 도구 없이도 세면대 막힘 해결! [하수구의제왕]
https://youtu.be/FRBJYIiftTk 
==============================================================================================================

- 포항집 거실 인터폰 수리
1. 거실 인터폰(코콤 인터폰[DP-202H) 거실 도배(2022.01.31) 후 전선 다시 연결하니 안됨
----------------------------------------------------------------------------------------------------

- 코콤 인터폰 A/S 1577-0051
http://www.kocom.co.kr/store/asCenter.php
http://www.kocom.co.kr/product/view.php?c_no=20&p_no=27
----------------------------------------------------------------------------------------------------

- 코콤 DP-202H(= 신제품: KDP-502A), 가격: 34,500원 
http://www.enuri.com/detail.jsp?modelno=2094477 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.02(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 수종 개학[3학년 올라감(3학년 1반), 코로나 자가 검사 키드 받아옴: 큰누나게 집에 와서 도와줌)

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.03(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 22.03.03. 학생생 기초 조사서(진수종) 작성(22시, 집)

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.04(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 현용 만남([★] 
18:00 퇴근(DB손보 빌딩 18층)
18:05 DB손보 빌딩 ==> 선릉역 ==> 역삼역 ==> 강남역 ==> 교대
18:35 교대역 근처 도착: 뛰어서 감(약간 힘듬)
18:40 현용 만남 ==> 하레(https://place.map.kakao.com/17045434) 도착(예약 안해서 입장 거부 당함)
18:43 삼풍 치킨(교대 직영점, 교대역 4번 출군) 도착 ==> 치킨 오뎅탕, 생맥 
20:30 종료(술값: 69,000원 나옴[더치 페이: 현용이가 34,500원 카카오 뱅크로 송금해줌])
20:45 교대역(지하철) --> 신림역
21:30 귀가 
21:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.05(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
07:00 기상
07:40 조식
08:00 집출발
08:05 구립 신사 경로당 도착 ==> 20대 대통령 선거 사전 투표(1번 이재명 후보 찍음)
08:10 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 집) 
09:30 귀가
10:10 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 포토샵 공부
14:16 종료
16:00 집출발(자전거)
16:20 헌혈의집 구로디지털 단지역센터 방문
16:30 문진검사, 피검사(헤모글로빈 수치 ↑), 혈압 검사(88 ~ 157): 높은 편
16:45 헌혈(전혈): 음료수(오렌지), 롯데 롯데샌드깜뜨(105g), 편의점 상품권 2장(만원), 쿠팡이츠 배달앱 5천원 교환권 받음
		 ==> 총 헌혈 횟수: 10회 --> 쿠팡이츠 배달앱 5천원 교환권: 태용이한테 선물로 보냄
16:50 종료
17:00 다이소 난곡점 방문 ==> 더마 앤모어 판테놀 가려운두피 비듬샴푸(600 ml) (5천원) 구입
17:20 귀가
18:00 석식
18:20 실내 도보
18:50 인터넷 서핑 ==> 포토샵 공부
20:00 종료
==============================================================================================================

- 대한적십자사 혈액관리본부
https://www.bloodinfo.net/main.do
1. 헌혈의집 구로디지털단지역센터
==============================================================================================================

- 어도비 포토샵 2022 PC에 재설치
1. 포토샵 2022 한글 삭제 ==> 포토샵 2022 English(Internal) 설치(영문판으로 재설치)
==============================================================================================================

- 포토샵 기초 강의 텍스트 입력방법과 사진에 글자 넣기[IB 96]
https://youtu.be/xo6qhuP_H_w

- 포토샵 기초 배우기 Photoshop 2020 단축키및 기본 사용법 강의[IB 96]
https://youtu.be/ulKOhvH0SXQ

- 포토샵 기초부터 실무까지 배우고 싶다면 지금 시작해 보세요[IB 96]
https://youtu.be/jHqEkPWQfM4

- 듣고 보기만 해도 포토샵 을 배울수 있습니다 "포토샾 기초부터 실무 활용 기능 10시간 특강" [IB 96]
https://youtu.be/dn7QajULw5M

- 현직 디자이너의 포토샵팁] 포토샵으로 곡선 예쁘게 그리기[Potatohands Kim]
https://youtu.be/aFdjNBVUtMU

- [포토샵 강좌] 커스텀 쉐이프 툴 이전버전으로 셋팅[툴 브레이커]
https://youtu.be/DOnAJE13X1k
==> All+Custom+Shapes.csh 파일 다운받아서 설치: https://blog.naver.com/vhekfdlfekf/221863140242
-------------------------------------------------------------------------------------------------------------------------------

1. 왼쪽 Tool 팔레트에서 브러쉬(붓 이미지): 클릭
2. 컨트롤 패널(맨 위)에서
 1) Size(크기): 2 픽셀(글자 쓰기 용도)  ==> Size(크기): 7픽셀(그리기 용도)
 2) Hardness(경도): 100%(선명한 원)
 3) Mode(모드): Normal(표준)
 4) Opacity(불투명도): 100%
 5) Flow(흐름): 100% 
 6) Smoothing: 10%
==============================================================================================================

- 포토샵 툴바 단축키 @@@
ㆍ무브 툴(기본 마우스, 이동) : V    ■■■  ==> Auto Select: 체크(필수)
ㆍ올가미 툴(자유선택) : L
ㆍ자르기 툴 : C 
ㆍ패치 툴 : J
ㆍ복제 툴 : S
ㆍ지우개 툴 : E
ㆍ패스 툴 : P
ㆍ패스 선택 툴 : A
ㆍ전경 색/배경색 기본으로 변경 : D
ㆍ전경 색/배경색 위치 변경 : X  ■■■
ㆍ선택 툴(원하는 부분 지정: Rectangular Marquee tool[직사각형 현수막 툴]) : M ■■■
ㆍ매직 선택툴(같은 색깔 지정) : W
ㆍ스포이트 툴 : I
ㆍ브러시 툴 : B ■■■
ㆍ그레이디언트/채우기 툴 : G
ㆍ닷지/번/스펀지 툴 : O
ㆍ텍스트 툴 : T  ■■■
ㆍ모양 툴/모양 패스 툴 : U
ㆍ핸드 툴 : Space Bar 또는 H  ■■■
ㆍ돋보기 툴 : Z(마우스 드래그를 통해 확대와 축소(Atl 키)가 가능) ==> 확대(Ctrl 키 and '+'), 축소(Ctrl 키 and '-') ■■■
-------------------------------------------------------------------------------------------------------------------------------

ㆍ크기 조절 : Ctrl 키 and 'T')
==============================================================================================================

- 사마천 사기 한 번에 몰아보기[북올림]
https://youtu.be/QaB2zhOxxZg
==============================================================================================================
  
- HCR Dotum
https://www.koreafont.com/fonts/list/1647/:  
폰트명: 함초롬 돋움
영문폰트명: HCR Dotum
패밀리명: 함초롬 돋움
디자이너(공급사) 정보: 한글과 컴퓨터
제작일자: 2015-11-18
유/무료: 무료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.06(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 집)
08:30 귀가
09:10 인터넷 서핑 ==> 포토샵 공부
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 포토샵 공부
18:00 석식
18:20 실내 도보
20:00 종료  
20:30 청소(청소기, 밀대)
20:50 샤워(체중: 66kg ==> BMI: 22.94[표준 체중])
21:10 인터넷 서핑
22:30 취침
==============================================================================================================

- 오이무침 비법은 절대 절이지 말고 '이것' 넣어보세요[김대석 셰프TV]
https://youtu.be/LPPW-xFyTYQ

- 백반집 오이무침![쿡피아]
https://youtu.be/1nG4gT-hQrU

- 오이 송송이 깍두기[쿡피아]
https://youtu.be/6IG6-HvavLY

- 먹을 때 까지 물이 생기지 않는 간편 오이무침 하세요[엄마의 손맛]
https://youtu.be/CDkZRPpjsnM
==============================================================================================================

- 미역줄기볶음. 비린내는 잡고 오도독 식감을 살렸습니다[쿡피아]
https://youtu.be/ovAb2Hf1CoI

- 미역줄기로 만드는 갓성비 밑반찬! [빅마마 이혜정]
https://youtu.be/_Vx9xRRY9WE
==============================================================================================================

- [ENG] 필수 밑반찬, 멸치볶음! 오래 두고 먹어도 맛있어요[쿡피아]
https://youtu.be/fm47aK3UtKM
==============================================================================================================

- 이제는 사지 말고 만들어 드세요! 오리엔탈 드레싱 레시피
https://youtu.be/e1O5cxb6SZo

- 욜로리아 다이어트 샐러드 맛있고 배부르게 먹는방법 4가지 : 확!찐자 방지 식단
https://youtu.be/l2gPbTHhQgs

- [Sub] 다이어트에 좋은 '오리엔탈?' 두부샐러드[백종원의 요리비책]
https://youtu.be/9OYciHKmgus명
==============================================================================================================

- 알뜰폰(헬로 모바일,  KT 엠 모바일)
- LG 헬로 모바일 새폰 알뜰폰 비교 및 종류 
https://direct.lghellovision.net/phone/list.do?phoneGubun=RPK#none
==============================================================================================================

- KT 엠 모바일
1. [5G] 갤럭시노트10+ 256G, 단말기 할부원금: 34,500원
https://www.ktmmobile.com/product/phone/phoneView.do?prodId=3589
==============================================================================================================

- 코로나19 자가검사키트 올바른 사용방법과 행동수칙[질병관리청 아프지마TV]
https://youtu.be/RO8H8Fjahp0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.07(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
 
 ■■■■■■■■■■■■■■■■■■ 2032.03.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
 
- 아이핀 인증 신규 발급(i-pin)[22.03.07(월)] ==> 완료[♥♡] 
1. 발급기관: 나이스 아이핀 ==> http://www.niceipin.co.kr/index.ni ==> tamario / 2020오*h@
 1) 추가 인증: 키패턴(U)
 2) 나이스 아이핀 서비스 탈퇴 후 신규 발급
=================================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.09(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 20대 대통령 선거일

- 임시 공휴일[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 집)
08:40 종료
08:50 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업
12:00 중식
12:30 실내 도보
13:55 종료 
14:00 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업
16:00 집출발(자전거)
16:20 신사 시장 방문 ==> 진로 마트 방문, 하나로 마트 방문(김 100장: 5천원)
16:40 신원 시장 방문 ==> 남원상회 방문(김 100장: 만원, 미역 줄기: 400g: 3천원)
17:10 귀가
18:00 석식
18:20 실내 도보
20:00 종료 
21:10 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업
22:30 취침
==============================================================================================================

- 한화손해보험 앱 설치 ==> 완료[♥♡] 
1. 카카오페이 공인인증서 발급 ==> 2020오*h@
https://play.google.com/store/apps/details?id=com.hanwhalife.hiw&hl=ko&gl=US
==============================================================================================================

- 22.03.09. 개인정보 수집.이용 및 제 3자 제공 동의서작성(22시, 집) ==> 완료[♥♡] 
1. 진수종: 3학년 1반 20번 
2. 22.03.09. 개인정보 수집.이용 및 제 3자 제공 동의서.jpg
 ==============================================================================================================

- 미역 줄기 반찬 분석
1. [지온수산] 완도 염장 미역 미역줄기 쇠미역 곰피 10kg (+3,000원), 가격: 12,243원
 ttps://smartstore.naver.com/jion_/products/4861014607 
2. 염장 미역줄기 5kg (1kg x 5봉 개별포장), 가격: 10,400원 
https://www.11st.co.kr/products/2678624044
==============================================================================================================

- 일본 관상학의 대가가 알려주는 운명을 바꾸는 법[북올림]
https://youtu.be/unw0Y0D0-98
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.10(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.11(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.03.12(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- 주말[★]
06:00 기상: 어제 퇴근할 때 가져온 과자 흡입(식전 혈당: 187) 
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 집)
08:50 귀가
09:00 인터넷 서핑
12:00 중식
12:20 도보(집 => 도림 도보교 => 문화교(반환점) => 도림교(반환점) => 문화교(반환점2) => 도림교(반환점2) => 도림 도보교 => 집)
		: 간편 잠바(약간 더움)
13:50 귀가
14:00 인터넷 서핑
17:35 작은 누나와 통화 : 수종이 내년(2023년)에 서울로 전학하라고ㅗ 조언해줌
18:00 석식
18:20 실내 도보 ==> 주식의 정석 91강 시청 종료(12번 시청 완료)
20:00 종료 
21:10 인터넷 서핑
22:30 취침
==============================================================================================================

- [시장주도 이슈+미국주식] 셀트리온 의혹종결‘이제는 합병이다.
https://youtu.be/riD0V-3hOR4
==============================================================================================================

- Sub) 전기밥솥 청소 | 전기밥솥 청소법
https://youtu.be/Z4tOUtPVPuI
==============================================================================================================

- 올바른 쌀 씻는법 + 활용성 좋은 쌀뜨물 만들기 + 밥 전기밥솥으로 맛있게 하는법[가루씨의 집밥]
https://youtu.be/tdf6-vWU3Nw
==============================================================================================================

- 돈 벌려면 반드시 이것 5가지를 하라[북올림]
https://www.youtube.com/watch?v=xafsbA1e1V8&list=PUl1DT7heWqqNOpV87jnYxLg&index=1
==============================================================================================================

- 미국 지도, 지리 30분 총정리 [통합#미국地] [두선생의 역사공장]
https://youtu.be/6DoSJZ9WxXQ

- 중국의 대표 강江 산山 아는 척하기 [1#중국地] [두선생의 역사공장]
https://youtu.be/OwqT_bwsoYY
https://www.youtube.com/watch?v=xCM-HMhwc-o&list=PLZR_9FY5vk-y_BIcnL-OWM8e1ElUgSL8a&index=4
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.13(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★]
06:00 기상
06:40 조식 ==> 비 약간 옴(우산X)
07:00 도보(집 => 도림 도보교 => 신림1교(반환점) => 도림교(반환점) => 신림1교(반환점2) => 도림교(반환점2) => 도림 도보교 => 집)
08:50 귀가
09:00 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업
12:00 중식
12:30 실내 도보 ==> 주식의 정석 1강 시청
13:55 종료
14:00 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업   
18:00 석식
18:20 실내 도보
09:10 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업
20:00 종료
20:30 청소(청소기, 밀대)
20:50 샤워(체중: 65.6kg ==> BMI: 22.94[표준 체중])
21:10 인터넷 서핑 ==> 한화손보 질병 보험금 청구 작업: 총 4건 접수 완료
22:30 취침
==============================================================================================================

- 보험금청구결과 조회
https://www.hwgeneralins.com/fplaza/compensation/result01.do
==============================================================================================================

- [쿠쿠첸#05] 쿠쿠 VS 쿠첸 밥맛 비교 1탄. 찰진백미편
https://youtu.be/AKDOrjY_Eps
1, 쿠쿠 트윈프레셔 마스터 셰프: CRP-LHTR0610FW
2. 쿠첸 iR 미작 클린가드: CJR-PM0610RHW
==============================================================================================================

- 서울집 밥솥 구매[2017.09.10(일)]
1. 쿠쿠 CRP-P0610FD 분리형 내솥 뚜껑(Full스텐커버) 2중모션패킹, 가격: 150,110원
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1406499174&xfrom=&xzone=
http://www.enuri.com/detail.jsp?modelno=12878688
============================================================================================================== 

- 쿠쿠 압력밥솥 뚜껑분해 청소 수리하기[EZ Making]
https://youtu.be/whWElWo7Se0

- 쿠쿠 전기압력밥솥 청소하는 법 (HYXB1010FB) - 네이버 블로그
https://m.blog.naver.com/jylhee0704/220444595472
==============================================================================================================

- 2021년 인기 많은 평형별 가성비 벽걸이 에어컨 BEST 5 [가격,성능 비교]
https://youtu.be/e50pUoF0Rqc
==============================================================================================================

- 미역 줄기 반찬 구입
1. [지온수산] 완도 염장 미역 미역줄기 쇠미역 곰피 10kg, 옵션: 염장미역줄기 10.0kg/1개 (+3,000원), 가격: 11,743원
https://smartstore.naver.com/jion_/products/4861014607
==============================================================================================================

- 가훈: 건강하고 검소하고 현명하게 살자.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.14(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.03.15(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 김봉재 이사 코로나 19 확진진: 신속항원 검사(16:40, 연세 신&송 이비인후과) => 팀원 7명 모두 음성 나옴

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
 
- 포항집 거실 인터폰 출장 신청
1. 출장비 만 5천원(코콤 인터폰 A/S 1577-0051): 콜센터로 전화해서 신청
 1) 거실 인터폰(코콤 인터폰[DP-202H) 거실 도배(2022.01.31) 후 전선 다시 연결하니 안됨
==============================================================================================================

- 구글 주소록 사용법[IB 96]
https://youtu.be/i0Z7TIcP2hg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.16(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
  
- 포항집 거실 인터폰 수리
1. 코콤 인터폰 AS 기사 방문(09:30, 출장비 2만원 주고 고침)
 1) 거실 인터폰(코콤 인터폰[DP-202H) 거실 도배(2022.01.31) 후 전선 다시 연결하니 안됨
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.17(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.03.18(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- OSB 저축은행 예금 만기 출금(부모님 돈)
1. 예금명: 복리정기예금 ==> 계좌번호: 00321-24-0821479
2. 가입일자: 2021년  03월 18일
3. 만기일자: 2022년 03월 18일
4. 가입기간: 12개월 
5. 이율: 1.713%
6. 예치금액: 16,000,000원 ==> 만기예상지급액: 6,232,431원
7. 출금계좌번호: 00311-13-0065099(E-보통예금), 예금주: 진태만
 1) 해지계좌 비밀번호: 5201
8. 인터넷으로 가입 ==> https://ibs.osb.co.kr/ib20/mnu/BNK00047?ib20_wc=WID00056:WID00057
https://www.osb.co.kr/ib20/mnu/HOM00091
9, OSB 저축은행 앱으로 출금
============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.03.19(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:50 기상
05:15 조식(과자)
05:55 집출발(비 조금 옴, 우산)
06:00 남서울중학교 정류장 도착 
06:04 5413번 버스 승차
06:40 고속버스터미널 하차
06:41 도보(고속버스터미널 실내)
07:20 포항행 고속버스 승차: 우등고속에 탑승[버스 업체에서 서비스라고 주장])
11:18 포항 고속버스 터미널 도착(비옴, 우산)
11:19 고속버스 터미널 정류장(209번 버스 승차)
11:30 두호동 주민센터 하차
11:35 포항집 도착 
12:00 중식
12:30 실내 도보 
14:10 종료
14:20 화장실 세면기 수리(세면기 팝업 풀기(실수), 세면기 주름관 분리, 거름망에서 머리카락 제거, 세면기 팝업 손으로 조이기)
15:00 종료
15:30 손잡이(CLD 1000SS) 교체: 주방 창고 문만 교체(안방, 수종방은 고장 안남[손잡이 2개는 보관])
17:15 종료
17:30 석식
18:00 집출발(수종, 도보) ==> 수종이와 대화(올 겨울 방학 때(12월 말 예상) 서울집에 와서 같이 살기로 함)
18:20 큰누나 미용실 방문(손님 2명)
18:45 도보(옛 철길 ==> 옛 포항역 주변 돌고 옴: 비 조금 맞음)
19:20 이발(수종, 나)
19:40 종료
19:45 출발(큰누나 차) 
20:10 귀가 
20:30 TV 시청
21:45 염색
22:20 샤워
22:30 인터넷 서핑
23:00 취침(수종)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.03.20(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:15 조식
06:55 도보(영일대 해수욕장): 쌀쌀함(바람 불어 약간 추움)
08:10 종료
09:20 TV 시청(인터넷 안됨: 수종 노트북 인터넷 안됨)
10:00 반찬 요리 배우기(엄마)
		==> 1. 미역줄기 볶음(고추장, 진간장, 해바라기씨유[식용유], 마늘 다짐), 2. 어묵 볶음
10:45 종료
12:00 중식 
12:30 집출발(도보)
13:00 다이소 포항 우현점 방문 ==> 리폼 용무늬목 시트지D(내추럴월넛) (2천원, 큰누나 미용실용) 구입
13:10 큰누나 미용실 도착: 문손잡이 수리 ==> 캐치 홈 구멍이 작고 좁아서 구멍 넒이기(칼이 없어서 쉽지 않음): 1차 포기
14:30 다이소 포항 두호점 방문 ==> 쟁반(5천원), 치약(3개, 3천원) 구입
14:20 귀가
15:30 장판(3개) 버리기(스티커[3천, 3장] 븥이고 배출)
15:40 집출발(도보)
16:10 큰누나 미용실 도착(2번째 방문): 문손잡이 수리(캐치 홈 구멍을 칼과 드라이버로 넓히기, 손잡이 방향 반대로 변경)
		 ==> 구조적으로 방안에서 열쇠로 잠금 사용할 수 없음, 열고 닫고 하는 기능은 가능
17:20 종료
17:45 귀가
18:00 석식
18:18 집출발(김치 2통, 미역 볶음 2통, 어묵 볶음 1통, 양념장, 고추장)
18:22 두호동 주민센터정류장(900번 버스 탑승)
18:40 죽도 파출소 정류장 도착
19:10 포항 출발
22:57 서울 강남터미널 도착(꽃샘 추위)
23:17 고속 터미널 정류장(643번 버스 탑승)
23:47 남부초 정류장 하차
23:53 귀가
24:10 청소
24:50 인터넷 서핑
02:00 취침
============================================================================================================== 

- 어묵 넣자마자 끝난 김수미의 ′어묵조림′[Olive]
https://youtu.be/GWrc2uqtN4k
============================================================================================================== 

- 어묵볶음 만드는법 밑반찬 오뎅볶음 레시피
https://mammaland.tistory.com/entry/간장-어묵볶음-레시피-단짠단짠-아이들-밑반찬으로-좋아요
A. 재료
1. 사각 어묵 3장 (200g)
2. 양파 1/3 개
3. 대파 1/2 대(사용 안함)
4. 당근 1/4 개
5. 파프리카 1/2개(사용 안함)

B. 양념
1. 진간장 3 수저
2. 설탕 1/2 수저
3. 식용유 2 수저
4. 통깨, 후추 조금
5. 참기름 1 수저
6. 올리고당 1 수저
7. 다진 마늘 1/2 수저

C. 조리법
1. 간장오뎅볶음 재료를 준비해 주세요.
2. 양파와 파프리카를 먹기좋은 사이즈로 채를 썰어주세요.
==============================================================================================================

- 스마일 클럽-연회비(웰컴 기프트 3만 5천원 스마일 캐시)
https://canopus1204.tistory.com/entry/스마일클럽-연회비
1. 연회비 3만원 현대카드로 납부됨

- G마켓 옥션 G9 스마일클럽 스마일페이 활용하여 알뜰하게 하는 쇼핑꿀팁 [금고엄마]
https://youtu.be/0_aY27ZqRZg
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2022.03.21(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 반바지 구입 ==> 완료[♥♡] 
- [스마트스토어] 축구반바지 축구바지 운동복바지 4부바지 주머니있음: 선택 01-0603 + 85, 선택 03-0650 + 85), 가격: 18,710원	
https://smartstore.naver.com/danchebok/products/4266881217 
https://search.shopping.naver.com/catalog/22347310112?cat_id=50005247
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.22(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 당뇨에 설탕보다 훨씬 위험한 두가지[방태환 원장의 건강정보]
https://youtu.be/UXigeMvx0-4
==============================================================================================================

- 700만이 뽑은 초간단 인생 요리 15가지🔥[만개의 레시피]
https://youtu.be/vz6Hpuss1Lc
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.23(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 대부분 실제로 겪는 은퇴 후의 현실 - 꿈 깨세요 (조관일) [단희TV]
https://youtu.be/aIoqm-Qd8G8
==============================================================================================================

- 50, 60대 중년 삶, 대우받으면서 행복 얻을 수 있는 3가지 방법 (feat. 단희tv)
https://youtu.be/Q_xIltQgbh0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.24(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 동부초 3학년 1반(수종이 반) 1주일 간 원격 수업 실시, 전우현 대리(미러링 개발) 코로나19 확진(자가 격리)

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 정태웅 이사 면담(16시)
1. KB국민은행 API 프로젝트 제안[API, 전문 개발과 유사, 현재 팀원들과 투입(정이사 제외), 750, KOSA 경력 필수]
 1) 여이도 또는 염창동
==============================================================================================================

- KOSA SW기술자 경력관리시스템
https://career.sw.or.kr,  ID: tamario, 비밀번호: 4lmGKyjh --> 202오십
==============================================================================================================

- 22.03.24(목) 캐시워크 CU 모바일 상품권 구입
1. CU 모바일 상품권 5천원권(7,000캐시) 4장 구입
2. CU 모바일 상품권 3천원권(4,200캐시) 1장 구입
==> 총 23,000원
==============================================================================================================

- 늙어서 고생하지 않기위해 지금부터 키워야 할 4가지 능력 - 원더풀 인생후반전
https://youtu.be/1zwfxxGuLU0
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.25(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.26(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집): 비 조금 옴(우산 소지)
08:30 귀가
09:50 화장실 세면기 청소(주름관에서 머리 카락 , 이물질 제거 후 청소)
10:00 인터넷 서핑 ==> 01. 경력기술 프로필(진태만).doc 작성
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 02. 이력서_20220326(잡코리아).doc 작성
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
19:50 종료
20:00 인터넷 서핑
20:00 종료
==============================================================================================================

- 01. 경력기술 프로필(진태만) 작성 ==> 완료[♥♡]  
1. 01. 경력기술 프로필(진태만).doc
==============================================================================================================
  
- 쌍둥이도 늙는 속도가 다르다! 노화를 늦추는 방법은? [EBS명의│노화를 늦추는 5가지 열쇠]
https://youtu.be/aGQejkORHzk
1. 노화 촉진 원인: 흡연, 음주, 비만, 스트레스, 과음 ==> 운동
==============================================================================================================

- 당뇨, 이것 하지마라! 당뇨환자라면 피해야 할 Top3 - 신동진의 닥터밥상 #35
https://youtu.be/ifiGdukTaG4
1. 떡, 2. 스트레스(운동, 복식 호흡), 3. 수면 부족
==============================================================================================================

- 요리 기본 재료(양념)
https://xinsound.tistory.com/886
0. 식용유(콩), 올리고당(물엿), 조미료(샘표 연두 요리 에센스: 다시마), 고추가루, 맛술(소주), 깨, 액젓, 굴소스, 캣찹, 마요네즈
1. 진간장/국간장
간장 종류는 두가지로 진간장은 간단한 볶음요리와 조림에 사용되고 국간장은 국이나 찌개를 끓이는데 항상 사용하는 재료입니다!
2. 소금
볶음이나 부족간 간을 추가할 때는 꼭 사용되는 재료가 되겠네요!
3. 설탕
요리의 감칠맛을 살려주는데 필수! 단맛을 더해 요리를 보다 맛있게 만들어주네요!
4. 후추
잡내 제거 및 살짝의 매콤함과 개운한 맛을 더해줄때 사용합니다! 주로 요리의 마무리나 볶음요리할때 주로 사용되네요!
5. 양파
국, 찌개, 볶음, 부침등 어느 요리든 항상 필요한 재료로 냉장고에 항상 있어줘야 마음이 편안하네요!
6. 대파
양파와 같이 환상궁합으로 양파가 따라가는 곳에는 대파가 항상 따라가는 재료입니다! 
 7. 다진 마늘
재료의 잡내를 제거해주고 요리의 감칠맛을 살려주는데는 이만한 재료가 없네요! 저는 주로 국과 조림류에 많이 사용합니다!
8. 된장
우리나라 국민 양념재료 된장! 찌개나 무침을 만들떄 주로 사용되네요!
9. 고추장[보유]
된장과 함께 꼭 있어야하는 재료로 볶음, 조림, 찌개,국등에 다양하게 사용하고 있네요! 개인적인 취향에는 고추가루 보다는 대부분 
고추장을 사용해서 요리하네요!
10. 참기름
자주는 아니지만 볶음이나 무침에 마무리로 고소함을 첨가하고 싶을때 꺼내게되네요!
==============================================================================================================

- 생활의 꿀팁 6 밥해먹는 자취생 필수 양념 종류와 보관 방법[욜로리아]
https://youtu.be/XXnFv9Lw-sA
==============================================================================================================

- 칼 갈이 @@@
- 다이소 칼갈이로 이빠진 칼 갈기. (숫돌, 다이소 칼갈이, 과도)
https://youtu.be/PT7ha-hqmvc

- 집에서도 쉽게 칼가는 방법🔪무뎌진 칼 명품으로 갈아봅시다 👈다이소칼갈이 와 토맥그라인더 [윤툴툴]
https://youtu.be/EBFdQv4Uvnc

- 집에서 칼 갈려면 3000원만 투자하세요!! (다이소 3000원 칼갈이 리뷰)
https://youtu.be/mkpi4PyTdjs
==============================================================================================================

- 칼가는법 숫돌, 이정도는 누구나 하는 /조리사자격증 실기 재료썰기 칼질[알찬취업TV 서울시 중부기술교육원]
https://youtu.be/5J9YC16kRHQ

- 이재옥 교수의 칼가는법
https://youtu.be/bsyiIvu-VXY

- [제1탄 양식칼] 아무도 안가르쳐준 칼 가는 영상. 칼 정확하게 가는법[아미요]
https://youtu.be/sQ1F2x_0Beg

- [칼가는법] 다이소 초저렴 칼 가정에서 명품으로 만드는법 / 초급자 전용
https://youtu.be/rvsT6vseyq8

- 칼가는 방법 30년동안 칼만 갈았다 칼의달인!!!
https://youtu.be/DChPu9cgkQ0

- 칼 가는 법, 칼 연마 법, 비밀 공개 영상, 숫돌 칼 연마법[캐삼]
https://youtu.be/cZYzw8ktf60

- 전문가가 알려주는 쉽고 정확한 숫돌로 칼 가는 법 소개! [정성쿡TV 외식 창업의 모든것]
https://youtu.be/lZyhW2dkLIg

- 집에서도 쉽게 따라할 수 있는 '칼가는법'을 소개합니다
https://youtu.be/3yu-xq3_ZhY

- 3.칼갈기_이경래[dinosaur gallery공룡갤러리]
https://youtu.be/795auDaqW_Q
==============================================================================================================
 
- 마음 안정화를 위한 복식훈련 기법
https://youtu.be/qkDjMJkLxIo

- 허리가 아프면? 제일먼저 복식 호흡부터!!
https://youtu.be/EWAml5iqfok
==============================================================================================================

- 저 망해도 좋으니 양치 이렇게만 하시고 치과 오지마세요! [치과의사 이상수]
https://youtu.be/NsdmNIV_sMk
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.27(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
08:30 귀가
09:10 인터넷 서핑 ==> 토스뱅크 파킹 통장(연이자 2%) 개설: 3천만원 이체(저축)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
16:00 집출발(자전거) 
16:50 종료
17:00 다이소 보라매점 방문 ==> 더마 앤모어 판테놀 가려운두피 비듬샴푸(600 ml) (5천원) 구입
17:00 정림슈퍼(신원시장내) 방문 ==> 깐 마늘(국내산, 2,180원) 구입
17:30 CU 편의점(신림4동점) 방문 ==> 캐시워크(걷기 어플) E-쿠폰으로 무료로 물건 구입
17:45 귀가
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림교 => 서원도보교 => 도림 도보교 => 집)
19:30 세븐일렌븐 편의점(관악 평화점) 방문 ==> 기라로쉬 3단우산(만원) 구입(헌혈 후 받은 편의점 상품권으로 구입)
19:50 종료 
20:30 청소(청소기, 밀대)
20:50 샤워(체중: 66kg ==> BMI: 22.94[표준 체중])
21:10 인터넷 서핑
22:30 취침
==============================================================================================================

- 토스뱅크 파킹 통장(연이자 2%) 개설
https://www.tossbank.com/product-service/savings/account
1. 토스뱅크 계좌번호: 100021714655, 비번:5**1, 3천만원 이체(저축)
2. 로그인 비밀번호(6자리): 033**1
3. 상품 정보
 1) 1억원 한도 연금리 2%, 매달 셋재 주 토요일에 이자가 들어옴(월 복리 효과)
 2) 2022년 1월 1일부터 1억원 이하의 금액만 연 2% 금리를 주고 그 이상 금액에 대해서는 0.1% 금리만 적용 
---------------------------------------------------------------------------------------------------------------------------

- 하루만 맡겨도 2% 이자 주는 파킹통장 활용법 4가지[재테크하는 아내, 구채희]
https://youtu.be/8cDsWW1BDhI

- 남는 현금은 무조건 여기에 넣어두세요. 하루만 넣어놔도 연2% 이자가 매일 나옵니다[서대리TV]
https://youtu.be/p7qjNlvOsnQ
1. 토스뱅크 통장: 파킹 통장(연이자 2%)
==============================================================================================================
 
- 토스뱅크 카드(체크 카드) 발급 신청
https://www.tossbank.com/card/benefits
1. 토스뱅크 레몬블루 카드
 1) 카드 번호: 5327 5010 1947 8637, 02/27, 703
2. 카드 받을 주소: 서울테헤란로 432 DB금융센터 18층
 1) 교통카드 기능 신청
---------------------------------------------------------------------------------------------------------------------------

- 난리난 토스뱅크카드[카드 고릴라]
https://youtu.be/qLU_z9hYbfg
1. 연회비도 없고 전원실적 조건도 없음 매일 300원씪 다섯 개 영역에서 캐시백이 됨
==============================================================================================================

- 22.03.27(일) 캐시워크(걷기 어플) E-쿠폰으로 CU 편의점에서 물건 구입(17:30, 집 근처)
1. 캐시워크 앱 ==> 내 쿠폰함
2. 22.03.24(목) 캐시워크 CU 모바일 상품권 구입
1) CU 모바일 상품권 5천원권(7,000캐시) 4장 구입
2) CU 모바일 상품권 3천원권(4,200캐시) 1장 구입
==> 총 23,000원(32,200캐시 사용) 
3. CU 편의점에서 구입한 물건(씨유 신림4동점에서 구입)
1) 백설 중백당 1kg: 2,700원 
2) CJ 국산 꽃 소금 200g:1,600원
3) 오뚜기) 사과 식초 360ml: 1,500원 
4) 진한 참기름 110ml: 4,600원 
5) CJ 재래식 된장 500g: 4,500원
6) 3단 블랙 우산: 10,000원
==> 총 24,900원(부족한 금액(2,000원) 현대카드로 결제)
==============================================================================================================

- 상상인 저축은행 파킹통장 분석
https://www.sangsanginsb.com/dpm00303ma00.view?prdctCd=20003
1. 상품 정보
 1)  중도해지 시에도 예치기간별 약정금리 적용하는 복리식 상품입니다. 대상고객 제한없음 가입금액 10만원 이상 가입기간 24개월 
 가입방법 영업점 가입 연이율 연 2.11%(24개월 기준, 세전) 만기 후 이율
==============================================================================================================

- 요리할때 변질되지 않는 좋은 식용유는 '이것' 입니다.[약사가 들려주는 약 이야기]
https://youtu.be/uuqrz98vWNo

- 의학박사가 골라주는 "최고의 식용유 2개 & 유독성 식용유 12개" (평생필수정보) [굿닥터]
https://youtu.be/L3tNC1LBn_E
1. 아보카도유, 올리브유(엑스트라 버진, Pure)
2. 올리뷰유 선택법: 산도 0.8% 이하, 어두운 용기, 적정량
3. 안좋은 기름(다가 불포항지방산): 카놀라유, 해바라기씨유, 옥수수유, 대두유 ==> GMO 사용
==============================================================================================================

- [코스트코 기름 완벽정리] 피해야할 기름 vs 좋은 기름 콕콕 찝어드립니다[Kate Sheen]
https://youtu.be/oRhAM2ET0Ss
http://webzine.pulmuone.com/?p=3050
1. 카놀라유, 해바라기씨유, 옥수수유, 대두유==> GMO(Genetically Modified Organism: 유전자 변형)로 사용
2. 기름을 얻는 방법 
http://www.icoop.or.kr/coopmall/icoop/icoop_story/detail_story.html?gubun=web&posting=&num=1115
 1) Hexane 화학용매 추출방식: 화학물질(노말헥산: 위험등급 2급)로 녹여낸 식용유(정제유): 절대 사지 말 것
 2) Expeleer-Pressed: 전통방식 그대로 원재료에 열을 가해 강하게 눌러 짜는 압착 방식으로 만듭니다
 3) Cold-Pressed
 
- 건강에 최고인 기름이 건강에 최악의 기름이 될 수 있다[참기름, 들기름, 올리브유, 코코넛오일, 아보카도오일 등등[리틀약사]
https://youtu.be/jRbsityjJGo
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.28(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.29(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

- 일본 니켄 목금도 칼라식도 타공식도 급식 업소용 학원 색상식도 컬러식도 위생식도, 가격: 15,120원, 가격(2개): 27,640원
http://www.11st.co.kr/products/1812254057/share
1. 색상: 파랑, 초록(포항집)
==============================================================================================================

-코멧 홈 단열 아일렛 암막 커튼, 다크블루 (작은 창문용), 135 x 170 cm, 색삭: 다크 블루, 가격: 21,280원(안방 창문용)
https://www.coupang.com/vp/products/180352941?vendorItemId=70296014932&isAddedCart=
1.  안방 창문 크기(120*120cm)
==============================================================================================================

- 칼질 채소썰기 기본영상 조리기능사동영상 기초잡이 입니다[마스터박사부 -마스터요리]
https://youtu.be/SpY3oWC8g4I
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.30(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.03.31(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- DB손보 Prj[★]
- DB손보 소스 분석 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 