

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2009.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2009.12.01(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00  --> 10월 급여(마루정보) 수령

- PS 22 Study
- 원맵 작성 3개 작성(NO.134 ~ NO.141): 작성완료
- DB 복습
==============================================================================================================

- 심화학습 할당
1. 보안 (DB보안) ==> 이주일, 홍완표
2. 데이터베이스 종류(Embedded DB, MMDB, Mobile DB) ==> 백종규, 엄기호
3. 데이터 활용 (Data Conversion, OLAP, MDR <- 메타데이터로 분류되어 있습니다만) ==> 박희찬, 진태만
==============================================================================================================

- 10점 답안연습
문 1) MDR (Meta Data Registry) 
Ⅰ. 표준화된 메타데이터의 유지 관리하는 레지스트리 MDR
- 메타 데이터의 명세와 의미의 공유를 목적으로 등록과 인증을 통하여 표준화된 메타데이터를 유지관리하는 레지스트리 

Ⅱ. MDR 구성도 및 주체별 역할
가. MDR 구성도
- 제출기관(관리항목 제안) ==> 책임기관(검증) ==> 등록주체(등록) ==> 기업사용자(검색, 사용) <==> MDR
나. 주체별 역할

Ⅳ. MDR의 구축시 고려사항
-------------------------------------------------------------------------------------------

- 25점 목차연습
문 2) 텔레마케팅을 통해 많은 매출을 올리고 있는 카드사 B는 부정확한 데이터로 인해 많은 고민이 있다. 
고객정보나 상품가입현황에 애매한 부분이 많아 전화받는 고객들로 부터 많은 클레임이 있는 편이다. 
어쩔 수 없이 많은 돈을 들여 주기적으로 데이터 정비를 실시하고 있지만 여전히 마케팅측에서는 실시간으로 
이용하기 힘들다하여 불만이 많다. 어떻게 해야 이런 상황을 개선할 수 있을 지 개선방안을 제시하시오.

I. 카드사 B의 고객서비스 현황분석 및 시사점 도출
   가. 카드사 B의 고객서비스 현황 분석
        도식화 대상(시스템 현황, 고객의 불만, 마케팅팀의 개선 요구)
   나. 고객 및 마케팅부서 만족도 제고를 위한 시사점 도출
        - 고객측면 : 정확한 고객정보를 통한 신뢰성 있는 마케팅 -> 효율적 데이터 활용 필요
        - 서비스측면 : 주기적인 데이터 정비가 아닌 정확한 데이터 기반 서비스 -> 실시간 서비스 제공 필요

II. 효율적인 마케팅을 위한 추진전략 및 목표시스템
    가. 효율적인 마케팅을 위한 추진전략
         - 데이터 품질측면 : Data Profiling을 통한 cleansing 실시
         - 데이터 관리측면 : Data Quality Management 적용
         - 서비스 측면 : RTE 기반의 운영 환경, 실시간 마케팅을 위한 CRM 서비스 제공
    나. 목표 시스템  

III. 데이터 측면의 개선 방안 및 서비스 측면의 실시간 방안
     가. 데이터 측면의 개선 방안
         - Data Profiling부터 정제, DQM까지의 절차를 도표로 작성
         -  Data Profiling부터 정제, DQM의 구성요소 및 특징을 표로 작성
     나. 실시간 서비스 방안
        - 내부업무 측면 : 기능 요소 리스트 업, 프로그램의 프로그램 개선 및 테스트의 내용을 표로 작성
        - CRM, 개인화 : 기능 요소 리스트 업, 고객이 웹으로 접근하여 서비스 받는 내용을 표로 작성

IV. 개선 이후 안정적인 운영/유지보수 방안
     - 데이터 측면 : 데이터의 안정적인 운영을 위한 데이터 성숙모형인 DQM3의 적용
     - 서비스 측면 : 안정적인 운영시스템을 위한 SLA 기반 아웃소싱 도입
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.02(수) 작업 ■■■■■■■■■■■■■■■■  
---> 07:00 ~ 24:30 

- PS 22 Study
- SE 복습,  DB 복습
==============================================================================================================

- 10점 답안연습
문 1) Mobile DB
Ⅰ. 모바일을 통한 업무 처리시스템 지원 Mobile DB
- 소용량 장비에 탑재 가능, 내장형, 실DB와 복제 및 동기화

Ⅱ. 모바일 DB의구성도 및 핵심 기술
  가. 모바일 DB의구성도
  나. 모바일 DB의 핵심 기술
   
Ⅲ. 모바일 DB의 고려사항 및 해결 방안, 향후 전망  
-------------------------------------------------------------------------------------------

- 25점 목차연습  
문 2) OLTP, DW, OLAP에 대하여 비교하고 BI와의 연계 방안에 대하여 서술하시오.

Ⅰ. 지식기반 의사결정 분석을 위한 OLTP, DW, OLAP

II. OLTP, DW, OLAP의 개념도 및 비교
    가. OLTP, DW, OLAP의 개념도
    나. OLTP, DW, OLAP 활용한 전략 BI

III. OLTP, DW, OLAP와 BI와의 연계 방안
    가. 분석 BI 관점에서 연계 방안 
    나. 전략 BI 관점에서 연계 방안 

IV. OLTP, DW, OLAP와 BI와의 연계시 고려 사항
   가. 경영자 측면
   나. 관리자 측면
==============================================================================================================

- 구매해야할 문구
스카치 테이프, 링 바인드, 볼펜 지우개
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.03(목) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 24:00 

- PS 22 Study
- 보안(SF), 네트워크(NW), 컴퓨터 아키텍처(CA) 복습
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.04(금) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 24:00 

- PS 22 Study
- 기출문제 분석, DB 복습
==============================================================================================================

- STOCKS
월(2,630), 화(2,620), 수(2,700), 목(2,735), 금(2,670)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.05(토) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 24:00 

- PS 22 Study
ㅁ기타
- Part 1(모의고사)
09:10 ~ 10:50: 1교시 10점 유형 모의고사(8문제 적음: 30점)  --> 1교시 시험 이주일님과 2명이서 시험침
11:10 ~ 13:10: 2교시 25점 유형 모의고사(3문제 적음: 35점) --> 백종규님 합류 ==> 평균: 32.5점  
- Part 2(주제발표 등): 홍대리님 합류
14:00 ~ 15:30: 토론(점심 탕수육에 볶음밥)
15:30 ~ 20:20: 200분 모의 고사 평가(전체 팀원들 기술사에게 열의가 없다고 한소리 들음)
ㅁ소감 및 의지
  - 토픽 적고 나서 나를 이해 시키자. 내일 시험 잘 보자. 사실상 토픽은 다 공부한 것임.
ㅁ총 학습시간: 13시간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.06(일) 작업 ■■■■■■■■■■■■■■■■  
---> 09:00 ~ 01:00

- 기술사 실전T(53회)
- 53회 모의고사 실시(동국대학교): 아침에 시험 푸는 연습 많이 하자. 현실 인정하자(2~30점대 실력) 
---------------------------------------------------------------------------------------------------------

ㅁ기타
09:00 ~ 10:40: 1교시(7문제 품: 점) --> 이주일님, 백종규님, 박희찬님
11:00 ~ 12:40: 2교시(3문제 품: 점)
12:40 ~ 13:40: 점심 시간(백종규님이 식권 2개 받아서 밥 하나 더 먹음)
13:40 ~ 15:20: 3교시(3문제 품: 점)
15:40 ~ 17:30: 4교시(3문제 품: 점) ==> 평균: 26점 
 ==> 총 시험 시간: 6시간 40분
ㅁ소감 및 의지
  - 나름대로 치열하게 답을 적었는데 한계를 많이 느꼈음. 답이 없다. 더 열심히 하자...
ㅁ총 학습시간: 8시간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.07(월) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 24:00 

- PS 22 Study
- 원맵 작성 5개 작성(NO.142 ~ NO.157): 작성완료  ====> 원맵: 나를 이해 시켜라.(작성 후 설명할 것)
==============================================================================================================

- 10점 답안연습
문 1) DB 보안

Ⅰ. 데이터베스의 보호를 통한 기업 경쟁력 강화 DB보안 
 - 정보유출 문제 심각, DB를 통한 보안 문제 발생 --> DB 보안(인증, 가용성, 무결성, 기밀성)  --> 접근통제, 허가규칙, 가상 테이블, 암호화
 <----------------- 필요성 ----------------->             <--------- DB보안적용 ----------->         <--------- 구현 기술 ----------->

Ⅱ. DB보안 개념도 및 구성요소
  가. DB보안 개념도
  - 사용자 ==> 인증(IP, 생체인식, PKI, OTP) ==> View 접근 ==> 접근제어(DAC, MAC, RBAC) ==> DB암호화(주민번호, ID), 백업복구
  나. DB보안 구성요소 
-------------------------------------------------------------------------------------------

- 25점 목차연습  
문 2) SOA 기반의 시스템 구축이 활성화 됨에 따라 분산 환경에서의 스토리지와 DB 관리가 중요해지고 있다.
SOA기반 스토리지/DB 관리에 대하여 설명하라.

Ⅰ. SOA기반 분산환경에서의 스토리지 및 DB관리 현황
  - IT 인프라 가상화 관점에서 스토리지/DB 관리 필요성과 기대효과

II.  IT 인프라 가상화를 위한 SOI(Service Oriented Infrastructure) 구성도 및 구성요소
    가. SOA기반 SOI 구성도
    나. SOA기반 SOI 구성요소

III. SOA기반 스토리지/DB 관리 전략
   가. 시스템 측면
   나. 서비스 측면

IV. SOA기반 스토리지/DB 관리시 고려 사항 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.08(화) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 24:00 

- PS 22 Study
- 원맵 작성 6개 작성(NO.142 ~ NO.157): 작성완료
==============================================================================================================

- 10점 답안연습
문 1) DQM3

Ⅰ. 고품질 데이타를 위한 데이터 성숙도 평가 표준 모델 DQM3
     
Ⅱ. DQM3의 3가지 핵심 Factor 및 데이타 품질 모델 요소
  가. DQM3의 3가지 핵심 Factor
- 데이터 기준: 유효성(일관성, 정확성), 활용성(유연성, 보안성, 적시성, 정합성) 
- 데이터 성숙 수준: 도입, 정형화, 통합, 정량화, 최적화 
- 데이터 프로세스: 정책 수립, 요구사항 정의 표준, 흐름 모델수립, 사용자 View, 물리 모델링
  나. 데이타 품질 모델 요소 

Ⅲ. 데이타 품질관리를 위한 전략
  가. 데이타 품질관리 프레임 활용
  나. 데이타 성숙 수준 관리를 위한 매트릭스화 
---------------------------------------------------------------------------------

- 25점 목차연습  
문 2) 기업에서 데이터의 품질을 확보하기 위한 ‘데이터 품질 관리’에 대해 다음 물음에 답하시오.
  (1) 데이터 품질 관리의 개념과 장단점을 설명하시오.
  (2) 관리 대상 및 관리 조직을 기본 축으로 하는 데이터 품질 관리 프레임워크를 설명하시오.
  (3) 관리 조직의 역할을 설명하시오. 

Ⅰ. 기업내 테이터의 품질을 확보를 위한 품질 관리 이슈

II.  데이터 품질 관리의 장단점

III. 데이터 품질 관리 프레임워크 및 관리 조직의 역할
   가. 데이터 품질 관리 프레임워크
   나. 관리 조직의 역할

IV. 데이터 품질 관리 성공 방안
   가. 경영자 측면
   나. Modeler 측면
   다. DBA 측면
==============================================================================================================

- DB2주차 심화학습 할당
박희찬, 홍완표 : DQM, DQM3, Data Profiling, 데이터무결성, 2PC
백종규, 진태만 : 데이터모델링, 데이터독립성, 분산DB, DB용량산정, DB 튜닝
엄기호, 이주일 : 정규화, Tree, Transaction, 동시성제어, 데이터회복, OR Mapping
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.09(수) 작업 ■■■■■■■■■■■■■■■■  
---> 07:00 ~ 24:00 

- PS 22 Study
- 원맵 작성 5개 작성(NO.142 ~ NO.157): 작성완료
==============================================================================================================

- 10점 답안연습
문 1) 데이터 추상화란?

Ⅰ. 데이터에 대한 조작을 효과적으로 수행하기 위한 데이터 추상화
II. 데이터베이스에서 데이터 추상화의 실현 방법
 가. 데이터 모델링을 통한 데이터의 추상화 
  - 현실세계 ==> (데이터, 프로세스) ==> 데이터 모델링 ==> 데이터모델(DB)
 나. 3단계 스키마 구조를 통한 데이터 접근의 추상화
  - 외부 View --> 개념 스키마 --> 내부 스키마 --> 저장
  - 3단계 스키마를 통한 구체적인 데이터의 구조를 은닉
  - 허가된 데이터에 대한 접근만을 허용
---------------------------------------------------------------------------------

- 25점 목차연습  
문 2) Optimizer의 특징, 종류, 구성요소, 적용방법에 대하여 논하시오.

Ⅰ. 데이타의 최적 경로를 찾아주는 도구 Optimizer
   가. Optimizer의 정의
   나. Optimizer의 특징

II.  Optimizer의 종류 및 구성요소
   가. Optimizer의 종류
   나. Optimizer의 구성요소

III. Optimizer의 적용방법

IV. Optimizer의 사용시 주의 사항
==============================================================================================================

- DB2주차 심화학습 할당
박희찬, 홍완표 : DQM, DQM3, Data Profiling, 데이터무결성, 2PC
백종규, 진태만 : 데이터모델링, 데이터독립성, 분산DB, DB용량산정, DB 튜닝
엄기호, 이주일 : 정규화, Tree, Transaction, 동시성제어, 데이터회복, OR Mapping
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.10(목) 작업 ■■■■■■■■■■■■■■■■  
---> 07:00 ~ 24:00  --> 포항집에서 김치, 마른 반찬 받음(택배로 낙성대집에서 직접 받음, 1일 걸림)

- PS 22 Study
- 원맵 작성 6개 작성(NO.142 ~ NO.157): 작성완료
==============================================================================================================

- 10점 답안연습
문 1) 데이터독립성

Ⅰ. 3단계 구조에서의 데이터독립성
 - 외부 Schema ==>(논리적 독립성) ==> 개념 Schema ==>(물리적 독립성) ==> 내부 Schema
Ⅱ. 데이터독립성의 개념도 및 각 스키마의 관리 항목
  가. 데이터독립성의 개념도
  나. 각 스키마의 관리 항목
  다. 데이터 독립성의 종류
  - 논리적 독립성: 개념스키마 변경, 외부스키마에 영향을 안 줌(DATA변경 -> View에 영향 안줌)
  - 물리적 독립성: 내부스키마 변경, 개념스키마에 영향을 안 줌(DB 저장 구조 변경 -> 테이블 구조에 영향 안줌)
Ⅲ. 데이터베이스 스키마 관리의 중요성
---------------------------------------------------------------------------------

- 25점 목차연습  
문 2) 데이터베이스 회복의 정의, 주요 요소,  회복기법에 대해 논하시오.

Ⅰ. DB의 일관된 상태로 복원 데이터 회복
  - 장애 유형: 트랜잭션(Transaction Failure), 시스템(System Failure), 디스크(Mirror 기능)

Ⅱ. DB 회복 기법의 매커니즘 및 주요 회복 기법
  가. DB 회복 기법의 매커니즘
  나. DB 회복 기법의 주요 회복 기법
  - 지연갱신(REDO):  
- 즉시갱신(UNDO):  
- Checkpoint:  
- Shadow Pape 기법: 

Ⅲ. DB 회복 기법 주요 특성 비교

Ⅳ. 효율적인 회복기법을 위한 고려사항
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.11(금) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30~ 24:00 

- PS 22 Study
- UML 강의 수강
==============================================================================================================

- 심화 학습(인포레버 회의실)
1. 올앤 피엔피: 정규화(이주일님), 다음주 수요일 발료 주제: GRID
2. 참석인원: 백종규님, 박희찬님, 홍완표님
==============================================================================================================

- 휴대폰 주소록 작업 방법(애니콜 SPH-S5150)
1. 바탕화면에서 애니콜뮤직 프로그램 실행(휴대폰 USB로 연결 후 작업)
2. 전화번호부 클릭
3. 오프라인 비밀번호: 8801 만 넣으면 됨
4. 전화번호부 화면에서 수정 작업
5. 파일(01. 휴대폰 주소록.CSV)  내려 받기(E:\00. TAMA_DATA\51. My_Room\02_My_주소록 폴더에
==============================================================================================================

- STOCKS
월(2,710), 화(2,765), 수(2,740), 목(2,745), 금(2,750)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.12(토) 작업 ■■■■■■■■■■■■■■■■  
---> 09:00~ 24:00  --> 조기 축구(숏게임 1:2 패)

- PS 22 Study
- DB 마인드맵 작성, DB 총정리
==============================================================================================================

- 신사조기회 월 회비 송금
신한은행: 110-260-713275, 예금주: 박태호(재무) ==> 월 14만원(6~12월까지)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.13(일) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 01:00  --> 53회 모의고사 실시 점수 발표(26점)

- PS 22 08
ㅁ기타
- Part 1(모의고사)
09:10 ~ 10:50: 1교시(8문제 적음: 34점) --> 1교시 시험 이주일님과 박희찬님 10시에 와서 시험침
11:10 ~ 13:10: 2교시(3문제 적음: 39점) --> 홍완표님, 백종규님, 엄기호님 오후에 합류(기술사가 시험 안 치면 나오지 말라고 함)
==> 평균: 36.5점
- Part 2(주제발표 등)
14:00 ~ 15:30: 토론
15:30 ~ 21:50: 200분 모의 고사 평가(53회 모의고사 복기, 40점 아무도 못 넘음, 팀비로 저녁 김밥 사 먹음)
ㅁ소감 및 의지
  - 1교시 시험: 키워드 적을 것, 2교시 시험: 목차 작성할 것(Ⅱ, Ⅲ, Ⅰ 단락 순으로 작성)
  - 최기선 기술사 조언(마인드 컨트롤: 나는 꼭 합격한다)
ㅁ총 학습시간: 13시간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.14(월) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 01:00 --> 한솔B/D 301호 전세집 뺀다고 통보(여정자 주인)

- PS 22 Study
- 원맵 작성 10개 작성(NO.158 ~ NO.188): 작성완료 ===> 원맵 1일 10장 이상 작성할 것(CA,IS: 31개, NW: 36개, SF: 37개)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.15(화) 작업 ■■■■■■■■■■■■■■■■  
---> 08:30 ~ 01:00

- PS 22 Study
- 원맵 작성 8개 작성(NO.158 ~ NO.188): 작성완료
==============================================================================================================

- 예금 만기 찾기(인터넷 뱅킹으로 찾음)
- 프라임 저축은행 정기예금 신규결과(2008.12.15  13:14:27) 
상품명: 정기예금(복리) 신규계좌번호: 011-02-24-0491937 
예치기간: 12 개월 예치금액: 5,600,000원 
이자지급방법: 만기일시지급(복리)  계약금액: 5,600,000원 
세금우대여부: 세금우대  기본이율/특별이율: 9.05 %
만기일자: 2009/12/15
출금계좌번호: 011-02-13-0086600  
-------------------------------------------------------------------------------
- 프라임 저축은행정기예금 신규결과(2008.12.15  13:15:57) 
상품명: 정기예금(복리) 신규계좌번호: 011-02-24-0491945 
예치기간: 12 개월 예치금액: 400,000원 
이자지급방법: 만기일시지급(복리)  계약금액: 400,000원 
세금우대여부: 일반  기본이율/특별이율: 9.05 %
만기일자: 2009/12/15
출금계좌번호: 011-02-13-0086600 
===> 총 금액: 6,490,705만원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.16(수) 작업 ■■■■■■■■■■■■■■■■  
---> 09:00 ~ 01:00

- PS 22 Study
- 원맵 작성 7개 작성(NO.158 ~ NO.188): 작성완료
==============================================================================================================

- 심화 학습(인포레버 회의실)
1. 올앤 피엔피: CA 일반(백종규님), 가용성(이주일님), 진태만(GRID), XML(홍완표님)
2. 참석인원: 이주일님, 백종규님, 홍완표님, 엄기호님
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.17(목) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 01:00

- PS 22 Study
- 원맵 작성 7개 작성(NO.189 ~ NO.207): 작성완료
==============================================================================================================

- 전세 안 빠짐
계약기간이 종료되면 임차권 등기를 하시고 소액재판을 신청하시고
확정판결이후 압류를걸어 경매실행을 하면 집주인이 바로 돈을줄것입니다
 계약종료후 님이유리하며 기간은 3-6월정도 걸립니다
==============================================================================================================

- 포항집에 가져 가야 할 것(2010.02.13 설)
반찬통, 코트
-----------------------------------------------------------------------------------------------------------------------

- 포항집에서 가져 올 것
김치, 반찬, 바인더
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.18(금) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 01:00

- PS 22 Study
- 원맵 작성 8개 작성(NO.189 ~ NO.224): 작성완료
==============================================================================================================

- 전세집 구하기(금강 부동산: T) 02-888-8131: 최과장)
1. 인헌중 근처(전세 6천, 2층)
2. 행운 주민센터 근처(전세 5천 5백, 1층) ==> 추천
3. 교회 근처(전세 5천 5백: 방 2개, 반지하층)
4. 한솔 B/D 근처(전세 5천, 1층) ==> 추천
주인집 말: 계약은 하지 말고 1월 15일까지 전세값은 준다고 함
==============================================================================================================

- 마트에서 구매할 것
동아 애니볼 볼펜(빨간, 파란색), 마우스, 볼펜 지우개, 포스잇(라벨링), 반바지
==============================================================================================================

- STOCKS
월(2,845), 화(2,870), 수(3,050), 목(3,000), 금(3,050)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.19(토) 작업 ■■■■■■■■■■■■■■■■  
---> 09:00 ~ 01:00

- PS 22 Study
- DB 마인드맵 작성, CA 총정리
==============================================================================================================

- 전세 계약: 한솔 부동산 주선 T) 02-888-8131: 최과장) 
1. 행운 주민센터 근처(전세 5천 5백, 1층)
2. 행운 부동산에서 계약 체결(대표: 안상규, T) 02-882-0, 차영희 실장(*)
3. 계약금 송금: 농협(150-02-378337 김경진(010-7942-0)), 3백만원 ==> 송금 완료
4. 주소: 서울시 관악구 봉천동 106-23 101호 임대인: 정평순(010-3169-0)
5. 주인 계좌번호: 제일은행(179-20-0 정평순)
6. 면적: 23.913m2(7.23평)
7. 특약 사항
  1) 계약 만료시 2개월 전에 임대인에게 알려 줄 것
  2) 수도세 월 5천원
8. 기타
- 한솔 주인인 1월 15일까지 전세값(3천만원)은 준다고 함  ==> 이사시에 계약서, 키 절대 주지 말 것
- 다음 방 구할 때는 카메라 가지고 가서 찍어 올 것
- 중계 수수료: 22만원(미납)
==============================================================================================================

- 주말에 해야할 일
2. 기출문제분석 과목명 달기(04. 기출문제분석(53회~89회))
3. PMP+P 완독하고 기술사에게 돌려줄 것: 못 보고 돌려줌
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.20(일) 작업 ■■■■■■■■■■■■■■■■  
---> 07:00 ~ 01:00  --> 저녁에 전세집에 찾아가서 디카로 방구조 찍어옴

- PS 22 08
ㅁ기타
08:00: 학원 도착
10:00 ~ 12:20: 기술사님이 일찍 와서 CA 설명 ==> 히터 고장나서 2시간 동안 추위에 떨음
12:20 ~ 13:00: 점심 식사
13:00 ~ 13:40: 모의고사 1교시(5문제 적음: 17점) 
15:20 ~ 17:00: 모의고사 2교시(3문제 적음: 31점) ==> 평균: 24점
15:00 ~ 19:00: 토론(저녁에 피자 시켜 먹음(2판))
15:30 ~ 20:10: 모의고사 평가(시험 못 쳤다고 엄청 갈굼 당함) 
ㅁ소감 및 의지
  - 1교시 시험: 최선을 다하자. 토욜날 시험 준비 철저히 할 것. 너는 할 수 있다..나는 믿는다. 
ㅁ총 학습시간: 13시간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.21(월) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 01:30 --> 낙성대 전세집 관리비 자동이체 중지(하나은행 여정자)

- PS 22 Study
- 10점 예상 문제 등록
1) 문제 - 관계형 DB의 반정규화가 필요한 이유를 설명하시오.
2) 사유 - 단답형 문제로 정규화 문제는 출제 되었고 이번에는 반정규화가 나올 것으로 예상

1) 문제 - Data Profiling과 Data Cleansing을 비교하시오.
2) 사유 - Profiling, Cleansing 한 번 이상 출제 되었든 문제로 나온다면 비교 문제가 나올 것으로 예상

1) 문제 - DA(Data Architecture)
2) 사유 - Data Architecture 문제는 고전적인 문제로 DB에 대한 지식을 폭넓게 파악할 수 있으므로 출제 예상됨

1) 문제 - Index 선정 절차를 설명하시오.
2) 사유 - 실무형인 Index 선정에대한 문제 출제 예상됨

1) 문제 - BCNF(Boyce/Codd Normal Form) 정규화 설명하시오.
2) 사유 - 정규화 문제 출제 예상됨

1) 문제 - Data 보안을 관리정책 측면에서 설명하시오.
2) 사유 - Data 보안에 대한 중요성이 강조되고 있으므로 출제 예상됨

1) 문제 - DQM3의 데이터품질기준에 대해 설명하시오.
2) 사유 - DQM3에 대한 상세 단계까지 출제 예상됨

1) 문제 - OR Mapping
2) 사유 - 단답형 문제로 OR Mapping의 출제 예상됨

1) 문제 - MDR
2) 사유 - 메타 데이타 관련 문제 출제 예상됨

1) 문제 - MMDB와 Mobile DB를 비교 설명하시오.
2) 사유 - MMDB와 Mobile DB 관계 출제 예상됨
--------------------------------------------------------------------------------------------------------

- 원맵 작성 10개 작성(NO.189 ~ NO.224): 작성완료
- 원맵할당(Network) 
박희찬 : 244(NMS), 247(상황인식), 250(CDN), 255(Wibro), 256(HSDPA), 258(QPS)
백종규 : 264(OFDM), 266(라우팅 프로토콜), 267(OSI 7 Layer, TCP/IP), 268(DWDM), 280(CSMA/CA), 284(Internetworking)
엄기호 : 254(센서네트워크), 277(팸토셀), 279(Home Networking), 281(모바일 TV), 282(MVNO), 283(UsN)
이주일 : 249(오버레이네트워크), 252(무선 매쉬 네트워크), 262(ISM Band), 265(Tunneling), 272(L7 Switch), 274(MPLS)
진태만 : 243(Ad Hoc Network), 245(BWLL), 246(WPAN), 248(무선Lan), 251(WCDMA), 253(BCN)
홍완표 : 257(IPv6), 269(VOIP), 271(CoIP), 286(QoS), 287(IP Multicast), 289(Mobile IP)
==============================================================================================================

- 10점 답안연습
문 1) RTOS(Realtime OS)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.22(화) 작업 ■■■■■■■■■■■■■■■■  
---> 08:30 ~ 11:30

- PS 22 Study
- 원맵 작성 9개 작성(NO.189 ~ NO.224): 작성완료
==============================================================================================================

- 10점 답안연습
문 1) 소프트웨어 재사용
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.23(수) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 11:30

- PS 22 Study
- 심화 학습(인포레버 회의실)
1. 올앤 피엔피: BIA(백박희찬), 진태만(PLM)
2. 참석인원: 전원 참석(최기선 기술사 떡뽑기 사들고 왔다 감)
------------------------------------------------------------------------
- 모범 답안 작성 할당
진태만 : PLM(Product Lifecycle Management)
박희찬 : BIA
백종규 : ITIL V3
엄기호 : u-Factory
이주일 : Data Architecture
홍완표 : BI 2.0
==============================================================================================================

- 10점 답안연습
문 1) 프라이빗 클라우드 컴퓨팅
문 1) RTOS(Realtime OS)
==============================================================================================================

- 바른글씨(http://www.glssi.com)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.24(목) 작업 ■■■■■■■■■■■■■■■■  
---> 07:00 ~ 11:30

- PS 22 Study
- DB 마인드맵 작성, NW 총정리
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.25(금) 작업 ■■■■■■■■■■■■■■■■  
---> 19:00 ~ 02:00  --> 성탄절(공휴일)

- PS 22 Study
▦조기축구
06:10 기상
07:00 신구초등학교 도착(차로 감)
08:00 숏게임 4:2 승
10:30 종료
11:30 중식(떡국(숙현이형이 쏨): 종록이형, 패턴일 형, 병용이, 정홍)
13:30 귀가 
==============================================================================================================

- 모범 답안 작성 할당
진태만 : PLM(Product Lifecycle Management)  
==> Anti Forensic, DLP(Data Leakage Prevention), SQL Injection, VPN(IPSec, SSL, MPLS), RMS, PDOS, 
Active Honeypot, MFA, Mobile Security

■ Anti Forensic
Ⅰ. 자신에게 불리한 증거물 차단 기술 Anti Forensic
Ⅱ. Anti Forensic 기법 종류 및 대응 방안
  가. 데이터 복구기법회피, 증거물생성사전봉쇄, 데이터 은닉-암호화
  나. Anti Forensic 대응 방안
http://blog.naver.com/PostView.nhn?blogId=chobitsll00&logNo=68322675
-------------------------------------------------------------------------------------------------------

■ DLP(Data Leakage Prevention)
Ⅰ. 기업 정보유출 방지를 위한 DLP
Ⅱ. DLP의 시스템 구성체계 및 주요기능
  가. DLP의 시스템 구성체계
  나. DLP의 시스템의 주요기능

■ DLP(Data Loss Prevention)
Ⅰ. 내부정보유출 방지를 위한 DLP
Ⅱ. DLP의 구성도 및 구성기술
  가. DLP의 구성도
  나. DLP의 구성기술
==============================================================================================================

- STOCKS
월(2,780), 화(2,795), 수(2,790), 목(2,785), 금()
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.26(토) 작업 ■■■■■■■■■■■■■■■■  
---> 08:30 ~ 02:00  --> 이과장 인도에서 문자로 이별 통보(무능한 자신 원망 ==> 복수)

- PS 22 Study
- 심화 학습(인포레버 회의실)
PLM(이주일님 재발표) --> Data Architecture(이주일님) --> u-Factory(엄기호님) --> BI 2.0(홍완표님) 
--> ITIL V3(백종규님)
Pair Programming(박희찬님) --> TDD(박희찬님) --> N/W 개론(백종규님)
==============================================================================================================

- inforever 무선 네트워크 연결(노트북 가지고 감)
inforever/inforever20009
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.27(일) 작업 ■■■■■■■■■■■■■■■■  
---> 08:00 ~ 01:00

- PS 22 08
ㅁ기타
08:00: 학원 도착
10:00 ~ 12:20: N/W 개론 발표(박종규님)
12:30 ~ 13:10: 점심 식사
13:20 ~ 15:00: 1교시 모의고사(9.5문제 적음: 46점) 
15:20 ~ 17:00: 2교시 모의고사(3문제 적음: 35점) ==> 평균: 40.5점
17:20 ~ 18:20: 200분 모의 고사 평가(개인별 면담)
                    1. 경험(간접 경험), 지식 약함 ==> 논문과 잡지를 많이 읽을 것 
                    2. 숙제( 1) 개발 경험 극대화 방안, 2) 합격을 위한 단기 전략 수립)  ===> 눈 와서 일찍 감
ㅁ소감 및 의지
  -  좀 더 전투적으로 답안을 작성하자. 열심히 더 열심히 하자.
ㅁ총 학습시간: 12시간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.28(월) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 01:00

- PS 22 Study
- 원맵 작성 11개 작성(NO.225 ~ NO.261): 작성완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.29(화) 작업 ■■■■■■■■■■■■■■■■  
---> 07:30 ~ 01:00

- PS 22 Study
- 원맵 작성 15개 작성(NO.225 ~ NO.261): 작성완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.30(수) 작업 ■■■■■■■■■■■■■■■■  
---> 08:30 ~ 01:30

- PS 22 Study
- 원맵 작성 8개 작성(NO.225 ~ NO.261): 작성완료
==============================================================================================================

- 심화 학습(인포레버 회의실) 
1. 참석인원: 엄기호 과장 불참
2. CISSP#2. 통신(백종규님 발표)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.12.31(목) 작업 ■■■■■■■■■■■■■■■■  
---> 08:30 ~ 01:30

- PS 22 Study
- 원맵 작성 6개 작성(NO.225 ~ NO.261): 모든 원맵 작성완료  ==> 디카로 찍어서 보관
==============================================================================================================

- STOCKS
월(2,760), 화(2,720), 수(2,800), 목(), 금()
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■