

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2009.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2009.10.01(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 16:00 --> 추석 연휴 하루전 날(이발)

- KIAT SM
- 중간평가 처리 시 에러 --> 처리완료
요청: 대구 기획단 윤진식(JSYOUN/y00724) 연구원
윤진식_중간평가 처리 시 에러 
--과제기본 정보 수정   @@@@@@@@@@@@@    
UPDATE RSUBJECT S   
SET S.REDM_CLSF = '2'   --관리기관(1:산기평,2:기획단, 3:미정)  ==> 3 -> 2로 수정 
WHERE S.SBJCT_ID IS NOT NULL
    AND S.SBJCT_ID IN ('70002619')  --과제번호(70007285)
--; 
==============================================================================================================

- 확정승인일 변경 요청 --> 처리완료
요청: 광주 기획단 김상영(HRSKSY/fdcm19) 연구원 
과제번호 : 70006528, 주관기관: 레드원테크놀러지(주) 
확정승인일인 2009.07.29로 수정을 부탁
==============================================================================================================

- 평가위원 등록 요청 --> 처리완료
요청: 충북 기획단 황형서(HWANGHS92/bthwang92) 연구원
1. 원태수 이사 ( 유영제약 연구소장) 6000315-1002139 
2. 박성규 박사 (한국생명공학연구원) *
==============================================================================================================

- 결과확정 수정 요청 --> 처리완료
요청: 부산 기획단 김재수(MISOBINI/alth1003) 연구원
과제번호: 70003220  --> 업무계획ID: 70009730
==============================================================================================================

- 현장실태조사 이전으로 복귀 요청  --> 처리완료
요청: 부산 기획단 탁영지(TAKYJ/t3141) 연구원
70007254 -7건, 70007183 -3건, 70007248 -3, 70007411 -3, 70007043 -4 =======>
70007321 -3, 70007420 -5, 70007081 -3, 70007326 -3, 70007025 -3 ==============>
70007420(중복), 70007243 -5, 70007216 -8, 70007333 -4, 70007353 -3 =======>
업무계획ID: 70009614(6건)  ---> 과제번호: 70007254, 70007268, 70007322, 70007337, 70007479, 70007481
업무계획ID: 70009615(3건)  ---> 과제번호: 70007183, 70007313, 70007324
업무계획ID: 70009527(3건) ---> 과제번호: 70007248, 70007319, 70007323
업무계획ID: 70009529(3건) ---> 과제번호: 70007411, 70007433, 70007463
업무계획ID: 70009532(4건) ---> 과제번호: 70007043, 70007045, 70007077, 70007078   =======>
업무계획ID: 70009533(3건) ---> 과제번호: 70007321, 70007371, 70007397  
업무계획ID: 70009530(5건) ---> 과제번호: 70007420, 70007477, 70007484, 70007486, 70007488
업무계획ID: 70009526(3건) ---> 과제번호: 70007081, 70007477, 70007484 
업무계획ID: 70009528(3건) ---> 과제번호: 70007326, 70007366, 70007410  
업무계획ID: 70009525(3건) ---> 과제번호: 70007025, 70007104, 70007359  ==============>  
업무계획ID: 70009534(5건) ---> 과제번호: 70007243, 70007264, 70007266, 70007267, 70007270
업무계획ID: 70009546(8건) ---> 과제번호: 70007216, 70007231, 70007272, 70007330, 70007336, 70007343, 70007388, 70007457
업무계획ID: 70009547(4건) ---> 과제번호: 70007333, 70007357, 70007358, 70007434 
업무계획ID: 70009545(3건) ---> 과제번호: 70007353, 70007392, 70007421=======>  
-- 업무계획 정보  삭제   @@@@@@@@@@@@@  
DELETE FROM RDUTY_PLAN A
WHERE A.PLAN_ID IS NOT NULL 
     AND A.PLAN_ID IN ('70009614')  --업무계획ID
--; 
-- 과제진행이력 정보 삭제 @@@==> 진행업무분류가('4221')인 것 삭제 
DELETE FROM RSBJCT_PRGS P
WHERE P.SBJCT_ID IS NOT NULL
      AND P.SBJCT_ID = '70007268' --과제번호  (70003220, 70001425)
       AND P.DUTY_CD IN ('4221') --진행업무분류(6624:협약결과확정(체결))
--;  
--------------------------------------------------------------------------------------------------------

- 평가위원 등록 요청 --> 처리완료
요청: 부산 기획단 탁영지(TAKYJ/t3141) 연구원
이름 : 김세진, 한국산업기술평가관리원 
==============================================================================================================

- 담당간사 리스트 요청 -->  처리완료
요청: 민재웅  연구원
과제번호: 70006529  
금일에 한해 세부비목을 입력토록 접근 가능하도록 처리
==============================================================================================================

- 담당간사 리스트 요청 -->  처리완료
요청: 신한은행 고영민
과제번호, 단계, 차수, 담당간사
==============================================================================================================

- STOCKS
월(3,050), 화(3,025), 수(3,010), 목(3,000)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 10:30 ~ 18:00  --> 휴가

- KIAT SM
- 계비 
1. 나눔90동기회 계비(2,555,100원), 포항계 계비(1,640,000원)  ====> 총 계비: 4,195,100원
2. 태정이 통장으로 포항계 총 회비 1,640,000원 송금(총무 교체) --> 완료(072-02-255993  농협 권태정)
3. 나눔90동기회 계비(2,555,100원) ====> 현재 존재
4. 신사조기회 회비: 2009년 06월 분부터 못 냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.06(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:30 ~ 18:00  --> 휴가2, 89회 정보관리 기술사 합격자 발표(충격)

- KIAT SM
- 기술사실전 TEST 대비 공부
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.07(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:30 ~ 18:00  --> 휴가3

- KIAT SM
- 기술사실전 TEST 대비 공부
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00

- KIAT SM
- 평가결과를 조기완료로 입력 안됨 --> 처리완료
요청: 울산 기획단 김도한(SENSOR71/kdh7122) 연구원
과제번호 70004625, 크리에이티브퍼스의 과제가 조기완료로 판정이 났는데 평가결과를 조기완료로 입력 안됨
일단 계속으로는 저장이 되는데, 조기완료로 수정하여 저장하면 되지가 않네요.  
조치: 접수기한일이 입력되지 않아서 조기완료가 안되었든 것(RCPT_LMT_DATE: 20091130 입력 후 등록)
심의결과: 계속 --> 조기완료로 수정
-- 보고서접수 정보 등록   @@@@@@@@@@@@@   ==> 조기완료인 경우 1002 로 넣어줌
INSERT INTO RREPORT(SBJCT_ID, SBJCT_STEP, SBJCT_ORDR, REPORT_CD, RCPT_DATE
, RCPT_MBR_ID, RCPT_TYPE_CD, RPT_CLSF, RCPT_LMT_DATE
, SBJCT_PRGS_SEQ, REG_MBR_ID, RPT_MBR_ID, TONGBO_GUBUN, REG_TIME)
  VALUES('70004625', '0', '0', '1002', '99991231', '00000001', '1001', '1'
,TO_CHAR(TO_DATE(''), 'YYYYMMDD') --RCPT_LMT_DATE(접수기한일) 등록 안됨
, '25', '10046197', '00000001', 'N', SYSDATE)
--;
==============================================================================================================

- 지역R&D시스템 현황 파악 --> 처리완료
1. 서버, DB, 소스, 솔루션 현황 파악
2. 기한: 17시까지 윤형기(*@*.*, *@*.*) 연구원 메일로 제출
3. 지역R&D시스템 담당자 변경(이창욱 연구원 --> 윤형기 연구원(H) *, 내선:3087))
==============================================================================================================

- 평가일 수정 --> 처리완료(일부)
요청: 부산 기획단 탁영지(TAKYJ/t3141) 연구원
과제번호: 70007269, 평가일(2009.09.1 --> 2009.09.18)
-- 과제진행이력 정보 조회   @@@@@@@@@@@@@  
SELECT A.SBJCT_ID 과제번호, A.ORDR, A.SEQ, TO_CHAR(TO_DATE(A.AVAIL_SDATE,'YYYYMMDD'),'YYYY.MM.DD') "발생일(평가일자)"  
FROM RSBJCT_PRGS A
     ,(SELECT    P1.SBJCT_ID,P2.MSEQ,P2.DUTY_CD,P1.AVAIL_SDATE,P1.DCSN_INFRM_DATE,P2.SBJCT_STEP,P2.ORDR
        FROM    RSBJCT_PRGS P1 ,
        ( SELECT    SBJCT_ID,DUTY_CD,MAX(SEQ) MSEQ,SBJCT_STEP,ORDR
         FROM    RSBJCT_PRGS 
         WHERE    DUTY_CD IN ('4224','4324','4424','4524')
         GROUP BY SBJCT_ID,DUTY_CD,SBJCT_STEP,ORDR
           ) P2
     WHERE P1.SBJCT_ID =P2.SBJCT_ID
        AND P1.SEQ = P2.MSEQ 
     ORDER BY SBJCT_ID DESC
    ) PS2
WHERE A.SBJCT_ID ='70007353'    --과제번호
    AND A.DUTY_CD IN ('5214','5224','5244','5314','5324','5414','5424','5514','5524')
    AND A.SBJCT_ID = PS2.SBJCT_ID(+)
    AND '4'SUBSTR(A.DUTY_CD,2,1)'24' = PS2.DUTY_CD(+)
    AND A.SBJCT_STEP = PS2.SBJCT_STEP(+)
    AND A.ORDR = PS2.ORDR(+) 
--; 
-- 과제진행이력 정보 수정   @@@@@@@@@@@@@  
UPDATE RSBJCT_PRGS P
SET P.AVAIL_SDATE  = '20090918'   -- 발생일(평가일)
WHERE P.SBJCT_ID IS NOT NULL
    AND P.SBJCT_ID = '70007269'    --과제번호
     AND P.SEQ = '4'               --SEQ  
--; 
-- 과제관련자 변경 이력 정보 조회   @@@@@@@@@@@@@ 
SELECT IA.SBJCT_ID, IA.AVAIL_SDATE 유효시작일, IA.AVAIL_EDATE
FROM RSBJCT_MBR_HSTR IA 
WHERE IA.MBR_ID IS NOT NULL 
  AND IA.ROLE_CD = '1006'          --구성원 참여 역할(1006:총괄책임자)
  AND IA.AVAIL_EDATE = '99991231'    --유효종료일 
   AND IA.SBJCT_ID = '70007353'    --과제번호
--;         
-- 과제관련자 변경 이력 정보 수정   @@@@@@@@@@@@@  
UPDATE RSBJCT_MBR_HSTR IA
SET IA.AVAIL_SDATE  = '20090819'   -- 발생일(평가일)
WHERE IA.MBR_ID IS NOT NULL 
  AND IA.ROLE_CD = '1006'          --구성원 참여 역할(1006:총괄책임자)
  AND IA.AVAIL_EDATE = '99991231'    --유효종료일 
   AND IA.SBJCT_ID = '70007353'    --과제번호
--;    
==============================================================================================================

-  최종보고서 미제출로 나오는 문제 요청 --> 처리완료
요청: 대구 기획단 모중환(JHMOH1/password) 연구원
원인: 최종보고서 미제출로 나옴
과제번호: 70003127 
-- 보고서접수 정보 @@@@@@@@@@@@@  
SELECT P.RCPT_DATE 보고서접수일, P.SBJCT_ID 과제번호, P.SBJCT_STEP 과제단계, P.SBJCT_ORDR 차수, P.REPORT_CD,  
       (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE = '7064' AND SUB_CODE = P.REPORT_CD) 접수보고서종류, 
       P.RCPT_DATE 보고서접수일, RCPT_INFRM_DATE "접수확인통보일", P.RCPT_MBR_ID 접수담당자, P.RPT_CLSF 보고서구분,  
       (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE = '1027' AND SUB_CODE = P.RCPT_TYPE_CD) 접수형태, 
       RCPT_LMT_DATE 접수기한일, TONGBO_GUBUN 통보구분, --통보구분(N:미통보,A:안내,D:독촉,G:경고,K:최고,I:이월)
       P.OFFCL_ABSTR_SUMM "공식초록요약내용", P.DVLP_BCKGRND "개발배경", P.PRDCT_DESC "당해기술, 제품에대한설명" 
FROM RREPORT P
WHERE P.SBJCT_ID IS NOT NULL
AND P.SBJCT_ID = '70003127'    --과제번호 
AND P.REPORT_CD = '1002'
--AND P.RCPT_DATE = '99991231'   --보고서접수일 
ORDER BY P.REG_TIME
--;
==============================================================================================================

- 평가위원 등록 요청 --> 처리완료
요청: 충남 기획단 김대환(RDKIM/9850396) 연구원
이름 : 성하수(12915954), 유익동(00200709) 
간사 등록: 임치영
==============================================================================================================

- 평가위원 등록 요청 --> 처리완료
요청: 대구 기획단 모중환(JHMOH1/password) 연구원
이름 : 이상국(12918656)
==============================================================================================================

- 총괄책임자 변경 요청 --> 처리완료
요청: 전남 기획단 황금연(HWANGTWO/chindo) 연구원
과제번호 : 70004588  ===> 일반과제 이기 때문에 수동으로 처리 
구 책임자 : 노억수(12849007) --> 명대권(12908590: *)
-- 현재과제 총괄책임자 조회    @@@@@@@@@@@@@
SELECT S.SBJCT_ID, M.MBR_ID, M.MBR_NM, M.LOGIN_ID, M.PASSWORD
FROM RSUBJECT S, MEMBER M
WHERE S.SBJCT_ID = '70004588'   --과제번호
AND M.MBR_ID = S.CHRGR_MBR_ID
--; 
-- 총괄책임자 수정 @@@@@@@@@@@@@
UPDATE RSUBJECT 
SET CHRGR_MBR_ID = '12908590' --총괄책임자ID(노억수(12849007) --> 명대권(12908590))
WHERE SBJCT_ID = '70004588' --과제번호
--; 

-- 과제관련자 변경 이력 정보 조회  @@@@@@@@@@@@@  
SELECT M.MBR_ID 구성원ID,  M.ROLE_CD 구성원_참여_역할CD, 
      (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE='7051' AND SUB_CODE = M.ROLE_CD)  AS 구성원_참여_역할, 
      AVAIL_SDATE 유효시작일, AVAIL_EDATE 유효종료일, BUSI_ID 소속회사_ID 
FROM RSBJCT_MBR_HSTR M
WHERE M.SBJCT_ID IS NOT NULL
    AND M.SBJCT_ID = '70004588'      --과제번호
    AND M.AVAIL_EDATE = '99991231'   --유효종료일
    AND M.ROLE_CD = '1005'   --구성원_참여_역할(1005:총괄책임자)
    --AND M.CHRGR_MBR_ID IN ('12915493')      --최종과제책임자ID 
--;

--해당과제의 과제관련자 변경이력 등록 @@@@@@@@@@@@@ 
INSERT INTO RSBJCT_MBR_HSTR
            (MBR_HSTR_SEQ, SBJCT_ID, MBR_ID, AVAIL_SDATE, AVAIL_EDATE
           , ROLE_CD, SBJCT_SEQ, BUSI_ID, REG_MBR_ID, REG_TIME
            ) 
SELECT   (SELECT NVL(MAX(MBR_HSTR_SEQ), 0) FROM RSBJCT_MBR_HSTR
        WHERE SBJCT_ID = A.SBJCT_ID) 
        + (ROW_NUMBER() OVER(PARTITION BY A.SBJCT_ID ORDER BY ROWNUM)) MBR_HSTR_SEQ
        , A.SBJCT_ID
        , '12908590' "구성원ID"   --구성원ID(노억수(12849007) --> 명대권(12908590))
        , TO_CHAR(SYSDATE, 'yyyymmdd') "유효시작일"  
        , '99991231' "유효종료일"             
        , '1005'  "구성원_참여_역할"         --구성원_참여_역할(1005:총괄책임자)
        , A.LAST_HSTR_NUM
        , (SELECT NVL(NDEPT_ID, '99999999') FROM RMEMBER WHERE MBR_ID ='10033014') REG_MBR_ID
        , '12915493'  "등록자ID"
        , SYSDATE
FROM RSUBJECT A
WHERE AVAIL_EDATE = '99991231'
    AND SBJCT_ID = '70004588'     --과제번호
--; 
--해당과제의 과제관련자 변경이력 수정 @@@@@@@@@@@@@
UPDATE RSBJCT_MBR_HSTR
SET AVAIL_EDATE = TO_CHAR(SYSDATE-1, 'yyyymmdd')     --유효종료일
    ,REG_MBR_ID = '12915493'        --등록자ID
    ,REG_TIME = SYSDATE
WHERE SBJCT_ID = '70004588'    --과제번호
    AND AVAIL_EDATE = '99991231'
    AND ROLE_CD = '1005' --구성원_참여_역할(1005:총괄책임자)
    AND MBR_ID = '12849007' --구성원ID(노억수(12849007) --> 명대권(12908590))
--;
--해당과제의 과제관련자 변경이력 수정 @@@@@@@@@@@@@
UPDATE RSBJCT_MBR_HSTR M
SET  M.MBR_ID = '12908590' --총괄책임자ID(노억수(12849007) --> 명대권(12908590))
WHERE M.SBJCT_ID IS NOT NULL
    AND M.SBJCT_ID = '70004588' --과제번호
    AND M.ROLE_CD = '1005' --구성원_참여_역할(1005:총괄책임자)
    AND M.BUSI_ID IN ('10088717')      --소속회사_ID
--;
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:00

- KIAT SM
- 지역평가위원회(업무계획)으로 돌리기 요청 --> 처리완료
요청: 충남 기획단 김대환(RDKIM/9850396) 연구원
과제번호: 70007193, 70007217, 70007311, 70007444, 70007455, 70007471, 70007482 
==============================================================================================================

- 2009년 선정 과제리스트 출력 요청 --> 처리완료
요청: 백낙주 연구원 
==============================================================================================================

- 전산입력 관련 요청 --> 
요청: 충북 기획단 황형서(HWANGHS92/bthwang92) 연구원
중간평가 입력 시 점수부분에  대한 블랭크를 없애주시고 입력이 가능하게끔 조정
과제번호: 70004153
--과제별평가 정보 조회   @@@@@@@@@@@@@
SELECT  S.SBJCT_ID 과제번호, SBJCT_SEQ 순번, MBR_ID 평가자ID,
(SELECT MBR_NM FROM MEMBER WHERE MBR_ID=S.MBR_ID) 평가자, 
        (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE='7011' AND AVAIL_EDATE='99991231' 
AND SUB_CODE=S.GRD_DUTY_CD) 평가관련업무분류, .GRADE_POINT "평가위원회 점수", 
        (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE='7051' AND AVAIL_EDATE='99991231' 
AND SUB_CODE=S.GRD_ROLE_CD) 평가역할구분, 
        S.FIELD_GRADE "현장실태조사점수", S.MNGMT_GRADE "우대배점", VISIT_DATE "조사일자",   
        S.SUMMIT "종합의견", REG_MBR_ID "등록자", REG_TIME "최종수정일시"
FROM RSBJCT_GRADE_INFO S
WHERE S.SBJCT_ID IS NOT NULL
    AND S.SBJCT_ID IN ('70004153') --과제번호
    --AND S.SBJCT_SEQ = '24' --순번
ORDER BY S.REG_TIME DESC
--;
==============================================================================================================

- STOCKS
월(2,960), 화(3,030), 수(3,070), 목(3,010), 금(2,930)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 18:00

- KIAT SM
- 사업비편성내역 수정 요청 --> 처리완료
요청: 민재웅(MINJW316/ghddlr1) 연구원
분과명: 전자정보3분과, 과제번호: 70007213  
정부출연금 편성금액 변경시 "출연금이 0%이상으로 불가합니다...."라는 오류메시지가 뜨는 바람에 입력 안됨
if(govRatio > <%= govMax %>){
//msg = "정부출연금 비율이 <%= govMax %>%를 초과 하였습니다.2\n";
}
==============================================================================================================

- 중간보고서 미제출 에러 처리 요청 --> 처리완료  
요청: 경남 기획단 홍정규(DRHJK77/tank5273) 연구원
과제번호: 70004838, 70004889 
중간보고서 내용을 입력하였음에도 불구하고 기획단에서는 보고서가 미제출 된것으로 표기되어 있음 
SQL : estm.result.getReportInfo ▒▒ 
- /estm/result/FieldStepResultSB.java 파일에서
String seq_plus = ""+ (StrUtil.StrToInt(form.getString("seq")) + 3); //평가수행시 과제변경이력순번 +3   
----------------------------------------
-- 최근 보고서제출 과제진행 이력 정보 얻기
----------------------------------------
SELECT /*+ INDEX_DESC(RSBJCT_PRGS RSBJCT_PRGS_PK)*/
       SBJCT_ID, SEQ, SBJCT_STEP, ORDR,
       (SELECT V.CODE_NAME FROM RDUTY_CDV V WHERE V.SUB_CODE = DUTY_CD) 진행업무분류
FROM RSBJCT_PRGS
WHERE SBJCT_ID = /*[#1=70004838]*/ '70004838'
    AND SBJCT_STEP = /*[#2=0]*/ '0'
    AND ORDR = /*[#3=1]*/ '1'
    AND (0 = /*[#4=1]*/ '1' OR (1 = /*[#5=1]*/ '1' AND SEQ < '23'+3))   --//평가수행시 과제변경이력순번 +3   
    AND DUTY_CD IN ('9123')
    AND ROWNUM = 1
--;
==============================================================================================================

- 계획시작일 변경 요청 --> 처리완료
요청: 대구 기획단 모중환(JHMOH1/password) 연구원 
1. 신규평가 --> 현장실태조사
과제번호: 70003127 경우 실태조사 계획을 9월 17일 이후로 정하라고 합니다.
(실제 실태조사 일자: 8월 11일)
2. 중간평가 --> 지역평가위원회
과제번호: 70002922 경우 평가계획을 10월 8일 이후로 정하라고 합니다.(실태 평가일자: 9월 29일)
업무계획일자: 2009-10-03 --> 2009-08-03, 조사일자: 2009-10-11 --> 2009-08-11
2. 최종평가 --> 지역평가위원회
과제번호: 70002922 경우 평가계획을 10월 8일 이후로 정하라고 합니다.(실태 평가일자: 9월 29일)
업무계획일자: 2009-10-11 --> 2009-09-10, 조사일자: 2009-10-11 --> 2009-08-11 
심의일자: 2009-10-11 --> 2009-09-29

--업무계획 정보 수정   @@@@@@@@@@@@@
 UPDATE RDUTY_PLAN A 
SET A.PLAN_STIME = '20090929'   --계획시작일(심의일자)(20091008 --> 20090803)
-- SET A.PLAN_REG_TIME = '20090803'   --계획수립일자(20091003 --> 20090803)
WHERE A.PLAN_ID IS NOT NULL 
     AND A.PLAN_ID IN ('70009939')   --업무계획ID
--; 
--과제별일정계획 정보 수정   @@@@@@@@@@@@@
 UPDATE RDUTY_SBJCT A
SET A.PLAN_STIME = '20090811'   --계획시작일(20091011 --> 20091011)
WHERE A.PLAN_ID IS NOT NULL 
     AND A.PLAN_ID IN ('70009939')   --업무계획ID
--;
==============================================================================================================

- 국정감사기간
2009.10.05(월) ~ 10.24(토) 20일간
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00  --> 윤 연구원 철수 만류(결정난 일이라서 안된다고 거부함)

- KIAT SM
- 사업비정산 --> 업무계획으로 돌리기 -->  처리완료
요청: 대구 기획단 모중환(JHMOH1/password) 연구원
사업이 2년인 경우 1차년도 정산을 모두 0으로 처리하고 이월금액을 입력하는 경우입니다.
제가 담당하고 있는과제의 경우 모두 이월금액을 입력하지 않고 결과확정을 한 오류가 발생
아래의 과제의 경우 모두 확인하시어 사업비 정산을 원점으로 돌려주시면 합니다.
과제번호: 70001369, 70001399, 70001750, 70001431
업무계획ID: (70001369(70009598, 70009945), 70001399(70009595, 70009942), 70001750(70009599), 70001431(70009593, 70009947))
==============================================================================================================

- 수정사업계획서 확인 요청 -->  처리완료
요청: 제주 기획단 정용진(JHMOH1/password) 연구원
과제번호:70004364, 현상무(QTELQTEL/qnic4407) 
업무흐름: 신규평가 --> 수정사업계획서 제출 --> 협약(온라인접수 --> 과제접수 --> 수정사업계획서) 
--첨부자료 정보 조회    @@@@@@@@@@@@@      ===> 수정사업계획서 파일 찾기
SELECT   SEQ, SBJCT_ID "과제번호", ESACT_SEQ "첨부주체로서(seq)", ATTACH_NM "첨부물명칭", ATTACH_OLINK "Obj자료link", 
        (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE='1036' AND SUB_CODE=S.ATTACH_TYPE_CD) 첨부문서형태, 
        (SELECT MBR_NM FROM MEMBER WHERE MBR_ID=S.REG_MBR_ID) 등록자, REG_MBR_ID "등록자ID", REG_TIME "등록일시"
FROM RESACT_ATTACH_DOC S
WHERE SEQ IS NOT NULL
    AND S.REG_MBR_ID = '00205167'  --등록자ID
    AND S.SBJCT_ID = '70004197'    --과제번호
ORDER BY SEQ DESC
--;

-- 보고서접수 정보 @@@@@@@@@@@@  ====> 중간보고서 조회 가능 여부
SELECT P.SBJCT_ID 과제번호, P.SBJCT_STEP 과제단계, P.SBJCT_ORDR 차수, P.REPORT_CD,  
       (SELECT CODE_NAME FROM RCODE WHERE MAIN_CODE = '7064' AND SUB_CODE = P.REPORT_CD) 접수보고서종류, REG_MBR_ID "등록자"
FROM RREPORT P
WHERE P.SBJCT_ID IS NOT NULL
     AND P.SBJCT_ID = '70004197'    --과제번호(70004364, 70004364)
ORDER BY P.REG_TIME
--; 
==============================================================================================================

- 총괄책임자 변경 오류 수정 요청 -->  처리완료 
요청: 제주 기획단 성기용(TJDRLDYD/mssky1) 연구원
과제번호: 70001519
최종평가 --> 현장실태조사에서 조회 가능 하도록 요청
총괄책임자도 구자주(12915416) --> 곽효창(12915416)으로 전에 변경이 되었는데
--과제기본 정보 수정   @@@@@@@@@@@@@  
 UPDATE RSUBJECT S 
SET S.CHRGR_MBR_ID = '12915416'   -- 최종과제책임자 구성원ID(12823249 --> 곽효창(12915416))
WHERE S.SBJCT_ID IS NOT NULL
    AND S.SBJCT_ID IN ('70001519')          --과제번호(70007285)
--; 
==============================================================================================================

- 요구사항 정리 및  국감요구자료 정리 요청 -->  처리완료
요청: 정보화팀 윤형기(YHK7522/jin8399) 연구원
52. 국감요구자료.xlsx, 53. 요구사항 정리.xlsx 파일
==============================================================================================================

- 검색창에서 한글입력이 안됨
처리: MS-OFFICE 에서 dll 파일 제거
시작 -> 실행: regsvr32.exe /u msimtf.dll, regsvr32.exe /u msctf.dll
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.10.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00   --> info 파워 그룹 확정(조현혁 기술사팀:極眞技術士Study 7기)

- KIAT SM
- 지역R&D시스템(향후 지역INFRA도 확장가능)에서 평가관련 데이터 추출/출력
지역사업통계 --> 평가현황 --> 신규평가, 중간평가, 최종평가
1) 신규평가 
- 프로그램URL: /pms/statistics/statsubject.do?actmode=LocalnewReport&workFlag=SAP
- 실재파일: /statistics/subjectAppLocalnew_List.jsp
2) 중간평가 
- 프로그램URL: /pms/estm/report.do?actmode=LocalmidReport
- 실재파일: /estm/report/local_middle_report_list.jsp
3) 최종평가 
- 프로그램URL: /pms/estm/report.do?actmode=LocalendReport
- 실재파일: /estm/report/local_end_report_list.jsp
- 통계/보고서 탭에서 지역사업통계 --> 평가현황 --> 신규평가, 중간평가, 최종평가
- /estm/biz-estmreport-config.xml 파일에서
<!-- 신규 평가관리통계(지역사업통계) -->
<flow parameterValue="LocalnewReport" accessMenuId="${AccessLocalNew}"
      bizType="${NewReportSB}" bizMethod="getSearchItem" argsActionForm="true" 
      successForward="LocalnewReport" errorForward="LocalnewReport"/>

<!-- 중간 평가관리통계(지역사업통계) -->
<flow parameterValue="LocalmidReport" accessMenuId="${AccessLocalMiddle}"
      bizType="${NewReportSB}" bizMethod="getSearchItem" argsActionForm="true" 
      successForward="middlereport" errorForward="middlereport"/>
      
<!-- 최종 평가관리통계(지역사업통계) -->
<flow parameterValue="LocalendReport" accessMenuId="${AccessLocalEnd}"
      bizType="${NewReportSB}" bizMethod="getSearchItem" argsActionForm="true" 
      successForward="LocalendReport" errorForward="LocalendReport"/>  
==============================================================================================================

- DB 아키텍처 정리
- 매뉴맵
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:40  --> 인수인계자 도착(백경파 차장)

- KIAT SM
- 지역R&D시스템에서 평가관련 데이터 추출/출력 
1) 신규평가(지역사업통계) 
- 프로그램URL: /pms/statistics/statsubject.do?actmode=LocalnewReport&workFlag=SAP
- 실재파일: /statistics/subjectAppLocalnew_List.jsp
==============================================================================================================

- 인수인계자 도착(백경파 차장)
KCC 백경파 차장 HP) 010-8001-1289(*@*.*)
KCC 김순철 차장 HP) 010-8740-7999(*@*.*)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.16(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:00  --> 인수인계 시작(백경파 차장), 최대리 ITEP_BBA 사용자 삭제 사고 침

- KIAT SM
- 지역R&D시스템에서 평가관련 데이터 추출/출력
1) 신규평가(지역사업통계)  --> 모중환(JHMOH1/password) 연구원
- 프로그램URL: /pms/statistics/statsubject.do?actmode=LocalnewReport&workFlag=SAP
- 실재파일: /statistics/subjectAppLocalnew_List.jsp
 /statistics/subjectAppYearDetails.jsp
==============================================================================================================

- 지역R&D 거래처 정보 DB 다운로드 요청 --> 처리완료
요청: 백낙주 연구원
==============================================================================================================

- 담당간사 지정   --> 처리 완료
요청: 충남 기획단 김대환(TJDRLDYD/mssky1) 연구원
대상: 최철훈, 임치영
- 담당간사 지정   --> 처리 완료
요청: 충북 기획단 조성빈(TJDRLDYD/mssky1) 연구원
대상: 김상기, 김정하
==============================================================================================================

- 중간보고서, 수정사업계획서 다운로드 요청 --> 처리완료
요청: 민재웅(MINJW316/ghddlr1) 연구원 
과제번호: 70004197, 70004198, 70004144, 70004130, 70004226  
==============================================================================================================

- 평가계획 수립 대상과제로  확인 요청 -->  처리완료
요청: 민재웅(MINJW316/ghddlr1) 연구원
과제번호: 70004241 
문제점: 평가관리 - 중간평가 - 평가기본계획 수립시 선도기술개발과제 33건 중 본 건이 누락되어 계획수립 불가
요청: 평가계획 수립 대상과제로 처리요망 -->  처리완료
처리: 누락된게 아니고 당해개발종료일(20091130 --> 20091030)로 설정하고 조회하면 됨
33건 선도기술과제 담당간사를 "박경용" 선임연구원으로 일괄 변경

--과제기본 정보 변경   @@@@@@@
-- UPDATE RSUBJECT S
SET M.MNGR_MBR_ID = '00100123' --현과제담당자ID(10033014 --> 박경용(00100123))
WHERE S.SBJCT_ID IS NOT NULL
     AND S.MNGR_MBR_ID IN ('10033014')  --현과제담당자ID
--;
--과제관련자 변경 이력 정보 변경   @@@@@@@
-- UPDATE RSBJCT_MBR_HSTR M
SET M.MBR_ID = '00100123' --현과제담당자ID(10033014 --> 박경용(00100123))
WHERE M.SBJCT_ID IS NOT NULL 
    AND M.ROLE_CD = '1006' --구성원_참여_역할(1006:담당간사)
    AND M.MBR_ID IN ('10033014') --과제관련 구성원ID
--;
==============================================================================================================

- STOCKS
월(2,920), 화(2,960), 수(2,900), 목(2,900), 금(2,855)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.19(월) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00  --> 인수인계 시작2(백경파 차장)

- KIAT SM
- 지역R&D시스템에서 평가관련 데이터 추출/출력
1) 신규평가(지역사업통계)  --> 모중환(JHMOH1/password) 연구원
- 프로그램URL: /pms/statistics/statsubject.do?actmode=LocalnewReport&workFlag=SAP
- 실재파일: /statistics/subjectAppLocalnew_List.jsp
- 2. 신규사업별(팝업): /statistics/subjectAppLocalnewYearDetails.jsp 
==============================================================================================================

 - 평가위원 등록 요청 --> 처리완료
요청: 충북 기획단 조성빈 연구원
1. 김정하 나우소프트 대표이사 610701-1042611 
==============================================================================================================

- 담당간사 삭제 요청   --> 처리 완료
요청: 경북 기획단 장철민(TJDRLDYD/mssky1) 연구원
대상: 장철민(nick1730)(삭제)  --> 허영준(pharos21)
==============================================================================================================

- 사업계획서 파일 11건 요청 --> 처리완료
요청: 지역산업진흥팀의 박유나
70000839, 70000869, 70000874, 70000894, 10015035, 10024969, 10024972, 10024984, 70000806, 70000818
==============================================================================================================

- 극진7기 임시 사용자
http://www.webhard.co.kr    tempdata/임시6giga(dlatl6giga) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.20(화) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00  --> 인수인계 시작3(백경파 차장), 던킨 도너츠(우연히 태용이 만남, 집에서 자고 감)

- KIAT SM
- 지역R&D시스템에서 평가관련 데이터 추출/출력 --> 처리완료
1) 신규평가(지역사업통계)  --> 모중환(JHMOH1/password) 연구원
- 프로그램URL: /pms/statistics/statsubject.do?actmode=LocalnewReport&workFlag=SAP
- 실재파일: /statistics/subjectAppLocalnew_List.jsp
- 2. 신규사업별(팝업): /statistics/subjectAppLocalnewYearDetails.jsp 
- 실서버 등록
/config/statistics/biz-statistics-config.xml
/config/statistics/struts-statistics-config.xml
/sql/statistics/sql-statistics.xml
/src/itep/pms/statistics/StatisticsDAO.java
/src/itep/pms/statistics/StatisticsSB.java
/pms-web/statistics/subjectAppLocalnewList.jsp 
/pms-web/statistics/subjectAppLocalnewYearDetails.jsp 
/itep-pms/statistics/js/subjectApp_common.js
--------------------------------------------------------------------------------------------------------

1. 신규총괄에 그리드 스크롤 영역의 높이를 늘려주세요
2. 팝업창 크기조절은 자유롭게
3. 해당 사업명을 클릭하면 사업정보를 볼 수 있도록 페이지를 링크시켜주세요  --> 불가
==============================================================================================================

- 담당간사 지정할때 과제가 검색이 안됨 --> 처리완료
요청: 경북 기획단 장철민(TJDRLDYD/mssky1) 연구원
과제번호는 70004665 이구요 주관기관은 맨엔텔입니다.
==============================================================================================================

- 정부출연금에 국비만 되어있는 부분에 지방비를 추가 요청 --> 처리완료
요청: 대구 기획단 이상화 연구원(RDMP/ljy1008) 연구원
과제번호 : 70001399
주관기관 : 더블유비신소재
정부출연금 : 국비 120,000 + 지방비 30,000 = 150,000천원
과제번호 : 70001750
주관기관 : (주)에스티원창
정부출연금 : 국비 110,000 + 지방비 30,000 = 140,000천원
==============================================================================================================

- 과제평가이력수정(결과정리 탭으로 돌리기) 요청   --> 처리완료 
요청: 전남 기획단 황금연 연구원(HWANGTWO/chindo) 연구원(061-286-4388) 
70004498(0), 70004548(0), 70004555(0), 70004445(0), 70004495(0), 70004588(0), 70004479(0), 70004349(0), 70004267(0)
70004313(0), 70004314(0), 70004586(0), 70004510(0), 70004662(0) ===> 연계기술 14건
70004683(0), 70004894(0), 70005087(0), 70005039(0), 70005042(0), 70005070(0), 70005081(0), 70004840(0), 70004898(0), 
70004918(0), 70004940(0)   ===> 전략기획기술 11건
==============================================================================================================

- 프린터 설정 
hp p4515x  ==> 프린터 IP: \\192.168.12.76 ---> 회의실 프린터(KCC 프린터)
hp ==> 프린터 IP: 192.168.12.81  ---> PMS팀 프린터
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.21(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00  --> 인수인계 시작4(백경파 차장), 인수인계 완료(철수)

- KIAT SM
- 중간평가 지역평가위원회 평가결과(팝업)에서 저장이 안보임 수정 요청   --> 처리완료 
요청: 전남 기획단 황금연 연구원(HWANGTWO/chindo) 연구원(061-286-4388) 
중간평가 --> 지역평가위원회: 결과정리에서 보이게 처리 처리
DynaActionForm mainForm = (DynaActionForm) request.getAttribute("mainForm");
Boolean isEditable = (Boolean) mainForm.get("isEditable");   //isEditable이 true여야 저장이 보임
--결과정리승인일 변경(업무계획ID(70009641):20090914 -> 99991231, 업무계획ID(70009789):20090930 -> 99991231))
--업무계획 정보 수정  @@@@@@@@@@@@@  
UPDATE RDUTY_PLAN A
SET A.RESULT_APPR_TIME ='99991231'       -- 결과정리승인일 
WHERE A.PLAN_ID IS NOT NULL 
     AND A.PLAN_ID IN ('70009789')   -- 업무계획ID(70009641, 70009789)
--;  
==============================================================================================================

- 예산정책처 요청 자료   --> 최윤종 대리가 대신 처리완료 함
요청: 백낙주(TJDRLDYD/mssky1) 연구원
==============================================================================================================

- 대우증권 AML Proj 계약(계약번호: 2009-0417, (주)마루정보)
1. 사업명: 대우증권 AML DATA Mart 구축
2. 계약기간: 2009년 04월 22일(목) ~ 2009년 10월 21일(수)(6개월)
3. 계약금액: 월 ***만원
4. 급여일자: 매월(01~30)급여는 익월 10일 지급 
5. 발주처: (주)대우증권
6. 시행사: 케이씨씨정보통신(주)
7. 개발장소: 대우증권IT센터(경기도 과천시 중앙동 38번지)
8. 제안설명회: 2008.12.23
==============================================================================================================

- 오늘 해야할 일
1, 기술사 경력 증명용((주)마루정보) 작성, 원맵, 답안지 100장 프린트할 것
2. (주)인포레버 T) 02-566-1939, 이영임 팀장(*) --> 팀 변경 요청(최기선 기술사팀으로 이동 결정)
3. 삼성증권 펀드 환매: 1,972,400원(입금 완료)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.22(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:00  --> PS 22 Study 첫날, 경력증명서 받으로 갔다 옴((주)마루정보 신유식 사장: 여의도)

- PS 22 Study
-  PS 22 올인피엔피(최기선 기술사팀) 공식 가입
- 원맵 작성
1. 6-시그마 /IT 6-시그마  --> DMAIC
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.10.23(금) 작업 ■■■■■■■■■■■■■■■■
---> 09:30 ~ 22:00  --> 조기 축구(숏게임 4:4)

- PS 22 Study
- 원맵 작성
1. 6-시그마 /IT 6-시그마  --> DMAIC
==============================================================================================================

- STOCKS
월(2,825), 화(2,800), 수(2,835), 목(2,830), 금(2,845)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.24(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:00  --> 기아 타이거즈 12년만에 우승(나지완 역전 홈런)

- PS 22 Study
- 원맵 작성
1. 6-시그마 /IT 6-시그마  --> DMAIC ==> 완료
26. 경영환경분석(SWOT, 5Force, 4C, 7S, SMART, Pareto) ==> 완료
--------------------------------------------------------------------------------------------------
- 1주차 모의고사 시험문제 분석(11시)
==============================================================================================================

[과제]1주차(10.25) 경영 Object 정리
 1) 서브노트 
  - 첨부된 Object List를 보시고, 1주차 경영 Object 중 중요도1,2가 3점 이상인 것들을.. 서브노트로 작성해오십시오.  
2) 마인트 맵
  - 경영 도메인에 대한 마인트맵을 작성해오세요.  
3) 기술사 학습 스케쥴을 WBS로 작성해오세요.  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2009.10.25(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:00  --> PS 22 첫날

- PS 22 01
- Part 1(모의고사)
09:00 ~ 10:40: 1교시 10점 유형 모의고사
11:00 ~ 12:40: 2교시 25점 유형 모의고사
=========================================================================================================

- Part 2(주제발표 등)
13:30 ~ 15:30: 주제발표 및 토론, 채점
15:30 ~ 17:30: 주제발표 및 토론, 개별 멘토링(19.5점: 원맵 작성을 안해서 아는 문제가 없었음) 
18:30 ~ 21:00: 토픽 정리(숙제 검사: 원맵 2개만 작성: 반성)
==============================================================================================================

- 신사조기회 창립기념일
신구초등학교
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 01:00  --> KIAT에서 Claim 걸었다고 전화 옴(마루정보 신유식 사장)

- PS 22 Study
- 원맵 작성 10개 작성(NO.30 ~ NO.39)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.27(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 01:30 --> KIAT Claim  반박 메일 보냄(마루정보 신유식 사장)  

- PS 22 Study
- 원맵 작성 11개 작성(NO.41 ~ NO.53)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 01:30 

- PS 22 Study
- 원맵 작성 3개 작성(NO.40 ~ NO.50)
- 저번주 원맵 작성 13개 작성(NO.1 ~ NO.29)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.29(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:30 --> 조혜영님 우리팀 합류

- PS 22 Study
- 저번주 원맵 작성 14개 작성(NO.1 ~ NO.29): 작성 완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 00:00  

- PS 22 Study
- 독서
IT 정보처리기술사를 위한 산업 정보시스템, 임호진 지음, 한국학술정보(주) ==> 최기선 기술사가 빌려 줌
==============================================================================================================

- 원맵 디카로 촬영하여 jpg파일로 저장(총: 53장)
==============================================================================================================

- STOCKS
월(2,830), 화(2,800), 수(2,800), 목(2,670), 금(2,650)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2009.10.31(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 01:00  

- PS 22 Study
- 경영 마인드맵 작성
IT 정보처리기술사를 위한 산업 정보시스템, 임호진 지음, 한국학술정보(주) 
- 02주차(2009.11.01) 시험 문제 작성 및 준비
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■