

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.02) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 
■■■■■■■■■■■■■■■■■■ 2017.02.01(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 17:00 ==> 현대파워텍 첫 출근, 석식(뚝불: 김규현 부장이 쏨)

- 현대파워텍 인사시스템 고도화 Proj[★]
 - 데이터 마이그레이션
1. Migration(데이터이관) - 운바의 IT이야기-운명을 바꾸는 자 - Tistory ==> http://o-m-i.tistory.com/221
==============================================================================================================

- 개발 환경 설정
1. Oracle10gR2_client 64bit 설치
2. Toad for Oracle 11.6 설치
==============================================================================================================

- 개발 담당자
1. 김문수 대리(현대 파워텍)
2. 최평규 이사(마이그레이션 담당, (주)케이허브) ==> Migration 총괄 담당
3. 김건 위원((주)케이허브)  ==> Query 요청(교육 관련 5개)
4. 정상연 이사(PM, (주)케이허브)
==============================================================================================================

- 집에서 가져와야 할 것
1. Memo
 2. 비밀번호
3. DB Query
 4. Query Formatter
==============================================================================================================

- 보험 해약 신청
1. 메트라이프 보험 해약
 1) MET 무배당 마스터플랜 변액유니버셜종신보험(이윤심, 진태만) ==> 해약 환급금: 7,319,107원[2017.02.01(수) 해약]
2. PCA  수종이 보험 해약
 1) 무배당 PCA 스타트(start) 어린이 변액유니버셜보험 II(진수종) ==> 해약 환급금: 7,722,067원[2017.02.01(수) 해약]
3. PCA  진태만 보험 지급 중지
 1) 내 보험: 지급 중지(월 2만 천원 내면 사망보험에 대한 보장 유지)
==============================================================================================================

- 파일서버
\\10.135.100.99\saphr$
==============================================================================================================

 - 침낭 주문
1. 빈슨메시프 레아 침낭-가성비 최강KC인증 사계절 캠핑, 레아 머미 침낭, 가격: 17,900원(에어 베게 포함)
http://deal.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=1576300425&xfrom=&xzone=
==============================================================================================================

- 롯데마트 쇼핑(김규현 부장, 김남열 대리)
1. 빚, 비누, 머그컵, 화장품 구입
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.02(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 20:00  ==> 출입증 나옴(20시, 정문 경비실에서 수령)

- 현대파워텍 인사시스템 고도화 Proj[★]
- 데이터 마이그레이션 인수인계: 강현석 과장
 1) 최평규 이사(마이그레이션 담당, (주)케이허브)
  2) 인사: 9개 신규로 남아 있음(노사, 일자, 가족 등)
  3) 급여. 근태 인수 인계 받아야 함
  4) 교육: 5개 신규로 남아 있음
==============================================================================================================

- 메신저 확인
0103072 / asas1212@A  --> hpt!1234
--------------------------------------------------------------------

- 메일 확인
powertech\0103072 / 0103072hpt!
-------------------------------------------------------------------------------------------------

- 비밀번호 변경
https://imas.powertech.co.kr/PWChange.aspx?isUseOtp=fal
==============================================================================================================

- DB 사이트
1. http://okjsp.pe.kr:8080/
http://okjsp.pe.kr:8080/article/372249
==============================================================================================================

- DB 설정
# 01. EHR(운영 서버) ==> ptehr/ ptehr01
 EHR =
   (DESCRIPTION =
     (ADDRESS = (PROTOCOL = TCP)(HOST = 10.10.119.68)(PORT = 1521))
     (CONNECT_DATA =
       (SERVER = DEDICATED)
       (SERVICE_NAME = EHR)
     )
   )

# 02. EHR DEV(개발 서버) ==> ptehr/ ptehr01
==============================================================================================================

- 롯데마트 쇼핑(김규현 부장, 김남열 대리)
1. 과자 구입, 박스 가지고 와서 김규현 부장 방 유리에 붙임
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.03(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00  ==> 서울행(17시, 김남열 대리 차)

- 현대파워텍 인사시스템 고도화 Proj[★]
 - 데이터 마이그레이션 분석
1. [CBO] 톡톡인사 개발
==============================================================================================================

- 서울행
17:00 퇴근
17:10 김남열 대리차(서산 현대파워텍 출발)  ==> 서해안 고속도로(수원쪽에서 차 막힘)
19:45 부천역 도착( -> 신도림역  -> 대림역)
20:10 귀가
20:20 석식(비빕밥)
21:00 박스 구하기(은아 이사하는 것 도와 줌) --> 최선형에게 전화(내일 은아 이사할 때 다마스 차 빌리기로 함)
02:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.04(토) 작업■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
03:00 기상
03:30 가계부 월말 결산 
06:00 집출발
06:30 대림운동장 
06:30 숏게임
10:00 종료
09:20 조식(김치찌게): 형근이형이 쏨
10:00 집도착(최선형 봉고차로 짐 날라 줌)
10:20 은아 원룸 도착(길이 좁음)
10:40 종료
10:50 노량진역(6411번 버스)
11:00 귀가
11:20 낮잠(점심 안 먹고 계속 낮잠을 잠)
17:00 기상
19:00 석식 ==> 헬로 카봇 인터넷으로 주문 함
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.05(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 비 조금 옴

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장==> 최선형과 같이 창고 갔다 옴
06:50 숏게임 ==> 두혁 형님이 공에 얼굴 맞았는데 전정현 형이 피 난다고 했다고 욕을 함 : 전정현 형이 두혁 형님 징계 요구함
08:20 게임(신길 7동과 게임) ==> 2게임함 --> 김승용 단장의 아들 완이가 상대 수비수에게 고의로 공을 차서 주먹질
 하고 싸움이 남: 서로 사과를 함
12:00 종료
12:30 중식(두루치기: 우리 감자탕): 회에서 쏨
13:30 종료
14:00 강고문님 댁 지하 ==> 태우 회사에서 전화 와서 일하러 감
 --> 대운이하고 술 한잔 함(탕수육, 팔보채, 양장피)
17:10 종료 
17:50 귀가
19:00 집출발
20:00 고속버스 터미널(호남선)
20:20 서울 출발
21:55 서산 터미널 도착
22:20 숙소 도착(서산 터미널 -> 중앙호수공원: 도보[약 20분 걸림])
22:30 샤워
20:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.06(월) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 20:00  ==> 침낭 수령(현대 파워텍 후문), 통근버스 출근(12호차 07:30 한양회관)

- 현대파워텍 인사시스템 고도화 Proj[★]
- 데이터 마이그레이션 분석
99 톡톡인사내역
99 발령품의관리
99 제증명서신청내역
==============================================================================================================

- 교육 개발
1. 04 개인별교육이력_20170109.xlsx  --> ZGHRT5065 (과거 교육이력) 
01. 2017년 이전 자료  ==> 전체: 75,623 건(이수: 69,862 건)
 1) 6만 5천 건만 다운로드 됨 ==> 5만건 + 만 5천 건으로 분리
02. 2017년 자료   ==> 전체: 143 건(이수: 139 건)
==============================================================================================================

- 페이징 처리 
SELECT * 
FROM 
( 
 SELECT ROWNUM RN,A.* FROM A 
) 
WHERE RN > 0 AND RN <= 60000 
==============================================================================================================

- 교육 개발
05 강사정보_20170116.xlsx  --> ZGHRT5050 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.07(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00  ==>  

- 현대파워텍 인사시스템 고도화 Proj[★] 
- 교육 개발
05 강사정보_20170116.xlsx  --> ZGHRT5050
06 강사료이력_20170116.xlsx  --> ZGHRT5072
==============================================================================================================

- 5.평가 개발
01 평가결과_20170116.xlsx --> PA9018
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.08(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  ==>  

- 현대파워텍 인사시스템 고도화 Proj[★]  
- 5.평가 개발 
02 역량평가결과_20170116.xlsx --> 피평가자: 이승준, 박해성  ==> 작업 중지: 김건 위원이 안 해도 된다고 함
-------------------------------------------------------------------------------------------------------------------------------

1. 현대파워텍 인사시스템 --> eclipse 소스 복사 분석
1) /pm_cmp_100_p02.jsp(평가자평가)
==============================================================================================================

- "지정한 장치, 경로 또는 파일을 액세스할 수 없습니다" 에러
지정한 장치, 경로 또는 파일을 액세스할 수 없습니다. 이 항목을 액세스하는 데 필요한 권한을 가지고 있지 않습니다. 
1. 원인: 알고 보니 rundll32.exe의 사용 권한 때문에 생긴 문제였다. rundll32.exe의 사용 권한에 Everyone(모두)에 
거부된 항목이 끼어 있었다. ==> C:\Windows\System32\rundll32.exe
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02..09(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  ==>  

- 현대파워텍 인사시스템 고도화 Proj[★]  
- 1.인사 개발  
99 톡톡인사내역  ==> 완료 @@@
99 발령품의관리
99 제증명서신청내역
==============================================================================================================

- 99 제증명서신청내역
SELECT T1.* 
  FROM PA7010 T1  -- (PA7010)인사.제증명서신청
;
--------------------------------------------------------------

SELECT T1.*
FROM PA7020 T1    -- (PA7020)인사.제증명서발급대장
WHERE (SELECT COUNT (APPL_ID)
        FROM PA7020 T1   -- (PA7020)인사.제증명서발급대장
                      ) > 1
ORDER BY T1.APPL_ID
;
==============================================================================================================

- 오라클 DB 문자 자르기
- INSTR 함수: 문자열이 포함되어 있는지를 조사하여 문자열의 위치를 반환하는 함수(오라클 함수)
1. INSTR('비교할 대상', '비교 하고자 하는 값', 비교를 시작할 위치, 검색된 결과의 순번)
SELECT INSTR('D:/mang/TEST.pdf','/', -1, 1) as "결과" FROM DUAL
; 

-- SUBSTR: String 원하는 만큼 자르는 함수(오라클 함수)
1.SUBSTR(문자열 or 컬럼,  시작 위치, 자르고 싶은 길이) 
SELECT SUBSTR('D:/mang/TEST.pdf', INSTR('D:/mang/TEST.pdf','/', -1, 1)+1, LENGTH('D:/mang/TEST.pdf')) as "결과" FROM DUAL
;

SELECT SUBSTR('D:/EHR_PROJECT/PT_EHRS_WEB/file/te/mang/2017년 노동정책 방향 및 노사관계 전망.pdf', 
  INSTR('D:/EHR_PROJECT/PT_EHRS_WEB/file/te/mang/2017년 노동정책 방향 및 노사관계 전망.pdf','/', -1, 1), 
  LENGTH('D:/EHR_PROJECT/PT_EHRS_WEB/file/te/mang/2017년 노동정책 방향 및 노사관계 전망.pdf')) as "결과" 
FROM DUAL
;

- LPAD(대상값 또는 컬럼,  대상값을 포함하여 채울 크기, 넣을 값) 왼쪽 채우기
SELECT LPAD('12345', 10, '0')AS TEST_SEQ FROM DUAL
;
SELECT '99995' LPAD(TO_NUMBER('00000000000000031108'), 12, '0') AS TEST_SEQ FROM DUAL
;
==============================================================================================================

- 단일 테이블에서 GROUP BY HAVING 을 이용한 중복 데이타 체크
SELECT T1.APPL_ID, count(*) AS APPL_ID_CNT 
FROM PA7020 T1
GROUP BY T1.APPL_ID 
ORDER BY T1.APPL_ID DESC
; 

SELECT T1.APPL_ID, count(*) AS APPL_ID_CNT   -- SEQ_NO               
FROM PA7020 T1
GROUP BY T1.APPL_ID 
HAVING count(*) > 1  -- 1보다 큰 것(여러개): 3,385 건, 1보다 작은 것(1개) @@@@@
; 
==============================================================================================================

- WITH 구문
1. WITH구문내의 쿼리의 결과(SUB쿼리)가 여러번 사용될때(호출될때) 유용하다. 
2. 서브쿼리 블럭에 이름을 지정할 수 있도록 해줌. 
3. 오라클 옵티마이저는 쿼리를 인라인뷰나 임시 테이블로 여긴다. 
4. WITH 구문 사용방법 
WITH ALIAS명 AS ( SUB쿼리 )  
SELECT 컬럼명 FROM ALIAS명;  
5. WITH 구문 예제
WITH AA AS
 (
  SELECT ROWNUM, 'TEST1', SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM, 'TEST2', SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM, 'TEST3', SYSDATE FROM DUAL
 )
SELECT * FROM AA
;
--------------------------------------------------------------------------------------------------

- WITH 구문(2개 SUB쿼리) 예제) 
WITH AA AS
 (
 SELECT ROWNUM AS SEQ, 'TEST1' AS NAME, SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM AS SEQ, 'TEST2' AS NAME, SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM AS SEQ, 'TEST3' AS NAME, SYSDATE FROM DUAL
  ), 
 BB AS
 (
 SELECT ROWNUM AS SEQ, 'TEST1' AS NAME, SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM AS SEQ, 'TEST2' AS NAME, SYSDATE
     FROM DUAL
   UNION ALL
   SELECT ROWNUM AS SEQ, 'TEST3' AS NAME, SYSDATE FROM DUAL
) 
SELECT * FROM AA, BB 
WHERE AA.NAME=BB.NAME
;
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.10(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00  ==> 서울행(17시, 고속버스(서산터미널))

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 제증명서신청내역
==============================================================================================================

- 그룹 단위별 일련번호 붙이기
1. 참조 ==> http://www.gooper.com/ss/tnt_db/1785
-- 99 제증명서신청내역 조회_02   @@@@@@    --> 24,887 건 
SELECT  '1000' AS "인사 영역"  
        --,  G1_1.RNU
        ,'99995'  LPAD(TO_NUMBER(G1_1.APPL_ID), 12, '0') AS "전자결재 신청번호" 
        , G2_1.SEQ_NO    
        , G1_1.RCNT AS SEQNR 
        , G2_1.ISSUE_NO AS 발급번호 
        , G2_1.MOD_USER_ID AS 발급자ID
        , G2_1.ISSUE_YMD AS 발급일자            
FROM
(
    SELECT ROWNUM RNUM,
            G1.APPL_ID,
            G1.RCNT
    FROM    
    (
        SELECT A.APPL_ID    
               , B.RCNT
        FROM 
            (SELECT T1.APPL_ID 
                       , COUNT(*) CNT
             FROM   PA7020 T1
             GROUP BY T1.APPL_ID
             ORDER BY T1.APPL_ID
             ) A,  
            (SELECT ROWNUM RCNT
             FROM PA7020 
            ) B      -- 복제를 위한 DATASET 
        WHERE B.RCNT <= A.CNT
        GROUP BY A.APPL_ID 
            , B.RCNT
        ORDER BY A.APPL_ID 
     ) G1    
) G1_1,
(
    SELECT ROWNUM RNUM
         , T1.SEQ_NO 
         , T1.APPL_ID
         , T1.ISSUE_NO 
         , T1.MOD_USER_ID  
         , T1.ISSUE_YMD  
    FROM PA7020 T1
    WHERE T1.APPL_ID > ' '    
) G2_1              
WHERE G1_1.RNUM = G2_1.RNUM
;
-- ==============================================================================================================

- SQL 세로를 가로로 조회(ORACLE)
http://sorrymommy.com/wp/2015/06/08/sql-%EC%84%B8%EB%A1%9C%EB%A5%BC-%EA%B0%80%EB%A1%9C%EB%A1%9C
-%EC%A1%B0%ED%9A%8Coracle/

-- SQL 세로를 가로로 조회
WITH TEMP_TABLE AS 
 (
  SELECT LEVEL AS ROW_NUM, LEVEL * 10 AS ROW_VALUE
   FROM DUAL
  CONNECT BY LEVEL - 1 < 12
  )
SELECT CEIL(T.ROW_NUM/4) AS ROW_CEIL, 
             MIN(DECODE(MOD(ROW_NUM,4), 1, ROW_VALUE)) AS VALUE1,
             MIN(DECODE(MOD(ROW_NUM,4), 2, ROW_VALUE)) AS VALUE2,
             MIN(DECODE(MOD(ROW_NUM,4), 3, ROW_VALUE)) AS VALUE3,
             MIN(DECODE(MOD(ROW_NUM,4), 0, ROW_VALUE)) AS VALUE4
  FROM TEMP_TABLE T
 GROUP BY CEIL(T.ROW_NUM/4)
;
---------------------------------------------------------------------------------------------

- 세로 결과를 가로로 출력하기
ITEM VALUE
A 1
A 2
A 3

이결게 나오는 결과를
A 1 2 3

으로 나오게 하는 방법은 다음과 같다 

SELECT ITEM ,
       MAX(CASE WHEN VALUE = '1' THEN '1' ELSE '0' END) VALUE1,
       MAX(CASE WHEN VALUE = '2' THEN '2' ELSE '0' END) VALUE2,
       MAX(CASE WHEN VALUE = '3' THEN '3' ELSE '0' END) VALUE3
FROM 테이블명
GROUP BY ITEM 
;
---------------------------------------------------------------------------------------------

- 오라클 가로데이터 세로로 정렬하는 쿼리
SELECT 
    DECODE(ROWNUM
        ,1,A 
        ,2,B 
        ,3,C
        ,4,D
        ,5,E
        ,6,F)  
    , ROWNUM RN
FROM (       
    SELECT  
         10 A,   
         20 B,    
         30 C,   
         40 D,
         50 E,   
         60 F       
    FROM    dual
    
    )
CONNECT BY LEVEL <= 6
;

WITH TEST
AS (
     SELECT T1.C_CD, T1.PM_YY, T1.EMP_ID, 
           CASE WHEN T1.PM_YY <= '2006' THEN
                     T2.FST_GRADE --역량 평가 상반기 등급
                WHEN T2.EMP_TYPE_CD = '0040' THEN--생산직
                     T2.FST_GRADE
                ELSE T2.GRADE     --역량 평가 종합 등급
            END AS FST_GRADE,   -- 상반기등급      
           CASE WHEN T1.PM_YY <= '2006' THEN 
                     T2.SND_GRADE --역량 평가 하반기 등급
                WHEN T2.EMP_TYPE_CD = '0040' THEN--생산직
                     T2.SND_GRADE
                ELSE T3.GRADE     --업적 평가 종합 등급
            END AS SND_GRADE   -- 하반기등급  
      FROM (SELECT C_CD, PM_YY, EMP_ID
              FROM PM0605   
            GROUP BY C_CD, PM_YY, EMP_ID) T1, -- (PM0605)평가결과_종합결과 TB ==> 년도별 피평가자  
           (SELECT * 
              FROM PM0605
             WHERE PM_TYPE_CD LIKE 'CMP%') T2, -- (PM0605)평가결과_종합결과 TB ==>  역량평가  
           (SELECT * 
              FROM PM0605
             WHERE PM_TYPE_CD LIKE 'ACH%') T3 -- (PM0605)평가결과_종합결과 TB ==>   업적평가
     WHERE T1.C_CD = '10'
       AND T1.EMP_ID = '3710375'
       AND T1.C_CD = T2.C_CD (+)
       AND T1.PM_YY = T2.PM_YY (+)
       AND T1.EMP_ID = T2.EMP_ID (+)
       AND T1.C_CD = T3.C_CD (+)
       AND T1.PM_YY = T3.PM_YY (+)
       AND T1.EMP_ID = T3.EMP_ID (+)
    ORDER BY T1.PM_YY DESC 
    )
    ,PV
AS (
    SELECT 1 M FROM DUAL 
    UNION ALL 
    SELECT 2 M FROM DUAL 
    )
SELECT  A.C_CD, A.PM_YY, A.EMP_ID    
    ,(CASE B.M
        WHEN 1
            THEN A.FST_GRADE
        WHEN 2
            THEN A.SND_GRADE 
        ELSE ''
        END) 등급
FROM TEST A
CROSS JOIN PV B
ORDER BY A.PM_YY            
;  
----------------------------------------------------------------------------------------------------

SELECT WORK_CODE, WORK_DATE 
 , CHR(64 + LV) PART_TYPE 
 , DECODE(LV,1,PART_A,2,PART_B,3,PART_C,4,PART_D,5,PART_E) DATA 
FROM (SELECT 'ABC00001' WORK_CODE, 99 PART_A, 12 PART_B, 12 PART_C, 11 PART_D, 88 PART_E, 2008-01-01 WORK_DATE FROM DUAL) 
 , (SELECT LEVEL LV FROM DUAL CONNECT BY LEVEL <= 5) 
; 
==============================================================================================================

- 1.인사 개발
99 발령품의관리
==============================================================================================================

- 귀가
17:00 퇴근 
17:15 현대파워텍 정류장(1호차: 터미널행)
17:45 서산터미널
18:00 서산 출발(SAP 개발자들이 김밥 1줄 줌)
20:10 강남터미널
20:20 6411번 버스
21:00 우성아파트 정류장
21:10 서울식당(닭도리탕: 선이형, 형근이형, 최용식 고문님) ==> 최용식 고문님이 쏨
22:00 종료
22:30 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.11(토) 작업■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
06:00 기상 
06:20 집출발
06:30 대림운동장
07:10 숏게임 ==> 추리닝와서 분류 작업하고 현수막 단다고 20분 정도 밖에 운동 못 함(추리닝 수령)
 --> 현수막 달기(도신 도기회 문수 형님이 달아 줌)
08:30 종료
09:00 조식(북어해장국, 우리감자탕) ==> 선이형이 쏨
10:30 귀가
12:00 중식
15:00 대림3동 주민센터 ==> 탁자 나으러 감
 --> 최 선형 가게에서 경품으로 줄 사과 박스 작업
17:00 철이형 오징어 가게(68형들, 태우, 강고문님, 태성 형님) ==> 술값 10만원 나와서 만원 냄
20:00 종료
20:10 귀가
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.12(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 대림3동 축구회 시무식(10시)

▦ 조기축구
05:50 기상
06:30 최 선형 가게(걸어서 감)
06:40 탁자 나르기 ==> 재식이 병재 도착
06:50 대림운동장 ==> 탁자, 텐트 설치, 추리닝 지급
08:00 게임 --> 선우조기회
08:30 방송 장비 설치(만복씨)
09:30 게임2 --> 3게임 뜀
09:45 창호가 차로 문영아파트에 가서 루옌, 수종 데리고 옴
10:00 시무식 행사(구청장님)
13:30 종료 
13:40 경품 추첨 ==> 루옌 햄세트 경품으로 받음
14:30 종료 
14:40 짐정리 ==> 강고문님 댁에 텐트 갔다 줌
15:00 뒤풀이(뼈해장국, 우리감자탕) ==> 회에서 쏨 
18:10 종료 
18:40 귀가
19:00 집출발
20:00 고속버스 터미널(호남선)
20:20 서울 출발 ==> 승객이 안전벨트에 손가락 끼여서 구급차 출동해서 시간이 걸림
22:10 서산 터미널 도착
22:20 숙소 도착(서산 터미널 -> 중앙호수공원: 도보[약 20분 걸림])
22:30 샤워
20:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.13(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:30  ==> 통근버스 출근(12호차: 07:03, 한양회관)

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 제증명서신청내역
==============================================================================================================

- SQL Formatter 설정
1. Standard Formatting
 1) Indent: \t  2) Indent Width: 900
 3) Max Width: 90000
 4) Statement Braeks: 2
2. Expand Comma Lists
 1) Space After Comma: 체크
==============================================================================================================

- 국민연금 공단 전화 옴
1. 지역 가입자로 전화(9만원 납부하라고 함) ==> 3월 정규직되면 자동으로 가입된다고 함
==> 만 60세까지 납부, 만 65세에 90만원 가까이 수령(연봉이 낮으면 60만원 정도 수령할 수 있다고 함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.14(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:30  ==> 

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 제증명서신청내역  ==> 완료
-- 99 제증명서신청내역 조회_01  @@@@@@   --> 20,295 건
-- 99 제증명서신청내역 조회_03  @@@@@@   --> 20,295 건 

-- 99 제증명서신청내역 조회_02   @@@@@@  --> 24,094 건: 신청번호(APPL_ID) 그룹별 시퀀스 넘버링 
SELECT '100' AS "클라이언트" 
        , '1000' AS "인사 영역" 
        --, G2_1.RNUM AS RNUM_02
        --, G2_1.APPL_ID AS 신청번호_02
        -- , G1_1.RNUM
        --, G1_1.APPL_ID 
        , '99995'  LPAD(TO_NUMBER(G1_1.APPL_ID), 12, '0') AS "전자결재 신청번호" 
        , G1_1.RCNT AS SEQNR  
        , G2_1.ISSUE_NO AS 발급번호 
        , G2_1.APPL_EMP_ID AS 발급자ID
        , G2_1.ISSUE_YMD AS 발급일자  
        , '000000' AS 발급시간   
FROM
( 
 SELECT ROWNUM RNUM,
      G1.APPL_ID, 
      G1.RCNT
 FROM    
 ( 
  SELECT A.APPL_ID    
    , B.RCNT
  FROM 
  (
   SELECT T1.APPL_ID 
     , COUNT(*) CNT
   FROM PA7020 T1 -- (PA7020)인사.제증명서발급대장 TB
    , SY7010 T2 -- (SY7010)프레임웍.신청서 TB
   WHERE T1.C_CD = T2.C_CD
    AND T1.APPL_ID = T2.APPL_ID
    -- AND T1.APPL_ID = '00000000000000031567'  -- 신청번호
    -- AND T2.EMP_ID = '3726642'   -- 사원번호(3726642: 박고훈)    
    AND T2.APPL_STAT = '900'    -- 신청서상태(900: 최종완료 300: 결재반려)  
    AND T1.APPL_ID IN (
        SELECT APPL_ID  
        FROM PA7010  -- (PA7010)인사.제증명서신청 TB  
        WHERE 1=1  
            AND CERT_CD IN (   -- 증명서 종류
            '0010'
          , '0020'
          , '0030'
          , '0040'
          , '0060'
          , '0100'
         )
        GROUP BY APPL_ID 
            ) 
   GROUP BY T1.APPL_ID 
  ) A,  
  (
   SELECT ROWNUM RCNT
   FROM PA7020        -- (PA7020)인사.제증명서발급대장 TB  
  ) B   
  WHERE B.RCNT <= A.CNT
  GROUP BY A.APPL_ID  
    , B.RCNT
  ORDER BY A.APPL_ID
 ) G1
 WHERE 1=1    
 -- AND G1.APPL_ID = '00000000000000031567'  -- 신청번호(00000000000000030571,00000000000000031567)
) G1_1,
(   
 SELECT ROWNUM RNUM
   , G1.SEQ_NO 
   , G1.APPL_ID
   , G1.ISSUE_NO  -- 발급번호
   , G1.APPL_EMP_ID   -- 발급자ID(신청자사번)      
   , G1.ISSUE_YMD     -- 발급일자       
 FROM
 (      
  SELECT ROWNUM RNUM
    , T1.SEQ_NO 
    , T1.APPL_ID
    , T1.ISSUE_NO      -- 발급번호
    , T2.APPL_EMP_ID   -- 발급자ID(신청자사번)      
    , T1.ISSUE_YMD     -- 발급일자       
  -- SELECT COUNT(*) 
  FROM PA7020 T1    -- (PA7020)인사.제증명서발급대장 TB
  , SY7010 T2   -- (SY7010)프레임웍.신청서 TB
  WHERE T1.C_CD = T2.C_CD
   AND T1.APPL_ID = T2.APPL_ID
   -- AND T1.APPL_ID = '00000000000000031567'  -- 신청번호
   -- AND T2.EMP_ID = '3726642'   -- 사원번호(3726642: 박고훈, 3706912: 임민환)  
   AND T2.APPL_STAT = '900'    -- 신청서상태(900: 최종완료 300: 결재반려)  
   AND T1.APPL_ID IN (
       SELECT APPL_ID  
       FROM PA7010  -- (PA7010)인사.제증명서신청 TB  
       WHERE 1=1  
        AND CERT_CD IN (   -- 증명서 종류
           '0010'
         , '0020'
         , '0030'
         , '0040'
         , '0060'
         , '0100'
             )
       GROUP BY APPL_ID 
      )    
  ORDER BY T1.APPL_ID,  T1.ISSUE_NO
 ) G1
 WHERE 1=1 
 ORDER BY G1.APPL_ID
) G2_1              
WHERE G1_1.RNUM = G2_1.RNUM   -- G1_1, G2_1 쿼리에서 ROWNUM로 같은 것 @@@
   -- AND G1_1.APPL_ID = '00000000000000031567'  -- 신청번호(00000000000000030571,00000000000000031567)
ORDER BY G1_1.APPL_ID, G1_1.RCNT
; 
==============================================================================================================

- 아파트 중문 설치
http://chukustar.tistory.com/8
https://www.youtube.com/watch?v=x4BRXs3mRuE
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.15(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:00  ==> 이석부 사장님 방문(16:30 ~ 12:00): 정상연 이사(PM), 박문수 대리 술자리(오징어집, 막걸리집)

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 제증명서신청내역 수정: 발급번호(23), 발급자ID(30), 발급일자(8) 필드 수정
--> ZGHR1440: 제증명 발급
==============================================================================================================

- 교육 개발
06 강사료이력_20170116  ==> 완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.16(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:30  ==> 

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 발령품의관리 ==> 발령사유(RSN_CD) 데이타 없음
==============================================================================================================

- V3 8.0
1. cd-key: 87940060-70720636
==============================================================================================================

- 비밀번호
123456789012345
해피수종1701@Ac ==> 해피수종...에이스
해피수종339@Ac  ==> 해피수종...에이스
==============================================================================================================

- DB 사이트
1. 데이터베이스 사랑넷  ==> http://database.sarang.net
2. DBA 커뮤니티 구루비 ==> http://www.gurubee.net
3. DBguide.net :: 데이터 전문가 지식포털  ==> http://www.dbguide.net/index.db 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.17(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 17:00  ==> 

- 현대파워텍 인사시스템 고도화 Proj[★]
- 1.인사 개발
99 발령품의관리 ==> 발령사유(RSN_CD) 데이타 없음  --> 21 9025 발령종료예정일관리.sql에서 발령사유 코드 찾음
==============================================================================================================

- 평가기준_역량행동지표 Query를 엑셀 파일 생성(김건 위원 요청)
SELECT T.ACTION AS 행동지표_90
     , REPLACE(REPLACE(T.ACTION, CHR(13),''), CHR(10),'#@') AS 행동지표
     , T.* 
FROM PM0470 T   -- (PM0470)평가기준_역량행동지표 TB
WHERE 1=1
    AND T.COMP_OBJ_ID = 'TA005'  -- 객체ID
    AND T.ACT_LV_CD = 'LV015'    -- 행동지표레벨코드
;
-------------------------------------------------------------------------------------

- Oracle 개행문자(\r\n) 제거하기   
REPLACE(REPLACE(컬럼명, CHR(10),' '), CHR(13),' ')
chr(10) : 줄바꾸기 
chr(13) : 행의 처음으로 
==============================================================================================================

-- 오라클 버전 확인 @@@
SELECT * FROM PRODUCT_COMPONENT_VERSION
;
SELECT * FROM v$version
;
==============================================================================================================

-- 피봇(Pivot)을 이용하여 행(Row)을 열(Column)로 바꾸기
1. PIVOT을 이용한 예제
-- 가상테이블(2014년 모든일자)
WITH TEMP_TABLE AS
(
    SELECT (TO_DATE('20140101','YYYYMMDD') + LEVEL-1) DTE
    FROM DUAL
    CONNECT BY LEVEL-1 <= TO_DATE('20141231','YYYYMMDD') - TO_DATE('20140101','YYYYMMDD')
) 
--월별 요일건수 (PIVOT 이용)
SELECT *
FROM (
 SELECT to_char(DTE,'MM')  '월' MON
        , decode(to_char(DTE,'D'), '1','일', '2','월', '3','화',' 4','수' ,'5','목', '6','금', '7','토') WEEK
        , DTE
 FROM TEMP_TABLE
 )
PIVOT  -- 오라클 11g부터 pivot 기능을 제공.
(
 COUNT(DTE)
 FOR WEEK IN ('일','월','화','수','목','금','토')
)
ORDER BY MON
 ; 

2. DECODE를 이용한 쿼리
-- 가상테이블(2014년 모든일자)
WITH TEMP_TABLE AS 
(
    SELECT (TO_DATE('20140101','YYYYMMDD') + LEVEL-1) DTE
    FROM DUAL
    CONNECT BY LEVEL-1 <= TO_DATE('20141231','YYYYMMDD') - TO_DATE('20140101','YYYYMMDD')
) 
--월별 요일건수 (DECODE 이용)
SELECT TO_CHAR(DTE,'MM')  '월' MON
        , SUM(DECODE(TO_CHAR(DTE,'D'),'1',1,0)) "일"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'2',1,0)) "월"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'3',1,0)) "화"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'4',1,0)) "수"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'5',1,0)) "목"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'6',1,0)) "금"
        , SUM(DECODE(TO_CHAR(DTE,'D'),'7',1,0)) "토"
FROM TEMP_TABLE
GROUP BY TO_CHAR(DTE,'MM')  -- 월로 그룹핑 
ORDER BY MON
 ;  
-- ==============================================================================================================

-- 그룹1을 조회하면 tbl1의 국어, 영어가 조회되고 그룹2를 조회하면 수학, 과학이 조회 @@@@@
WITH TBL1 AS (
    SELECT 11 COL_ID, '국어' COL_NM FROM DUAL UNION ALL
    SELECT 12 COL_ID, '수학' COL_NM FROM DUAL UNION ALL
    SELECT 13 COL_ID, '영어' COL_NM FROM DUAL UNION ALL
    SELECT 14 COL_ID, '과학' COL_NM FROM DUAL 
) 
, TBL2 AS (
    SELECT '그룹1' GROUP_NM, '11,13' CODE_NM FROM DUAL UNION ALL
    SELECT '그룹2' GROUP_NM, '12,14' CODE_NM FROM DUAL 
)
SELECT A.COL_NM, A.COL_ID, B.CODE_NM
       , ',' B.CODE_NM ',' AS "비교할 대상"
       , ',' A.COL_ID ',' AS "'비교하고자하는 값" 
FROM TBL1 A,TBL2 B 
WHERE 1=1   
    AND INSTR(','B.CODE_NM',', ','A.COL_ID',') > 0 
    AND B.GROUP_NM = '그룹1' 
    -- AND B.GROUP_NM = '그룹1' 
;
-- ==============================================================================================================

- 귀가
17:00 퇴근 
17:15 현대파워텍 정류장(1호차: 터미널행)
17:45 서산터미널 도착
18:00 서산 출발
20:10 강남터미널 도착
20:20 6411번 버스 승차(강남터미널)
21:10 하차(대림역)
21:20 귀가
21:30 석식(비빕밥)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.18(토) 작업■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
06:20 기상 
06:30 집출발
06:40 대림운동장
07:10 숏게임(12명 나옴[추움: 영하 6도], 헤드트릭 함 ==> 목사님이 밥 사라고 했는데 다른 분들이 모두 집에 
 가서 못 사고 집에 옴.
08:00 종료
08:20 귀가
08:30 최 선형에게 전화 옴 ==> 팩시밀리 옮기는 것 도와 달라고 함
08:50 최선형 가게 도착
09:30 화곡역 근처 학원(팩시밀리 옮기는 것 도와줌)
10:10 빵 구입(KT멤버스 30% 할인): 뚜레쭈르 대림우성점
10:30 귀가
12:30 집출발
12:40 자전거 바퀴 아답터 구입(2천원): 대림동 자전거점
12:50 대림역(6511번 버스)
13:30 봉천중 정류장 도착
13:50 글빛정보도서관(2층: 어린이도서관): 수종이 책 읽어 줌
14:20 종료
14:30 중식(뚝불, 돈가스오므라이스): 포마토 식당
15:00 지하철(서울대입구역 -> 대림역)
16:00 귀가
16:30 낮잠
18:00 기상 ==> 최 선형에게 전화 옴
18:30 김철(가스 설비 회사 사장, 수춘이형 고향 후배) 면접
 ==> 연봉 2천 4백
19:00 종료
19:10 귀가
19:30 석식
20:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.19(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 신길4동 축구회 시무식(10시)

▦ 조기축구
05:00 기상
05:20 인터넷 서핑
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장 ==> 창고에서 짐 정리, 최선형과 같이 축구 물품 가져옴
07:10 숏게임  
08:20 게임(신길 4동과 게임) ==> 5게임함
 ==> 수춘이형, 대운이 면담 --> 중문 다는 일 엄청 힘들다고 하지 말라고 함(새벽에 나가고 밥도 못 먹음)
10:40 신길 4동 시무식 ==> 구청장, 신경민 국회의원 참석
 ==> 두혁 형님, 전정현 형님 사건을 징계위원회 회부 여부 관련해서 김대중 수석 부회장이 토론 주제함(회부
      안하는 것으로 결론이 남)
11:20 종료
12:30 중식(닭국밥[맛이 없고 냄새 남]: 신길 4동 조기회에서 제공)
14:00 종료
14:20 최 선형 가게: 대운, 창호, 회장 등등
15:00 더불어 이루미 산악회 창립대회 발대식(또봉이 호프집: 최 선형, 대운)
15:30 최 선형 가게(짬뽕[불어 터져서 겨우 다 먹음], 양장피)
18:00 종료
18:10 귀가
19:00 집출발(비 조금 옴)
20:00 고속버스 터미널(호남선)
20:20 서울 출발
21:55 서산 터미널 도착(비 많이 옴)
22:20 숙소 도착(서산 터미널 -> 중앙호수공원: 도보[약 20분 걸림])
22:30 샤워
00:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.20(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:30  ==> 통근버스 출근(12호차: 07:03, 한양회관)

- 현대파워텍 인사시스템 고도화 Proj[★]
- 01 평가결과_20170116 수정
1. 신조직ID 추가
-- 01 평가결과_20170116 조회 @@@@@  --> 23,293 건  
SELECT   T1.C_CD AS 회사코드   
        , T1.EMP_ID AS 사번   
       -- , T1.ORG_ID AS 조직ID_90
        , (SELECT NEW_SEQ FROM TO_SAP_SY3010 TT1 WHERE TT1.OBJ_ID = T1.ORG_ID) AS 조직ID  -- 신조직ID   
FROM PM0605 T1      -- (PM0605)평가결과_종합결과 TB
;   
==============================================================================================================

- 07 역량_20170217 추가
-- 07 역량_20170217 조회  @@@@@@  ==> 38 건
WITH TBL1 AS 
(
   SELECT T1.COMP_OBJ_ID -- 역량 ID   
  , T1.ACTION  -- 행동지표         
  , T1.ACT_LV_CD  -- 행동지표레벨코드             
    FROM PM0470 T1   -- (PM0470)평가기준_역량행동지표 TB
    WHERE 1=1
       -- AND T1.COMP_OBJ_ID = 'CA001'  -- 객체ID
        AND T1.ACT_LV_CD IN ('LV015', 'LV017', 'LV019')    -- 행동지표레벨코드(LV015: 2수준, LV017: 4수준, LV019: 6수준)  
    ORDER BY T1.COMP_OBJ_ID, T1.ACT_LV_CD
) 
SELECT  M.COMP_OBJ_ID AS "역량 ID"
        , (
            SELECT OBJ_NM 
            FROM SY3010
            WHERE C_CD(+) = '10'  
  AND OBJ_ID(+) = M.COMP_OBJ_ID
  AND TO_CHAR(SYSDATE, 'YYYYMMDD') BETWEEN STA_YMD(+) AND END_YMD(+) 
         ) 역량명
        , MAX(M.ACT_LV_NM_2) AS "2수준 행동지표" 
        , MAX(M.ACT_LV_NM_4) AS "4수준 행동지표"
        , MAX(M.ACT_LV_NM_6) AS "6수준 행동지표"
FROM
(
    SELECT  T.COMP_OBJ_ID
            , MAX(DECODE(T.ACT_LV_CD, 'LV015', REPLACE(REPLACE(T.ACTION, CHR(13),''), CHR(10),'#@'))) AS ACT_LV_NM_2     --- 2수준 행동지표
            , MAX(DECODE(T.ACT_LV_CD, 'LV017', REPLACE(REPLACE(T.ACTION, CHR(13),''), CHR(10),'#@'))) AS ACT_LV_NM_4     --- 4수준 행동지표
            , MAX(DECODE(T.ACT_LV_CD, 'LV019', REPLACE(REPLACE(T.ACTION, CHR(13),''), CHR(10),'#@'))) AS ACT_LV_NM_6     --- 6수준 행동지표
    FROM TBL1 T
    WHERE 1=1
   GROUP BY T.COMP_OBJ_ID, T.ACT_LV_CD, T.ACTION
 ) M
GROUP BY M.COMP_OBJ_ID 
;
==============================================================================================================

- PRD 운영시스템 이관(1일차)
1. 20170220 조직 ==> 완료(22:30, 최평규 이사가 숙소까지 차 태워 줌)
2. DB 테이블 바로가기: /NSE11
--> 테이블명: HRP1001
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.21(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 01:30  ==> 

- 현대파워텍 인사시스템 고도화 Proj[★]
- PRD 운영시스템 이관(2일차)
1. 20170221 발령
 1) 12.사원발령이력(01)_ZZ제외.xls 파일 데이타  16,665건 --> 8개로 쪼개기(건수 축소) --> 올리기(각각 20분 소요)
 2 ) 13.포지션-조직.xls 파일 데이타  18,562건 --> 37개로 쪼개기(건수 축소) --> 올리기(각각 20분 소요)
   ==> 13.포지션-조직_(18S_3710836).xls ~ 13.포지션-조직_(29S_3723484).xls 12개 올리기
==============================================================================================================

- Excel Power Query(엑셀 파워 쿼리): 엑셀에서 대량 데이터 다루기
http://m.blog.naver.com/rickman2/220686993727
http://mylove81.blog.me/220298473863
==============================================================================================================

- 가스 설비 김철 사장에게 메일 보내기
gas4042@hanmail.net
==============================================================================================================

- 귀가
01:30 종료 
01:40 퇴근(최평규 이사가 숙소까지 차 태워 줌)
02:00 최평규 이사가 뼈해장국 사줌
02:30 숙소 도착
02:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.22(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:30  ==>  

- 현대파워텍 인사시스템 고도화 Proj[★]
- PRD 운영시스템 이관(3일차)
1. 20170221 발령
==> 파일 업로드(아카이브)  ZGHR1220 --> 사번: 3822 건 업로드 처리
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.23(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 22:30  ==>    

- 현대파워텍 인사시스템 고도화 Proj[★]
- PRD 운영시스템 이관(4일차)
1. 20170222 기타
==============================================================================================================

- 운영이관 확인사항
30.[0021] 가족구성원피부양자.xls
 1) 부양가족 FLAG 재확인
 2) 가족 건강보험 FLAG 처리 ( 피부양자시작일  ~ 피부양자종료일 )   현재일기준 피부양자,  나이 20세이상 FLAG처리 
 3) 인사팀외출력제외 필드 재확인
 4) 건강보험 취득상실사유 필드값 재확인
 5) 남녀구분

 --30.[0021] 가족구성원피부양자 조회 @@@@@@  --> 3,359 건, 1,691 건 
SELECT   ''T1.EMP_ID 사번, 
         REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-','') AS 주민번호,  
         SUBSTR(REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-',''),7,1) AS 주민번호_90,  
         DECODE(SUBSTR(REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-',''),7,1),'1','X','3','X',NULL) 남자,
         DECODE(SUBSTR(REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-',''),7,1),'2','X','4','X',NULL) 여자,  
      NULL  적요
FROM PA2030 T1      -- (PA2030)가족 TB 
WHERE T1.C_CD = '10'
     --AND T1.EMP_ID = '3734438'
     --AND T1.FAM_CD <> '17'   -- 피부양자가족관계   
      AND SUBSTR(REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-',''),7,1) NOT IN (1, 2, 3, 4) -- 주민번호
       -- (3700045 김유숙: 470910-6100188: 외국인),  (3700543 송신호: 370120-0496312)  
ORDER BY T1.EMP_ID--, REPLACE(XX1.DEC_VARCHAR2_SEL(T1.PER_NO, 10, 'EPN'),'-','')
;
---------------------------------------------------------------------------------------------------

21 9004 자격면허.xls  ==> 1) 수당관련 필드 삭제에 따른 포맷변경
---------------------------------------------------------------------------------------------------

20 9001 학력.xls ==> 1) 중학교이하 인원 누락 ( 백성호 >> )
=> 실제 중학교이하 데이타 안 가지고 옴
---------------------------------------------------------------------------------------------------

20 9003 이전경력.xls  ==> 1) 누락자가 대부분
=> AND LENGTH(STA_YMD) = 6   -- 시작일이라서 데이타 모두 못 가지고 옴
==============================================================================================================

-- 만 나이 조회  @@@
SELECT  FLOOR(MONTHS_BETWEEN(SYSDATE,TO_DATE(DECODE(SUBSTR(PER_NO,7,1), '1', '19','2','19','','','20') 
         SUBSTR(PER_NO,0,6) ,'YYYYMMDD'))/12) AS 만나이 
FROM  (SELECT '8706191011715' PER_NO FROM DUAL)
;

-- 한국 나이 조회  @@@
SELECT EXTRACT(YEAR FROM SYSDATE) -  
             (DECODE(SUBSTR(PER_NO,7,1),'1', '19','2','19','','','20')  SUBSTR(PER_NO,1,2)) +1  as "현재 나이"
FROM  (SELECT '7206251703411' PER_NO FROM DUAL)
; 
==============================================================================================================

- 작업내역 문서 작성
1. 작업내역 문서 작성 후 박문수 대리에게 메신저로 전달
==============================================================================================================

- 가스 설비 김철 사장에게 전화옴
1. 3월 1일(수) 안양 본사로 출근하라고 함
==============================================================================================================

- 가스기사
http://cafe.naver.com/hotengnet/768845 
현대기술학원 ==> http://www.hd-ac.co.kr
[가스기사]드디어 붙었다ㅠㅠㅠ 합격후기와 공부방법~!  ==> http://blog.naver.com/00blueday/220793435948
올배움 KISA(동영상 강의) ==> http://kisa.co.kr/lecture.php?code=0101#books_1409369494
주경야독(동영상 강의) ==> http://www.yadoc.co.kr/search/?keyword=가스
주경야독(환급반: 6개월, 70%) ==>http://www.yadoc.co.kr/lecture/lecture_list.html?lt_id=11295&top=1&left=
가스기사 필기 총정리(일진사, 서상희) ==> http://blog.naver.com/sunyoung6373/220499219057
알기사(동영상 강의) ==> http://gas.algisa.com/front/ProductVodList?a_lLinkCtgKey=3217
자격동 스쿨(동영상 강의) ==> http://www.passdong.com/cert/index.php
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.24(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 17:00  ==> 떡(16:50, 센터 개설 개소식)

- 현대파워텍 인사시스템 고도화 Proj[★]
- PRD 운영시스템 이관 점검
==============================================================================================================

- 귀가
17:00 퇴근
17:15 현대파워텍 정류장(1호차: 터미널행)
17:45 서산터미널 도착
18:00 서산 출발
20:15 강남터미널 도착
20:30 6411번 버스 승차(강남터미널)
21:20 하차(대림역)
21:30 귀가
21:40 석식(비빕밥)
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.25(토) 작업■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
06:20 기상 
06:30 집출발
06:40 대림운동장
07:10 숏게임(18명 나옴)
08:00 종료
08:20 조식(우리 감자탕, 북어국) ==> 최 선형이 쏨: 가스 설비 김철 사장에게 회사에 안 간다고 전달 함(김철 사장에게
       전화해서 안 간다고 함)
09:00 종료
09:30 귀가 ==> (주)지아이데이타 이석부 사장에게 전화: 3월 2일(목) 출근하기로 함
11:10 진료(진가정의학과): 수종 감기
11:20 조제(그린약국): 수종 감기
11:30 구로리 공원(수종이 돌봄)
14:20 종료
15:00 귀가
15:30 낮잠
17:30 기상 
18:00 이마트(자전거)
19:00 석식(이마트 3층 식당)
20:10 귀가
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.26(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장 ==> 최선형과 같이 창고가서 축구 물품 가져옴
07:10 숏게임  
08:20 게임(목일 조기회) ==> 4게임함
        --> 전정형 형님(우리은행 행장)이 귤 2박스 찬조
12:00 종료 
12:30 중식(전주 콩나물국밥집) ==> 조기회에서 쏨
 --> 최선형이 도신 조기회 시무식 갔다와서 밥값 너무 많이 나왔다고 화냄
14:00 종료
14:20 최 선형 가게: 대운, 창호, 회장 등등
14:40 도신 조기회 시무식
15:40 족구(회장님, 최선형, 태우 팀으로 도신팀과 게임해서 대패 함)
16:30 종료
16:40 최 선형 가게: 대운, 창호, 회장 등등
 --> 기석이형이 코치인 응수 말도 없이 집에 갔다고 화냄, 창호 코치 제안 거절했다고 짜증냄: 감독님 코치진들이
      안 도와 줘서 힘들다고 함
 --> 태우가 기우형 말하는데 짤랐다고 최선형이 화냄(태우 삐져서 집에 감)
19:00 종료
19:20 서울식당(삼겹살): 회장님이 쏨
20:50 종료 
21:00 귀가
21:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.27(월) 작업■■■■■■■■■■■■■■■■■■
---> 09:20 ~ 22:30  ==> 강남터미널(06:30) ~ 서산터미널(08:20), 현대파워텍(09:10, 900번 버스)

- 현대파워텍 인사시스템 고도화 Proj[★] 
- PRD 운영시스템 이관 수정
1. 99 제증명서신청내역 수정
 1)  01. 신청 정보 필드 추가: 최종변경시간(6), 승인일자(8), 승인자(15) 필드 추가
==============================================================================================================

- 이전경력 정보 비교(Legacy Data, SAP Data)
20 9003 이전경력 ==> Legacy Data: 3,359 건
20 9003 이전경력_SAP  ==> SAP Dat: 3,090 건
------------------------------------------------------------------------------------------------------

- SAP 테이블 엑셀 다운로드
1. DB 테이블 바로가기: /NSE11(엔터)
2. ABAP Dictionary: Initial Screen 화면
 1) 데이타베이스테이블: PA9003 --> 조회(클릭)
3. Dictionary: 테이블 조회 화면: 내용(이미지 클릭)
4. 데이타브라우저: 테이블 PA9003: 선택화면
 1) 최대적중수: 널 처리 > 시계(클릭)[조회 완료] 
5. 데이타브라우저: 테이블 PA9003: 선택 엔트리 화면
 1) 로컬파일(이미지 클릭)  ==> 엑셀 다운로드
6. 파일에 리스트 저장 화면
 1) 스프레드시트(선택) > 확인(클릭)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.02.28(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:30  ==> 오픈 준비, 중식(고등어 정식, 김남열 대리 --> 김현규 부장이 쏨)

- 현대파워텍 인사시스템 고도화 Proj[★] 
- PRD 운영시스템 이관 일정 
17:00 PRD 운영시스템 이관 시작
17:10 석식(현대파워텍 식당)
19:00 퇴근  ==> 출입증 반납(강상연 이사에게 전달)
19:15 현대파워텍 정류장(1호차: 터미널행)
19:45 서산터미널 도착
20:00 서산 출발
22:15 강남터미널 도착
22:30 6411번 버스 승차(강남터미널)
23:20 하차(대림역)
23:30 귀가
23:00 취침
==============================================================================================================

- 인사개발서버 ==> 10.135.100.72:10 
insadev\insadevadmin / Sysadmin123!@#,  
3724026,/ hpt!1234,
sap ERP(운영): 3724026, / Qkranstn0#,
sap ERP(검증): hr11,/qorengus1!, 
----------------------------------------------------------------------------

2. 인사개발서버 ==> 10.135.100.72:10  -->  insadev\insadevadmin / Sysadmin123!@#,  
==> Total Commander 프로그램 오픈 ==> JeusServer_20170203 파일 선택:  파일 소스보기(Crt + Q) > 소스 새로고침(F2) 
1. Web ==> https://hrdev.powertech.co.kr --> 3724026/hpt!1234,
==============================================================================================================

- 국적허가서 재발급
1. 서울출입국관리소에 가서 재발급 받을 것(가족관계증명서, 신부 여권, 외국인등록증 지참) 
    ==> 베트남 영사관 방문 여부 확인할 것(외국국적불행사 서약서)
 1) 사실증명서 발급신청서(위임장 포함)  ==> http://www.hikorea.go.kr/pt/DownLoadTemplPopupR_kr.pt
------------------------------------------------------------------------------------------------------

- 귀화허가통지 후 절차
1. 귀화허가 절차(베트남) ==> http://sundaycrazy.blog.me/220872989014
2. 귀화허가 절차(베트남) ==> http://chamsalang.workbox.co.kr/ez/inc.php?inc=company/sub6
3. 귀화허가통지 후 절차  ==> http://www.duokorea.com/top/read.cgi?board=b_nationality&y_number=1
4. 귀화허가통지서  ==> http://blog.daum.net/story-2005/13524499 
5. 귀화허가통지서 수령이후 절차  ==> http://blog.naver.com/PostView.nhn?blogId=mepa118&logNo=220782987899
&parentCategoryNo=&categoryNo=37&viewDate=&isShowPopularPosts=true&from=search
------------------------------------------------------------------------------------------------------

- 개명
1. 성씨 지역 결정, 이름 결정  ==> http://cafe.naver.com/thaohong
2. 서류: 기본증명서, 가족관계증명서, 주민등록초본, 주민등록등본, 개명신청사유서 
3. 대한법률구조공단 서울남부지부(서울 양천구 신월로 366 승소빌딩)  ==> http://www.klac.or.kr/html/view.do?code=1069
------------------------------------------------------------------------------------------------------

- 루옌 이른 작명
1. 康雅賢(강아현): 본관: 대림  ==> 작명의 달인 어플
康: 편안 강
雅: 맑을 아
賢: 어질 현
==============================================================================================================

- 현대파워텍 인사시스템 고도화 Proj 작업 내용 @@@@
1. 이관 쿼리 작성	
업무명	내용	비고
1. 인사 이관 쿼리 작성	1. 99 톡톡인사
 1) 99 톡톡인사내역 조회  @@@@@@ --> 59 건
2. 99 발령품의관리
 1) 99 발령품의관리 조회_01  @@@@@@    --> 2,651 건
 2) 99 발령품의관리 조회_02  @@@@@@    --> 34,483 건
3. 99 제증명서신청내역 
 1) 99 제증명서신청내역 조회_01  @@@@@@   --> 20,295 건
 2) 99 제증명서신청내역 조회_03  @@@@@@   --> 20,295 건 
 3) 99 제증명서신청내역 조회_02   @@@@@@  --> 24,094 건: 신청번호(APPL_ID) 그룹별 시퀀스 넘버링 	　
2. 교육 이관 쿼리 작성	1. 04 개인별교육이력_20170109.xlsx  --> ZGHRT5065 (과거 교육이력) 
 1) 2017년 이전 자료  ==> 전체: 75,623 건(이수: 69,862 건)
  가. 6만 5천 건만 다운로드 됨 ==> 5만건 + 만 5천 건으로 분리
 2) 2017년 자료   ==> 전체: 143 건(이수: 139 건) 
2. 05 강사정보_20170116.xlsx
3. 06 강사료이력_20170116.xlsx	　
3. 평가 이관 쿼리 작성	1. 01 평가결과_20170116.xlsx
2. 04 개인별교육이력_20170109.xlsx
3. 05 강사정보_20170116.xlsx
4. 06 강사료이력_20170116.xlsx
5. 07 역량_20170217.xlsx	　
 
2. PRD 운영시스템 이관	
업무명	내용	비고
PRD 운영시스템 이관(1일차)	1. 20170220 조직 폴더 이관	　
PRD 운영시스템 이관(2일차)	1. 20170221 발령 폴더 이관
 1) 12.사원발령이력(01)_ZZ제외.xls 파일 데이타  16,665건 --> 8개로 쪼개기(건수 축소) --> 올리기(각각 20분 소요)
 2) 13.포지션-조직.xls 파일 데이타  18,562건 --> 37개로 쪼개기(건수 축소) --> 올리기(각각 20분 소요) 	　
PRD 운영시스템 이관(3일차)	1. 20170221 발령  폴더 이관
==> 파일 업로드(아카이브)  ZGHR1220 --> 사번: 3822 건 업로드 처리	　
PRD 운영시스템 이관(4일차)	1. 20170222 기타 폴더 이관
 1) 운영이관 확인사항(쿼리 확인 및 수정)
  가. 30.[0021] 가족구성원피부양자.xls 수정
  나. 20 9001 학력.xls ==> 1) 중학교이하 인원 누락 ( 백성호 >> )
   => 실제 중학교이하 데이타 안 가지고 옴
  다. 20 9003 이전경력.xls  ==> 1) 누락자가 대부분
   => AND LENGTH(STA_YMD) = 6   -- 시작일이라서 데이타 모두 못 가지고 옴	　
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
