

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.01) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.01.01(일) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 

▦ 조기축구
07:00 기상
07:20 자전거(문영APT -> 대림운동장)
07:30 대림운동장
08:20 자체게임 ==> 4게임함(3팀으로 나눔)
11:00 종료
10:40 중식(떡국: 다솜 식당): 회에서 쏨
	==> 2017년 임원 소개(회장: 이상길, 총무: 최선, 감독:심기석, 단장: 김승중[천막 찬조, 아들 트레이너로
	 선임할 예정])
12:30 임원단 회의
13:40 강고문님 댁 지하실(카드 -> 닭도리탕(직접 가져옴))
17:00 종료
17:20 양평해장국(뼈해장, 3그릇: 양평해장국): 테이크아웃 
17:40 귀가
19:30 석식(은아와 같이 식사)
00:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.01.02(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
08:00 기상
08:10 버스(대림역 -> 등촌중)
09:20 출근(우림빌딩 B동 9층 901호 (주)소프트원) ==> 영수증 제출" 본사에 복귀해서 경영지원팀 김성욱 
	팀장에게 전달함 ==> 193,5500원[2016년 11월(53,850원), 12월(139,700원) 경비전표]
10:20 조대표 면담(3층 휴계실) ==> 1월달까지 휴가로 처리하고 퇴사하기로 함
11:20 종료
11:40 중식(조대표, 이진우 이사, 곽 부장)
12:40 종료
13:00 지하철(증미역 -> 선정릉역)
14:30 지아이데이타 방문(삼성제일빌딩 20층)
14:40 이석부 사장 면담(2월 1일부터 출근, 출장비 전액 지급, 연본 5천 5백으로 계약함)
	--> 노트북, 모니터 지급, 공통 일 생기면 1월달에 연락 준다고 함
15:10 종료
15:40 선릉역 근처 SK 대림점에 가서 직접 변경
        ==> Band 데이터 세이브 요금제(300M)로 변경 ==> 월 6민 5천원 정도 나온다고 함(프리 클럽 요금 2만 5천원 포함)
17:00 귀가
17:30 수종 도착
17:50 은아 도착  ==> 박스 조립 도와 줌
18:30 루옌 도착
19:30 석식
00:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.03(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
- 가계부 월말 결산
==============================================================================================================

- 배상범 과장 만남(19시 30분)
1. 대림역 8번 출구
2. 준수 네고기 생각: 삼겹살, 주물럭, 소주 --> 5만 6천원 나옴
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01..04(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
- 수종 코드 교환
1. 마리오 아울렛 3관 ==> 5T에서 7T(6~7세용)으로 교환
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.05(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
- 신사FC 서정홍, 병규형에게 전화 --> 탈퇴 요청: 안된다고 함.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.06(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
- 신사FC 총무 신정욱 형에게 전화 --> 6개월 회비 미납으로 제명 했다고 함: 그렇게 해달라고 요청함. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.07(토) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 

- 주말
09:00 기상
09:20 조식(라면)
10:00 집출발(수종)
10:10 진료(진가정의학과의): 수종 감기 ==> 루옌하고 같이 감
10:40 이미트(71,450원 구입): 주말 5% 할인 후 가격 --> 내 카드로 계산: 월말 우리카드  정산할 것
12:40 중식(베트남 쌀국사, 볶음밥): 베트남식당 
13:40 조제(팜프라자약국): 수종 감기
14:20 대림역(6511번 버스)
15:10 봉천중
15:20 글빛정보도서관(2층: 어린이도서관): 수종에게 책 읽어 줌(장남감 때문에 집중력이 없었음)
15:40 종료
15:50 치즈피자(테이트 아웃): 피자스쿨 봉천점
16:00 봉천중앙시장(6511번 버스)
16:50 귀가
19:00 석식
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.08(일) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 

▦ 조기축구
06:20 기상
06:40 자전거(문영APT -> 대림운동장)  
06:50 대림운동장==> 총무님이 6시 30분까지 와 달라고 함
07:10 숏게임 ==> 4게임함(3팀으로 나눔)
07:30 목일 FC(전정형 형 팀) ==> 3게임함(징검다리FC와 3파전)
        --> 김성균이 감독이 골키퍼 본후  하고 안 뛰게 해서 화내고 집에 감
12:00 종료
12:30 중식(회, 굴, 비빕밥, 철희형 오징어 식당): 회에서 쏨 
13:30 임원단 회의
15:00 당구장 ==> 창호, 병준, 종국형, 지경이형 ==> 치킨 시켜 먹음
17:30 종료
17:40 귀가
17:50 삼양저지방우유(2개): 진흥마트
19:30 석식(안 먹음)
23:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.01.09(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★] 
- 대림3동 운동장 추첨(대림FC, 9시)
1. 추첨 장소: 영등포구청 5층 문화체육과(수춘이형 차)
2. 5개로 추첨(최선 총무 주도, 이상길 회장, 박본서 전회장, 김동주 부회장, 이수춘. 김형근)
3. 조식(설농탕: 이상길 회장님이 쏨)
==============================================================================================================
 
- TAMA_DB 작업
1. TB_LOGIN(로그인 정보)_Data.sql 파일 생성
2. TB_LOGIN(로그인 정보)_Data.xlsx  파일 생성  
 1) 01. TAMA_DB 테이블 정보 작업 ==> 총 17건  @@@@@
-- TB_BULLETIN_BOARD_INFO(게시판 정보)   ==> 완료 @@@  
-- TB_BULLETIN_BOARD_INFO(게시판 코멘트)   ==> 완료 @@@ 
-- TB_BULLETIN_LIST(게시판 리스트) ==> 완료 @@@ 
-- TB_BULLETIN_TREE(게시판 트리)   ==> 완료 @@@
-- TB_CODEBOOK(코드 북)_Data   ==> 완료 @@@		-- 5  ==>  @@@@
-- TB_EMP_INFO(사원 정보)_Data ==> 완료 @@@ 
-- TB_EMP_MNG(조직정보관리)_Data  ==> 완료 @@@ 
-- TB_GROUP_INFO(그룹정보)_Data  ==> 완료 @@@ 
-- TB_LOGIN(로그인 정보)_Data ==> 완료 @@@ 
-- TB_MENU(메뉴 정보)_Data ==> 완료 @@@			 -- 10 ==>  @@@@ @@@@ 
-- TB_MENU_ALLOC(메뉴 로그)_Data  ==> 완료 @@@ 
-- TB_MENU_AUTH(메뉴 권한)_Data  ==> 완료 @@@ 
-- TB_USER(사용자 정보)_Data ==> 완료 @@@ 
-- TB_ZIPCODE(WF_메뉴 권한) ==> 완료 @@@ 
-- TB_ZIPCODE(우편번호 정보) ==> 완료 @@@			-- 5  ==>  @@@@
-- WF_MENU_LIST(메뉴 리스트 정보)_Data  ==> 완료 @@@ 
-- WF_USERMASTER(관리자 정보)_Data)  ==> 완료 @@@ 
--=================================================================================================== 
 
- 2017년 설 기차표 예매(KTX, 20시) 
19:00 석식
20:15 집출발(떡 3개, 물, 귤)
20:20 자전거(문영APT -> 영등포역)  
20:45 영등포역 1번 출구 --> 대합실
20:50 TV시청(대합실)
23:10 의자 재정리(대합실): 25번째 자리에 앉음
00:10 합실 의자에서 쪽잠 --> 영등포역에서 히터, 보리차 제공
06:00 설 승차권 예매 신청서 및 번호표 앉은 순서대로 나눠 줌 --> 23번째로 변경  --> 2017.01.10(화) @@@@
06:10 은아에게 카톡왔는데 집에서 인터넷 예매 성공 했다고 함[예약 대기: 1,657명] --> 9시 역창구 예매 포기
06:20 자전거(영등포역 -> 문영APT): 날씨 엄청 추워짐(영하 5도)
06:50 귀가
07:00 취침
==============================================================================================================
 
- 2017년 설 기차표 예매(KTX, 6시) 
1. 포항행(KXT)
1) 2017.01.27(금) 08:15 ~ 10:40, 서울 -> 포항, KTX-산천 455(2호차 10C, 10D, 10D), 160,800원(53,600원) ==> 태만, 루옌, 은아  
2. 서울행(KXT)
1) 2017.01.29(일) 16:25 ~ 18:55, 포항 -> 서울, KTX-산천 468(2호차 10C, 10D, 10D), 160,800원(53,600원) ==> 태만, 루옌, 은아
-------------------------------------------------------------------------------------------------------- 

- 기차표 유아
1. 만 4세(48개월 이상): 50% 할인  ==> 수종이 내년부터 유아표 예매할 것
- 명절 설 기차표 예매 Tip
1. 네이버에서 시간 선택
https://search.naver.com/search.naver?where=nexearch&query=%EC%8B%9C%EA%B0%84&sm=top_hty&fbm=1&ie=utf8 
==> 도시선택(클릭): 서울(자동 선택됨)
2. 6시 예약이면 5시 59분 58초에 조회를 누를 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.10(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★] 
- 02. HSE_MGR_DB 테이블 정보 작업
1. TB_LOGIN(로그인 정보)_Data.sql 파일 생성
2. TB_LOGIN(로그인 정보)_Data.xlsx  파일 생성
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.11(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★] 
- 02. HSE_MGR_DB 테이블 정보 작업
 1) 02. HSE_MGR_DB 테이블 정보 작업 ==> 총 33건  @@@@@   
-- TB_CM_BLBR(CM_게시판)   ==> 완료 @@@  
-- TB_CM_BLBR_CMT(CM_게시판 덧글)   ==> 완료 @@@ 
-- TB_CM_BLBR_CNTN(CM_게시판내용)   ==> 완료 @@@ 
-- TB_CM_BRND(CM_브랜드)   ==> 완료 @@@
-- TB_CM_BRND_GRP(CM_브랜드그룹)   ==> 완료 @@@			-- 5  ==>  @@@@
-- TB_CM_CBC_ATHT(CM_개별권한)  ==> 완료 @@@ 
-- TB_CM_CBC_ATHT_USR(CM_개별권한사용자)  ==> 완료 @@@ 
-- TB_CM_CLMN_HIDE(CM_컬럼숨김)_No Data  ==> 완료 @@@ 
-- TB_CM_CMM_CD(CM_공통코드)  ==> 완료 @@@ 
-- TB_CM_CMM_CD_DTL(CM_공통코드상세)  ==> 완료 @@@		   -- 10 ==>  @@@@ @@@@ 
-- TB_CM_DPRT(CM_부서)  ==> 완료 @@@ 
-- TB_CM_DVLP(CM_개발자)  ==> 완료 @@@ 
-- TB_CM_FL(CM_파일)  ==> 완료 @@@ 
-- TB_CM_GRP(CM_그룹) ==> 완료 @@@ 
-- TB_CM_HLP(CM_도움말) ==> 완료 @@@					-- 5  ==>  @@@@
-- TB_CM_MENU(CM_메뉴)  ==> 완료 @@@ 
-- TB_CM_MENU_GRP(CM_메뉴그룹)  ==> 완료 @@@ 
-- TB_CM_MSSG(CM_메시지)  ==> 완료 @@@ 
-- TB_CM_MY_MENU(CM_마이메뉴)  ==> 완료 @@@ 
-- TB_CM_PRGR(CM_프로그램) ==> 완료 @@@					 -- 20 ==>  @@@@ @@@@   
-- TB_CM_PRGR_ARSL(CM_프로그램실적)   ==> 완료 @@@  
-- TB_CM_PRGR_DGR(CM_프로그램차수)   ==> 완료 @@@ 
-- TB_CM_PRGR_FNDT_PLN(CM_프로그램기본계획)   ==> 완료 @@@ 
-- TB_CM_TODO_OCCRR(CM_TODO발생)   ==> 완료 @@@
-- TB_CM_USR(CM_사용자) ==> 완료 @@@						-- 5  ==>  @@@@
-- TB_CM_USR_BRND_GRP(CM_사용자브랜드그룹)  ==> 완료 @@@ 
-- TB_CM_USR_CMM_CD(CCM_사용자공통코드)   ==> 완료 @@@  
-- TB_CM_USR_MENU_GRP(CM_사용자메뉴그룹) ==> 완료 @@@  
-- TB_CM_WRDC(CM_단어사전) ==> 완료 @@@ 
-- TB_MD_VNDR_MSTR(MD_협력업체마스터)	 ==> 완료 @@@			 --30 ==>  @@@@ @@@@ 
-- TB_MM_RWMT_CD_MSTR(MM_원자재코드마스터)	==> 완료 @@@ 
-- TB_MM_RWMT_ORDR_MSTR(MM_원자재발주마스터)	==> 완료 @@@ 
-- TB_SM_SHP_INFR(SM_매장정보)	==> 완료 @@@ 
--=================================================================================================== 
 
- 오라클 DB에서 INSERT 할 때 & 사용 에러
1. 소재 R & D2팀 ==> 소재 R and D2팀로 변경
INSERT INTO TB_CM_DPRT_02(DPRT_CD, DPRT_NM, STRT_DT, END_DT, HRNK_DPRT_CD
        , SRT_SQOR, RGPS_IP, RGPS_ID, RGST_DTM, UPPS_IP
        , UPPS_ID, UPDT_DTM  
        ) VALUES ('AA11010200','소재R and D2팀','20150401','99991231','AA11000000','2','127.0.0.1','SYSTEM','71/05/09','127.0.0.1','SYSTEM','71/05/09');
--=================================================================================================== 
 
- 최선 형 만남(19시)
1. 서울식당(삼겹살): 최선형이 쏨
2. 재식이, 만복씨(전 총무, 은혜교회, 음향 기기)도 같이 참석
3. 미래 직업에 대해 고민
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.12(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.13(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]  
- Resume 수정
1. 휠라 코리아 차세대 통합ERP Proj: 2016.05 ~ 10: 공통 개발(SSO, DB암복호화, 권한관리, 파일 업로드), 수불 마감
==============================================================================================================
 
- MSI GE60_2OE 사양(집에서 사용하는 노트북) 준비
1. SSD(128G 2개)가 mSata방식이라 포기  ==> mSata방식 SSD(256G) 하나 구입해서 OS 새로 설치를 고려할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.14(토) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 영하 10도

- 주말
09:00 기상
09:20 조식(라면)  
12:00 찜질방 가러다가 수종이 보채고 울어서 포기
19:30 석식(셋트1, 쟁반짜장): 만다린
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.15(일) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==> 영하 10도

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장==> 최선형과 같이 텐트, 난로 설치, 창고 갔다옴
07:10 숏게임
08:0 자체 게임 ==> 3게임함
10:00 종료
10:30 중식(김치찌게, 서울식당): 회에서 쏨 --> 전정형 회원이 꼬막 5kg  찬조
12:30 임원단 회의 ==> 추리닝 찬조 문제(개인 3만원 납부)
14:00 강고문님 댁 지하 ==> 태우한테 도배에 대해 논의(1년간 60만원 수준 급여, 4대보험 안됨)
19:30 종료 
19:50 ESL무지방우유기획(2통): 진흥M
20:30 귀가(술 많이 취함)
20:40 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.01.16(월) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
==============================================================================================================
 
- 이승열 형과 통화
1. 남권이형 부채 문제 협의 --> 사실상 받기 힘들다고 함 --> 심부름 센터에 알아보라고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.17(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
1. 수종이 데리고 병원 갔다가 놀이터에서 놈 ==> 다이소 가서 초코렛도 사줌
==============================================================================================================

- 김은아 노트북 OS 재 설치
0. 삼성전자 시리즈3 NT350V4C-A15 (정품), 673,000원[2013.02.25(월)에 작은 누나 부탁으로 골라서 배송해줌]
==> http://prod.danawa.com/info/?pcode=1720988 
1. Win 10 포맷 못해서 삼성서비스센터 신도림테크로센터 갔다 옴 ==> Advanced > Fast BIOS Mode: Disabed로 
설정 되어 있어야 Boot Menu > Boot Priorty Order에서 1. USB HDD: SanDisk Ultra가 잡힘 
2. Win 10에서 Win 7으로 OS 재설치
3. 드라이버 폴더에서 네트워크 드라이버만 새로 설치함(나머지는 자동으로 잡아줌)
==============================================================================================================
 
- (주)지아이데이타 이석부 사장에게 전화 옴
1. 2월달에 서산 1달짜리 투입 예정 ==> 경력기술 프로필 수정해서 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.18(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
==============================================================================================================

▦ 조기축구(평일 축구:  최선형에게 전화 받고 마지 못해 나감)
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장 
06:40 숏게임
07:40 종료
08:00 조식(김치찌게, 막걸리 2잔, 대림식당): 은혜교회 목사님이 쏨
09:00 귀가
09:50 수춘이형 차
10:30 김포공항(백운교, 김포아랫뱃길) 근처 공장(수춘이형 금형 일 구경)
11:30 종료
12:00 까치산 근처 수춘이형 후배 가게
12:30 중식(갈비탕, 식당): 수춘이형이 쏨
13:30 까치산역 --> 강고문님집(수춘이형 음주 운전)
14:00 김성균이 가게(수경 공인중개사) ==> 커피, 감 얻어 먹음(기석이형과 싸운 후 축구 나오고 싶지 않다고 함)
	==> 나중에 신동아 아파트 24평 매물 나오면 싸게 소개 해준다고 함
15:50 종료
16:00 귀가
19:00 석식
20:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.19(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
- 신사FC 총무 신정욱형에게 전화 --> 이적 동의서 요청: 해준다고 함
==============================================================================================================
 
- 자산 검증
1. 01. 자산 검증(2016).xlsx, 01. 자산 검증(2013, 2014, 2015).xlsx, 01. 자산 검증(2011, 2012).xlsx 파일 작성
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.20(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00  ==> 눈 많이 옴  

- 휴가[★]
-  2016년 귀속 연말정산 안내(종이없는 연말정산) 처리
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.21(토) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 영하 10도 

- 주말
09:00 기상
12:20 중식 ==> 루옌 친구 방문, 쇼핑 감
12:30 수종이랑 같이 집에서 놈
18:40 루엔 귀가 
19:30 석식
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.22(일) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 영하 10도, 밤에 눈 많이 와서 쌓임

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장(눈와서 축구 못 한다고 함) ==> 창고 방문, 다솜 식당에서 오뎅 가지고 옴
07:00 짐 싣고 최선 형 봉고차 타고 신월동 광영고로 출발 --> 눈길 많이 미끄러움
07:50 광영고 도착 ==> 눈 많이 쌓여 있음(발 씨러움)
08:10 휠라 추리닝 입어 보고 치수 결정(상의: 2XL, 하의: XL)
08:30 도신 초교로 이동 결정
09:20 도신 초교 도착  ==> 천막 침
09:40 도신 FC와 매치 ==> 3게임 뜀(축구하고 나니 발이 안 시러움)
01:00 종료 
01:30 중식(북어국, 전복 꽃게 감자탕 식당): 회에서 쏨 
14:00 강고문님 댁 지하(치킨, 족발 얻어 먹음) ==> 용돈(이인석형, 박기우형)
18:00 종료 
18:20 순대, 떡뽑기: 남구로시장 노점
18:30 삼양저지방우유(2개): 진흥마트
18:40 석식(뼈해장, 3그릇: 소문난 해장국 식당): 테이크아웃
20:30 귀가
20:20 이발, 염색 ==> 루옌이 해줌
20:40 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.01.23(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
==============================================================================================================
 
- 취업 면접
07:30 기상
07:40 핸드폰 찾기(전원이 커진 상태에서 부엌 의자에서 발견)
09:00 종료
10:05 수경부동산: 대운이 만남
10:25 수춘이형 만남(수춘이형 차에 탐)
10:45 구로역(현대차 구로대리점): 이상길 회장님 만남
11:30 인덕원IT 밸리(5층)
11:40 진테크 서병준 사장 면접(속초고, 이상길 회장님 1년 선배)
       ==> 3명 면접: 중문 설치(한샘 하청), 기술력 뛰어남
11:50 중식(부대찌개, 서병준 사장님이 쏨)
12:30 3명 모두 2월 1일(수)부터 출근하기로 함
13:10 수춘이형 차
14:00 서울식당(맥주) ==> 이상길 회장님이 쏨(8만원 나옴): 밴드에 재식이가 경훈이 문제로 글 올려서 회장님이 짜증냄
17:00 종료
17:30 다이소 구로시장점(물병, 가구 손잡이)
18:00 귀가
19:30 석식
20:30 BTV 리모콘 분실 ==> 찾기(못 찾음)
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.24(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
==============================================================================================================
 
- 취업 면접
07:30 기상
07:40 BTV 리모콘(운동기구에서 발견)
09:00 종료
09:10 진료(진가정의학과): 수종 감기 ==> 루옌하고 같이 감
09:20 조제(그린약국): 수종 감기
09:40 귀가
09:50 (주)지아이데이타 이석부 사장과 통화 ==> 노가다 간다고 함, 만나서 이야기 하자고 함
10:30 대림역 정류장(6411번 버스)
12:05 선릉역 정류장
12:15 삼성제일빌딩((주)지아이데이타 사무실)
12:20 (주)지아이데이타 이석부 사장과 면담 ==> 창업을 하면 지원 해준다고 함 --> 일단 진테크에 간다고 주장함
       --> 2월달 서산 현대 파워택 프리로 한달(480만 원) 하기로 함
       --> 이상길 회장님에게 전화해서 진테크에는 3월달 부터 출근하기로 함
12:50 한식 부페 ==> 이석부 사장이 쏨
13:00 커피숍아메리카노) ==> 이석부 사장이 쏨
14:00 종료
14:20 대림역 정류장(6411번 버스)
15:30 수경부동산(김성균형: 커피, 감 얻어 먹음)
16:00 귀가
19:30 석식
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.25(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>  

- 휴가[★]
1. 포항계 회비 송금(회비 4만원)
==> 농협: 356 1171 1224 23 홍승표
==============================================================================================================
 
- 건강보험 피부양자 등록 방법
http://sky3545.blog.me/220779544965
http://rubilliac.tistory.com/698
==============================================================================================================
 
- 영등포축구연합회
http://www.ydpsoccer.co.kr/bbs/board.php?bo_table=08_07
1. 이적동의서 확인
==============================================================================================================
 
- 보험 정리 @@@@
11. 무배당 PCA 드림링크 변액유니버셜보험 II			==> 8,818,177원(38,400,000원, 92%)	--> 2006/05/10
12. 무배당 PCA 스타트(start) 어린이 변액유니버셜보험 II	==> 7,401,256원(10,894,080원, 67.9%)	--> 2014/05/12
13. MET 무배당 마스터플랜 변액유니버셜종신보험		==> 7,266,358원(11,072,000원, 62.8%)	--> 2006/04/30
90. PCA 프리미어 변액유니버셜보험 Ⅲ(저축형)			==> 9,596,444원(45,000,000원, 92.8%)	--> 2014/06/16
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.26(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>

- 휴가[★] 
==============================================================================================================
 
▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장 
06:40 숏게임
07:40 종료
08:00 조식(갈비탕, 대림식당): 대호조기회 고문님이 쏨
08:40 귀가 
15:50 종료
16:00 귀가
17:00 수종이 귀가
17:20 구로리 놀이터
18:00 대림역
18:40 서울고속터미널(수종 같이 감)
19:20 장모님 만남
20:10 고속버스터미널(6411번 버스)
21:00 귀가
20:30 석식
20:40 취침
==============================================================================================================

- 서울 도시가스 요금 확인
https://www.seoulgas.co.kr/front/payment/useCostLogin.do
==============================================================================================================
 
- 건강보험자격확인서 발급
민원신청 > 자격 > 자격확인서 발급
http://sky3545.blog.me/220779544965 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.27(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>

- 설 연휴1
06:30 기상 
07:15 집출발(수종, 루옌, 은아)
07:66 서울역 도착 
08:15 서울역(KTX) 출발
10:55 포항역 도착
11:10 택시(포항역 -> 포항집): 7,000원
11:20 포항집 도착
12:10 중식
17:00 작은 누나네 도착 ==> 령경이,은아와 죽도시장 나들이 간다고 감
18:00 주남이형 차(SMS5) 얻어탐
18:30 대왕한정식 도착(30분 늦게 도착)
18:40 포항계 모임: 성표(총무 처음), 진철, 정철, 봉춘,  태정(먼저 감), 주남형(진호형 불참)
18:45 석식(돼지고기) --> 선물: 선물셋트 받음
19:20 귀가(주남이형 차)
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.01.28(토) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 설날

- 설 연휴2(설날) 
09:00 기상    
09:20 차례
	==> 은아(5만), 령경(3만)에게 용돈 줌
	==> 수종 부모님에게 10만원, 작은 누나에게 10만원 받음
10:00 종료   
10:30 식사  
14:30 작은 누나네, 엄마, 수종 후포에 드라이브 하러 감
20:00 석식
21:00 큰누나네 도착
22:00 작은누나네 도착
23:00 큰누나네. 작은누나네, 엄마 이동에 있는 찜질방에 감
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.29(일) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>

- 설 연휴3
09:00 기상 
11:00 엄마 도착
15:00 중식
15:45 포항집 출발
16:15 포항역 도착
16:25 포항역(KTX) 출발
19:00 서울역 도착(비조금 옴)
20:00 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.30(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>

- 설 연휴4(▦ 조기축구)
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장(운동장 문 잠겨 있음, 눈와서 축구 못 한다고 선이형에게 문자옴)
07:00 조식(해장국: 일심해장국) ==> 선이형이 쏨
08:00 귀가
08:10 신사 FC 병규형한테 문자옴 ==> 전화해서 가도 돼냐고 물음
08:20 대림역(6411번 버스)
09:00 학동역 도착
09:10 신구초교 도착  ==> 형들과 고문들한테 인사 드림
09:30 시합 ==> 눈이 와서 미끄러움, 젊은 애들 많이 들어와서 빨라진 느낌이 듬
11:00 종료
11:30 춘집 어른 순대국집(순대국밥)==> 오고문님이 쏨
13:30 종료
14:30 커피숍==> 영석이형이 쏨
15:30 볼링(학동역 근처) ==> 1판 승리(저녁 내기),2판 패배(볼링비 내기: 10만 5천원 나옴(내가 3만원 냄))
16:00 석식돼지고기 주물럭)
19:00 종료 ==> 영석이형이 고속터미널까지 태워 줌
20:30 귀가
20:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.01.31(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>
 
- 서산 파견[★]
08:00 기상
08:50 자전거(문영APT -> 대림운동장)  
09:10 진가정의학과(수종 감기) 
09:30 수종 어린이집
10:00 귀가
10:00 2016년 귀속 연말정산 처리[(주)소프트원 안경과 과장에게 전화]  ==> 간편제출하기 처리 완료
12:40 중식 
16:00 집출발 
17:00 고속버스 터미널(호남선) 
19:00 서산 터미널 도착
20:00 숙소 도착
20:40 취침
==============================================================================================================

- 2016년 귀속 연말정산 안내(종이없는 연말정산) 처리
1. (주)지아이데이타 사업자번호: 220-87-57184  ==>  2016.01.01 ~ 2016.05.14(토)
 ==> 2016년 중도입사자는 직전 근무지 원천징수영수증 메일(2016@esoftone.co.kr) 제출
  --> 전근무지 급여 입력 않하고 현 근연말정산간소화 자료를 조회하여 회사에 온라인 제출 후, 간편제출하기 처리 후
	(주)소프트원  담당자게에 문자 보냄
1. (주)소프트원 사업자번호: 120-86-27419  ==>  2016.05.16 ~ 2016.12.31
------------------------------------------------------------------------------------------------

- 자료 입력(작성) 
0,. 홈택스 "편리한 연말정산"(https://www.hometax.go.kr) 
  1) 왼쪽하단 목록순으로 작성 및 제출(연말정산간소화 자료 조회[조회버튼: 클릭] --> 공제신고서 작성하기[위쪽 버튼: 클릭] --> 간편제출하기) 
  1. 공제신고서 작성  @@@@
Step.01 기본사항입력
--> 사업자등록번호 > 수정: 클릭 > 근무처 선택 및 추가입력(새창) >  
	1) 주(현)근무지: (주)소프트원 사업자번호: 120-86-27419   --> 자동인력됨
	2) 종(전)근무지: (주)지아이데이타 사업자번호: 220-87-57184  --> (주)지아이데이타에 전화해서 원천징수영수증
	 받아서 (주)소프트원 담당자에게 메일로 보낼 것
Step.02 부양가족 입력
--> 장인, 장모 포함 
Step.03 공제항목별 지출명세 작성
--> 국민연금, 국민건강보험, 고용보험 ==> 자동 입력됨
--> 신용카드 ==> 0. 연말정산간소화 자료 조회 > 소득ㆍ세액공제 자료 조회에서 자동인력됨(14,994,567원)
--> 의료비 ==> 장인 의료비(명지성모병원에서 전화해서 개인 팩스(FAX: 0504-177-0898)로 받음)
Step.04 공제신고서 내용 확인
==============================================================================================================
 
- 2016년 연말정산((주)소프트원 경리가 메일로 보냄)
① 총급여: 47,664,692원,		② 근로소득금액: 35,531,458원
③ 과세표준: 21,553,698원,		④ 산출세액: 2,153,054원
⑤ 결정세액(소득세): 788,7858원,		⑥ 기납부 소득세액(먼저 낸 세금): 0원(1,211,670원 예상)
⑦ 차감징수납부(환급)예상세액(⑤-⑥): - 원(소득세: 857,770원, 지방소득세: 85,720원)
근무처 : （주）소프트원(120-86-27419)
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
