

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.03) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.03.01(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  
06:30 대림운동장 ==> 최선형과 같이 창고 갔다 옴 
07:10 숏게임  
08:20 게임(도신 조기회) ==> 3게임함
12:00 종료
12:30 중식(두루치기: 우리 감자탕, 도신 조기회와 같이 식사함): 회에서 쏨
13:30 종료 
14:00 귀가
14:30 낮잠
18:00 기상
19:20 조식
20:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.02(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00  ==> 

- 본사 복귀(10:30)
1. 사장님이 내 이력서 삼성전기에서 블락 당했다고 함
==============================================================================================================

- (주)지아이데이타에서 지급받은 HP 노트북 정보[2017.03.02(목)]
1. 모델명: HP ProBook 4530s
2. S/N: CNU2103K95
3. Product: A9E26PA#AB1
==> http://egloos.zum.com/dlsrb214/v/1184456
-------------------------------------------------------------------------------------------------------

- HP ProBook 4530s 노트북 사양 
1. CPU: 인텔 i5-2430M CPU @ 2.50GHz
2. RAM(메모리): 8GB DDR3
3. HDD 용량: 500G 
4. OS: 운영체제 미포함 ==> Windows7 Ultimate K x64 설치 
5. 그래픽 칩셋: HD Graphincs 3000
6. LCD 크기: 15.6인치(1600 * 900)
7. 무게: 2.4Kg
8. 배터리: 6셀(1500mAh)
12. 해상도: 1920 x 1080
--------------------------------------------------------------------------------------------------------
 
1. SSD로 교체 - 속도의 신세계가 열리다.(HP ProBook 4530s)  ==> http://blog.naver.com/sikim71/220709331399 
==============================================================================================================

- 귀화허가서 재발급 
1. 서울출입국관리소에 가서 재발급 받고 출근함(09:00 ~ 10:20)
2. 필요 서류: 신부 외국인등록증
 1) 사실증명서 발급신청서(필요 없음) ==> http://www.hikorea.go.kr/pt/DownLoadTemplPopupR_kr.pt 
==============================================================================================================

- 기본증명서 3통 발급 받기(13:30 ~ 15:20)
1. 역삼2동 주민센터에 가서 기본증명서 3통 발급받기
2. 필요 서류: 귀화허가서, 신부 외국인등록증
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.03(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00  ==> 

- 본사 대기(13:00)
1. 노트북(hp probook 4530s) OS 설치, SW 설치
2. 다음주 월요일에 인스웨이브(웹스퀘어) 팀장 미팅 같이 가자고 함
==============================================================================================================

- 귀화허가서 나온 이후 해야할 일 정리 (이중국적 기준)   ==> http://blog.naver.com/tamario/220947952885
1. 동사무소 (주민센터)에 가서 기본증명서 3통 발급받기  ==> 완료(어제 처리) @@@
 - 외국인 등록증 딱 내밀고 기본증명서 떼달라 그러면 '외국인은 기본증명서가 없어요...' 이런다. 
귀화허가서를 같이 보여주면. 아... 잠시만요 하고 떼준다.(등록 기준지로 조회해서 처리해줌) 
허가서 뒷면을 잘 읽어보면 왜 3통이나 발급받는지 미스테리다. 2통만 있으면 되는데?
* 준비물 : 귀하허가서 (보여주기용), 외국인등록증 (혹시나 확인), 여권 (혹시나 확인)
수수료: 3천 원(3장)
 
2. 출입국사무소에서 외국국적 불행사 서약확인서 받아오기  ==> 완료 @@@ㅍ
- 준비물 : 기본증명서 (동사무소에서 발급받은), 허가통지서 (사본), 외국인등록증, 사진 (3X4cm) 1장
주의사항 - 허가통지서 원본은 집에 가지고 있는게 좋단다. 외국인 등록증은 이떄 반납하고 오는게 나중에 두번일 안해서 
편하다. 외국인 등록증을 반납하면 확인서에 '외국인 등록증 반납' 란에 체크를 해준다.  
==> 외국인 등록증 반납함
결론적으로 출입국 사무소에서 받아올 것 : 외국국적 불행사 서약서 확인서  1통 (인지대 : 2천원)
  
3. 동사무소로 다시 돌아와서 주민등록 신청하기   ==> 완료 @@@
-  현재 살고 있는 집의 세대주가 함께해야 한다는 것. 세대주는 집안 어른, 남편, 아내 등등 사람마다 다 다르므로 패스. 
암튼 세대주 없이 혼자가면 안받아준다. 

준비물: 외국국적 불행사 서약확인서 (출입국사무소에서 받아온), 기본증명서, 사진 (3X4) 1장, 여권 
주민등록을 정식으로 하니, 이때 열개 지문을 모두 찍는 작업을 한다. 접수후 약 4주정도면 주민등록증이 발급된다.(문자 준다고 함)
이제 한국인이니 주민등록증으로 여권만들고 뭐 하고 싶은거 하면 된다. 

5. 창씨개명(주민증이 나오면 처리 할 것)
- 한국에서 외국이름으로 살기는 참 힘들다. 차별때문에 힘든게 아니라 이름이 길어서 힘들다. 병원에 가서 대기자 명단이
나오는 모니터에도 이름이 짤려 나오고, 어디 이름을 불러줘도 못 알아먹고.. 암튼 그냥 세글자 이름이 편하니, 되도록이면 
이 과정을 거치는 것이 좋을 듯 싶다. 

창씨개명은 주민등록이 모두 마무리된 이후, 별도의 프로세스로 법원에서 해야할 일이다. 
그러면 당연히 주민등록증, 여권 모두 다시 만들어야 한다. 이게 귀찮어서 그냥 살고 싶지만... 암튼.
그 과정은 따로 정리할 예정.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.04(토) 작업■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
06:00 기상
06:30 집출발
06:40 대림운동장
07:10 숏게임(18명 나옴)
08:00 종료
08:20 조식(북어국, 우리 감자탕, 문주현) ==> 전태성 고문님이 쏨
09:30 귀가
10:30 대중이형 만남(신동아 아파트 2동): 조기회 체크 카드 받음
11:10 삼성전자서비스 구로휴대폰센터 방문(갤럭시 노트5 핸드폰 뒷면 유리 깨짐 --> 수리비 5만 9천원: 포기함)
11:30 구로리 공원(수종이 돌봄): 날씨 따뜻해서 잘 놀았음
15:00 종료
15:20 귀가
15:40 낮잠
18:00 기상 
19:00 석식((짜장면2, 짬봉): 만다린, 배달
20:10 귀가
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.05(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  ==> GS25에서 물 12개 구입
06:30 대림운동장 ==> 신업범형과 같이 창고에서 짐 차에 실음(롯데행 모닝 차)
07:30 대림운동장 앞에서 출발
07:50 영신초교 도착
08:10 숏게임
08:20 게임(신길 1동 조기회) ==> 3게임함
       ==> 총무님이 없어서 대신 총무 역할 함
       ==> 임시 회의(1. 하늘색 스타킹 없는 사람 구매해서 지급하라고 함. 2. 구급약 상시 비치 요청)
12:00 종료
12:30 중식(된장찌게: 서울식당): 회에서 쏨(회에서 13만원 체크 카드로 결제)
	==> 삼겹살 먹은 사람은 만원씩 각출(16만원): 지경이형이 받아서 줌
	==> 조기회 체크 카드, 영수증 서울식당 주인 아주머니에게 맡김(최선형이 수령한다고 함)
13:30 종료
14:00 강고문님 댁 지하 ==> 선이 형 늦게 와서 중식 문제 스트레스 받지 말라고 함
18:10 종료 
18:20 귀가 
19:00 석식(피자): 루옌이 이마트 가서 사옴
	==> 갤럭시 노트5 핸드폰 케이스 변경(검정색 -> 남색)
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03..06(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==> 인스웨이브(웹스퀘어) 팀장 미팅 후 퇴근, 2017 WBC 1라운드 개막(한국 1: 2 이스라엘)

- 본사 대기
1. 웹스퀘어 분석
2. 인스웨이브(웹스퀘어) 팀장 미팅
 1) 서울시 구로구 디지털로 306, 대륭포스트타워 2차 414호
 2) 김영은 팀장(SW컨설팅): 010-4664-6515, yekim@inswave.com
 3) 내용: Websquare UI 공통 투입 논의(세종시 3개월[먼저 신청함], 대전)
==============================================================================================================

- 인스웨이브 콜센터(웹스퀘어)
1. 로그인: tamario@naver.com / ta**3*9
http://qna.inswave.com/websquare/websquare.html?w2xPath=/ws/login/login.xml&inPath=%2fws%2flogin%2flogin.xml&menuId=QnA
==============================================================================================================

- 노트북 SSD 구입 검토
1. [삼성전자] PM961 M.2 2280 256GB 병행 (NVMe), 가격: 153,000원 ==> http://www.joyzen.co.kr/product/sInfo.html?fid=1&uid=279
&Pnum=275354&optsid=DNW&DTS_AID=
2. 삼성 950 PRO M.2 시리즈 [정품,256G], 가격: 250,500원 ==> http://www.enuri.com/detail.jsp?modelno=12550409
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B364160406&frm3=V2
---------------------------------------------------------------------------------------------------------

- 개인 노트북 사양
- 1. MSI GE60_2OE) 구입(집에서 사용하는 노트북) ==> 2014.03.19(수) 구매 @@@ 
1. CPU: 인텔 코어i7-4세대 i7-4700HQ(동작 속도: 2.4 GHz)
2. RAM(메모리): 8GB DDR3(최대 32GB 메모리까지 인식)
3. OS: 운영체제 미포함 ==> Windows7 Ultimate K x64 설치
4. HDD 용량: 1TB(7200rpm) ==> mSATA 용량: 256GB(128GB*2: mSATA)
5. 그래픽 칩셋: 엔비디아 지포스 GTX 765M, 듀얼 그래픽, 인텔 HD 그래픽스 4600
6. LCD 크기: 15.6인치(와이드 16:9 Full HD)
7. 무게: 2.4Kg 
8. 배터리: 6셀(1500mAh)
9. 유선 랜: 기가비트(Killer e2200 PCI-E Gigabit Ethernet Controller(NDIS 6.20))
10. 무선 랜: 802.11 n
11. 카메라: 전면 VGA, 후면 500만 AF 카메라
12. 해상도: 1920 x 1080 
13. 웹캠: HD고화질 웹캠(720p)
14. 보증기간: 2년
15. 광학 디스크: ODD 미포함(외장형 별도 구매)
16. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2013년 7월 출시
--------------------------------------------------------------------------------------------------------

02. 노트북 구매
1) MSI GE60-2OE Lite (1TB + mSATA 256GB), 가격: 1,320,000원 ==> 온라인 주문
http://commoum.co.kr
 1) 송금 정보: (주)서영정보씨엔에스[☎ 02)703-2861], 국민은행: 60020101107398, 예금주: 서형규
--------------------------------------------------------------------------------------------------------
 
04. 노트북 사양 정보
1. 모델명: MSI GE60-20E, 시리얼번호(Serial Number): , PCID:
2. 맥 주소(Mac address: 물리적 주소): 44-8A-5B-42-AF-1B
-------------------------------------------------------------------------------------------------------- 

05. 기타
- MSI 노트북(GE60_2OE) USB로 Win 7 설치 방법
1. BOOT(Delete키 누름)
 1) Boot mode select: [UEFI]을 [LEGACY]로 변경
 2) F10하고 저장을 함
2. 노트북 오른쪽 USB 꽃는 곳에 Win 7 설치용 USB 꽃음
3. 재시작할 때 F9를 누름
 1) 설치할 USB를 선택하고 엔터 누름
--------------------------------------------------------------------------------------------------------

- MSI 노트북(GE60_2OE) Driver 다운로드
http://www.msi.com/product/nb/GE60_2OE.html#download
==============================================================================================================

- 해외 직구
1. http://blog.naver.com/bluebirdkids/220885180195
http://blog.naver.com/PostList.nhn?blogId=tamario&from=postList&categoryNo=76
==============================================================================================================

- (주)지아이데이타 그룹웨어
1. tamario /tama339  ==> http://gidata.hanbiro.net/groupware/?category=index&section=main

- (주)지아이데이타 그룹웨어 모바일
1. 앱에서 한비로 그룹웨어 다운로드 --> gidata.hanbiro.net, tamario /tama339
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.07(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:00  ==> 루옌 야근하고 늦게 퇴근(21시)

- 본사 대기
1. 웹스퀘어 분석
-  WebSquare5 사용자 가이드
1. http://docs.inswave.com:1975/6aca15a7e9eaabe9#0a700243ceb80eec
==============================================================================================================
 
- 비밀번호 관리[2017.03.07(화)]
1. 라스트패스(LastPass)[무료] ==> 설치 --> https://lastpass.com/misc_download2.php
C:\Users\Administrator\AppData\LocalLow\LastPass\iehome2.html
1) LassPass(마스트 키) ==> tamario@naver.com / hp태*1*0*@
2) LassPass ==> tamario@naver.com / hp수*1*0*@
--------------------------------------------------------------------------------------------

- 라스트 패스(크롬용)
https://www.lastpass.com/?lpInstall
--------------------------------------------------------------------------------------------

- LastPass Windows용 다운로드
https://lastpass.com/simpledownload.php
==============================================================================================================

- [일체형 PC] LG 24V570-GA55K, + 1TB, 가격: 1,138,000원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B393163872&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.08(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 대림역 근처 치과 검색
1. 치과가는날(구로D역 1번 출구) ==> http://www.xn--o39arsn1gercm32d.kr
2. 이디치과(구로D역 1번 출구, 토, 공휴일 휴무) ==> http://www.edclinic.co.kr/sub.php?f_submenus=0104
3. 사람중심치과의원(남구로구역) ==> http://srsmile.strikingly.com/
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.09(목) 작업■■■■■■■■■■■■■■■■■■

- 본사 대기
1. 웹스퀘어 분석
 1) Websqure5 사용자 가이드 ==> http://docs.inswave.com:1975/6aca15a7e9eaabe9#0a700243ceb80eec
==============================================================================================================

- 공인인증서 처리(신한은행에서)
1. 스마트폰 인증서 PC로 가져오기(공인인증서 가져오기)
 1) PC에서 신한은행 홈페이지(www.shinhan.com)에 접속
 2) PC금융서비스 > 모바일 화면 ==> 스마트폰 > PC인증서복사: 버튼(클릭)
 3) PC에서 복사할 인증서 암호 입력
 4) 스마트폰에서 PC로 인증서 복사
2. PC인증서 스마트폰 내보내기(공인인증서 내보내기)
 1) PC에서 www.shinhan.com/sbank에 접속
 2) PC화면의 'PC -> 스마트폰으로 인증서복사' 버튼을 선택한 후, 사용하실 인증서 선택하고 인증서 암호 입력
 3) PC화면에 인증번호 8자리를 입력 후 'PC에서 스마트폰으로 인증서복사'버튼(선택)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.10(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 박근혜 대통령 탄행 인용(재판관 전원일치(8:0), 헌법재판소)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- (주)지아이데이타 이석부 사장 만남
1. 이석부 사장이 3월 16일 재입사로 처리 요청(3월 급여 절반만 지급 한다고 통보함)
==============================================================================================================
 
- 2월 입금(?)
2017.02.24 199,940원 월급여 (우리)
==> 2월 급여 480(4,641,600원)  ==> 3월 25일 지급 예정
==============================================================================================================

- 온라인 예약(대림운동장)
1. 대림 3동 조기회 예약 ==> https://yeyak.seoul.go.kr/reservation/view.web?rsvsvcid=S110408145609728241
tamario2 / 해피수종1***01@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.11(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>

- 주말
06:00 기상
06:30 집출발
06:40 대림운동장
07:10 숏게임(20명 나옴)
08:00 종료
08:20 조식(북어국, 우리 감자탕, 재식, 경훈, 대운, 수춘이형) ==>  남정식 목사님이 쏨
	--> 수춘이형 핸드폰 분실
09:30 귀가
11:30 구로리 공원(수종이 다이소에서 장난감 안 사준다고 울고 해서 놀이터에서 안 놀고 귀가) 
12:00 귀가
15:00 집출발(대림역 -> 홍대입구역(경의선 환승) -> 풍산역(1번 출구) -> 저동 고교 -> 응아집
16:30 응아집 도착(음료수 사감)
17:00 진료(3층 응아 씨아버지집) ==> 루옌 어금니(오른쪽 아랫쪽 아말감으로 하기로 함)
      , 나(오른쪽 윗쪽 어금니 2개 금니로 브릿지로 하기로 함 ==> 사기로 해서 깨짐)
	--> 총 가격: 60만원(3개)  ==> 보철 만듬(다음주 토요일에 완료 예정) 
19:30 종료
20:30 고기집(고기 부페[인당 만 5천원]) ==> 종민씨가 쏨
21:00 종료
21:10 종민씨집(커피)
22:30 종료
22:50 풍산역 --> 서울역(잘못 탐) 
23:30 서울역 --> 신도림역 --> 대림역
24:00 대림역(수종 잠)
24:15 귀가
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.12(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)  ==> GS25에서 물 18개 구입
06:30 대림운동장 ==> 상희형차에 짐 실음
07:30 대림운동장 앞에서 출발
07:50 장훈고 도착 
08:20 게임(신광 조기회) ==> 4게임함
       ==> 박기후 운영위원장이 임시 감독함
       ==> 박기후 운영위원장이 2만원 찬조해서 물, 음료수 추가로 사다 먹음
12:00 종료
12:20 중식(김치찌게: 다솜식당): 회에서 쏨 
13:00 실버대회 응원 대림2동 2:2, 양평 1:1 ==> 2무로 조 3위로 탈락 
14:00 삼겹살(다솜식당)
	==> 한운석 고문님 태우가 지하철 태워서 보내드림
	==> 태우가 재식이가 30대 데리고 탈퇴한다고 해서 재식이 다솜에 불러서 오해를 품
	    --> 내가 술이 취해서 재식이 때려서 재식이 입술 터졌다고 함
20:10 종료 
20:20 귀가 
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.13(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==> 휴가1

- 휴가1
- 대림3동 운동장 추첨(대림FC, 9시)
1. 추첨 장소: 영등포구청 5층 문화체육과(최선형 차)
2. 5개로 추첨(최선 총무 주도, 이상길 회장, 박본서 전회장, 김동주 부회장, 김형근)
3. 조식(설농탕: 이상길 회장님이 쏨)
==============================================================================================================

- 재식이 만남
1. 석식: 재식이 만나서 사과하고 고기 사줌(정현이 동석)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.14(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==>  

- 휴가2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.15(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==> 

- 휴가3
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.16(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==>  

- 휴가4
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.03.17(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 17:00  ==>  

- 휴가5
==============================================================================================================

- TV, 인터넷 교체 검토 
1. LG U+, TV
 1) 3년 약정(고급형 플러스) ==> 27,390원
 TV 셋톱박스 임대료, 설치비, TV단말장비 가격 무료
http://www.uplus.co.kr/css/tvin/tvg4/RetrieveTvG4KPayGuide.hpi
==============================================================================================================

- LG TV, 인터넷 가입
1. 3년 위약금: 17만원
2. 통신사 : 47만원==> 20만원(상품권 12만원)
3. LG U+ UHD + 인터넷 ==> 월 3만 5천 8백원 납부
4. 처음 가입비 3만 5천원 예상
==============================================================================================================

- 창성 개명
1. 성씨 지역 결정, 이름 결정 
2. 서류: 아내 이름으로 기본증명서 2통, 혼인관계증명서 2통, 가족관계증명서 2통, 부부 중 한사람의 주민등록등본 2통
   , 귀화허가통지서[국적취득사실 증명서], 범죄경력 회보서 1통 ==> 안 가져가도 될 것 같음
   , 개명신청서(법원 비치), 창성 및 본 신청서(법원 비치)
   , 건강보험료 납부확인서, 보험증, 도장(베트남이름)  ==> 대한법률구조공단용
   , 주민등록증, 대리로 접수시 위임장[가족은 위임장 필요 없음], 대리인 신분증
   ==> 다만 위임장 양식은 특별한 것이 없으며 위임자, 피위임자의 인적사항과 위임하는 내용 및 위임자의 
  신분증 등이 있으면 됩니다. 
3. 대한법률구조공단 서울남부지부(서울 양천구 신월로 366 승소빌딩)  ==> http://www.klac.or.kr/html/view.do?code=1069 
4. 기타 ==> http://cafe.naver.com/thaohong
5. 추후 일정
 1) 은행 통장 명의 변경, 신한은행 써니뱅크 등록, 공인인증서 재발급, 핸드폰 명의 변경, 여권 발급
 2) 루옌 주민등록번호 ==> 940509-2064910 
==============================================================================================================

- 창성 개명 증명서 발급
1. 대림2동 주민센터
2. 수수료(기본증명서, 가족관계증명서 2통, 혼인관계증명서 2통) ==> 5천원
==============================================================================================================

- 종민씨 부 이 치료비 송금
1. 신한은행: 110-180-208029, 예금주: 이종민, 60만원(3개)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.18(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>

- 주말
06:00 기상
06:20 집출발
06:30 대림운동장
07:10 숏게임(20명 나옴)
08:00 종료
08:10 게임(팬택 축구회[네트웍 장비, 다솜 식당 2층]) ==> 2게임 뜀
10:00 종료
10:20 조식(북어국, 우리 감자탕) ==> 강 고문님이 쏨
11:00 귀가
11:20 빵 구입(핫브레드 대림역점)
11:40 귀가
12:20 눈높이 한글 정용숙 선생에게 전화해서 수종이 눈높이 그만둔다고 통보 ==> 4월까지만 하기로 함
13:10 집출발(대림역 -> 홍대입구역(경의선 환승) -> 풍산역(1번 출구) -> 저동 고교 -> 응아집
14:30 응아집 도착
16:00 진료2(3층 응아 씨아버지집) ==> 루옌 어금니(오른쪽 아랫쪽 아말감으로 하기로 함)
      , 나(오른쪽 윗쪽 어금니 2개 금니로 브릿지로 하기로 함)
--> 총 가격: 60만원(3개) 송금 완료 ==> 보철 끼우기 완료
17:30 종료
19:30 동이아구찜(알탕(루옌, 수종, 응아, 응아남편) ==> 내가 쏨
20:00 종료
20:10 종민씨집(커피)
21:00 종료
21:10 풍산역 --> 대림역
22:30 대림역
22:50 귀가
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.19(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 제 5회 새마을 금고배 축구 대회(도신축구회 주관)

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장 ==> 팔각정에 자리 잡음 
--> 도너츠(재식, 현용 찬조), 두부김치(호섭 형님 찬조), 음료수(동주 형님 찬조) 
08:00  첫 게임(대림3동 5:0 대림성당)
09:00 새마을 금고배 축구 대회 개회식
10:00 시합(대림3동 0:0 도신) ==> 조 1위로 준결승 진출
11:00 임시 회의
==> 1. 스타킹 회에서 구입해서 회원에게 비용 받고 지급하기로 함(5천원 예상)
==> 2. 5월 야유회(도신과 같이 가기로 잠정 결정, 5월 21일 예상)
12:30 시합(대림성당 1:0 도신) ==> 도신 예선 탈락  
13:00 시합(대림3동 4:0 대림1동) ==> 대림3동 결승 진출
13:30 시합(대호 2:1 대림성당) ==> 대호 결승 진출  
15:00 시합(대림3동 3:0 대호) ==> 대호 우승, 대림3동 준우승(상금 30만원 획득)
--> 실력에서 참패함, 미드필드(최선형)이 게임 망침(왼쪽 허벅지 부상 입음)
15:30 종료
15:40 삼겹살(다솜식당)
==> 한운석 고문님 태우가 지하철 태워서 보내드림
==> 맥주만 조금 먹고 신분증(2개) 찾아주고 집에 감[4개 보관](다른 형들 오징어집에 있다고 전화 왔는데 안감)
18:00 종료 
18:10 귀가
19:10 루옌 다오집에 갔다옴
20:30 이발, 염색 ==> 루옌이 해줌
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.20(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
-  WebSquare5 사용자 가이드
1. http://docs.inswave.com:1975/6aca15a7e9eaabe9#0a700243ceb80eec
==============================================================================================================

1. (주)지아이데이타 이석부 사장 면담
- 웹스퀘어 4월초 세종시 다시 추진하기로 함 ==> 웹스퀘어 철저 분석할 것
--------------------------------------------------------------------------------------------------------

- 연봉 계약서 작성[(주)지아이데이타]
1. 총연봉: 5천 5백(월: 4,230,769원) ==> 정규직(1년 후 퇴직금 지급[연: 4,230,769원])
2. 급여일: 25일
3. 공식 출근일: 3월 16일(실제 출근일: 3월 2일 --> 3월달 절반 만 일한 것으로 하기로 합의 함)
==============================================================================================================

- 프린터 연결[(주)지아이데이타 본사]
1. HP Officejet Pro 8660 ==> http://[fe80::a22b:b8ff:fe6d:627e]/
http://support.hp.com/kr-ko/drivers/selfservice/hp-officejet-pro-8660-e-all-in-one-printer-series/5398139/model/5387678
------------------------------------------------------------------------------------------------

- 프린터 연결2[수동 설치(HP Officejet Pro 8660)]
1. 제어판\하드웨어 및 소리\장치 및 프린터(화면)
> 프린터 및 팩스(4): 마우스: 우 클릭 > 프린터 추가(T)  > 프린터 추가(새창)
네트워크, 무선 또는 Bluetooth 프린터 추가(W): 클릭 
> 사용 가능한 프린터를 찾는 중...
프린터 이름: HP Officeject Pro 8660(HP), 주소: 192.168.0.6 ==> 선택 > 다음(N)(클릭)
==============================================================================================================

- 루옌 주민등록증 도착 문자 받음
1. 대림2동 주민센터에 가서 찾아 가라고 문자 옴 ==> 18일 걸림
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.21(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
- 간단한 websquare기반 웹 어플리케이션 개발서버 세팅
1. http://egloos.zum.com/iris2380/v/378997

- [WebSquare] 1. WebSquare의 설치방법과 화면구성
https://www.youtube.com/watch?v=sevB2h0NbKI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.22(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00  ==> 

- 휴가6
==============================================================================================================

- 루옌 귀화 처리(17시, 주민센터)
1. 대림2동 주민센터에 가서 루옌 주민증 찾기  ==> 완료 @@@
2. 도장(베트남이름)  ==> 4~5천원 해서 못 팜
3. 건강보험료 납부확인서, 보험증  ==> 완료 @@@
==============================================================================================================

- 최선형 만남(19시, 서울식당)
1. 닭도리탕, 막걸리(서울식당): 수춘형, 재춘형, 경훈  ==> 최선형이 쏨
2. 호프(또봉이 치킨) ==> 경훈이 돈 2만원(회비) 받아서 최선형이 내한테 만원 줌
==> 중간에 나옴(23시 귀가) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.23(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 2017 WBC 미국 우승(미국 8:0 푸에르토리코)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- jquery 강좌
1. 테레비 보다 재미있는 제이쿼리 (jQuery) 강좌 ==> https://www.w3schools.com
https://www.youtube.com/watch?v=tXubUpSb2p8&list=PLsGh7Wc318kgN8_X1f833ah9IfC8KbNs7&index=22

2. [jQuery 동영상 강좌] 1. 웹 개발자를 위한 jQuery 기본이해
http://www.sqler.com/408575
==============================================================================================================

- eval() 함수
1. eval() 기능함수는 Javascript 코드가 맞는가 틀린가를 검정하고 수행한다.  ==> evaluation: 평가
--> 문자열을 수치화 시키는 역활
<script type="text/javascript">
<!--
    var x = 20;
    var y = 30;     
    var xy1 = eval("x * y") + "<br>";
    var xy2 = eval("10 * y") + "<br>";
    var xy3 = eval("100 + 200") + "<br>";
 
    document.write(xy1 + xy2 + xy3);   // ==> 출력결과:  600, 300, 300
//-->
</script>  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.24(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 급여 수령
1. 2월 급여(서산): 4,646,600원
2. 3월 급여(15일): 1,755,750원
3. 연말정산: 706,430원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.25(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:40 ==>

- 주말
06:00 기상
06:20 집출발
06:40 대림운동장
07:10 숏게임
08:00 종료
08:10 게임 ==> 1게임 뜀
08:40 종료
09:00 조식(북어국, 우리 감자탕) ==> 고문, 형님들이 나워서 냄
09:40 종료
10:00 귀가
11:10 진료(진가정의학과): 수종 감기
11:20 조제(그린약국): 수종 감기
12:00 대림역(6511번 버스)
12:50 봉천중
13:10 루옌 도장(딘티루렌 이름으로 도장을 탐 --> 미성당: 5천원)
13:20 글빛정보도서관(2층: 어린이도서관): 수종에게 책 읽어 줌
14:00 종료
14:20 중식(돌솥, 돈가스오므라이스): 포마토 식당
14:50 봉천중앙시장(6511번 버스)
15:50 귀가
19:00 석식(이마트 피자[올 포 유], 13,500원)
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.26(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)
06:30 대림운동장
08:10 숏게임 --> 파란색 스타킹(만원 써니뱅크로 이체 처리함)
08:20 게임 ==> 4게임함
10:30 종료
11:30 중식(묵어국: 우리 감자탕): 회에서 쏨
12:30 종료
12:40 강고문님 댁 지하 ==> 족발, 인기형한테 서비스로 만원 받음
14:10 종료
14:20 귀가
19:00 석식
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.27(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 01. Do it! 안드로이드 동영상 시청
1. 
==============================================================================================================

- 수종 병원 예약(15시, 고대구로병원) 
1. https://guro.kumc.or.kr  --> tamario, / tama339@,  
2. 2017.03.29(수) 15시 이비인후과 채성원 교수
==============================================================================================================
 
- 아이핀 발급(i-pin)[2017.03.27(월)]
1. http://www.vno.co.kr  ==> tamario/ hp태*16*1@	--> 2차 비밀번호: hp태*16*1
2. 발급기관: 한국신용평가정보  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.28(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 화동 이노테크 프로젝트 WBS 제안
1. 인스웨이브(웹스퀘어) 김영은 팀장(SW컨설팅)에게 메일 옴(제목: 인력 요청)
 1) 김영은 팀장(SW컨설팅)에게 직접 전화 함
2. 프로젝트 환경 구성, 분석/설계, 개발 및 테스트 모두 2개월에 하라고 함
 1) 프로젝트 환경 구성 ==> 지원 없음(직접 해야 함) @@@
  ■ WAS 설치
   - DB 설치 ==> MySQL로 설치(무료SW) @@@
   - 프레임워크 설치 ==> 전자정부프레임워크 설치(무료SW) @@@
   - 웹스퀘어 설치
  ■ WebSquare Project 구성 ==> 인스웨이브에서 지원해줌 @@@
 2) 분석/설계 => 수준 낮음 @@@
 3) 개발 및 테스트  
3. 기타
 1) 초기 PC에 로컬로 구성해야 함
 2) 화면 본수는 5~6본 정도이도 파일럿 개념의 프로젝트로라고 함 
 3) 김영은 팀장이 3MM로 고객에게 다시 제안한다고 함
 4) 개발 일시: 2017년 4월 2째주
 5) 개발 장소: 선정릉역 근처 
==============================================================================================================

- 노트북 SSD 구입 검토
0. 삼성 850 EVO mSATA 시리즈 [정품,500G], 가격: 223,130원 ==> http://www.enuri.com/detail.jsp?modelno=12095150
0. 삼성 850 EVO mSATA 시리즈 [정품,500G], 가격: 214,000원 ==> http://prod.danawa.com/info/?pcode=3102742&cate=112760
1. 플렉스터 S2G M.2 2280 SATA SSD [정품,256G], 가격: 109,190원 ==> http://www.enuri.com/detail.jsp?modelno=14787636 
2. [삼성전자] PM961 M.2 2280 256GB 병행 (NVMe), 가격: 153,000원 ==> http://www.joyzen.co.kr/product/sInfo.html?fid=1
&uid=279&Pnum=275354&optsid=DNW&DTS_AID=
3. 삼성 950 PRO M.2 시리즈 [정품,256G], 가격: 250,500원 ==> http://www.enuri.com/detail.jsp?modelno=12550409
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B364160406&frm3=V2 
4. M.2 시리즈 ==> http://www.enuri.com/list.jsp?cate=071317
5. mSata(SATA3) SSD 설치==> http://www.enuri.com/list.jsp?cate=07130309
==============================================================================================================
 
- 노트북 구입 검토
0. MSI GE72VR-7RF Cobra Pro [+SSD 256G], 가격: 1,749,000원 ==> http://www.enuri.com/detail.jsp?modelno=15449706
&cate=&IsDeliverySum=N
1. MSI CX62-i5 6QD SSD 240G+H1TB, 총16G(램8Gx2ea)(기존램회수)가격: 855,900원 ==> http://www.enuri.com/detail.jsp
?modelno=13081472&cate=&IsDeliverySum=N
==============================================================================================================
  
- 외장하드 구입 검토
1. 삼성 J3 Portable USB3.0 [4T], 가격: 256,000원 ==> http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=846290300
&GoodsSale=Y&jaehuid=200002673
2. 씨게이트 Backup Plus S Portable Drive USB3.0 [4T], 가격: 207,183원(해외직구 대행) ==> https://www.buyitnow.co.kr/product/amazon.com/B0196J3UZ2
3. 씨게이트 Backup Plus S Portable Drive USB3.0 [4T], 가격: 213,000원(파우치, 케이블) ==> http://item2.gmarket.co.kr/Item/detailview
/Item.aspx?goodscode=715782273&GoodsSale=Y&jaehuid=200002673
4. Seagate Backup Plus S Portable Drive (4TB), 가격: 199,000원 ==> http://item2.gmarket.co.kr/Item/detailview/Item.aspx
?goodscode=914367185&GoodsSale=Y&jaehuid=200002657&service_id=pcdn 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.21(금) 작업■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 일남 부친상(강남고속터미널: 19:40 -> 상주: 종환이와 같이 내려감)

[대우증권 인도네시아법인 홈페이지 재구축 Proj] 

- MSI GE60_2OE 개인 노트북 구입
1. GE60-2OE Lite (1TB + mSATA 256GB), 가격: 1,320,000원
2. 현용이 추천해줌 ==> 실망 
==============================================================================================================

- 해외직구 대행
1. BuyItNow  ==> https://www.buyitnow.co.kr, tamario@naver.com / ta*a3**
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.29(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00  ==> 휴가7

- 루옌 창성 개명 처리
07:00 기상 
08:30 집출발
08:50 대림역 출발(깁밥, 떡)
09:20 교대역 도착
09:30 대한법률구조공단 서울중앙지부 도착
10:00 성과 본의 창설허가 신청 처리
	==> 접수 거부당함: 3인 가구 기준 건강보험료 월 14만원 미만이여야 접수 해준다고 함(16만원 = 진태만: 12만원
	     + 딘티루옌: 4만원)
10:50 종료
11:10 교대역 출발
11:20 양재역 도착
11:30 서울가정법원 도착
11:35 성과 본의 창설허가 신청 처리 
13:05 접수 거부당함: 영등포구는 서울남부법원에 가서 처리하라고 함(12 ~ 13시 점심시간)
14:00 귀가
14:10 중식(김밥2, 떡)
14:35 대림3동 어린이집(자전거: 수종 데리려 감)
14:50 고대구로병원 접수
15:10 고대구로병원 진료 ==> 중이염(수종 오른쪽 귀에 물이 찼다고 함 --> 약먹고 2주 후 다시 진단한다고 함)
15:40 종료
15:50 조제(바로약국): 10일치 약
16:00 종료
16:05 자전거(수종: 고대구로병원 --> 신정교 --> 서울남부법원)
16:40 서울남부법원 도착(1층 종합민원실 2번 창구)
16:50 성과 본의 창설허가 신청(수수료: 천원, 송달료: 22,000원) 처리
	개명허가 신청(수수료: 천원, 송달료: 22,000원) 처리
	송달(등기우편) 희망주소:  서울시 금천구 가산디지털1로 233 에이스하이엔드타워9 6층 (주)광명테크솔루션
17:00 종료
17:30 빵 구입(빠리바게트)
18:00 귀가
19:30 석식
22:00 취침
==============================================================================================================

- 성과 본의 창설허가 신청
1. 서류: 기본증명서 1통, 가족관계증명서 1통, 주민등록등본 1통, 대리로 접수시 위임장 1통(루옌 도장)
----------------------------------------------------------------------------------------------------------------------------

- 개명허가 신청
1. 서류: 기본증명서 1통, 가족관계증명서 1통, 혼인관계증명서 1통, 주민등록등본 1통, 대리로 접수시 위임장 1통(루옌 도장)
----------------------------------------------------------------------------------------------------------------------------
 
- 대한법률구조공단 방문상담 예약
1. 일시: 2017년 3월 29일(토) 10시
2. 장소: 대한법률구조공단 서울중앙지부(서울 서초구 법원로4길 17)
3. 예약번호:170329-100001
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.30(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00  ==> 맥주((주)지아이데이타 직원, 3만원 냄)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 이미지 용량 줄이기 및 사진 크기 조절(알씨 사용법)
1. http://mural.tistory.com/238
2. 사용법
 1) 이미지 보이기 > 이미지: 마우스 우 클릭 > 크기변환(K): 클릭 > 이미지 크기 변경(새창)
용량으로 조절하기: 500KB(설정) > 확인(0): 클릭
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.03.31(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- ncs01_요구사항확인, 유스케이스 다이어그램, 클래스 다이어그램, ERD
https://www.youtube.com/watch?v=T-Kefezhc_k
http://www.jamjalee.com/software-architecture-intro/
---------------------------------------------------------------------------------------------------
  
- 표준프레임워크 버전 3.5 이해하기 : 전자정부 표준프레임워크 강좌
https://www.youtube.com/watch?v=NVTGNTPH00E
http://www.jamjalee.com/egovframe-videos
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
