

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.12.01(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 
  
- 통합 수정
- 상품별반품현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_ReturnItemList.jsp) 
==============================================================================================================
 
- 상품별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleList.jsp) 
System.out.println("[/SaleMgrBean.java]::[p_merchant_cd]->"+  (String)inputHash.get("p_merchant_cd") +"" +  
"[p_order_dt]->"+ (String)inputHash.get("p_order_dt") +"[p_order_no]->"+  (String)inputHash.get("p_order_no") +"" +  
"[p_ar_way_cd]->"+ (String)inputHash.get("p_ar_way_cd")); 
System.out.println("[/MemberSvcBean.java]:[searchMyPasswd]:[SQL]===> \n"+ SQL); 
==============================================================================================================
 
- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

1. i3mart 
상품군 축소 
4단계 상품 전시 -> 3단계 상품 전시 
이미지 변경(i3mart 상단 이미지, 대, 중카테고리 이미지) 
-> 최대한 빠른 시간에 작업 요망 

2. 비즈메카(/display/main/S065_bizmeca.jsp) 수정 
상품수 확대(현재 6개에서 20개) 
메인에 20개 상품 전시(이미지 작게 작업): 상세보기 가능 
-> 2004년 12월 10일 이전까지 작업 요망 

3. 킬러앱 
Kill in Kill 기능: 수시로 저가로 상품 판매(수시 등록, 삭제 가능) 
카테고리 구분(공산품, 생필품, Kill in Kill) 
생필품은 회차당 3만원 이상 구매 해야 배송비 없음(장바구니) 
다음 회차 상품 공지: 전체보기 기능(제조사, 판매가격 제외: 상세보기 안 함) 
-> 2004년 12월 10일 이전까지 작업 요망 
==============================================================================================================

- 비밀번호 수정됨 
*** 이연희 MM(i3ssgc01/*: 12d3wCI8qWQio) --> lee3888 rkdmsgml 
비밀번호를 변경했다고함...또 주민번호로 비번이 바껴있다고함.  
011-9350-000  / 이연희 MM 
==============================================================================================================

- 메일 생성건 
※ 고객정보: 전준선 soo06  비번 : hsw04228 이멜생성안됨  
http://old.i3shop.com/admin.html(i3shop/0506) --> 211.233.5.104 

- 이메일경로 --> 211.233.5.102 
e:\nMail\MailDir\i3shop.com\200409\soo06 
==============================================================================================================

- 45128 (주)보성 
11월 30일자 발주(입고)번호 9번 
대금정산에서 리스트가 안뜨네요... 확인요망 
T_ENTR_BANK_ACCOUNT: 거래처 은행계좌정보   
==============================================================================================================

%%  노현옥   pretty59   Member    
20041129, 장순자, 0100012004112900625, 20041129 
- R&F매장 - i3 노블레스 소프트웨어+스타트키트  - 1100000 - 1 
--> 위 소프트웨어 설치시 -> 인증서버접속 되지 않는다는 에러난다고함 
확인후 전화 요망  - 최주희   juhee5726  Silver-M  * 
------------------------------------------------------------------------------------------------------------- 

-- 회원정보 수정 @@@@ 
-- =====> 노블레스CD 설치는 DOMAIN_NM(www.i3shop.co.kr)이 없고 CDBUY_GUBUN(02), CDBUY_CD(00)이여야 가능 
-- UPDATE T_MEMBER 
SET CDBUY_CD = '00'  --CD구매여부(00:미신청, 01:신청, 02:설치 완료) 
--WHERE MNO = '655766'   --회원번호 
WHERE MEM_ID = 'test01'    --회원ID 
; 
==============================================================================================================

- 이미지 추가 하기 
- 미러쿠아반신욕기본체 
http://sunkwh.mart.cc/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010101&p_item_cd=00151274&p_display_cd=11
- 미러쿠아반신욕기설치비 
http://sunkwh.mart.cc/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010101&p_item_cd=00151275&p_display_cd=11 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00  

- 통합 수정
- Sort처리  @@@@@@@@@@ 
<script language="javascript"  for="GRD_poDtl" event=OnDblClick(row,colid)> 
	// Sort처리부분 
	if (row == 0)  
	{ 
		DS_tempPoDtl.SortExpr = "+" + colid; 
		DS_tempPoDtl.Sort(); 
	} 
</script> 
==============================================================================================================

- 반품현황 수정 
상품별반품현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_ReturnItemList.jsp)  
==============================================================================================================

- 협력업체 수정
- 대금정산 수정(모델명 추가) 
쇼핑몰 엘지세화(주) B0000520/2431 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.03(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
비즈센타별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForBizcenterP.jsp)  
ORDER_CRT_TP: 주문발생유형코드(01:POS, 02:ONLINE) 
ORDER_CRT_DTL_TP: 주문발생상세유형코드(01:일반, 02:R&F) 
==============================================================================================================

- 쇼핑몰 수정
 - 제한수량 상품 등록(/BizMgr/ItemMgr/LimitCount/buyLimitItemP.jsp) 
ITEM_TP: 상품타입(01:제한상품, 02:킬인킬상품, 03:킬러앱 공지상품) 
==============================================================================================================

- 팝업창 올리기 
지금 보내 드릴 팝업은 로그인 했을때..뜨는걸로 하면 되구요~  
기존 팝업중 "LG텔레콤 아이쓰리샵 대리점 오픈기념 이벤트" 팝업을 내려 주시구요~!!    
"인터넷 복권" 팝업은...로그인 하고..B2B에 들어갔을때..뜨게 해 주세요!!^^  
==============================================================================================================

** 문종철Silver-M         gagopn01 
반신욕기를 주문할려고 한다함. 카드결재가 되지 않는다고함. 
오류메세지 : 결재실패했다는 메세지만 계속적으로 확인된다고함 

BC카드 사용  : 카드번호  / 5388210194229353  
0202 폐기된인증서 
==============================================================================================================

- 칼럼 추가, 삭제
- 칼럼 추가[add column]  ======> DB 칼럼 추가, 삭제 
-- 칼럼 추가  --------- 
ALTER TABLE T_BUYCOUNT ADD (  
ITEM_TP    CHAR (2) --상품타입(01:제한상품, 02:킬러앱 상품공지, 03:킬인킬상품) 
); 

ALTER TABLE T_BUYLIMITCOUNT ADD ( 
ITEM_TP    CHAR (2) --상품타입(01:제한상품, 02:킬러앱 상품공지, 03:킬인킬상품) 
); 

ALTER TABLE T_BUYTIMES ADD ( 
ITEM_TP    CHAR (2) --상품타입(01:제한상품, 02:킬러앱 상품공지, 03:킬인킬상품) 
); 
--------------------------------------------------------------------------------------- 

-- 칼럼 수정  --------- 
ALTER TABLE T_BUYLIMITCOUNT MODIFY (  
   ITEM_TP    CHAR (2)   NOT NULL /* 상품타입  */     
 ); 
--------------------------------------------------------------------------------------- 

-- 칼럼 삭제  --------- 
ALTER TABLE T_ORDER DROP column RETURNACCEPTDATE; 
-------------------------------------------------------------------------------------------------------------------

SELECT * FROM T_BUYCOUNT   
--T_BUYLIMITCOUNT(구매제한 상품 정보), T_BUYCOUNT(구매제한 실 구매 정보), T_BUYTIMES(회차정보) 
;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 13:00 ==> 비 

- 통합 수정
킬러앱 수정 
Kill in Kill 기능: 수시로 저가로 상품 판매(수시 등록, 삭제 가능) 
카테고리 구분(공산품, 생필품, Kill in Kill) 
생필품은 회차당 3만원 이상 구매 해야 배송비 없음(장바구니) 
다음 회차 상품 공지: 전체보기 기능(제조사, 판매가격 제외: 상세보기 안 함) 
-> 2004년 12월 10일 이전까지 작업 요망 
==============================================================================================================
  
- 사업자 번호 변경 
업체코드 45147 렉스진 바이토텍  
303-81-13820 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.12.06(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
- 킬러앱 상품공지 등록(/BizMgr/ItemMgr/LimitCount/KillerAppNoticeP.jsp) 
BIZ_KillerAppNoticeP 
---------------------------------------------------------------------------------------------------------- 

- 킬인킬 등록(/BizMgr/ItemMgr/LimitCount/KillinKillP.jsp) 
BIZ_KillinKillP   
==============================================================================================================

- PRIMARY KEY 추가 
일단 새로이 추가하려는 key값에 null이 없다면 
1먼저 기존 pk를 drop 시키고 새로운 PRIMARY KEY 를 만들면 된다.  
1. ALTER table T_BUYLIMITCOUNT DROP PRIMARY KEY; 
2. ALTER table T_BUYLIMITCOUNT ADD constraint PK_BUYLIMITCOUNT PRIMARY KEY(ITEM_CD, TIMES_CD, ITEM_TP); 
------------------------------------------------------------------------------------------------------------------------- 

-- 칼럼 수정  --------- 
ALTER TABLE T_BUYLIMITCOUNT MODIFY (  
   ITEM_TP    CHAR (2)  NOT NULL DEFAULT '01', /* 상품타입  */     
 ); 
==============================================================================================================

- 9410455809747018(국민카드)  
최진옥(vipmart) 
2004110500284 4,289,000 
2004110500257 1,100,000 
라규화(hj1004) 
20041130 01479 5,278,000  
강계재(pibushop) 
20041130 01494 5,373,000 
조용구(hoom77) 
20041130 1755 1,119,600 
신애경(sinmart) 
20041130 1784 5,155,900 
==============================================================================================================

- 신용카드 결제  
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당) ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵) 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.12.07(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 ==> 맑음 

- 통합 수정
- i3mart 실서버 등록 
==============================================================================================================

- 킬러앱 상품공지 등록(/BizMgr/ItemMgr/LimitCount/KillerAppNoticeP.jsp) 
BIZ_KillerAppNoticeP 
---------------------------------------------------------------------------------------------------------- 

- 킬인킬 등록(/BizMgr/ItemMgr/LimitCount/KillinKillP.jsp) 
BIZ_KillinKillP    
==============================================================================================================

- 스크립트 테스트 서버 
211.233.5.107(administrator/i3shop1070321) 
==============================================================================================================

- 1. 제한구매 수량 조회 
상품상세 보기_(바로구매) --> /cart/cartPut.jsp  --> /order/rnf/checkRnFSes.jsp 
상품상세 보기_(장바구니 담기) --> /cart/cartPut.jsp  --> /cart/cartGetP.jsp 
상품상세 보기 --> /display/com/itemDetaiInfoP.jsp 
장바구니_(구매하기) --> /order/rnf/checkRnFSes.jsp 
장바구니 --> /cart/cartGetP.jsp 
장바구니_수량 --> /cart/cartUpQtyTp.jsp 

 - 2. 제한구매 수량 정보 저장 
주문서작성_(확인) --> /order/orderPut_3.jsp 
==============================================================================================================

- 제 목 : [공지] 공인인증서비스 일시 중단   
금융결제원의 공인인증시스템 방화벽 교체 작업으로 
공인인증서비스를 아래와 같이 일시 중지되오니 
업무에 참조 있으시기 바랍니다. 

2004.12.11 (토) 01:00 ~ 03:00까지 (2시간) 
- 신원인증서비스, CRL(Certificate Revocation List) 검증서비스 중지 
==============================================================================================================

*** 김성태    kocen01 ****** 
카드번호 : 4906114045141989 
오류메세지 :  신용카드 유효기간 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 통합 수정
- AM 권한 부여 
-- UPDATE T_MEMBER 
SET GRADE_CD = '03', --직급 수정(AM권한 부여) -- 김수오(allddong82/i759495) 
CDBUY_GUBUN = '01' --CD회원_구분(01:기존) 
WHERE MEM_ID = 'allddong82' --회원ID 
; 
==============================================================================================================
  
- 정수기 수정 
 제조번호, 처리일자 
==============================================================================================================

-- 주문 후 중복 배송건 조회(거래처별 주문상세 숫자와 배송(T_STOREOUT) 숫자가 일치하지 않은것) @@@@@@@ =========> 
SELECT A.ORDER_DT, A.ORDER_NO, B.ENTR_NO, B.CNT AS 주문상세_수, C.CNT AS 배송_수 
FROM T_ORDER A, 
     (SELECT COMPANY_CD, MERCHANT_CD, ORDER_DT, ORDER_NO, ENTR_NO, COUNT(*) CNT 
      FROM T_ORDER_DTL 
      GROUP BY COMPANY_CD, MERCHANT_CD, ORDER_DT, ORDER_NO, ENTR_NO ) B, 
     (SELECT COMPANY_CD, RECV_MERCHANT_CD, RECV_DT, RECV_NO, COUNT(*) CNT 
      FROM T_STOREOUT 
      GROUP BY COMPANY_CD, RECV_MERCHANT_CD, RECV_DT, RECV_NO ) C 
WHERE A.COMPANY_CD = '01' 
   AND A.MERCHANT_CD = '0001' 
   AND A.ORDER_DT >= '20041101' 
   AND A.ORDER_TP ='01'         -- 주문유형(01:정상주문, 03:반품주문) 
   AND A.ORDER_STS >= '03'      -- 주문상태(03:결재완료) 
   AND B.CNT <> C.CNT           --거래처별 주문상세(T_ORDER_DTL) 숫자와 배송(T_STOREOUT) 숫자가 일치하지 않은것 
   AND B.COMPANY_CD = A.COMPANY_CD 
   AND B.MERCHANT_CD = A.MERCHANT_CD 
   AND B.ORDER_DT = A.ORDER_DT 
   AND B.ORDER_NO = A.ORDER_NO 
   AND C.COMPANY_CD = A.COMPANY_CD 
   AND C.RECV_MERCHANT_CD = A.MERCHANT_CD 
   AND C.RECV_DT = A.ORDER_DT 
   AND C.RECV_NO = A.ORDER_NO 
; 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.12.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:30 ==> 맑음 

- 통합 수정
- 정수기 수정 
 사용부품(USERD_PRDT) --> 제조번호,  처리일자(PROC_DT) 
-------------------------------------------------------------------------------------------------------------------- 

- 후레쉬워터 연락처 
031)763-2573 김교혁 *@*.* 
김인환 
==============================================================================================================

- 동호회 개설 문제  
박원호(*) pbigplan ->이분 사이트에서만 동호회 개설이 안되거든요. 
--> 도메인이 www.i3shop.co.kr이면 동호회 개설이 불가능 함 
리셀러 회원이라도 개인 도메인이 존재해야만 동호회 개설이 가능합니다 
개인 도메인이 있다고 하더라도 도메인 당 한개의 동회회만 개설 가능 합니다 
-------------------------------------------------------------------------------------------------------------------- 

- 동호회 이미지 등록 경로 수정 
websphere\installedApps\BizStore.ear\BizStore.war\img\club\upimg 
==============================================================================================================

- 제안 
1. 글자수 제한 
2. 회람, 복사 쉽게 사용 하기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 ==> 맑음 

- 통합 수정
- 정수기 수정 
테스트 버전 데이타 적용 테스트 
사용부품(USED_PARTS), 사용부품 수량(USED_PARTS_QTY) ,  처리일자(PROC_DT) 
-------------------------------------------------------------------------------------------------------------------- 

- 후레쉬워터 연락처 
031)763-2573 김교혁 *@*.* *@*.*  
==============================================================================================================

- 방문요청일 
==============================================================================================================

- 쇼핑몰 수정
- 동호회 수정 
동호회 수정 안 됨(null일 경우 수정 가능 처리) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.11(토) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:30 ~ 20:30 ==> 맑음 

- 통합 수정
- 정수기 수정  
개인정보 수정, 사용부품(USED_PARTS), 사용부품 수량(USED_PARTS_QTY) ,  fresh이관일자(FRESH_REG_DT) 
108개 --> 92개 
-------------------------------------------------------------------------------------------------------------------- 

ALTER TABLE T_DEPEND_ORDER MODIFY ( 
   PROC_DONE_YN    CHAR (1)  DEFAULT 'N' --정수기 설치완료 여부 
 );  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2004.12.13(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:10 ==> 맑음 

- 통합 수정
- 정수기 수정  
0100012003091801303(20040909) 0100012004042800809(20040914) 0100012004110800410(20041108) 
==============================================================================================================

20040901 주문을 받아서 20040915일 배송을 하고 
20040916 설치 했을 경우 
실제로 후레쉬 전산은 20041208에 처리 

배송일자 설치일자 처리일자 fresh이관일자 
20040915 20040916 20040916 20041208 
-------------------------------------------------------------------- 

- 고인표 주소 
달서구 대천동 597-10 한국파워트레인  
ERP지원팀 고인표 *, 053-260-3023 
옥션에서 바베큐 그릴 
==============================================================================================================

안녕하셔요,수고많으십니다~ 12/15일부터 현대카드 계약종료로 
결제안된다는 얘기는 들었는데 근간에 잘 사용하셨던건데  
오늘 현대카드 결제시 계속 카드결제 실패된다는 오류건이 있어서요, 
바쁘시겠지만 혹 내부오류인지 확인 부탁드립니다~ 

** 현대카드: 4028570132428709   안효진 
--------------------------------------------------------------- 

대리님~ 
아이디는 박재성 : pcs200301  -이분아이디로 접속하셨다고 
하셨고 특별히 에러코드는 확인못했고 안심결제 비번까지 다  
입력후 결제하기 누르면 카드 승인 실패되었다는 문구만  
뜬다고 하셨습니다~~ 

카드결제 오류: 원인[배송비] 
==============================================================================================================

* 한정숙Silver-M      sky9626 
국민카드 결재가 안된다고함... 
카드번호 : 국민 / 5409353675343107  
isp + 공인인증 다 등록했다고함.  
오류메세지 : 9999로 확인된다고함.  
확인후 연락드리기리고함. 
==============================================================================================================

- 1. MPI결제 모듈 수정  
- 2. 현대카드 가맹점 계약 만료 
현대카드 가맹점 계약 만료로 인하여 
12/15(수)부터 현대카드는 결제가 되지 않습니다. 
==============================================================================================================

- CJ배송(DB 2 DB) 송장번호 Draw 
출하지시: 초당 4개 
세션 여러번 맺고 있음  
2번 다운(Oracle 접속 IP 추적) --> IIISHOP에서 다수의 접속 
김희동(02-316-0354) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 08:00 ==> 맑음 

- 통합 수정
 - 오라클 백업, 복구(PKG_WELL_WATER_UP 에러--> ORDER_STS, SHIP_STS) 
- time-base recovery(DB를 내리고 백업받는 것은 콜드 백업이다.) 
1. 현재 운용중인 DB를 멈춘다. 
shutdown immediate 
2. 만약을 대비해 지금 운용중인 DB 데이터를 콜드 백업 받는다. 
3. 예전 백업받았던 데이터파일을 복구시킨다. 
4. DB를 마운트 
startup mount 
5. 복구전 데이터파일 online 상태 확인 
select * from v$datafile; 
만약 offline 인 데이터파일이 있으면 online 시킨다. 
6. 특정 시간때 까지 복구 수행 
recover database until time  '2004-12-14:03:50:00'; 
7. DB를 resetlog 옵션을 사용하여 오픈 
alter database open resetlogs; 
8. DB 가 정상적으로 복구되었는지 check 
==============================================================================================================

오라클은 두 개의 모드로 움직일수 있다 
아카이브 모드를 운용하는 경우는 지금의 경우와 같이 특정 타임까지  
데이터를 복구할 수 있기에 아카이브 모드로 운용을 하지 
아카이브 모드로 운용되더라도. 데이터 파일은 백업을 반드시 받아야 하고 
그 데이터파일을 백업 받아놓은 시점부터 변경된 DB정보를 아카이브로그 파일로 보완하는 경우다. 
DB를 복구하려면 전체 백업받은 데이터 파일이 있어야 하고 그 시점 이후의 아카이블 로그 파일도 다 있어야 한다. 
만약 아카이브로그파일 중간에 빠지면 그 이후로는 복구가 안된다. 
---------------------------------------------------------------------------------------------------------------------- 

데이터파일을 백업받는 방법으로 네가 온라인 백업이라 얘기했던 핫백업과 DB를 완전히 내리고 받는 콜드백업이 있다. 
1. 핫백업의 경우 
DB를 운용중에 받아야 하므로 db파일을 그래도 copy 하는 방법은 안되고 
파일을 copy하기 전에 db에 현재 백업받으려는 파일이 뭐다라는 식으로 인식시켜주고 백업받고  
다시 끝나면 다시 db에 작업이 끝낫음을 알려주어야 한다. 

2. 핫백업의 아닌 경우 
너의 경우는 특정시점으로 복구하기 위한 절차상이므로 핫백업 시간만 만이 걸리지 의미가 없을듯하다. 
그냥 백업시 DB를 내리고 전체 데이터 파일을 copy하고 복구 해라. 
---------------------------------------------------------------------------------------------------------------------- 

내가 말하는 것은 복구를 위해서는 그전 백업받아놓은 데이터파일이 있어야 한다는 뜻이다. 
데이터파일에는 특정 시점의 시퀀스 정보가 있으므로. 
==============================================================================================================

- FLASHBACK QUERY 
-- 주문정보 저장 
-- INSERT INTO  TEMP_ORDER1 -- TEMP_ORDER1, TEMP_ORDER_DTL1 
( 
SELECT MERCHANT_CD, ORDER_DT, ORDER_NO, ORDER_ST 
FROM T_ORDER AS OF TIMESTAMP 
TO_TIMESTAMP('2004-12-14 03:50:27.9345367','yyyy-mm-dd hh24:mi:ssxff') 
WHERE ORDER_DT >= '20041213' 
--AND ORDER_NO >= '00100' 
); 
-------------------------------------------------------------------------------------------------------------------

-- 주문정보 상세 저장 
-- INSERT INTO  TEMP_ORDER_DTL1 -- TEMP_ORDER1, TEMP_ORDER_DTL1 
( 
SELECT MERCHANT_CD, ORDER_DT, ORDER_NO, SEQ, SHIP_STS 
FROM T_ORDER_DTL AS OF TIMESTAMP 
TO_TIMESTAMP('2004-12-14 03:50:27.9345367','yyyy-mm-dd hh24:mi:ssxff') 
WHERE ORDER_DT >= '20041213' 
--AND ORDER_NO >= '00100' 
); 
==============================================================================================================

-- 주문 정보 조회 @@@@@@@@@@@ 
SELECT * 
FROM TEMP_ORDER1 
; 
---------------------------------------------------------------------------------------------------------------------- 

-- 주문 정보  상세 조회 @@@@@@@@@@@ 
SELECT * 
FROM TEMP_ORDER_DTL1 
==============================================================================================================

* 강승철   ksc24      ( 전 - 최광순Gold-M   cj2402 ) 
신용카드결재가 안된다고함...BC카드 사용  
카드번호 : 9410032037296637     금액 : 1,100,000원 
--------------------------------------------------------------------------------------------------------------------- 

오류메세지 :  자택번호가 미등록. 결제 불가. 
확인후 연락드리기로함. * / 최광순Gold-M 

카드번호 : 9410032037296637 
bccard 는 정상적으로 되고 있고요. 로그는 저장 안 되어 있습니다. 
오류메세지 :  자택번호가 미등록. 결제 불가. 
이런 오류 메세지는 저희 쇼핑몰에서는 안 나는 에러 입니다. 
아마 공인인증서 충돌이 나지 않나 추측 됩니다. 
다른 컴퓨터에서 해보세요...... 
==============================================================================================================
긴급 서버 점검으로 일부 주문내역 확인이 어렵습니다. 
빠른시간내 복구하겠습니다. 
==============================================================================================================

- 세그멘트가 부족해서 나는 에러 
ORA-01555: snapshot too old: rollback segment number 10 with name "_SYSSMU10$" too small 
위치 :0 Line , 0 Column 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.15(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:30 ==> 맑음 

- 통합 수정
파일 불러와서 수정(SQL PLUS에서) 
> start "C:\sql_order\T_order_1.TXT"; 
> start "C:\sql_order\T_order_2.TXT"; 
---------------------------------------------------------------------------------------

T_order_1.TXT 파일 내용 ==================> 
-- update IIISHOP.T_ORDER set ORDER_STS = '03' where ORDER_STS IS NULL and ROWID = 'AAAGqlAAIAAAJuPAAD'; 

> start "C:\sql_order\T_order_dtl_3.TXT";   -- 이효원 
> start "C:\sql_order\T_order_dtl_4.TXT";   -- 이주임 
> start "C:\sql_order\T_order_dtl_5.TXT";   -- 최현수 
> start "C:\sql_order\T_order_dtl_6.TXT";   -- 이과장님 
> start "C:\sql_order\T_order_dtl_7.TXT";   -- 김과장님  
> start "C:\sql_order\T_ORDER_DTL\T_order_dtl_8.TXT";   -- 진태만 
> start "C:\sql_order\T_ORDER_DTL\T_order_dtl_2.TXT";   -- 진태만 
--------------------------------------------------------------------------------------- 

T_order_dtl_2.TXT 파일 내용 ==================> 
-- update IIISHOP.T_ORDER_DTL set SHIP_STS = '03' where SHIP_STS IS NULL and ROWID = 'AAAGqjAAJAAAQJUAAH'; 
---------------------------------------------------------------------------------------------------------------------

-- 주문 조회 
SELECT ORDER_STS  FROM T_ORDER WHERE ROWID = 'AAAGqlAAHAAAQyOAAO';  

-- 주문상세 조회 
SELECT SHIP_STS  FROM T_ORDER_DTL WHERE ROWID = 'AAAGqjAAMAAAME3AAR'; 

-- 주문상세 조회 
SELECT ORDER_DT, ORDER_NO, ITEM_CD FROM T_ORDER_DTL  
WHERE SHIP_STS IS NULL 
ORDER BY ORDER_DT DESC; 

-- 주문상세 조회 
SELECT COUNT(*) FROM T_ORDER_DTL WHERE SHIP_STS IS NULL; 
==============================================================================================================

* 김선희Active-Master        kshmall *@*.* 
20041201, 김선희, 0100012004120100308, 20041201  // 마트+L&B 
위 제품주문, 영수증이 출력이 안된다고함. 
-보안경고 창이 떴을때 아니오 하게되면  프로그램이 다운 안되어 안뜰수있다고하니 그런부분없이 그냥 엑스표만 뜬다심!  
본사홈- 자료실 - 고객컴 환경에 맞는  JVM 다운받아을려고 하니 
다운 받을필요없다라는 메세지가 나온다고함.. 
확인후 연락드리기로함.    * 
==============================================================================================================

- 정수기 수정
주문정보 : 산소수기 주문, 반품, 필터교환권 
민원정보 : a/s, 이전설치, 신품교체 
---------------------------------------------------------------------------------------

-- 필수업데이터 항목 
배송상태: 배송일자 
설치상태: 설치일자  
A/S :  처리내용  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.16(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:20 ~ 23:00 ==> 맑음 

- 정수기 수정필수업데이터 항목(배송만 한건) : 배송일자만 입력, 설치일자, 처리일자는 입력되면 안됨 
필수업데이터 항목(배송&설치) : 배송일자,설치일자,처리일자 
필수업데이터 항목(이전설치,반품회수,필터교환권) : 처리일자 
필수업데이터 항목(a/3) : 처리일자,처리내용 
------------------------------------------------ 

중복 업데이터 불가 : 한개의 접수번호에 대해서는 한번만 업데이터 가능 
==============================================================================================================

- 주문번호 조회(이관은 되었으나 우리 DB에 없는 주문번호) 
-- 주문정보 조회  ==========> @@@@@@@@@ 
SELECT   I3SHOP_ORDER_NO, ORDER_NO, ORDER_DT, CALL_NO, PROC_DT, MOD_DT, MOD_ID, 
                ORDER_TYPE, ORDER_STS, INSTALL_STS, DELIVER_STS, I3SHOP_ITEM_NM, 
                CASH_DT, REG_DT, ENTR_NO, ORDER_NM, USED_PARTS, USED_PARTS_QTY, 
                REG_DT AS Expr1, REG_ID, REG_IP 
FROM T_ORDER 
WHERE  (ORDER_NO IN ('14101')) 
------------------------------------------------ 

-- 주문정보 수정  ==========> @@@@@@@@@ 
-- UPDATE  T_ORDER 
SET ORDER_STS = '04', --발주상태(04:설치완료) 
PROC_DT = '20040916', --처리일자 
FRESH_REG_DT = '20041215', --fresh이관일자 
MOD_DT= '20041215' --수정일자 
WHERE (ORDER_NO = '14101') 

======>  주문번호 변경 불 가능( 주문번호 14101를 생성해서 11997 내용을 덮어씀) 
==============================================================================================================
- 주문번호 삭제 
14049, 14061, 14073   --- 이관된 자료 

SELECT * 
FROM T_ORDER 
WHERE ORDER_NO IN ('14049', '14061', '14073')   -- 주문번호 
------------------------------------------------ 

-- DELETE T_ORDER 
WHERE ORDER_NO IN ('14049', '14061', '14073')   -- 주문번호 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 ==> 맑음 

- 정수기 수정
필수업데이터 항목(이전설치(03),반품회수(04),필터교환권) : 처리일자 
필수업데이터 항목(배송만 한건) : 배송일자만 입력, 설치일자, 처리일자는 입력되면 안됨 
필수업데이터 항목(배송&설치) : 배송일자,설치일자,처리일자 
필수업데이터 항목(이전설치(03),반품회수(04),필터교환권,신품교체(06)) : 처리일자 
필수업데이터 항목(a/s) : 처리일자,처리내용  
==============================================================================================================

- 박태은   gogohi01   비밀번호 : 360345  
운영자 소개글을 수정할려하면.. 계속 페이지 오류라고 확인된다고하시구요...  
이상이 없는데도 그렇다면 운영자 소개글을 완전 전체 삭제해서 다시 작성하실수있도록 좀 해주세요~ 
==============================================================================================================

- A/S를 신품교체로 변경 
0100012003110700992 10646 
0100012004081400308 10666 
0100012003120900288 11734 
0100012003101900259 11740 
0100012004080500349 11748 -------  
0100012004030100335 11753 
0100012004083111457 11756 
0100012004083111201 11759 
0100012003110800222 11784 
0100012003112000816 11795 ------------- 
0100012003120900487 11798 
0100012003100701452 11804 
0100012004083111196 11806 
0100012003101002153 11808 
0100012003101001981 11809 -------  
0100012003111000921 11810 
0100012003100901137 11812 
0100012003100800701 11909 
0100012004090300618 11922 
0100012003120100724 11927 ------------- 
0100012003100800284 11959 
0100012003100200386 11980 
0100012003091400489 11984 
0100012004083111083 12013 
0100012004032600675 12023 -------  
----------------------------------------------------------------------------------------------- 

-- 주문정보 조회  ==========> @@@@@@@@@ 
SELECT   I3SHOP_ORDER_NO, ORDER_NO,   
                ORDER_TYPE, ORDER_STS, INSTALL_STS, DELIVER_STS, I3SHOP_ITEM_NM,  
                CASH_DT, REG_DT, ENTR_NO, ORDER_NM, USED_PARTS, USED_PARTS_QTY,  
                REG_DT AS Expr1, REG_ID, REG_IP 
FROM T_ORDER 
WHERE ORDER_NO = '8726' 
--WHERE  (ORDER_NO IN ('11959', '11980', '11984', '12013', '12023')) 
--WHERE  (ORDER_NO IN ('11810', '11812', '11909', '11922', '11927')) 
--WHERE  (ORDER_NO IN ('11798', '11804', '11806', '11808', '11809')) 
--WHERE  (ORDER_NO IN ('11753', '11756', '11759', '11784', '11795')) 
--WHERE  (ORDER_NO IN ('10666', '11734', '11740', '11740', '11748')) 
; 
----------------------------------------------------------------------------------------------- 

-- 주문정보 수정  ==========> @@@@@@@@@ 
-- UPDATE  T_ORDER 
SET ORDER_TYPE = '06' -- 주문구분(02: A/S, 06:신품교체) 
WHERE  (ORDER_NO IN ('11959', '11980', '11984', '12013', '12023')) 
; 
==============================================================================================================
  
2004-11-29(전체)11월전.xls 
2004-11-30(전체)11월전.xls 
2004-12-01(전체)11월전.xls 
==============================================================================================================

--- 1. 이관 데이타 조회(후래쉬에서 넘어온 데이타 확인)  
SELECT B.I3SHOP_ORDER_NO, B.ORDER_NO, B.ORDER_DT, 
B.PROC_DT, B.MOD_DT, B.MOD_ID,     --처리일자, 수정일자, 수정ID,  정수기 설치완료 여부 
B.ORDER_TYPE,                -- 주문구분(01:주문, 02: A/S, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
B.ORDER_STS,                --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
B.INSTALL_STS, DELIVER_STS,  --설치, 배송상태01:접수대기, 02:접수, 03:처리보류, 04:처리완료) 
B.I3SHOP_ITEM_NM, B.CASH_DT, B.REG_DT, --I3SHOP상품명 , 입금일자 
B.ENTR_NO, B.ORDER_NM, 
B.USED_PARTS, B.USED_PARTS_QTY, --사용부품, 사용부품 수량 
B.PROC_COMMENT --처리내용 
-- SELECT   COUNT(*) AS Expr1 
FROM T_ORDER B 
WHERE B.FRESH_REG_DT = '20041217' --fresh이관일자 
AND B.MOD_DT= '20041217' 
AND B.ORDER_NO = '8726' -- 
AND B.MOD_ID = 'ifreshwater'   
AND B.ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.18(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 20:30 ==> 맑음 

- 정수기 수정- 해피콜 수정 
----------------------------------------------------------------------------------------------- 

11920 A/S 00682 000682 
13232 A/S 1111 001111 
13269 A/S 13269 
13222 A/S 3444 003444 
13283 신품교체 3444 003444 
제품일련번호 수정바랍니다. 
1건은 공란으로 처리바랍니다.  
----------------------------------------------------------------------------------------------- 

- 그리드 Clear 
 fpSpread1.MaxRows = 0 
==============================================================================================================

- 쇼핑몰 수정
- VISA 안심결제 인증방식 변경 
 데이콤에서 TGCORP로 인증업체를 변경 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.19(일) 작업 ■■■■■■■■■■■■■■■■
---> 14:30 ~ 23:00 ==> 맑음 

- 정수기 수정- 해피콜 수정 
실 데이타 테스트  
----------------------------------------------------------------------------------------------- 

- 배송만 한 건 
20041214일 후래쉬 워터에서 업로드 --> 
20041215일 해피콜 처리 
20041224일 후래쉬 워터에서 설치를 하고 다시 업로드 --> 
20041225일 해피콜 처리 

20041215일 업로드 데이타 0건 처리 
20041225일 업로드 데이타 1건 처리 
==============================================================================================================

- TNS 오류 
EXP-00056: ORACLE 오류 12560가 발생했습니다 
ORA-12560: TNS:프로토콜 어댑터 오류 
EXP-00000: 엑스포트가 실패로 끝났습니다 

일단 서버쪽에 protocol.ora 가 적용이 되어있는지 보시구요 
그게 없다면 client 에 tnsnames.ora file 에 서버쪽 tns 가 제대로 기입이 되어있는지 확인을 해야 할것 같군요 
이단 client 에서 서버쪽으로 tnsping 을 한번 날려보세요 

방법 
시작 -> 실행 -> cmd (dos 창) 
> tnsping IIISHOP 
> tnsping TAMAORA 
에서 tnsping [tns명] 을해보시고 ok 가 떨어지면 정상인데 
만약 ok 가 아니면 client 에 tns 설정이 잘못 되어있는겁니다. 
다시한번 확인을 해보시구요..... 
일단 위에 정도만 확인을 하시면 될꺼같구요 
물론 리스너는 떠있겠죠? 
==============================================================================================================

- 글올려주셨을때 위에 부분을 적어주셨죠? 
그게 리스너 FILE 이거든요 
현재 위에 리스너 FILE (LISTENER.ORA FILE)에 보면 리스너를 기본이름으로 가져가신거 같은데 
그럼 DOS 창에서 LSNRCTL STATUS 를 실행해보세요 !! 
> LSNRCTL STATU 
외부 client 에서 서버로 접속을 할때 리스너를 무조건 타고들어갑니다. 
lsnrctl status 를 실행하면 현재의 리스너 상태를 보여줍니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 01:30 ==> 맑음 

- 통합 수정
- 공인인증서 테스트 
.jar 파일 등록 에러( import="signgate.pkix.opp.*" ) 
signgate.jar 파일과 ldapjdk.jar 파일을   
 C:\CCDOM\CcdomLib 와 C:\CCDOM\CcdomLib 이 2곳에 붙여 넣기 하고 등록해야 함 
---------------------------------------------------------------------------------------------------------------- 

ID: test01 성명: 아이쓰리샵 
주민번호: 731119 00000 
-----------------------------------------------------------------------------------------
ID: ja7373 성명: 유정아 
주민번호: 730730 - 0  7307302 0 
==============================================================================================================

%%  한기옥   prihan  무료회원  
20041220, 한기옥, 0100012004122000374, 20041220 
- L&B매장 - 쿠쿠 초음파식 가습기 - LH-7312 - 42000 - 1 
위건 영수증 출력하려는데 안된다고하심 -> 재부팅해도 보안창 안뜨고~  
윈도우 6.0버전이라셨음!본사홈페이지 안내하고 JVM다운로드 했는데도 안된다고하심 
확인후 연락처 : 02-3011-3926    

--> 주문번호(0100012004122000374): 쿠쿠 초음파식 가습기 영수증 출력해서 배송 바랍니다.(급한 건) 
http://www.gamestand.co.kr/pds/msjavx86_3.exe  
설치하시고 Microsoft Windows Update 사이트에 가시면 최신버젼으로 업데이트됩니다 
==============================================================================================================

- 재고 편차 조회(/BizMgr/ItemStockMgr/stockInquiryStatDeclinP.jsp) 
업무 플로우 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.21(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
- 비즈메카 수정
- 비즈메카 
/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=11 -->  
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=51 
- 킬러앱 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
==============================================================================================================
  
-- 쇼핑몰 공지사항 조회 @@@@@@@@@@@@@ 
SELECT NOTICE_NO,TITLE,READ_CNT,DOWNLOAD_CNT,ATTACHFILE, 
     STORE_CD,STORE_NM,CATEGORY_CD,CATEGORY_NM,REG_ID, 
     TO_CHAR(REG_DT,'yyyymmdd') REG_DT1 
FROM T_MALLNOTICE 
WHERE DISPLAY_STS = '01' 
  AND NOTICE_STDT <= TO_CHAR(SYSDATE,'yyyymmdd') 
  AND (NOTICE_EDDT >= TO_CHAR(SYSDATE,'yyyymmdd') 
    OR NOTICE_EDDT IS NULL) 
  AND STORE_CD = 'S001'   --매장코드 
  AND NOTICE_YN = 'N'     --공지사항여부(N:사용중, Y:종료) 
  AND CATEGORY_CD IN('T07000000') 
ORDER BY NOTICE_NO DESC 
; 
---------------------------------------------------------------------------------------------------------- 

-- 쇼핑몰 공지사항 수정 @@@@@@@@@@@@@ 
-- UPDATE T_MALLNOTICE 
SET NOTICE_YN = 'Y'     --공지사항여부(N:사용중, Y:종료) 
WHERE DISPLAY_STS = '01' 
  AND NOTICE_STDT <= TO_CHAR(SYSDATE,'yyyymmdd') 
  AND (NOTICE_EDDT >= TO_CHAR(SYSDATE,'yyyymmdd') 
    OR NOTICE_EDDT IS NULL) 
  AND STORE_CD = 'S001'   --매장코드 
  AND NOTICE_YN = 'N'     --공지사항여부(N:사용중, Y:종료) 
  AND CATEGORY_CD IN('T07000000') 
; 
==============================================================================================================

- 통합 수정
- 주문집계표조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderTotalList.jsp) 
아까 조회된 반품주문 20041124 00298 
DEPART는 940 이였고요.....  
노과장님이 조회를 원한 DEPART는 211 이였어요. 
그래서 DEPART는 940 는 조회가 안 되는게 맞어요. 
==============================================================================================================

- 환불금 확정(BizMgr/SaleMgr/WebOrderMgr/repayDeductP.jsp) 
- 현금인 경우 
p_ar_way_cd = 10 현금결제, p_ar_sts = 15 현금환불예정 
- 카드인 경우 
p_ar_way_cd = 20 카드결제, p_ar_sts = 20 카드취소예정 
---------------------------------------------------------------------------------------------------------- 

- 현금에서 카드로 변경요 
주문번호 0100012004122000559 김미현 46,550 010001 2004122 000559 
0100012004122000351 송권섭 75,800 010001 2004122 000351 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 01:30 ==> 맑음 

- 재고조사 준비
 - 자인방문(08:00 ~ 21:00) 
 - 프로그램 파일 정리 
 - 크래들 연결 에러(포맷 후 다시 프로그램 설치) 
---------------------------------------------------------------------------------------------------------- 

- 소켓통신 에러(자인물류) 
mdb 파일을 받는 도중 이상한 IP 가 들어 오면서 다운이 누려짐 
이후, 소켓통신 불능(바이러스 침투로 판단됨) 
--> 서버를 본사에 두는 방안 검토(AP는 자인에 설치)  
---------------------------------------------------------------------------------------------------------- 

- 소켓통신 
- 보내는 데이타(서버에서 132byte 제한, 조합을 함)와 받는 테이타의 길이가 일정하지 않음 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.12.23(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 06:50 ~ 01:30 ==> 맑음 

- 재고조사 준비
- 자인방문(13:00 ~ 19:00)  
1. 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp)
---------------------------------------------------------------------------------------------------------- 
2. 재고 실사서 작성 수정(mdb에서 oracle T_STOCK_INQUIRY_LOCATION, T_STOCK_INQUIRY_TEMP 테이블 저장) 
 실사재고 조사한 PDA DB를 오라클 DB에 이관 하여 필요한 2개의 테이블에 저장 
==============================================================================================================

- 데이타 갯수 확인(Access 에서) 
SELECT COUNT(*) AS 합계 
FROM T_GEGO_LOCATION 
WHERE LOCATION_CD = '101A'  
 ; 
==============================================================================================================

SELECT LOCATION FROM T_GEGO_LOCATION GROUP BY LOCATION 
SELECT LOCATION, ITEM_CD, BARCODE FROM T_GEGO_LOCATION ORDER BY SEQ_NO DESC 
==============================================================================================================

- 공인인증서 이상 
01000120041130552   
01000120041130553 
01000120041130554 
유종혜 
3건입니다. 
==============================================================================================================

- 쇼핑몰 수정
- 비즈메카 수정  
- 비즈메카 
/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=11 -->  
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=51 
- 킬러앱 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.24(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 흐림 

- 재고조사 준비
재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
- 위치별 재고실사 바코드 삭제 
------------------------------------------------------------------------------------------------------------- 

-- 점별 상품 정보 조회(실제 회사 재고) 
2004년 12월 24일(토) 
4427   -> 4443 건 
T_GEGO_ITEM_DTL 
==============================================================================================================

- 통합 수정
 - 제한수량 상품 등록(/BizMgr/ItemMgr/LimitCount/buyLimitItemP.jsp) 
ITEM_TP: 상품타입(01:제한상품, 02:킬인킬상품, 03:킬러앱 공지상품) 
---------------------------------------------------------------------------------------------------------- 
  
- 킬러앱 상품공지 등록(/BizMgr/ItemMgr/LimitCount/KillerAppNoticeP.jsp) 
BIZ_KillerAppNoticeP 
---------------------------------------------------------------------------------------------------------- 

- 킬인킬 등록(/BizMgr/ItemMgr/LimitCount/KillinKillP.jsp) 
BIZ_KillinKillP  
---------------------------------------------------------------------------------------------------------- 

ALTER TABLE T_BUYTIMES ADD ( 
	USE_YN    CHAR (1) --사용여부 
); 
---------------------------------------------------------------------------------------------------------- 

String p_times_cd = (request.getParameter("p_times_cd") == null) ? "": request.getParameter("p_times_cd"); 
==============================================================================================================

- DB 칼럼과 일치하지 않은 필드명 존재 
 Exception에러 발생 : java.lang.IndexOutOfBoundsException:  
sColumn index[-1] is out of the range of the count[20] of GauceDataColumn! 
---------------------------------------------------------------------------------------------------------- 

/popTimesRegP.jsp 에서 아래와 같이 보냈으므로 popTimesRegB.jsp 에서 조회한 ds_list 조회 
DB 필드가 /popTimesRegS.jsp 에서 DB 필드와 맞는 지 대조 
---------------------------------------------------------------------------------------------------------- 

<!-- +@TR TR 정의 구간--> 
<object id="tr_ds_list" classid="<%= CLASSID_TOINB_TR %>" codebase="<%= CD_TOINB_TR %>"> 
	<PARAM NAME="ServerIP"   VALUE=""> 
	<PARAM NAME="KeyValue"   VALUE="savebuyLimitItemMS=ds_list"> 
	<PARAM NAME="KeyName"   VALUE="Toinb_dataid"> 
	<PARAM NAME="Action"     VALUE="./popTimesRegS.jsp"> 
	<PARAM name="Protocol"   value="1"> 
</object> 
==============================================================================================================

- 쇼핑몰 이미지 수정(이미지 크기 수정) 
display/prdlist/tpl/type01/itemListP.jsp 에서 
<Img Src="/img/items/midimage/<%=strItemImage%>" Border=0 width="100" height="100"> 
/display/prdlist/prdlist.jsp?p_store_cd=S001&p_category_cd=T11050403&p_display_cd=01 
-------------------------------------------------------------------------------------------------------------- 

- /display/com/itemImagesP.jsp 에서 
<Img name="bigImg" Src="/img/items/bigimage/<%=imgName%>" Border=0 width="200" height="200"></a> 
/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T11050403&p_item_cd=00146460&p_display_cd=01 
==============================================================================================================

- 정수기 수정0100012004121300179(필터교환권)  --> 20041213, 0100012003110800709(배송발주)  --> 20041201 
이미 이관된 건 입니다. 
한번 이관된 건은 다시 당길 수 없어요. 

이 두건요~~ 
하얀색으로 후레쉬에 이관된걸로 나오는데,  
후레쉬에서는 아무리 해도 당겨지지 않는다고 하시네요~~ 
어떻게 된건지 확인부탁드릴게요~~^^* 
---------------------------------------------------------------------------------------------------------- 

-- 이관될 데이타 조회(후래쉬로 넘길 데이타 조건 확인) @@@@@@@@@@@@@      
SELECT I3SHOP_ORDER_NO, ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM, 
ORDER_TYPE,                -- 주문구분(01:주문, 02:A/S, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
ORDER_STS,                --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
INSTALL_STS, DELIVER_STS,  --설치, 배송상태(01:처리보류 02:설치완료, 03:미설치, 04:설치) 
I3SHOP_ITEM_NM, CASH_DT, REG_DT 
FROM T_ORDER 
WHERE RETURN_DT IS NULL  
AND I3SHOP_ORDER_NO IN( '0100012004121300179',  '0100012003110800709') 
ORDER BY ORDER_TYPE, ORDER_STS DESC 
; 
---------------------------------------------------------------------------------------------------------- 

-- 이관 설치 완료 데이타 수정 @@@@@@  =========> 이관될 데이타로 수정 ==========> 
-- UPDATE T_ORDER 
SET   CASH_DT = '20041223', --입금일자(이관 수행 하루 전 날짜) 
	ENTR_NO = 1, --거래처 코드(1:후레쉬 워터) 
	ORDER_STS = '01', -- 주문상태(01:주문접수) 
	INSTALL_STS = '01', --설치상태(01:처리보류) 
	DELIVER_STS = '01' --배송상태(01:처리보류) 
WHERE RETURN_DT IS NULL 
	AND I3SHOP_ORDER_NO IN( '0100012004121300179',  '0100012003110800709') 
; 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2004.12.25(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 20:30 ==> 맑음 

- 통합 수정
- 킬인킬 등록(/BizMgr/ItemMgr/LimitCount/KillinKillP.jsp) 
ITEM_TP: 상품타입(01:제한상품, 02:킬인킬상품, 03:킬러앱 공지상품) 
---------------------------------------------------------------------------------------------------------- 

- 킬러앱 상품공지 등록(/BizMgr/ItemMgr/LimitCount/KillerAppNoticeP.jsp)   
==============================================================================================================

- PRIMARY KEY 추가 
일단 새로이 추가하려는 key값에 null이 없다면 
1먼저 기존 pk를 drop 시키고 새로운 PRIMARY KEY 를 만들면 된다.  
  
1. ALTER table T_BUYTIMES DROP PRIMARY KEY; 
2. ALTER table T_BUYTIMES ADD constraint PK_BUYLIMITCOUNT PRIMARY KEY(TIMES_CD,  ITEM_TP); 
---------------------------------------------------------------------------------------------------------- 
1. ALTER table T_BUYLIMITCOUNT DROP PRIMARY KEY; 
2. ALTER table T_BUYLIMITCOUNT ADD constraint PK_BUYLIMITCOUNT PRIMARY KEY(ITEM_CD, TIMES_CD, ITEM_TP); 
==============================================================================================================

- 쇼핑몰 수정
- 구매제한 수량, 킬인킬 설정 
1. 상품상세 보기(/display/com/itemDetaiInfoP.jsp) 
구매제한 정보 조회 --> 구매제한 수량 ▶ 5개 표현 
<!-- // 구매제한 정보 조회(구매제한 수량 조회) //--> 
<%@ include file="/common/KillerApp/KillerApp_jaehan.jsp" %>  
---------------------------------------------------------------------------------------------------------------------

2. 장바구니 담기(/cart/cartPut.jsp) 
구매제한 정보 체크(장바구니(getCartItems()) 포함) 
<!-- // 구매제한 정보 조회(구매 가능 여부 체크조회) //--> 
<%@ include file="/common/KillerApp/KillerApp_jaehanB.jsp" %>  
---------------------------------------------------------------------------------------------------------------------

3. 바로구매(/cart/checkRnFSes.jsp) 
구매제한 정보 체크(장바구니(getCartItems()) 포함)   
<!-- // 구매제한 정보 조회(구매 가능 여부 체크조회) //--> 
<%@ include file="/common/KillerApp/KillerApp_jaehanB_RnF.jsp" %>  
---------------------------------------------------------------------------------------------------------------------

4. 주문서작성_(확인)(/order/orderPut_3.jsp)   
구매제한 수량 저장: setSaleQtyArr() 
<% sessHash.put("ITEM_TP",   "01");   //상품타입(01:제한상품)  %>    
<!-- //제한 상품 구매정보 저장  //--> 
<%@ include file="/common/KillerApp/KillerApp_jaehanS.jsp" %>  
<% sessHash.put("ITEM_TP",   "02");   //상품타입( 02:킬인킬상품) %> 
  
<!-- //킬인킬상품 구매정보 저장  //--> 
<%@ include file="/common/KillerApp/KillerApp_jaehanS.jsp" %> 
==============================================================================================================

- [연말 정산] 
 - 2004년 연말정산 자료 출력 
1. 청약저축(055207-04-003873)): 납입금액(240,000) 
2. 장기주택마련저축(470348-01-002266)): 납입금액(110,000) 
 http://ibn.kbstar.com/quics?page=A005268&dummy=1103932359520 
---------------------------------------------------------------------------------------------------------- 
3. 보험(뉴밀레상해보험): 증권번호(7249300): 납입금액(475,200) 
http://www.insurance.co.kr/  
사업자등록번호: 504-81-32871 
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2004.12.26(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 02:30 ==> 맑음  

- 쇼핑몰 수정
킬러앱 메인(/display/prdlist/tpl/type51/itemListP.jsp) 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
==============================================================================================================

ITEM_WEB_NM   ---> T_ITEM_WEB 
ITEM_CATEGORY_CD  ---> T_MD_CATEGORY_ITEM 
---------------------------------------------------------------------------------------------------------- 

- 누드세일(/display/main/S001/mdNewListP.jsp), 초특가 매장(/display/main/S001/coDiscountP.jsp) 
---------------------------------------------------------------------------------------------------------- 

--킬러앱 상품공지 조회 
SELECT A.ITEM_CD, A.CATEGORY_CD, B.MODEL_WEB_NM, B.ITEM_WEB_NM, A,RESELLER_AMT, A.MEIP_AMT 
FROM T_BUYLIMITCOUNT A, T_ITEM_WEB B 
WHERE A.ITEM_CD = B.ITEM_CD 
	AND A.TIMES_CD ='000001'  --회차 
	AND A.ITEM_TP ='02'     --상품타입(01:제한상품, 02:킬인킬상품, 03:킬러앱 공지상품) 
ORDER BY  A.REG_DT DESC 
; 
==============================================================================================================

- 판매보조용품(R&F 매장)--> 리스트 보기 
/display/sml/smlctg.jsp?p_store_cd=S013&p_category_cd=T03010500&p_display_cd=11 
--> /display/prdlist/tpl/type11/itemsListByListP.jsp 
---------------------------------------------------------------------------------------------------------- 

-  다음 회차 상품공지(킬러앱)--> 리스트 보기  
/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51&next_gogi=01 
--> /display/prdlist/tpl/type51/itemsListByListP.jsp 
==============================================================================================================

- 노블레스 매장(메인) 
/display/big/bigctg.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=11      U01000000 
--> /display/prdlist/tpl/type51/itemsListByListP.jsp 
==============================================================================================================

- 오라클 에러(ORA-00257)  
로그(archive) 파일 용량이 100%여서 /user2폴더의  
로그(archive) 파일을 지운 후 다시 재부팅 
--> 2004년 12월 26일 3시 이후 크론잡 작동 안 함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.27(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 03:30 ==> 맑음 

- 쇼핑몰 수정
- 노블레스 매장(메인) 
/display/big/bigctg.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=11  
--> /display/prdlist/tpl/type51/itemsListByListP.jsp 
---------------------------------------------------------------------------------------------------------- 

- B2B공지사항 
http://211.233.5.104:8080/list_short.asp 
==============================================================================================================

- 킬러앱 매장 상품 등록(생필품, 공산품) 
일반매장, 킬러앱 매장 2곳 동시에 상품 등록을 하려는데 
가격이 일반매장, 킬러앱 매장 가격이 구분 안 됨  
---------------------------------------------------------------------------------------------------------- 

- 점별 상품 정보( T_MERCHANT_ITEM) 
SALE_PRICE 일반판매가 
RESELLER_PRICE 리셀러가 
KILLER_PRICE 킬러앱가 =====> 추가 요망 =====> 보류 
==============================================================================================================

- 킬러앱매장 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
---> /display/prdlist/tpl/type51/itemListP.jsp 

- 공산품 
 /display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51 
---> /display/prdlist/tpl/type51/itemListP.jsp 

/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51 
/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51&next_gogi=01 

- 생필품 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010102&p_display_cd=51 
---> /display/prdlist/tpl/type51/itemListP.jsp 
==============================================================================================================

- 킬러앱 다음 상품공지 
/display/sml/smlctg.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51&next_gogi=01 
---> /display/prdlist/tpl/type51/itemListP.jsp 
==============================================================================================================

- 생필품은 회차당 3만원 이상 구매 해야 배송비 없음(장바구니) 
p_ship_cl_cd : 배송구분코드  
OrderSvcBean.java 에서 @@@@@@@  
getShipFeePolicy() : 고객이 선택한 상품들을 기준으로 배송비 정책을 모두 읽어서 반환(DB) 

checkLimitPriceByEntr(): 책에 따라 배송비가 책정될 수 있다. [거래처별] 
//주문거부 정책이 아니고, 가격제한가 이하의 주문인경우 배송비를 누적한다. 
if(sum_real_sale_price > 0 && sum_real_sale_price < entr_limit){ 
sum_entr_ship_fee += entr_fee; 
} 
//배송비를 산출 
total_ship_fee = sum_entr_ship_fee; 
==============================================================================================================

- PDA 수정 
SELECT LOCATION, SEQ_NO, ITEM_CD, BARCODE  
FROM T_GEGO_LOCATION   
ORDER BY LOCATION,  SEQ_NO ASC 
------------------------------------------------------------------------------------------------------------- 

SELECT LOCATION, SEQ_NO, ITEM_CD, BARCODE  
FROM T_GEGO_LOCATION   
ORDER BY LOCATION,  SEQ_NO DESC 
-------------------------------------------------------------------------------------------------------------------

- 로케이션 삭제(PDA) 
910-A  --> 510 911-B  --> 511 911-C  --> 511 911-D  --> 511 912-A  --> 512 
912-B  --> 512 912-C  --> 512 912-D  --> 512 
------------------------------------------------------------------------------------------------------------- 

('502-B', '504-B','504-C', '505-C', '507-A', '507-C', '507-D',  '509-B') 삭제 
------------------------------------------------------------------------------------------------------------- 

501-B,  501-C, 510-C  삭제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.28(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:30 ~ 08:30 ==> 맑음(철야) 

- 쇼핑몰 수정
- 노블레스 매장(메인) 
/display/big/bigctg.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=11  
--> /display/prdlist/tpl/type51/itemsListByListP.jsp 
------------------------------------------------------------------------------------------------------------- 

System.out.println("[/KillerAppNoticeP.jsp]:[next_gogi]"+ next_gogi);  
==============================================================================================================

- 킬러앱 매장 오픈 
1. Bean 
CartBean.java 
-------------------------------------------------------------------------------------------------------------------- 

2. JSP 수정 
/display/prdlist/tpl/type51/ (노블레스 매장) 
 ---> itemListP.jsp, itemList.jsp, itemsListByListP.jsp 
/display/prd/tpl/type51/ 
 ---> catalogP.jsp 
/display/sml/ 
 ---> smlctg.jsp 
/display/main/S065/ (노블레스 매장) 
/common/KillerApp/ 
 ---> KillerApp_jaehan.jsp, KillerApp_jaehanB.jsp, KillerApp_jaehanB_RnF.jsp, KillerApp_jaehanS.jsp 
/js/ 
 --->scrollKillerApp1.js, scrollKillerApp2.js, scrollKillerApp3.js, scrollKillerApp4.js 
/main_tpl/KillerApp/ 
 ---> KillerAppNoticeP.jsp, KillerAppNoticefor4P.jsp, KillerAppNoticeB.jsp, KillinKillP.jsp, KillinKillB.jsp  
-------------------------------------------------------------------------------------------------------------------- 

1. 상품상세 보기(/display/com/itemDetaiInfoP.jsp)  
2. 장바구니 담기(/cart/cartPut.jsp) 
3. 바로구매(/order/rnf/checkRnFSes.jsp) 
4. 주문서작성_(확인)(/order/orderPut_3.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.29(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 06:00 ==> 맑음 

- 쇼핑몰 수정
-  킬러앱 매장 오픈  
==============================================================================================================

- 재고 실사 조사 
---> 17:30 ~ 08:30 
- 재고실사를 위한 일마감 및 상품 초기화 작업 에러 
closeStockItemCopy(): ItemStockMgrBean.java 에서 
LOCATION_LIST(로케이션 리스트 필드 저장 안함) 
INSERT INTO T_STOCK_INQUIRY_DTL() 
-------------------------------------------------------------------------------------------------------------------- 

Error 500: RemoteException occurred in server thread; nested exception is: [에러코드] :  
15C [에러메세지] : 데이터 처리를 실패했습니다.  
==============================================================================================================

getStockInquiryDtlList(): ItemStockMgrBean.java 에서 
 (NVL(INQUIRY_QTY, 0) - NVL(CURRENT_QTY,0)) AS DIFFER_QTY   //편차수량 
==============================================================================================================

- 편차원가 0원인 거 존재(T_STOCK_INQUIRY_DTL에서 원래 0원으로 받아옴) 
편차원가(DIFFER_AMT): 편차수량(DIFFER_QTY) * 구매가(BUYING_PRICE) 
==============================================================================================================

- 점 권한 변경(재고 실사 등록자) 
노은주, 윤청경, 권희경, 김윤정, 윤승한 
사용권한 설정--> 점포영업관리(재고 실사 등록자) 
==============================================================================================================

- 재고조사
- 1차 재고조사 등록 후 2차 재고조사 방법 
재고 실사서 작성 (1차 입력 중 --> 1차 입력 완료) 
재고 실사 승인(재고실사 정보 조회 --> 승인거부) 
-------------------------------------------------------------------------------------------------------------------- 

- 재고 실사서 작성(/BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp)  
- 재고 실사서 작성 수정(mdb에서 oracle T_STOCK_INQUIRY_LOCATION, T_STOCK_INQUIRY_TEMP 테이블 저장) 
 실사재고 조사한 PDA DB를 오라클 DB에 이관 하여 필요한 2개의 테이블에 저장 
==============================================================================================================

- 위치별 재고 실사서 입력(/BizMgr/ItemStockMgr/stockInquiryTempS.jsp)  
==============================================================================================================
  
- 바코드 삭제 
000-A, 000-B, 801-T, 802-T 
http://211.33.193.148/login/login.jsp 
-------------------------------------------------------------------------------------------------------------------- 

- 로컬 통합에서는 2차 통합 마감 후 패키지에 저장을 안 해서 에러가 남(실 통합 서버에서 작업 요망) 
쿼리 실행을 실패했습니다. 
SELECT PKG_STOCK_INQUIRY.APPLY_LOCATIONLIST ( '01','9001','20041223','00001','22' ) AS RE_TEXT FROM DUAL 
java.sql.SQLException: ORA-00904: 열명이 부적합합니다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.12.30(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 12:30 ~ 19:00 ==> 맑음 

- 통합 수정
- MD 추천상품 등록(노블레스 매장 메인) 
카테고리관리에서  
매장/대카 선택(노블레스->킬러앱매장->킬러앱매장) 
MD 카테고리 --> 신규 클릭 
MD 선택 상품분류코드( S1: 매장추천상품) --> 클릭상품코드 검색 --> 저장  
-------------------------------------------------------------------------------------------------------------------- 

- 카테고리관리(/BizMgr/ItemWebMgr/categoryP.jsp) 
 MD 카테고리 연결상품 등록시 상품검색 팝업(/popMdCategoryAddItemP.jsp) 
-------------------------------------------------------------------------------------------------------------------- 

- 노블레스 매장(U02010100) 
공산품(U02010101), 생필품(U02010102)   
- I3MART(08010000) 
식품(T08010000), 비식품(T08020000)  
==============================================================================================================

- DB 에러 문제 
쿼리를 실행을 실패했습니다. 
INSERT INTO T_ORDER_DTL(  ) 
java.sql.SQLException: ORA-01653: unable to extend table IIISHOP.T_ORDER_DTL_CLONE by 1024 in tablespace IIISHOPD 
ORA-06512: at "IIISHOP.CLONE_T_ORDER_DTL", line 2 
ORA-04088: error during execution of trigger 'IIISHOP.CLONE_T_ORDER_DTL 
--------------------------------------------------------------------------------------------------------------------

- tablespace 증가(무제한) 
alter table extend unlimited 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.12.31(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 05:00 ==> 맑음 

- 쇼핑몰 수정
쇼핑몰 메인 작업(프레임 나누기) 

<frameset rows="18.5%, *" cols="*" frameborder="NO" border="0" framespacing="0">  
   <frame name="topFrame" src="/main_tpl/top.jsp" scrolling="NO" >  
    <frame name="mainFrame" src="/main_tpl/bodyMainP.jsp" Scrolling="AUTO">  
</frameset>  
--------------------------------------------------------------------------------------------------------------------

 <frameset rows="20%, *, 34%" cols="*" frameborder="NO" border="0" framespacing="0">  
  <frame name="topFrame" src="/main_tpl/top.jsp" scrolling="NO" noresize>  
    <frame name="mainFrame" src="/main_tpl/bodyP.jsp" Scrolling="AUTO">  
</frameset>  
</noframes> 
--------------------------------------------------------------------------------------------------------------------

<frameset rows="18.5%, *" cols="*" frameborder="NO" border="0" framespacing="0">  
   <frame name="topFrame" src="/main_tpl/top.jsp" scrolling="NO" >  
    <frame name="mainFrame" src="/index.jsp" Scrolling="AUTO">        <!-- index.jsp, bodyP, bodyMainP --> 
</frameset>  
==============================================================================================================

- I3마트(/display/mid/tpl/type31/categoryP.jsp): 식품 
--> 인기상품(/display/mid/tpl/type31/mdBestItemListP.jsp) 
--------------------------------------------------------------------------------------------------------------------

<!--베스트상품시작--> 
<jsp:include page="<%=strMDBestItemList%>" flush="true"> 
<jsp:param name="p_md_category_cd" value="02"/> 
</jsp:include> 
<!--베스트상품끝--> 
==============================================================================================================

- 수도 검침 
수용가 번호: 100-1950 
동명: 신천4동 461-4 
담당자 HP)*  Tel)951-0091  953-0091 
-------------------------------------------------------------------------------------------------------------------- 

2004년 12월 2247 
==============================================================================================================

- 입금확인(/BizMgr/SaleMgr/WebOrderMgr/standByReceiptsP.jsp) 에러 
12/30 오복연  
--------------------------------------------------------------------------------------------------------------------

- DB 에러 문제 
쿼리를 실행을 실패했습니다. 
INSERT INTO T_STOREOUT_DTL(  ) 
java.sql.SQLException: ORA-01653: unable to extend table IIISHOP.T_STOREOUT_DTL by 1024 in tablespace IIISHOPD 
ORA-06512: at "IIISHOP.T_STOREOUT_DTL", line 2 
ORA-04088: error during execution of trigger 'IIISHOP.T_STOREOUT_DTL 
--------------------------------------------------------------------------------------------------------------------

- 쿼리 실행을 실패했습니다. 
INSERT  INTO T_STOREOUT_DTL( COMPANY_CD, MERCHANT_CD, STOREOUT_DT, STOREOUT_NO, SEQ_NO, RECV_MERCHANT_CD, 
RECV_DT, RECV_NO, RECV_DTL_SEQ_NO, ITEM_CD, ITEM_NM, ITEM_SHORT_NM, DEPART1_CD, DEPART2_CD, DEPART3_CD, MFG_NM, 
UNIT_CD, MODEL_NM, ITEM_SPEC, EMPTY_ITEM_CL, TAX_YN, TAX_RATE, FEE_ITEM_YN, FEE_RATE, FEE, ENTR_NO, BUYING_PRICE, 
RECV_ORD_PRICE, RECV_ORDER_QTY, RECV_ORDER_AMT, SP_PRICE, QTY, AMT, REAL_STOREOUT_DT, STOREOUT_ITEM_STS, REG_ID, 
REG_IP, REG_DT, UP_ID, UP_DT, UP_IP, SETTLE_YN, SETTLE_DT )  VALUES (?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   
?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   ?,   sysdate,   ?,   sysdate,   ?,  ?, ?  ) 
java.sql.SQLException: ORA-01653: unable to extend table IIISHOP.T_STOREOUT_DTL by 1024 in tablespace IIISHOPD 
==============================================================================================================

- L&B ==> 
- ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵),  
LG직거래: its2023/its2023 
0100012004123101031 0100012004123101052 0100012004123101058 0100012004123101061 0100012004123101098 
0100012004123101099 0100012004123101100 0100012004123101125 0100012004123101187  0100012004123101209 
--------------------------------------------------------------------------------------------------------------------

- 주문 실패 후 카드결제 성공한 건 
0100012004123101637 

- ITS2023(LG직거래) 
0100012004123101052 0100012004123101058 0100012004123101061 0100012004123101093 0100012004123101098 
0100012004123101099 0100012004123101100 0100012004123101111 0100012004123101123 0100012004123101125 
0100012004123101209 0100012004123101219 0100012004123101223 0100012004123101544 0100012004123101561 
0100012004123101589 0100012004123101623  
--------------------------------------------------------------------------------------------------------------------

- NICE(R&F) 
0100012004123101637  
==============================================================================================================

- 삼성카드 주문취소(941091******3800) 
01000120041231N00001  0100012004123101600  0100012004123101664 0100012004123101683 0100012004123101705 
0100012004123101763  0100012004123101995  0100012004123102080  
 제휴 카드인 경우 취소 불가 200412310000088 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================
  
- 현금주문(입금은행 농협 추가) ====> 쇼핑몰 
은행 계좌(arInputS.jsp) 
SELECT * FROM T_ENTR_BANK_ACCOUNT 
WHERE COMPANY_CD= '01' 
AND WEB_USE_YN='R' --은행 종류(Y:일반은행, R:RnF은행) 
AND USE_YN= 'Y' 
--------------------------------------------------------------------------------------------------------------------
  
* 국민은행: 623902-04-000579 예금주 한동웅(고객관리팀) 
* 농협중앙회: 766-02-011658 예금주 박인철(경영지원팀) 
* 우리은행: 1002-329-192655 예금주 전진욱(경영지원팀) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■