

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.01.02(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 19:30 

- [컴퓨터 세팅
- i3shop 첫 출근 
==============================================================================================================
 
- [네트웍 ID/PWD 설정] 
i3shop1020321 i3shop1030321 
\\210.123.133.39\f$(문서 서버_0) administrator/i3shop390321 
\\210.123.133.224(문서 서버) administrator/i3shop 
\\210.123.133.51(오라클 Test서버) (리눅스)root/i3shop511092 --> 사용 안 함 
\\210.123.133.101(Test서버) (리눅스)root/1q2w3e --> 사용 
\\210.123.133.52(쇼핑몰 Test서버) i3shop/i3shop520321 ========> 사용 안 함 
\\210.123.133.56(통합 Test서버)   i3shop/dacosystem ========> 사용 안 함 
\\211.233.5.100(OZ 레포트 서버) administrator/ozoz100# 
\\211.233.5.101(Test서버) root/1q2w3e 
\\211.233.5.102(Nmail 서버) administrator/i3shopmail9563   
\\211.233.5.103(공제조합/Mail 서버) administrator/i3shop1030321  
\\211.233.5.104(IR.1004.메일 서버) administrator/i3shop1040321    --> 이전 쇼핑몰 image 서버 
\\211.233.5.107((MS-SQL DB서버) administrator/i3shop1070321 sa/ckrladl(차김이) MSDB-SERVER 
\\211.233.5.108(통합 실서버) i3shop/i3shop1080506 --> su/i3shop1089121 http://int.i3shop.com(admin/bukwin2k)  
\\211.233.5.109(넷텔러(입금확인) 서버) i3shop/i3shop1090506 --> su/i3shop1099121 

\\211.233.5.111(쇼핑몰 실서버_1) i3shop/iiishop1110506 (삼바)i3shop/iiishop9125 --> su/iiishop1119563 
\\211.233.5.112(쇼핑몰 실서버_2) i3shop/iiishop1120506 (삼바)i3shop/iiishop9125 --> su/iiishop1129563 
\\211.233.5.113(쇼핑몰 실서버_3) i3shop/iiishop1130506 (삼바)i3shop/iiishop9125 --> su/iiishop1139563 
\\211.233.5.114(쇼핑몰 실서버_4) i3shop/i3shop1140506 --> su/i3shop1149121 
\\211.233.5.115(쇼핑몰 실서버_5) i3shop/i3shop1159121 (삼바)i3shop/i3shop1150506  -> su/i3shop1159121 
\\211.233.5.116(쇼핑몰 실서버_6) i3shop/i3shop1160506 --> su/i3shop1169121 
\\211.233.5.117(쇼핑몰 실서버_7) i3shop/i3shop1170506 --> su/i3shop1179121 ========> 사용 안 함 
\\211.233.5.118(서프트 서버) i3shop/i3shop1180506 --> su/i3shop1189121 ========> 서프트 서버(support.i3shop.com) 
\\211.233.5.110(오라클 DB 실서버) oracle/i3shop1105974 --> su/ekzhtltmxpa(다코시스템) 
\\211.233.5.126(쇼핑몰 image 서버) administrator/i3shop 
\\210.123.133.121(MS-SQL DB서버) administrator/i3shop649563 sa/project 
\\210.123.133.30(TEST 웹 서버) i3shop/i3shop2540506 
\\210.123.133.39(MS-SQL 백업 DB서버) administrator/i3shop390321 depend/ckrladl,   sa/ckrladl(차김이) 
\\210.123.133.123\i3shop(CVS 서버) administrator/i3shop100321  
\\210.123.133.13(TM 서버) administrator/i3shop100321 depend/ckrladl(차김이) 
\\210.123.133.254(TEST 웹 서버) i3shop/i3shop1170506 
\\211.233.5.110(오라클DB 테스트 서버) SID: ORCL, IIISHOP/IIISHP 
------------------------------------------------------------------------------------------------------  

\\210.123.133.23(4층 Print) administrator/i3shop   ==> 앱손(EPSON EPL-6200L) 
\\210.123.133.28(4층 디자이너 Print) administrator/i3shop   ===> HP(deskjet 920C) 
\\210.123.133.148(3층 김진혁 대리 Print) 진태만/tama12 
\\210.123.133.185(3층 노은주 주임 Print) 노은주/9035  
==============================================================================================================


[EJB, Bean 등록 방법]  ==========> 쇼핑몰(CCDOM)   @@@@@@@@@@@ 
local 에서 EJB, Bean 생성  ======> 
C:\CCDOM\Ccdom\bin\com\i3shop\beans\BizStore 
CartBean.class 
C:\CCDOM\Ccdom\CcdomWeb 에서 JSP파일 수정 
------------------------------------------------------------------------------------------------------  

-- Bean 등록 방법 @@@@@ 
터미널 서버 연결(Ztem)==> IP: 211.233.5.116 
[i3shop@iiishop_ccdom1 i3shop]$  su 
[i3shop@iiishop_ccdom1 i3shop]$  i3shop1169121 
[root@iiishop_ccdom1 src]# cd src/bean 
[root@iiishop_ccdom1 bean]#  ./build.sh CartBean 
\\210.123.133.116\websphere\installedApps\BizStore.ear\BizStore.war\WEB-INF\classes\com\i3shop\beans\BizStore  
에 CartBean.class 자동 생성 

- 실제 웹 서버(.116) --- 
\\210.123.133.116 디버깅 파일(CartBean.class)을 아래 폴더에 붙여 넣기 
\\210.123.133.116\websphere\installedApps\BizStore.ear\BizStore.war\WEB-INF\classes\com\i3shop\beans\BizStore 
==============================================================================================================

- Bean 파일 수정 
네비게이터 ==> /Ccdom/bin/com/i3shop/beans/BizStore/CartBean.class 파일 복사 
(C:\CCDOM\bin\CartBean.class) 
패키지 탐색기 ==> /Ccdom/CcdomWeb/WEB-INF/classes/com/i3shop/beans/BizStore 붙여 넣기 
(C:\CCDOM\Ccdom\CcdomWeb\WEB-INF\classes\com\i3shop\beans\BizStore) 
==============================================================================================================

- EJB 등록 방법 @@@@@ 
210.123.133.116 에서 ==> 현재 여기서 ItemMgr.jar 파일을 만든 후 211.233.5.108에 붙여 넣음 
1. \\211.233.5.116\i3shop\src\ejb\MemberSvc\MemberSvcBean.java 수정  
2. 터미널 서버 연결(Ztem) 
IP: 210.123.133.116 i3shop/dacosystem 
4. 컴파일 하기 
[i3shop@newint i3shop]$  su 
[i3shop@newint i3shop]$  i3shop1169121 
[i3shop@newint i3shop]# cd src/ejb/MemberSvc 
[i3shop@newint ItemMgr]$ ./build.sh MemberSvc 
.jar 파일 생성됨(---> \\210.123.133.116\i3shop\component\ejb\MemberSvc.jar 파일로 만들어 짐) 
\\211.233.5.116\websphere\installedApps\i3shop.ear 파일(116.jar) 붙여 넣기 
5. .116서버 Websphere 종료 후 재시작 
6. 디버깅 --> 터미널 서버 연결(Ztem) 
[i3shop@newint i3shop i3shop]$  cd /opt/WebSphere/AppServer/logs 
[i3shop@newint i3shop logs]$ tail -f Default_Server_stdout.log  
==============================================================================================================

- [EJB, Bean 등록 방법]  ==========> 통합(i3shop)   @@@@@@@@@@@ 
C:\i3shop\Int\BizMgrBean\com\i3shop\dao\BizMgr 
OrderDAO.java OrderDtlDAO.java 파일 수정(복사) 

-- Bean 등록 방법 @@@@@ 
eclipse에서 내보내기 -> jar 파일 
로컬 PC C:\i3shop\intLib에 내보냄 
로컬 PC C:\orion2\lib에 내보냄 
BizMgr.jar 생성(복사) 
--------------------------------------------------------------------- 
\\210.123.133.56\i3shop\lib 에 BizMgr.jar 파일 덮어 쓰기 
\\211.233.5.108\i3shop\src\bean\BizMgrDAO\com\i3shop\dao\BizMgr 
OrderDAO.java OrderDtlDAO.java 파일 덮어 쓰기 
\\211.233.5.108\websphere\lib\app에 BizMgr.jar 파일 덮어 쓰기 
.108서버 Websphere 종료 후 재시작  
==============================================================================================================

- EJB 등록 방법 @@@@@ 
210.123.133.56 에서 ==> 현재 여기서 ItemMgr.jar 파일을 만든 후 211.233.5.108에 붙여 넣음 
1. C:\i3shop\Int\IntEjb\ItemMgr\com\i3shop\ejb\BizMgr\ItemMgrBean.java 수정 
2. \\210.123.133.56\i3shop\src\ejb\ItemMgrEJB 로컬에서 아래 3개 파일을 복사하여 붙여 넣기함 
ItemMgr.java ItemMgrBean.java ItemMgrHome.java 
3. 터미널 서버 연결(Ztem) 
IP: 210.123.133.56 i3shop/dacosystem 
4. 컴파일 하기 
[i3shop@newint i3shop]$  su 
[i3shop@newint i3shop]$  i3shop566414 
[i3shop@newint i3shop]# cd src/ejb/ItemMgr 
[i3shop@newint ItemMgr]$ ./build.sh ItemMgr 
.jar 파일 생성됨(---> \\210.123.133.56\i3shop\component\ejb\ItemMgr.jar 파일로 만들어 짐) 
\\211.233.5.108\websphere\installedApps\i3shop.ear 파일(ItemMgr.jar) 붙여 넣기 
5. .108서버 Websphere 종료 후 재시작 
6. 디버깅 --> 터미널 서버 연결(Ztem) 
[i3shop@newint i3shop i3shop]$  cd /opt/WebSphere/AppServer/logs 
[i3shop@newint i3shop logs]$ tail -f Default_Server_stdout.log  
==============================================================================================================

- telnet 으로 연결 불가능 할 때 
]# ssh root@211.233.5.111 
]# env 
]# export DISPLAY=210.123.133.101:0.0      ----> 새 서버 
]# ./adminclient.sh 
==============================================================================================================

- i3shop TAMA 개인컴 네트웍(IP 주소)
IP:    210.123.133.31 
S.M: 255.255.255.0 G.W: 210.123.133.1 
DNS: 211.233.5.93 DNS2: 168.126.63.1 
==============================================================================================================

- 협력업체
쇼핑몰 엘지세화(주) B0000520/2431 
쇼핑몰 김정배[(주)모션위즈] B0087207/87207 
쇼핑몰 서진석[프라이스데이] B0000602/pr55036 
쇼핑몰 김관수[(주)씨앤씨클럽] B0000404/4926 
임영택[Ace inc] B0000286/4166 
문극현[유한킴벌리] 31666/1666 
김창근[SK(주)] B0000587/4762 
김종문[대백유통] B0000046/4888 
물류 김한연[중외휴먼택] B0000511/3532 
마트 김관수[(주)씨앤씨클럽] B0000404/4926  
==============================================================================================================

- 디버깅 --> 터미널 서버 연결(Ztem) 
[i3shop@iiishop_int i3shop]$  cd /opt/WebSphere/AppServer/logs 
[i3shop@iiishop_int logs]$ tail -f Default_Server_stdout.log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.03(토) 작업 ■■■■■■■■■■■■■■■■
---> 8:30 ~ 18:30 

- 환경 세팅
- 자바,  eclipse, websphere 설치 
http://int.i3shop.com/login/login.jsp admin/bukwin2k 
http://210.123.133.56 admin/admin 
\\210.123.133.39\f$ administrator/i3shop3903** 
Tel) 9133 
==============================================================================================================

- i3shop 네트웍(IP 주소) --------- 
IP:    210.123.133.31 
S.M: 255.255.255.0 G.W: 210.123.133.1 
DNS: 211.233.5.93 DNS2: 168.126.63.1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:30 

- 게시판 만들기
LLog.err.println("[TAMA] MemberDb.java:: execute() ====> [eventUserLstId]"+ eventUserLstId); 
==============================================================================================================

- 암호화 문제(oracle9i에서 ---> oracle8i에서는 정상적으로 작동) 
The following error has occurred: 

ORA-28232: obfuscation 툴킷에 부적합한 입력 길이입니다. 
ORA-06512: "SYS.DBMS_OBFUSCATION_TOOLKIT_FFI", 줄 0에서 
ORA-06512: "SYS.DBMS_OBFUSCATION_TOOLKIT", 줄 153에서 
ORA-06512: "LEADER.CRYPTIT", 줄 20에서 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.06(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 02:00 

- 게시판 만들기
--// 기타 게시판 
SELECT NO, SUBJECT, POST_DATE, WEB_NOTICE, WRITER_NAME,REFERENCE,FIRE_DATE,RNUM           
FROM (  SELECT NO,SUBJECT,POST_DATE, WEB_NOTICE,WRITER_NAME,REFERENCE,FIRE_DATE,ROWNUM RNUM  
FROM ( SELECT NO,SUBJECT, POST_DATE, WEB_NOTICE,WRITER_NAME,REFERENCE,FIRE_DATE                  
   FROM L_WEBNOTICE                                                                    
   WHERE DELE_FLAG = 'N' AND PRINT_FLAG = 'D'                    
     AND FIRE_DATE >= TO_CHAR(SYSDATE,'YYYYMMDD')   
   ORDER BY NO DESC 
  ) 
)                                                                                         
WHERE RNUM BETWEEN 1 AND 10 
---------------------------------------------------------------------------------------------------------------------------- 

select * from IESTATE where swkorname='노인경' 
update IESTATE set swkorname='진태만' where swkorname='노인경' 

select * from EMPLOYEE_BAK where emp_name='노인경' 
update EMPLOYEE_BAK set emp_name='진태만' where emp_name='노인경' 
update store set store_code='E01' 
update store set DEPT_CODE='1152822' 
==============================================================================================================

- 연말정산 관련 
i3shop Fax) 053-757-9111 
케이와피젠 Fax) 3472-8642 
서울시 서초구 서초3동 1532-7 서울빌딩 504호 
드림성모 안과 Tel) 7797-888 명문치과 Tel) 873-7203 
국민카드 Tel) 1588-1688 쌍용화재 Tel) 1688-1688 
==============================================================================================================

-- thread, depth 추가  ----------------- 
ALTER TABLE L_WEBNOTICE add ( 
	thread     NUMBER(38)  NULL,  
	depth      NUMBER(12)  NULL 
); 
==============================================================================================================

-- Thread 값을 얻어오기 
SELECT @NewThread = ISNULL(MAX(Thread),0) + 1000 FROM ThreadBoard
1. 입력되는 글이 질문 글인 경우 
: 현재 데이터베이스에 존재하는 thread 값중 가장 큰 값에 +1000 을 한 값으로 Thread 값을 준다. 
  depth는 무조건 0으로 준다.  
  예) INSERT INTO ThreadBoard (thread, depth, writer, pwd, title, mode, content)   
       Values (1000, 0, 'admin', 'pwd', '세번 째 글입니다', 1, '본문 내용입니다')  
------------------------------------------------------------------------------------------------------------------------------

2. 입력되는 글이 답변 글인 경우
: 자신의 부모글의 thread 값보다 -1이 작고, 이전 질문 글의 thread 값 사이에 위치한 모든 글의 
   thread 값을 -1 한다. 그리고 난 다음, 현재 입력되는 글의 thread 값을 부모글의 thread 값 -1 로 
   지정한다. depth는 부모글의 depth 값에 +1한 값으로 준다.  
  예) UPDATE ThreadBoard  
       SET thread = thread - 1 
       Where thread < 부모 글의 thread 값 and thread > 이전 질문 글의 thread 값 

       SET thread = thread - 1 
       Where thread < ParentThread and thread > ParentThread -1000 

       INSERT INTO ThreadBoard (thread, depth, writer, pwd, title, mode, content)   
       Values (부모 글의 thread 값-1, 0, 'admin', 'pwd', '세번 째 글입니다', 1, '본문 내용입니다')  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.07(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 

- 게시판 만들기
- 전산실 회식(신입 사원 환영) 
==============================================================================================================

- 타입변경(int -> string) 
strMaxNo = String.valueOf(intMaxNo); 
==============================================================================================================

-- ORIGIN_NO,  ANS_STEP,  ANS_DEPTH 추가  --------- 
ALTER TABLE L_WEBNOTICE add ( 
ORIGIN_NO    VARCHAR2 (12) NULL, 
ANS_STEP     NUMBER (3) NULL 
); 
==============================================================================================================

-- QID 수정  --------- 
ALTER TABLE L_WEBNOTICE modify ( 
QID    NUMBER (12) 
); 
==============================================================================================================

-- 칼럼 삭제  --------- 
alter table at_mibun drop constraint at_mibun_etc_dept_fk;  
alter table at_mibun drop column dept_cd; 
==============================================================================================================

-- ODBC 에러  --------- 
Microsoft OLE DB Provider for ODBC Drivers (0x80004005) 
[Microsoft][ODBC 드라이버 관리자] SQL_HANDLE_ENV에서 드라이버의 SQLAllocHandle을 실패했습니다. 
/DBcon.asp, line 3 
-------------------------------------------------------------------------------------------------------------- 

- win2003 하고 oracle9i 를 깔아서 작업하고 잇는데요 
DB연결이 안돼요......win2000 + oracle8i는 되는데요..... 

Oracel 9i에서는 OLEDB의 Connection String 설정이 8i와 Provider부분이 틀립니다. 
오라클 OLEDB부분 메뉴을 보시면 정확하게 나와있을겁니다. 
그리고 Oracle9i (9.2.0.1.0)은 버그가 있어서 OleDB 나 ODBC가 ASP도 연결이 안됩니다. 
9.2.0.4 패치를 설치하십시요...그러면 될겁니다. 
==============================================================================================================

2.1 윈도우2000인경우 oracle_home 폴더에서 등록정보  
보안 IWAM_XXX이름 계정에 읽기 및 실행 권한주기  
2.2  IWAM_XXX이름 계정에 Admin권한을 줬더니  
되더군요. 근데 보안문제는 염두해 두셔야 할듯 
==============================================================================================================

-- ODBC연결 ------------------ 
데이타 원본이름(N): TAMAORA 
사용자 이름(N): tama   (IWAM_TAMA) 
서버(S): TAMAORA	---------> 여기를 수정 
-------------------------------------------------------------------------------------------------------------- 

--DBCon.asp에서 --- 
dbcon.open "DSN=TAMAORA;uid=tama;password=tama339" 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 23:00 

- 인사,회계 분석
- 오라리언 설치 
C:\orion2>java -jar orion.jar -install 
==============================================================================================================

- 테스트 서버 
\\210.123.133.39\f$ administrator/i3shop3903** 
- 프린터 
\\210.123.133.23 administrator/i3shop 
==============================================================================================================

- InterMedia Text를 이용한 long형 검색 불가능(oracle9i에서)
C:\> cd C:\oracle\ora81\ctx\admin 
C:\oracle\ora81\ctx\admin> sqlplus CTXSYS/CTXSYS @dr0drop.sql 
ORA-28000: the account is locked 
해결책: oracle9i를 삭제하고 oracle8i로 다시 설치 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 인사,회계 분석
-- oracle 재설치시 SID는 그대로 남는 문제(Oracle8i Enterprize Edition 8.1.7.0.0) 
1. 먼저 오라클 서비스를 멈추어야 합니다. 
 regedit을 실행 시키시고... 
2. HKEY_LOCAL_MACHINE->SYSTEM->CurrentControlSet->Services 
에 보시면 Oracle 로 시작되는 녀석들이 있는데요 이부분을 전부 지워주시고, 
3. HKEY_LOCAL_MACHINE->SOFTWARE->ORACLE 부분을 전부 지워주세요... 
4. 재부팅 
==============================================================================================================

- 실 DB 연결(Net8) --- 
IP: 211.235.5.110 iiishop/iiishop 
- 실제 웹 서버 --- 
\\211.233.5.108\i3shop i3shop/i3shop1085974 
- 테스트 서버 --- 
\\210.123.133.56 i3shop/dacosystem 
==============================================================================================================

- 094-02-129384 농협 최현석 
경북 포항시 안강읍 옥산리 591-5 한동 유성APT 705동 309호 진기숙 
관악 인터넷 Tel)837-0057 
==============================================================================================================

-- Enitiy 등록 방법 
211.235.5.105 ishop/ 
> src/ejb/EmpMgrEJB 
>  .jar 파일 만듬(---> /component/ejb/.jar 파일로 만들어 짐) 
실서버 에 등록 
/websphere/ishop.ear/에 .jar 파일을 복사 
----------------------------------------------------------------------------------------------------------------------------- 

-- Bean 등록 방법 
eclipse에서 내보내기 -> jar 파일 
로컬 PC C:\i3shop\intLib에 내보냄 
로컬 PC C:\orion2\lib에 내보냄 
----------------------------------------------------------------------------------------------------------------------------- 

- 원격 오라클 서버 접속 구성 방법(NET8)
Network administrator --> Net8 Configuration Assistant
1. 로컬네트웍 이름 구성(radio체크) --> 추가 --> 서버스 이름: iiishop --> TCP --> 
호스트 이름: 211.233.5.110 --> 네트웍 이름: IIISHOP 
2. tnsnames.ora 파일에 수동으로 추가 
#--- IIISHOP 서버 TNS 연결 DB 환경( iiishop / iiishop)  ========================== 
IIISHOP = 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST = 211.233.5.110)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SERVICE_NAME = iiishop) 
    ) 
  ) 
 #--- ============================================================================= 
  
- C:\i3shop\Int\IntWeb\EmpMgr\empMgt 
/EmpMgr/empMgt/employeeInfoP.jsp 
/AccMgr/baseMgt/accTitleInfoP.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.10(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 10:00 

- 물류 실사
- 자인물류센타(경산) 
- 14:00 ~ 10:00(11일) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 회계 분석
util.log("[test]"); 
------------------------------------------------------------------------------------------------------------------- 

- 세무 관련법(크게 안 바뀐다.) @@@ 
감각 삼각, 세무조정 계산서  
인사쪽(급여, 연말정산) --> 자주 바뀌는 분야  
영림원(.OCX 파일로 웹으로 구현)  
이갑식 과장(*): (주)U.I.T 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 06:30 ~ 23:00 

- 회계 분석
1) 자산, 자본, 부채 
-- A. 자산 
1. 현금 및 현금등가물 2. 단기금융상품 
3. 유가증권 4. 외상매출금 
5. 받을어음 6. 상품. 제품 
7. 대여금 8. 토지, 건물 
9. 공구.기구.비품 10. 영업권 
11. 기타(미수금, 미수수익, 반제품, 원재료, 제공품, 선급금, 선급비용, 사채, 차량운반구, 창업비) 
◇ 선대금 - 급료를 선대해 주거나 일시적으로 금전을 대여하여 주는 금액  
◇ 선급금 - 매입계약을 맺고 계약금 조로 대금의 일부를 미리 지급한 금액  
◇ 가지급금 - 현금의 지출은 분명히 있었으나 사용처가 불분명하거 금액 또는 계정과목이 확정되지 않은 금액 
◇ 현금과부족 - 현금 출납장의 잔액과 실제의 잔액에 차이가 있을 때 

-- B. 부채 
1. 외상매입금 2. 지급어음 
3. 사채 4. 차입금 
5. 미지급금 6. 퇴직급여충당금 
7. 기타(선수금, 예수금, 미지금비용, 유동성 장기부채, 장기성 지금어음, 부채성 충당금) 
◇ 선수금 - 매입계약을 맺고 계약금 조로 대금의 일부를 미리 받은 금액 
◇ 예수금 - 일시적으로 소득세, 의료보험료, 국민연금, 신원보증금 등을 예수한 금액 
◇ 가수금 - 현금의 수입은 분명히 있었으나 사용처가 불분명하거 금액 또는 계정과목이 확정되지 않은 금액 

-- C. 자본 
1. 자본금 2. 자본잉여금 
3. 이익준비금 4. 임의적립금 
---------------------------------------------------------------------------------------------------------------------- 
2) 대차대조표 
자산 = 자본 + 부채  
-------------------------------------------- 
  
(차변 ) 대차대조표 (대변 ) 
------------------------------------------------------------ 
자 산  부채 및 자본 
------------------------------------------------------------ 
현금 2,000  외상매입금 1,000   
 자본금 1,000 
---------------      -------- 
2,000    2,000 
     ========       ========  
---------------------------------------------------------------------------------------------------------------------- 

담당바이어 : 피은지 
바세린 인텐스브 선 스프레이 SPF 32 -150ml  
9,500원  ===> 9,500원  ===> 7,680원 

남명환: *@*.* * 9144 
담당바이어 : 이연동 
FOD ABS 하이팩의자  
31,500원  ===> 30,500원  ===> 26,800원  ===> 23,000원 
-- 택배 주소 
경북 포항시 안강읍 옥산리 591-5 한동 유성APT 705동 309호 진기숙 
453801-01-022329 국민 김영철  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:00 

- 회계 분석
- 현금과부족: 현금 출납장의 잔액과 실제의 잔액에 차이가 있을 때 
1. 현금의 실제 잔액이 장부의 잔액보다 \100,000 부족함을 발견하다. 
(차)현금과부족 100,000 (대)현금 100,000 
- 장부 기준으로 자산이 증가 했으므로 차변 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 회계 분석
-- 회계관련 Table 
T_ACCSLIP: 회계전표 T_ACCTITLE: 계정과목 정보 
T_ACCSUB: 부속코드 T_MISCOMMON: MIS 공통코드 
---------------------------------------------------------------------------------------------------------------------- 

-- i3shop 회계 & 더존 회계 프로그램 차이 --- 
1. i3shop VAT 통합(더존: 분리) 
2. i3shop 부속코드(더존: 거래처 코드로 인식) 
3. 거래처코드 틀림 
---------------------------------------------------------------------------------------------------------------------- 

- [회의] -- 회계팀 불만 사항 
- ERP회계 프로그램 사용 불편(더존 c/s에 비해) 
- 향후 회계 법률 변경 시 위험성 내포 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.16(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:10 ~ 23:00 

- 회계 분석
out.println("<br>[TAMA] accSlipP.jsp:: [p_c]"+ p_c); 
util.log("[테스트]"); 
util.log(MNAME,"EJB 호출 에러입니다.\n"+e.toString());  
System.out.println("<br>[TAMA] getAccSlipMListB.jsp :: [_qryhash]"+_qryhash); 

R_CASHBALANCE: 현금잔액 R_DAECHEBALANCE: 대체차액  
---------------------------------------------------------------------------------------------------------------------- 

- 회계- 회의
- 2003년 1 ~ 6월 자동으로 적용(거래처code, 부속code, 부가세code) 수정 
- 2003년 7월 이후는 상대계정보 입력(기초정보)을 이용하여 VAT관련 전표를 자동 추가하여 등록  
- 이월금액 
- 회계팀 주장: 이전의 수정 요구 조건 충족 여부 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.17(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- 회계 분석
OnEnter: Grid Cell의 Data를 수정하기 시작할 때 발생 
OnExit: Edit Mode에서 Cell 입력을 완료하고 Cell을 빠저나갈 때 발생 
OnColumnPosChanged: Grid의 Column위치를 변경한후 발생 
---------------------------------------------------------------------------------------------------------------------- 

- ora-02085 에러 문제(DB 링크 에러) @@@@@@@@@@@@@ 
ORA-02085: database link TATATA.WORLD connects to ORACLE 
위의 경우와 같이 정상적으로 DB Link를 만든후 에러가 날경우  
InitSID.ora File의 global_names Parameter를 확인하여 FALSE로 되어 있는지 확인해야 한다. 
서비스 오라클을 다시 띄우기
c:\> tnsping IIISHOP  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.19(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 회계 분석
1. 일계표란 하루동안에 일어난 거래를 각계정과목별로 집계한 표입니다.  
하루동안의 거래는 전표에 분개되어 있으므로 전표를 기준으로 계정과목별로 
숫자를 집계하면 간단히 작성할수 있습니다. 
==============================================================================================================

- 핸드폰 구매
SPH-E1100 308,000 248,000원 
H)019-556-0898   ===> 새 폰 번호) * 
---------------------------------------------------------------------------------------------------------------------- 

- 팩스번호 256-0115 이영희 
036-08-081-507 대구은행 이영희 계좌로  248,000원 입금(폰 내일 도착 예정) 
---------------------------------------------------------------------------------------------------------------------- 

- 회사 주소) 대구시 동구 신천동 74-1 아이쓰리빌딩 (주)아이쓰리샵 전산정보실  
집주소) 서울시 관악구 신림본동 92-106 202호 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.20(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 15:00 

- 회계 분석
System.out.println(qryhash); 

- FTP prompt에서 작업시
- rmdir 명령어 사용시 따옴표(")를 사용하여 로그에 남은 정확한 디렉토리의 이름을 입력한다.  
- 정확한 파일명을 따옴표를 이용하여 지정한후 삭제한다.  
예1) 로그에 20:41:35 xx.xx.xxx.xxx [3192]MKD /+/com1.JUPiTER.T; %%20++.;..+/+ 257 라는 내용이 남아있을 경우, 
ftp 프롬프트에서 아래와 같이 입력한다.  
ftp> rmdir "/ /com1.JUPiTER.T;a;G %%20 .;.. / "  
(로그상에 "+" 표시는 공백을 의미함) 
---------------------------------------------------------------------------------------------------------------------- 

그래도 안되면 ;; 메모장으로 파일 하나 만드세요. 영화파일과 확장자 까지 같게요. 그리고 복사로 덮어씌운 후에 지우면 지워집니다. 
재부팅하면 지울수 있습니다. 로그오프했다가 로그온해도 되고... 레지스트리 클리너 돌려도 됩니다 
---------------------------------------------------------------------------------------------------------------------- 

FTP돌리 지 않습니까 ? 그거 악의적인 자료실을 만드려는 해킹의 일종인데요 . 잘 지워지지 않고 명령 프롬프트에서 지워집니다. 
rm.exe 를 사용하세요. 그리고 상단메뉴 기술자료에서 검색하시면 상세한 자료를 얻으실수 있습니다. 
---------------------------------------------------------------------------------------------------------------------- 

- FTP사이트 폴더 삭제 
 FTP에서 폴더가 왕창 생겨서 이걸 어떻게 지울까 어제부터 NTFAQ를 계속 
왔다갔다 했습니다만.. 이제 해결해서 그 기념으로 제가 쓴 방법을 정리합니다. 

먼저 rm.exe를 다운받아서 쓸려고 했는데 잘 되지 않더라구요. 
cng무슨 dll이 없다고 나오던데..  
그래서 결국 포기하고 다른 방법을 찾기로 했습니다. 도스명령어 조합... 

우선 rmdir 디렉토리 /s/q 를 써봤습니다.  

근데 워낙 디렉토리를 깊게해놔서 (루트에서 39개까지 내려가더군요. ) 
rmdir에서도 못지우는 디렉토리가 발생하더라구요. 

그러다가 나우 윈도우동에서 dir /x 옵션으로 원래 이름을 찾았다는  
글을 보고.. 도스에서 이렇게 명령을 썼습니다. 

dir /s/x > filelist.txt 

이렇게 하면 filelist.txt 로 하위 폴더까지 리스트를 만들어 줍니다. 

그 리스트를 보면 각 디렉토리 이름이 전체적으로 표시되게 되어있습니다. 
이것을 copy 해서 윈도탐색기에서 폴더 이름 있는 곳에 paste 합니다. 

목표 디렉토리는 파일이 저장되어 있는 "그" 폴더입니다. 
해당 하는 디렉토리에 접근이 되었으면 물론 저장되어있는 파일을 삭제해야합니다. 

이런 과정을 반복해서 해당 디렉토리에 파일을 가지고 있지 않은 상태로 
만들어 주는 것입니다. 

그 다음에는 fileEX 라는 ( http://home.nownuri.net/~kittykat ) 프로그램으로 
해당 폴더를 싹~ 지워주시면 한 방에 지워집니다.  

저는 첨부터 fileEX로 지우려고 했더니 파일들이 걸려서 안되더라구요. 
꼭 빈 디렉토리 상태에서 지워보세요~ 딱 한방에 지워집니다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 회계 분석
◇ 통합시스템관리 
AclMgr[시스템관리] MlmMgr[다단계관리]  
MemberMgr[회원정보관리] ExcelMgr[엑셀관리]  
CommonMgr[공통코드관리] ClubMgr[동호회관리]  

◇ BizMgr 
BasicInfoMgr[공통코드관리] BuyingMgr[구매관리]  
DeliveryMgr[배송관리] ItemMgr[상품관리]  
ItemStockMgr[재고관리] ItemWebMgr[웹상품관리]  
PosMgr[POS 관리] ReportMgr[리포트관리]  
SaleMgr[주문관리] VendorMgr[거래처관리]  

◇ MisMgr 
EmpMgr[인사급여관리] AccMgr[회계관리]  

◇ BizStore 
DisplaySvc MlmSvc[다단계관리]  
MemberSvc[회원정보관리] OrderSvc[주문관리]  
CommonSvc[공통코드관리] ClubSvc[동호회관리]  
BoardSvc[게시판관리] 
---------------------------------------------------------------------------------------------------------------------

◇ 이전에 해 놓은 거 받아 오기(CVS이용) 
CVS저장소  ===> HEAD ===>  Int(오른쪽 클릭)  ===> 체크아웃(C) 
이전 서버의 해당 폴더가 자동으로 생성됨 
일부 수정을 하려면 
원하는 폴더(오른쪽 클릭)  ===> 다음으로 체크아웃(A) 
이전 서버의 해당 폴더가 자동으로 생성됨 
---------------------------------------------------------- 

◇ jar 파일 등록(EJB) 
ex) MisMgr.jar 파일을 복사하여 아래 폴더에 붙여넣기 함 
C:\i3shop\intLib 
C:\orion2\lib 

◇ jar 파일 등록(Bean) 
C:\i3shop\Int\MisMgrBean 
---------------------------------------------------------------------------------------------------------------------

◇ jar 파일 만들기 
/Int/IntEjb/AccMgr(C:\i3shop\Int\IntEjb\AccMgr) 에서 
==> 오른쪽 클릭 ===> 내보내기(X) ====> JAR파일(다음(N)> 경로 선택 후 ===> 완료 클릭 
---------------------------------------------------------------------------------------------------------------------

- [주간 회의] 
- 연휴서버 다운 
- 당직 실시(2인 1조) 
평일: 20시 휴일: 10시 ~ 19시 
- 쇼핑몰 디자인 개편 
- 쇼핑몰 CD타이틀 제작 
- 보상 plan 변경 
- 인사, 회계 이번주까지 오픈 
- 모든 코딩 eclipse 사용 
---------------------------------------------------------------------------------------------------------------------

- KT전화국 고객센터:080-2580-016/018 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.27(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 23:00 

- 회계 분석
과정과목 팝업, 자동 조회 @@@@@@@@@@222 

 A. 과정과목 일 경우 
1. 계정 code를 입력 안 했을 때(팝업) 
2. 계정 code를 입력 했을 때 
- 계정 code(숫자)를 입력 했을 때(조회 후 계정과목 자동 입력) 
- 계정 code(한글)를 입력 했을 때 
(1개만 조회 될 때- 조회 후 계정과목 자동 입력) - OK 
(1개 이상이 조회 될 때 - 팝업 후 자동 조회하여 보여 주기) 
==============================================================================================================

- [회계- 회의] 
14:00 ~ 15:30  
◇ 미결 업무 리스트(현재)
- 계정과목 code 추가  여유 번호 많이 확보할 것 
- 회계전표 입력시 거래처명 한글 입력 안됨, tab키 대신 Enter키로 이동 희망 
- 상대계정 입력 부분에서 자동 분개 부분 수정요(선급금의 경우 잘못됨) 
- 세금계산서 발행을 매출전표에 포함 시킬 것 
- 각 란의 출력 부분 출력되게 할 것  
- 각 란의 에러 부분 수정할 것  
- 일단 이번주 금요일(30일)까지 수정하고 Open 하기로 함 
- 회계팀 김근배 과장 현 진행 사항을 1~20%로 보고 있음 

◇ 수정 후 해야 할 업무 
1. 2004년 1~6월 결산 테스트 확인 
2. 실제로 전표 입력해서 자료 맞는 지 검증  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 회계 분석
◇ DataSet Component 
- Presentation Comonent가 사용하는 모든 Data를 저장하는 Buffer역할을 한다. 
- Service로부터 Data를 읽어들이고, 변경된 정보를 Service로 보내기전까지 보관한다. 
---------------------------------------------------------------------------------------------------------------------

<object id=tb_DataSet classid=CLSID:3267EA0D-B5D8-11D2-A4F9-00608CEBEE49> 
	<param name="DataID" value="http://210.124.184.6/tb_sys?toinb_dataid4=Manual_Service"> 
	<param name="Cacheload" value=false> 
</object> 

<object id=tb_Grid classid=CLSID:1F57AEAD-DB12-11D2-A4F9-00608CEBEE49 height=320 width=456> 
	<param name=DataID value=tb_DataSet> 
	<param name=Format value=' 
	<C>ID=Partno name="Part No" width=100</C> 
	<C>ID=Partnm name="Part Name" width=210</C> 
	<C>ID=Price name="Price" width=110</C>'> 
</object> 
==============================================================================================================

◇ Bind Component 
일반 HTML에서 사용되는 Edit, TextArea, Combo등의 Input Tag로 적용되는 일반 Component와  
DataSet Component와 연결할수 있는 기능을 내장하는 Bind Component로써 일반Component와 연결되어  
DataSet의 자료를 변경하고, 읽어오는 기능을 하는데 사용된다. 

◇ ActiveBind 
Binding할 DataSet과의 Bind 활성시점을 정의한다.(DataSet과 Control간의 Binding 여부) 
---------------------------------------------------------------------------------------------------------------------

<object id=tb_DataSet classid=CLSID:3267EA0D-B5D8-11D2-A4F9-00608CEBEE49> 
	<param name=DataID value="http://www.toinb.com/TOInB/Sample/Component/Bind/ActiveBind_data.csv"> 
</object> 

<object id=tb_Grid classid=CLSID:1F57AEAD-DB12-11D2-A4F9-00608CEBEE49 height=264 width=456> 
	<param name=DataID value=tb_DataSet> 
	<param name=Editable value=true> 
	<param name=Format value=' 
	<C>ID=No Title="No" width=20</C> 
	<C>ID=Empno Title="Employee" width=60</C> 
	<C>ID=Entrydt Title="Entry Date" width=70</C> 
	<C>ID=Salary Title="Salary" width=90</C> 
	<C>ID=Url Title="HomePage" width=180</C>'> 
</object><br><br> 

<table frame=box cellspacing=0 width=456> 
	<tr><td><label id="lbl_name1">Employee</label></td> 
	<td><input type=text id=txt_value1 style="width:70"></td> 
	<td><label id="lbl_name2">Entry Date</label></td> 
	<td><input type=text id=txt_value2 style="width:210"></td> 
	</tr> 
</table> 

<object id=tb_Bind classid=CLSID:9C9AB433-EA85-11D2-A4F9-00608CEBEE49> 
	<param name=DataID value=tb_DataSet> 
	<param name=ActiveBind value=true> 
	<param name=BindInfo value=' 
	<C>Col=Empno Ctrl=txt_value1 Param=Value Disable=disabled</C> 
	<C>Col=Entrydt Ctrl=txt_value2  Param=Value</C>'> 
</object> 
==============================================================================================================

if (isInteger(p_accslip_no) == true){     //  계정과목이 숫자이면 
SQL += " AND A.ACCSLIP_NO = ? " + 
} else { 
SQL += " AND A.ACCSLIP_NM = ? " + 
} 
==============================================================================================================

function PLIsNumber(strNumber)  
{  
    if(strNumber.length == 0)  return false;  

    for(var i=0; i<strNumber.length; i++)  
    {   
        // 각각의 문자의 ASCII코드를 반환  
        var intCheckNum = strNumber.charCodeAt(i);  

        // ASCII코드를 비교해서 숫자여부를 판단   
        if(intCheckNum < 48  intCheckNum > 57)  
             return false;  
    }      

    return true;  
} 
==============================================================================================================

System.out.println(Integer.toBinaryString('A'));  
int c= 128 
String = ""+ char(c); 
System.out.println((char)a);  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.29(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 회계 분석
out.println("[TAMA] accTitlePopUpP.jsp:: [p_acctitle_nm_para]"+ p_acctitle_nm_para); 
System.out.println("[TAMA] accTitlePopUpP.jsp :: [dSet.getDataColumns()]"+ dSet.getDataColumns()); 
---------------------------------------------------------------------------------------------------------------------

◇ 과정과목 팝업, 자동 조회 @@@@@@@@@@@@@ 
 A. 과정과목 일 경우 
1. 계정 code를 입력 안 했을 때(PopUp) 
2. 계정 code를 입력 했을 때 
- 계정 code(숫자)를 입력 했을 때(조회 후 계정과목 자동 입력) 
- 계정 code(한글)를 입력 했을 때 
(1개만 조회 될 때- 조회 후 계정과목 자동 입력) - OK 
(1개 이상이 조회 될 때 - 조회 후 1개 이상이면 팝업 후 자동 조회) - OK  
==============================================================================================================

- Grid의 OnKeypress이벤트를 사용하심됩니다 
script language=\javascript\for=tbgd_property event=OnKeyPress(keycode)이렇게 잡히구요..토아사님께서 주신 소스를 보면 
script language=JavaScript for=tb_Grid event=OnKeyPress(kcode)이렇게 잡혀있거든요.. 
 keycode 엔터키(13) 일때. *.focus(); 
<body OnLoad="grid_ds_list.focus()"> 
  
변수명이 keycode, kcode 다른데..이건.. 버전 차이인가요?저것때문에 안되는건 아니겠죠? 
전 방금 1,0,11,6 버전으로 업그레이드를 했거든요..무슨차이때문에,..엔터키 누른값이 안넘어 올까요..제가 태스트한 콤포넌트버전은
1,0,11,0입니다. 
==============================================================================================================
 
- allshowedit=false로 주시고.그럼 edit할때는 한번 enter키를 눌러야 하는 불편이 있네요..  
수정하신담에 다시 엔터키 치시면editable이 없어지구 여기서 방향키를 누르면 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 

- 회계 분석
- 쿼리 선택 
:ACCTITLE_CD으로 설정하여 쿼리하면 Variables에 value를 108로 넣음 
----------------------------------------------------------------------------------------------------------------------------- 

SELECT * 
FROM   T_ACCSLIP 
WHERE ACCSLIP_DT >= :ACCSLIP_DT_from 
    AND ACCSLIP_DT <= :ACCSLIP_DT_to                                      
    AND ACCTITLE_CD = :ACCTITLE_CD  
==============================================================================================================

- ROW_NUMBER() OVER 
select 구분, rank() over(partition by 구분 order by '순위') as rank 
from 테이블명   
이렇게 하면 각 구분별로 다음처럼 순위가 매겨지죠.. 
ROW_NUMBER() OVER (PARTITION BY  ACCSLIP_DT ORDER BY ACCSLIP_NO DESC,ACCSLIP_SEQ DESC), 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.01.31(토) 작업 ■■■■■■■■■■■■■■■■
---> 8:10 ~ 19:00 

- 회계 분석
회계전표관리 list 정리
외상매출금 (108) 상품매출 (401) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■