

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.10.01(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 23:00 

- 정수기 개발
- Jobs 실행 
52in 산소수기: 00137113 
온라인점 -> 하나로지텍(주) 자인물류점 -> 도원텔레콤 
필터교환권(교환비용): 00142161 
아쿠아코리아 
-------------------------------------------------------------------------------------------------------- 

1. 주문상태(T_ORDER 테이블 ORDER_STS에서) 
주문: 결재완료(03), 배송중(04)   
반품: 반품접수(22) 
-------------------------------------------------------------------------------------------------------- 
2. 배송상태(T_ORDER_DTL 테이블 SHIP_STS에서) 
주문: 배송대기(02) 
반품: 물품회수대기(21) 
==============================================================================================================

- 반품 점검(협력업체)
아이즈비젼 B0000494/5741 
반품내역 /VendorMgr/ReturnItemMgr/returnItemStsP.jsp 
dlog("[/CartBean.java]:[addOrderMasterUP()]: [SQL]====> \n "+ SQL); 

반품 주문번호:0100012004092100369 원주문번호:0100012004091400026 이찬 
일반판매가: 315,000원, 구매가: 314,700원 
반품가격: 314,700 원  
-------------------------------------------------------------------------------------------------------- 

20040701 ~ 0731 
일반판매가:  319000 구매가: 312700 
20040801 ~ 0831 
일반판매가:  316000 구매가: 314700 
20040901 ~ 0914 
일반판매가:  316000 구매가: 314700 
20040921 ~ 0930 
일반판매가:  315000 구매가: 306600 
==============================================================================================================

- 이전 데이타 2건 수정 
0100012004080400014 임윤옥 
0100012004050301042 임경자  
==============================================================================================================

- 주문정보 수정(Oralce DB)  @@@@@@@@@@@@@@ 
UPDATE T_ORDER 
SET  (REG_ID,I3SHOP_ORDER_NO) 
	=  (  SELECT  B.REG_ID, A.I3SHOP_ORDER_NO 
		FROM T_ORDER A, T_CALL B 
		WHERE A.I3SHOP_ORDER_NO = B.I3SHOP_ORDER_NO 
			AND ORDER_TYPE IN('02', '06') 
			AND A.REG_DT >='20040901'   -- 주문일자 
			AND A.REG_DT <='20040924' 
	)  
==============================================================================================================

  
- 주문정보 조회(MS-SQL  DB) @@@@@@@@@@@@@@ 
SELECT B.REG_ID 
FROM T_ORDER A, T_CALL B 
WHERE   A.I3SHOP_ORDER_NO = B.I3SHOP_ORDER_NO AND  
     A.REG_DT = B.REG_DT AND A.ORDER_TYPE IN ('02', '06') AND  
     A.RETURN_DT IS NULL AND B.REG_DT >= '20040901' AND  
     B.REG_DT <= '20040924' 
----------------------------------------------------------------------------------------------- 

- 주문정보 수정(MS-SQL DB) @@@@@@@@@@@@@@ 
UPDATE T_ORDER    
SET REG_ID = B.REG_ID, 
I3SHOP_ORDER_NO =  B.I3SHOP_ORDER_NO --(주문번호 수정 가능) 
FROM T_ORDER A, T_CALL B 
WHERE   A.I3SHOP_ORDER_NO = B.I3SHOP_ORDER_NO AND  
     A.REG_DT = B.REG_DT AND A.ORDER_TYPE IN ('02', '06') AND  
     A.RETURN_DT IS NULL AND B.REG_DT >= '20040901' AND  
     B.REG_DT <= '20040924' 
==============================================================================================================

- win98 설치 
MDAC_TYP.EXE 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.02(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 17:30 

- 정수기 개발
1. 주문상태(T_ORDER 테이블 ORDER_STS 에서) 
주문: 결재완료(03), 배송중(04)  --> 배송완료(09)  
반품: 반품접수(22) --> 물품회수완료(23) 
-----------------------------------------------------------------------------------------------
2. 배송상태(T_ORDER_DTL 테이블 SHIP_STS 에서) 
주문: 배송대기(02)  --> 배송완료(09) 
반품: 물품회수대기(21) --> 물품회수완료(22) 
==============================================================================================================

- 설치완료 확인(후레쉬 워터에서 확인한 데이타) 
-- 전체 조회(TEST ) @@@@@@@@@@@@@ 
SELECT I3SHOP_ORDER_NO, ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM, 
	ORDER_TYPE, -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
	ORDER_STS, --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
	 INSTALL_STS, DELIVER_STS, --설치상태(01:처리보류 02:설치완료, 03:미설치, 04:설치), 배송상태(01:처리보류 02:설치완료
	 , 03:미설치, 04:설치) ===== 
	 I3SHOP_ITEM_NM, CASH_DT, REG_DT 
FROM T_ORDER 
WHERE RETURN_DT IS NULL 
AND ORDER_DT >= '20040902' 
--AND ORDER_TYPE = '01' -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
AND ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
----------------------------------------------------------------------------------------------- 

-- 정상주문 배송완료(MS-SQL) @@@@@@@@@@@@@@@ 
UPDATE IIISHOP..IIISHOP.T_DEPEND_ORDER 
SET ORDER_STS =  '09' -- 주문상태 배송완료(09)  
FROM IIISHOP..IIISHOP.T_DEPEND_ORDER A, T_ORDER B 
WHERE A.ORDER_NO = B.I3SHOP_ORDER_NO 
AND B.RETURN_DT IS NULL  
AND B.ORDER_TYPE = '01' -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
AND B.ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
AND B.ORDER_DT >= '20040902'  
--------------------------------------------------------------------------------------------------------------------- 

-- 반품 물품회수완료(MS-SQL)  @@@@@@@@@@@@@@@ 
UPDATE IIISHOP..IIISHOP.T_DEPEND_ORDER 
SET ORDER_STS = '23' --물품회수완료(23)  
FROM IIISHOP..IIISHOP.T_DEPEND_ORDER A, T_ORDER B 
WHERE A.ORDER_NO = B.I3SHOP_ORDER_NO 
AND B.RETURN_DT IS NULL  
AND B.ORDER_TYPE = '04' -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
AND B.ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
AND B.ORDER_DT >= '20040902' 
==============================================================================================================

-- 정상주문 배송완료(Oralce) @@@@@@@@@@@@@@@ 
UPDATE T_ORDER 
SET ORDER_STS = '09' 
FROM T_DEPEND_ORDER  A, T_ORDER B 
WHERE A.ORDER_NO = B.I3SHOP_ORDER_NO 
AND B.RETURN_DT IS NULL  
AND B.ORDER_TYPE = '04' -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
AND B.ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
AND B.ORDER_DT >= '20040902' 
---------------------------------------------------------------------------------------------------------------- 

UPDATE T_ORDER 
SET  (REG_ID, I3SHOP_ORDER_NO) =  (  SELECT  B.REG_ID, A.I3SHOP_ORDER_NO 
  FROM T_ORDER A, T_DEPEND_ORDER B 
  WHERE   A.COMPANY_CD = '01' AND 
  A.MERCHANT_CD = '0001' AND 
  A.ORDER_TP IN ('01') AND -- 주문유형(01:정상주문, 03:반품주문) 
  A.SELLING_DT = P_MAGAM_DATE AND --입금일자(마감일자) ===> (이관 수행 하루 전 날짜) 
  A.ORDER_STS IN ('03', '04') AND 
  B.ITEM_CD IN ('00137113', '00142161') 
--------------------------------------------------------------------------------------------------------------------- 

-- 반품 물품회수완료(Oralce)  @@@@@@@@@@@@@@@ 
UPDATE T_ORDER 
SET ORDER_STS = '23'  --물품회수완료 
FROM T_ORDER 
WHERE RETURN_DT IS NULL 
AND ORDER_DT >= '20040902' 
AND ORDER_TYPE = '01' -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
AND ORDER_STS = '04' --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
==============================================================================================================

- Jobs 실행(매일 04시 30분) 
T_ORDER --> IIISHOP..IIISHOP.T_DEPEND_ORDER(MS-SQL --> Oralce)  
==============================================================================================================

- DCOM98.EXE 설치(win98에서 자동화 에러: -2147023067(80070725)) 
http://www.microsoft.com/downloads/details.aspx?FamilyID=08b1ac1b-7a11-43e8-b59d-0867f9bdda66&DisplayLang=en 
==============================================================================================================

- 윈도우 2000이상은 MDAC2.7이 기본적으로 깔려있습니다. 만약 WIn98에 깔아야 한다면 
인스톨 이전에 MDAC 2.7을 깔아야 되겠죠. 
----------------------------------------------------------------------------------------------- 

인스톨팩토리로 셋업파일을 만들었는데요. 
200,xp에서는 잘 되는데 98에서  
클래스가 자동화를 지원하지 않거나 예상되는 인터페이스를 지원하지 않습니다. 
이런 에러가 나서요..여기 게시판 검색해보니깐 
mdac2.7을 받아서 설치 하라고 해서 그렇케 했거든요. 
그랬더니 win98에서도 에러없이 잘 돌아갑니다. 

그런데 제가 궁금한건요. 
그럼 셋업 파일에 mdac2.7을 포함해야 하잖아여..? 
그래서 셋업파일을 다시 만들었는데...그래도 2.7버젼을 인스톨 못하네요. 
mdac 버젼 체크하는 프로그램으로 검색해보니 xp에 2.7버젼이 있길래 
mdac_type.exe을 복사해서 걸 셋업파일에 넣어줬거든요,. 

이렇케 하는거 아닌가여? 
아님 98에서 mdac2.7을 셋업시 같이 설치 해주려면 다른파일도 같이 넣어주는게 있나요? 
==============================================================================================================
  
MDAC 설치 프로그램이 작동하지만 MDAC가 올바로 설치되었는지 확인하는 방법이 있습니까?  
다음 문제 해결 테스트는 MDAC가 올바로 설치되었는지 확인하는 간단한 방법을 몇 가지 제공합니다.  
MDAC는 상호 종속적인 여러 DLL로 구성되어 있기 때문에 MDAC가 성공적으로 설치되었는지에 대한  
유일하고 진정한 테스트는 모든 구성 요소가 제대로 작동하는지 확인하는 응용 프로그램으로  
MDAC를 완벽하게 테스트하는 것입니다. 다음 테스트는 컴퓨터에 특정 응용 프로그램이 설치되어 있을 것을  
요구하지 않으므로 모든 시스템에서 MDAC 설치를 신속히 확인하는 데 유용합니다.  
먼저 ODBC 관리자가 작동하는지 확인합니다. 제어판을 열고 ODBC 데이터 원본 아이콘을 선택합니다.  
Windows 2000에서 제어판으로 이동하고 관리 도구를 선택하고 데이터 원본(ODBC)을 누릅니다.  
ODBC 데이터 원본 관리자라는 제목의 대화 상자가 나타납니다. 다음 단계를 통해 새 ODBC 데이터 원본을 만들어 봅니다.  
ODBC 관리자에서 시스템 DSN 탭을 선택합니다. 
추가를 눌러 새 ODBC 데이터 원본을 만듭니다. 
목록에서 Microsoft Access Driver(*.mdb)를 선택하고 마침을 누릅니다. 
데이터 원본 이름 입력란에 TEST를 입력합니다. 
만들기를 누릅니다. 
데이터베이스 이름 입력란에 C:\TEST.MDB를 입력하고 확인을 누릅니다.  
이제 데이터베이스가 성공적으로 만들어졌음을 나타내는 메시지 상자가 나타납니다. 확인을 누릅니다. 
확인을 다시 눌러 ODBC Microsoft Access 설정 대화 상자를 닫고 새 ODBC 데이터 원본을 만듭니다. 
그런 다음 확인을 눌러 ODBC 데이터 원본 관리자 대화 상자를 닫습니다. 
앞의 단계가 성공적으로 완료되면 ODBC 핵심 파일과 ODBC 관리자가 올바르게 설치됩니다.  
다음에 Microsoft 데이터 연결 파일을 만들고 다음 단계를 통해 앞에서 만든 TEST 데이터 원본에 대한 연결을 테스트합니다.  
컴퓨터의 바탕 화면을 마우스 오른쪽 단추로 누르고 새로 만들기 메뉴에서 Microsoft 데이터 연결을 선택합니다.  
이렇게 하면 바탕 화면에 "New Microsoft Data Link.udl"이라는 새 파일이 만들어집니다.  
Windows 2000에서 바탕 화면을 마우스 오른쪽 단추로 누르고 텍스트 파일을 만든 다음 Test.udl로 이름을 바꿉니다.  
이 파일을 두 번 눌러 데이터 연결 속성 대화 상자를 엽니다. 
데이터 원본 이름 사용 드롭 다운 상자에서 앞에서 만든 데이터 원본인 TEST를 선택합니다. 
연결 테스트 단추를 누릅니다. 이제 연결 테스트를 성공했습니다.라는 메시지 상자가 나타납니다. 
앞 단계가 성공적으로 완료되면 OLE DB와 ODBC는 물론 Access ODBC 드라이버의 테스트가 수행된 것입니다.  
==============================================================================================================

- 반품 수정(해결: 마감 다시 돌리기) 
09/02 0100012004083000487 --> 원주문번호(0100012004082500166) 
09/06 0100012004083000487 
------------------------------------------------------------------------------------------------ 

-- 마감 조회 @@@@@@@@@@@@@@  
SELECT * 
FROM T_MAGAM_MEIP 
WHERE  MAGAM_DATE = '20040902'  
    AND ENTR_NO = '45126' 
    AND RECEIVER_NM = '김미성' 
; 
==============================================================================================================
  
- stdole2.tlb 
C:\Program Files\Microsoft Visual Studio\Vfp98\Distrib.src\System 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.04(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 23:00  

- 정수기 개발
- JOBS 수정(MS-SQL) 
1. 주문상태(T_ORDER 테이블 ORDER_STS 에서) 
주문: 결재완료(03), 배송중(04)  --> 배송완료(09)  
반품: 반품접수(22) --> 물품회수완료(23) 
------------------------------------------------------------------------------------------------ 
2. 배송상태(T_ORDER_DTL 테이블 SHIP_STS 에서) 
주문: 배송대기(02)  --> 배송완료(09) 
반품: 물품회수대기(21) --> 물품회수완료(22) 
==============================================================================================================

- 본부영업관리/구매관리/발주대상상품 조회 
(/BizMgr/BuyingMgr/PlacingOrderMgr/tempPoEditUnityP.jsp)  ----> getRecomPoItemList() 
==============================================================================================================

- 피은지(beauty/3766) 
구매관리- 발주대상상품 조회- dep:960   업체코드:33011(참존 경산전문점) 
IMU를 -1~1로 수정하셔서 조회해보세요.... 
상품 가지수가 300개가넘는데 299개 밖에 조회가 안됩니다. 
---------------------------------------------------------------------------------------------------------------- 

- 컴파일 하기  
[root@iiishop_int BuyingMgr]$ ./build.sh BuyingMgr 
.jar 파일 생성됨(---> \\211.233.5.108\i3shop\component\ejb\BuyingMgr.jar 파일로 만들어 짐) 
\\211.233.5.108\websphere\installedApps\i3shop.ear 파일(BuyingMgr.jar) 붙여 넣기 
---------------------------------------------------------------------------------------------------------------- 

- 에러 
. [*Error] ejbModule/META-INF/ejb-jar.xml(엔터프라이즈 Bean: BuyingMgr): CHKJ2802E:  
<ejb-class> class com.i3shop.ejb.BizMgr.BuyingMgrBean, or one of its supertypes,  
cannot be reflected. Ensure that com.daco.util.BizMgrBase, and all of its dependencies,  
are included in the classpath. Shutting down workbench.   
---------------------------------------------------------------------------------------------------------------- 

- 해결(Bean 등록에서 BizMgr.jar 생성 실패) 
\\210.123.133.56\i3shop\lib\BizMgr.jar 복사  ----> 
\\211.233.5.108\i3shop\lib\BizMgr.jar 덮어 쓰기 
==============================================================================================================

-원 주문번호로 반품 주문번호 조회(0100012004060500508) 
 원 주문번호: 0100012004060500508 ---> 반품_주문번호: 0100012004093000285 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.05(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 정수기 개발
- Cron job 작업 
매일 오전 5시 30분에 정수기 마감 작업 실행 
-------------------------------------------------------------------------------------------------------------------

1. 주문상태(T_ORDER 테이블 ORDER_STS 에서) 
주문: 결재완료(03), 배송중(04)  --> 배송완료(09) 
반품: 반품접수(22) --> 물품회수완료(23) 
------------------------------------------------------------------------------------
2. 배송상태(T_ORDER_DTL 테이블 SHIP_STS 에서) 
주문: 배송대기(02)  --> 배송완료(09) 
반품: 물품회수대기(21) --> 물품회수완료(22) 
==============================================================================================================

- OZ 데이타 출력(오즈 출력) 
주간업무 보고(/BizMgr/ReportMgr/WeekleyReport/WeekleyReportP.jsp) 
로컬에서 수정 후 .100 OZ 서버에 넣어서 Test 작업(OZ_SERVER_IP: 211.233.5.100) 
-------------------------------------------------------------------------------------------------------------------

- 월별 매출 분석(전체매출) 
/MLM관리/분석관리/수당기준매장별 매출(/MlmMgr/AnalMgr/rptmagamstorep.jsp) 
2004년 09월 마감 매출현황 
R&F: 714,643,450    L&B: 5,361,148,090 총합: 1,403,658,770 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.06(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 정수기 개발
- cc_cExcelPrint.dll 소스 점검(win98에서 자동화 에러) 
comdlg32.ocx 
==============================================================================================================

-  회사 공지사항(LG 모바일) 
http://i3.1004.cc/bd/mobile/noticelist.asp?board_id=bdgfc1  
http://i3.1004.cc/bd/list.asp?board_id=bdgfc1 

MS-SQL DB서버(i3shop) 211.233.5.107(실제IP: 192.168.1.104)   sa/ckrladl 131004 
MS-SQL --> Client Network Utility  
TCP/IP: 211.233.5.107  기본포트(D): 1433 
==============================================================================================================

- 카드결재건 오류 
오류번호 [9999]라고 뜬대요... 
급한건이에요.. ^^;; 
------------------------------------------------------------------------------------ 

강형순   khs75 
9445-4200-0023-5048 [국민카드] 
9999 기타오류  ===>  
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ith3597/3597 02)2187-2778 윤정호 ---> 526-8328 안창석 
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596  
==============================================================================================================

- 가장 쉽게 하는 방법입니다. (저도 이런 방법으로 디버깅을 했죠.)   
1. EXE VBP를 연다. 
2. 프로젝트 추가에서 DLL VBP를 연다. 
3. 2번 작업이 끝나면 VBG라고 해서 VISUAL BASIC GROUP이라는 형태의 확장자가 만들어 집니다. 
4. F5를 눌러서 실행합니다. 
5. 끝~~!   
무지 쉽죠~!  ^^ 

이렇게 해서 DLL에 문제가 없다고 했을 때 DLL을 컴파일 합니다. 
이때 주의할 점은 프로젝트 속성에서  
구성요소 탭에서 버전호환성을 프로젝트 호환성으로 하셔야 한다는 겁니다. 
이유는 DLL은 CLSID라는 클래스 ID(유일한)를 생성하는데 기존꺼와 서로 호환을 시키기 위해서죠. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.07(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 @@@@@@@@@ 
- 회사 공지사항 목록  
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
===> http://i3.1004.cc/bd/mobile/noticelist.asp?from=1&count=10 
------------------------------------------------------------------------------------------------------------------- 

- 회사 공지 사항 상세 
http://test.mart.cc/mobile/noticeitem.jsp?index=1154 
===> http://i3.1004.cc/bd/mobile/noticeitem.asp?index=1154 
------------------------------------------------------------------------------------------------------------------- 

- 가상IP: 211.233.5.107(실제IP: 192.168.1.104) 
192.168.1.104 i3.1004.cc # I3SHOP 업무홈페이지 
==============================================================================================================

- 이전 데이타 이관 
0100012003110800033  송현진 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2004.10.08(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 반품 이중 마감 확인  @@@@@@@@@@   
(주)규수방 B0000702/4555(45146) 
20040915 정상 주문(i3shop R&F, 협력업체)  0100012004091500313  ====> 현금+카드입금 
20040923 반품(협력업체: 규수방이불세트) 0100012004092300108 --> 원주문번호(0100012004091500313)     
20041004 반품(i3shop R&F) 0100012004092300108 --> 원주문번호(0100012004091500313) 
----------------------------------------------------------------------------------------------------------------- 

IP: 210.123.133.125   ===> 218.50.33.98 
IP: 210.123.133.125   ===> IP: 210.123.133.125 
==============================================================================================================

- T_STOREOUT_DTL 테이블에서  
20040915에 주문을 하고 다시 반품을 치고 반품 출고일자(REAL_STOREOUT_DT)  20040915)로 됨 
220040923에 새벽에 출고일자(REAL_STOREOUT_DT)  20040923로 인식 마감을 돌림 ==> 반품 마감 생성 
20041004에 반품(i3shop R&F)으로 출고일자(REAL_STOREOUT_DT)  20041004로 수정함 
-----> 에러 해당 i3shop R&F만 출고일자 수정 해야 하는데 모든 상품에 출고 일자 수정 됨 
20041005에 새벽에 출고일자(REAL_STOREOUT_DT)  20041004로 인식 마감을 돌림 ==> 반품 마감 생성 
==============================================================================================================

- 반품 이중 마감 확인  @@@@@@@@@@ 
(주)규수방 B0000702/4555 
20040917 정상 주문(i3shop R&F, 협력업체) 0100012004091700141  ====> 현금입금 
20040920 반품(협력업체: 규수방이불세트) 0100012004092000076 --> 원주문번호(0100012004091700141) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20040920' 로 찍음 
20040923 반품(i3shop R&F) 0100012004092000076 --> 원주문번호(0100012004091700141) 
----------------------------------------------------------------------------------------------------------------- 

- T_STOREOUT_DTL 테이블에서  
20040917에 주문(i3shop R&F, 협력업체)을 하고 ====> 현금입금 
20040920에 반품(협력업체: 규수방이불세트)을 치고 출고일자(REAL_STOREOUT_DT)  20040920)로 됨 
20040921에 새벽에 출고일자(REAL_STOREOUT_DT)  20040920로 인식 마감을 돌림 ==> 반품 마감 생성 
20040922에 반품(i3shop R&F)으로 출고일자(REAL_STOREOUT_DT)  20040922로 수정함(현금 환불완료)  
-----> 에러 해당 i3shop R&F만 출고일자 수정 해야 하는데 모든 상품에 출고 일자 수정 됨 
20040923에 새벽에 반품 출고일자(REAL_STOREOUT_DT)  20040922로 인식 마감을 돌림 ==> 반품 마감 생성 
==============================================================================================================

- 반품 이중 마감 확인  @@@@@@@@@@ 
20040906 정상 주문(i3shop R&F, 협력업체) 0100012004090600869  ====>  현금+카드입금 
20040917 반품(협력업체) 0100012004091700314 --> 원주문번호(0100012004090600869) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20040917' 로 찍음 
20040930 최종 반품(i3shop R&F) 0100012004091700314 --> 원주문번호(0100012004090600869) 
==============================================================================================================

- 반품접수 내역(support.i3shop.com) 
/VendorMgr/ReturnItemMgr/orderDtlP.jsp 
0100012004100600292 --> 0100012004100401858  
String SQL = " begin PKG_ORDER_SALE_MODIFY.BACK_ALL_INSERT (  
'"+ p_company_cd +"', '"+ p_merchant_cd +"', '" + p_order_dt + "', '"+ p_order_no +"', '"+ p_up_id +"', '"+ p_up_ip +"', '' ); end; "; 
==============================================================================================================

- 반품 플로우 @@@@@@  --> (2004100800306 -- 200410080034
1. 주문 --> 
2. 반품 
A. 반품신청서 작성(/order/cancelOrderP_2.jsp)   ======> 쇼핑몰에서 회원이 작성 
T_ORDER TB 생성: ORDER_STS(21:반품신청) 
T_ORDER_DTL TB 생성 
T_RETURN_ITEM_REQ TB 생성 --> 
B. 반품신청서 작성(/BizMgr/SaleMgr/WebOrderMgr/returnItemReqEditP.jsp)   ======> 통합에서 담당자가 작성 
T_ORDER TB 생성: ORDER_STS(21:반품신청) 
T_ORDER_DTL TB 생성 
T_RETURN_ITEM_REQ TB 생성 --> 
  
3. 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
T_ORDER TB에서 ORDER_STS(21:반품신청 -> 22:반품주문)으로 변경 
T_ORDER_DTL TB에서 SHIP_STS(02:배송대기 -> 21:물품회수대기)으로 변경 --> 
% 반품 회수 하기 전에는 출고 정보 존재하지 않음(T_STOREOUT, T_STOREOUT_DTL) 
4. 반품 회수 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemWidthdrawP.jsp) 
String SQL = " begin PKG_ORDER_SALE_MODIFY.BACK_ALL_INSERT ( 
'"+ p_company_cd +"', '"+ p_merchant_cd +"', '" + p_order_dt + "', '"+ p_order_no +"', '"+ p_up_id +"', '"+ p_up_ip +"', '' ); end; "; 
T_STOREOUT_DTL  TB 에서 출고일자(REAL_STOREOUT_DT)가 20041008로 찍임 
T_STOREOUT TB 에서 출고완료일자(STOREOUT_END_DT)가 20041008로 찍임 
==============================================================================================================

- 반품 이중 마감 확인  @@@@ (주)규수방 B0000702/4555 
20041008 정상 주문(i3shop R&F, 협력업체) 0100012004100800306  ====>  현금입금 
20041001 반품 처리(협력업체):Support 0100012004100900114 --> 원주문번호(0100012004100800306)  
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20041001' 로 찍음 
T_ORDER_DTL TB에서 i3shop R&F  --> SHIP_DT(20041004) 협력업체  --> SHIP_DT(20040925) 
20041009 최종 반품(i3shop R&F):통합 0100012004100900114 --> 원주문번호(0100012004100800306) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20041009' 로 찍음 
==============================================================================================================

- 반품접수 내역(support.i3shop.com) 
/VendorMgr/ReturnItemMgr/orderDtlP.jsp 
0100012004100600292 --> 0100012004100401858  
String SQL = " begin PKG_ORDER_SALE_MODIFY.BACK_ALL_INSERT (  
'"+ p_company_cd +"', '"+ p_merchant_cd +"', '" + p_order_dt + "', '"+ p_order_no +"', '"+ p_up_id +"', '"+ p_up_ip +"', '' ); end; "; 
==============================================================================================================

- 반품 신청 관리 
/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp 
==============================================================================================================

- 반품 회수 관리(문제) 
BizMgr/SaleMgr/WebOrderMgr/returnItemWidthdrawP.jsp  
String SQL = " begin PKG_ORDER_SALE_MODIFY.BACK_ALL_INSERT ( 
'"+ p_company_cd +"', '"+ p_merchant_cd +"', '" + p_order_dt + "', '"+ p_order_no +"', '"+ p_up_id +"', '"+ p_up_ip +"', '' ); end; "; 
------------------------------------------------------------------------------------------------------------------------------

PROCEDURE BACK_ALL_INSERT( ) 
BEGIN 
BACK_SEQ_INSERT() 
END 

PROCEDURE BACK_SEQ_INSERT() 
BEGIN 
BACK_SEQ_INSERT() 
END 

PROCEDURE ORDER_SALE_INSERT() 
BEGIN 
UPDATE  T_STOREOUT_DTL A  SET  A.REAL_STOREOUT_DT   = V_INV_DATE  
END  
==============================================================================================================

-- 주문 후  배송 데이타 미존재 여부 조회 @@@@@@@@@@@@@ 
SELECT A.MAGAM_DATE, A.MERCHANT_CD, A.MAGAM_GUBUN, A.MEIP_GUBUN, A.ENTR_NO, A.MEIP_NO, A.ITEM_CD, 
A.ITEM_NM, A.QTY, A.MEIP_DANGA, A.RECEIVER_NM, A.RECEIVER_ADDR 
FROM T_MAGAM_MEIP A 
WHERE A.COMPANY_CD = '01' AND 
  A.MERCHANT_CD = '0001' AND 
A.MAGAM_GUBUN ='02' AND     --매감구분(01-정상-출고완료/입고완료 02:반품-회수완료/입고반품완료) 
A.MEIP_GUBUN ='01' AND      --매입구분(01:쇼핑몰판매 02:입고(마트/물류) 03:수수료상품판매) 
A.MAGAM_DATE >= '20040101' AND 
 ( 
   SELECT COUNT(*) FROM T_MAGAM_MEIP WHERE 
     COMPANY_CD = A.COMPANY_CD AND 
     MERCHANT_CD = A.MERCHANT_CD AND 
     MAGAM_GUBUN = A.MAGAM_GUBUN AND   --매감구분 
     MEIP_GUBUN = A.MEIP_GUBUN AND     --매입구분 
     MEIP_NO = A.MEIP_NO  AND          --매입번호 
     ITEM_CD = A.ITEM_CD 
     -- ENTR_NO = A.ENTR_NO AND         --거래처 코드 
     --SEQ_NO = A.SEQ_NO 
     --ITEM_CD = A.ITEM_CD 
  ) > 1 
ORDER BY A.MEIP_NO, ITEM_CD, A.MAGAM_DATE DESC 
; 
==============================================================================================================

- 반품 Test 데이타 삭제(원주문번호: 0100012004100800306) 
010001 20041008 00338 
010001 20041008 00319 
010001 20041009 00114 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.09(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 19:00 ==> 비 후 갬 

- 쇼핑몰 수정
- 반품 이중 마감 확인  @@@@@@@@@@ 
20040915 정상 주문(i3shop R&F, 협력업체)  0100012004091500313  ====> 현금+카드입금 
20040923 반품(협력업체: 규수방이불세트) 0100012004092300108 --> 원주문번호(0100012004091500313) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20040925' 로 찍음 
T_ORDER_DTL TB에서 i3shop R&F  --> SHIP_DT(20041004) 협력업체  --> SHIP_DT(20040925) 
20041004 최종 반품 0100012004092300108 --> 원주문번호(0100012004091500313)  
==============================================================================================================

- 반품 이중 마감 확인  @@@@@@@@@@ 
20040906 정상 주문(i3shop R&F, 협력업체) 0100012004090600869  ====>  현금+카드입금 
20040917 반품 처리(협력업체):Support 0100012004091700314 --> 원주문번호(0100012004090600869) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20040917' 로 찍음 
T_ORDER_DTL TB에서 i3shop R&F  --> SHIP_DT(20040930) 협력업체  --> SHIP_DT(20040917) 
20040930 최종 반품(i3shop R&F):통합 0100012004091700314 --> 원주문번호(0100012004090600869) 
==> 반품 REAL_STOREOUT_DT='20040930' 로 찍음 
==============================================================================================================

- 반품 이중 마감 확인  @@@@@@@@@@ 
20040917 정상 주문(i3shop R&F, 협력업체) 0100012004091700141  ====> 현금입금 
20040920 반품(i3shop R&F, 협력업체) 0100012004092000076 --> 원주문번호(0100012004091700141) 
==> 반품 생성과 동시에 REAL_STOREOUT_DT='20040920' 로 찍음 
T_ORDER_DTL TB에서 i3shop R&F  --> SHIP_DT(20040922) 협력업체  --> SHIP_DT(20040920) 
20040923 최종 반품 0100012004092000076 --> 원주문번호(0100012004091700141) 
==============================================================================================================

- 환불처리(현금) @@@@@@ 
/System/AclMgr/Refund/refundForCashMainP.jsp 
dlog("[/CartBean.java]:[addOrderMasterUP()]: [SQL] ====> \n "+ SQL); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.11(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- 이전 데이타 수정, 배송 메세지(TRANS_MESSAGE) 수정 
0100012004070800707  손금녀
0100012004020500825  도명숙 
==============================================================================================================

- 2개의 Command 사용  @@@@@@@@@@ 
If chkOrder_BaeUP.Value = 0 Then  '수정 체크가 안 되었으면 
cmdUpdate_Data.Caption = "이전데이타 UP" 
chkOrder_BaeUP.Enabled = True         
Else 
cmdUpdate_Data.Caption = "배송메세지 수정" 
chkOrder_BaeUP.Enabled = True 
End If 
==============================================================================================================

- 현금주문(입금은행 농협 추가) ===> 쇼핑몰 
은행 계좌(arInputS.jsp) 
SELECT * FROM T_ENTR_BANK_ACCOUNT 
WHERE COMPANY_CD= '01' 
AND WEB_USE_YN='R' --은행 종류(Y:일반은행, R:RnF은행) 
AND USE_YN= 'Y' 
==============================================================================================================

- 카드 일반 에러 
아이디 : ilju100426 BC 카드 ===> 에러: A1E 관리자에게 문의 
카드번호 9410 - 2540 - 0025 - 4530 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.12(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 통합 수정
- 반품 이중 마감 확인  @@@@@@@@@@
- 반품 Test 데이타 삭제(원주문번호: 0100012004100800306) 010001 20041008 00306 
010001 20041008 00338 
010001 20041008 00319 
010001 20041009 00114 
010001 20041012 00048 
010001 20041012 00116 --삭제 
==============================================================================================================

- 반품 Test 데이타 삭제(원주문번호: 0100012004101200179) 010001 20041012 00179  
010001 20041012 00184  --삭제 
010001 20041012 00308  --삭제  
010001 20041012 00312  --삭제 
리치앤 헬스(20041001) --> (주)규수방(20041002) --> i3shop R&F(20041012) 차례로 반품 회수 처리 
---------------------------------------------------------------------------------------------------------- -- 

- 반품 Test 데이타 삭제(원주문번호: 0100012004101200268) 010001 20041012 00268  
010001 20041012 00273  
리치앤 헬스(20041001) --> (주)규수방(20041002) --> i3shop R&F(20041012) 차례로 반품 회수 처리 
(주)규수방 B0000702/4555(45146)   -->  리치앤 헬스  : jubari /258079(45126) 
==============================================================================================================

- 반품 이중 마감 데이타 수정 @@@@@@@@@@ 
0100012004092300108 010001 20040923 00108 
마감일자: 20041004 마감일자: 20040925(수정) 

0100012004100500103 010001 20041005 00103 
마감일자: 20041008 마감일자: 20041005(수정) 
==============================================================================================================

- 완전 물품회수 안 된 데이타 조회  @@@@@@@@@@ 
20040721 00379 
20040910 00185 
20040916 00299 
20040924 00195 
20041005 00385 --> 20041013(최종 물품회수 완료) 
20041006 00292 --> 20041016(최종 물품회수 완료) 
==============================================================================================================

- 무통장 입금 은행 추가(농협) 
주문서 작성(/order/orderPutP_2.jsp) --> 창 띄우기(/popup/2004_popup/popup_panmaeja_gumae.html)  
==============================================================================================================

- PACKAGE 삭제 
DROP PACKAGE PKG_ORDER_SALE_MODIFY 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.18(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- /기초코드관리/거래처관리 @@@@@@@@@ 
- 현금주문(입금은행 농협 추가) ====> 쇼핑몰 --> 농협 756-01-023585 (주)아이쓰리샵 
SELECT * FROM T_ENTR_BANK_ACCOUNT 
WHERE COMPANY_CD= '01' 
AND WEB_USE_YN='R' --은행 종류(Y:일반은행, R:RnF은행) 
AND USE_YN= 'Y' 
==============================================================================================================

- B2B관리자 페이지(b2b/b2b) 
http://211.233.5.104:8080/admin/index3.asp 
==============================================================================================================

- I3SHOP 주문번호 하나에 산소수기 2개 주문된 것 
0100012003092800360 
==============================================================================================================

- DLL 디버깅 
(프로젝트 속성(E) --> 구성요소  --> 버전 호환성 --> 프로젝트 호환성(P)) 

다음과 같은 프로젝트에서 DLL 디버깅을 시작할 수 있습니다. 
DLL을 호출하는 실행 파일을 만드는 데 사용하는 프로젝트  
- 또는 -  
DLL을 만드는 데 사용하는 프로젝트  
실행 파일을 만드는 데 사용하는 프로젝트가 있으면 이 프로젝트에서 디버깅을 시작하십시오.  
그러면 실행 파일을 만드는 데 사용하는 프로젝트에 포함되지 않은 DLL이라도 소스 파일을 열고  
해당 파일에 중단점을 설정할 수 있습니다. 자세한 내용은 중단점을 참조하십시오. 

DLL을 만드는 데 사용하는 프로젝트에서 디버깅을 시작하는 경우에는 DLL 디버깅에 사용할 실행 파일을 지정해야 합니다 
==============================================================================================================

- 에러메세지:  430 런타임 오류 
클래스가 자동화를 지원하지 않거나 예상되는 인터페이스를 지원하지 않습니다.. 
====> DLL 정보가 빠져있는 오류입니다. DLL 정보를 참고하세요 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.19(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- 기초코드관리/거래처관리 @@@@@@@@@ 
- 현금주문(입금은행 농협 추가) ====> 쇼핑몰 --> 농협 756-01-023585 (주)아이쓰리샵 
SELECT * FROM T_ENTR_BANK_ACCOUNT 
WHERE COMPANY_CD= '01' 
AND WEB_USE_YN='R' --은행 종류(Y:일반은행, R:RnF은행) 
AND USE_YN= 'Y' 
==============================================================================================================

- 정수기 개발
- 이관 데이타 주소변경 @@@@@  
COPY_TO_INPUT_BY_ORDER() 
checkCH_Addr 이전 데이타 주소변경 여부 check 
ADDR_CH_YN 이전 데이타 주소변경 여부 
==============================================================================================================

-- 회원정보 조회 @@@@@@@@@@@@@ 
SELECT * 
FROM T_MEMBER 
WHERE MNO = '645766'          --회원번호 
  AND MEM_NM LIKE '%김석순%'  --회원명(김석순--> 김선순 / HP)016-299-5514) 
  --WHERE MEM_ID = 'ohs97'      --회원ID 
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.20(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 정수기 개발
- 발주서 작성 
발주관리 개발 
--------------------------------------------------------------------------------------------------------- 

- 후레쉬워터 연락처 
031)763-2573 김교혁 
==============================================================================================================

- 쇼핑몰 수정
- 회원 가입시 회원명 잘못 기입 
--회원정보 조회 @@@@@@@@@@@@@ 
SELECT * 
FROM T_MEMBER 
WHERE MNO = '645766'           -- 회원번호 
  AND MEM_NM LIKE '%김석순%'   -- 회원명(김석순 --> 김선순 / HP)016-299-5514) 
; 
--------------------------------------------------------------------------------------------------------------- 

-- 주문 정보 수정 ==> 회원 가입시 회원명 잘못 기입 @@@@@@@@@@@@@@@@@ 
UPDATE T_ORDER 
SET MEM_NM ='김선순', RESELLER_NM ='김선순', 
RECEIVER_NM ='김선순' 
WHERE COMPANY_CD = '01' 
	AND MERCHANT_CD = '0001' 
	AND MNO = '645766'  
; 
==============================================================================================================
  
- eclipse 에러 
Remote Method 호출 에러입니다. 
com.evermind.server.rmi.OrionRemoteException: java.lang.NoClassDefFoundError:  
com/i3shop/dao/MisMgr/OverTimeDAO; nested exception is:  
java.lang.NoClassDefFoundError: com/i3shop/dao/MisMgr/OverTimeDAO 
--------------------------------------------------------------------------------------------------------------- 

- 해결책: 
eclipse에서   
/i3shop_BizMgr/common_mis/src 오른쪽 클릭해서  
내보내기 -> jar 파일 
로컬 PC C:\Project\intLib에 내보냄 
로컬 PC :\orion_int\lib\MisMgr.jar에 내보냄 
MisMgr.jar 생성(복사)  
==============================================================================================================

- MS-SQL 삭제 테이블 삭제(FOREIGN 키로 연결 되었을 때) 
 삭제(D) --> Show Dependencies 
Object: T_ENTER 
Objects that T_ENTER depend on: T_PO 
Show first level dependency only --> 체크 해제 
==============================================================================================================
 EX> 
1. FOREIGN KEY 생성 
alter table slimtable_log add 
Constraint FK_slimtable_log Foreign Key(id) References slimtable(id) 
2. FOREIGN KEY 지우기. 
2-1. ALTER TABLE SLIMTABLE_LOG DROP 
COMSTRAINT FK_SLIMTABLE_LOG  -- CONSTRAINT 해제 
2-2. ALTER TABLE SLIMTABLE_LOG DROP COLUMN ID 

전 이렇게 하면 FOREIGN KEY로 지정된 COLUMN이 지워지더라구여.. 
==============================================================================================================

2-1. ALTER TABLE T_DELIVERY DROP 
COMSTRAINT FK_SLIMTABLE_LOG  -- CONSTRAINT 해제 

MSSQL 2000은 foreign key에서... 
 Constraint fk_out_dt_fk1    Foreign Key (out_ymd, out_seq) References tr_out (out_ymd, out_seq) 
     On Delete Cascade  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.21(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음 

- 정수기 개발
- 이전 데이타 T_ORDER TB에 추가 하기 
- 날짜 변경(MS-SQL에서) 
CONVERT(VARCHAR(4), CONVERT(char(10),INSTALL_DT,120)) + '' + 
RIGHT('00'+ Cast(MONTH(CONVERT(char(10),INSTALL_DT,120)) as varChar),2) + '' + --[00 2자리 날짜 맞추기] 
RIGHT('00'+ Cast(DAY(CONVERT(char(10),INSTALL_DT,120)) as varChar),2) AS INSTALL_DT, -- 설치일자(20040826) 
---------------------------------------------------------------------------------------------------------------------------

-- 주문번호가 같은 정상주문, 이전 데이타 수정 @@@@@@ 
-- UPDATE T_ORDER 
SET INSTALL_STS = '04',  --설치상태(04:설치) 
    INSTALL_DT =  CONVERT(VARCHAR(4), CONVERT(char(10), B.INSTALL_DT,120)) + '' + 
RIGHT('00'+ Cast(MONTH(CONVERT(char(10), B.INSTALL_DT,120)) as varChar),2) + '' + 
RIGHT('00'+ Cast(DAY(CONVERT(char(10), B.INSTALL_DT,120)) as varChar),2),   -- 설치일자 
    ORDER_STS = '04'    --발주상태(04:설치완료) 
FROM T_ORDER A, T_A_PRE_DATA_ORDER B 
WHERE A.RETURN_DT IS NULL 
    AND A.I3SHOP_ORDER_NO = B.I3SHOP_ORDER_NO 
    AND A.ORDER_TYPE IN ('01')         -- 주문구분(01:설치)  
    AND B.INSTALL_DT IS NOT NULL 
; 
==============================================================================================================

- T_A_PRE_DATA_ORDER: 이전 데이타 TB 
산소수기_(order_01).xls 파일에서 
배송일, 설치일, S/N 3개 수정하는데 
S/N는 번호가 없으면 덮어쓰기 하지 말라는 거 맞죠? 
--------------------------------------------------------------------------------------------------------------- 

- T_A_PRE_DATA_PRO: 프로모션 TB  ===> 636건 조회 
산소수기_(Promotion).xls 파일에서 
배송일, 설치일 2개 수정하는데 
우편번호, 수령주소 비교해서 수정하라는 거 맞죠? 
--------------------------------------------------------------------------------------------------------------- 

- 프로모션 DATA 확인 @@@@@@   ===========> 권완섭
-- 배송일자가 존재하는 것 조회 @@@@@@  ===> 615 건 @@@@@ 
SELECT A.I3SHOP_ORDER_NO, A.ORDER_DT, A.ORDER_NM, A.ORDER_SSN, A.PRDT_SEQ_NO, A.ENTR_NO, 
     A.ORDER_TYPE,      -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체) 
     A.ORDER_STS,      --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관[20040831 이전DATA], 04:설치완료) 
A.DELIVER_STS, B.DELIVER_DT, A.DELIVER_DT,     --배송상태(01:처리보류 02:설치완료, 03:미설치, 04:설치) 
A.INSTALL_STS, B.INSTALL_DT, A.INSTALL_DT,    --설치상태(01:처리보류 02:설치완료, 03:미설치, 04:설치) 
A.I3SHOP_ITEM_NM, A.CASH_DT, A.REG_DT 
FROM T_ORDER A, T_A_PRE_DATA_PRO B 
WHERE A.RETURN_DT IS NULL 
    AND A.ORDER_SSN = B.ORDER_SSN      --주민번호 
    AND A.ORDER_TYPE IN ('01')         -- 주문구분(01:설치) 
    --AND A.ORDER_STS = '04'             --발주상태(04:설치완료) 
    AND SUBSTRING(A.I3SHOP_ORDER_NO, 15, 2) ='11'     -- 주문번호('11'이면 포로모션 껀으로 인식) 
==============================================================================================================

- 쇼핑몰 수정
- 엔터테인먼트 
웹 플로(동호회, 일정관리, 메일, 자유 게시판) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.22(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 맑음 

- 정수기 개발
- 이전 데이타 프로모션 TB 추가하기 
- 이관 데이타 수령자명, 수령자전화, 수령자H/P 수정 가능으로 수정 
==============================================================================================================

- 쇼핑몰 수정
- 엔터테인먼트 
웹 플로(동호회, 일정관리, 메일, 자유 게시판) 
개선 제안: 채팅룸, 앨범 추가, 자료실, 우리 동호회 선정 발표(매주)  
==============================================================================================================

-  ** 이명자    lmj7  ( 벌써 3번째 전화임... ) 
신용카드결재가 안된다고함.  
BC 카드 사용/ 카드번호 : 9410213235945619    
정상적으로 isp를 등록을했고... 
카드사로 카드 확인했고 전혀 이상이 없다고했다함. 
isp다운받고 비번까지 다 넣어도 여전히 다시 처음 원상태로 돌아간다고함.  
확인후 연락요망함.     * / 이명자 
20040819 00294 
==============================================================================================================
  
- 테스트 삭제 
주분번호: 010001-2004102200159 
반품: 0100012004102200172 
현대카드: 4028570127984005  
==============================================================================================================

- 박구락 
 0100012004021201965 
==============================================================================================================

- 시티은행 마스터 카드 =====> 조회할 수 없는 카드 
카드번호 : 8485 9601 8395 9004 8485960183959004 
==============================================================================================================

- SMS 개발  @@@@@@@@@ 
(주)인포뱅크주식회사 http://www.infobank.net 
영업담당자 : 정재우, 2189-1434 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.23(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 ==> 맑음 

- 정수기 개발
- 반품 주문 조회에서 제외(주문구분에서만 조회 가능) 
정상: 0100012004102200070 
반품: 0100012003092401264(정상 주문번호 보여주기 --> 0100012004102200070) 
----------------------------------------------------------------------------------------------------------------- 

- 반품 총: 485 개 
정상, 반품 2개 존재: 24개 존재 
권완섭 0100012004091300232  0100012004091300232 
이덕중 0100012003101001876  0100012004091300346 정찬목 0100012003120901738  0100012004101400126  
==============================================================================================================

- 쇼핑몰 수정
- 엔터테인먼트 웹 플로 
웹 플로(동호회, 일정관리, 메일, 자유 게시판) 
개선 제안: 채팅룸, 앨범 추가, 자료실, 우리 동호회 선정 발표(매주)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.10.26(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 

- 정수기 개발
010001-2004101900164 
그리구 이건은 반품도 아닌데, 전산에 등록이 안되어 잇네요... 
제가 잘못 찾은 건지...요건도 같이 확인부탁드릴게요~~  
 ==============================================================================================================

- 주문번호 미확인 건 수정 
주/수: 이숙현 
서울시 서초구 잠원동 롯데캐슬아파트 105동1301호 
누수건... 물이 넘친다하심... 
확인후 빠른방문 요망... 
연락처: 02-3478-1364 
* 
==============================================================================================================

- 쇼핑몰 수정
결제방법이 R&F머니(04) 이면서 마감일자가 없는 것 
20040906 이후(19건) --> 정수기인 껀 1건(010001-2004101900164) 
==============================================================================================================

- 반품 주문번호: 0100012004100900114 번 맞구요.. 대금정산에 나옵니다. 
support >  B0000702/4555 
==============================================================================================================

- 공인인증서 결제(/raadmin_pay2.jsp --> /raadmin_pay3.jsp)  
김선주(suny79025) *-2535629   ===> 집전화 번호 미기입 
---------------------------------------------------------------------------------------------- 

 - A1E  
[에러코드] : A2G [에러메세지] : [200410261834380802][에러코드] : A2E [에러메세지] : [200410261834380802] 
[에러코드] : A2G [에러메세지] : [200410261834380802] 
시스템 에러입니다. 
관리자에게 문의하십시요.  
==============================================================================================================

- 김성숙(woochan26) 
카드번호 : 9410-4772-7413-6014 국민카드  
→ 이 카드로 공인인증을 센터로 받기위해서  
결재금액 2200원을 결제 할려니 에러코드 A12라고 나온다하심. 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
