

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.11.01(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 오후에 비 

- 정수기 개발
- 후레쉬워터 연락처 
031) 763-2573 김교혁(*@*.*) 
--------------------------------------------------------------------------------------------------------------------- 

1. A/S자재에 대한 코드번호 
2. 과거 고객 자료 
==============================================================================================================

- 통합 수정
- 재고 실사서 작성(BizMgr/ItemStockMgr/stockInquiryByLocationP.jsp) 
물류 - 조의재 대리(euijae1970/700420), 백환일 주임(bhi/1234) 
dlog("[temStockMgrBean.java]:[getStockInquiryTempList]"+ SQL +"<br>"); 
==============================================================================================================

- 카드깡 @@@@@@@@@@@ 
카드한도가 100만원이라고 가정하면(계산편하게) 
현금은 못 빼지만(이미다쓴경우가 대부분), 상품은 살수 있다는 겁니다. 
이것을 이용해서 사채업자들이 상품을 살수있는 금액만큼  
가짜로 물건을 산것처럼 하여서 카드결제를 신청합니다. 
실제 물건을 구입하지는 않았지만 물건을 구입한것처럼 매출을 만들고 
그것을 그 업소에서는 매출전표를 카드회사에 청구한다. 
카드 주인에게는 일정수수료를 제외한 나머지 금액을 현금으로 주는 거죠. 
그렇게 되면 카드주인은 100만원을 카드사에 갚아야하고 
실제 받는 돈은 80~89만원정도를 받게 됩니다. 
----------------------------------------------------------------------------------------------------------

- 카드깡 
유령 허위 매출전표 발행(100만원)--> 카드 주인(즉시 80~85만원 받음)  
--> 카드깡 업자(카드사에 100만원 청구: 3-4일후에 입금) 
---------------------------------------------------------------------------------------------------------- 

- 인터넷 카드깡 @@@@@@@@@@@ 
카드를 이용한 사채라는 점은 종전의 카드깡과 같으나, 인터넷 쇼핑몰이 카드 매출 전표상에 판매자로 되고,  
카드 대금도 수령하기 때문에, 카드깡 업자는 위장 가맹점이 필요없고, 허위의 매출전표를 작성할 필요도 없다.  
---------------------------------------------------------------------------------------------------------- 

우선 인터넷 쇼핑몰 운영자들이 보유한 고객 리스트를 통해 인터넷 카드깡의 의심이 있는 
거래에 대한 자체 감독을 강화해야 한다.  
동일한 시간에 물건을 다량 주문하거나, 이름이 서로 다른 고객의 휴대폰 번호가 같은 경우, 
카드를 발급 받고 처음 사는 물건이 상품권인 경우에는 쇼핑몰 운영자들은 일단 경계하여야 하는 것이다. 
==============================================================================================================

- [10월 마감]
2004년 10월 마감 매출현황 
RNF_당월 RNF_전월 LNB_당월 LNB_전월 I3MART_ON_당월 I3MART_ON_전월 일별누계_당월 일별누계_전월 
1638301176 882416010 446518580 534263590 175836350 162085350 2260656106 1578764950 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.02(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 흐림 

- 정수기 개발
- 발주 입고 검수(/BizMgr/DeliveryMgr/StoreIn/storeinCheckP.jsp) 
1. 입고(T_STOREIN) 등록 
2. 입고처리후 해당  점별 재고 수량을 변경 조정 
-- PKG_STOCK_MODIFY.PKG_RECV_STOCK_UPDATE  --> 사용 안 함 
다음날 크론잡(day_subul_cron.sh)으로 실행 
CALL PKG_SUBUL_MAGAM.DAY_SUBUL_INSERT('') 
==============================================================================================================

- [도원 방문]  
---> 10:30 ~ 16:00
---------------------------------------------------------------------------------------------------------- 

- 정수기 관련 회의(발주서 사용 안 함) 
입고(T_STOREIN), 출고 
김근배 과장, 김차규 주임 H.P)011-9635-5695 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.03(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 ==> 흐림 

- 정수기 개발
- 발주 입고 검수(/BizMgr/DeliveryMgr/StoreIn/storeinCheckP.jsp) 
1. 입고(T_STOREIN) 등록 
2. 입고처리후 해당  점별 재고 수량을 변경 조정 
-- PKG_STOCK_MODIFY.PKG_RECV_STOCK_UPDATE  --> 사용 안 함 
다음날 크론잡(day_subul_cron.sh)으로 실행 
CALL PKG_SUBUL_MAGAM.DAY_SUBUL_INSERT('') 
---------------------------------------------------------------------------------------------------------- 

- 정수기 필터:  
00142158: 세디멘트필터(1차)+프리카본필터(2차) 
00142159: 항균/UF중공사막필터(3차) 
00142160: 포스트카본필터(4차)+ 항균카트리지 
---------------------------------------------------------------------------------------------------------- 

-- 정수기 필터 재고 조회 @@@@@@@@@@@ 
SELECT MERCHANT_CD, ITEM_CD, 
       NOW_STOCK    --현재고(장부재고) 
FROM T_MERCHANT_ITEM 
WHERE ITEM_CD IN ('00142158', '00142159', '00142160') 
      AND MERCHANT_CD ='9001'   --점명(9001:자인물류) 
; 

-- 수불장 정수기 필터 재고 조회 @@@@@@@@@@@ 
SELECT JEGO_QTY 
FROM T_DAY_SUBUL 
WHERE COMPANY_CD = '01'  
AND MERCHANT_CD = '9001'  
AND SUBUL_DATE = '20041102'  
AND ITEM_CD IN ('00142158', '00142159', '00142160') 
; 
==============================================================================================================

- 통합 수정
- 재고 조정 등록(/BizMgr/ItemStockMgr/stockAdjustMainP.jsp) 
물류 - 조의재 대리(euijae1970/700420), 백환일 주임(bhi/1234) 
조정 메모 : 52in산소수기 필터 발주 착오(판매단위)로 인한 재고 조정 
00150025  (발)세디먼트필터(1차)    -120 
00150026  (발)프리카본필터(2차)    -120 
00150027  (발)향균 UF필터             -60 
00150028  (발)포스트 카본 필터      -60 
00150029  (발)향균 카트리지          -60 
00142158  세디먼트필터(1차)+프리카본필터(2차)   119 
00142159  향균/UF중공사막 필터 61 
00142160  포스트 카본 필터(4차)+향균 카트리지    58    
==============================================================================================================
  
[에러코드]91E 
TRNS-50015 
---------------------------------------------------------------------------------------------------------- 

if( p_adjust_dt == null  p_adjust_dt.equals("") ) 
errorMsg.append("[p_adjust_dt:조정일자] "); 
if( p_adjust_cl_cd == null  p_adjust_cl_cd.equals("") ) 
errorMsg.append("[p_adjust_cl_cd:재고조정분류코드] "); 

if( errorMsg.length() > 0 ) 
throw new Err("9", "1", "E", errorMsg + "는 필수입력항목입니다."); 
==============================================================================================================

- 페이지 설정(pageListingReport) 
WeeklySupplies관리(/BizMgr/ItemStockMgr/WeeklySuppliesP.jsp) 
검품장(211.33.193.129), 조의재 대리(211.33.193.167) --> pwd: i3shop2004 
==============================================================================================================

-- 로그 분석 @@@@@@@@@@ 
[root@iiishop_int logs]# pwd 
/opt/WebSphere/AppServer/logs 
[root@iiishop_int logs]# tail -f Default_Server_stdout.log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.04(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 

- 통합 수정
- 총합계 조회 추가 
WeeklySupplies관리(/BizMgr/ItemStockMgr/WeeklySuppliesP.jsp) 
	function searchDataSet( dataSet, parentUrl, p_page) { 
		if( p_page < 2 ) {  //페이지수가 1 인 경우만  총합계 조회  
		DS_report_total.DataID =  parentUrl2; 
		DS_report_total.reset(); 
	} 
</script> 
==============================================================================================================

- 재고 조정 등록(/BizMgr/ItemStockMgr/stockAdjustMainP.jsp) 
- 에러(p_adjust_dt, p_adjust_cl_cd 데이타 가져오지 못 함) 
4b589f71 ExceptionUtil X CNTR0020E: Bean BeanId(i3shop#ItemStockMgr.jar#ItemStockMgr, null)에서  
메소드 addStockAdjust을(를) 처리하는 중에 비 응용프로그램 예외가 발생했습니다: [에러코드] : 91E 
[에러메세지] : [p_adjust_dt:조정일자] [p_adjust_cl_cd:재고조정분류코드] 는 필수입력항목입니다. 
-------------------------------------------------------------------------------------------------------------------- 

- 해결책 
- stockAdjustMainP.jsp 에서 @@@@@@@@@@ 
<script> 
	<%-- 저장 버튼 action --%> 
	function saveAction() { 
	if( validateForm() ) { 
	//재고조정상태 입력 [01:재고조정등록] 
	editForm.p_adjust_sts.value="01" 
	//재고조정분류 입력 [02:수기등록] 
	editForm.p_adjust_cl_cd.value="02" 
	if( DS_stockAdjustDtl.CountRow > 0 ){ 
	doPost(); 
	}else { 
	alert("등록할 상품이 없습니다."); 
	} 
	} 
	} 
</script> 

<object id="TR_stockAdjust" classid="<%= CLASSID_TOINB_TR %>" 
	codebase="<%= CD_TOINB_TR %>"> 
	<param name="ServerIP"  value=""> 
	<param name="KeyName"   value="Toinb_dataid4"> 
	<param name="KeyValue"  value="JSP(I:stockAdjust=DS_stockAdjust, I:stockAdjustDtl=DS_stockAdjustDtl)"> 
	<param name="Action"    value="./stockAdjustMainS.jsp?p_adjust_dt=<%=TODAY%>&p_adjust_cl_cd=02">    //p_adjust_dt, p_adjust_cl_cd 추가 
	<param name="Protocol"  value="1"> 
</object> 
------------------------------------------------------------------------------------------------------ ---- 

- stockAdjustMainS.jsp 에서 @@@@@@@@@@ 
inputHash.put( "p_mode", "new" ); 
//inputHash.put( "p_adjust_dt", rows[i].getString(idx_adjust_dt) ); //조정일자 
//inputHash.put( "p_adjust_cl_cd", rows[i].getString(idx_adjust_cl_cd) ); //재고조정 분류코드 

String p_adjust_dt = request.getParameter("p_adjust_dt"); //조정일자 
String p_adjust_cl_cd = request.getParameter("p_adjust_cl_cd"); //재고조정 분류코드 
inputHash.put( "p_adjust_dt", p_adjust_dt); 
inputHash.put( "p_adjust_cl_cd", p_adjust_cl_cd); 
==============================================================================================================

- 국민카드 승인 에러 
기타오류(9999)  ===> 2건 오류 사유 
vipmart/구영모 SM * 
==============================================================================================================

- 페이지 설정(pageListingReport) 
피은지(beauty/3766) 
발주대상상품 조회 (/BizMgr/BuyingMgr/PlacingOrderMgr/tempPoEditUnityP.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.05(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 

- 통합 수정
- 페이지 설정(pageListingReport) 
피은지(beauty/3766) 
발주대상상품 조회 (/BizMgr/BuyingMgr/PlacingOrderMgr/tempPoEditUnityP.jsp) 
-------------------------------------------------------------------------------------------------------------- 

- Vector를 String으로 수정 @@@@@@@@@@ 
0001, 9001 --> '0001', '9001' 
-------------------------------------------------------------------------------------------------------------- 

Vector strVect = (Vector)itemStsVect; 
//=================// Vector of String .. 을 ','로 구분된 sql 문자열로 전환  //======================== 
if( strVect == null  strVect.size() < 1 )  
throw new Exception("상품상태가  지정되지 않았습니다."); 

StringBuffer strBuf = new StringBuffer(); 
for( Iterator it = strVect.iterator(); it.hasNext(); ) { 
String tmpStr = (String)it.next(); 
strBuf.append("'").append(tmpStr).append("'"); 
if( it.hasNext() ) 
strBuf.append(", "); 
}  
itemStsListStr =  strBuf.toString(); 
==============================================================================================================

- 쇼핑몰 문구 수정 
"로그인을 안하셨거나 현재직급에서는 사용할 수 없는 카테고리입니다." ---> 
"이 카테고리는 노블레스 관리자모드로 로그인 하셔야 사용할 수 있습니다. "  
/display/main/b2b/mainP.jsp /main_tpl/top.jsp 
----------------------------------------------------------------------- 

strlocation = "/display/prdlist/tpl/type"+p_display_cd+"/itemListP.jsp";  
<param name="Action"     value="./tempPoEditUnityB.jsp?p_page=2&p_pagerow=20"> 
<param name="Action"     value="./tempPoEditUnityB.jsp?p_page="+ p_page +"&p_pagerow="+ p_pagerow"> 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.11.06(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:30 ==> 맑음 

- 통합 수정
- 페이지 설정(pageListingReport) 
피은지(beauty/3766) 
발주대상상품 조회 (/BizMgr/BuyingMgr/PlacingOrderMgr/tempPoEditUnityP.jsp) 
------------------------------------------------------------------------------------------------------------------------

- split 에러 
//=================// 점명 , 제거 split  //================================ 
String ArrTemp[] = p_merchant.split("[,]"); 

int ArrTemp_count = ArrTemp.length; //배열의 개수 -1 배열 0은 ""값 

if(ArrTemp_count == 1) { // 점명하면   
merchantStr1 = p_merchant; 
merchantListStr = "'"+ merchantStr1 +"'" ; 
} else {    
if(ArrTemp_count >= 1) { 
merchantStr1 = ArrTemp[0]; merchantListStr = "'"+ merchantStr1 +"'" ;} 
if(ArrTemp_count >= 2) { 
merchantStr2 = ArrTemp[1]; 
merchantListStr = "'"+ merchantStr1 +"', '"+ merchantStr2 +"'"  ; 
} 
if(ArrTemp_count >= 3) { 
merchantStr3 = ArrTemp[2]; 
merchantListStr = "'"+ merchantStr1 +"', '"+ merchantStr2 +"', '"+ merchantStr3 +"'"   ; 
} 
if(ArrTemp_count >= 4) { 
merchantStr4 = ArrTemp[3]; 
merchantListStr = "'"+ merchantStr1 +"', '"+ merchantStr2 +"', '"+ merchantStr3 +"', '"+ merchantStr4 +"'"    ; 
} 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.08(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 ==> 맑음 

- 통합 수정
- 가우스 메모리 부족 에러  --> 거래처: 동진 
- 거래처 세금계산서 관리 수정(/BizMgr/Remittance/EntrTaxAccountP.jsp) 
==============================================================================================================
  
- 이승미(lslmall)  회원번호 653922 
8900 CAVV데이터오류(ISP결제 오류) 
9420114039248655(BC카드) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.09(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 ==> 맑음 

- 통합 수정
- 가우스 메모리 부족 에러  --> 거래처: 동진 
- 거래처 세금계산서 관리 수정(/BizMgr/Remittance/EntrTaxAccountP.jsp) 
페이지 달기 
==============================================================================================================
  
- 상품 마스터 삭제 오류 
상품을 판매상태(05:DELETE) 바꾼 후 삭제해야 함) 
00150025 (발)세디멘트필터(1차) 
00150026 (발)프리카본필터(2차) 
00150027 (발)향균 UF 필터 
00150028 (발)포스트카본필터 
00150029 (발)향균 카트리지 
==============================================================================================================

- 삼성카드 재사용 조건 수정 
1. 최대 3개월 할부 
2. 두당 월 130만 한도 
삼성카드 사용 정보(T_CARD_SS) 테이블 생성 
/order/orderPutP_2.jsp 
addOrderAr_SS 
----------------------------------------------------------------------------------------------------------------- 

- 테스트 데이타 삭제 @@@@@@@@ 
0100012004110900419 
010001-20041109 00422 
010001-20041109 00435 
010001-20041109 00447 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.10(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30 밤에 소나기 

- 쇼핑몰 수정
- 삼성카드 재사용 조건 수정 
1. 최대 3개월 할부 
2. 두당 월 130만 한도
/order/orderPutP_2.jsp 
getSSCardInfo() //삼성카드 사용 정보 조회 
addOrderAr_SS() //삼성카드 사용 정보 입력 
----------------------------------------------------------------------------------------------------------------- 

- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama339 
200902/9597 
CVC: 891 
640712 - 1703812 
----------------------------------------------------------------------------------------------------------------- 

- 삼성카드(김진혁 대리)  =============> 
4009 1311 0196 9729(4009131101969729) kyeogie1 
200906/0159 
CVC: 362 
720720 - 1797816 
반품--> 카드 승인 취소(매입 후 삼성카드 3일 --> 5일 걸림) 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- 통합 수정
- 환불처리(카드)(/System/AclMgr/Refund/refundForCardMainP.jsp) 
/AclMgrBean.java --> updateRefundForCard()  -----> //삼성카드 사용 정보 수정(환불 -> 결제 취소) 
==============================================================================================================

- 테스트 데이타 삭제 @@@@@@@@ 
010001-2004111000089 
010001-2004111000090 
010001-2004111000129 
010001-2004111000266 
010001-2004111000267 
010001-2004111000268  -----> 
010001-2004111000273 

010001-20041110 00278   -----> 반품(01000120041110 00279) ======> 삭제 
010001-20041110 00436  -----> 반품(01000120041110 00447) ======> 삭제 
010001-20041110 00430  -----> 반품(01000120041110 00497) ======> 삭제 
010001-20041110 00426  -----> 반품(01000120041110 00530)  ======> 취소 안함  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.11(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 22:30 ==> 구름 많음 

- 쇼핑몰 수정
- 삼성카드 재사용 조건 수정 
1. 최대 3개월 할부 
2. 두당 월 130만 한도 
/order/orderPutP_2.jsp 
getSSCardInfo() //삼성카드 사용 정보 조회 
addOrderAr_SS() //삼성카드 사용 정보 입력 
---------------------------------------------------------------------------------------------------

- 현금+카드 결제 @@@@@@@@ 
 카드 결제를 해야만 주문이 가능 
 추후 무통장입금을 하면 결제완료(03:결제완료)가 됨 
--------------------------------------------------------------------------------------------------- 

- addOrderAr_SS() //삼성카드 사용 정보 입력 =====>  
중복 입력(INSERT) =====> 시제유형 코드가 결제인 것만 입력 
java.sql.SQLException: ORA-00001: unique constraint (IIISHOP.SYS_C0012470) violated 
PRIMARY KEY ( COMPANY_CD, MERCHANT_CD, ORDER_DT, ORDER_NO ) ); 

010001-20041111 00377     
010001-20041111 00379    -----> 반품(01000120041110 00530)  ======> 삭제   
010001-20041111 00396    -----> 반품(01000120041110 00530)  ======> 삭제   

010001-20041110 00026  ======> 삭제 
010001-20041110 00029  ======> 삭제 
010001-20041110 00426  -----> 반품(01000120041110 00530)  ======> 삭제 
010001-20041111 00377    -----> 반품(01000120041111 00407)  ======> 삭제   
==============================================================================================================

- [통합 수정]  
- 환불처리(카드)(/System/AclMgr/Refund/refundForCardMainP.jsp) 
/AclMgrBean.java --> updateRefundForCard()  -----> //삼성카드 사용 정보 수정(환불 -> 결제 취소) 
==============================================================================================================

 -- 신용카드 에러 @@@@ 
황유진    hwangee 
국민카드결제를 하는데 자꾸 승인실패라고 뜬다고 문의하세요. 
에러메세지 확인부탁드릴께요..  
국민카드 : 5409 8867 2924 1016 

원인: 결제서버 연결실패  --> 108번 서버 카드데몬 재시동 안되어 있음 
해결책: 카드데몬 재시동 
]# cd /opt/payment/nice/ 
]# ./nice_demon --안심 데몬과 같이 사용 
]# ./isp_demon --ISP 데몬 
]# ps -ef  grep nice --데몬이 살아 있는 지 확인 
]# ps -ef  grep isp --데몬이 살아 있는 지 확인 
==============================================================================================================

*** 신지은   kissesting 
엘지카드카드사용... 결제가 안된다고함.  
안심클릭등록하고 타사이트에서는 사용을했다고함...  
오류메세지 : 카드인증실패라고 확인됨 
* 카드번호 : 4009061583265041  

원인: 안심 데몬이 이전 버전으로 올라가 있음 
해결책: 안심 데몬 새 버전으로 다시 올리기  
]# ./nice_demon --안심 데몬과 같이 사용 
]# ps -ef  grep nice --데몬이 살아 있는 지 확인 
 ==============================================================================================================

-- 미이관 데이타 조회 @@@@@@@@@@@@@ 
SELECT A.I3SHOP_ORDER_NO, A.ORDER_DT, A.ORDER_NO, A.ENTR_NO, A.ORDER_NM, A.ORDER_TYPE, 
       A.ORDER_STS, A.DELIVER_DT , A.INSTALL_DT, A.TRANS_MESSAGE 
FROM T_ORDER A 
WHERE A.RETURN_DT IS NULL 
   AND A.I3SHOP_ORDER_NO ='0100012004110800410' 
----------------------------------------------------------------------------------------------------- 

-- 배송, 설치 완료 데이타 수정 @@@@@@ 
-- UPDATE T_ORDER 
SET  ORDER_STS= '04', --발주상태(04:설치완료) 
	DELIVER_DT = '20041109', 
	DELIVER_STS = '04', 
	INSTALL_DT = '20041109', 
	INSTALL_STS = '04', 
	TRANS_MESSAGE='기타주문-대표이사님 요청(배송, 설치 2004-11-09 완료 강제로 세팅)' 
WHERE RETURN_DT IS NULL 
   AND I3SHOP_ORDER_NO ='0100012004110800410' 
; 
==============================================================================================================

- 주문집계표 조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderTotalList.jsp)  
==> /본부영업관리/영업분석관리/매출관리/ 
1. 상품코드 사라지는 현상 수정 
2. 자인물류점에 해당되는 업체 조회 
3. 거래처 조회기능 개선 
----------------------------------------------------------------------------------------------------- 

- 협력업체발주서조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderSaleTotal.jsp) 
1. 조회기간 오류 수정 
2. 거래처 조회기능 개선 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.11.12(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 ==> 맑음 
   
- 통합 수정
비즈센타별 매출/반품(/BizMgr/ReportMgr/SaleMgr/quickReport/quickRptBySaleRiForBizCenterP.jsp)  
==> /본부영업관리/영업분석관리/매출속보조회/ 
B065 i-yes/부산1  
0100012004110800378  김은숙(imbc) ==> 부산1 1건 4,996,700원 
주문상태가 환불완료(29)로 되어 있어야 하는데 환불금계산완료(24)로 되어 있어서 안 보이는 거거든요. 
현금+카드 주문에서 반품으로 환불처리(카드)이 완료(환불금계산완료(24))된 상태지만 
현금이 입금 안 되어서 마감일자를 찍어주지 못해서 매출에 안 잡힘 
==============================================================================================================

- 주문집계표 조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderTotalList.jsp)  
==> /본부영업관리/영업분석관리/매출관리/ 
1. 상품코드 사라지는 현상 수정 --> 상품코드: 00003924 ======> OK 
2. 자인물류점에 해당되는 업체명 조회 ======> OK 
3. 거래처 조회기능 개선(매출있는 업체만 조회) 
매입금액, 택배비 
--------------------------------------------------------------------------------------------------- 

- 협력업체발주서조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderSaleTotal.jsp) 
1. 조회기간 오류 수정 
2. 거래처 조회기능 개선(매출있는 업체만 조회) 
--------------------------------------------------------------------------------------------------- 

- 상품별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleList.jsp) 
Anal_DepartSaleList.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.13(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 맑음 
   
- 통합 수정
협력업체발주서조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderSaleTotal.jsp) 
2. 거래처 조회기능 개선(매출있는 업체만 조회) 
상품코드: 00010671, 0004623  
==============================================================================================================

String mail_id = "*@*.*";  
StringTokenizer st = new StringTokenizer(mail_id, "@"); 
String id = null;  

//주의할 점은 mail_id 라는 값에 "@"가 없을수도 있겠죠?   
//사용자가 잘못 입력했다던지 하는 경우를 대비해서  
// 체크를 해주어야죠. 만일 token이 없다면   
// countTokens() 는 1을 return 합니다.  
if(st.countTokens() >1) id = st.nextToken();   
System.out.println(id);  

이렇게 하면 "test"만 걸러서 나옵니다.  
물론 nextToken() 을 한번 더하면 "test.co.kr"이라고 나오게 되구요.  
==============================================================================================================

가령 저같은 경우엔... 아래와같이  
substring/indexOf로 문자열을 자르기 합니다. 구분자는 알아서 주시구요.. 
다섯개든 열개든 나눌수 있겠죠??  
간단한 팁..도 아닌뎅... 
이곳에보니까..딱히 없길레... (그냥 가져다가..쓰심이 좋을듯..).. 

StringTokenizer 를 써서 하면 좋은데 가령...null처리는 어떻게 할지...순서가 바뀌는  
문제가 있더라구요... 
급한김에..아래와 같이 했습니다. ^^;;  

String check="565456-5afds-85654aa";  
int vione       =   check.indexOf('-'); 
      String imsi1    =   check.substring(0,vione); 
      String tmp1     =   check.substring(vione+1); 
int vitwo       =   tmp1.indexOf('-'); 
String  imsi2   =   tmp1.substring(0,vitwo); 
String  imsi3   =   tmp1.substring(vitwo+1);  
out.println(imsi1+"------"+imsi2+"------------"+imsi3); 
==============================================================================================================

// String mail_id = "*@*.*";  
StringTokenizer strTemp = new StringTokenizer(p_merchant, "[,]"); 
System.out.println("[/tempPoEditUnityB.jsp]:[st.nextToken()]"+ st.nextToken()); 
System.out.println("[/tempPoEditUnityB.jsp]:[ArrTemp_count]"+ countTokens); 
if(strTemp.countTokens() >1)   { // 점명하면   
while(strTemp.nextToken()) {   
merchantStr1 = strTemp(0);   
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.15(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00 ==> 맑음 
   
- 통합 수정
주문집계표 조회(/BizMgr/ReportMgr/SaleMgr/Anal_OrderTotalList.jsp)  
==> /본부영업관리/영업분석관리/매출관리/ 
조회시 한 번에 조회 안 됨 ==> DS 스크립트 오류 수정 

//=================// 업체명 , 제거 split  //================================  
StringTokenizer strTemp = new StringTokenizer(p_entr_no, "[,]"); //점명 [,] 분리  
   
while (strTemp.hasMoreTokens()) {  
int length = strTemp.countTokens(); //분리된 수 
String[] strs =null; 
strs = new String[length]; 

if( length > 0) { //분리된 수가 1개 이상 일때 
entr_noListStr += "   AND (E.ENTR_NO IN ( "; 
entr_noListStr2 += " OR F.ENTR_NO IN ( "; 

for(int i=0;i < length; i++) 
{ 
strs[i] = strTemp.nextToken().trim(); 
  
if( i == 0) { //분리된 수가 1개 일 때 
entr_noListStr += "'"+ strs[i] +"'" ; 
entr_noListStr2 += "'"+ strs[i] +"'" ; 
} else { //분리된 수가 1개 이상 일 때 
entr_noListStr += ", '" + strs[i] + "' "; 
entr_noListStr2 += ", '" + strs[i] + "' "; 
} 
} 
entr_noListStr += " )  "; 
entr_noListStr2 += " )) \n"; 
} 
}   
==============================================================================================================

- 쇼핑몰 수정
- 삼성카드BIN 추가(02)2187-2740 박정근 대리(i3shop담당)에서 받음) 
CARD_BIN이 43개에서71개로 추가됨(T_CARD_BIN)  
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ith3597/3597 02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당) ---> 526-8328 안창석  
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596 
==============================================================================================================

*** 김미선   kikimisun 
농협BC카드사용 / 카드번호 :  5388124034399617 
금요일부터 결제시도...isp정상적으로 등록했고... 
오늘도 다시 주문시도 했는데 결제가 안된다고함... 
오류메세지는 카드 승인실패라고 계속 확인된다고함. 
확인후 연락드리기로함.    * / 김미선 

농협BC카드사용 / 카드번호 :  5388124034399617 
에러 메세지: CAVV데이터오류 
이 에러는 카드사에 고객이 직접 문의 해야 됩니다. 
==============================================================================================================

박진옥    8864park 
국민카드 : 9410-4771-6853-7012    
 2004-11-15 12:04:31 
페이지 오류가 나오며, 결제처리중이라는 메세지가 나오면서 처리가 안된다하십니다.. 확인부탁드려요~   
2004-11-15 12:04:31 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.16(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- 삼성카드 실서버 적용   
010001-20041116 00060 
010001-20041116 00074 
010001-20041116 00076 
010001-20041116 00083 
---------------------------------------------------------------------------------- 

- 삼성카드 결제 실패(제갑선/jeks26) 
R&F주문 18건을 한꺼번에 해서 데이타 오류로 에러가 났는 것 같음 
0100012004111600388 
0100012004111600390 
0100012004111600392 
==============================================================================================================

- 통합 수정
재고 점검 @@@@@@@@@@@ 
WeeklySupplies관리(/BizMgr/ItemStockMgr/WeeklySuppliesP.jsp) 
주문번호: 010001- 20041101 01638 =====> 0100012004110101638 
------------------------------------------------------------------------------------------------------- 
  
00136223 엔프라니 이너모스트 옵티멀3종세트(복합) =====> 빠짐 7개 --> 6개 
00136221 엔프라니 이너모스트 하이드로3종세트(건성) =====> 안빠짐 1개 --> 0개(계속 1개로 유지하고 있음) 
===> 입고 1개가 추가 되었음(정상) 
00023677 해피바스 바디오일(정말 순한타입)-300ml =====> 빠짐 10개 --> 9개 
==============================================================================================================

-- 재고 데이타 검사(다음날 새벽 2시에 재고수량 수정)  @@@@@@@@@@@@@@@ 
 /user1/oracle/cron_job/day_subul_cron.sh( ===> CALL PKG_SUBUL_MAGAM.DAY_SUBUL_INSERT(''); ) 
------------------------------------------------------------------------------------------------------------------------- 

-- 점별 상품 정보 조회 @@@@@@ 
SELECT * 
FROM T_MERCHANT_ITEM 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '9001' 
AND ITEM_CD IN ('00136221', '00136223', '00023677')       --상품코드 
--AND SALE_STS_CL  = '01' 
--AND ENTR_NO = '33011' 
; 
------------------------------------------------------------------------------------------------------------------------- 

-- 수불장 조회 @@@@@@ 
SELECT  ITEM_CD, GICHO_QTY, JEGO_QTY 
-- SELECT * 
FROM T_DAY_SUBUL 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '9001' 
AND SUBUL_DATE = '20041115' 
AND ITEM_CD IN ('00136221', '00136223', '00023677')       --상품코드 
; 
------------------------------------------------------------------------------------------------------------------------- 

-- 상품 재고 정보 조회 @@@@@@  =========> 속도 느림 
SELECT  B.ITEM_CD, B.JEGO_QTY 
-- SELECT * 
FROM T_MERCHANT_ITEM A, T_DAY_SUBUL B 
WHERE A.ITEM_CD = B.ITEM_CD 
    AND A.COMPANY_CD = '01' 
    AND A.MERCHANT_CD = '9001' 
    AND B.SUBUL_DATE = '20041115' 
    --AND B.ITEM_CD IN ('00136221', '00136223', '00023677')       --상품코드 
; 
==============================================================================================================

 -- 수불장 패키지(PKG_SUBUL_MAGAM) @@@@@@ 
 1. 입고 2. 입고반품 
 3. 출고 4. 출고반품 
 5. POS판매 6. POS판매반품 
 7. 점간이동입고 8. 점간이동출고 
 9. 재고조정 10. 기초재고 
------------------------------------------------------------------------------------------------------------------------- 

 SUM(GICHO_QTY)  --//10. 기초재고 
+ 
( 
SUM(IPGO_QTY) + --//1. 입고  ################## 
SUM(CHULGORET_QTY) + --//4. 입고반품 #### 
SUM(POSRET_QTY) + --//6. POS판매반품 
SUM(IDONGIN_QTY) --//7. 점간이동입고 
) 
- 
( 
SUM(IPGORET_QTY) + --//2. 입고반품 #### 
SUM(CHULGO_QTY) + --//3. 출고  ################## 
SUM(POS_QTY) + --//5. POS판매 
SUM(IDONGOUT_QTY) --//8. 점간이동출고 
) 
+ 
SUM(JOJUNG_QTY) --//9. 재고조정 
AS JEGO_QTY, ------재고수량 
-------------------------------------------------------------------------------------------------------------------

-- 마감일자가 오늘날짜이면 상품의 현재고 UPDATE 
IF TO_CHAR(SYSDATE - 1, 'YYYYMMDD') = VAR_SUBUL_DATE THEN 
UPDATE T_MERCHANT_ITEM A  
SET NOW_STOCK =NVL( 
       ( 
 SELECT JEGO_QTY -----//재고수량 
 FROM T_DAY_SUBUL 
 WHERE COMPANY_CD = VAR_COMPANY_CD AND  
MERCHANT_CD = VAR_MERCHANT_CD AND 
SUBUL_DATE = VAR_SUBUL_DATE AND  
ITEM_CD = A.ITEM_CD 
  ), 0 
) 
      WHERE COMPANY_CD = VAR_COMPANY_CD AND  
MERCHANT_CD = VAR_MERCHANT_CD; 
END IF; 
==============================================================================================================


- 상품별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleList.jsp)  
1. 총계IMU, GM 오류 수정 

IMU =  DECODE (X.SALE_TOTAL,0,1,ROUND((X.SALE_TOTAL - X.SALE_BUYING -X.SHIP_PRICE)/ X.SALE_TOTAL,4))*100  
2. BV, 판매수당, 직판수당 필드 추가 
3. 추가택배비 필드 삭제  ======> OK 
==============================================================================================================

- [tablename] 테이블에 a필드와 b필드가 있습니다. 
a필드의 값이 10보다 작거나 같으면 1을 
a필드의 값이 10보다 크고 20보다 작거나 같으면 2를 
a필드의 값이 20보다 크면 3을 출력하고 싶습니다. 
 ==============================================================================================================

 SELECT decode(a, a<=10 , 1, 
  decode(a, 10<a<=20 , 2, 
    decode(a, 20<a , 3) 
    ) 
) a, b FROM tablename 

DECODE ( MERCHANT_CD , '0001' , 'Y' , 'N' ) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.17(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 ==> 맑음 

- 통합 수정
통합마감(/BizMgr/ReportMgr/closingP.jsp) 
DEPART별 마감 ===> 통합 수동 마감 
SELECT PKG_DAYOFCLOSE.FINALYDAY_TYPE_INSERT ( '01','0001','20041116','210.123.133.31','admin','04' ) AS RET_TEXT FROM DUAL  
-------------------------------------------------------------------------------------------------------- 

-- 통합마감 
01. 상품별 마감(T_CLOSE_ITEM) 02. 카테고리별 마감(T_CLOSE_CATEGORY) 
03. 업체별 마감(T_CLOSE_ENTR) 04. 디파트별 마감(T_CLOSE_DEPART) 
05. 비즈센타별 마감(T_CLOSE_BIZ) 07. 통합 마감(T_CLOSE_TOT) 
10. 온라인 주문 마감(T_CLOSE_SALE) 
==============================================================================================================

- 상품별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleList.jsp)  
1. 총계 IMU, GM 오류 수정 
IMU: Initail Markup(초기 마진), GM: Gross Margin(총 마진) 
초기 마진(IMU) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량)/(일반판매가*수량)]*100  
총 마진(GM) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량) - (판매수당*수량) - (직판수당*수량)/(일반판매가*수량)]*100  
2. BV, 판매수당, 직판수당 필드 추가 
-------------------------------------------------------------------------------------------------------- 

DECODE (X.SALE_TOTAL,0,1,ROUND((X.SALE_TOTAL - X.SALE_BUYING -X.SHIP_PRICE)/ X.SALE_TOTAL,4)) *10 

<C>id=IMU name='IMU'  HeadAlign=center  align=right width='60'   
sumtext={(sum(SALE_TOTAL)-sum(SALE_BUYING)-sum(SHIP_PRICE))/sum(SALE_TOTAL)*100} sumbgcolor='#f8be12' dec='2' </C> 
-------------------------------------------------------------------------------------------------------- 

<C>id=IMU  name='IMU'  HeadAlign=center  align=right width='60'   
sumtext={(sum(SALE_TOTAL)-sum(SALE_BUYING)-sum(SHIP_PRICE))/sum(SALE_TOTAL)*100} sumbgcolor='#f8be12' dec='2' </C> 
<C>id=GM  name='GM'  HeadAlign=center  align=right width='60'   
sumtext={(sum(SALE_TOTAL)-sum(SALE_BUYING)-sum(SHIP_PRICE)-sum(SALE_BONUS)-sum(DIRECT_MONEY))
/sum(SALE_TOTAL)*100} sumbgcolor='#f8be12'</C> 
==============================================================================================================

- 메일 생성건 
http://old.i3shop.com/frame.html(i3shop/0506) 
==============================================================================================================

매장별 매출집계, 전시매장별매출조회  비교 요망 
==============================================================================================================

- 쇼핑몰 수정
현금+카드 오류(정복희/jbh428) 
0100012004111700305  --> 0100012004111700350(현금으로 결제) 

java.sql.SQLException: ORA-01400: cannot insert NULL into ("IIISHOP"."T_CARD_SS"."CARD_NO") 
현금+카드는 T_AR 2개 테이블 생성 현금 테이블에 CARD_NO 없에서 에러 발생 
if (ar_way_cd.equals("20")){ //시제유형코드가 카드 결제인 것만 저장 @@@@@@@@ 
---------------------------------------------------------------------------------------------------------------- 

- 삼성카드 130만원 한도 초과 
var total_ansimss_amt = parseFloat(frm.p_ar_amt.value) + parseFloat(frm.p_sscard_amt.value);  //총 삼성카드 사용액(결제 희망액 + 누적 사용액) 
frm.p_sscard_amt.value이 널일 때 0원 처리 안 해서 넘어 감 
===> <input type=hidden name="p_sscard_amt" value="<%=util.HanMoney(p_h_sscard_amt)%>"> 으로 처리 
0100012004111700383 davidjsp 
==============================================================================================================

- 삼성카드(김진혁 대리)  =============> 
4009 1311 0196 9729(4009131101969729) kyeogie1 
200906/0159 
CVC: 362 
720720 - 1797816 
반품--> 카드 승인 취소(매입 후 삼성카드 3일 --> 5일 걸림) 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ith3597/3597 02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당) ---> 526-8328 안창석  
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596 
==============================================================================================================

- 프로젝트팀 5층에[서 1층으로 책상, 짐 가지고 이동 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.11.18(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 ==> 맑음 

- 통합 수정
- 상품별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_DepartSaleList.jsp) 
1. 총계 IMU, GM 오류 수정 
초기 마진(IMU) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량)/(일반판매가*수량)]*100  
총 마진(GM) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량) - (판매수당*수량) - (직판수당*수량)/(일반판매가*수량)]*100  
점유율(PEN) = 반품액/전체 반품액*100 
2. BV, 판매수당, 직판수당 필드 추가  
==============================================================================================================

- 상품별반품현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_ReturnItemList.jsp) 
1. 총계 IMU, GM 오류 수정 
IMU: Initail Markup(초기 마진), GM: Gross Margin(총 마진), PEN: Penetration(영향력) 
초기 마진(IMU) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량)/(일반판매가*수량)]*100  
총 마진(GM) = [(일반판매가*수량) - (구매가*수량) - (택배비*수량) - (판매수당*수량) - (직판수당*수량)/(일반판매가*수량)]*100  
점유율(PEN) = 반품액/전체 반품액*100 
2. BV, 판매수당, 직판수당, 업체코드, 업체명 필드 추가 
3. 수량이 0이면 모든 필드 0, 수량이 - 이면 IMU, GM 제외 모든 필드 - 
==============================================================================================================

-- 안심 LG카드 삼성카드 저장 
0100012004111800188 
400905 6316187009 ---> 삭제 
----------------------------------------------------------------------------------------------------------------- 

010001-2004111800269 ---> 삭제 
010001-2004111800275 ---> 삭제 
==============================================================================================================

- I3SHOP 데이타 현황 @@@@@@@@ 
주문 정보 데이타  ====> 20020101 부터 존재 
마감 정보 데이타  ====> 20030101 부터 존재 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.19(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 맑음 

- 통합 수정
- 카테고리별상품매출조회(/BizMgr/ReportMgr/SaleMgr/Anal_CategorySaleTotal.jsp)  
1. BV, 판매수당, 직판수당 필드 추가  
==============================================================================================================

- 공인인증서 결제 에러 
김성욱(655708/moamall): 500730 - 1024818 
회원정보관리(/MlmMgr/memberMgr/resellerListMainP.jsp)  ===> MLM관리/회원관리 
쇼핑몰로 이동: 공인인증서 결제(/admin/kica/raadmin_pay2.jsp --> /raadmin_pay3.jsp) 
T_KICA_REQ(공인인증서 정보) 테이블에서 ==> 집 전화번호 미 입력 
----------------------------------------------------------------------------------------------------------------- 

- 공인인증서 결제(/admin/kica/raadmin_pay2.jsp --> /raadmin_pay3.jsp)  
memNoticeListP.jsp -->  
raadmin_check.jsp(이름, 성명, 주민번호) -->  
raadmin.jsp --> raadmin_pay1.jsp 
raadmin_pay2.jsp --> raadmin_pay3.jsp 
==============================================================================================================

- 전화번호 안 기입하면 0으로 저장 
리셀러 등록(/customer/resellerRegistfP.jsp?p_nm=0&p_ssn=*) 
http://www.i3shop.co.kr/customer/resellerRegistfP.jsp?p_nm=0&p_ssn=3211121796311 
/customer/resellerRegist.jsp에서 전화번호 안 기입하면 0으로 저장 
if(p_phone.equals("")) p_phone = "0";     //전화번호  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.11.20(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:45 ~ 19:00 ==> 맑음 

- 통합 수정
- 권한 주기 
매장별 매출집계,  상품별비즈센타매출 , 디파트별등급별매출 , 등급별직급별매출 , 등급별구매횟수별매출  
권한부여자: 상품개발 1, 2팀, 안재복(sorera), 신정환(oki222), 이화용(uro1977) 
==============================================================================================================

-  전시매장별판매현황조회(/BizMgr/ReportMgr/SaleMgr/Anal_StoreSaleList.jsp) 
1. 전시매장 추가 
==============================================================================================================

- 공인인증서 결제 에러 수정 
김정란   7*-2625814  
==============================================================================================================

- 거래처 세금계산서 관리(/BizMgr/Remittance/EntrTaxAccountP.jsp)  --> 거래처: 동진 
EntrTaxAccountDetailB.jsp(수정) EntrTaxAccountTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------- 

- 거래처 송금 관리(/BizMgr/Remittance/EntrRemittanceP.jsp) 
EntrRemittanceDetailB.jsp(수정) EntrRemittanceTotalB.jsp(파일 생성) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.11.22(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
- 거래처 세금계산서 관리(/BizMgr/Remittance/EntrTaxAccountP.jsp)  --> 거래처: 동진(1186건)  --> 1184건 
/EntrTaxAccountDetailB.jsp(수정) /EntrTaxAccountTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------------- 

- 거래처 송금 관리(/BizMgr/Remittance/EntrRemittanceP.jsp) 
/EntrRemittanceDetailB.jsp(수정) /EntrRemittanceTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------------- 

- 거래처 송금 관리(일일정산) (/BizMgr/Remittance/EntrRemittanceDailyP.jsp) 
/EntrRemittanceDetailB.js(수정) /EntrRemittanceTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------------- 

System.out.println("[EntrTaxAccountMS.jsp]::[p_entr_no]==>"+  rows[0].getString(p_entr_no) +"" +  
"[p_settle_dt_j]==>"+ rows[j].getString(idxsettle_dt)); 
==============================================================================================================

- 쇼핑몰 수정
- R&F상품 장바구니 담기 수정 
프로모션 이면 <img src='/img/items/promotion.gif' border=0> 
[/itemListP.jsp]:[ITEM_WEB_NM]SQIN 매직톡스 퍼밍프로그램 
[/itemListP.jsp]:[MODEL_WEB_NM](매직톡스20g+앰플3ml*5)           -----> 

<%!   //@@@@@@@@@@     문자 변경 함수  @@@@@@@@@@@@@@@@@ 
    public static String replace(String line, String oldString, String newString)  
    {  
        for(int index = 0; (index = line.indexOf(oldString, index)) >= 0; index += newString.length())  
              line = line.substring(0, index) + newString + line.substring(index + oldString.length());  
        return line;  
    } 
    //====================================================================================================
%> 

String MODEL_WEB_NM = util.getData("MODEL_WEB_NM",rowHash); 
MODEL_WEB_NM = replace(MODEL_WEB_NM, "'", "");  //문자 변경(' -> ) 
==============================================================================================================

- 삼성카드 한도 초과 허용 
0100012004112000265 400911******6008 
0100012004112000277 400911******6214 
==============================================================================================================

SELECT *  
FROM USER_CONS_COLUMNS   --USER_CONSTARINTS 

SELECT *  
FROM USER_CONSTARINTS   

 select * 
  from user_constraints 
 where table_name = 'T_MEMBER' 
   --and constraint_type ='R' 
   and constraint_NAME='SYS_C007104' 
  
   select * 
  from user_constraints 
 where table_name = 'T_MEMBER' 
==============================================================================================================

- 매출일보조회 
상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
==============================================================================================================

- 가맹점 한도 초과  
%%   신옥순     goddns26    Member 
카드결제 오류난다고함 -> 승인실패 나오고 카드사로 문의하니 우리쪽으로 문의하라고햇다고함  
현대카드 :  4028 5701 2187 3329   신옥순 
8373: 카드사 전화 요망 
카드사 오류 이상 입니다. 창에서 승인실패라는 에러는 카드사에서 보내는 에러 입니다. 
---------------------------------------------------------------------------------------------------------- 

김윤효 bestid2 ->방금 보내드린분 인적사항 기재안해드렸네요~ 
현대카드 [ 4028 5701 3880 4101 ]  79만원 
결제하려고 하는데, 며칠전에도 결제안되었고, 오늘도 결제안되신다고 하시네요~ 
8373: 카드사 전화 요망 
  ==>가맹점 한도 초과  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.23(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
- 거래처 세금계산서 관리(/BizMgr/Remittance/EntrTaxAccountP.jsp)  --> 거래처: 동진(1186건)  --> 1184건 
/EntrTaxAccountDetailB.jsp(수정) /EntrTaxAccountTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------------

- 거래처 송금 관리(/BizMgr/Remittance/EntrRemittanceP.jsp) 
/EntrRemittanceDetailB.jsp(수정) /EntrRemittanceTotalB.jsp(파일 생성) 
----------------------------------------------------------------------------------------------------------

- 거래처 송금 관리(일일정산) (/BizMgr/Remittance/EntrRemittanceDailyP.jsp) 
/EntrRemittanceDetailB.js(수정) /EntrRemittanceTotalB.jsp(파일 생성)  
System.out.println("[EntrTaxAccountMS.jsp]::[p_entr_no]==>"+  rows[0].getString(p_entr_no) +"" +  
"[p_settle_dt_j]==>"+ rows[j].getString(idxsettle_dt)); 
==============================================================================================================

- 매출일보조회 
상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
반품기준 변경(반품완료-> 회수완료) 
==============================================================================================================

- 쇼핑몰 수정
- 운영자소개글 수정(링크 가능하게 수정) 
donbuy77/0000 강동완 
http://don.i3shop.cc/main_tpl/resellerGreetingP.jsp   
/main_tpl/resellerGreetingP.jsp 에서 아래 추가 @@@@@@@@ 
<jsp:include page="/biz.jsp" flush="true" /> 
------------------------------------------------------------------------------------------------------  

SELECT A.MEM_ID, A.MNO, A.DOMAIN_NM, B.INTRODUCE 
FROM T_MEMBER A, T_MEMBER_ETC B 
WHERE B.INTRODUCE IS NOT NULL 
      AND  A.MNO =  B.MNO;  
==============================================================================================================

- 이해연  mallbank22 
현대 : 9490 1001 1541 7913  
오류난다고 합니다~ 오류메세지 A1E  ->이렇게 나온다고 하시네요~  
* 현대 : 9490 1001 1541 7913  
* 에러코드 : A1E / AA1 
* 에러메세지 : addorderlnfo 
* 결제금액 :8만원  
==============================================================================================================

※ 고객정보: 신현미 shm1004   *전->문미경 mik26 Gold-M 
카드: 9410 4790 0184 1023 
국민카드 ISP결제하려고하는데, 계속 9999라는 오류메세지나온다고 함! 
카드사에 전화했더니 아무런이상없다고 했다고 함! 
로그아웃해서 다시 주문서 작성해보라고 해서 결제했는데도 오류메세지나온다고 함! 
인증서도 있다고 함! 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.24(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 21:30 ==> 맑음 

- 통합 수정
- 매출일보조회 
상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
반품기준 변경(매출일자(SELLING_DT) --> 배송완료일자(SHIP_DT))  
매출일보조회/상품별 매출/반품(T_CLOSE_SALE_DTL), 매출관리/상품별반품현황조회(T_ORDER_DTL) 
매출일자(SELLING_DT) 차이로 데이타가 상이할 수 있음 
==> T_CLOSE_SALE_DTL는 다음날 새벽에 마감이 돔 

 10. 온라인 주문 마감  다시 돌리기 
 20041123 일자 
------------------------------------------------------------------------------------------------------  

-- 배송완료일자(SHIP_DT) INDEX 설정===> SQL Gate에서 
 CREATE INDEX IDXT_CLOSE_SALE_DTL_SHIPDT ON  
  "IIISHOP".T_CLOSE_SALE_DTL(SHIP_DT) 
  TABLESPACE IIISHOPX PCTFREE 10 STORAGE(INITIAL 16K);  
------------------------------------------------------------------------------------------------------  

-- 주문 정보 조회 @@@@@@@@@@ 
SELECT  A.ORDER_DT AS 주문일자, B.SHIP_DT AS 배송완료일자, 
        B.ORDER_NO AS 주문번호, A.SELLING_DT AS 매출일자, 
        B.ITEM_CD AS 상품코드, A.ORDER_TP, 
        REAL_SALE_PRICE AS 금액, REAL_QTY AS 수량, 
        REAL_SALE_PRICE*REAL_QTY AS 금액합계, B.ITEM_CD 
FROM T_ORDER A, T_ORDER_DTL B 
WHERE A.COMPANY_CD = B.COMPANY_CD 
AND A.MERCHANT_CD = B.MERCHANT_CD 
AND A.ORDER_DT = B.ORDER_DT 
AND A.ORDER_NO = B.ORDER_NO 
AND A.MERCHANT_CD = '0001' 
--AND A.SELLING_DT >= '20041101'   --매출일자 
--AND A.SELLING_DT <= '20041123' 
AND B.SHIP_DT >= '20041123'      --배송완료일자 
AND B.SHIP_DT <= '20041123' 
--AND A.ORDER_DT = '20041123' 
--AND A.ORDER_NO = '00369' 
AND B.ITEM_CD = '00004713'       --상품코드 
; 
------------------------------------------------------------------------------------------------------  

-- 온라인 주문 마감 조회 @@@@@@@@@@ 
SELECT  A.SELLING_DT AS 매출일자, B.SHIP_DT AS 배송완료일자, 
        A.ORDER_DT AS 주문일자, A.ORDER_NO AS 주문번호, B.ITEM_CD AS 상품코드, 
        B.REAL_SALE_PRICE AS 금액, B.REAL_QTY AS 수량, 
        B.REAL_SALE_PRICE*REAL_QTY AS 금액합계, B.ITEM_CD 
FROM T_CLOSE_SALE A, T_CLOSE_SALE_DTL B 
WHERE A.COMPANY_CD = B.COMPANY_CD 
  AND A.MERCHANT_CD = B.MERCHANT_CD 
  AND A.ORDER_DT = B.ORDER_DT 
  AND A.ORDER_NO = B.ORDER_NO 
  AND A.MERCHANT_CD = '0001' 
  AND B.SHIP_DT >= '20041120'      --배송완료일자 
  AND B.SHIP_DT <= '20041123' 
  AND B.ITEM_CD = '00148355'       --상품코드(00148355) 
  --AND A.ORDER_TP  = '03'        -- 주문유형(01:정상주문, 03:반품주문) 
  --AND A.ORDER_STS = '29'        -- 주문상태(29:환불완료) 
; 
==============================================================================================================

- 쇼핑몰 수정
- 수당명세서 수정 
진혜숙(i3queen5) i3queen.soho.cc  
==============================================================================================================

- 쇼핑몰 속도 저하 원인 파악 
[root@iiishop_ccdom3 logs]# cd /opt/IBMHTTPServer/logs 
[root@iiishop_ccdom3 logs]# ls -al -h ====> (메가 바이트 보기) 
-rw-r--r--    1 root     root          27M 11월 24 15:31 access_log 
access_log 로그 파일 GB로 증가함(--> 삭제 요망) 
------------------------------------------------------------------------------------------------------------- 

- 오라클 DB 점검 
Oracle Enterprise Manager Console(9i)  
포트명: 2030(IIISHOP/IIISHOP) 

호스트: 211.233.5.110 
SID: IIISHOP 

데드락이 걸렸을 때 
인스턴스 --> 잠금 
잠금유형 확인 후 Kill 시킴 
==============================================================================================================

0100012003110800709..주문번호입니다.... 
11월11일날 전산으로 접수건이구요... 
노란색으로 되어있는데.후레쉬쪽에서.. 
전산이관이 안된다 그러시네요~~~그럼.수고하세요~  
0100012003110800709 김영균 
0100012003111100604 강미경  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.25(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
- 매출일보조회 
상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
반품기준 변경(매출일자(SELLING_DT) --> 물품회수완료일자(SHIP_DT))  
T_CLOSE_SALE  ---> T_CLOSE_DEPART(DEPART별 마감)  
매출일보조회/상품별 매출/반품(T_CLOSE_SALE_DTL), 매출관리/상품별반품현황조회(T_ORDER_DTL) 
매출일자(SELLING_DT) 차이로 데이타가 상이할 수 있음 
==> T_CLOSE_SALE는 다음날 새벽에 마감이 돔  ========> 앞으로 사용 안 함 
-------------------------------------------------------------------------------------------------------------- 

매장별 매출/반품(/BizMgr/ReportMgr/SaleMgr/daydayRptBySaleRiForSotreP.jsp) 
거래처별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForEnterpriseP.jsp)  
DEPART별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForDepartP.jsp)  
==============================================================================================================

20041123 00478   --> 010001 20041125 00184 

--통합마감 
01. 상품별 마감(T_CLOSE_ITEM) 02. 카테고리별 마감(T_CLOSE_CATEGORY) 
03. 업체별 마감(T_CLOSE_ENTR) 04. 디파트별 마감(T_CLOSE_DEPART) 
05. 비즈센타별 마감(T_CLOSE_BIZ) 07. 통합 마감(T_CLOSE_TOT) 
10. 온라인 주문 마감(T_CLOSE_SALE) 
==============================================================================================================

StringBuffer SQL = new StringBuffer();  
SQL.append("select TAKE_DT, PAY_DT, MNO ,      \n");  
_qryhash.put("SQL",SQL.toString()); 
==============================================================================================================

-- 반품 관리 흐름 @@@@@@@@@@@ 
- 반품 회수 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemWidthdrawP.jsp) 
ORDER_STS, -- 주문상태(23:물품회수완료) 
SHIP_DT, --배송완료일자(반품: 물품회수완료일자) 
-------------------------------------------------------------------------------------------------------------- 

- 환불금 확정(/BizMgr/SaleMgr/WebOrderMgr/repayDeductP.jsp) 
ORDER_STS,    -- 주문상태(24:환불금계산완료)  
-------------------------------------------------------------------------------------------------------------- 

- 환불처리(현금)(/System/AclMgr/Refund/refundForCashMainP.jsp) 
ORDER_STS,    -- 주문상태(29:환불완료) 
SELLING_DT,    --매출일자              
==============================================================================================================

정진환     maney01 
냉장고 160만원 가량 상품을 카드+현금결제로 삼성카드로 50만원 결제시도했지만..  
계속 130만원미만만 결제가능하다고 에러메세지가 나온다고하세요..  
카드번호 : 9410-9115-8494-0900  삼성 
9410911584940900 
-------------------------------------------------------------------------------------------------------------- 

- 삼성카드 결제 안된다고 전화주셨어요. 
이화영(10206) 019 - 692 - 6408  
카드번호 : 4009-1352-4618-9002  삼성 
==> 개인 한도 초과 
==============================================================================================================

- 공인인증서 에러(집 전화번호)  
이정옥( jungok7) 
공인인증 전화번호 오류 건 입니다. 
-------------------------------------------------------------------------------------------------------------- 
  
고정숙(kjs50/652261): 2004-10-26 오후 2:39:18 발급 정상  ========> 기존 인증서 폐기 바람 
신인성(sis78/656549): 2004-11-25 오전 11:19:37 발급 정상  ========> 기존 인증서 폐기 바람  
==============================================================================================================

- i-yes그룹 파랑새클럽 송년행사 공지  
-- 비즈 그룹 로그인(/i_yes그룹 & 리셀러일 경우) 
String IsYes = (String)util.getSesValue("IsIYes", request);  //i_yes그룹 & 리셀러일 경우에만 나타남!!! 
String IsIvy = (String)util.getSesValue("IsIvy", request); //ivy그룹 & 리셀러일 경우에만 나타남!!!  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.26(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 비후 갬 

- 통합 수정
A. 매출일보조회 @@@@@@@@@ 
반품일 경우 통합마감 하면서 SHIP_DT --> SELLING_DT로 변경하므로 
마감에서는 SELLING_DT를 물품회수완료일자로 인식 
반품기준 변경(매출일자(SELLING_DT) --> 물품회수완료일자(SHIP_DT)) 
-------------------------------------------------------------------------------------------------------------- 

3. 상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForItemP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_DEPART(DEPART별 마감): 결제방법코드(AR_WAY_CD) 
==============================================================================================================

6. DEPART별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForDepartP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_DEPART(DEPART별 마감) 
==============================================================================================================

4. 매장별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayRptBySaleRiForSotreP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_CATEGORY(카테고리별 마감) 
==============================================================================================================
  
5. 거래처별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForEnterpriseP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_ENTR(거래처별 마감)  
==============================================================================================================

1. 비즈센타별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForBizcenterP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_BIZ(비즈센타별 마감) 
==============================================================================================================

2. 비즈그룹별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForBizgroupP.jsp) 
T_CLOSE_SALE  ---> T_CLOSE_BIZ(비즈센타별 마감) 
==============================================================================================================

5. 상품별 매출/반품(/BizMgr/ReportMgr/SaleMgr/quickReport/quickRptBySaleRiForItemP.jsp) 
6. 매장별  매출/반품(/BizMgr/ReportMgr/SaleMgr/quickReport/quickRptBySaleRiForStoreP.jsp)  
==============================================================================================================

- 김윤효PM(bestid2)  * 055-266-4623 
외환카드 가맹점 한도(승인코드: 8373) 의심: 아님 
9410-0052-5884-9706(jayo88) 
재발급하고 등록을 안 함 --> 외환카드에 전화해서 등록 하라고 안내함  
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm   
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): 가맹점 한도 문의 
기타:  02)2187-2747  이유진 
-------------------------------------------------------------------------------------------------------------- 
L&B ==> ith3597/3597 
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596 
==============================================================================================================

- 씨티, 한미은행 카드 합병 결과 @@@@@@@@ 
PG사에 문의 결과 
현재 합병이 되어도 당분간 기존 방식대로 사용을 한다고 하네요. 
아마도 12월 중순쯤에 변경한다고 그러는데.......... 
확정이 안 되었다고 하네요. 
-------------------------------------------------------------------------------------------------------------- 

- 기타 신용카드(시티/축협/농협) 
안심클릭 신용카드(ISP/기타 신용카드 제외 모든 카드)  ======> 한미카드
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.27(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 13:00 ==> 맑음 

- 통합 수정
7. 거래처별 매출/반품(/BizMgr/ReportMgr/SaleMgr/quickReport/quickRptBySaleRiForEnterpriseP.jsp) 
8. DEPART별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/dayRptBySaleRiForDepartP.jsp) 
3. 비즈센타별 매출/반품(/BizMgr/ReportMgr/SaleMgr/quickReport/quickRptBySaleRiForBizCenterP.jsp) 
4. 비즈그룹별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/quickRptBySaleRiForBizgroupP.jsp) 

1. 총 매출 속보조회(/BizMgr/ReportMgr/SaleMgr/dayReport/quickRptByTotalP.jsp) 
2. 점별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/quickRptBySaleRiForMerchantP.jsp)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.29(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음 

- 통합 수정
2. 점별 매출/반품(/BizMgr/ReportMgr/SaleMgr/dayReport/quickRptBySaleRiForMerchantP.jsp) 
반품 수량, 금액 수정 
==============================================================================================================
  
- 공제번호 세팅 후 에러 
카드결재하면 오류코드 [LEG]라는 오류메세지가 뜬다하심.  
(여러카드를 이용했지만 똑같은 오류가 확인된다하심) 
카드번호 : 5404-8668-8144-9008 LG 
==============================================================================================================

- 영업분석관리(/BizMgr/ReportMgr/SaleMgr/Anal_Sale_Main.jsp) 
- 추가택배비 오류,  
- 판매수당, IMU, GM 데이타 틀림 
- 원가, 직판수당 추가 
과세관련 매출분석 (/BizMgr/ReportMgr/SaleMgr/Anal_Sale_Tax.jsp) 
- 데이타 확인 
==============================================================================================================

- 공인인증서 결제 에러 
정찬숙(bigben1): *@*.*   -----> 이메일 미 기입 
==============================================================================================================

- 쇼핑몰 수정
- i3mart 수정 @@@@ 
4단계 상품 -> 3단계 상품 전시 
top 메뉴(main_tpl/img/i3mart_topmenu.swf) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.11.30(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 ==> 맑음 

- 쇼핑몰 수정
- i3mart 수정 @@@@ 
4단계 상품 -> 3단계 상품 전시 
top 메뉴(/main_tpl/img/i3mart_topmenu.swf) 
대분류: /img/category/S019T01000000_title.gif 
중분류: /img/category/S019T01040000_title_on.gif /img/category/S019T01040000_title.gif 
==============================================================================================================

- 신용카드 결제 
최명옥 imoney05  
카드번호 : 5404-8668-8144-9008 LG --> 수정 되었음 
==============================================================================================================

- 김현지 67kim 
LG  4009 0618 7350 6054 -> 김현지 1번 49만원 4009061873506054 
LG  4386 7611 5376 6004 -> 이경제 4번 49만원 * 4번 4386761153766004 
11/27일 카드결제할때 오류 총 7번 났는데, 총 5번 승인났다고 하시네요~  
이카드로 어떤문제가 있었는지 확인부탁드려요~ 
-------------------------------------------------------------------------------------------------------------------------

- 신용카드 에러(카드사에 카드 승인이 되었고 주문상태가 카드승인(00)오류인 것) 
0100012004112700239 이태영 --> lgcard 
0100012004112800036 고덕진 --> lgcard 
0100012004112800255 전백렬 --> lgcard 
0100012004112700354 강성아 --> kokmin 
0100012004112800001 강성아 --> kokmin 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당) ---> 526-8328 안창석 
L&B ==> ith3597/3597 
R&F ==> LG직거래: its2023/its2023 
     LG이외 모든 카드: itp3596/3596 
==============================================================================================================

- 주문금액 이상 
0100012004112900310 01000120041129 00310 
합계금액 틀림(6,263,730,000  -->     1,898,832,704) 
삼성  A3 흑백 레이저 디지털복합기(복사기) 
==============================================================================================================

- 과세여부(Y, N) 추가 
상품별비즈센타매출, 카테고리별상품매출조회, 주문집계표조회   
상품별판매현황조회,  상품별반품현황조회 
==============================================================================================================

- 옥매트 구매 
2005년형 일월자석 은 “銀”세라믹매트(더블+싱글)   168,000원  --> 117,000원(직원가) 제조원: ㈜일월 의료기 
하나은행 (117,000원) 292-910011-95107 정지선 
-------------------------------------------------------------------------------------------------------------------------
배송 주소지: 포항시 북구 두호동 1030-13 우광맨션 나동 102호 
배송 주소지: 진덕근 
수령자 연락처: 054-242-8823, *(대구) 
==============================================================================================================

- 카드 한도 초과 확인(현대카드) 
김윤효 PM * 
현대카드 4028-5701-3880-4101 
==============================================================================================================

- 입금은행 추가 
한동웅 : 623902-04-000579   국민은행, 이종창 : 150021-52-116491   농협 
-------------------------------------------------------------------------------------------------------------------------

-  통합에서 /기초코드관리/거래처관리에서 업체구분(자사) --> 거래처명(온라인점) --> 계좌정보 
-- 거래처 은행계좌정보 등록 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
-- INSERT INTO T_ENTR_BANK_ACCOUNT 
( COMPANY_CD, ENTR_NO, ACCOUNT_NO, BANK_CD, DEPOSITOR, 
      BRANCH_NM, OPEN_DT, CLOSE_DT, ACCOUNT_CL,  WEB_USE_YN, 
      MEMO_DESC, USE_YN, REG_ID, REG_IP, REG_DT, 
      UP_ID, UP_IP, REMIT_ACCOUNT_YN, UP_DT )  --송금계좌여부(y,N) 추가 
VALUES 
('01',   '45001',   '623902-04-000579', '4001',  '한동웅', 
   '국민',   '',   '',   '',   'R', 
   '',   'Y',   'admin',   '210.123.133.31',   sysdate, 
   '',   '',  '', sysdate ) 
; 
------------------------------------------------------ (한동웅: 623902-04-000579 국민, 이종창:150021-52-116491 농협) 

- /기초코드관리/거래처관리 @@@@@@@@@ 
- 현금주문(입금은행 농협 추가) ====> 쇼핑몰 --> 농협 756-01-023585 (주)아이쓰리샵 
SELECT * FROM T_ENTR_BANK_ACCOUNT 
WHERE COMPANY_CD= '01' 
	AND WEB_USE_YN='R' --은행 종류(Y:일반은행, R:RnF은행) 
	AND USE_YN= 'Y' 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■