

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2004.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2004.09.01(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 19:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 로그인(쿠키 사용) 
http://test.mart.cc/mobile/loginfP.jsp?p_location=/mobile/noticelist.jsp
------------------------------------------------------------------------------------------------------------ 

- 공지사항 리스트 
http://landmark.town.cc/mobile/noticelist.jsp?from=0&count=10 
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
------------------------------------------------------------------------------------------------------------ 

- 공지사항 상세 리스트 
http://test.mart.cc/mobile/noticeitem.jsp?index=61  
==============================================================================================================

- 리셀러 공지사항 게시판 
/admin/memnotice/memNoticeListP.jsp  ---> 
/memNoticeList.jsp, /memCertifReqYn.jsp 
------------------------------------------------------------------------------------------------------------ 

- 공지사항 게시판(통합) 
/MainMgr/i3NoticeBoard/i3NoticeListP.jsp   ---> getI3NoticeList() 
------------------------------------------------------------------------------------------------------------  

0 1 3 5 20040901 3 20040831 1 20040821 
0 1 3 261 20040225 241 20040214 221 20040126 201 20040116 181 20031224 161 20031129 141 20031122 121 20031017 101 20031001 102 20031001  
==============================================================================================================

- 매출자료(김기호 대리)  
==============================================================================================================

- 일부 반품 수정 
아래 총 34650원 결제중  옥시크린 4250원 짜리 1개 재고없어서 
물류에서 반품신청한건데  접수로 안넘어갑니다~ 

반품번호: 00167 
주문자:김점순  //아이디; export 
20040822, 김점순, 0100012004082200129, 20040831 

- 아이오페 컨트롤링 세범토너(지성)-150ml(150ml 지성) 
- 마몽드 플라워 퍼스트 세럼 화이트-50ml15500 - 1 
- 레몬 옥시크린리필 1.3kg(1.3kg(130회분)) -  - 4250 - 1 

- substring 사용(원주문일자 분리) 
if( m_order_no.equals("1")) {  //010001 20040822 00129  
p_order_dt = p_ori_order_no_full.substring(6, 14);  //원주문일자 
p_order_no = p_ori_order_no_full.substring(14, 19); //원주문번호   
} 
==============================================================================================================

import javax.servlet.http.Cookie; // 쿠키  
Cookie[] cookies = request.getCookies();  // 쿠키  
if(dreq == null  mProfile == null mProfile.isTransient() == true) {  // 로그인이 안 되어 있을 때(세션 설정) 
Cookie ck_1   = new Cookie("login_para_Cookie", "1"); // 쿠키 설정 @@@@@@@@@ 
response.addCookie(ck_1);   // 쿠키 설정 여부 
Cookie ck_2   = new Cookie("actType", actType); 
response.addCookie(ck_2); // actType 타입 
Cookie ck_3   = new Cookie("Question_Times", Question_Times); 
response.addCookie(ck_3); // 회차 
Cookie ck_4   = new Cookie("answer", answer); 
response.addCookie(ck_4); // 답 
Cookie ck_5   = new Cookie("Right_Answer", Right_Answer); 
response.addCookie(ck_5); // 정답 
LLog.err.println("[TAMA] EventRegisterCmd.java:: ===> [쿠키 설정]"); 
  
return loginPage; 
} 

// 쿠기 받기 ---------------------------------------------------------------- 
 for( int i = 0; i < cookies.length; i++ ) { 
if(cookies[i].getName().equals("login_para_Cookie")) { 
 login_para_Cookie = cookies[i].getValue();   
} 
if(cookies[i].getName().equals("actType")) { 
 actType = cookies[i].getValue(); 
} 
if(cookies[i].getName().equals("Question_Times")) { 
 Question_Times = cookies[i].getValue(); 
} 
if(cookies[i].getName().equals("answer")) { 
answer = cookies[i].getValue(); 
} 
if(cookies[i].getName().equals("Right_Answer")) { 
 Right_Answer = cookies[i].getValue(); 
} 
} 
==============================================================================================================

- [쿠키 설정]  
// 쿠기 생성 ----------------------------------------------------------------    
   String OutFromURL = (request.getParameter("OutFromURL") == null  request.getParameter("OutFromURL").equals("")) 
   ? "00" : request.getParameter("OutFromURL");

 if(OutFromURL.equals("movie")){    // 영화사 사이트 통한 회원가입(event_id)으로 이동   
    out.println("<br>[TANA] needlogin.jsp:: [OutFromURL]"+ OutFromURL);  
    Cookie ck   = new Cookie("OutFromURL", OutFromURL); 
    response.addCookie(ck);  
    out.println("<br>새 로 운 쿠 키 를  생성 합 니 다 ");  
} 
------------------------------------------------------------------------------------------------------ 

 // 쿠기 받기 ---------------------------------------------------------------- 
Cookie[] cookies = request.getCookies();  

 for( int i = 0; i < cookies.length; i++ ) { 
   if(cookies[i].getName().equals("OutFromURL") && cookies[i].getValue().equals("movie")) { 
      String OutFromURL = cookies[i].getValue(); 
%> 
<script language=javascript>   
   location.href = '/shop/main/200309Movie?actType=200309movie';   
</script> 
<% 
      out.println("[TANA] needlogin.jsp:: [OutFromURL]"+ OutFromURL); 
   } 
}   
 //   ---------------------------------------------------------------------------------------------------------- 
==============================================================================================================

Cookie cookie1 = new Cookie("CUS_ID", CUS_ID); 
cookie1.setPath("/"); 
cookie1.setMaxAge(-1);   
response.addCookie(cookie1); 

// String CUS_NAME2 = new String(CUS_NAME.getBytes("EUC-KR"),"ISO-8859-1"); 
Cookie cookie2 = new Cookie("CUS_NAME", CUS_NAME); 
cookie2.setPath("/"); 
response.addCookie(cookie2); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 23:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 로그인(쿠키 사용) 
http://test.mart.cc/mobile/loginfP.jsp?p_location=/mobile/noticelist.jsp  
----------------------------------------------------------------------------------------------------------

- 공지사항 리스트 
http://landmark.town.cc/mobile/noticelist.jsp?from=0&count=10 
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
----------------------------------------------------------------------------------------------------------
-공지사항 상세 리스트 
http://test.mart.cc/mobile/noticeitem.jsp?index=61 
==============================================================================================================

- 쇼핑몰 결제 수정 
카드 결제가 완젆히 끝난 후 SELLING_DT(매출일자) 등록  
ORDER_STS, -- 주문상태(00:카드승인오류) 
----------------------------------------------------------------------------------------------------------

- 노블레스CD구매 후 저장 안 됨 
김혜현 tibal2004(예전에 노블레스CD구매 후 반품 처리한 적 있음) ==> tibal2004/0000  
LG카드: 4009-0510-6764-9042 
황미례 SM (*/*) 
LG카드 T)1544-7000 
가맹점 번호:1376-0400/2334-2991  ==> 정태영 02)6009-1165 
----------------------------------------------------------------------------------------------------------

당일 카드결제 3번 구매 
==> addOrderMasterUP()에서 에러가 남 
원인: MNO = 643497만 데드락이 걸린 것으로 추정 
UPDATE T_MEMBER 
SET CDBUY_CD = '01'  --시디 구매여부(00:미신청 01:신청 02:설치 완료) 
WHERE MNO = 643497 
==============================================================================================================

- 210.123.133.31 www.i3shop.co.kr # 로컬 서버 
==============================================================================================================

-- 회원정보 조회 @@@@@@@@@@@@@  COMMIT 
SELECT  DOMAIN_NM 
FROM T_MEMBER 
WHERE MEM_ID = 'test01'; 

- 도메인 변경(노블레스CD 구매시) 
UPDATE T_MEMBER 
SET DOMAIN_NM = 'www.i3shop.co.kr' 
WHERE MEM_ID = 'test01'; 
==============================================================================================================
  
- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm  
L&B ==> ith3597/3597 02)2187-2778 윤정호 ---> 526-8328 안창석 
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596  
==============================================================================================================

*** 임철승   21wawa01 
20040824, 김정숙, 0100012004082400023, 20040824 
확인 부탁드립니다..... 
*  손대로 PM 한미 비자 카드 
kkgy77 양기석  
----------------------------------------------------------------------------------------------------------

dlog("[/CartBean.java]:[addOrderMasterUP()]: [SQL]====> \n "+ SQL); 
==============================================================================================================

- [쿠키 설정]
// 쿠기 생성 ----------------------------------------------------------------    
Cookie ck   = new Cookie("i3shop_id", util.getData("MEM_ID",memHash)); 
response.addCookie(ck);  
------------------------------------------------------------------------------------------------------ 

 // 쿠기 받기 ---------------------------------------------------------------- 
<%-- 로그인 여부 확인 --%>   
<%  
String MNAME = "noticelist.jsp";  
String m_cookie = "N";  

  Cookie[] cookies = request.getCookies();  
System.out.println("[/noticelist.jsp]:[cookies.length]"+ cookies.length);  

for( int i = 0; i < cookies.length; i++ ) { 
System.out.println("[/noticelist.jsp]:[cookies[i].getName()]"+ cookies[i].getName()); 
  System.out.println("[/noticelist.jsp]:[cookies[i].getValue()]"+ cookies[i].getValue()); 
  if(cookies[i].getName().equals("i3shop_id")) {  
    m_cookie = "Y"; 
  } 
}  
System.out.println("[/noticelist.jsp]:[m_cookie]"+ m_cookie);  

if(m_cookie.equals("N")) {   //쿠키가 존재 안하면   
   System.out.println("[/noticelist.jsp]:[TEST_000]"); 
%> 
<script language="javascript"> 
location.href = '/mobile/loginfP.jsp?<%=MNAME%>'; 
</script> 
<% 
return; 
} 
 //====================================================================================>   
%> 
==============================================================================================================
  
L&B...8월달 수불장 좀 뽑아주세요. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.03(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- 볼케이노 상품 가격대별 
==============================================================================================================

- LG모바일 서버 개발 
- 로그인(쿠키 사용) 
http://test.mart.cc/mobile/loginfP.jsp?p_location=/mobile/noticelist.jsp 
----------------------------------------------------------------------------------------------------------------------------

- 주문 배송 리스트 
http://test.mart.cc/mobile/orderlist.jsp?from=0&count=10&date1=20040901&date2=20040905 
----------------------------------------------------------------------------------------------------------------------------

- 주문 배송 상세 리스트 
http://test.mart.cc/mobile/orderitem.jsp?index=61 
----------------------------------------------------------------------------------------------------------------------------

- 공지사항 리스트 
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
----------------------------------------------------------------------------------------------------------------------------

- 공지사항 상세 리스트 
http://test.mart.cc/mobile/noticeitem.jsp?index=61 
----------------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)6300-6402 문의메일:*@*.* 
==============================================================================================================

한미카드 결재안되고 [구동중이 아닌 프로그램입니다] 라고  
오류메세지가 계속나온다고 확인부탁드립니다.  
정혜진   ddung05 
카드번호 : 4743-6140-0416-5561  한미카드 
==============================================================================================================

- 반품 수정 
재고부족으로 반품접수하여 
 회수완료까지되었는데 물류에서 내일 입고되어반품건 취소하고 그냥 배송해야되는데 현재 물품회수완료상태라서요, 
이건 반품접수 상태로 돌릴수있을까요? 아니면 아예 반품내역을 취소하던지 해야되는데 번거롭겠지만 확인부탁드립니다~ 
* 주문자; 김종호 //dc6502 

9/3일 반품번호: 00318 
20040901, 금강부동산, 0100012004090100094 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 로그인(쿠키 사용) 
http://test.mart.cc/mobile/loginfP.jsp?p_location=/mobile/noticelist.jsp 

- 주문 배송 리스트 
http://test.mart.cc/mobile/orderlist.jsp?from=0&count=10&date1=20040901&date2=20040905 
----------------------------------------------------------------------------------------------------------------------------

- 주문 배송 상세 리스트 
http://test.mart.cc/mobile/orderitem.jsp?index=2004090200567 
----------------------------------------------------------------------------------------------------------------------------
  
- 공지사항 리스트 
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
----------------------------------------------------------------------------------------------------------------------------

- 공지사항 상세 리스트 
http://test.mart.cc/mobile/noticeitem.jsp?index=61 
----------------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)6300-6402 문의메일:*@*.* 
==============================================================================================================

- 선택 확인 javascript(확인, 취소) 
if( p_tot_price > 0 ) {  //자사 상품이면 
if( p_tot_price < 30000 )  {   
if( p_ship_fee != -3000)  { //배송 수수료 -3000원을 안 넣을 때 
rr=confirm("총판매가(자사)가 3만원 보다 적으면 배송 수수료 -3천원을 넣어야 합니다.\n-3천원을 기입하시겠습니까?"); 
if (rr==true) 
{ 
editForm.p_ship_fee.focus(); 
return false; 
} 
} 
} 
} 
==============================================================================================================

- 국민카드 오류 
기타오류(9999) 
T)556-5513 효진씨 
김분선  sun1214 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2004.09.05(일) 작업 ■■■■■■■■■■■■■■■■
---> 15:00 ~ 20:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 수당 명세서 리스트 
http://test.mart.cc/mobile/wagelist.jsp?from=0&count=10&date1=20030901&date2=20040905 
----------------------------------------------------------------------------------------------------------------------------

- 수당 명세서 상세 리스트 
http://test.mart.cc/mobile/wageitem.jsp?index=2004090200567 
----------------------------------------------------------------------------------------------------------------------------

- 수당 명세서(통합) 
http://test.mart.cc/admin/allowance/allowanceMasterP.jsp 
----------------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)6300-6402 문의메일:*@*.* 
==============================================================================================================

- 황금철(hkc7) 노블레스 구매안됨 
9월 5일 
0100012004090500485 ==> BC카드로 900,000원 구매 
0100012004090500482 ==> 국민카드로 1,200,000원 구매 
아까 카드승인오류는 결제 되지 않은 것으로 확인 되었습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.06(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 00:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 수당 명세서 리스트 
http://test.mart.cc/mobile/wagelist.jsp?from=0&count=10&date1=20030901&date2=20040905 
----------------------------------------------------------------------------------------------------------------------------

- 수당 명세서 상세 리스트 
http://test.mart.cc/mobile/wageitem.jsp?index=71291 
----------------------------------------------------------------------------------------------------------------------------

- 수당 명세서(통합) 
http://test.mart.cc/admin/allowance/allowanceMasterP.jsp 
----------------------------------------------------------------------------------------------------------------------------

- 매출 보기 
http://test.mart.cc/mobile/saleaccount.jsp?date=200307 
dlog("[/MlmSvcBean.java]:[getSaleSummary()]: [SQL]====> \n "+ SQL); 
----------------------------------------------------------------------------------------------------------------------------

- 매출 보기(통합) 
http://test.mart.cc/admin/salemgr/saleManageP.jsp 
----------------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)6300-6402 문의메일:*@*.* 
==============================================================================================================

- 반품회수 완료 후 다시 노블레스CD 구매 가능 
노블레스 2개가 주문됨 확인 바랍니다.(현재 반품 접수 상태) 
주문자 : 박종길/kjgshop 
==============================================================================================================

- 확인서 
발신: i3shop 전산실 
수신: LG카드 담당자 
제목: 신용카드 정지 철회 요청 
==============================================================================================================

- 카드오류건 입니다. 
주문자 : 윤경옥 
아이디 : big63 
전화 문의자 : 이용규(PM) - 019/9699/3997 
8900 CAVV데이터오류  ====> VISA안심결제를 안하고 일반 결제해서 에러가 남 
bc card(537721) 
==============================================================================================================

- 김덕희(jjok1004) 
010001 20040818 00364 0100012004081800364 
--> lg card(승인성공:NICE)  --> 거래내역을 찾을 수 없습니다.(0416) --> 카드승인오류(00) 
010001 20040818 00353 0100012004081800353 
--> lg card(승인성공:NICE)  --> 거래내역을 찾을 수 없습니다.(0416) --> 카드승인오류(00) 
010001 20040818 00359 0100012004081800359 
--> lg card(승인성공:NICE)  --> 거래내역을 찾을 수 없습니다.(0416) --> 카드승인오류(00)   
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm   
R&F ==> LG직거래: its2023/its2023 
LG이외 모든 카드: itp3596/3596  
L&B ==> ith3597/3597 02)2187-2778 윤정호 ---> 526-8328 안창석 
==============================================================================================================

- 마감 서버 다운 @@@@@@@@@@2 
1. Apachectl 종료 
- cd /opt/IBMHTTPServer/bin 
./apachectl stop 

2. 클라이언트 종료 
- cd /opt/WebSphere/AppServer/bin 
./adminclient.sh 
--> Default 종료 
3. 서버 종료 
- cd /opt/WebSphere/AppServer/bin 
> ps -ef  grep admin 

> kill -9 971 
> killall java 
4. 클라이언트 종료 
- cd /opt/WebSphere/AppServer/bin 
./adminclient.sh 
==============================================================================================================

- 신용카드 에러 알림 
노블레스 DB 오류: N112, 노블레스 에러: N119 
T_ORDER DB 오류: O112, T_ORDER 에러: O119 

- OrderSvcBean.java에서 @@@@@@@@@  
public Hashtable addOrderMasterUP(Hashtable inputHash) throws Err { 
	try{   
		//결제정보 입력 
		nretHash = setMData(_nqryhash); 
		  
		//CD 키를 생성 하여 주문마스타와 연결 시킨다 
		addcdkey(inputHash); 
	} catch(Err err) { 
		log(MNAME+"["+getDate(Code.TM_YMDHMSM)+"] "+".addOrderMasterUP()","쿼리실행을 실패했습니다.\n\n[심각한 데이타 
		오류로 인해 카드 결제가 되었지만 &_ " + 
		"주문이 실패 했습니다.]\n반드시 콜센타로 문의 바랍니다. T)1688-1313 \n[오류번호: N112]" + NSQL + "\n" + err.getEXStr()); 
		throw err; 
	} catch(Exception e2) { 
		log(MNAME+"["+getDate(Code.TM_YMDHMSM)+"] "+".addOrderMasterUP()","에러 발생.\n" + e2.toString()); 
		throw new Err("A","1","E","["+getDate(Code.TM_YMDHMSM)+"] "+"[심각한 시스템 에러로 인해 카드 결제가 되었지만 &_ " + 
		"주문이 실패 했습니다.]\n반드시 콜센타로 문의 바랍니다. T)1688-1313 \n[오류번호: N119]"); 
	} 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.07(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 00:00 ~ 12:30 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 수당 명세서 리스트 =====> 현재월에서 가장 최근 매출 마감일, 기지급 분 수당만 보여 주기 
http://test.mart.cc/mobile/wagelist.jsp?from=0&count=10 

SELECT MAX(SALECLOSE_DT)   --매출마감일 
FFOM T_MEMALLOWANCE_SUM  
-----------------------------------------------------------------------------------------------------------------------

- 수당 명세서 상세 리스트 
http://test.mart.cc/mobile/wageitem.jsp?index=71291 
-----------------------------------------------------------------------------------------------------------------------

- 실지급수당관리(통합)  
/MLM관리/수당관리/수당지급/실지급수당관리 
/MlmMgr/allowanceMgr/allowanceRealMainP.jsp 
-----------------------------------------------------------------------------------------------------------------------

- 매출 보기 
http://test.mart.cc/mobile/saleaccount.jsp?date=200407 
dlog("[/MlmSvcBean.java]:[getSaleSummary()]: [SQL]====> \n "+ SQL); 
-----------------------------------------------------------------------------------------------------------------------

- 매출 보기(통합) 
http://test.mart.cc/admin/salemgr/saleManageP.jsp 
-----------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)02-6300-6401 문의메일:*@*.* 
==============================================================================================================

-- 매출기간 정보 조회 @@@@@@@@@@@@@ 
SELECT MAX(SALECLOSE_DT) AS SALECLOSE_DT, B.START_DT, B.END_DT --매출마감일 
FROM T_MEMALLOWANCE_SUM A, T_CLOSEDAYS B 
WHERE A.SALECLOSE_DT = B.MONTHALLOWANCE_CALC_DT 
GROUP BY B.START_DT, B.END_DT 
; 
==============================================================================================================

- LG모바일 서버 개발 
- 로그인(쿠키 사용) 
http://test.mart.cc/mobile/loginfP.jsp?p_location=/mobile/noticelist.jsp 
-----------------------------------------------------------------------------------------------------------------------

- 주문 배송 리스트 
http://test.mart.cc/mobile/orderlist.jsp?from=0&count=10&date1=20040701&date2=20040706 
-----------------------------------------------------------------------------------------------------------------------

- 주문 배송 상세 리스트 
http://test.mart.cc/mobile/orderitem.jsp?index=2004070600404 
-----------------------------------------------------------------------------------------------------------------------

- 공지사항 리스트 
http://test.mart.cc/mobile/noticelist.jsp?from=0&count=10 
-----------------------------------------------------------------------------------------------------------------------

- 공지사항 상세 리스트 
http://test.mart.cc/mobile/noticeitem.jsp?index=61 
-----------------------------------------------------------------------------------------------------------------------
  
- 수당 명세서 리스트 =====> 현재월에서 가장 최근 매출 마감일, 기지급 분 수당만 보여 주기 
date1=20040901&date2=20040905는 안 넘겨 주셔도 됩니다. 
http://test.mart.cc/mobile/wagelist.jsp?from=0&count=10 
-----------------------------------------------------------------------------------------------------------------------

- 수당 명세서 상세 리스트 
http://test.mart.cc/mobile/wageitem.jsp?index=71291 
-----------------------------------------------------------------------------------------------------------------------

- 매출 보기 
http://test.mart.cc/mobile/saleaccount.jsp?date=200407 
date에 년월만 넘겨 주세요 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- LG모바일 서버 개발 
- 수당 명세서 리스트 =====> 현재월에서 가장 최근 매출 마감일, 기지급 분 수당만 보여 주기 
http://test.mart.cc/mobile/wagelist.jsp?from=0&count=10 

리셀러 어드민/수당명세서 조회 
오늘 9월 8일(수)이면 
오늘의 가장 최근 매출마감일(20040805)을 가지고 와서 
200407 20040707 20040805 
기준년월(200407)에 해당하는 20040707 ~ 20040805 
수당지급처리상태가 지급완료(06)인 것 만 보여준다. 

20040830 지급 완료 후 원단위 절사나 기타 확인 과정으로 인해 
1주일 후 지급완료(06)가 됨 
-----------------------------------------------------------------------------------------------------------------------
- 수당 명세서 상세 리스트 
http://test.mart.cc/mobile/wageitem.jsp?index=71291 
-----------------------------------------------------------------------------------------------------------------------

- 실지급수당관리(통합)  
/MLM관리/수당관리/수당지급/실지급수당관리 
/MlmMgr/allowanceMgr/allowanceRealMainP.jsp 
-----------------------------------------------------------------------------------------------------------------------

- 매출 보기 
http://test.mart.cc/mobile/saleaccount.jsp?date=200407 
dlog("[/MlmSvcBean.java]:[getSaleSummary()]: [SQL]====> \n "+ SQL); 
-----------------------------------------------------------------------------------------------------------------------
- 매출 보기(통합) 
http://test.mart.cc/admin/salemgr/saleManageP.jsp 
-----------------------------------------------------------------------------------------------------------------------

- 이모빅스 양석호 팀장(*) 
http://www.emobix.com T)02-6300-6401 문의메일:*@*.* 
-----------------------------------------------------------------------------------------------------------------------

- 모바일 서버 설치: (.111번) 
콘솔에서 적용 
부하: 동시 접속자 20명 예상(30명으로 세팅 가능) 
용량: 100KB 이하 

클라이언트(LG 모바일 사용자) <--> 모바일 서버 <--> 웹 서버 
==============================================================================================================

-- 매출기간 정보 조회 @@@@@@@@@@@@@ 
SELECT MAX(SALECLOSE_DT) AS SALECLOSE_DT, B.START_DT, B.END_DT --매출마감일 
FROM T_MEMALLOWANCE_SUM A, T_CLOSEDAYS B 
WHERE A.SALECLOSE_DT = B.MONTHALLOWANCE_CALC_DT 
GROUP BY B.START_DT, B.END_DT 
; 
==============================================================================================================
  
- 월별 매출 분석 
/MLM관리/분석관리/수당기준매장별매출(/MlmMgr/AnalMgr/rptmagamstorep.jsp) 
2004년 08월 마감 매출현황(2004-08-06 ~ 2004-09-06) 
R&F: 4,801,622,130    L&B: 452,607,850 총합: 5,464,649,700 
-----------------------------------------------------------------------------------------------------------------------

- 2004년 07월 마감 매출현황(2004-07-07 ~ 2004-08-05) 
R&F: 2,156,109,360    L&B: 566,094,360 총합: 2,926,675,100 
==============================================================================================================

- /기초코드관리/MLM기초정보/MLM마감일코드  
MlmMgr/basicInfo/finishDayCodeMainP.jsp 
==============================================================================================================
   
- 고객 및 관리자에게 E-mail 자동발송기능이 다음 사항발생時 사이트上에서 이루어져야 한다고 판단됩니다.  
1. 신규회원가입時 
2. 매출발생時 
3. 회원경조사時 
4. 고객에게 현재 배송과정 통보 
5. 고객에게 상품이 제대로 수령됐지는 여부확인 
6. 가격 또는 신규상품 관련 수시 고객에게 통지 

이 기능은 관리자가 신경을 쓰지않더라도 서버가 자동적으로 수행하는 작업이며,  
여타 쇼핑몰 사이트에서는 이미 기본적으로 이루어지고 있고, 
원활한 회원관리를 위해서는 필수기능일 것입니다.  
==============================================================================================================

- 고용유지 교육 
1단계: 9/15 ~ 18 
2단계: 10/19 ~ 22 
==============================================================================================================

- 키카 축구화 
EAGLE 72,000원 
사이즈 : 265mm(5mm단위) 볼사이즈: (EE) 
http://www.kikamall.com/frontstore/Item/item_zoom.asp?item_num=16&catalog_num=136079&mart_id=kikamall&level=
&mother_catalog_num=136074 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제 변경 
/orderPutP_2_TG.jsp:카드 정보 MSTR로 넘기기(post방식 데이타 넘기기 불가능)(index.jsp) 
--> /orderPut_3_TG.jsp : 카드 정보 저장(dbpath.jsp) 
--> /orderPutP_4.jsp: 결제 확인 보이기(redirpath.jsp) 
==============================================================================================================

- 티지(I-yes 서울, I-yes 인천) 
https://npg.tgcorp.com/mdbop/login.jsp 
ID: i3shop9032 pass: i3shop9001 김응주 대리 02)3438-3564 
==============================================================================================================

- 디버깅  @@@@@@@@@ 
dlog("[/OrderSvcBean.java]:[updateBuyingRemittance()]: [SQL]====> \n "+ SQL); 
---------------------------------------------------------------------------------------------------------------- 

dlog("[/CartBean.java]:[addOrderInfo_tgisp_1()]:[p_order_dt]-->"+ getData("ORDER_DT",irowHash) +"" + 
"[p_merchant_cd]-->"+ getData("p_merchant_cd",irowHash) +"[p_storeout_dt]-->"+ getData("p_storeout_dt",irowHash) +"" + 
"[p_order_no]-->"+ getData("ORDER_NO",irowHash)); 
==============================================================================================================

- 카드 오류 확인(결제 로그 없음) 
이명순   midas13 
국민카드 isp 등록정상적으로 했는데도 결재하면 승인이 안된다고하세요..  
저희쪽으로 오류메세지 있는지 확인부탁드려요~  
카드번호 : 9410-4741-8277-8011   국민 
==============================================================================================================

[orderPut_3_TG.jsp]:[MSTR]아이쓰리샵11111111111[{p_company_cd=01, p_point=0, p_price=45000, p_store_cd=S001,
p_use_cmoney=0, p_bv=37500,  
p_cmoney_useyn=N, p_direct_cmoney=0, p_gift_yn=N, p_reseller_price=45000, p_merchant_cd=0001, p_category_cd=T11070201,  
p_direct_money=0, p_ship_cl_cd=03, p_bonus_item_cl=01, p_gift_no=0, p_gift_nm=0, p_cyberpv=5720, p_real_sale_price=45000,  
p_sale_price=45000, p_item_nm=자크로 석류 120ml*30포 , p_limit_sale_yn=N, p_c_saleprice=39280, p_old_qty=0, p_sale_max_qty=0,  
p_qty=1, p_cyberbv=28630, p_gift_seq_no=0, p_bank_pv=0, p_consumer_price=0, p_pv=37500, p_ar_way_cd=03, p_sale_min_qty=0,  
p_item_cd=00139334, p_limit_sale_qty=0}] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 구름 

- 쇼핑몰 수정
- 국민/BC카드(ISP결제) TG코프 결제 변경 
/orderPutP_2_TG.jsp:카드 정보 MSTR로 넘기기(post방식 데이타 넘기기 불가능)(index.jsp) 
--> /orderPut_3_TG.jsp : 카드 정보 저장(dbpath.jsp) 
--> /orderPutP_4.jsp: 결제 확인 보이기(redirpath.jsp) 
----------------------------------------------------------------------------------------------------------------

- TG코프 결제 NICE PAY로 변경(기타 카드: 시티, 축협) 
CallExternalSystemBeanForWeb.java에서 TG관련 사항 삭제 
==============================================================================================================

[/top.jsp]:[request.getQueryString()]p_store_cd=S001&p_category_cd=T03140106&p_item_cd=00011366&p_display_cd=01   
// 로그인후 되돌아올 주소 세션에 저장 
util.setSesValue("p_location",p_gourl,request); 
==============================================================================================================

out.println("[/top.jsp]:[Param_URL]"+ Param_URL); 
out.println("[/top.jsp]:[Now_URL]"+ Now_URL);  
[/top.jsp]:[request.getQueryString()]p_item_cd=00011366&p_display_cd=01&p_store_cd=S001  
[/top.jsp]:[request.getQueryString()]p_store_cd=S001&p_category_cd=T03140106 
==============================================================================================================

String url = HttpUtils.getRequestURL(request).toString(); 
String returnParam = request.getQueryString();  
HttpUtils.getRequestURL(request).toString()이문장은 url을 가져옵니다. 
만약 이페이지라면 http://www.jspschool.com/xxxx.jsp를 가져오게 되겠죠.. 

그리고 밑에 getQueryString()이 파라메타를 전부 불러오죠... 
파라메타가 aaa,bbb,ccc 이렇게 3개이고 각각의 값이 1,2,3이라면 
returnParam은 aaa=1&bbb=2&ccc=3이 되죠... 
그래서 두개를 연결하면 
url = url + "?" + returnParam; 
이렇게 쓰면 되겠죠... 
그럼 url의 값은 http://www.jspschool.com/xxxx.jsp?aaa=1&bbb=2&ccc=3이 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.11(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 비 

- 쇼핑몰 수정
- TG코프 결제 NICE PAY로 변경(기타 카드: 시티, 축협) 
CallExternalSystemBeanForWeb.java에서 TG관련 사항 삭제 
==============================================================================================================

- LG모바일 서버 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 구름 많음 

- 쇼핑몰 수정
- LG모바일 서버  수정 
<?xml version=”1.0”encoding=”euc-kr”> 
수치 항목 표기형태 통일 (',' 제거), 
orderitem.jsp에서 <pv>, <bv>태그의 값이 비어있음 ======================> ok 
==============================================================================================================

- 양숙자    icc02 
BC 카드결재시 계속적으로 오류난다고 확인요망.  
isp등록도 하고 isp 신용카드에 체크하고 결재한거라하심..   
카드번호 : 5377-1140-3224-5550  BC    5377114032245550  
==> icc02     거래거절 회선장애 다시하십시요 
==============================================================================================================

- 정수기 개발
- /입고관리/직납 입고 검수 
/BizMgr/DeliveryMgr/StoreIn/storeinCheckDirectP.jsp  
Debug.Print "[SearchBarcode()]:[SQL]" & SQL 
==============================================================================================================

[도서] 사계절 아동문고-40 마당을 나온 암탉 (반양장, ) 
[도서] (보급판) 정민 선생님이 들려주는 한시 이야기  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.15(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 06:40 ~ 23:00 ==> 구름 많음 
  
- 정수기 개발
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
ORDER_STS -- 주문상태(01:주문접수, 02:접수취소, 03:결재완료, 04:배송중, 09:배송완료) 
==============================================================================================================

- 콤보 에러 
신품교체 장채순 3번 입력 3번 모두 오류 
------------------------------------------------------------------------------------------------------------------ 

- 신품 교체 저장 
T_CALL,  T_CALL_CD 
GRD_ORDER.Clear 
------------------------------------------------------------------------------------------------------------------ 

- 장명숙 
주문일자: 20040913 
i3shop 주문번호가 없어서 나는 에러 
 ==============================================================================================================

-- 전체 조회 @@@@@@@@@@@@@ 
OPEN_ORDER_LIST_BY_ORDER 
------------------------------------------------------------------------------------------------------------------ 

-- 민원 조회(개별) @@@@@@@@@@@@@  
OPEN_DEPENDCALL_LIST  
==============================================================================================================

- 민원 유형(콤보박스) 
SELECT   CODE_NM 
FROM      T_CODE 
WHERE   (CODE_GROUP = '0009') 
ORDER BY CODE 
-------------------------------------------------------------------------------------------------------------- 

- 후레쉬워터전송파일 적용 
BEGIN TRANS 
-- UPDATE T_ORDER  
SET  ENTR_NO = 1, ORDER_STS = '01'  --거래처 코드(1:후레쉬 워터), 주문상태(01:주문접수) 
WHERE I3SHOP_ORDER_NO = '0100012004080200353'  
AND ORDER_STS = '03' -- 주문상태(01:주문접수, 03:결재완료) 

COMMIT TRANS -- 확정 
ROLLBACK TRANS --  취소 
---------------------------------------------------------------------------------------------------------- 

CASH_DT = '20040915'  -- 입금 일자 
김보린 전화 - 입금일자 최초 날짜 그날 부터 현재까지 
---------------------------------------------------------------------------------------------------------- 

- 주문일자 
p_ORDER_DT = Left(DTPicker_OrderDt.Value, 4) + "" + Mid(DTPicker_OrderDt.Value, 6, 2) + "" + Right(DTPicker_OrderDt.Value, 2)   '주문일자 
==============================================================================================================

- 재고 조정 등록  
임의 출고로 인한 재고 조정 
00026183
http://int.i3shop.com/BizMgr/ItemStockMgr/stockAdjustMainP.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.16(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 23:00 ==> 비 후 맑음 
  
- 정수기 개발
- 입고관리 설계
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
ORDER_STS --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
==============================================================================================================

- 수정 사항 
1. 주문정보에서 반품 조회 가능 
2. 하위 개인 정보 민원유형 선택없이 수정 가능 
==============================================================================================================

-- 민원 유형  콤보 조회 @@@@@@@@@@@@@  
SELECT   A.CALL_CD, B.CODE_NM 
FROM T_CALL_CD A INNER JOIN 
T_CODE B ON A.CALL_CD = B.CODE AND B.CODE_GROUP = '0009' 
WHERE (A.CALL_NO = 144) 
==============================================================================================================

-- 전체 조회(TEST ) @@@@@@@@@@@@@  
SELECT ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM, 
	ORDER_TYPE, -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체)  
	ORDER_STS, --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
	 INSTALL_STS, DELIVER_STS, --설치상태(01:처리보류 02:설치완료, 03:미설치, 04:설치), 배송상태(01:처리보류 02:설치완료, 
	 03:미설치, 04:설치) =====   
	 I3SHOP_ITEM_NM, CASH_DT, REG_DT 
FROM T_ORDER 
WHERE  I3SHOP_ORDER_NO = '0100012004090800101' 
	AND RETURN_DT IS NULL   
	AND ORDER_DT >= '20030910' AND ORDER_DT <= '20040915'  
	--AND RECV_NM = '김흥규' 
==============================================================================================================

- 이관( 02:휘레쉬 이관 완료)이 안됨 
- 0100012004072700477 
- 0100012004071900535  
---------------------------------------------------------------------------------------------- 
tibal2004  
0100012004082800317  -- 반품 건 
==============================================================================================================

- 후레쉬워터 연락처 
031)763-2577(302) 김인환 *@*.*  
763-2573 김교혁 
031)763-1413 김인환 과장님  
==============================================================================================================

- ToolTipText 
목록에서 제목위에 마우스 가져다 놓을 경우 일정시간이 지나면 설명 박스가 뜨는 것 구현 
==============================================================================================================

-- 민원 조회 @@@@@@@@@@@@@  
SELECT   * 
FROM      T_CALL 
WHERE   (RECEIPT_DT = '20040916') 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 ==> 맑음 
  
- 정수기 개발
- 입고관리 설계  
- 입고관리/직납 입고 검수 
/BizMgr/DeliveryMgr/StoreIn/storeinCheckDirectP.jsp 
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
==============================================================================================================

- 정수를 문자열로   
Dim a As Integer 
a = 100 
Dim str As String 
str = CStr(a) 
==============================================================================================================

- 공인 인증서 사용 
30만원 미만일 경우  ==> 공인 인증서 미 사용 
==============================================================================================================
 
 For I = 0 To MFG.Cols - 1 
        MFG.Row = SELrow 
        MFG.Col = I         

        If Len(MFG.Text) = 4 And MFG.Text > "T000" And MFG.Text < "T999" Then 
            '// 해당 열중에 원하는 글자인 경우 
            MFG.CellBackColor = RGB(255, 0, 0) 

        Else 
            '// 해당열인경우 
            MFG.CellBackColor = RGB(255, 255, 0) 
        End If 
Next 
==============================================================================================================

- ER-WIN에서 
Tools --> Report Builder  
New--> Report Template Builder 
ERW_EXCEL.rtb 파일 사용(기존 롯데 삼강 파일) 
==============================================================================================================

- 일요일 미이관으로 빠뜨린 것 
아래 2건은 입금일자(매출일자)가  토요일(20040911) 여서 
일요일날 이관을 안 해서 데이타가 존재하지 않은 겁니다. 
------------------------------------------------------------------------------------------------------ 

0100012004090700040 
0100012004091100161 
이 두건 발주 아예 정수기 전산에 등록도 되지 않았네요~~` 
고객과 상담하다가 아무리 조회해도 안나오길래...... 
일단 등록 부탁드립니다~~ 
==============================================================================================================

-- 민원 조회 @@@@@@@@@@@@@  
SELECT   * 
FROM      T_CALL 
WHERE   (RECEIPT_DT = '20040916') 
AND ORDER_NM ='문일련' 

- 정창숙 
0100012004090600666 
------------------------------------------------------------------------------------------------------ 

성함: 문일련 
a/s접수일자(전산 등록일자) -->9/16일........ 
혹시 몰라서 주소도 보내드려요~~ 

※참고사항 
대구 달서구 본동 682-2번지 리치빌 601호 
물이 나오지 않음으로 접수한건임~~~ 
==============================================================================================================

If MsgBox("현재의 개인 정보를 수정 하시겠습니까?", vbOKCancel, "개인정보 수정") = vbOK Then 
	MsgBox("[개인정보 수정 시행]") 
end if 
==============================================================================================================

- 입고관리 협의 
도원텔레콤 T)767-5555 김기철 차장 H)011-828-9344 *@*.* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.18(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 20:00 ==> 비 
  
- 정수기 개발
- 입고관리 설계  
- 입고관리/직납 입고 검수 
/BizMgr/DeliveryMgr/StoreIn/storeinCheckDirectP.jsp 
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
==============================================================================================================

- 본부영업관리/구매관리/발주대상상품 조회 
(/BizMgr/BuyingMgr/PlacingOrderMgr/tempPoEditUnityP.jsp)  ----> getRecomPoItemList() 
==============================================================================================================

- 피은지(beauty/3766) 
구매관리- 발주대상상품 조회- dep:960   업체코드:33011(참존 경산전문점) 
IMU를 -1~1로 수정하셔서 조회해보세요.... 
상품 가지수가 300개가넘는데 299개 밖에 조회가 안됩니다. 
==============================================================================================================

-- 민원 조회 @@@@@@@@@@@@@  
SELECT   * 
FROM      T_CALL 
WHERE   (RECEIPT_DT = '20040916') 
AND ORDER_NM ='문일련'  
--------------------------------------------------------------------------------------------------------- --  
 
성함: 문일련 
a/s접수일자(전산 등록일자) -->9/16일........ 
혹시 몰라서 주소도 보내드려요~~ 
--------------------------------------------------------------------------------------------------------- --  

※참고사항 
대구 달서구 본동 682-2번지 리치빌 601호 
물이 나오지 않음으로 접수한건임~~~ 
==============================================================================================================

create table kana_sawon( 
	said varchar(20) not null primary key, 
	saname varchar(20), 
	sajikname varchar(20) not null references kana_jik (jikid) 
) 

EX> 
1. FOREIGN KEY 생성 
alter table slimtable_log add 
Constraint FK_slimtable_log Foreign Key(id) References slimtable(id) 

2. FOREIGN KEY 지우기. 
2-1. ALTER TABLE SLIMTABLE_LOG DROP 
COMSTRAINT FK_slimtable_log  -- CONSTRAINT 해제 

2-2. ALTER TABLE SLIMTABLE_LOG DROP COLUMN ID 
전 이렇게 하면 FOREIGN KEY로 지정된 COLUMN이 지워지더라구여.. 
==============================================================================================================

-- CONSTRAINT 해제 
ALTER TABLE T_ENTER DROP COMSTRAINT FK__T_ENTER_D__ENTR___4183B671  

ALTER TABLE T_IN_PO DROP COMSTRAINT FK__T_ENTER_D__ENTR___4183B671  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> 비 
  
- 정수기 개발
- 입고관리 수정
SELECT   * FROM      T_ENTER_2 ORDER BY REG_DT DESC 
DELETE T_ENTER_DTL_2 
SELECT   * FROM      T_ENTER_DTL_2 ORDER BY REG_DT DESC 
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
==============================================================================================================

- 민원유형 조회 
SELECT * FROM T_CODE 
WHERE   (CODE_GROUP = '0009 ') 
----------------------------------------------------------------------------------------------------- 

- 민원유형 추가 
INSERT INTO T_CODE(CODE_GROUP, CODE, CODE_NM, REG_DT, REG_ID) 
VALUES('0009', '32', '마이콤 불량',  '20040920',  'tamario') 

INSERT INTO T_CODE(CODE_GROUP, CODE, CODE_NM, REG_DT, REG_ID) 
VALUES('0009', '33', 'mood lamp LED 불량 추가',  '20040920',  'tamario') 
----------------------------------------------------------------------------------------------------- 

- 민원유형 수정 
UPDATE  T_CODE 
SET         CODE = 32, CODE_NM = '마이콤 불량', REG_DT = '20040920', REG_ID = ' tamario' 
WHERE   (CODE_GROUP = '0009 ') 
==============================================================================================================

-- 주문자 미확인 조회(14개 존재) 
SELECT   I3SHOP_ORDER_NO, ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM, ORDEREXIST_YN, 
                ORDER_TYPE, ORDER_STS, INSTALL_STS, DELIVER_STS, I3SHOP_ITEM_NM,  
                CASH_DT, REG_DT 
FROM      T_ORDER 
WHERER (I3SHOP_ORDER_NO LIKE '%주문자%') AND ORDER_NM = '김명숙'  
-- WHERE ORDEREXIST_YN ='Y'  
(I3SHOP_ORDER_NO LIKE '%주문자%') 
----------------------------------------------------------------------------------------------------- 

-- UPDATE  T_ORDER 
SET ORDEREXIST_YN ='Y', I3SHOP_ORDER_NO = '' 
FROM      T_ORDER 
WHERE   (I3SHOP_ORDER_NO LIKE '%주문자%') 
==============================================================================================================

- 트리거 조회 
SELECT   name FROM sysobjects 
WHERE   (type = 'TR') -- CPPY_TO_ORDER 트리거 조회됨 
----------------------------------------------------------------------------------------------------- 
SELECT * FROM T_CALL  
WHERE (ORDER_NM = '김명숙') AND (REG_DT = '20040920') 
----------------------------------------------------------------------------------------------------- 
SELECT   * 
FROM      T_ORDER 
WHERE (ORDER_NM = '김명숙') AND (REG_DT = '20040920') 
==============================================================================================================
 
- NULL 값 처리 
If IsNull(Rs(5)) = True Then txtItem_cd.Text = 0 Else txtItem_cd.Text = IsNull(Rs(5))    '상품코드 
==============================================================================================================
  
- 숫자만 입력 
If IsNumeric(Text_OrderNo.Text) = False Then    '주문번호 이면 
    MsgBox "주문번는 숫자형식만 가능합니다!" 
            Text_OrderNo.SetFocus 
End If 
==============================================================================================================

SELECT   * 
FROM      T_ORDER 
WHERE   (ORDER_DT = '20040920') AND (ORDER_NM = '김명숙')     -- 0100012003092100565 
----------------------------------------------------------------------------------------------------- 

 UPDATE  T_ORDER 
SET CALL_COMMENT ='7월달분 누락분..우선처리함', BIGO = '산소발생기소음',  I3SHOP_ORDER_NO = '0100012003092100565'  
WHERE   (ORDER_DT = '20040920') AND (ORDER_NM = '김명숙') 
----------------------------------------------------------------------------------------------------- 

 UPDATE  T_CALL 
SET CALL_COMMENT ='7월달분 누락분..우선처리함', BIGO = '산소발생기소음'   
WHERE   (ORDER_NM = '김명숙') AND (REG_DT = '20040920') 
==============================================================================================================

SELECT   * 
FROM      T_CALL_CD 
--WHERE  CALL_NO='641' 
WHERE  CALL_NO='641' AND SEQ_NO =2 AND CALL_CD ='01' 
----------------------------------------------------------------------------------------------------- 

DELETE    T_CALL_CD  
WHERE  CALL_NO='641' AND SEQ_NO =2 AND CALL_CD ='01' 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.09.21(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 맑움 
  
- 정수기 개발
- Cron job 작업 
매일 오전 4시에 정수기 마감 작업 실행 
-------------------------------------------------------------------------------------------------------------------

- Pakage 디버깅 
% 선언부 Complie 후 본문(Body)  Complie 할 것 
-------------------------------------------------------------------------------------------------------------------

Error on line 0 
CALL PKG_WELL_WATER_MAGAM.DAY_WELL_WATER_INSERT('') 

ORA-04068: 패키지의 기존 상태가 버려졌습니다 
ORA-04067: 실행불가, package body "IIISHOP.PKG_WELL_WATER_MAGAM"가 존재하지 않습니다 
ORA-06508: PL/SQL: 호출되는 lib 단위를 발견할 수 없습니다 
ORA-06512: 줄 1에서  
---------------------------------------------------------------------------------------------------------------------

Error on line 0 
CALL PKG_WELL_WATER_MAGAM.DAY_WELL_WATER_INSERT('') 
ORA-04063: package body "IIISHOP.PKG_WELL_WATER_MAGAM"가 오류가 있습니다 
==============================================================================================================

- Jobs 실행(TRANS_WELL_WATER): 정수기 데이타 이관 
매일 오전 5시에 정수기 마감 작업 실행 
==============================================================================================================

SELECT   * FROM      T_ENTER_2 ORDER BY REG_DT DESC 
DELETE T_ENTER_DTL_2 
SELECT   * FROM      T_ENTER_DTL_2 ORDER BY REG_DT DESC 

Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql 
==============================================================================================================

--후레쉬워터전송파일(.xls) 적용 @@@@@@@@@@@@@ 
SELECT ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM, 
	ORDER_TYPE, -- 주문구분(01:설치 02:콜, 03:이전설치, 04:반품, 05:주문취소, 06:신품교체)  
	ORDER_STS, --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관[20040831 이전DATA], 04:설치완료) 
	 INSTALL_STS, DELIVER_STS, --설치상태(01:처리보류 02:설치완료, 03:미설치, 04:설치), 배송상태(01:처리보류 02:설치완료,
	 03:미설치, 04:설치) =====   
	 I3SHOP_ITEM_NM, CASH_DT, REG_DT 
FROM T_ORDER 
WHERE I3SHOP_ORDER_NO = '0100012004080400471'  
-------------------------------------------------------------------------------------------------------------- 

--후레쉬워터전송파일 수정 @@@@@@@@@@@@@ 
-- UPDATE T_ORDER  
SET  ENTR_NO = 1,  
CASH_DT =  '20040921', --입금일자(이관 수행 하루 전 날짜) 
ORDER_STS = '01', --거래처 코드(1:후레쉬 워터), 주문상태(01:주문접수)   
INSTALL_STS = '01', --설치상태(01:처리보류)  
DELIVER_STS = '01' --배송상태(01:처리보류)  
WHERE I3SHOP_ORDER_NO = '0100012004080400471'   
-------------------------------------------------------------------------------------------------------------- 

0100012004081400194  장인수 
0100012004081400201  장인수 
0100012004083000571  김재광 

0100012004080400471 
-------------------------------------------------------------------------------------------------------------- 

DELETE FROM T_ORDER 
WHERE  I3SHOP_ORDER_TYPE ='01' --I3SHOP주문유형(01:정상주문, 05:반품주문) 
AND  ORDER_NO = (  
SELECT SELLING_DT 
FROM   IIISHOP..IIISHOP.T_DEPEND_ORDER 
WHERE  PROC_YN <> 'Y' --이관여부(이관 안 된 것) 
AND ORDER_TP = '01'   
) 

0100012004060100487  박은정 
0100012004083000339  박순희 
0100012004072600592  정재명 
-------------------------------------------------------------------------------------------------------------- 

- 카드 정상 결제 후 미 저장(국민카드) 
0100012004092100327 고현주 
----------------------------------------- 

00150245 애경 종합 4호 4개 박스 
00142070 백설참기름5호(500ml*1,110ml*3) 
00142070 백설참기름5호(500ml*1,110ml*3) 
00142070 백설참기름5호(500ml*1,110ml*3) 
00142070 백설참기름5호(500ml*1,110ml*3) 
00142070 백설참기름5호(500ml*1,110ml*3) 
00150317 동원리챔2호 
00141791 고려양봉원 토종 절편 벌집꿀 2.4kg 
==============================================================================================================

- 포커스 맞춤 
Text_OrderNo.SetFocus 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2004.09.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30 ==> 맑음 
  
- 정수기 개발
- 입고관리 수정 
52 정수기(00137113)  
txtReg_Date.Text = Replace(Date, "-", "") '등록일자 
Debug.Print "[OPEN_ORDER_LIST_BY_ORDER()]:[SQL]============>" & Sql  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.09.23(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:40 ==> 맑음 
  
- 정수기 개발
- 입고, 출고관리 수정  
52 정수기(00137113), 필터교환권(교환비용)(00142161)   
==============================================================================================================

If InStr(Text1, ".") > 0 Then '소숫점이 있을때 
Text1 = Format(Text1, "#,##.##########") 
Text1.SelStart = Len(Text1) 
Else '소숫점이 없을때 
Text1 = Format(Text1, "####,####,####,###") 
Text1.SelStart = Len(Text1) 
End If 
---------------------------------------------------------------------------------------- 

.TextMatrix(Lng_Loop, 5) = Format(Trim(Rs(5)), "####,####,####,###") '입고가 ========== 
==============================================================================================================

- MaskEdit 
private sub msk010_lostfocus() 
	msk010=format(msk010,"000,000,000") 
end sub 
==============================================================================================================
  
Private Sub Text1_LostFocus() 
    Text1.Text = Format(Text1.Text, "###,###,###.##") 
End Sub 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2004.09.24(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 23:00 ==> 맑음 
  
- 정수기 개발
입고, 출고관리 수정  
52 정수기(00137113), 필터교환권(교환비용)(00142161) 
==============================================================================================================
  
- 이전 자료 5건 수정 
0100012004081400091 임순자 
0100012004083111135  엄순선  
0100012003120400839  윤성인  
0100012004061800348  최영화  
0100012004021200577  박정자  
==============================================================================================================

- oracle 에게 한번에 sql 명령을 주워 결과만 return 하는것이 상당한  
-- UPDATE T_ORDER 
SET  REG_ID  IN(   SELECT  B.REG_ID 
                      FROM T_ORDER A, T_CALL B 
                      WHERE A.I3SHOP_ORDER_NO = B.I3SHOP_ORDER_NO 
AND A.REG_DT >='20040902'   -- 주문일자 
                 AND A.REG_DT <='20040902' 
) 
WHERE  REG_DT >='20040902'   -- 주문일자 
AND REG_DT <='20040902' 
------------------------------------------------------------------------------------------------------  
  
SELECT * FROM T_ORDER A 
WHERE  A.REG_DT >='20040902'   -- 주문일자 
       AND A.REG_DT <='20040902' 
==============================================================================================================

- 민원접수관리 수정 
엑셀 출력  
==============================================================================================================

- 대금정산 반품 주문 확인 
/VendorMgr/SettleInfo/storeOutDtlP.jsp?page_title=대금정산 

(주)규수방 B0000702/4555 
02 반품 0100012004092000076 --> 원주문번호(0100012004091700141) 
01 정상 0100012004091700141   
02 반품 0100012004092000076 --> 원주문번호(0100012004091700141) 
----------------------------------------------------------------------------------------------------------------- 

T_STOREOUT_DTL 테이블에서  
20040920에 주문을 하고 다시 반품을 치고 반품 출고일자(REAL_STOREOUT_DT)  20040920)로 됨 
20040921에 새벽에 출고일자(REAL_STOREOUT_DT)  20040920로 인식 마감을 돌림 ===> 반품 마감 생성 
20040922에 출고일자(REAL_STOREOUT_DT)  20040922로 수정함 
20040923에 새벽에 출고일자(REAL_STOREOUT_DT)  20040922로 인식 마감을 돌림 ===> 반품 마감 생성 
==============================================================================================================

- 증권발급금액 수정 
- 현금 이외일 경우 증권발급금액 수정 @@@@@@@@@ 
// 주문마스타 수정  
String SQL = "UPDATE T_ORDER  \n" + 
"SET ORDER_STS = '"+ Str_order_sts +"'  \n"; //(03: 결재완료) 
if(getData("p_ar_way_cd",inputHash).equals("02")){ //카드결제(02:카드) 이면  ================= 
SQL +=" , SELLING_DT = '"+ getData("p_selling_dt",inputHash) +"'  \n" ; // 매출일자 
} 
SQL +=" , BILL_AMT = '"+ getData("p_bill_amt",inputHash) +"'  \n" ; // 증권발급금액 
------------------------------------------------------------------------------------------------------------------- 

- PV가 있는 상품을 대상으로 공제금액 계산 
bill_amt += (parseInt(getData("p_real_sale_price",rowHash)) * parseInt(getData("p_qty",rowHash))); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.25(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 맑음 
  
- 정수기 개발
- 주문 출력, 민원 출력 수정(엑셀 출력)  
==============================================================================================================

- Package 생성 
배포마법사에서 파일이 없는 경로입니다...... 오류 생성 
C:\WINNT\system32\cc_cExcelPrint.dll로 경로 변경 
==============================================================================================================

- 자동화 오류(win98) 
 MSFlexGrid의 데이터를 엑셀로 저장하는 도중 아래와 같은  
런타임 오류가 발생합니다. 

- 2147023067(80070725)런타임 오류가 발생 했습니다.  
제 컴파일 환경은 XP인데, XP, ME에서 저장할때는 문제없이 잘되구요. 
윈도우 98에서 위와 같은 에러가 나네요... ㅡㅡ; 
무엇이 문제일까요...?  

98에 설치시에도 문제 없는 것으로 보면... 
배포의 문제는 아닌듯하고 DCOM98이 관련될가 싶어 
새로 설치도 해봤지만 마찬가지네요...   
----------------------------------------------------------- 

- 자동화 오류(win98) 
엄...전 오피스2000을 쓰는데요... 
 윈도우2000에서 작업했구요... 
 그러다가 xp인데 설치하고 실행하니 안되더라구요... 
 에러코드가 뭐였는진 정확히 기억이 안납니다만...ㅠㅠ 

 2003과 xp는 잘 모르겠지만... 
 2000과 xp는 확실히 ocx인지 dll인지가 다릅니다!!! 
 2000에선 EXCEL9.OLB인가...를 참조하잖아요~~근데 xp오피스 군에선 EXCEL.OLB이던가? 그렇더라구요~~~  

 제가 테스트 설치해봤을땐 그랬는데...  
 님의 환경에선 어떨지 모르겠네요~~  
==============================================================================================================

- 현상 
개발 솔루션을 클라이언트 데스크톱에 배포한 후에 Microsoft Office 응용 프로그램이나  
다른 out-of-process COM 서버를 자동화하려고 하면 솔루션이 실패합니다.  
다음과 같은 오류가 보고됩니다. 

오류: 0x80070725 (-2147023067) 
설명: RPC 중 호환되지 않는 버전입니다. 

이 문제는 Microsoft Windows XP 기반 클라이언트에서는 발생하지 않습니다. Microsoft Windows  
운영 체제의 이전 버전을 실행하는 클라이언트에서만 발생합니다.  
원인 
이 문제는 솔루션의 설치 프로그램이 Microsoft Visual Studio 또는 Microsoft Platform SDK에 들어 있는  
재배포 가능한 버전 대신 Windows XP용 OLE 자동화 시스템 파일을 설치하는 경우 발생합니다.  
Oleaut32.dll의 이전 빌드와 달리 Windows XP용 버전은 이전 버전의 Windows 운영 체제에는 사용할 수 없습니다. 

다음 표는 설치된 OLE 자동화 시스템 파일, Windows XP 버전 및 Visual Studio 재배포 가능한 버전의 현재 버전 번호를 나열합니다. 

OLE 자동화 파일 Windows XP 버전 Visual Studio 재배포 가능한 버전  
Oleaut32.dll 3.50.5014.0 2.40.4275.1  
Asycfilt.dll 3.50.5014.0 2.40.4275.1  
Stdole2.tlb 3.50.5014.0 2.40.4275.1  
Olepro32.dll 5.0.5014.0 5.0.4275.1  
==============================================================================================================

- 해결 방법 
응용 프로그램 설치에서는 Microsoft Visual Studio에서 제공하는 재배포 가능한 OLE 자동화 파일을 사용해야 합니다.  
예를 들어, Microsoft Visual Basic에서 개발하는 경우 이러한 파일은 패키지 및 배포 마법사(PDW)용 재배포 디렉터리에 있습니다. 

 [VSInstallLocation]\VB98\Wizards\PDWizard\Redist 

Visual Studio용 서비스 팩 5가 설치되어 있지 않은 경우 OLE 자동화 시스템 파일의 최신 재배포 가능한 버전을  
다운로드하고 설치할 수 있습니다. 자세한 내용은 Microsoft 기술 자료의 다음 문서를 참조하십시오.  
290887 FILE: VBRun60sp5.exe가 Visual Basic 6.0 SP5 런타임 파일을 설치한다  

잘못된 OLE 자동화 시스템 파일이 설치된 컴퓨터의 경우 다음을 수행하여 문제를 해결해야 합니다. 

문제를 일으키는 솔루션을 제거한 다음 올바른 버전을 설치하는 새로운 설치 프로그램을 소프트웨어 공급업체로부터 구합니다. 
Windows XP 이전 버전의 운영 체제를 실행하는 다른 컴퓨터에서 Q290887로부터 OLE 자동화 시스템 파일의  
최신 재배포 가능한 버전을 다운로드하고 설치합니다. 이러한 파일을 설치할 Windows XP 이전 버전의  
컴퓨터가 따로 없는 경우 Microsoft 고객기술지원부에 문의하여 이러한 파일의 사본을 구합니다.  
이렇게 하려면 다음 Microsoft 웹 사이트를 방문하십시오. 
http://support.microsoft.com/default.aspx?scid=fh;KO;KBHOWTO 

같은 버전의 운영 체제를 실행하고 있으며 원래 이 오류를 일으킨 설치 프로그램이 설치되어 있지 않은 다른 컴퓨터에서  
이 문서의 "원인" 절에 있는 표에 나열된 파일을 수동으로 복사합니다. Windows 디렉터리에 있는  
System 하위 디렉터리(또는 Microsoft Windows NT와 Windows 2000의 경우 System32 하위 디렉터리)에 파일을 복사합니다.  
파일 시스템 보호 기능이 설정된 Windows 2000을 실행 중인 경우에도 이러한 파일은 System 디렉터리의 DllCache 하위 디렉터리에 복사해야 합니다. 
컴퓨터를 다시 시작합니다. 
1단계에서 구한 새 설치 프로그램을 사용하여 솔루션을 다시 설치합니다. 

http://support.microsoft.com/default.aspx?scid=kb;ko;320108 
http://support.microsoft.com/default.aspx?scid=kb;KO;290887 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2004.09.30(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 ==> 맑음 
  
- 정수기 개발
- 주문 출력, 민원 출력 수정(엑셀 출력)   
SELECT *   
FROM T_ORDER 
WHERE ORDER_DT >= '20040930' AND ORDER_DT <= '20040930' 
      AND ORDER_NM = '안병호' 
------------------------------------------------------------------------------------------------------ 

UPDATE  T_ORDER 
SET  I3SHOP_ORDER_NO ='' 
FROM T_ORDER 
WHERE ORDER_DT >= '20040930' AND ORDER_DT <= '20040930' 
      AND ORDER_NM = '안병호' 
==============================================================================================================

- 반품 회수 취소 
BizMgr/SaleMgr/WebOrderMgr/returnItemOrderWithdrawP.jsp 
 collectReturnOrderReq() --> setOrderStsProdure() 
  
if( p_ship_sts == null  p_ship_sts.equals("0")) { 
SQL += " WHERE  "; 
} else if( p_ship_sts.equals("22")  p_ship_sts.equals("27")) {  배송상태가 물품회수대기(21) 이면(반품회수일자 기록) 
반품 회수 취소(27) 이면(회수 취소일자,  반품회수일자 기록) 
SQL += "  , RETURNRECALL_DT = TO_CHAR ( SYSDATE , 'YYYYMMDD') WHERE      "; 
} else { 
SQL += " WHERE  "; 
}   
SQL += " COMPANY_CD = ? AND MERCHANT_CD = ? AND ORDER_DT = ? AND ORDER_NO = ? AND SEQ_NO = ?  "; 
==============================================================================================================

수정 ========> 반품회수완료일(RETURNRECALL_DT) 사용 안 함 
T_ORDER_DTL 테이블 RETURNRECALL_DT: 반품회수완료일(접수취소일) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
