

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2007.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2007.12.01(토) 작업 ■■■■■■■■■■■■■■■■■
---> 09:00 ~ 13:00 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000  
==============================================================================================================

- 청계천 도보(12:00 ~ 16:30): 청계천 1가 <-> 청계천 9가(동대문) <-> 성동구(한양대) 
==============================================================================================================

- 서울시 버스 요금 
일반: 900원(10㎞를 초과하면 5㎞마다 100원씩 추가) 
일반좌석: 1,200원 
고급좌석: 1,300원: 교통카드  
---------------------------------------------------------------------- 
- 경복궁역 <-> 서울역 가는 버스 노선 
종로11번(마을버스) ==> 추천 
노선: 삼청동-서울역, 차비: 700원, 첫차: 06:00분 막차: 23:00분, 배차: 5~8분  
종로09번(마을버스) 
노선: 옥인아파트-남대문, 차비: 700원, 첫차: 06:00분 막차: 23:30분, 배차: 5~8분 
고궁순환 버스:  
노선: 광화문-서울역, 차비: 600원, 첫차: 09:00분 막차: 19:00분, 배차: 8분  
1711번:  
노선: 국민대-공덕동, 차비: 900원, 첫차: 04:30분 막차: 23:00분, 배차: 8분   
7016번:  
노선: 은평차고지-상명대, 차비: 900원, 첫차: 04:30분 막차: 23:00분, 배차: 11분    
7022번:  
노선: 구산동-서울역, 차비: 900원, 첫차: 04:30분 막차: 23:00분, 배차: 12분   
143번: 
노선: 압구정역 <-> 종각역, 차비: 900원, 첫차: 04:00분 막차: 22:00분, 배차: 12분  
==============================================================================================================

 - BIS자기자본비율 > 8%, 고정이하여신비율 < 8%  
BIS자기자본비율과 고정이하여신비율 8% 기준을 적용해보는건데요.  
BIS자기자본비율 >8%(높은 수치가 좋음), 고정이하여신비율<8%(적은 수치가 좋음) 
이른바 8.8클럽이라고 하는데 얼마나 은행 자본이 건전하게 운영되는가를 보는 기준입니다.   
자산규모 상위 15개 업체 가운데서도 부실여신 비율 8.0% 이하인 곳은 솔로몬, 부산, 부산2, 토마토 등  
4개에 불과했다.   
--------------------------------------------------------------------------------   

 - [저축 은행]  
1. 프라임 저축은행(http://www.hsb.co.kr): 2호선 시청역 6번 --> 1년: 7.10% BIS: 9.16%  
1년 복리: 7.44% 
2. HK 저축은행(http://www.hksb.co.kr): 4호선 회현역 6번 --> 1년: 7.00% BIS: 6.76%   
1년 복리: 7.32% 
3. 푸른 저축은행(http://www.pureunbank.co.kr): 2호선 을지로입구역 2번 --> 1년: 7.10% BIS: 8.52%  
1년 복리: 7.335%  ===> : 만기 출금은 직접 방문 
4. 솔로몬 저축은행(http://www.solomonbank.com): 3호선 을지로3가역 9번 --> 1년: 6.80% BIS: 9.40%   
1년 복리: 7.1% 
5. 현대스위스 저축은행(http://www.hsb.co.kr): 4호선 명동역 2번 --> 1년: 6.70% BIS: 17.05%  
1년 복리: 7.3% 
http://finance.moneta.co.kr/mutualbank/mbankSavingList.jsp?region=&sort=INQ_CNT&j_int=MA_1Y_INT&y_int=MA_1Y_INT  
==============================================================================================================

- 저축 전략 수립 
1. 새말금고 예금 36,789,575원 해약(18,000,000원은 놔둠, 만기: 2008-04-20): 총: 54,789,575원 
1. 프라임저축은행에 3년짜리 예금을 3천만원 예금(아버지 명의:생계형) 
2. 프라임저축은행에 나머지 돈을 인터넷 뱅킹으로 예금(5천만원) 
3. 프라임저축은행에 5천 넘으면 솔로몬 저축은행에 예금(다음은 HK저축은행 순으로 예금) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.03(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 퇴사 의사 메일 보냄(To: 강사장) 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000 

1. 이벤트목록, 이벤트시나리오 
2. 근무상황카드_위니텍, 인제대 
3. 지출결의서 작성(서울출장: 지진재해) --> 11월 개인지출  255,000원 
==============================================================================================================

- 아침 PL회의(공형근 차장 1주일 교육)   
1. 인제대 교수 참석 및 목요일 계획 확인 
2. 분석 산출물 작성한 거 금주 수요일까지 완료해서 제출 
==============================================================================================================

- 삼성SDS에서 일정을 잡았다고 합니다. 
1. 금주 보고회 일정(12.06(목)) 
14:00 ~ 16:00: 프로젝트팀 교육 및 토론(교육자: 인제대 전상수 교수) 
장소: 프로젝트팀 회의실(광화문의 꿈 201호)  
16:00 ~ 18:00: 본부장 보고(보고자: 인제대 전상수 교수) 
장소: 소방방채청 방재관리본부 본부장실(정부중앙청사 13층) 
주간업무는 본부장 보고로 대치 한다고 함 
------------------------------------------------------------------ 
 2. NDMS 교육  
12.05(목) 10:00 ~ 11:00 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:30 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000 

1. 이벤트목록, 이벤트시나리오: 완료 
EDE001. 지진 시뮬레이션 수정 
EDM006. 건축물 피해 현황 수정 
EDM009. 인명 피해 현황 수정   
EDM017. 라이프라인 피해 현황 수정 
EDM018. 라이프라인 피해 계산식   
EDM019. 라이프라인 피해 환산식   
========================================================================================================= 

- 모델수립 진행상황 일일보고 요청 
삼성SDS에서 모델수립 진행상황을 모르겠다고 매일매일 
진행 상황을 보고 하라는 공식 요청이 왔어요. 
퇴근 전 진행 상황 메모 남기도록 요청 합니다. 
------------------------------------------------------------------  
- 모델수립 진행상황 일보고 
금일 업무현황을 보고드립니다. 상하수도시설물 및 통신시설물에 대해 HAZUS의 분류기호에 따른 국내 현황  
자료를 조사 및 분석하고, 손상함수의 매개변수 활용을 위한 필수 데이터 항목을 조사하였습니다.   
계획상으로는 가스시설물에 대한 조사 및 분석을 수행할 계획이었으나, 사업수행 일정의 조정가능성에 따라  
유동적으로 연구업무를 변경하였습니다. 큰 문제는 없겠죠?? 
==============================================================================================================

- NDMS유지보수팀 방문 교육  
내용: 지진재해시스템 1차 소스/데이터파일/형상관리방안/주요 설명 
일시: 12.06(목) 10:00 ~ 12:00 
장소: 오피시아 빌딩 15층 1506호 NDMS유지보수팀 
기타: 피해예측 질문 리스트 작성 
==============================================================================================================

- 호적 등본 발급(사직동사무소(수수료:600원), 일반우편으로 배송(인터넷으로 신청시) 
연말정산, 통장 개설시 필요 서류(부모님 이름 같이 등록되어 있는 것) 
==============================================================================================================

- 대구공대 풋살 12월회비 자동이체된 돈 받음(3만원)  
농협 244-01-031924 예금주: 류현숙 
2007.11.19 납부출금 #1124401031924  30,300   66,960  수신부   
==============================================================================================================

- 삼보 노트북 
http://www.cjmall.com/prd/detail_cate.jsp?item_cd=10934634&shop_id=2002112507&search_value=N6883JH1K 
- 델 노트북 
http://www.dell.co.kr/  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000 
==============================================================================================================

1. 주간보고서 작성  
2. NDMS유지보수팀 방문 질의서 작성 
3. 분석 자료 취합, PVCS에 등록 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30  --> 주과장, 유대리, 김대리 서울 파견(당일), 독도 참치횟집(현용, 임모): 현용 퇴사 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000  
==============================================================================================================

- NDMS유지보수팀 방문 교육  
내용: 지진재해시스템 1차 소스/데이터파일/형상관리방안/주요 설명 
일시: 12.06(목) 10:00 ~ 12:00 
장소: 오피시아 빌딩(광화문 사거리에서 서대문 방향) 15층 1506호 
기타: 피해예측 질문 리스트 작성방문 결과: 
- SK C&C 공공사업1팀(NDMS 유지보수): 배충현 과장, KIT 밸리(지진 유지보수 업체) 기술연구소: 육찬호 대리 
- 아키텍처 자료, 개인 개발 환경 매뉴얼 없음(실제DB, 웹로직 그대로 사용) 
- 실제 EJB 사용 안 하고 Servlet만 사용: MVC2(2 tier)로 사용   
---------------------------------------------------------------------  

- 모델 수립관련 회의 
14:30 ~ 15:30: 프로젝트팀 교육 및 토론(교육자: 인제대 전상수 교수) 
장소: 프로젝트팀 회의실(광화문의 꿈 201호)   
기타: 모델 수립 관련 질문 리스트 작성 
회의 내용: 
- 인제대 장현민, 김재민 
- 미국 HAZUS 함수에 들어갈  DB 속성값을 우리 환경에 맞도록 그룹핑:  
  (검증도 없이 형식적으로 하는 것 같음) 
- DB 속성 --> 파라미터(유형) 정의(한국 실정에 맞게 그룹핑) 
- 특정 지역, 모든 라이프라인 --> 2월 중간 보고회 
- 향후 일정을 상세하게 기록하고 보고할 것 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 지진 대응시스템 Prj
- 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000 

1. 어플리케이션구조도: 완료 
2. 프로그램목록: 완료  
DPE301_L 라이프라인피해현황등록 지진정보 조회 
DPE302_L 라이프라인피해현황등록 상세보기   
DPF202_L 라이프라인피해계산식 조회 
DPF203_L 라이프라인피해환산식 조회   
3. 프로그램사양서: 1차 완료 
==============================================================================================================

- 아침 PL회의 
1. 경광등, DB부분 산출물 수정 보완 요청 
2. 실제 지진사례를 적용한 모델 검증 및 모델 신뢰도를 높여 달라는 본부장 지시 사항(고베 지진 사례) 
3. 1차 때 수립 모델 비흡 - 보완 요청 => 기존 내용 파악(변경 관련 Risk 및 예상 공수 산정 전달) 
4. 모델 수립관련 회의 자료가 1차 때랑 별로 다른게 없음 
미국 HAZUS 공식에 DB속성값만 조금 바꾼 것으로 추정됨 
==============================================================================================================

- KTX 예약 요청  
2007.12.08(토) 515호 서울 -> 동대구  08:20 ~ 09:58 순방향(41,100원) 
2007.12.09(일) 312호 동대구 -> 서울 18:15 ~ 20:09 순방향 
철도회원번호: 0652354968/2580 
4336-9270-2833-9209  
==============================================================================================================

- 노트북 drag 하기 
자판 터치 스크린 클릭 + 아래위 버튼 
==============================================================================================================

-  현대스위스 저축은행 통장 만들기 --> 1년: 6.70% BIS: 17.05%  
4호선 명동역 2번 출구  
==============================================================================================================

- [주간업무 2007년 12월 1째주] 
★ 금주 업무 실적  
1. 분석 작업 
 - 이벤트목록 작성: 완료 
 - 이벤트목록 시나리오 작성 : 완료 
2. 설계 작업 
 - 어플리케이션구조도: 완료 
 - 프로그램목록: 완료  
3. 기타 
 - NDMS유지보수팀 방문 
 >> 아키텍처 자료, 개인 개발 환경 매뉴얼 없음(실제DB, 웹로직 그대로 사용) 
 >> 실제 EJB 사용 안 하고 Servlet만 사용: MVC2(2 tier)로 사용  
  - 모델 수립관련 회의 
 >> 미국 HAZUS 함수에 들어갈  DB 속성값을 우리 환경에 맞도록 그룹핑 
     (검증도 없이 형식적으로 하는 것 같음) 
------------------------------------------------------------------------------------------------------------------------ 

★ 차주 업무 계획 
1. 설계 작업 
 - 프로그램사양서 
 - 페이지목록 
 - 보고서목록 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 --> 당산동 숙소(맥주): 최수원씨 상주, 침낭 구입(2만 4천원), 이규진 책임 교육(1주일) 

- 지진 대응시스템 Prj
 1. 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000 

 1) D-011. 페이지목록 
DPE301_L 라이프라인피해현황등록 지진정보 조회 
DPE302_L 라이프라인피해현황등록 상세보기  
==============================================================================================================

 2. 보안 강화 
  1) 3G코아 서버 해킹 당한 흔적 발견(국정원 검사) 
   - 12.08(토) 밤에 프로젝트 사무실에 있는 3G코아 서버가 해킹 당한 흔적이 있다고 
   오늘 오후에 국정원에서 나와서 제 노트북 해킹 프로그램 돌리고 스캔해서 갔음. 
보안 프로그램 설치(AhnLabSpyZero2.exe) 
   - USB 해킹: 숨김 파일 보기 --> 오토런 파일(Autorun) 있으면 바이러스 감염 의심  
==============================================================================================================

- 형상관리[configuration management]   
시스템 형상 요소의 기능적 특성이나 물리적 특성을 문서화하고 그들 특성의 변경을 관리하며, 변경의 과정이나  
실현 상황을 기록·보고하여 지정된 요건이 충족되었다는 사실을 검증하는 것, 또는 그 과정 
==============================================================================================================

- 설날 열차 예매  
대상 승차권: 2008. 2. 5(화) ∼ 2. 10(일) [6일분] 
희망 예약일: 2008. 2. 6(수) 00:00∼06:00  무궁화호 
예약ㆍ예매일시: 2007. 12. 12(수) ∼ 12. 13(목) [2일간]   
인터넷 예약일: 12월 12일(수)  06:00∼08:00  경부, 충북, 경북, 대구, 경전, 동해남부선    
결제기한 연장 : 예약한 승차권은 '07. 12. 22. 24:00까지 결제 또는 구입 
매수제한 : 1인당 1회 편도6매(왕복 12매 : 왕편6매+복편6매) 
--------------------------------------------------------------------- 
 1. 철도 요금 
  1) 평일 기준 
KTX: 38,400원 새마을: 29,100원  무궁화: 19,600원 
  2) 주말 기준 
KTX: 41,100원 새마을: 30,400원  무궁화: 20,500원 
 2. 고속버스 요금 
  1) 평일 기준 
일반: 14,600원 우등: 21,600원 심야: 23,800원 
  2) 주말 기준(주포항 -> 서울)  
일반: 18,600원 우등: 27,700원 심야: 30,500원 

[KTX 패밀리 체크 카드(철도회원)] 카드번호: 0550566830/0**9 
==============================================================================================================

- 현용 대여(500만원) 
계좌번호: 국민(924501-01-253283) 황현용 
변제일: 2008.01.10 까지 
국민(924501-01-253283) 예금주: 황현용으로 500만원 송금 완료: 태만 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 지진 대응시스템 Prj
 1. 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000  
 1) D-013. 보고서목록: 완료 
 2) D-014. 보고서레이아웃: 1차 완료 
==============================================================================================================

 - DB 소스 받음 
KIT 밸리(지진 유지보수 업체) 육찬호 대리(C.P:*)에게  
DB 소스(프로시저, 함수) 요청-> 받음 
==============================================================================================================

- 우리독도카드 
128,610원 결제(대구은행에 26,774원 입금할 것(10,1836원)) ==> 2008.01.23 결제 예정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 24:00  --> 할매집(최정욱씨가 쏨, 공차장) 

- 지진 대응시스템 Prj
 1. 지진재해대응시스템 구축 2차 사업 분석 
지진재해대응시스템 구축 1차 사업 시스템 
http://10.1.5.61/tmpl/ComUsrLogin.jsp  -->  ID: 000000L7,  윤종혁, 지역코드: 00000  
 1) 주간보고서 작성   
 2) D-010. 네비게이션흐름도: 완료  
 3) D-018. 통합테스트시나리오: 1차 완료 
==============================================================================================================

- 아침 PL회의 
1. 시군구 면담(20일, 21일) 참석자, 연락처를 적어서 엄경숙 선생에게 제출할 것 
삼성SDS에서 시군구 면담시 응급대책지원시스템 관련 질의서도 함께 처리해 줄 것을 요청 
2. 서버 장비 지연(HP 서버 구하기 힘듬): 이번주에 서버 도입 힘들 것 같음   
==============================================================================================================

- DB 덤프 요청 
업무담당: 정보화기확관실 박경와 선생(02-2100-5182, C.P: *) 
실무담당: KIT 밸리(지진 유지보수 업체): 육찬호 대리(C.P: *) 
우리는 담주부터 DB 테이블 소스를 분석해야 하는데   
지금 DB 덤프만 떠주면 우리회사에 환경을 구축해서 분석 
==============================================================================================================

- 인제대 투입 인력 변경 요청 건(인제대) 
어제 저녁에 전정하PM이 투입 인력 연락처 적어 내라고 했어요. 그래서 장현민씨기에 이야기 하니 
제안서 상에 인제대에 투입 인력 넣었든 허대양 연구원(석사 과정)이 공무원이라 이라고  
변경 요청을 했어요. 
그래서 전정하PM에게 변경을 요청하니 변경하면 나중에 문제가 생길 수 있으니 변경하지 말라고 합니다. 
그러면서 공무원을 투입 인력을 넣으면 어떻게 하냐고 했습니다. 
==============================================================================================================

1. 대구동구수성케이블 방송(Tel: 053-768-8900) ==> 해지 처리 완료 
http://www.sdtv.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 지진 대응시스템 Prj
1. 주간보고회 
장소: 재해경감팀(리마BD 1104호)  
2. 주간보고회 회의록 작성  
==============================================================================================================

12월 13일 일일보고를 드립니다. 
1. 연구진행 
‘교량구조물의 지진손상함수 국산화 연구’에 대해 기존에 습득한 자료 분석을 바탕으로 교량의 피해추정모델  
수립 방안을 연구. 
- 국내 교량구조물의 분류 분석 
- 국내실정에 적합한 취약도곡선의 개발과정 분석   
==============================================================================================================

- 1차 시스템 수정 요청 수락(삼성SDS 전정하PM) 
소방방재청에서 1차 때 못한 건축물 내진 설계, 건축년도, 속성 추가하여 보완 요청 
1차 건축물 피해 시스템에 해당 내용 추가 함(2008년 4월까지 해주기로 함) 
관련 사항에 대한 협의를 위해 오늘 오후 2시에 조부장님과 회의 하기로 했다고 함 
==============================================================================================================

- IntraMap 사용법(최수원 사원) 
1. IntraMap2DX 설치  --> Intramap2DX.msi 실행 
 C:\Program Files\KSIC\IntraMap2DX/XMapConverter.exe, XMapViewer.exe  
2. 컨버팅(XMapConverter) 
 XMapConverter --> + --> layer  
 SHP폴더: 원시 Data XIM_2단계: 원시 Data XCM_2단계: 원시 Data 
3. XMapViewer\ 
 - xxx.XIM 파일을 더블클릭 
==============================================================================================================

- 직급 
Assistant Manager: 대리 Manager: 과장 
Deputy General Manager: 차장 General Manager: 부장 
==============================================================================================================

- GS 강촌 리조트 스키장 여행(http://www.gangchonresort.co.kr) \
2008.1.18(금) ~ 20(일): 1박 2일 
 1. 리틀 강촌 http://www.littlegangchon.com 
 2. 강촌 이야기  http://www.gcstory.com  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00  --> 오피시아 방문(KIT 육찬호 대리 DB소스 획득), 영민이형 가게(정통부 뒤 다래성) 

- 지진 대응시스템 Prj
1. 지진 대응시스템 분석 
- HAZUS 기법: 라이프라인 자료 수집: 실제 구현된 사례 
==============================================================================================================

- 산물출 결과 취합 요청 
- 인터뷰 취합 요청  
- 인제대에 핵심 요청 사항 
1. 다음주에는 주간보고회때 인제대 모델 수립팀 참석 할 것(정길호 사무관)  
>> 일시: 2007.12.20(목) 16:00시, 장소: 프로젝트 사무실 
2. 월간보고회 때 인제대 전상수 교수가 직접 발표할 것을 요청(정길호 사무관) 
>> 일시: 2007.12.28(금) 14:00시, 장소: 프로젝트 사무실  
>> 발표 내용: 기존 개발된 HAZUS 기법에 대한 조사, 연구 및 시연  
3. 가스 시설물 구현 사례 자료 수집 요청 
>> 가스 시설물이 구현 되어 있는데 전상수 교수님을 통해 요청하도록 부탁(전정하 PM) 
>> 요청 대상: 지질자원연구원, 강혁범 연구원 
==============================================================================================================

- 일일보고(인제대: 12.14(금)) 
▶ 국내건축물의 피해예측모델 분석 : 건축물 피해추정모델 수립의 책임자였던 한세섭 연구원에게 연락하여  
건축물의 피해추정방법을 문의하고, 서울대 홍성걸 교수님께 위탁하였다고 하여 홍성걸 교수님 연구실로  
문의전화를 함. 보고서의 내용 중 건축물의 취약도함수 개발부분을 문의드린 결과, HAZUS의 매개변수를  
거의 그대로 사용하였다고 함. 1차년도 보고서의 참고문헌을 조사하여 연구함. 
==============================================================================================================

- 프라임 저축은행 통장 개설(http://www.hsb.co.kr)) --> 1년: 7.10% BIS: 9.16% 
2호선 시청역 6번 출구 
통장번호: 002-30-13-0135374(00230130135374) 타행 공인인증서 사용   
고객번호: 07825932: 남대문지점, 이용자비밀번호: *t*3** 
상품명: 정기예금(복리), 신규계좌번호: 011-02-24-0290092   
예치기간: 12 개월,  예치금액: 2,000,000 원  
이자지급방법: 만기일시지급(복리),  계약금액: 2,000,000 원  
세금우대여부: 세금우대  기본이율: 특별이율 7.44 % 
만기일자: 2008/12/14 
- HK상호저축은행 통장 개설(http://www.hksb.co.kr) --> 1년: 7.00% BIS: 6.76%  
4호선 회현역 6번 출구 
---------------------------------------------------------------------  
- 농협 포항계비 정산 
1. 농협 포항계 통장에서 11만원 출금(3만원 대구공대 풋살회비 반환금) 
2. HSBC에서 동양(포항계 전용) 국민은행 가상계좌(801390-60-429087)로 8만원 송금 
==============================================================================================================

- [주간업무 2007년 12월 2째주]  
★ 금주 업무 실적 
1. 설계 작업 
 - 보고서목록: 완료 
 - 보고서레이아웃: 1차 완료 
 - 네비게이션흐름도: 완료 
 - 통합테스트시나리오: 1차 완료  
2. 기타 
 1)  DB 덤프 받음(KIT 육찬호 대리에게 받음)  
------------------------------------------------------------------------------------------ 
  
★ 차주 업무 계획
1. 설계 작업 
 - 1차 마무리  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.17(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00  --> 테스트 서버 들어옴(삼성SDS) 

- 지진 대응시스템 Prj
1. 지진 대응시스템 분석 
- HAZUS 기법: 라이프라인 자료 수집: 실제 구현된 사례 
==============================================================================================================

2. 테스트 서버 들어옴(삼성SDS)  
1) 서버 사양 
 가. HP rx3600 
2) 프로그램 설치 
 가. O/S: Linux 엔터프라이즈 4, 업데이트 4(Itanium), JDK 1.4.10, JVM 1.3 이상 
 나. DB: Oracle 10.2.0.2 
 다. WebLogic 8.1 sp6 
==============================================================================================================

- 아침 PL회의 
1. 산출물 1차 이번주까지 완료 
  - 다음주 주간보고회 까지 산출물 최종 마무리 및 취합 
2. 전상수 교수 미국출장(12월 21일 ~ 1월 10일) 
==============================================================================================================

12월 17일 
▶ 연구 수행내용(선행연구 피해예측분석) : 지중매설관로의 거동 해석을 위한 관ㆍ지반의 상호작용 분석 
※ 전정하책임님과 조웅희부장님께 모델수립팀의 연구범위(라이프라인 중 상수도시설, 하수도시설, 도로시설의  
도로와 터널, 통신시설)에 대해 전상수교수님의 의사 전달 
※ 12월 28일 월간보고 때 ‘시스템 시연’은 위니텍 담당이고, 인제대 모델수립팀은 HAZUS 관련자료가 있으면  
위니텍을 서브하는 것(전정하책임님 말씀)이므로 이에 따름. 
==============================================================================================================

- XP 패스워드 분실 해결책 
1. 안전모드 부팅 
부팅시 F8  --> admin 패스 안걸려있으면 바로 로긴해서 pw 바꾸면 됨 
------------------------------------------------------------------------------------------ 
 2. sam파일 복사 
부팅시 F8  --> 콘솔 모드 --> 
c:\windows\repair>copy sam c:\windows\system32\config  
sam파일을 레지스트리에 복사해넣는 과정입니다. 
http://kin.naver.com/knowhow/entry.php?d1id=8&dir_id=8&eid=mFHnPOdNixmSm8hH8rDlTCUSGi5CxT+r&qb=WFAgxtC9ur/2teU= 
==============================================================================================================

- 사용자 계정 설정 
시작 -> 설정 -> 제어판 -> 사용자계정 
작업선택..: 사용자 로그온 또는 로그오프 방법 변경 클릭 
새로온 시작 화면 사용(W): 체크 -> 옵션 적용(A): 클릭(컴 켤때마다 패스워드 물어봄) 
==============================================================================================================

- 서울메트로 분실물(http://www.seoulmetro.co.kr) 
충무로역 근처: 2271-1170 
==============================================================================================================

- 지상파DMB 수신기 구매(서울: 7개, 대구: 4개) 
1. [코발트DMB]STICK-K2B+외장형안테나포함, 가격: 49,490원 
http://www.gmarket.co.kr/challenge/neo_goods/goods.asp?goodscode=118638253    
- DMB Tv방송 
1 - KBS HEART (UI DMB): KBS2 2 - UI (UI DMB) : OK 
3 - MYTN (YTN DMB): YTN 4 - ITOL-TV (원투원)  
5 - MBCNET (원투원) 6 - MY MBC (MBC DMB): MBC 
7 - KBS STAR (U-KBS): KBS1 8 - UI Radio (U-KBS)  
9 - SBS u TV (SBS(u)): SBS 10 - SBS V-Radio(SBS(u))  
11 - TBS V-Radio(SBS(U))   
Auot Scan --> 검색 -->Cobalt DMB Stick Executable File 문제로 종료 
채널 검색 후 나타나는 이같은 팝업메세지는 하드웨어적인 문제로 인해 발생되는 현상입니다 
(http://cobalt-tech.co.kr) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 지진 대응시스템 Prj
 1. 지진 대응시스템 분석 
- HAZUS 기법: 라이프라인 자료 수집: 실제 구현된 사례  
S001_M: 실제지진정보, S002_M: 지진수신정보  
==============================================================================================================

- 지진발생 프로세서(실제 지진발생시) 
지진발생 --> 수신전파 서버(기상청) 송.수신 --> 풍수재해 시스템(NDMS)에서 수신 -->  
웹로직 큐(JMS)로 송신(NDMS)(지진 속보 정보, 지진 통보 정보) --> 지진재해 시스템에서  
수신.피해 예측(진도분포도 및 피해사항 계산) --> 풍수재해 시스템(NDMS)에서 수.송신 --> 17개 시도에 전달  
 - 건축물, 인명 피해 입력 프로세서(실제 지진발생시) 
지진발생 --> 수신전파 서버(기상청) 송.수신 --> 풍수재해 시스템(NDMS)에서 수신 -->  
풍수재해 시스템(NDMS)에서 입력(상황실 본청) --> 웹로직 큐(JMS)로 통신(NDMS)(건축물, 인명 피해 정보) -->  
지진재해 시스템(건축물, 인명 피해 정보 저장) 
==============================================================================================================

 2. 프로그램 설치 
  가. O/S: Linux 엔터프라이즈 4, 업데이트 4, JDK 1.4.10, JVM 1.3 이상: 완료 
  나. DB: Oracle Database 10g Release2 (10.2.0.1.0) for Linux Itanium 
  다. WebLogic 8.1 sp6 
==============================================================================================================

- 리눅스 설치법(IA64용 redhat AS 4.0 리눅스) 
1. 언어: 한국 
2. 파티션 설정(수동) 
 Ha(146GB): WEB서버, WAS, GIS 
 Hb(146GB): Data영역 
 Hc(146GB): Boot: 500M, Root: 40G, Swap: 36G, /tmp: 5G  
 Hd(146GB):   
 He(146GB): Data영역 
3. 호스트명: edis 
4. IP: 10.46.202.251     G.W:  10.46.202.254   DNS: 10.1.1.5 
5. 추가 언어: 한국/영어 
6. Root암호: root1218 
7. 패키지 설정: 전부 설치 
---------------------------------------------------------------------  
- 지진피해 1차 시스템 
HOST: 10.1.5.36 edis/***sedis root/***sroot 
- 지진피해 2차(TEST서버) 
HOST: 10.46.202.251 edis/***sedis root/root1218 
==============================================================================================================

- 오라클 DB 데이타 세팅 방법 
1. 그 압축 파일을 dmp파일로 묶어주는 작업을 해야합니다.  
 분할압축되어 있는 파일을 이 명령어로 풀면 
cat x*  tar xvzf -  
cat 압축파일.tar.gz*  tar xvzf - 
edis_20071214.dmp 이 파일이 생길겁니다. 
2. EDIS_DB 폴더 안의 파일에 있는 파일 56개 이걸 ftp로 올려서 import 시킴 
==============================================================================================================

- 아침 PL회의 
1. 서버 설치 
 가. O/S: Linux 엔터프라이즈 4, 업데이트 4: 완료 
 나. DB: Oracle 10.2.0.2: 설치 중 
  Table space: 1GB  오토사이즈  MAX: 5GB 
 다. WebLogic 8.1 sp6: 오늘 14시 예정 
2. 시군구 인터뷰(응급 대책) 
 가. 20일: 서울 서대문 구청 
 나. 21일: 경기 도청 
==============================================================================================================

 - 3G CORE 연락처 
강상원 차장 C.P: * 문영섭 차장 C.P: * 
이선동 과장 C.P: * 
 - NMDS 유지보수팀 
권기봉 차장 Tel: 890-3604 (지진 1차 개발) 조성준 주임 C.P: *  
==============================================================================================================

- JMS(Java Message Service) 설명 
1. P2P: (Peer-to-Peer)는 여러 개의 클라이언트에게 보낸 메세지를 MOM(Message Oriented Middleware)의 메 
세지 큐(Message Queue)에 차례대로 저장한 후, 메시지 리시버가 큐의 내용을 하나씩 읽어들여 처리할 수 
있는 방식 
2. pub/sub: 발행자(publisher)와 가입자(subcriber)의 약자. 마치 신문사에서 신문을 만들어 구독자에게 배포 
하는 것과 같은 방식. 메세지 센더에서 메세지를 MOM에게 전달하면(출판), 주제에 등록된 클라이언트에게  
메세지가 전달되는 방식(구독): Topic 
3. 메세지 드리븐 빈: JMS를 EJB 컨테이너 안에서 동작하는 EJB 형태로 만든 것 
 1) news 테이블 작성 
 2) CMP방식의 엔티티 빈 작성(NewsHome.java, News.java, NewsEJB.java) 
 3) 엔티티 빈을 이용하는 메세지 드리븐 빈 작성(AddNewsBean.java) 
    public class AddNewsBean implements MessageDrivenBean, MessageListene{} 
 4) 엔티티 빈과 메시지 드리븐 빈 컴파일 
 5) 웹로직 빌더를 이용한 배치 디스크립터 파일 작성(.xml 생성) 
 6) 엔티티 빈, 메시지 드리븐 빈, 배치 디스크립터 파일 EJB.jar로 압축 
 7) 배치 
 8) 뉴스를 저장한 메시지를 전달하는 클라이언트 작성 
 9) 클라이언트 실행 후 저장된 메시직 확인  
==============================================================================================================

 - JSP 위치 위치 : /web/edis/ROOT 
- map : 진도분포도 및 피해추정 
- base : 기초데이터 관리 
- report : 피해추정현황  
- sop : 대응절차 및 매뉴얼 
- alarm : 자동경보 관리 
- sm : 시스템 관리 

DPD001_M.jsp: 행정구역별 건축물 정보 관리(Main) 
DPD001_T.jsp: 행정구역별 건축물정보 검색(Top) 
DPD001_L.jsp: 행정구역별 건축물 정보 관리(List) 
DPD001_P.jsp: 행정구역별 건축물 정보 관리(Process) 
DPD001_U.jsp: 행정구역별 건축물정보 수정(Update) 
--------------------------------------------------------------------- 
 - 환경 파일 설정 
// 소스 파일에 "user.home"란 서버의 c드라이버의 "C:\Documents and Settings\Default User"에 환경파일을 저장.  
// ".properties" 저장된 환경파일을 읽어 온다. 
File default_file = new File(System.getProperty("user.home"), "product.properties"); 
jdf_file_name = System.getProperty("com.roadlib.config.file", default_file.getAbsolutePath());  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.19(수) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 23:00  --> 대통령 선거일(임시 공휴일), 이명박 당선(17대), 피자(이규진 책임:법인카드) 

- 지진 대응시스템 Prj
 1. 지진 대응시스템 분석  
 2. 프로그램 설치 
  가. O/S: Linux 엔터프라이즈 4, 업데이트 4, JDK 1.4.10, JVM 1.3 이상: 재설치 완료 
  나. DB: Oracle Database 10g Release2 (10.2.0.1.0) for Linux Itanium: 완료  
==============================================================================================================

- Alt + Tab 키 이용하기  
Alt + Tab: 선택적인 화면 전환   
Alt + Eesc: 이전화면 전환 
==============================================================================================================

- 대구집 
근로소득 원천징수영수증, 운동화, 스키용 장갑, 옷걸이, 안경딱기(노트북용), 샤프 구입, CD, 스킨로션, (달력, USB DMB) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00  --> 저녁 쏨(정욱씨: 법인카드) 

- 지진 대응시스템 Prj
1. 프로그램 설치 
  가. WebLogic 8.1 sp6: 완료  
 - 피해입력관련해서 컨버전이 있을  듯  
==============================================================================================================

1. 주간보고회  
 - 선진 사례 분석(실제 구현된 기능 위주로 분석): 정길호 사무관 
 - 관련 분야를 연구하는 교수 중심으로 자료를 구할 것 
 - 다음주 월간보고회 때 발표를 하거나 미비시 자료 입수 경과 보고서 제출 
 - 장소: 재해경감팀(리마BD 1104호) 16:30 ~ 17:30 
 - 모델 수립팀(장현민씨) 참석  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 독도 참치횟집(현용 쏨, 태용, 임모): 임모 발렌타인 30년산 쏨, 맥주집(태용 쏨) 

- 지진 대응시스템 Prj
1. 지진 대응시스템 분석 
- 개발 표준 작업 (개발 환경 셋팅 포함) 
==============================================================================================================

- 아침 PL회의 
1. 산출물 취합 
 분석: 응용개발 4개 업무(피해예측, 피해입력, 경광등, 응급대책) 취합(삼성SDS) 
 설계: 응용개발 4개 업무(피해예측, 피해입력, 경광등, 응급대책) 취합(위니텍)  
2. 선진사례 이슈: 관련 분야 교수 접촉해서 자료 입수 시도할 예정(삼성SDS) 
 - 모델 수립팀이 주도해서 자문회의나 세미나 개최 요청(전정하 PM) 
==============================================================================================================

- 푸른 저축은행 통장 개설(http://www.pureunbank.co.kr): 2호선 을지로입구역 2번  
--> 1년: 7.10% BIS: 8.52% 인터넷 예금 신규 가능, 해지 및 만기 출금은 직접 방문해야 함 
==============================================================================================================

- [주간업무 2007년 12월 3째주]  
★ 금주 업무 실적
1. 설계 작업 
 - 설계 산출물 최종 분석  
2. 개발 준비 
 - 소스 분석(JMS(Java Message Service) 분석)  
3. 기타 
 - 테스트 서버 들어옴, 프로그램 설치 
------------------------------------------------------------------------------------------ 
  
★ 차주 업무 계획  
1. 설계 작업 
 - 설계 산출물 취합  
2. 개발 준비 
 - 개발 표준 작업 (개발 환경 셋팅 포함)  
3. 기타 
 - 선진사례 자료 수집 및 PT자료 만들기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00  

- 지진 대응시스템 Prj
 1. 지진 대응시스템 분석 
- 주간 업무보고서, 12월 월간업무보고서 작성: 완료 
- 개발 표준 작업 (개발 환경 셋팅 포함)  
- 방재연구소(http://www.nidp.go.kr)에 HAZUS 프로그램이 설치 되어 있음(인제대 장현민씨) 
==============================================================================================================

- 아침 PL회의 
1. 설계 산출물 취합 
- 분석/설계서 취합: 금일 중 종료 
- 분석/설계서 검토: 검토(워크쓰루/인스펙션): 제출용 정리(자추 제출) 
2. 피해예측 화면 레이아웃(to-be) 
3. 12월 27일(목) 저녁 지진 프로젝트팀 전체 회식(삼성SDS 주관) 
4. 컨버젼계획서 작성 
- 피해예측 부분 
5. 월간업무보고회 
일시: 12월 28일(금) 14:00 ~  장소: 프로젝트 사무실 
==============================================================================================================

- 한글2002에서 표에서 그림이 다음줄에 안보이는 문제 해결 
그림: 마우스 오른쪽 클릭 --> 개체 속성(P) --> 개체 속성 -->  
기본 --> 위치 가로(I): 종이, 세로로(V): 종이  --> 설정(D) 클릭 
==============================================================================================================

- [KBS 스페셜]지진한반도는안전한가 
http://www.kbs.co.kr/play/vod/ing/sisa/vod_1ts_kbs_sp/index,1,list,24.html 
==============================================================================================================

- GS 강촌 리조트 스키장 여행(http://www.gangchonresort.co.kr) 
2008.1.18(금) ~ 20(일): 2박 3일 
 1. 별을 헤는 밤 http://accommodations.auction.co.kr/Home/Category/Detail.aspx?idLodge=5420  --> 28만원 
 2. 리틀 강촌 http://www.littlegangchon.com --> 20만원  
==============================================================================================================

- 스키복 구매 
[푸조]스키복,보드복/스키복세트,보드복세트/스키의류,보드의류[FZ778(곤색/아쿠아블루): 105] 가격: 71,300원 
http://itempage.auction.co.kr/detailview.aspx?itemno=A109216958 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.26(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 유대리(상주), 김형진씨(상주), 김대리 서울 파견, 퇴사 메일(조부장) 

- 지진 대응시스템 Prj
1. 지진 대응시스템 작업 
- 설계 산출물 취합, 바인딩: 완료
- 테스트 계획서: 완료 
00-Q-003_분석표준.hwp 
- A-012.이벤트목록(피해예측).xls 수정: 완료 
- 개발 표준 작업 (개발 환경 셋팅 포함)   
==============================================================================================================

- 위니텍 연말 정산 
1. 공지: 2007.12.26(수) 
근로소득자소득공제신고서.hwp 파일 다운(http://anymate.winitech.com --> 공지사항) 
==> 작업 마감 
2. 서류 제출 마감: 2008.01.10(목)   
3. 환급일: 2008.02.07(목)  
4. 기타 
매년 12월 초에 연말 정산 자료 준비할 것(보통 11월까지의 자료가 정산 대상) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.12.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 지진 대응시스템 Prj
 1. 지진 대응시스템 작업 
- 개발 표준 작업 (개발 환경 셋팅 포함)   
Eclipse 3.1 
- DB 연결 
10.46.202.251 edis/edis123  
==============================================================================================================

 - Inspection 교육 
Validation: 요구사항(needs)이 맞는지 검증 
Verification: 감리,  You built it right 
walkthrough(팀원/관리자가에 의해 필요성이 인식될 때 시행)  
---> Inspection(산출물이 계획된 준비완료 기준을 만족할 때, Moderator 가 재작업 결과를 확인) 
==============================================================================================================

 - 노트북  
LG전자 Xnote E300-AP75K, 1,320,000원 --> 강추 
http://shopping.naver.com/detail/detail.nhn?cat_id=01100002&nv_mid=4081058179&frm=nv_model&tc=3 
삼성 센스 NT-Q70A/W203, 1,277,000원 
http://shopping.naver.com/detail/detail.nhn?cat_id=01100102&nv_mid=4079615162&frm=nv_model&tc=3 
한성컴퓨터 GT40-T73K, 1,009,500원 
http://shopping.naver.com/detail/detail.nhn?cat_id=01101303&nv_mid=4087129732&frm=nv_model&tc= 
==============================================================================================================

http://www.jobkorea.co.kr/List_GI/GIB_Read.asp?GI_No=4130514 
http://www.jobkorea.co.kr/List_GI/GIB_Read.asp?GI_No=4181216 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■