

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2007.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2007.09.01(토) 작업 ■■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:00 --> 큰누나집(DDR 1GB램 추가) -->19:00 출발 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 초안 작성 
(u-대구 ISP 중간보고.ppt 초안 작성)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.03(월) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:00 ~ 23:00 --> (주)위니텍 자리 옮김(이경하 대리 옆) 

- U-대구 ISP
- u-대구 ISP 중간보고회 PT 자료 초안 작성 
Ⅰ. 사업개요, Ⅱ. 경과보고 
==============================================================================================================

주제: u-대구 중간 보고회 개회 계획 회의 
 - u-대구 중간 보고회: 9월 11일(화) 14:00 ~ 16:30 
 - 진행 순서: u-대구 중간 보고회(위니텍), 공원정보 착수보고회(선도), 상시갱신 착수보고회(지노) 
 - 자문위원 10명 --> 5명으로 줄일 계획 
 - 현수막 제작: 시청 주차장 맞은편 게시판, 의회, 10층 로비 
 - 발표 자료 PT: 9월 6일(목) 15시까지 작성 
   (표지포함 25매 3사가 함께 책자로 만들 것: 450권) 
 - 기념품 준비(USB 2GB --> 400개), 추첨 상품 고민할 것 
==============================================================================================================

- 폴더 락(폴더 잠금) 
1. 폴더 락 박스 1.1 beta (http://blog.naver.com/the_omega?Redirect=Log&logNo=140041965625)  
2. Live Lock(www.live.co.kr) 
PWD: ss***1*1*(비밀번호) 
신원진술서(07_09.03).hwp 작성 --> PWD: ss***1*1*(비밀번호) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 --> 점심(흑태찜: 공간정보 박주임이 냄(일본관광 기념)) 

- U-대구 ISP
- u-대구 ISP 중간보고회 PT 자료 초안 작성 
- USN 서비스(고정-고정) 
1. 자동 속도 감시 시스템(교통단속 CCTV): 궃은 날씨에 제한속도 자동 지정 
2. 차가 없거나 보행자가 없으면 통행  
==============================================================================================================

- 임시회의 
참석: 임용호 부장,  이기정 차장, 정현정 사원 
시간: 19:00 ~ 22:00 
주제: u-대구 ISP 중간보고회 PT 자료 작성 
내용: 
 - 일정: 09.06(목)까지 디자인팀에 맡김, 09.07(금) 오후에 재본 맡김 
09.10(월)에 1층 현관, 전자전광판: 3프레임(일정, 안내, 내용) 
중간보고서 산출물 제출: 09.10(월), 월간보고서 산출물 제출: 09.17(월) 
USB 2G: 450개 주문 신청(우리 회사 몫: 150개) 
==============================================================================================================

- 중간보고회시 선물 인터넷에서 조사(450개)  
아이셀론 SPACE-N 2GB 가격: 18,000원 
http://pcon.co.kr/product/productView.php?nProdCode=469247&service_id=pcdn  
자익스 USB Disk Nano 1GB   가격: 11,900원 
http://memorycorea.co.kr/product/productView.php?nProdCode=411202&service_id=pcdn   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 24:30 --> 점심(동해식당: 공간정보(쏨)) 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 초안 작성 
==============================================================================================================

- 임시회의 
참석: 임용호 부장,  이기정 차장, 정현정 사원 
시간: 20:00 ~ 24:30 
주제: u-대구 ISP 중간보고회 PT 자료 작성 
내용: 중간보고회 PT 자료 1차 완료 후 추가 작업 
==============================================================================================================

- 사천대 글읽기 
5월15일 스피드북을 신청했다. 7백대에서 10일 이후 1천대로 올라갔지만 한동안 진전이 없었다. 게시판 학습자료실  
체험담 등 홈피 구석구석을 돌며 훈련의 왕도를 찾았다. 결국 파랑새가 저 산 너머에 있는 것이 아니고 집안에  
있었듯이 스피드북의 향상역시 훈련과 노력에 있음을 알았다. 미친듯이 시도때도 없이 눈알굴리기를 하고 책을  
잡고 씨름했다. 3개월 반, 내가 읽은 책만도 1백여권에 가깝고 눈이 아파 안약과 눈 피로회복제를 먹은 게  
부지기수다. 속도는 올랐다. 3천대에 평균75점.  
http://www.speedbook.co.kr/board/?action=view&menu_id=27&no=62807&ac_no=&page=5&skey=&sword= 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 --> (주)위니텍 10주년 창립기념일, 풋살(송별 회식: 맥주집) 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 초안 작성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 01:00 --> 점심(동해식당: 공간정보(쏨)) 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 초안 작성  
필사즉생 필생즉사(必死卽生 必生卽死) 
==============================================================================================================

- 지갑 분실: 박재길(캐논FC) * 
대리운전비 2만원 빌림(박기락 형) 
==============================================================================================================

- 임시회의 
참석: 임용호 부장,  이기정 차장, 이혜연 대리, 정현정 사원 
시간: 19:00 ~ 01:00 
주제: u-대구 ISP 중간보고회 PT 자료 작성 
내용: 중간보고회 PT 자료 2차 완료 후 추가 작업 
==============================================================================================================

- 프린터 출력시 insufficient memory 출력 에러남 
프린터의 메모리 부족현상입니다. 컬러레이저젯 같은 경우 자체 메모리를 옵션으로 추가하실수가 있습니다. 
그런데 자체 메모리가 부족하게 되면 그런 메세지가 출력이 됩니다. 
메모리를 추가하여 사용하시거나, 그렇지 않은경우엔 일부만 키워서 1페이지씩 출력을 하시는것이 좋을것 같네요. 
기본적으로 프린터에 내장되어 있는 메모리가 웹상에서 출력물을 순간적으로 감당하지 못했을 때 그런 증상이  
벌어집니다. 기본적으로 프린터마다 내장메모리가 차이는 있겠지만 제가 쓰고 있던 8000도 가끔 그 증상이 발생했었습니다.  
내장 메모리는 16mb구요.. 그래서 프린터 드라이버 변경으로 테스트 해 봤는데 지금은 그런증상 없습니다.  
보통 PCL6로 프린터 드라이버가 세팅이 되는데 그거 말고 hp웹사이트 www.hp.com에서 PCL 5E 버전의  
드라이버 다운로드 받으셔서 인쇄해 보시면 대부분 해결이 될겁니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.08(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:20 ~ 05:00 --> 철야 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 작성   
==============================================================================================================

- 눈금자(파워 포인트에서) 
보기(V) --> 눈금자 및 안내선 
눈금설정 -> 간격(P): 0.125 cm 
안내선 설정 -> 화면에 그리기 안내선 표시(I): 체크  
선 추가: Ctrl + 선을 마우스 클릭 후 드래그 하면 선이 생김 
선 삭제: 선을 마우스 클릭 후 드래그 하여 밖으로 던짐 
- 글머리 기호 
글머리 다음 줄에 튀어 나오는 글 
--> 맨위 가운데 눈금선을 당겨서 맞춤 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.09(일) 작업 ■■■■■■■■■■■■■■■■ 
---> 12:30 ~ 23:30  --> (회사-> 시청(왼쪽 문 밑 주차사고)-> 회사) 

- U-대구 ISP
 - u-대구 ISP 중간보고회 PT 자료 작성 
------------------------------------------------------ 

12:00 기상 
12:30 회사 출근 
12:40 속독 훈련(스피드북) 
13:30 시청 출근(신부장, 이주임, 박주임, 남계장): 왼쪽 문 밑 주차사고 
14:00 점심(공간정보) 
16:00 퇴근 
16:40 귀가 
21:10 회사 출근(신부장, 박찬엽 주임) 
23:30 퇴근 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 24:30  --> 인쇄 맡김 

- U-대구 ISP
- u-대구 ISP 중간보고회 PT 자료 작성  
u-대구 ISP 중간보고회 PT 자료 작성 최종 마무리, 인쇄 맡김  
==============================================================================================================

 - 인쇄 맡기려 감 
20:20 ~ 20:40: 경북복사(박주임): 400부 복사 신청(비용 백만원 내외로 예상) 
20:50 ~ 23:20: 종료 
23:40 ~ 23:20: 본사 복귀 
==============================================================================================================

경북복사(경북대 동문 Buy the way 옆)  053) 941-7716 
현순명: * 직원: 011-9574-4587(*@*.*) 
webhard.co.kr hcopy/7716 
대구시청 공간정보 FAX: 803-3609 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 19:00  --> u-대구 마스터플랜 중간보고회 

- U-대구 ISP
- u-대구 ISP 중간보고회 PT 자료 작성  
==============================================================================================================

- u-대구 마스터플랜 중간보고회  
- u-대구 중간보고회 일시: 9월 11일(화) 14:00 ~ 16:30 
- 방식: 3사((주)위니텍, (주)선도, (주)지노) 순으로 합동으로 진행 
- 진행 순서: u-대구 중간보고회(위니텍), 상시갱신 착수보고회(지노), 공원정보 착수보고회(선도)  

13:00 ~ 14:00: 등록 
14:00 ~ 14:00: 개회 
14:00 ~ 14:05: 경과보고 
14:05 ~ 14:10: 정부부시장님 인사말씀 
14:10 ~ 14:35: u-대구 마스터플랜 중간보고 
14:35 ~ 14:55: 토론(질의/응답) 
14:55 ~ 15:00: 정부부시장님 당부말씀 
============================================================================================================== 

- IBK 기업은행 출장비 재 정산 
135,500원 신부장 계좌에 입금 시킬 것 --> 입금완료  
위니텍출장비7월    72,000    
위니텍출장비8월    63,500 
대구은행 036-13-057880(03613057880) 
==============================================================================================================

- 택배 배송 맡김 
동아 퀵 로지스(시청입구): 053) 424-1635 
대구전지지역 4~5,000원 
자전거 5대 택배 맡김: 35,000원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:20 ~ 23:40  --> 8시 40분 동대구역(남계장, 책자 전달) 
  
- U-대구 ISP
- u-대구 ISP 중간보고회 회의록 작성 
==============================================================================================================

- u-2011 관련 회의 
u-2011 관련 서비스 상세하게 도출할 것 
정보통신팀장이 시장님께 보고할 자료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 23:00  --> 13:00 U-대구 ISP 철수(이혜연 대리와 교체) 

- WPMS System
- 개발환경 
오즈X-Internet, tomcat-5.5.12 
]$ java -version    ====> java version "1.4.2" 
--------------------------------------------------------------- 
 - FTP 연결 
IP: 192.168.0.62 ID/PW: war/war00 
ROOT와 OZ35디렉토리를 사용 
http://192.168.0.62:8080/OZ35/server 
http://192.168.0.62:8080/ROOT/server 
FTP: 192.168.0.62 ID/PW: war/war00 
/usr/local/tomcat_5.5/webapps/OZ35/repository_files  
http://192.168.0.62:8080/ROOT/index.jsp  
http://192.168.0.62:8080/OZ35/server/Main.oza 
주선미 과장 FTP: 192.168.0.68 
========================================================================================================= 
  
 - 오즈 서버 연결(ZTerm) 
> cd /home/oz35 
> vi hrs.htm 
==============================================================================================================

 - Mysql 
1. Mysql 회사 DB연결 
 http://192.168.0.62/phpMyAdmin ID/PW : war/war00 
2. Mysql 연결 
mysql에 직접연결은 안되고 user defined를 이용하시면 됩니다.  
user_example1.vendor=user user_example1.driver=org.gjt.mm.mysql.Driver  
user_example1.url=jdbc:mysql://220.67.124.195 user_example1.props=user=oz;password=oz  
user_example1.maxconns=20 user_example1.initconns=5 user_example1.timeout=5  
인터넷에서 jdbc를 이용한 mysql 연결 이라고 검색하시면 더욱 다양한 방법을 참조 하실 수 있습니다.   
==============================================================================================================

http://218.158.3.239/hrs/server/HRS_일정관리_Week.oza 
===> http://218.158.3.239/hrs/hrs.htm 

http://192.168.0.62:8080/OZ35/server/Main.oza 
===> http://192.168.0.62:8080/OZ35/index.jsp   
==============================================================================================================

- 070913_일일업무보고_진태만 
- 금일업무내역 
1. WAR 시스템 관련 회의(주선미 과장, 유동주 대리) 
2. WAR 시스템 문서 분석 
3. 프로젝트개발표준 분석 
- 화면, 코딩, SQL, 보고서 
4. WAR 시스템 서버 점검 
- 개발환경 확인(tomcat-5.5.12,  java 1.4.2) 
- 테스트 서버 확인(92.168.0.62), Mysql 설치 확인 
- 로컬 서버 확인( 로컬 테스트 서버 설치, Mysql 설치)   
--------------------------------------------------------------- 
- 익일예상 
1. 프로젝트개발표준 소스 분석   
2. Mysql DB 분석     
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00  --> 시청 방문(박주임 차, 남계장 인사, 점심) 
  
- WPMS System
- WPMS System 일정 계획 보고서 작성 
- WPMS System 메인 화면 개발  
 1. 전체 소스 보기(스크립트 보기) 
편집(E) --> 스크립트 미리보기(V) 
SCRIPT_BEGIN Document.Boards.brd_프로젝트등록.cb_PJ성격.OnInitialize  
SCRIPT_END 
--------------------------------------------------------------- 
  
http://192.168.0.62:8080/OZ35/war.htm 
http://192.168.0.62:8080/OZ35/war_ver2.htm  
==============================================================================================================

- 동양증권CMA 5만원 반환 받을 것 
벌초 아제 5만원 입금 --> 나눔계비, 포항계에서 5만원 뺄 것(국민은행에서 송금하지 말 것) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.15(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:20 ~ 20:00 
  
- WPMS System
- WPMS System 메인 화면 개발  
- DB 설정 
C:\Program Files\FORCS\OZ XStudio\OZ Query Designer 3.5 폴더에 
db_WAR.properties 생성  --> DB 앨리어스: WAR_oz_pool 
- 공수관리: oza/LABORS/LABOR_100_A010.oza/Main --> MIS_110_A010.oza  
BASIC_INFO: 기본정보관리 
PROJ: 프로젝트관리 
TASK: Task관리 
LABOR: 공수관리 
==============================================================================================================

-- 전체 테이블명 조회 @@@@@@@@@@@ 
SELECT * FROM TAB 
WHERE TABTYPE ='TABLE'    -- 타입형식(TABLE, VIEW) 
 AND (TNAME LIKE 'IFA%' 
      OR TNAME LIKE 'IFB%') 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.16(일) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 19:00 
  
- WPMS System
 - WPMS System 메인 화면 개발   
http://192.168.0.106/hrs/war.htm 
http://218.158.3.239/hrs/war.htm 
==============================================================================================================

- 포항계 연락
최대감 횟집: 054) 252-0792 
리플러스 회센타: 054) 246-0996 
금산식당: 054) 256-3737 
동해회센타: 054) 241-5078 
- 빌라관리인 *  
==============================================================================================================

- 포항계 회비 7만원 입금(07년 09월까지 납입) 
벌초 아제 5만원 입금 --> 2만원만 송금 해야 됨 
농협 2만원을 따로 쓰고 4만원 송금할 것(HSBC에서 동양CMA로 4만원 송금 완료)  
==> 농협 2만원 인출 완료 
- 최대감 횟집(252-0792) 예약, 곗날 통보(09/24(월) 19시) 
==============================================================================================================

- OK 캐쉬백 카드(신세계 포인트 카드) 
카드번호: 9350 1500 3548 7479 
비밀번호: ***9 
갬플 5천원 OK 캐쉬백으로 결제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.17(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:30 
  
- WPMS System
- WPMS System 메인 화면 개발   
http://192.168.0.106/hrs/wpms.htm 

Task관리: oza/TASK/TASK_100 
기본Task관리: TASK_110_A010.oza 
프로젝트Task관리: TASK_110_A020.oza 
조직Task관리: TASK_110_A030.oza 
개인Task관리(WD-WAR-004): TASK_110_A040.oza 
공수입력(WD-WAR-005): TASK_110_A050.oza 
--------------------------------------------------------------- 
      
gb_MenuView gb_WISsystem   
==============================================================================================================

- 로그인 조회  ===> OK 
SELECT * FROM CM002 
- 메뉴 조회 
SELECT * FROM CM006 
sysid: MIS subsysid: MIS_100 
--------------------------------------------------------------- 
var sysid = "MIS";  
lf_menuListView(trev_Menu, sysid, "MIS_100");  //메뉴를 불러 온다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:30  --> 이사 짐 정리(파티션 분리, 짐싸기: 18:00 ~ 21:30) 
  
- WPMS System
- WPMS System 메인 화면 개발   
http://192.168.0.106/hrs/wpms.htm 

기본정보관리/BAS,  프로젝트관리/PRG, Task관리/TSK, 공수관리/LBR  
Task관리: oza/TSK/TSK_100 
기본Task관리: TSK_110_A010.oza 
프로젝트Task관리: TSK_110_A020.oza 
조직Task관리: TSK_110_A030.oza 
개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main) 
공수입력(WD-WAR-005): LBR_110_A010.oza 
 --------------------------------------------------------------- 
     
 1. DB연결이 안됨(서버) 
 2. ozf_SetWindowList("oza/TASK/TASK_100/TASK_100_A040.oza/Main", "개인Task관리");  //안 먹음 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.19(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 01:50 
  
- WPMS System
- WPMS System 메인 화면 개발   
http://192.168.0.106/hrs/wpms.htm 

개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main) 
==============================================================================================================

 - [(주)위니텍 사무실 이사]
07:00 출근 
09:20 퇴근 
10:00 WPMS System 소스 분석(집에서) 
14:00 출근 
14:20 짐꾸리기, 짐내리기 
22:30 종료 
23:30 DIP 1층(대명동 계대) 
23:40 짐 내리기, 짐정리 
01:40 종료 
01:50 퇴근 
02:10 취침 
------------------------------------------------------------------------- 
일시: 2007년 9월 19일(수) 
장소: DIP 센터 1층(구 계대 도서관 건물) 
약도: http://www.dip.or.kr/Sub_Introduction/introduction00.php 
버스노선: 106번(동대구 고속터미널 --> 대구디지털산업진흥원앞(대명동 계전 앞)), 518번(동부정류장) 
대구시 남구 대명3동 2139-12 DIP 센터 본관 1층 (주)위니텍 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00  --> DIP(대명동) 첫 출근, 커피(이승원: 09:00 ~ 09:20), 짐정리 
  
- WPMS System
- WPMS System 메인 화면 개발
http://192.168.0.106/hrs/wpms.htm 

개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main) 
==============================================================================================================

- DIP 월주차(6개월분) 
12만원(2008.2.14일까지) 
==============================================================================================================

- 쿨 메신저(Cool Messenger)
서버주소: tahiti.winitech.com(218.158.3.229) --> 이전꺼 
서버주소: 218.158.3.244 --> 변경 
==============================================================================================================

- 위니텍  TAMA 개인컴 네트웍(IP 주소) 변경(이사)  --------- 
IP: 192.168.0.46 
S.M: 255.255.255.0 G.W: 192.168.0.2 
DNS: 168.126.63.1 DNS2: 168.126.63.2 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00  --> 풋살(개인회원 등록(5만원), 회비 3만원) 
  
- WPMS System
- WPMS System 메인 화면 개발   
http://192.168.0.106/hrs/wpms.htm 

개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main) 

oza/COM/COM_200_A020.oza  --> ListBox 
oza/MIS/MIS_300/MIS_310_A020.oza 
oza/MIS/MIS_300/MIS_310_A030.oza  --> Draw Grid: true 
==============================================================================================================

- 톰켓 컨테이너 추가  
WPMS  --> 추가(oz35 기존 존재) 
==============================================================================================================

- 쿨 메신저(Cool Messenger) 
서버주소: tahiti.winitech.com(218.158.3.229) --> 이전꺼 
서버주소: 218.158.3.244 --> 변경 
==============================================================================================================

이승원(*@*.*): *  
==============================================================================================================

- 대구공전 풋살장 
팀장 김점태)561-8488   * 
농협 244-01-031924   예금주: 유현숙 
- 청구종합카서비스(종욱이 아제 추전)  
==============================================================================================================

- 고성 성묘 
8대조 7대조     
6대조     
6대조    
5대조 4대조     
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 
  
- WPMS System
- WPMS System 메인 화면 개발 
http://192.168.0.106/hrs/wpms.htm 
http://192.168.0.62:8080/OZ35/war.htm 

개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main)   
==============================================================================================================

- Mysql 
1. Mysql 회사 DB연결 
http://192.168.0.62/phpMyAdmin ID/PW: war/war00 
2. Mysql 연결 
mysql에 직접연결은 안되고 user defined를 이용하시면 됩니다.  
user_example1.vendor=user user_example1.driver=org.gjt.mm.mysql.Driver  
user_example1.url=jdbc:mysql://220.67.124.195 user_example1.props=user=oz;password=oz  
user_example1.maxconns=20 user_example1.initconns=5 user_example1.timeout=5  
인터넷에서 jdbc를 이용한 mysql 연결 이라고 검색하시면 더욱 다양한 방법을 참조 하실 수 있습니다.   
==============================================================================================================

- 위니텍 TAMA 노트북 네트웍(IP 주소)  --------- 
IP: 192.168.0.46(DIP로 이사) 
S.M: 255.255.255.0 G.W: 192.168.0.2 
DNS: 168.126.63.1 DNS2: 168.126.62.1 
------------------------------------------------------------------------- 
- 프린터 설정(Canon IR6000 --> 드라이버: Canon iR5000-6000 PCL6) 
\\192.168.0.200 --> http://192.168.0.200 
프린터 추가 --> 프린터 추가 마법사 
이 프린터에 연결된 로컬 프린터(L) 체크  --> 새포트 만들기(C) 포트종류: Standard TCP/IP Port 
프린터 또는 IP주소: 192.168.0.200  --> 완료   
--------------------------------------------------------------- 
- 프린터 설정(HP LaserJet 5200 --> 드라이버: HP LaserJet 5200 dtn)  --> 개발사업부A 전용 
\\192.168.0.64   ---> http://192.168.0.64 
프린터 추가 --> 프린터 추가 마법사 
이 프린터에 연결된 로컬 프린터(L) 체크  --> 새포트 만들기(C) 포트종류: Standard TCP/IP Port 
프린터 또는 IP주소: 192.168.0.64  --> 완료  
http://h50177.www5.hp.com/support/Q7546A/more_info_soar_ds-39887-3.html 
- 프린터 설정(HP color LaserJet 3700 --> 드라이버: HP color LaserJet 3700)  --> 디자인팀 전용  
프린터 추가 --> 프린터 추가 마법사 
이 프린터에 연결된 로컬 프린터(L) 체크  --> 새포트 만들기(C) 포트종류: Standard TCP/IP Port 
프린터 또는 IP주소: 192.168.0.140  --> 완료(192.168.0.153)  
http://h50177.www5.hp.com/support/Q7546A/more_info_soar_ds-39887-3.html 
==============================================================================================================

-- 전체 테이블명 조회 @@@@@@@@@@@ 
SELECT * FROM TAB 
WHERE TABTYPE ='TABLE'    -- 타입형식(TABLE, VIEW) 
 --AND (TNAME LIKE 'IFA%' 
   --   OR TNAME LIKE 'IFB%') 
ORDER BY TNAME DESC 
--; 
==============================================================================================================

- WPMS 테이블 받음(14:00  최원효씨에게 받음) 
 CMMI_관계형테이블설명.xls, CMMI_ERD.dam --> DA# 프로그램 설치 
- 오라클 연결 
DEV2DB 
192.168.0.17 ID/PW: cmmi/cmmi00 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00  --> 풋살(윤성호(1조), 최명진(1조): (삼겹살집, 대리운전), 차호진(5조 나와 같은 팀)) 
  
- WPMS System
- WPMS System 메인 화면 개발 
http://192.168.0.106/hrs/wpms.htm
http://192.168.0.62:8080/OZ35/war.htm 
      
개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main)  
------------------------------------------------------------------------- 
  
- .odi 파일 안보임(파일을 열면 아무것도 안 보임) 
처리: C:\Program Files\FORCS\OZ XStudio\ 에서 OZ Query Designer 3.5를 지우고 
다시 설치(D:\01. Programming\52. OZ\91. 기타\02. 설치 Program\OZXStudio_Setup.exe를 설치) 
복구(E)를 선택하면OZ Query Designer 3.5가 다시 설치됨 
==============================================================================================================

- 위니텍 HRS 서버 사용법 
1. 톰켓 서버(리눅스) 
59.25.178.81(192.168.0.17) root/fire119 winedev/wini00  
http://59.25.178.81/hrs/hrs.htm  
 2. Apachectl 실행 
]# winedev/wini00     --> (192.168.0.106)  --> .17로 변경 
]# su -  
]# fire119 
]# cd home/apache-tomcat-5.5.12/bin 
[DEV2:/home/apache-tomcat-5.5.12/bin]# catalina.sh start  --> 톰켓(오즈) 시작 
[DEV2:/home/apache-tomcat-5.5.12/bin]# catalina.sh stop  --> 톰켓(오즈) 멈춤 
[DEV2:/home/apache-tomcat-5.5.12/bin]# ps -ef  grep admin 
root      5246  5204  0 09:21 pts/3    00:00:00 grep admin --> 톰켓(오즈) 서버가 제대로 시작되고 있음 
[DEV2:/home/apache-tomcat-5.5.12/bin]# ps -ef grep java 
-------------------------------------------------------------------------------------------- 
 3. 오즈 서버 상태 확인 
http://59.25.178.81/oz35/server 
HTTP Status 404 - /oz35/server 
--> 404는 이미 친숙해진 것처럼 HTTP 서버가 UA의 요청(the Request-URI)에 맞는 어떠한 것도  
찾지 못하였을 때 내보내는 에러 코드 
http://59.25.178.81/hrs/server 
OZ Server FrameWork Servlet 3.5.0101.20060424 10:25.102 --> 이 내용이 뜨면 서버는 정상 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:20 ~ 20:30 
  
- WPMS System
- WPMS System 메인 화면 개발 
http://192.168.0.17/hrs/wpms.htm 
http://192.168.0.62:8080/OZ35/war.htm 

개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main)  
------------------------------------------------------------------------- 
  
프로젝트 정보 PJ001 
프로젝트시스템 정보 PJ002 
기본Task 정보 PJ009 
Task일정 정보 TA001 
개인Task TA002 
공수 정보 TA003 
공수상세 정보 TA004 
==============================================================================================================

- 휴대폰 요금 납부 
8월 13,630원, 9월분 17,110원  -- > 총: 30,740원  
KT요금 지로(기관번호: 6102410, 지로번호: 90512109210) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.09.30(일) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 20:30 
  
- WPMS System
- WPMS System 메인 화면 개발  
개인Task관리(WD-WAR-004): TSK_100_A040.oza 
(oza/TSK/TSK_100/TSK_100_A040.oza/Main)  
------------------------------------------------------------------------- 

  - 위니텍 WPMS 서버 설정(DB 안됨) 
http://192.168.0.17/wpms/wpms.htm 
 - 위니텍 WPMS 서버 사용법 
 1. 톰켓 서버(리눅스) 
59.25.178.81(192.168.0.17) root/fire119 wpms/wpms00(hrs/hrs00) 
http://59.25.178.81/wpms/hrs.htm  
 2. Apachectl 실행 
]# wpms/wpms00     --> (192.168.0.17) 
]# su - 
]# fire119 
]# cd home/apache-tomcat-5.5.12/conf 
[DEV2:/home/apache-tomcat-5.5.12/conf]# server.xml ===> wpms 오즈 컨테이너 설정 
/home/wpms/WEB-INF/classes]# ozserver.properties ===> wpms 오즈 컨테이너 설정  
- 파일 삭제(유닉스에서) 
] rm -rf wpms*.* 
-------------------------------------------------------------------------------------------- 
프로젝트 정보 PJ001 
프로젝트시스템 정보 PJ002 
기본Task 정보 PJ009 
Task일정 정보 TA001 
개인Task TA002 
공수 정보 TA003 
공수상세 정보 TA004 
 IP: 192.168.0.17 SID: DEV2DB cmmi/cmmi00 ====> 위니텍 OZ DB 서버 
 IP: 192.168.0.106 SID: DEV2DB winitech/winitech00    ====> 위니텍 OZ DB 서버(이전 서버) 
==============================================================================================================

- (주)위니텍 사업자번호 
504-02-64214 
- 리베라 하이츠 관리인 
고종수  * 
==============================================================================================================

- 문화상품권 2매 배송(스피드북) 
http://www.speedbook.co.kr/board/?action=view&menu_id=41&no=63346&page=1&skey=&sword= 
www.cultureland.co.kr  --> tamario2/ss*****9 
도서 구입  -->  좋은 기업...외 2권: 총30,820원(상품권 2만원 추가) 
1. 좋은 기업을 넘어 위대한 기업으로(짐 콜린스) 
2. 끝도 없는 일 깔끔하게 해치우기(데이비드 알렌) 
3. 실행에 집중하라(래리 보시디.랜 차란) 
==============================================================================================================

- 추천 도서 
A. 안철수연구소 기본 필독서 목록 
1. 누가 내 치즈를 옮겼을까 
스펜서 존슨  이영진  진명출판사 
2. 펄떡이는 물고기처럼 
스티븐 C.런던 등  유영만  한언 
3. CEO 안철수, 영혼이 있는 승부 
안철수  김영사 
4. 렉서스와 올리브나무 1, 2 
토머스L.프리드먼  신동욱  창해 
5. 좋은 기업을 넘어 위대한 기업으로   ====> 추천 
짐 콜린스  이무열  김영사 
6. 성공하는 기업들의 8가지 습관 
짐 콜린스.제리포라스  워튼포럼  김영사 
7. 체인지 몬스터 
지니 다니엘 덕  보스턴컨설팅그룹  더난출판사 
  
 B. 안철수연구소가 뽑은 실무에 도움이 되는 필독서 
1. 포지셔닝 
잭 트라우트. 알 리스  안진환  을유문화사 
2. 마케팅 전쟁 
알 리스.잭 트라우트  안진환  비즈니스북스 
3. 캐즘 마케팅 
제프리 A.무어  유승삼.김기원  세종서적 
4. 실행에 집중하라 ====> 추천 
래리 보시디.랜 차란  김광수  21세기북스 
5. 탁월한 관리  ====> 추천 
앤드류 그로브  성별현.김대훈  대경출판 
6. 토네이도 마케팅 
제프리 A.무어  유승삼.김영태  세종서적 
7. 편집광만이 살아 남는다 
앤드류 그로브  유영수  한국경제신문사 
8. 끝도 없는 일 깔끔하게 해치우기 ====> 추천 
데이비드 알렌  공병호  21세기북스 
------------------------------------------------------------------- 

 C. 삼성SDS 전략마케팅연구회 추천도서 
1. 서비스 이노베이션 엔진, 6시그마 
노재범 등  삼성경제연구소 
2. 블루오션 전략 
김위찬.르네 마보안  교보문고 
3. Brand Commnunicaton 
나운봉  IPS(산엄정책연구원) 
4. 미래의 기업 어디로 갈 것인가 
피터 F. 드러커 등  이재구.서재현  한국경제신문사 
5. Business is War 
피터 F. 하들리  김민주.송희령  아인앤컴퍼니 
6. 실행에 집중하라 
래리 보시디.랜 차란  김광수  21세기북스 
7. 문제는 성과다 
하이케 브루흐. 수만트라 고샬  정준희  소소 
8. Brand Building 
신철호 등  IPS(산엄정책연구원) 
9. Brand Management 
정용태  IPS(산엄정책연구원) 
10. 미래 기업의 조건 
클레이튼 크리스텐슨 등  이진원  비즈니스북스 
11. 대한민국 일등상품 마케팅전략 
조서환.추성엽  위즈덤하우스 
12. 거인들의 발자국 
한흥  비전과 리더쉽 
13. 세계를 움직이는 삼성의 스타 CEO 
홍하상  비전코리아 
14. 브랜드 창조의 법칙 
알 리스. 로라 리스 최광복  지식의 숲 
15. 블랙홀 시장창조 전략 
권민 등  고즈윈 
16. 짐 콜린스의 경영전략 
홍하상  비전코리아 
17. 성공하는 한국인의 7가지 습관 
조신영  한스미디어 
18. 인더스트리 에벌루션 
애니타 맥거한  신영욱  애플트리테일즈 
19. iCon 스티브 잡스 
제프리 영. 월리엄 사이먼  임재서  민음사 
20. 대한민국 은행을 바꾼 신한은행 방식 
정동일  김영사 
21. 경영이란 무엇인가 
조안 마그레타  권영설.김홍열  김영사 
22. 2020 미래 한국 
이주현 등  한길사 
23. 피도 눈물도 없이 경영하라 
조지 스토크. 로브 라케나워  김원호  북@북스 
24. 미래마케팅 
김정구  교보문고 
25. 성정과 혁신 
클레이튼 크리스텐스. 마이클 E. 레이너  딜로이트 컨설팅  세종서적 
26. 한국경제를 읽는 7가지 코드 
좌승희  굿인포메이션 
27. 성장의 비밀 열정경영 
리처드 창  이진원  위즈덤하우스 
28. 메가트렌드 2010 
패트리셔 에버딘  윤여중  청림출판 
29. 하버드 졸업생은 마지막 수업에서 만들어진다 
하버드 경영대학원 교수 15인  안명희  세종서적 
30. 사회 이동의 충격 원더랜드 
남궁 석  랜덤하우스중앙 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■