

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2007.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2007.04.01(일) 작업 ■■■■■■■■■■■■■■■■■
---> 13:00 ~ 15:30 

- 도서 대여(효목 도서관): 10일간 
1. 기획서 제안서 작성법 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200402110001 
2. UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.02(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 제안서 분석
- 기획 핵심 사항 
1. 기획서는 자신의 생각을 다른 사람에게 이해시키기 위해 쓰는 것 이다. 
2. 내용은 논리적으로 정리(간단 명료, 중복 피함) 
3. 시각 효과를 능숙하게 활용한다.(도형, 사진, 표 등) 
------------------------------------------------------------------- 

- 기획의 4단계 프로세서 
1. 과제와 문제점의 확인 
2. 현황이나 배경 분석과 과제나 문제점의 검증 
3. 해결을 위한 방법의 발견 
4. 방법 실행을 위한 계획 
========================================================================================================= 

- 제안서 관련 도서 
SE를 위한 제안서 작성법(SE: System Engineering) 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200410210002 
기획서 제안서 작성법 - 개정신판 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200612150020 
========================================================================================================= 

- 방법론 관련 도서 
대한민국 개발자 희망보고서 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200702130001  
객체지향 CBD 개발 바이블 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200308010007 
UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기  ==> 도서관에 있음 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001 
==============================================================================================================

- 휴대폰 단축번호 관리(KT 에버폰) 
01: 우리집 
02: 진기숙 
03: 기병호 
11: 김진협 
12: 문태용 
13: 김일남 
14: 최인선 
15: 홍상환 
51: 이동규 
52: 구자호  
53: 우태성 
91: 위니텍 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.03(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 제안서 분석
- 기획서 작성 요점 
(1) 기본 작성법 
 가. 간결한 기획서 작성을 목표로 한다. 
 나. 간결하고 이해하기 쉬운 기획서를 작성한다. 
 다. 논리가 중요하다. 
(2) 기획 의뢰자. 진행 방법 
 가. 기획 의뢰자의 입장을 고려한다.  
 나. 제안 상대의 입장에 서서 기획서를 작성한다. 
 다. 사내를 대상으로 한 자극적인 기획서는 용기가 필요하다. 
 라. 사내를 대상으로 하는 기획서는 사전 조율이 필요하다. 
 마. 사전 협의를 잘 실행한다. 
 바. 원활하게 진행하는 요령은 한 단계 한 단계 확인하는 것이다. 
(3) 구성 
 가. 기획서는 [배경], [목적], [전략], [실시 계획]의 4가지로 구성된다.  
 나. [전략]은 기획의 요점이다.  
 다. 중요도가 높은 순으로 서술한다. 
 라. 소제목과 내용을 일치시킨다.  
 마. 구체적으로 작성한다. 
 바. 필요한 것에 중점을 둔 기획서를 작성한다. 
(4) 내용 
 가. 간결하게, 그렇지만 전략은 심도 있게 작성한다.  
 나. 기획의 포인트를 깊이 있게 파고들자.   
 다. 개성있는 기획서 작성이 중요하다. 
 라. 색다른 아이디어를 추가하면 기획서가 흥미로워진다. 
 마. 여러가지 아이디어를 추가하면 기획서의  깊이가 더해진다.  
 바. 독특한 기획을 실현하기 위해서는 확실한 증명이 필요하다. 
 사. 평범한 기획을 우습게 보지 마라. 
 아. 실시 계획은 엄밀하게 검토한다. 
 자. 캠페인은 컨셉이 중요하다. 
 차. 경쟁사와의 차별화를 도모한다. 
 카. 조사 기획서는 획일적이어도 좋다. 
 타. 조사 방법을 알아두자. 
 파. 비용을 명확하게 해두자. 
 카. 주장을 펼치는 것이 중요하다. 
(5) 제시 방법 
 가. 도안과 디자인도 기획서의 중요한 구성 요소다. 
 나. 비주얼은 아주 강력한 호소력을 가진다. 
 다. 소제목과 내용은 유연하게 구성한다. 
 라. 기획서를 보기 쉽게 만드는 핵심은 소제목을 붙이는 것이다. 
 마. 제목으로 어필하는 것도 때로는 매우 중요하다. 
(6) 설득 
 가. 조사 결과와 데이터는 설득력을 가진다. 
 나. 채산성과 수치는 아주 중요하다. 
 다. 메리트가 떠오르게 하자. 
 라. 메리트가 많은 기획서는 쉽게 통과된다. 
 마. 결과를 분명하게 한다. 결과를 기대하게 하는 기획서를 작성한다.  
 바. 새로운 시도를 제안할 때에는 실시 효과를 강조한다.   
 사. 스스로 조사를 실행해 보자. 
(7) 종합기획서 
 가. 종합기획서에는 복수의 실행 계획을 조합한다.   
 나. 페이지 수가 많은 경우에는 [목차]를 붙인다. 
 다. [분석, 포지셔닝, 문제와 기획] 부분이 중요하다. 
 라. 기획서를 제시하는 방법에 변화를 주어도 좋다.  
 마. 프레젠테이션할 것이란 점을 고려하여 작성한다. 
 바. 경쟁 프레젠테이션에서의 평가는 기획서의 내용이 전부가 아니다.  
 사. 영문 기획서도 기본 구성은 동일하다.  
==============================================================================================================

- 인터넷 속독프로그램 스피드북(6개월 10만원) 
http://www.speedbook.co.kr 

결제, 수강 신청: 2007-04-03 
Level 1: 2007-04-03 ~ 2007-06-03 
1  Level 1  40 655 2007-04-03 20:05:25  2007-04-03 20:35:50 
http://www.speedbook.co.kr/board/?action=view&menu_id=17&no=53287&page=1&skey=&sword= 
Level 2: 2007-06-04 ~ 2007-08-03 
Level 3: 2007-08-04 ~ 2007-10-03 
-------------------------------------------------------------------------------------- 
- 속독 
속독이란 '빠르게 해석하기' 입니다. 우리는 독서를할때 읽는다는 개념을 가지고 책일 보지만 
시를 뺀 나머지들.. 특히 설명문, 논설문 등은 읽기는 필요없습니다. 
눈 운동 -> 뇌(집중)  ==> 고속독해의 꽃은 눈의 움직임 
정확하지 않다면 빠르게 읽는 것이 무슨 소용없음 
- 속독은 순간적으로 빠르게 해석하는것 
우리가 글을 읽는건 머리로 얼마나 빠르게 받아들이느냐 이지, 글을 읽는게 아닙니다. 
머리가 받아들였다고 생각한다면 바로바로 글을 계속 이어나가는게 좋습니다. 
또한 속독은 암기력을 올려주진 않습니다. 암기력향상은 꾸준한 암기와 시간투자겠네요.. 
속독은 글을 빠르게 이해하여 머릿속으로 해석하는것이지, 빨리 외우는게 아닙니다. 
암기라고 할거같으면 읽고,쓰고,말하고 라고 할 수 있겠지만 
속독은 처음에 말했듯이 읽는게 아니라 '해석'입니다. 따라서 암기에 많은 도움을 주진 못합니다. 
빨리 읽을 수 있다고해서 암기를할땐 속독이 안쓰입니다. 
단어를 외울때는 확실히 그렇구요, 책 내용을 외우고 익힐땐 반복 속독도 괜찮을 수 있겠네요.  
==============================================================================================================

- LG 단말기 할부금 완납(모든 거래 종결됨) 
남은 할부금: 76,000원(15,200원 * 5개월) 
T. 1566-8019 담당: 성주현 
액정 깨어져서 KT로 번호 이동함 
==============================================================================================================

- 대성 집게형 휴대폰줄2개 6,100원 
[대성] 스프링줄 집게. 분실방지 줄, (휴대폰, 열쇠,미니지갑 등에사용)(검정/투명)약8cm-최대70cm 
http://www.gmarket.co.kr/challenge/neo_goods/goods.asp?goodscode=111918912  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.04(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 18:00 

- 방법론 분석
- 방법론 
UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001 
==============================================================================================================

- i3shop 방문(18:00 ~ 20:30) 
연말 정산용 원천징수영수증 받음(박인철 대리) 
IT개발실(떡볶기, 냉면) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.05(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 18:20   --> 풋살(제 1회 자체 대회, A조(2승), C조(1승1패):나의 조, B조(2패)) 

- 방법론 분석
- 방법론 
UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001  
제안서 제목: 성공 제안서 작성의 비결(소방관련) 
기능 점수(FP: Function Point): 논리적 설계를 기초로 소프트웨어의 기능을 정량화하고, 계수적 측정을 통한  
실험적 관계를 통해 개발 규모를 산정하는 방법.    
공인 기능 점수 전문가(CFPS:Certified Function Point Specialist): 기능 점수(Function Point) 방식으로  
소프트웨어 사업의 규모 및 가격 측정을 담당하는 전문가. 
==============================================================================================================

- 추천 도서 
"체게바라 평전", "혁명을 팝니다.", "위대한 패배자", "오체 불만족" 
"회사가 당신에게 알려주지 않는 50가지 비밀" 
==============================================================================================================

- 주식형 펀드   
10,542,393원(한.미FTA 때문에 급등): 환매 고려 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.06(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ---> 금완호 과장 퇴사 

- 방법론 분석
- 방법론 
UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.07(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 16:00 

- 방법론 분석
- 방법론 
UML,ROSE,RUP 객체지향 분석설계 그리고 소설같은 실전 프로젝트 이야기 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200407220001  
==============================================================================================================

- 인터넷 속독프로그램 스피드북(www.speedbook.co.kr)  
번호 학습버젼 정확도 스피드 학습시작 학습종료  
5 Level 1 80 885 2007-04-07 7:54 2007-04-07 8:22 
4 Level 1 60 861 2007-04-06 7:39 2007-04-06 8:05 
3 Level 1 80 685 2007-04-05 7:29 2007-04-05 7:57 
2 Level 1 30 638 2007-04-04 7:25 2007-04-04 7:52 
1 Level 1 40 655 2007-04-03 20:05 2007-04-03 20:35  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.09(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 설비운영SST 분석
SE를 위한 제안서 작성법(SE: System Engineering) 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200410210002 
==============================================================================================================

- 대구환경시설공단 Project(www.dgeic.or.kr) 
PM: 손인태 대리,  문주식 대리  
개발환경: Unix, tomcat(톰켓), OZ 
OZ 프로그램: 3천 만원(천 5백에 우리회사에서 공급 받음) 
설비운영지원시스템(www.energysoft.co.kr) 
==============================================================================================================

- 음성전환 프로그램 
한글(한글 파일) --> 음성 ==> TTS (Text To Speech) 
아이옵스 Z3 2GB MP3 화이트 ==> MP3   
CM테크 라이브 CA-K20MT(128M)  ==> MP3 
http://shopping.naver.com/detail/detail.nhn?cat_id=00030011&nv_mid=1000020988&frm=nv_model&tc=3  
http://blog.naver.com/cupit93?Redirect=Log&logNo=150003010685 
http://www.homesori.net/Magic/HomesoriMagicTest.aspx 
http://voiceware.co.kr/demo/demo_text.html  
==============================================================================================================

- 셀프 세차(대구 상공회의소 뒤) 
3,500원: 거품 2번, 행굼 2번 
5단계(예비세차,거품, 행굼, 왁스, 세정): 2,500원으로 가능 
도장: LS(차 색상: 페인트 붓 살때 필요) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.10(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 설비운영SST 분석
SE를 위한 제안서 작성법(SE: System Engineering) 
http://kangcom.com/common/bookinfo/bookinfo.asp?sku=200410210002 
제안 의뢰서(RFP: Request For Proposal): 하드웨어 및 소프트웨어를 취득할 때, 제조사에 제안서의 제출을  
의뢰하기 위해 작성하는 서류, 또는 그 의뢰를 하는 것 
제안서(Proposal): 시스템을 개발하기에 앞서 고객에게 제출하는 시스템 설계 제안서  
==============================================================================================================

- 에버폰 USB 하드웨어 설치 에러 
현상: Windows 로고 테스트 통과에 실패 
원인: 설치되는 드라이버가 윈도우즈의 서명 및 게시가 된 것이 아니라고 하는 것으로  문제가 있을수도 있고  
없을수도 있습니다.  
==============================================================================================================

- 펀드 환매 
환매액: 10,718,524원 입금액: 1,0000,000원 
1년 4개월에 718,524원이면 엄청 이익 
==============================================================================================================

- (주)위니텍 첫 급여 
820,320 (주)위니텍 급여(2월(8일간)) 
2,310,060  (주)위니텍 급여(3월) 
279,690 (주)위니텍 퇴직금(중간정산) 
총자산: 112,850,328원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.11(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 설비운영SST 분석
SE를 위한 제안서 작성법(SE: System Engineering) 
PMP(Project Management Professional): 프로젝트관리 전문가. 프로젝트관리 분야의 세계 최고 자격증으로 미국 PM  
전문기관인 PMI(Project Management Institute)가 1984년부터 PM의 전문성 확보와 체계적인 PM 기법을 체득시키기  
위해 시행하고 있는 자격증. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.12(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30  --> 풋살, 병오 아제 모 제사(정택, 종욱, 종근 아제) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
1. 일정: 4월 21일(토) 까지 초안 완료  ==> 4월 25일(수) 까지 완료 
2. 분량: 200 페이지로 작성 
3. 메인 작성자: 한국희 과장(Sub로 참여) 
-------------------------------------------------------------------------------------------------------------------------- 

USN(Ubiquitous Sensor Network): 전자태크(RFID)와 U-센서를 BcN과 연계하여 사물의 정보를 인식, 관리 하는 네트워크. 
BCN(Broadband Convergence Network): 음성ㆍ데이터, 유무선 등 통신ㆍ방송ㆍ인터넷이 융합된 품질 보장형  
광대역 멀티미디어 서비스를 언제 어디서나 끊김 없이(Seamleass) 안전하게 이용할 수 있는 차세대 통합 네트워크.  
ITS(Intelligent Transportation Systems): 지능형 교통 시스템. 전자, 정보, 통신, 제어 등의 기술을 교통체계에  
접목시킨 지능형 교통 시스템이다. 신속, 안전, 쾌적한 차세대 교통체계를 만드는데 목적을 두고 있다. 
ISP(Information Strategic Planning): 최적의 정보화(Information)를 추진해 나가기 위한 중장기 전략(Strategic)  
계획(Planning)을 수립 하는 것. 
CFAMS(Computerized Fire Alarm Monitoring System): 개별 건물/상가/공자의 화재 경보 상태를 모니터링하고 
비정상적인 상태가 발생할 경우 다이얼 호출식의 전화선(PSTN)을 통해 관제센터로 그 내용을 전송할 모니터링 
시스템의 구축하는 것. 
DAC(Digital Alarm Communicator) 
텔레매틱스(Telematics): 자동차와 무선통신을 결합한 새로운 개념의 차량 무선 인터넷 서비스 
BIS(Bus Information System): 버스정보안내 시스템 
BMS(Bus Management System): 버스운행정보 시스템 
FTTH(Fiber-To-The Home)전화국으로부터 각 가정까지 개별적으로 광섬유를 부설하여 광대역 서비스를 하는  
가입자망 방식. 전화, 팩스, 데이터, 텔레비전 영상의 광대역 서비스에 이르는 모든 통신 서비스가 한 줄의 광섬유로  
이루어질 수 있다. 그러나 파이버 투 더 홈(FTTH)은 각 가정마다 광섬유를 부설하고, 광망 종단 장치(ONU)도 개별적 
으로 설치해야 하는 등 경제성에 문제가 있다. 따라서 이미 사용 중인 광대역 방식을 활용하는 파이버 투 더 존(FTTZ)  
방식이 제안되었다. 
==============================================================================================================

- 제안서 작성법 문서 작업 
제안서 제목: 성공 제안서 작성 비결 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.13(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00  --> 문정, 진협과 점심 식사(문정이가 냄), IT개발실 방문(세금계산서 수정) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성(문서 분석) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.14(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:40  --> 격주휴무, IT개발실 방문(호진과 저녁, 소주 한잔) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
 1. 프로젝트 추진방법론 
 경영진단 및 중장기 전략수립(네모경영개발원).doc  
 2. 프로젝트 수행절차 및 활용내역 
 3. u-Daegu추진 방향설정 수립방안 
 4. 공양사항의 검토 방안 
 5. 특정지역에 대한 유비쿼터스 기술 구현 방안 
 6. 공간정보를 이용한 u-City 구현방안 
 7. 유비쿼터스 사회를 위한 네트워크 구축방안 
 12. 산출물 내역 
----------------------------------------------------------------------------------------------- 

- U-대구 마스터플랜 수립 제안서 회의 
1. 일정: 4월 23일(월): 초안 완료  ==> 4월 25일(수): 완료 ==> 4월 30일(월): PT 
2. 분량: 180 페이지로 작성 
3. 참가자: 한국희 과장, 임용호 부장(전직 대구시 계약직 기술직 공무원) 
4. 내용 
 가. 스토리 보드 내용 설명(한국희 과장) 
 나. 대구시 프로젝트 관련 내용, 입찰 관련 내용 설명(임용호 부장) 
 다. 업무 분담(3. 기술부문) 
5. 제안서 핵심 내용 
 가. U-대구 Master plan(컨설팅) 
 나. 실제로 평가자들은 1.제안내용과 PT로 평가를 함 
 다. 사업내용, 예산, 기간 도출 
==============================================================================================================

- 인터넷 속독프로그램 스피드북(www.speedbook.co.kr)   
번호 학습버젼 정확도 스피드 학습시작 학습종료  
12 Level 1 80 822 2007-04-14 7:51 2007-04-14 8:16 
11 Level 1 80 793 2007-04-13 8:12 2007-04-13 8:37 
10 Level 1 70 792 2007-04-12 7:33 2007-04-12 7:58 
9 Level 1 60 819 2007-04-11 7:32 2007-04-11 7:59 
8 Level 1 60 948 2007-04-10 7:24 2007-04-10 7:49 
7 Level 1 70 757 2007-04-09 7:21 2007-04-09 7:47 
6 Level 1 90 834 2007-04-08 9:30 2007-04-08 10:02  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.16(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
 1. 프로젝트 추진방법론  
   가) 방법론 요구사항  
   나) 방법론 소개 
- 경영진단 및 중장기전략수립 컨설팅 매뉴얼(경영진단 및 중장기 전략수립(네모경영개발원).doc) 
- 위니텍 방법론(관리기법1(Method/1) 수정) 
   다) 특징 및 장단점 
   라) 적용방안 
==============================================================================================================

- 현대증권 검토 
현대 ELS  2년 만기(연 17%)   T: 755-8900 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.17(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 24:00 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
 1. 프로젝트 추진방법론  
   가) 방법론 요구사항  
   나) 방법론 소개 
- 경영진단 및 중장기전략수립 컨설팅 매뉴얼(경영진단 및 중장기 전략수립(네모경영개발원).doc) 
- 위니텍 방법론(관리기법1(Method/1) 수정) 
   다) 특징 및 장단점 
   라) 적용방안 
  2. 프로젝트 수행절차 및 활용내역  
    가) 중장기전략수립 컨설팅 매뉴얼 
    나) 위니텍 방법론 
    다) 본 사업 적용 절차 
==============================================================================================================

- 파워포인트 페이지 이동 할 때마다 계속 깜박거릴 때 
http://cafe.naver.com/powerpoint.cafe?iframe_url=/ArticleRead.nhn%3Farticleid=2524 
제어판의--> 설정 --> 고급(V) --> 문제해결 
하드웨어가속 조절(H) 바를 왼쪽으로 조절하셔서, DirectX가속기능을 사용하지 않는곳까지 왼쪽으로 이동 
(중간 정도에 위치시킴) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.18(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:40 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
 1. 프로젝트 추진방법론  
   가) 방법론 요구사항  
   나) 방법론 소개 
- 경영진단 및 중장기전략수립 컨설팅 매뉴얼 
- 위니텍 방법론(관리기법1(Method/1) 수정) 
   다) 특징 및 장단점 
   라) 적용방안 
  2. 프로젝트 수행절차 및 활용내역  
    가) 프로젝트 수행절차 및 산출물 
  착수 -> 계획 -> 조사 -> 자료수집 -> 분석 -> 정리 -> 안 도출 -> 검증 
    나) 본 사업 적용 절차 
------------------------------------------------------------------ 

5. 특정지역에 대한 유비쿼터스 기술 구현방안 
가) 지역별 특화현황 
나) 지역별 사업 계획 
다) 지역별 정보화 요소 
라) 정보화 정책도출 방안\ 
- 테크노폴리스, 혁신도시, 동대구역세권, 이시아폴리스 
u-부산, u-송도  
==============================================================================================================

- 폰트 설치 방법(XP Home일 때) 
C:\WINDOWS\Fonts에 붙어 넣기 한다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.19(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:40   --> 풋살(신입 사원: 김형진씨) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
  5. 특정지역에 대한 유비쿼터스 기술 구현방안 
가) 지역별 특화현황 
나) 지역별 사업 계획 
(1) 동대구역세권 
(2) 혁신도시 
http://innocity.moct.go.kr/innocity/city_02daegu.jsp?tbtype=2 
(3) 이시아폴리스 
(4) 테크노폴리스  
다) 지역별 정보화 요소 
라) 정보화 정책도출 방안  
u-부산, u-송도  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.20(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문 
  5. 특정지역에 대한 유비쿼터스 기술 구현방안 
가) 지역별 특화현황 
나) 지역별 사업 계획 
(1) 동대구역세권 
(2) 혁신도시 
http://innocity.moct.go.kr/innocity/city_02daegu.jsp?tbtype=2 
(3) 이시아폴리스 
(4) 테크노폴리스  
다) 지역별 정보화 요소 
라) 정보화 정책도출 방안  
u-부산, u-송도  
==============================================================================================================

- 새마을 금고 예금(우대예탁금) ==> 세금우대 저축(진덕근)  
만기: 2008-04-20    입금: 18,000,000원 만기지급액: 18,936,000원 ==> (년 5.2%) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.21(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:30 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문  
  6. 공간정보를 이용한 u-City 구현방안 --> 대구시 생활공간정보(www.gis.go.kr) 
가) 공간정보통합시스템 현황 
  편집프로그램, 자료교환 체계, 공동활용시스템, 생활공간시스템  --> 37 
나) 유비쿼터스 기술과 GIS 연계 
다) 구현 도출방안 
  교통, 지도, 상하수도, 도시가스, 의료, 소방, 지하철(재난)  
==============================================================================================================

- 인터넷 속독프로그램 스피드북(www.speedbook.co.kr)   
번호 학습버젼 정확도 스피드 학습시작 학습종료  
18 Level 1 80 874 2007-04-21 8:05 2007-04-21 8:33 
17 Level 1 70 798 2007-04-20 7:41 2007-04-20 8:09 
16 Level 1 100 885 2007-04-19 7:37 2007-04-19 8:04 
15 Level 1 60 793 2007-04-18 7:41 2007-04-18 8:10 
14 Level 1 90 813 2007-04-17 7:23 2007-04-17 7:49 
13 Level 1 100 953 2007-04-16 7:35 2007-04-16 8:02 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.22(일) 작업 ■■■■■■■■■■■■■■■■
---> 09:50 ~ 20:40 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
3. 기술부문   
   7. 유비쿼터스 사회를 위한 네트워크 구축방안 
가) u-City를 위한 요구 인프라 
나) 유비쿼터스 네트워크 구축 고려사항 
다) 네트워크 차별화 방안 
라) 대상지역 선정방안 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.23(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 03:00 

- 소방 방재청PT
- 서울 출장 
소방 방재청 유지보수 PT 
KTX 16:06 ~ 17:52 
2호선 당산역 6번 출구: 삼성 래미안 4차 402동 302호 
김진영 과장/권영우 대리/ 노래언씨 
========================================================================================================= 

- 서울 출장(소방 방재청 유지보수 PT) 
16:06 동대구역(KTX(비즈니스카드): 26,700원) 
18:00 서울역 도착 
19:00 당산역(삼성 래미안 4차 402동 302호): 권영우 대리 
19:20 저녁 
20:00 소방 방재청 유지보수 PT 초안 작성(제안서에서 추출) 
24:20 소방 방재청 유지보수 PT 프린트 출력 
03:00 취침 
========================================================================================================= 

- 출장 신청서 
1. 목 적: 소방 방재청 유지보수 프리젠테이션 
2. 대 상 자: 진태만(POOL팀) 
3. 출장장소: 서울 소방 방재청 
4. 교통 
  동대구(오후 16:06분 출발)  --> 서울(오후 17:52분 도착): \38,600(법인결제) 
  서울(오후 16:06분 출발)  --> 동대구(오후 17:52분 도착): \38,600(법인결제) 
  ----------------------------------------------------------------------------- 
  교통비 합 계: \77,200  
5. 기타사항 
 1) 일 비(교통비): \15,000 
 2) 식 비: 15,000(석, 조, 중식) 
   ----------------------------------------------------------------------------- 
  기타 사항 합 계: \30,000 
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2007.04.24(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- 소방 방재청PT
- 소방 방재청 유지보수 PT 
(주)위닉스통신 직원으로 대신 PT(개망신: 하드웨어업체로 신규로 SW 진입하려 입찰 했다고 설명) 
==============================================================================================================

- 서울 출장2(소방 방재청 유지보수 PT) 
07:30 기상(당산역 삼성 래미안 4차 402동 302호) 
09:10 (주)위닉스통신 이재호 차장 만남: 사전 회사 정보 공유 
10:00 소방 방재청 도착 
11:00 소방 방재청 유지보수 PT(1번째: 김진영 과장, 2번째) 
11:30 소방 방재청 유지보수 PT 종료 
13:00 점심 
13:40 후남 만남(건국대병원 앞) 
14:00 버거킹(후남 점심) 
15:30 서울역 
17:10 동대구역 도착 
17:30 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.25(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 24:00 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
12. 산출물 내역 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.26(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30   --> 풋살(신천 동로 처음 이용: 50분 걸림) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
12. 산출물 내역 
========================================================================================================= 

- 수정 사항 
1. 프로젝트 추진방법론 
 나. 방법론 소개 
  2) 위니텍 방법론 ======> 위니텍 방법론 순서도 변경 
계획 -> 조사 -> 분석 -> 결과도출 
5. 특정지역에 대한 유비쿼터스 기술 구현방안 
 가. 지역별 특화현황 ======> 상세히 기술 
6. 공간정보를 이용한 u-City 구현방안 
 1. 정의 2. 주요기능 3. 흐름도 ======> 순서대로 기술  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.27(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성, 최종 수정, 프린터 출력 
2. 프로젝트 수행절차 및 활용내역(나).ppt   
--> A3 포맷으로 나. 본 사업 적용 절차 다시 작성 
==============================================================================================================

- CVS 에러 
cvs add: `2. 프로젝트 수행절차 및 활용내역(나)_A3.ppt' added independently by second party 
Error, CVS operation failed 
원인: 권한이 다른 사람이 이미 올린 파일임  
대책:  
C:\CVSROOT\Project\대구광역시\2007.04_ U-대구 마스터플랜 수립\0.9.제안서\제안서\III. 기술부문 
에서 해당 12. 산출물 내역.ppt 삭제 
작업한 폴더에서 12. 산출물 내역.ppt 파일 불러 옴 --> CVS commit을 함    
-------------------------------------------------------------------------------------------------- 

- 파일 삭제 
[tamario@cvs III. 기술부문]$ ls 
[tamario@cvs III. 기술부문]$ cd  Project / 대구광역시 / 2007.04_ U-대구 마스터플랜 수립 / 0.9.제안서 / 제안서 / III. 기술부문  
Files shown: 17   
[tamario@cvs III. 기술부문]$ rm -rf 2. 프로젝트 수행절차 및 활용내역'('나')'.ppt 
[tamario@cvs III. 기술부문]$ rm -rf 5.\ 특정지역에\ 대한\ 유비쿼터스\ 기술\ 구현방안.ppt\,v 

test.html     test.jpg   test.txt 를 각각 abc.html    abc.jpg    abc.txt 로 변경하려면   
rename 's/[^.]+\./abc\./'  test.*    이렇게 하시면 됩니다.  
[tamario@cvs III. 기술부문]$ rename 5. 유비쿼터스 기술.ppt,v  5. 유비쿼터스 기술_22.ppt,v   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.28(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 20:00   --> 격주 휴무 

- U-대구제안서 작업
- 제안서 작성법 문서 작업 완료 
1. 제안서 제목: 성공 제안서 작성 비결 
==============================================================================================================

- 인터넷 속독프로그램 스피드북(www.speedbook.co.kr)   
번호 학습버젼 정확도 스피드 학습시작 학습종료  
24 Level 1 60 787 2007-04-28 8:51 2007-04-28 9:22 
23 Level 1 60 751 2007-04-27 7:33 2007-04-27 8:04 
22 Level 1 60 713 2007-04-26 7:30 2007-04-26 8:00 
21 Level 1 70 755 2007-04-25 7:38 2007-04-25 8:05 
20 Level 1 80 858 2007-04-23 7:47 2007-04-23 8:13 
19 Level 1 60 786 2007-04-22 9:59 2007-04-22 10:28 
18 Level 1 80 874 2007-04-21 8:05 2007-04-21 8:33 
17 Level 1 70 798 2007-04-20 7:41 2007-04-20 8:09 
16 Level 1 100 885 2007-04-19 7:37 2007-04-19 8:04 
15 Level 1 60 793 2007-04-18 7:41 2007-04-18 8:10 
14 Level 1 90 813 2007-04-17 7:23 2007-04-17 7:49   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.29(일) 작업 ■■■■■■■■■■■■■■■■
---> 09:10 ~ 20:30 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성((주)인트모아 꺼 만듬) 
"HY산고, (한)문화방송" 폰트가 설치되지 않았습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.04.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30   --> 증조 할배 제사(포항) 

- U-대구제안서 작업
- U-대구 마스터플랜 수립 제안서 작성 
11:00 ~16:20   제안서 출력 및 제본 
16:00 제안서 제출 
16:30 조부장 타사PT, 강사장 면담(소방관련 일 아님 --> 나중에 시켜 주겠다고 함) 
결론: 추후 지켜봄(다른 회사 이직에 대한 대안 미비) 
==============================================================================================================

- 패스워드 변경(cvs) 
Secure Shell로 CVS 서버에 접속(Secure Shell Client  --> New Terminal --> Secure Shell) 
Host Name: cvs.winitech.com 
User Name: tamario PWD: zxcfdsa0 Port: 22 
-------------------------------------------------------------------------------------------------------- 
[tamario@cvs tamario]$ passwd 
Changing password for user tamario. 
Changing password for tamario 
(current) UNIX password: zxcfdsa0 
New UNIX password: ss*m**    =======> 패스워드 변경: zxcfdsa0  --> ss*m** 
==============================================================================================================

- 노트북 재설치(XP Home -> XP Home): F3JC-AP122H 
Product Key: PBKHT-TDYR8-C3XV3-PM3Y4-QTTFD 

제가 노트북을샀을때 복구시디, 통합드라이버 (응용프로그램 재설치)시디를 줬습니다. 
물론 님도 드렸겠죠  엑스피로 포맷하셔도 웹캠을 사용하는데는 아무지장없습니다. 
통합드라이버 시디만 넣으면 알아서 그래픽 칩셋,메인보드 칩셋, 사운드 카드,랜카드, 그외  
웹캠등 컴퓨터에 설치/ 장착되있는 모든 드라이버를 알아서 잡아줍니다. 
그래서 포맷후 통합드라이버를 깔면 전상태와 똑같은 pc가 됩니다 쉽죠 
==============================================================================================================

- 증조 할배 제사(포항)
18:00 퇴근 
18:20 동대구 출발 \
18:40 경주 큰누나집 도착(1시간 20분 걸림): 비가 옴 
20:50 인터넷 안됨 IE 6.0 안뜸: 바이러스 먹었음) ==> V3, 바이로봇으로 바이러스 체크 
22:20 경주 출발 
22:50 포항집 도착(총: 1시간 50분 걸림) 
23:00 제사 
01:00 종료 
01:10 취침 
05:30 기상 
05:50 포항 출발: 비가 옴 
06:00 대구포항고속도로(110Km으로 주행) 
06:50 팔공산 톨게이트 도착(통행료: 3,900원) 
07:00 대구집 도착(1시간 10분 걸림) 
07:10 출근 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■