

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2007.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■  2007.06.01(금) 작업 ■■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- U-대구 ISP
1. U-시티 참고 자료 분석
 타시도 u-시티 진행현황 분석 
USP완료, 진행중, 완료  
==============================================================================================================

2. HR System 주간업무 보고 수정 
-  요일 세팅 완료(월요일, 공휴일) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.02(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 --> 5월 출장비 신청(차비, 주차비) 

- U-대구 ISP
1. HR System 주간업무 보고 수정 
-  요일 세팅 완료(월요일, 공휴일) 
==============================================================================================================

- TAMA 가계부 작업(시작) 
사용자 화면 작업 
------------------------------------------------------------------------------  
- trsPatInfo.vbp 시행 오류 
 EditX.ocx ---> 에러 
 등록에러: LoadLibrary("EditX.ocx") 실패 - 지정된 파일을 찾을 수 없습니다 
 원인: EditX.ocx가 98용이거나 관련 dll이 미존재 
 LabelX2.ocx LabelX3.ocx uo_CCombo.ocx   Threed32.ocx   ---> 성공 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.04(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 속독 Level 2 시작(장문) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
타시도 u-시티 현황분석서 작성(01. 타시도 u-시티 현황분석서.xls)   

가. 영종도 지구 : 공항지원·항공물류·국제관광 
영종도 뉴스 --> http://www.freeeconomiczone.com 
나. 청라 지구 : 국제금융·스포츠·레저를 주기능으로 하는 도시 
다. 송도 신도시: 국제업무와 지식기반사업, 쇼핑, 주거 등이 복합된 도시 
송도 신도시 --> http://www.newsongdocity.co.kr/default.aspx?p=1944 
라. 판교 신도시 --> http://www.pangyonewtown.com 
--------------------------------------------------------------------------------------- 
    
u-City: 물리적인 도시안에서 언제(Anytime), 어디서(AnyWhere)에서 도시의 공간(Space)과 사물(Things),  
사람(People)들간에 정보교환(Communication)할수 있는 IT기반의 기능화된 도시 
---------------------------------------------------------------------------------------  
- 연비 계산 
연비의 계산은 총주행거리를 총주유량으로 나누어서 계산이 되어 집니다. 
연비의 정확한 계산을 위해서는 주행거리와 주유량을 최초입력후 꾸준히 등록 
현재 연비는 10KM 정도 (총 주행거리: 2342KM, 주유량: 234 리터, 연비 10 KM, 유류비: 184,468) 됩니다.   
연비 --> 17.2 km/l  ---> 총주행거리: 95,694km: 2007.06.07 현재 
주행거리 --> 2006년 08월 14일: 80,944 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.05(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 --> 복어 식당(남계장, 박주임, 신부장) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
타시도 u-시티 현황분석서 작성(01. 타시도 u-시티 현황분석서.xls)   
- 대구시 재정 현황 
http://www.daegu.go.kr/budget/Default.aspx?cid=63:25 
==============================================================================================================

- 자료 수집 방법 논의 
남계장, 박주임, 신부장 
1. 체계적으로 리스트 작성해서 보고 
2. 원론적인 것 보다 구체적인 것 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.06(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 --> 현충일 

- U-대구 ISP
- TAMA 가계부 작업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.07(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:20 --> 풋살(2팀) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
2006 u-City 국제컴퍼런스 책 
http://www.ubicity.org 
SPC(Special Purpose Company): 민관합작 특수목적 회사 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.08(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> U-대구 회의(8층 소 회의실) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
2006 u-City 국제컴퍼런스 책 
2. 회의록 정리 
3. 보유 자료 리스트 작성 
==============================================================================================================

- 가창 유료 주차장(시청 근처) 첫날 
T) 425-0606 
==============================================================================================================

- TAMA 가계부 작업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.09(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 

- U-대구 ISP
1. U-시티 참고 자료 분석 
2006 u-City 국제컴퍼런스 책   
2. 보유 자료 리스트 작성 
==============================================================================================================

- TAMA 가계부 작업 
==============================================================================================================

- 원표 모 상  
청송 보건소 가는 길(약 2시간 20분 소요) 
하양 --> 금호 --> 영천 --> 영천 시청 --> 28번 국도를 타고 포항방면으로 가시다 보면 (시청 지나 약 2km 지점)  
--> 조교 삼거리(갑을 주유소가 있는 삼거리): 좌회전 --> 69번 지방도로를 타고 망정공원과 영천호를 지남(약 28km 정도) 
--> 31번 국도와 만나는 삼거리: 우회전 --> 청송 방향 31번 국도 --> 청송 --> 청송 보건소  
------------------------------------------------------------------------------------- 
대구 오는 길(약 2시간 소요)  
청송 보건소 --> 현동 --> 안덕--> 영천 화북 -->  북영천IC 지남 --> 도동IC  
--> 자동차 전용도로 --> 금호 --> 햐앙 --> 대구 
------------------------------------------------------------------------------------- 
대구 <--> 청송길 ===> 강추 
대구 --> 하양 --> 금호 --> 영천 --> 금호삼거리 --> 원제 --> 대전교 --> 오미삼거리 --> 오미네거리 
 화남(북영천IC) --> 화북 --> 청송 안덕 --> 청송 현동 --> 청송 
-------------------------------------------------------------------------------- 
주유(SK청송): 19.493L(1,539원)   ====> 총 주행거리: 95,878km 
==============================================================================================================

조현희(*) 윤성호 회사 여직원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.11(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- U-대구 ISP
1. U-시티 참고 자료 분석 
2006 u-City 국제컴퍼런스 책 
http://www.etnews.co.kr/news/relation_list.html?art_cla1=30&page=1&art_code=200611070015 
==============================================================================================================

- TAMA 가계부 작업 
==============================================================================================================

- X인터넷 외부망 설정 방법 
1.  route 변경  
> route 
> route del default gw 192.168.0.2 ==> 게이트웨이 삭제 
> route add default gw 218,.158.3.254 ==> 게이트웨이 새로 설정 
2. ProxyPort 변경 
> cd /home/conf 
> Proy 
ProxyPort  = "8081"   -->  "80" ==> 변경 
3. Port 변경(hrm.htm에서) 
> cd /home/oz35 
> vi hrm.htm 
download.port = "8081"   -->  "80" ==> 변경 

> cd /home/apache-tomcat_5.5.12 
> ./shutdown.sh 
> ./startup.sh 

> su root 
> password: fire119 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.12(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 18:00 --> 볼링(조현희씨: 107, 169, 149 술값내기 승), 첫대리 운전 

- U-대구 ISP
1. U-시티 참고 자료 분석 
2006 u-City 국제컴퍼런스 책 
http://www.etnews.co.kr/news/relation_list.html?art_cla1=30&page=1&art_code=200611070015 
==============================================================================================================

- 초고속 무선 인터넷(Wibro) 
1. KTF i플러그 
가입비: 30,000원 
W베이직 --> 사용료: 월 29,500원(부가세별도), 무료 DATA량: 약 1GB 상당 
W스페셜 --> 사용료: 월 44,500원(부가세별도), 무료 DATA량: 약 2GB 상당  
http://www.ktmobile.co.kr/index.php?ktssoflag=1 
2. SK T로그인 
가입비: 55,000원 
레귤러 --> 사용료: 월 29,900원(부가세별도), 무료 DATA량: 약 1GB 상당 
프리미엄 --> 사용료: 월 45,000원(부가세별도), 무료 DATA량: 약 2GB 상당  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.13(수) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 대구시 재정정책 토론회, 공간정보 서울 출장(신부장) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
 02. 공간정보 이외 분야별 u-IT839 관련성.xls 작성 
==============================================================================================================

- TAMA 가계부 작업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.14(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 18:30 --> 풋살(백숙), 공간정보 서울 출장(신부장) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
 05. 동구 인프라 수요도출서.xls  
==============================================================================================================

- 휘발유 가격 비교 
http://www.oilnavi.com/index.asp 
==============================================================================================================

- TAMA 가계부 작업 
1. 차계부 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.15(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:50 --> 가창유료 주차(5천원) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
02. 공간정보 이외 분야별 u-IT839 관련성.xls 작성 
- 상세하게 작성 
2. 보유 자료 리스트 작성(03. 보유 자료 리스트.hwp) 
3. 2007 시도 긴급구조 표준시스템 확산 작업 분석 오타 수정 
==============================================================================================================

- 외장 하드 
MG25-Ultra(80G)USB포트내장, 5400RPM/버퍼8MB  --> 가격: 96,960원  ==> 88,000원에 구입 
http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=008001&sc.prdNo=3474980 
MG25-Ultra(80G)USB포트내장, 5400RPM/버퍼8MB  --> 가격: 98,980원 
http://itempage.auction.co.kr/detailview.aspx?itemno=A076270521 
FHD-254UK(80G): 7200rpm --> 가격: 117,000원(회사서 구입한 것) 
http://www.sarotech.com/cgi/pd.cgi?cmd=list&catg_no=52&lgg=shp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.16(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 00:00 --> 철야, 병원(귀치료: 1주일에 한번 먹는 약 수령) 

- 소방표준시스템 제안
1. 2007 시도 긴급구조 표준시스템 확산 작업 수정 
\\gis\wini\1.제안서\1.소방관련\2007_시도_긴급구조_표준시스템_확산\2.제안서\4차작성\ 
Ⅲ.2.가.시스템사양 및 기능(신택균_0615).ppt 
- 1차 회의(추 사장님 주제): 18:00 ~ 19:30   ===> 포항 할배 제사 못 감 
우리 제안서에 신선한 아이템이 없음(LG CNS 제안서 비교) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.17(일) 작업 ■■■■■■■■■■■■■■■■
---> 00:00 ~ 20:30 

- 소방표준시스템 제안
1. 2007 시도 긴급구조 표준시스템 확산 작업 수정  
- 1차 회의(백두현 팀장 주제): 12:00 ~ 02:30 
중간 검토 작업, 마무리 작업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.18(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- U-대구 ISP
1. U-시티 참고 자료 분석 
02. 공간정보 이외 분야별 u-IT839 관련성.xls 작성 
- 상세하게 작성 
==============================================================================================================

- 월간보고회 관련 회의(남계장, 박주임, 신부장) 
1. 심포지엄 개최 
가. 부스 설치 
나. 주제가 너무 애매 모호함 
다. 포럼 창립(경북대 서대하 교수에게 자문) 
라. 홍보 계획 수립 
(이동식 빔 구매 다시 요청) 
==============================================================================================================

- 틀고정 설정 ==> 엑셀(Excel)에서
창(W) --> 틀고정(F) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.19(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 --> 월간보고회, 회식(맥주집), 노래방(종환 대구 방문) 

- U-대구 ISP
1. U-시티 참고 자료 분석 
02. 공간정보 이외 분야별 u-IT839 관련성.xls 작성 
- 상세하게 작성   
==============================================================================================================

- 월간보고회  
가. 보고서 형식이 문제가 많음(페이지 번호가 없음, 글자가 작음) 
나. 자료수집에 기본적인 틀이 없음 
다. 자료 수집 후 수집한 이유 적을 것(누가,언제,무엇을 어떻게) 
라. 담당업무별로 다시 조사,분석하여 제출할 것  
==============================================================================================================

 - 폴더 공유 에러 ==> MSN에서 
 문제가 지속되면 회원님이나 대화 상대가 시스템 파티션을  NTFS (성능, 보안, 안정성 및 기타 고급 기능을  
 제공하는 파일 시스템입니다.) 로 전환해야 할 수 있습니다.    
 - FAT32 볼륨을 NTFS로 전환하는 방법  
전환 명령(Convert.exe)을 사용하면 기존의 FAT 볼륨이나 FAT32 볼륨을 NTFS로 전환할 수 있습니다 
http://support.microsoft.com/default.aspx?scid=kb;ko-kr;307881 
==============================================================================================================

- 돈 대여 
30만원 송금(이자 만원) 
외환은행: 620-170292-296 예금주: 차호진  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.20(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 --> 버스로 출근 

- U-대구 ISP
1. 06월 월간보고회 자료 수정 
 2. 대구광역시 주요관심 업무 분류서.xls 
 3. 중구 주요관심 업무 분류서.xls 
 4. 동구 주요관심 업무 분류서.xls  
----------------------------------------------- 
수정 주 내용 ===> 글자체: 굴림 12로 설정 
==============================================================================================================

- TAMA 가계부 작업 
차계부 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.21(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 --> 풋살(장맛비) 

- U-대구 ISP
1. 06월 월간보고회 자료 수정 
첨부파일_목차.hwp 
첨부파일_자료목록분류.hwp 
----------------------------------------------- 
1. 신도시_시설물.xls 
06. reader-tag유형.xls 
==============================================================================================================

- TAMA 가계부 작업 
차계부 
-- 차계부 월별 지출내역 정보 조회  @@@@@@@@@@@    
SELECT B.ACCOUNT_CD, '', '', '','', '', '', '','', '', '', '','', ''  
FROM T_HouseK_Book A, T_ACCOUNT B          
WHERE A.HB_LRG_ACCOUNT_CD = B.LRG_ACCOUNT_CD --대분류 계정코드   
AND A.HB_ACCOUNT_CD = B.ACCOUNT_CD --계정코드  
AND  Format(A.HB_DT, "YYYY") = '2007' --년월 
GROUP BY B.ACCOUNT_CD                    
ORDER BY MAX(B.ACCOUNT_NM) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.22(금) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:20 ~ 23:00 --> 월간보고회 2차(박부장, 임부장, 한과장), 가창유료 주차(5천원) 

- U-대구 ISP
1. 06월 월간보고회 자료 수정 
첨부파일_목차.hwp 
첨부파일_자료목록분류.hwp  
 ----------------------------------------------- 
수정 주 내용 ===> 글자체: 굴림 11로 설정  
==============================================================================================================

- TAMA 가계부 작업 
차계부  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.23(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 17:00 --> 격주 휴무 

- U-대구 ISP
1. i3shop 방문(12:00 ~ 17:00) 
- 전산실, 콜센터 
- 재고조사 프로그램 설명(이종필 대리, 차호진) 
==============================================================================================================

- TAMA 가계부 작업 
가계부 고정등록  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.24(일) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 23:00 --> 공휴일 

- U-대구 ISP
- TAMA 가계부 작업 
가계부 고정등록  
==============================================================================================================

- 주행거리 
  A. 동대구 기준 시내 지역              
1. 동대구역 --> 대구시청: 3km 2. 동대구역 --> 대명동 계대: 6.8km      
3. 동대구역 --> 동대구 율하역: 6.5km 4. 동대구역 --> 성서 계대: 19km              
5. 동대구역 --> 경산 자인물류: 23.5km 6. 동대구역 --> 동대구 율하역: 6.5km        
7. 동대구역 --> 성서 계대: 19km 8. 동대구역 --> 신천동로 --> 앞산공원 --> 대구공전:  15.5km      
---------------------------------------------------------------------------------------------------------------     

  B. 대구시청 기준 시내 지역(대구공전)                  
1. 대구시청 --> 공평네거리 --> 봉산육거리 --> 건들바위네거리 --> 남구청네거리 --> 영대네거리 --> 앞산네거리  --> 서부정류장 --> 대구공전: 8.5km     
2. 대구시청 --> 중앙로역 --> 서성네거리 --> 계산오거리 --> 반고개네거리 --> 성당시장 --> 두류공원 --> 서부정류장 --> 대구공전: 8.2km              
3. 대구시청 --> 중앙로역 --> 국채보상로 --> 서구청 --> 신평리네거리 --> 두류네거리 --> 감삼네거리 --> 대구공전: 9.1km         
4. 대구시청 --> 대구역 --> 북비산네거리 --> 서평초교    --> 서부구민운동장 --> 감삼네거리 --> 대구공전: 10.4km      
5. 대구공전 --> 동본리네거리 --> 감삼역 --> 두류네거리 --> 반고개 --> 범어역 --> 동대구역: 12.2 km(25분 소요)  
6. 대구공전 --> 영대네거리 --> 남구청네거리 --> 봉산육거리 --> 신천역 --> 동대구역: : 11.5 km(35분 소요)   
---------------------------------------------------------------------------------------------------------------     

  C. 시외 지역(대구공전)              
1. 동대구역 --> 경주 새한센스빌(동대 근처): 63.8km      
2. 동대구역 --> 포항 북부해수욕장(국도): 92k            
3. 동대구역 --> 포항 북부해수욕장(대구포항고속도로): 83.5km   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.25(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00  

- U-대구 ISP
1. 06월 월간보고회 자료 출력, 바인딩(2부) 
==============================================================================================================

- TAMA 가계부 작업 
독서 기록장(1. 줄거리 2. 느낀점) 
주간, 월간 보고서 추가(회사, 개인) 
==============================================================================================================

# 문제점(위니텍 주간보고서) 
1. 업무보고 작성시 내용이 많아서 A4용지 분량을 넘게되면 뒤에 내용이 짤립니다. 
# 요구사항 
1. 업무보고 검색 후 리스트에서 클릭을 하면 팝업창처럼 업무보고 내용이 나타났으면 좋겠음 - 조웅희 부장님 
2. 업무보고 검색 후 리스트에서 클릭하는 것 외에 "이전", "다음" 과 같은 버튼을 만들어서 버튼을 누르면 리스트 
순서대로 내용이 바뀌었으면 좋겠음 - 백두현 과장님 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.26(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 시청 식당(1/19) 

- U-대구 ISP
1. 06월 월간보고회 자료 출력 준비  
유비쿼터스 사회를 위한 Network구축 방안    

- Tag 
1. 통합된 안테나를 갖추 IC칩 
2. 장비나 사물에 삽입됨(e.g. handsets) 
3. Passive(read only) and actvie(read/write) 형 
4. 무선주파수를 사용한 Reader에 의해 인식 
- Reader 
1. Tag의 정보를 수집/가공 또는 activer tag의 경우 
갱신/저장 
- Host Computer 
1. 다향한 Tag 또는 Reader에서 정보를 수집/정리/처리 
2. 수집/정리/처리된 정보를 네트워크 또는 중양 정보처리 
시스템에 전송 
3. 각 하위장치들을 경제 
==============================================================================================================

- MS Project 설치 
1. MS Office MS Project 2003 Pro kor.ISO 파일 받음(차 호진) 
2. 데몬툴 설치(daemon V 4.08): daemon408-x86.exe  ===> .iso 파일 풀기 위해 
3. MS Office Project2003 설치 
CD-KEY: WFDWY-XQXJF-RHRYG-BG7RQ-BBDHM 
==============================================================================================================

- TAMA 가계부 작업 
자산관리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.27(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:30 --> 족구(대구시 통합전산센타(대구지방환경청) -> 지산동): 박주임: 2패, 신부장: 2승 

- U-대구 ISP
1. 유비쿼터스 사회를 위한 Network구축 방안 
1000수치지도 Layer 분류 
53. 수치지도 버전 1과 버전 2간 layer 매칭표.hwp  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.28(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 풋살, 시청 식당(3/19): 신부장꺼 추가 

- U-대구 ISP
1. 유비쿼터스 사회를 위한 Network구축 방안 
1000수치지도 Layer 분류 
53. 수치지도 버전 1과 버전 2간 layer 매칭표.hwp  
==============================================================================================================

- TAMA 가계부 작업 
자산관리 
- Db.BeginTrans 에러  
If Not Rs Is Nothing Then Set Rs = Nothing 
Set Rs = New ADODB.Recordset  
'AccessDB 호출, 연결  @@@@====@@@@  ==================> 
Call objAccessDB_3 
Rs.CursorLocation = adUseClient 
Db.BeginTrans 'DB 트랜스 연결 
Set Rs2 = New ADODB.Recordset 
==============================================================================================================

- 동대구 --> 진주 고속버스 
일반요금: 7,200원(일반), 10,500원(우등), 11,600원(심야) 
소요시간: 2시간 20분  
거리: 143.5km  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.29(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 가창유료 주차(5천원) 

- U-대구 ISP
1. 유비쿼터스 사회를 위한 Network구축 방안 
RFID 확산전망 및 시사점.pdf 
==============================================================================================================

- 대구시 동구문화체육회관  
http://www.dgculture.or.kr/sports/view.html 
수영 강습: 4만 7천원 
6-1 월,수,금 06:10-07:00 초급 
6-2 화,목,토 06:10-07:00 초급  --> 추천 
 이용시간 안내 
평일 : 05:30 ~ 22:00 
토요일 : 05:30 ~ 18:00 
일요일, 공휴일 : 09:00 ~ 18:00  
접수기간 
기존회원 : 매달 17일 ~ 20일 
신규회원 : 매달 21일 ~ 말일  
==============================================================================================================

- TAMA 가계부 작업 
자산관리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2007.06.30(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00  

- U-대구 ISP
1. 유비쿼터스 사회를 위한 Network구축 방안  
==============================================================================================================

- 구미 유비쿼터스 체험관 
http://www.u-gumi.or.kr/ubiapp 
- 헌혈의 집 
http://www.bloodinfo.net/ 
==============================================================================================================

- TAMA 가계부 작업 
자산관리, 급여관리 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■