

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.03) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.03.01(수) 작업 ■■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:30 --> 삼일절(공휴일)

- 쇼핑몰 수정
컴퓨터 포맷 후 재 설치 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 구분 필드 추가 
- 신규 상품 등록(/BizMgr/ItemMgr/itemNewP.jsp) 
장바구니 구분 필드 추가(A:자사, B:업체) 
- 상품마스타조회(/BizMgr/ItemMgr/itemP.jsp) 
A:자사 선택 ==> 온라인점, 공급/배송가능 거래처(자사배송 체크) 
B:업체 선택 ==> 그외 나머지 업체 
-------------------------------------------- 
T_ITEM_RSV 테이블에 CART_GB 추가 
--------------------------------------------------------------------------------  
- 신규 상품 승인(/BizMgr/ItemMgr/approvalNewItemP.jsp) 
상품코드를 신규발부하고 상품예약 정보를 상품기본정보로 복사한다. 
 --> T_ITEM, T_ITEM_WEB 테이블 생성 
- 상품마스타조회(/BizMgr/ItemMgr/itemP.jsp) 
 --> T_ITEM 수정, 삭제 
==============================================================================================================

- 피존사은품증정 행사 SMSM 전송 --->  피존사은품증정 행사(61) 
최근 3개월 내 MART매장 비식품(980) 구매 회원 중 5,000건 전송(5,119건 전송)  ==> 09:12 ~09:17 (5분 소요)   
SMS 발송 문구:  "인기상품 사은품 증정행사 하나만 구매하셔도 사은품을 드립니다. 3월2일부터 -i3shop-" 
==============================================================================================================

- 정수기 수정 
주문번호 : 19081  
요청내용 : fresh등록일자를 20060228로 수정해 주세요. 
-------------------------------------------------------------------------------- 
정수기 해피콜 완료 처리 시 색상변경 : 파란색 
조건 선택 후 검색 시 제일 마지막줄에 불필요한 한줄 생성 
신품교체 건 검색 후 엑셀 다운로드 불가..  
==============================================================================================================

A. 프린터 설정(i3shop)  @@@@@@@@@ 
1. IT개발팀 공통 프린터 잡기(HP 2420N 프린터 드라이버) 
프린터 추가 --> 프린터 추가 마법사 시작 -->로컬 프린터(L): 플러그 앤 프레인... 체크  제외 
--> 새포트 만들기(C) : Standard TCP/IP Port 
프린터 IP주소: 210.123.133.4 
포트 이름: IP_210.123.133.4  
210.123.133.4 --> IP_210.123.133.4 
--> 제조업체(M): HP  프린터(P): HP Laser 2100 Series PS 선택 
--> 그 외 디폴트로 클릭하고 완료 함 
==============================================================================================================

2. IT개발팀 컬러 프린터 잡기 
\\210.123.133.28(4층 디자이너 Print) --> IT개발팀컬러프린터 더블클릭  --> 자동 설정 됨 
------------------------------------------------------------------- 
\\210.123.133.28(4층 디자이너 Print) administrator/i3shop   ===> HP(deskjet 920C) 
==============================================================================================================

- i3shop 출장 기준 경비(대리급) 
KTX : 22,000 
식대 : 8식*5,000 
숙박 : 3박*40,000 
추가 교통비 : 800원*2*4 
----------------------------- 
대중교통 요금 
고속버스 : 22,100원 
KTX : 34,900원(22,400원 --> 10,500원 절약) 
==============================================================================================================

- 공인인증서 에러 
배종기(회원번호 : 22046): *: i3small1 
'리셀러 어드민'--->'인증서 다운로드'를 하니깐 
"만료된 인증서를 삭제하는데 실패 하였습니다" 라고 나옵니다. 
-------------------------------------------------------------------- 
cn=배종기4,ou=RA센터,ou=아이쓰리샵,ou=등록기관,ou=licensedCA,o=KICA,c=KR 
원인: 이미 유효기간이 만료된 인증서네요. 
처리: USER_DN 지우기 
-- 공인인증 정보 수정 @@@@ 
-- UPDATE T_KICA_REQ 
SET USER_DN = NULL   --사용여부 
WHERE MEM_ID = 'i3small1' 
--;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.03(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
통합 시스템에 장바구니 구분 필드 추가(A:자사, B:업체) 
T_ITEM_RSV,  T_ITEM테이블에 CART_GB 추가 
================================================================================= 

- 신규 상품 등록(/BizMgr/ItemMgr/itemNewP.jsp) 
장바구니 구분 필드 추가(A:자사, B:업체) 
--------------------------------------------------------------------------------  
- 신규 상품 승인(/BizMgr/ItemMgr/approvalNewItemP.jsp) 
--> 일괄승인(/BizMgr/ItemMgr/itemRsvS.jsp)  
상품코드를 신규발부하고 상품예약 정보를 상품기본정보로 복사한다.(T_ITEM, T_ITEM_WEB 테이블 생성) 
- 상품마스타조회(/BizMgr/ItemMgr/itemP.jsp) 
--> 상품마스타 정보(/BizMgr/ItemMgr/itemEditP.jsp)  팝업  
-->상품마스타 정보 수정, 삭제(/BizMgr/ItemMgr/itemS.jsp): T_ITEM 수정, 삭제 
------------------------------------------------------------ 

수정된 EJB: ItemMgrBean.java 
수정된 BEAN: ItemDAO.java, ItemRsvDAO.java 
==============================================================================================================

- 상품마스타조회(/BizMgr/ItemMgr/itemP.jsp) 
A:자사 선택 ==> 온라인점, 공급/배송가능 거래처(자사배송 체크) 
B:업체 선택 ==> 그외 나머지 업체 
----------------------------------------------------------------------------------------

--장바구니구분 수정 @@@@@@@@@@@@ 
-- UPDATE T_ITEM U 
SET U.CART_GB  = 'A' --장바구니구분(A:자사, B:업체)  
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_MERCHANT_ITEM A, T_ITEM B 
WHERE A.COMPANY_CD = B.COMPANY_CD  
AND A.ITEM_CD = B.ITEM_CD 
AND A.COMPANY_CD = U.COMPANY_CD  
AND A.ITEM_CD = U.ITEM_CD 
AND A.COMPANY_CD =  '01'  
AND A.MERCHANT_CD = '0001'  
AND (SELECT ENTR_CL FROM T_ENTERPRISE  
WHERE COMPANY_CD = A.COMPANY_CD  
AND ENTR_NO = A.ENTR_NO) = '01'   --업체구분(01:자사, 10:은행, 11:가드사, 12:PG, 20:협력업체, 25:발주업체, 30:택배사) 
  ) 
--; 
==============================================================================================================

- 킬러앱 수정 
1. 바이어 추천상품 추가 
4개 롤업(가격 추가, 링크 추가) 
2. Best of Best 추가 
인기 상품 2개 메인 상품으로 디스플레이 
3. 카테고리 추가(가전, 식품, 생활/패션/건강, 마트식품, 마트비식품, 화장품) 
==============================================================================================================

- 정수기 수정 
미처리로 원상복구 해야하는 건입니다. 
18032 처리완료일자, 처리내용, 후레쉬등록일자 삭제..색상 흰색 
18291 처리완료일자, 처리내용, 후레쉬등록일자 삭제..색상 흰색 
==============================================================================================================

- [EJB, BEAN 등록 방법]  ==========> 통합(i3shop) 
1. BEAN 등록 방법 
C:\i3shop\Int\BizMgrBean\com\i3shop\dao\BizMgr 
OrderDAO.java OrderDtlDAO.java 파일 수정(복사) 
-- Bean 등록 방법 
eclipse에서 내보내기(/i3shop_BizMgr/common/src) 
: BizMgr.jar하기 위해서는 반드시 common/src 폴더를에 오른쪽 마우스 클릭  
--> jar 파일 --> 내보낼 대상 선택 
 jar 파일(J): D:\orion_int\lib\BizMgr.jar 
--> 완료(F) 
--> BizMgr.jar 생성(복사) 
로컬 PC D:\Project\intLib에 내보냄 
로컬 PC D:\orion_int\lib에 내보냄 
--------------------------------------------------------------------- 
\\211.233.5.108\i3shop\lib 에 BizMgr.jar 파일 덮어 쓰기 
\\211.233.5.108\i3shop\src\bean\BizMgrDAO\com\i3shop\dao\BizMgr 
OrderDAO.java OrderDtlDAO.java 파일 덮어 쓰기 
\\211.233.5.108\websphere\lib\app에 BizMgr.jar 파일 덮어 쓰기 
.108서버 Websphere 종료 후 재시작  
==============================================================================================================

2. EJB 등록 방법 
211.233.5.108 에서 @@@@@@@@@@@  ==> 현재 여기서 ItemMgr.jar 파일을 만든 후 211.233.5.108에 붙여 넣음 
-------------------------------------------------------------- 
1. C:\i3shop\Int\IntEjb\ItemMgr\com\i3shop\ejb\BizMgr\ItemMgrBean.java 수정 
2. \\211.233.5.108\i3shop\src\ejb\ItemMgrEJB 로컬에서 아래 3개 파일을 복사하여 붙여 넣기함 
ItemMgr.java ItemMgrBean.java ItemMgrHome.java 
3. 터미널 서버 연결(Ztem) 
IP: 211.233.5.108 i3shop/dacosystem 
4. 컴파일 하기 
[i3shop@newint i3shop]$  su 
[i3shop@newint i3shop]$  i3shop566414 
[i3shop@newint i3shop]# cd src/ejb/ItemMgr 
[i3shop@newint ItemMgr]$ ./build.sh ItemMgr 
.jar 파일 생성됨(---> \\211.233.5.108\i3shop\component\ejb\ItemMgr.jar 파일로 만들어 짐) 
\\211.233.5.108\websphere\installedApps\i3shop.ear 파일(ItemMgr.jar) 붙여 넣기 
5. .108서버 Websphere 종료 후 재시작 
6. 디버깅 --> 터미널 서버 연결(Ztem) 
[i3shop@newint i3shop i3shop]$  cd /opt/WebSphere/AppServer/logs 
[i3shop@newint i3shop logs]$ tail -f Default_Server_stdout.log 
==============================================================================================================

Auto-deploying BuyingMgr (Class 'com.i3shop.ejb.BizMgr.BuyingMgr' had been updated)...  
BuyingMgr_StatelessSessionBeanWrapper6.java:7: BuyingMgr_StatelessSessionBeanWrapper6  
should be declared abstract; it does not define getEntrItemList(java.util.Hashtable) in BuyingMgr_StatelessSessionBeanWrapper6 
public class BuyingMgr_StatelessSessionBeanWrapper6 extends  
com.evermind.server.ejb.StatelessSessionEJBObject implements com.i3shop.ejb.BizMgr.BuyingMgr 
       ^ 
BuyingMgr_StatelessSessionBeanWrapper6.java:57: cannot access com.daco.util.BizMgrBase 
file com\daco\util\BizMgrBase.class not found 
response = object.getRecomPoItemList(argument0, argument1, argument2); 
                 ^ 
2 errors 
----> D:\orion_int\lib/BizMgr.jar를 잘못 내보내기 했기 때문(다시 내보내기 함) 
==============================================================================================================

[위치 :InitApp.lookup()] [시각 : 20060303225313] 
[메세지] 
JNDI 등록 객체호출을 실패했습니다. 
javax.naming.NameNotFoundException: BizMgr/ReportMgr not found in BizMgrApp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:30 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
p_cart_gb //장바구니 구분(A타입:자사, B타입:업체) 
public Hashtable getItemDetail(Hashtable inputHash) throws Err { //DisplaySvcBean.java에서 
A.CART_GB,  
} 
<input type="text" name="p_cart_gb" value="<%=util.getData("CART_GB",itemDetailHash)%>"> <%--장바구니 구분--%> 
--------------------------------------------------------------------------------------------------------------------------- 

- 배송비 셋팅 
check_sts: 배송비상태(0:배송비없음, 1:주문거부, 2:배송비부과, 3:셋팅오류) 
ship_price: 배송비 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송) 
SHIPFEE_POLICY_CL: 배송비정책구분코드(01:자사배송(마트배송,R&F), 02;업체배송) 

public void setShipStsAndPrice(String check_sts, int ship_price) throws Err { 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.06(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00 

- 쇼핑몰 수정
- 킬러앱 수정 
1. 실서버 적용 
==============================================================================================================

- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
p_cart_gb //장바구니 구분(A타입:자사, B타입:업체) 
public Hashtable getItemDetail(Hashtable inputHash) throws Err { //DisplaySvcBean.java에서 
A.CART_GB,  
} 
<input type="text" name="p_cart_gb" value="<%=util.getData("CART_GB",itemDetailHash)%>"> <%--장바구니 구분--%> 
------------------------------------------------------------------------------------------------ 

- 배송비 셋팅 
check_sts: 배송비상태(0:배송비없음, 1:주문거부, 2:배송비부과, 3:셋팅오류) 
ship_price: 배송비 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송) 
SHIPFEE_POLICY_CL: 배송비정책구분코드(01:자사배송(마트배송,R&F), 02;업체배송) 

public void setShipStsAndPrice(String check_sts, int ship_price) throws Err { 
} 
==============================================================================================================

- 신용카드 에러 
카드번호 :9410321015567626  비씨카드 주문자 : 신정숙(sj53)  
----------------------------------------------------------- 
거래번호:122522009781 주문번호:200602270005963 신정숙 
KSNET L&B:2002100298/32871   --> C2C 매장에서 구매 
==============================================================================================================

김금란     enurii301       Management-M   *전-> 이선규/sun-q1/Silver-M 
공인인증서 \2200원 다운받는중에 8373 카드사 전화요망! 이라고 오류멘트 뜬다심. 
* 카드번호: 5404-8664-4633-1006  LG카드 (카드 소유자 - 김금란) 
---> 카드사에 직접 문의 바람 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.07(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00 

- 델파이 교육]
 -  1장. Delphi Overview 
 -  2장. Object Pascal and Delphi 
==============================================================================================================

- 폴더 삭제 후 폼 재 등록 문제 
pHankJeom.dsk 에서 새로운 경로로 바꾸어 줘야 함 
[Modules] 
Module0=C:\TAMA_data\TAMA\06. 학점 계산\uHankJeom.pas 
Module1=C:\TAMA_data\TAMA\06. 학점 계산\pHankJeom.dpr 
==============================================================================================================

- 델파이 커뮤니티 사이트  
1. 델파이코리아 (http://sobakcc.com/bbs)  
2. 한국델파이개발자모임 (http://www.delphi.co.kr) 
3. 볼랜드포럼 (http://www.borlandforum.com)  
4. 델마당 (http://www.delmadang.com)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 20:30 

- [델파이 교육]
 -  3장. Delphi OOP  
 -  4장. Windows Programming
- ActiveX Form기초부터 배포까지  
http://www.delmadang.com/cwb-bin/CrazyWWWBoard.exe?db=dmdlec3&mode=read&num=1921&page=2&backdepth=1 
- ActiveX Form 을 이용한 간단한 Hello world 출력 
 http://www.delmadang.com/cwb-bin/CrazyWWWBoard.exe?db=dmdlec3&mode=read&num=2648&page=1&backdepth=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 18:50 

- [델파이 교육]
-  4장. Windows Programming 
TMainMenu, TImageList 
C:\Program Files\Common Files\Borland Shared\Images\GlyFX 
All (*.txt;*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmf)*.txt*.jpg;*.jpeg;*.bmp;*.ico;*.emf;*.wmfJPEG Image File (*.jpg)*.jp 
JPEG Image File (*.jpeg)*.jpegBitmaps (*.bmp)*.bmpIcons (*.ico)*.icoEnhanced Metafiles (*.emf)*.emfMetafiles (*.wmf)*.wmf 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00 

- [델파이 교육]
-  5장. Database Programming 
SELECT *  FROM CUSTOMER  
------------------------------------------------------------------------- 

SELECT *  FROM Test_bupum  
WHERE BUPUM = 99001 
--WHERE NAME ='베어링'  
------------------------------------------------------------------------- 

델5에 RxLibrary, FlatStyle 필요합니다... 
델파이 6.0 이고,Win200 Server 입니다. 
flatstyle을 다운 받았는데..어떻게 install하는지요... 
델파이에서 오픈을 열어서 FlatStyle_D6.dpk 찾아서 인스톨 하시면 됩니다. 
------------------------------------------------------------------------- 

- 컴포넌트 설치방법 
component -> Install component에서 하시면 됩니다. 
거기서는 pas파일만 선택하시면 됩니다. 
------------------------------------------------------------------------- 

일정관리 설치 프로그램과 소스입니다  
http://www.delmadang.com/cwb-bin/CrazyWWWBoard.exe?db=dmdres3&mode=read&num=3650&page=1&backdepth=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.11(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00 --> 격주 휴무 

- [델파이 교육]
- Active-X 입문  
http://www.delmadang.com/cgi-bin/comment.exe?mode=list&db=dmdlec3&number=3508 
http://www.codeway.co.kr/lecture/lectureView.html?CID=Active-X&LID=Part-01  
http://www.codeway.co.kr/lecture/lectureView.html?CID=Active-X&LID=Part-02  
http://www.codeway.co.kr/lecture/lectureView.html?CID=Active-X&LID=Part-03  
==============================================================================================================

- 류님의 CodeWay 온라인 강좌 네이버 카페 
http://cafe.naver.com/codeway.cafe 
http://blog.naver.com/lhs0806?Redirect=Log&logNo=60022026978  
==============================================================================================================

[강좌] 웹브라우져에 삽입된 ActiveX 콘트롤에서 웹브라우져 제어하기..  
http://www.delmadang.com/cwb-bin/CrazyWWWBoard.exe?db=dmdlec3&mode=read&num=1819&page=2&backdepth=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.13(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 결제 에러 
ID: 560508  
0100012006030700805 
샤프 전자사전 리얼딕 RD-6700+사은품 
--> 결제 당시 시스템 불안정으로 주문상세(T_ORDER_DTL)가 2번 생성 되었는 것으로 추정됨 
==============================================================================================================

- 주문 수정 
0100012006030601902 주문취소 --> 주문접수로 수정 
==============================================================================================================

- 정수기 수정 
0100012003101001201/19348/이선욱 
민원유형을  산소발생기소음-> 기타로 수정을 했으면 합니다. 
------------------------------------------------------------------------------------- 
0100012003101001038 
0100012003111002296 <-- 이건은 2건다 무상으로 바꿔주세요~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 신학기 전집 Festival 행사 SMS 전송(3/14) 
최근 3개월 내 Mart매장 최다고객 중 2,500건 전송 --> 신학기 전집 Festival(62) 
SMS 발송 문구: "[i3shop 공지]06년 신학기 전집Festival 구매하시는 모든 분들께 사은품을 드립니다." 
==============================================================================================================

- 공인인증 테스트(테스트로 사용 후 카드 취소) 
jjho41(조정호) 
거래일: 20060306 거래번호:122592043398 카드번호: 9410004760649621(태만 카드) 
==============================================================================================================

- ActiveX DAX 에러 해결방법 
delphi.co.kr에 자료실에 올린 파일(d7_activex_fix.zip)을 받아서 압축을 풀고 
d7_activex_fix폴더에서 D7VCL.bpg 파일을 델파이에서 엽니다. 
메뉴에서 Project - Build All Project를 눌러서 전체 프로젝트를 컴파일 합니다. 
압축을 푼 디렉토리에서 Packing  디렉토리에 보면 lib, Source 디렉토리가 보입니다. 
이 2개 디렉토리를 전체를 선택해서 복사한후 델파이7 설치 디렉토리에 붙여 넣습니다. 
(일반적으로 C:\Program File\Boralnd\Delphi7) 이런 후 다시 엑티브 엑스를 컴파일하시면 됩니다. 
==============================================================================================================

- Deployment 메뉴가 안보일 때 
델파이 7.0 에서 ActiveX 개발시에 Web Deployment 메뉴가 disable 되는 버그가 있습니다. 
대부분 처음엔 되는데 저장한 후에 다시 부르면 되지 않죠.. 
볼랜드 사이트 가서 패치를 찾아봐도 없습니다. 
온갖 사이트와 뉴스그룹을 다 뒤져서 알아냈습니다 ㅡㅡ;; 
유용하게 쓰세요. 
1. 일단 기존에 저장했던 AcitveX 프로젝트를 오픈합니다. 
2. File -> New -> Other -> ActiveX 에서 ActiveForm 을 선택해서 'OK' 버튼을 누릅니다. 
3. 새로 생성된 ActiveX 폼을 닫습니다. ( 저장하지 말구요 ) 
4. 메뉴를 확인해보면 다시 Enable 되어 있습니다 ㅡㅡ; 
==============================================================================================================

- 여수시 고소동 246번지 이상은(HP: *) 
[국민은행]640-21-0052-309 예금주: 진태만 입니다. 32,000원 입니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.15(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 

- 쇼핑몰 수정
- 킬러앱매장 매출활성화 SMS 전송(3/15) 
최근 3개월 내 Mart매장 구매 리셀러 중 5,000건 전송 --> 킬러앱매장 이벤트(63) 
SMS 발송 문구: "(i3shop)비바화장지24롤-5,900원 킬러앱매장이 파격적인 가격으로 승부합니다." 
==============================================================================================================

- SMS 전송 수신 거부자 LIST 
doo7770: * 
==============================================================================================================

- 오즈 출력 에러 
MS05-038(Q896727) 적용 후 포시에스에서 개발한 Object Viewer 부분이 정상적으로 표시되지 않음을  
마이크로소프트에서 확인하였습니다.그 정확한 원인 및 내용은 현재 분석 중입니다. 원인이 확인되고  
해결 책이 확인되는 대로 바로 연락 드리도록 하겠습니다. 현재 MS05-038과 어떤 부분으로 인해 발생한  
문제인지 본사와 함께 확인 중입니다. 빠른 시일 내로 확인되는 대로 바로 업데이트 해 드리도록 하겠습니다.  
아래는 각 OS별 업데이트 삭제 방법입니다. 
  
[윈 NT계열] 
C:\WINNT\$NtUninstallKB896727$\spuninst\spuninst.exe파일을 실행하여 업데이트 삭제하고 컴퓨터를 재시작하시면 됩니다. 

$NtUninstallKB896727폴더가 보이지 않을때는 윈도우 탐색기 메뉴의 도구->폴더옵션->보기->숨김파일 및 폴더 
에서 숨김파일 및 폴더 표시를 선택하시면 보이게 됩니다.  

정상적으로 삭제가 되었는지 확인하기 위해서는 실행창에서 regedit라고 치면 레지스터리 편집기로 갑니다.  
(SP2)HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Updates\Windows XP\SP3\KB896727이 없으면 제대로 삭제가 된것입니다. 
(SP1)HKEY_LOCAL_MACHINE\SOFTWARE\Microsoft\Updates\Internet Explorer 6\KB896727이 없으면 제대로 삭제가 된 것입니다. 
-------------------------------------------------------------------------------------------------- 

참고: MS업데이트와 상관없이 XP에서 새로 오즈 뷰어를 사용하시는 경우는 ms jvm이 설치되지 않아서 그런 경우가 있습니다. 아래와 같이 진단합니다. 
실행>cmd 
도스 커맨드 창에서 jview라고 치면 
D:\Documents and Settings\kgs>jview 
Microsoft (R) Command-line Loader for Java Version 5.00.3810 
Copyright (C) Microsoft Corp 1996-2000. All rights reserved. 
출저:  http://211.116.251.20/pr/news_view.jsp 
==============================================================================================================
  
- 오즈 출력 에러(2번째 처리) 
문제의 최초원인은 Windows XP Internet Explorer용 누적 보안 업데이트(KB896727)번 때문에,  
오즈 애플릿 뷰어가 실행이 안되는 문제가 있었습니다.(8월15일경) 
이후 MS사와 협의하에, 아래의 업데이트 버전을 내놓았습니다. 

패치 사항을 요약하면, 
1. 윈도우 최신 업데이트를 설치하셔야 합니다. 
( Windows XP Internet Explorer용 누적 보안 업데이트(KB896688)) 
2. 첨부하는 zip파일에서 98용,xp용 reg파일이 있습니다. Os에 따라 더블클릭하여 등록하시면 됩니다. --> 사용 
3. 재시작(선택) 

Windows 98 인 경우 다음의 URL에서 패치를 받으실 수 있습니다.  --> 사용 안 함 
http://update.microsoft.com/microsoftupdate/ 
해당 패치에 대한 자세한 내용은 아래의 URL에서 보실 수 있습니다.(영문 ㅜㅜ) 
http://www.microsoft.com/technet/security/Bulletin/MS05-052.mspx 
기타 궁금하신 사항은 IT개발팀으로 문의 하시기 바랍니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.16(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 모발 건강 특집전 SMS 전송(3/16, 3/29) 
최근 3개월 내 L&B 화장품 구매 회원 중 5,000건 전송  --> 모발 건강 특집전(64)  ==> 11:47 ~53(6분 소요) 
SMS 발송 문구: "(i3shop)댕기머리 특집전- 최대 50%할인과 사은품 증정" 
==============================================================================================================

http://test.mart.cc/inquiry/orderMasterP.jsp?p_page=1&p_order_dt=20060104&p_order_no=00444 
==============================================================================================================

- 공인인증서(명의변경 수정) 
양도인: 정경문(6030/*)   양수인: 석영주(6030/*)    
공인인증서 개인정보 ===> 석영주로 변경  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 개발 
주문배송 조회(/inquiry/TEST/orderListP.jsp) 
==============================================================================================================

- 대구도시가스 점검
==============================================================================================================

- 결제 에러 
ID: 560508  
0100012006030700805 
샤프 전자사전 리얼딕 RD-6700+사은품 
--> 결제 당시 시스템 불안정으로 주문상세(T_ORDER_DTL)가 2번 생성 되었는 것으로 추정됨 
공제금액, PV 잡힘 --> 주문금액: 184,000원 --> 합계금액이 368,000원로 되어 있음 
배송은 하나만 나감 
---------------------------------------------------------------------------------------

- 처리 방안 
1. PV  368,000원 --> 184,000원로 수정 
2. 주문상세 정보(T_ORDER_DTL): 0100012006030700805  하나 삭제(SEQ_NO: 2) 
3. 출고상세 정보(T_STOREOUT_DTL): 0100012006030700805  하나 삭제(SEQ_NO: 2)  
4. 매입장 2006월 03월 07일자 다시 돌리기 
==============================================================================================================

송민성      nodazi6     * 
==============================================================================================================

- 정수기 수정 
0100012004011500646 18166  접수취소 --> F이관완료 
FRESH_REG_DT AS F등록일자 null 처리 
--------------------------------------------------------- 
0100012004081800315 9903 설치완료 --> F미이관 
FRESH_REG_DT AS F등록일자 null 처리 
==============================================================================================================

- 수불장 수정 
52in 정수기(00137113) 기준 
20031129: 입고: 120개  재고수량: 120개 재고금액: 60138480 
20050510: 입고: 0개  재고수량: 50 재고금액: -89662004 
20050511: 입고반품수량: -50  입고반품수량: 0개 재고금액: -116162004 
20050511 -50 26,500,000 -530,000 
20050511 50 -25,057,700 501,154 
입고금액(501,154)과 입고반품원가(-530,000)가 틀려서 가격이 -가 남 
==============================================================================================================

- 유동 골뱅이(구슬) 400g(00159167) 
 SUBUL_DATE = '20060315'   --수불일자 
 입고반품수량: -1 개 존재 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 01:00 

- 쇼핑몰 수정
- 세금계산서 개발 
주문배송 조회(/inquiry/TEST/orderListP.jsp) 
과세 - 세금계산서, 비과세 - 계산서 
==============================================================================================================

- 악성코드 발견 
익스플로러 실행할때 마다 MapviewofFile 에러가 뜨는데 왜 그런지 해결책은 무엇인지 궁금합니다. 
해결책:  
1. 시작 메뉴에서 이상한 파일 삭제 
2. 프로그램추가/제거에 가서 이상하고 사용잘 안하고 필요없다고 생각되는 것을 지웁니다 
시작 - 실행 - regedit 입력 
HKEY_LOCAL_MACHINE - Software - Microsoft - Windows - CurrentVersion - Uninstall  
로 가셔서 프로그램 추가/삭제에 남아 있는 목록을 삭제해줍니다 
==============================================================================================================

- 정수기 수정 
0100012003110800834 <-- 이쪽으로 이전 부탁드립니다~  
주문자 미확인접수 -> 이혜영 
==============================================================================================================

- 서버 이상(7~8시간 중지됨) 
원인: 3개월 반품 관련 해서 DB 쿼리를 잘못 짜서 속도가 늘려짐(이종필 대리) 
해결: DB 업체인 PNS 이사와 오셔서 DB를 통해서 문제 쿼리를 뽑아 냄 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.21(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 개발 
주문배송 조회(/inquiry/TEST/orderListP.jsp) 
과세 - 세금계산서, 비과세 - 계산서 
세금계산서 전체 체크 
==============================================================================================================

- 우편번호상의 주소 문의 
%%   오계술   ogs53   Active-Master   
주문하는데 아래 주소가 등록 되어있지 않다고 문의 
[445-972] 경기 화성시 태안읍 진안리   --> 병점동으로 변경 
http://service.epost.go.kr/zipcode/search/search1.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 

- 쇼핑몰 수정
- 세금계산서 개발 
주문배송 조회(/inquiry/TEST/orderListP.jsp) 
과세 - 세금계산서, 비과세 - 계산서 
세금계산서 전체 체크 
==============================================================================================================

- 정수기 수정 
0100012004072800423/김정순 
주문번호 19401 
민원유형;산소발생기소음-> 기타 수정부탁드립니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.23(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 개발 
주문배송 조회(/inquiry/TEST/orderListP.jsp) 

1. 테이블 생성 
T_TAX_BILL: 세금계산서 정보 
T_TAX_BILL_DTL: 세금계산서 상세 정보   
T_TAX_BIZNO_INFO: 세금용 사업자 정보 
-------------------------------------------------------------------------------------------------------- 

- 세금계산서  Sequence 넘버 생성(sequence) 
-- DROP SEQUENCE IIISHOP.T_TAX_BILL_SEQ; 
CREATE SEQUENCE IIISHOP.T_TAX_BILL_SEQ 
  START WITH 10001 
  MAXVALUE 999999999999999999999999999 
  MINVALUE 0 
  NOCYCLE 
  NOCACHE 
  NOORDER; 

SELECT T_TAX_BILL_SEQ.nextval FROM DUAL;  
==============================================================================================================

- 실적평가시트(2006년) 완성, 제출 
==============================================================================================================

- 신용카드 오류 
이정란       lrn6873        Member 
* 카드번호: 9410-0048-5591-7404  외환카드  
\890,000원정도를 결제할려고 하는데 결제시에 안심클릭창이 뜨면은 암호 입력하고, 이후 공인인증서 창이 뜨게  
되면은 다시 암호 입력을 했다심. 보통은 그렇게 되면은 결제가 되는데, 결제가 안되고 또 안심클릭 창이 뜨면서  
계속 그 화면이 반복된다고 하심.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.24(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:30 

- 쇼핑몰 수정
- 세금계산서 개발 
- 주문배송 조회 수정(/inquiry/orderListP.jsp) 
- 세금계산서 신청 화면 완성(/inquiry/taxCheckReqP.jsp) 
- 세금계산서 발행 화면 완성(/inquiry/taxBillListP.jsp) 
==============================================================================================================

- 신용카드  오류 
작성일 : 2006-03-24 오전 11:09:30 
이옥출 (ID : 410613) (회원번호: 741695) LG카드 
연락처: * (정화락 RM) 
30만원 이상 결제시 "타 기관의 인증서"라고 나온다고 합니다.  
(한국정보 인증 사이트에서 '기존 인증서 다시 받기' 작업을 완료 하여도 같은 메세지 출력 됩니다)  
--> 안심클릭 패스워드 재설정 
타기관 구인증서 입니다. 신규발급후 사용하셔야 합니다. 
------------------------------------------------------------------------------------------------------------------------------ 
강구봉  bong3734  Member     
* 롯데카드 결제시 오류메세지 확인된다고 하심! 
* 카드번호 : 4670 0717 9402 7005 
* 오류내용 : 기타오류  서명검증시 안심클릭인증에 실패했습니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.27(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 

- 쇼핑몰 수정
- 세금계산서 발행 화면 수정(/inquiry/taxBillListP.jsp) 
==============================================================================================================

- SMS 전송 수정 
화공과 축구부 부고 91학번 장규웅 포항 세명기독병원 27일(월)조문예정 카페 참조  
http://www.phgidok.com/Infocom/?navi=OUTLINEMAP 
   
-- 4. 기타2 정보 저장 ----> 기타2 
INSERT INTO T_SMS_SEND_PREV 
  (SEQ_NO, SMS_GB, MNO, MEM_ID,  MEM_NM,  
   HPHONE, SMS_CAUSE_DT, REG_ID, GRADE_CD, ORDER_NO_FULL,  
   REG_IP,  REG_DT) 
SELECT  T_SMS_SEND_PREV_SEQ.nextval AS SEQ_NO, '99' AS SMS_GB, MNO, MEM_ID, MEM_NM, 
  HPHONE, SMS_CAUSE_DT, 'tamario' AS REG_ID, '' AS GRADE_CD, ORDER_NO_FULL, 
REG_IP, REG_DT  
FROM ( 
  SELECT  '99' AS SMS_GB, 12 AS MNO, 'tama' AS MEM_ID,  
'88_전희권' AS MEM_NM, 
  '0175362323' AS HPHONE,  
   '20060327' AS SMS_CAUSE_DT, 'tamario' AS REG_ID, '' AS GRADE_CD, '' ORDER_NO_FULL, 
           '210.123.133.31' AS REG_IP, sysdate AS REG_DT    
  FROM DUAL 
) DUAL 
--; 
==============================================================================================================

KMODE_EXCEPTION_NOT_HANDLED  
에러코드(0x0000001e) -- 액세스 위반 
메모리 주소 -- 0x80462147   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.28(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 

- 쇼핑몰 수정
- 세금계산서 수정 
세금계산서 출력(taxBill.xml): OZ 리포트 

global string supply_amt;   //공급가액 
global int supply_seat_cnt;   //공급가액 자리수 

::supply_amt = #OZParam.p_supply_amt#;  //공급가액 
::supply_seat_cnt = #OZParam.p_supply_seat_cnt#;  //공급가액 자리수 
--------------------------------------------------------------------------------------------------------------- 

string supply_amt_1 ;  //공급가액 
int supply_seat_cnt_1  ; //공급가액 자리수 

supply_seat_cnt_1 = (int)::supply_seat_cnt -1; //공급가액 자리수(일의 자리) 

supply_amt_1 = (string)substr((string)::supply_amt,supply_seat_cnt_1 ,1);  //공급가액(일의 자리) 
setattr("caption",supply_amt_1);  
==============================================================================================================

- 모발 건강 특집전 SMS 전송(3/28)   ---> 11시 14시 2번에 나누어서 전송 
최근 3개월 내 L&B 화장품 구매 회원 중 4,444건 전송  --> 모발 건강 특집전(64)  ==> 11:00 ~03(6분 소요) 
SMS 발송 문구: "(i3shop)댕기머리 특집전- 최대 50%할인과 사은품 증정" 
==============================================================================================================

- 신용카드 에러 
이인숙      pyeongg3    Active-Master 
LG카드결제를 하는데 미등록 가맹점이라고 뜨고 결제가 안된다하세요... 확인부탁드립니다. 
LG카드  4386-7617-9701-6006 sky1206 
---------------------------------------------------------------------------------------------------------------
저희 쇼핑몰에서 LG카드 정상 결제 되거든요.. 
이런 경우에는 카드 신용도가 문제가 있어서 "미등록 가맹점"로 나오는 경우가 있어요.. 
카드 사용자가 직접 카드사에 문의 해야 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.30(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 세금계산서 수정 
세금계산서 출력(taxBill.xml): OZ 리포트 

string supply_amt_1 ;  // 공급가액 
int supply_seat_cnt  ; // 공급가액 자리수 

supply_seat_cnt = (int)::supply_seat_cnt ; //공급가액 자리수 
if(supply_seat_cnt >=7) {   // 공급가액이 백만 이상이면 
	supply_amt_1 = (string)substr((string)::supply_amt, (int)::supply_seat_cnt -7,1);   //공급가액(백만의 자리) 
} else { 
 supply_amt_1 = ""; 
}  
setattr("caption",supply_amt_1); 
---------------------------------------------------------------------------------------------------------------

if(#OZParam.p_request_way# == "01"){ //신청방식이 주민번호 이면 
 setattr("caption",""); 
} else{ 
 setattr("caption",#BIZNO_INFO.ENTR_NM#); //상호 
} 
==============================================================================================================

김주현  kim681   Active-Master 
신한카드 사용 : 안심클릭등록된 상태락로함.  
* 카드번호 -  4518420082838076 
주문서작서하고 안심클릭 비밀번호까지 다 등록을 한 마지막에  
에러코드 : AIE 에러메세지 : 주문일시에 에러입니다. 관리자에게 문의하세요.라고확인된다고함. 
확인후 연락드리기로함.    * / 김주현 
---------------------------------------------------------------------------- 
Dr.OK 치약-150g*4개입 -> 5개 // Dr.Clean 칫솔 4개입  -> 4개  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.03.31(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 수정 
세금계산서 출력(taxBill.xml): OZ 리포트  
==============================================================================================================

오라클에서 LPAD(column  expression, n, 'string')이라는 함수는 있습니다.  
예를 들자면, 
LPAD('MILLER', 10, '*') --> ****MILLER 
이렇게 10자리만큼 부족한 자리수를 왼쪽을 채워주는 함수가 있는데,, 
SELECT LPAD('1', 4, '0') FROM DUAL; 
------------------------------------------------------------------------------------------------------------------------ 

SELECT MAX(TAX_SEQ), MAX(TAX_MONTH),  NVL(MAX(TAX_SEQ), 0) AS TAX_SEQ_NO_1, 
LPAD(NVL(MAX(TAX_SEQ), 0)+1, 4, '0') AS TAX_SEQ_NO 
FROM T_TAX_SEQ_NO 
WHERE TAX_MONTH = (SELECT TO_CHAR(SYSDATE,'YYYYMM') TAX_MONTH FROM DUAL) 
==============================================================================================================

- OZ출력 에러(.xml 파일이 없을 때) 
 서버에 요청한 리포트 폼을 가져 올 수 없습니다. 

<<Server side message>> 
Error Message : [Error Code : 41201] Fail to read a report form. 
Error code : 41201 
------------------------------------------------------------------------------------------------------------------------ 

- 오즈 에러(실서버 연결 실패) 
서버에 요청한 데이타 모듈을 가져 올 수 없습니다. 
<<Server side message>> 
Error Message : [Error Code : 12503] Error on Data-Module-Binding. 
Error code : 12503 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■