

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.09.01(금) 작업 ■■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 인증 및 세션 관리 수정 
주문상세보기(/com/itemDetailInfoP.jsp) 
http://test.mart.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010103&p_item_cd=00152565&p_display_cd=01 
==============================================================================================================

- Oracle DB 설치 후 경로 
cd $ORACLE_BASE/admin/<SID>/pfile 
==============================================================================================================

- 통장 정리 
국민은행 계좌번호: 617401-04-092699(나눔, 포항계 전용)  
현재 총잔액 : 414,000원 (포항계 회비)  
농협 계좌번호: 177250-51-006346(포항계 전용)  
현재 총잔액 : 290,000원 (포항계 회비) 
==============================================================================================================

- 정강이보호대(싱가드) 
나이키정강이보호대 SP0040 나이키 정품 J가드 축구용아대 축구보호대세트 
http://www.mple.com/prd/prdbiz/prddetail/PrdDetailAction.do?method=prdDetail&noPrd=1001539829 
==============================================================================================================

- 아디다스 정강이보호대 문의 
sportglove 02-456-2077 (서병욱 대리) 
http://sense.shop-guide.co.kr/sense/reward_shop.php?affiliate_id=hani&member_id=62175973&type=on&url=http%3A%2F%2
Fwww.interpark.com%2Fproduct%2FPreViewDisplay.do%3F_method%3Ddetail%26_style%3Dimfs%26viewTp%3Dpreview%26%
26sc.shopNo%3D0000100000%26sc.dispNo%3D003003006001004%26sc.prdNo%3D3475946 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.02(토) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:30 

- 쇼핑몰 수정
- 인증 및 세션 관리 수정 
주문상세보기(/com/itemDetailInfoP.jsp) 
http://test.mart.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010103&p_item_cd=00152565&p_display_cd=01 
==============================================================================================================

- 리셀러등록 인증 오류 
신혜씨가 처리(15:00 ~ 17:00) 
http://www.i3shop.co.kr/accauth/accauth.jsp 
==============================================================================================================

- 주소찾기 에러 
원인: 도서산간 우편번호에 - 를 넣어서 에러(535-882) 
조치: replace() 함수 사용 - 제거 
전남 신안군 비금면 신원리 
주소찾기(http://test.mart.cc/etc/findPostfP_addShipPrice.jsp) 
==============================================================================================================

- 성서 첼시구장(풋살) 
위치: 달서구 파호동 (성서 계명대 정문 건너편) 
규모: 전용경기장 2면, 유아용 경기장 1면 
사용관련 문의: 차홍태(581-0084) 
사용료: 5만원(낮) --> 밤이면 6만원 
http://cafe.daum.net/dgfutsal  ---> 캐논FC(풋살팀명) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.04(월) 작업 ■■■■■■■■■■■■■■■■
--> 08:30 ~ 23:00 

- 쇼핑몰 수정
- 인증 및 세션 관리 수정 
인증 및 세션 관리 보고서 작성 
==============================================================================================================

- 파워 인터뷰 조정래 작가 편(동영상 시청 가능) 
http://www.kbs.co.kr/1tv/sisa/power/vod/vod/1413087_15267.html 

- 조정래 작가의 신간 [인간 연습] 
http://www.yes24.com/Goods/FTGoodsView.aspx?goodsNo=2119941&CategoryNumber=001001017001001  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.05(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 22:00 

- 쇼핑몰 수정
- 품의안건 개발 
품의안건(/BizMgr/ReportMgr/Consultation/ConsultationP.jsp) 
BIZ_Consultation 
==============================================================================================================

- 정기적금 
1. 신천4 새말금고: 1년 만기 연 5.2% --> 생계형3천만원(완전 비과세), 세금우대 2천만원 
T) 751-3300, 751-3400, 지점 741-1221~2 
2. 농협 동신천지점: 1년 만기 연 4.71% 
------------------------------------------------------------------------------------------------------------------- 
- 계 통장 변경 
나눔, 포항계 전용 통장 동양 CMA 통장으로 단일화 
자동이체는 기존 농협, 국민은행 통장으로 계속 사용 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.06(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:30 

- 쇼핑몰 수정
- 품의안건 개발 
품의안건(/BizMgr/ReportMgr/Consultation/ConsultationP.jsp) --> BIZ_Consultation 
------------------------------------------------------------------------------------------------------------- 

- 품의안건 등록 저장시 SEQ_NO 조회  
INSERT INTO T_CONSULTATION (SEQ_NO) 
VALUES ( 
	(SELECT NVL(MAX(NVL(SEQ_NO,0)),0)+1 FROM T_CONSULTATION)   -- 가장 큰수보다 큰 값 
) 
==============================================================================================================

- 하이 이머니 매장(목록보기) 수정 
/emoney/highEmoneyListP.jsp?p_order_store=mart&p_array_nm=reseller_price&p_array_order=desc  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.07(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:50 ~ 18:40 --> 풋살(일남 차) 

- 쇼핑몰 수정
- 품의안건 개발 
품의안건(/BizMgr/ReportMgr/Consultation/ConsultationP.jsp)  
==============================================================================================================

- 공인인증서  
문종철         gagopn01        
※BC카드번호: 5160-7831-8358-6623  
공인인증서 신청일: 2004년 5월 6일 
공인인증서 결제일: 2005년 8월 31일 
사용기간이 만료된 걸로 추정 됩니다. 
==============================================================================================================

- 대구도시가스 점검
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.08(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 품의안건 개발 
품의안건(/BizMgr/ReportMgr/Consultation/ConsultationP.jsp) 
- 부서정보 조회 수정 
- 안건위치 변경 
- 진행상황 정렬(품의중, 승인, 보류, 취소) 
- 권한 설정(수정, 삭제는 본인과 본인 팀장만 가능) 
==============================================================================================================

- 아킬레스 프로그램 다운로드 URL 
http://www.astalavista.com/?section=directory&cmd=detail&id=2513 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.11(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 8월 세금계산서 월발행(발행일: 20060831,   신청일: 20060831) 
T_TAX_BILL: 15,179, T_TAX_BILL_DTL: 216,739 
--------------------------------------------------------------------------------------------------------------------- 
--발행방식(01:주민번호)  @@@@@@@@ 
1. 주문 발행 
과세: 4,384 비과세: 2,223 
2. 반품 발행 
과세: 374 비과세: 84 
--------------------------------------------------------------------------------------------------------------------- 
--발행방식(02:사업자번호)  @@@@@@@@  
1. 반품 발행 
과세: 1 비과세: 0 
==============================================================================================================

-- 지난 달 조회 @@@@@@@@ 
SELECT TO_CHAR((LAST_DAY(ADD_MONTHS(SYSDATE,-2)) + 1),'YYYYMMDD') AS 지난달_첫날,  
TO_CHAR(LAST_DAY(SYSDATE-30),'YYYYMMDD') AS 지난달_마지막날 
FROM DUAL 
--; 
==============================================================================================================

- 공인인증서 에러 
아이디 : m-young01 
[에러번호3번] 인증서를사용하여 재발급 인가에 실패하였습니다. 콜센타로 연락 주세요  
확인 부탁 드리겠습니다. 
==============================================================================================================

- 동영상 편집 프로그램 
1. 아도비 프리미어 프로 2.0 
2. 소니 베가스 6.0 
3. 아비드 리퀴드 7.0 
--------------------------------------------------------------------------------------------------------------------- 
단순히 용량 줄이는거라면 버츄얼덥을사용해도 되구요 
윈도우 무비메이커도 간단하게 편집(자르기등)기능이 있습니다. 
3가지중에 그래도 쓰기 쉬운것은 소니 베가스가 그나마 쉽습니다. 
--------------------------------------------------------------------------------------------------------------------- 
- Digimax Master(삼성 디카 구입시 무료제공 --> 용량 줄임) 
파일유형(T): Windows Media(wmv) 
Windows Media 프로필 선택(w)  --> LAN용 WMV(1Mbps) 
http://kenoxclub.co.kr/movie_faq/kenox_movie_info.htm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.12(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 --> 삼계탕(일남, 진협): 일남 계산 

- 쇼핑몰 수정
- 8월 세금계산서 월발행 
- SMS 문자 전송 --> 세금계산서발행공지(07)  --> 3,878 건 전송 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 8월 세금계산서가 발행 되어 있습니다.출력가능함"  
--------------------------------------------------------------------------------------------------------------------- 

- 8월 세금계산서 월발행 에러 
최주희    juhee5726    Gold-M 
0100012006070300771  \ 182,500   (K)아름다운 米  20kg()-5 
0100012006072400118  \ 182,500   (K)아름다운 米  20kg()-5 
발행번호 35352990  주민번호 분으로 발행했다가 사업자 분으로 발행할려고  
9/6일 신청취소하고 새로 사업자로 발행 신청 여러차례 했으나 되지 않는다고 문의?  
비과세 제품임을 안내드림.. 면세 계산서 발행 가능함 - 전산 조회결과 따로 신청 내역없음 
고객과 통화중에 세금계산서 사업자분 발행 신청하시고 완료되었다라며 재무회계팀 팩스 접수 팝업창까지 떠서 내역 확 
인해봤으나 면세계산서 요청 자료 조회가 안됨.. 이상이 있는듯함   
--------------------------------------------------------------------------------------------------------------------- 
상호:동강매운탕 
성명:한미라 
사업자번호:122-11-76112 
소재지:인천 부평구 갈산동 381-4 102호 
확인후 전화   * / 02-842-1151  
==============================================================================================================

- 8월 세금계산서 월발행 에러 
35358638 2322/leshop1 
35358659 5372/shop243 
35358661    5576/ddalki1 
35358746    17167/futsal1 
35358770 21754/ejhouse1    --> 35446  
35362835 25148/atssa1 
35358854 27451/baekyun3   
35358942 36374/scuba01         
35363001 148856/hyun-dai01                 
35359153 148856/hyun-dai01   
35359320 227971/mart3601                  
35359340    234246/i3hanjin02 
35360209    682529/moon74       
35360228    684009/gong58 
35362430    774635/koo1952ys  
35362198    772056/khs3094  
35361886    766447/lhj72  
35361709    762251/guccisem    
35361596    759623/451104    
35361446 754791/zipopp 
35361441    754603/kkh70 
35361446 754603/kkh70 
35361439    754471/pentam 
35361336 750527/kjb0425 
35361266 746524/lsh522  
35361187 743516/taebal101  
35361096 740020/lys1824  
35360827 727928/57hae  
35360487 706463/je700  
35360468 705082/full06518  
35358798 22336/satto1 
35361256 745580/yss71  
35361262 746226/pns 
35364823 774635/koo1952ys  
35364621 762251/guccisem  
35362821 22336/satto1  
--------------------------------------------------------------------------------------------------------------------- 
- 반품 주문 
35365147 771225/ss610 
35365167 772263/ohs06 
35365053 762160/jmo70   
35365036 760671/buja6206 
35365030 760478/ljm0111  
35365016 759237/tkwk2120  
35364950 735767/joo1859  
35365250 637108/82jj  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.13(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 8월 세금계산서 월발행 에러 원인 분석 
1. 세금계산서 상세 정보 저장 에러 
INSERT INTO T_TAX_BILL_DTL 시 PUBLIC_NO(발행번호)를 SELECT 잘못 함 
9월 월발행에 6월, 7월 월발행 데이타도 함께 저장  
처리: WHERE절에 USE_YN <> 'Y'(사용여부)를 사용하여 이전 데이타에 영향 안 끼지도록 수정 
2. 세금계산서 발행 총수량과 세금계산서 발행 상세 수량이 틀린 것 체크 
3. 반품 세금계산서 상세 정보 저장 에러 
일부 반품 데이타에서 REAL_QTY(완료수량)이 0 으로 찍힘 
처리: QTY(주문수량)으로 수정하여 처리 
--------------------------------------------------------------------------------------------------------------------- 

--세금계산서 상세 정보 삭제 @@@@@@@@ 
-- DELETE FROM T_TAX_BILL_DTL B 
WHERE B.PUBLIC_NO IS NOT NULL 
--AND B.PUBLIC_NO = '35263'      --발행번호  
AND B.PUBLIC_NO < '35336554'    --발행번호를 월별로 분석하여 작은 값 조회에 적용 
AND TO_CHAR(B.REG_DT,'YYYYMMDD') = '20060911' 
--; 
--------------------------------------------------------------------------------------------------------------------- 
2006/6/30 --> 35336208 ~ 35336553 ====> 발행일: 20060630 
2006/7/31 --> 35344896 ~ 35358382 ====> 발행일: 20060731 
2006/8/31 --> 35358625 ~ 35365312 ====> 발행일: 20060831 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.14(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:50 ~ 18:40 --> 풋살(일남차 왕복) 

- 쇼핑몰 수정
- 인증 및 세션 관리 수정 
인증 및 세션 관리 보고서 작성 
==============================================================================================================

- 공인인증서 이름 변경 
아이디 : iso193 
공인인증 정보의 이름을 '이석민'으로 바꿔 주시면 됩니다. 
==============================================================================================================

- 추석 선물 세트 
선물세트) 해태 종합선물세트 8,400원 *3 25,200원 
백설 진한 참기름 1000ml 9,800원  
35,000원 --> 31,730원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.15(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 20:30 --> 큰누나네집(고속버스) 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
- 메일 보내기(새창)(/webmail/wmail_startwebmail.asp) 
- 사장님에게 메일 보내기(/MainMgr/i3CEOMail/i3CEOMailWriteP.jsp) 
==============================================================================================================

- SMS 문자 전송  
--> 세금계산서발행공지(101)  --> 6,000건 전송 
최근 6개월동안 LnB구매자 상위 6,000명 입니다.   
==============================================================================================================

- 주소 표시줄이 없어졌어요 
시작 => 실행 => REGSVR32 /i BROWSEUI.DLL  => 확인(엔터) 
이렇게 하신다음에  보기 => 도구모음 => 주소표시줄 체크 해제하셨다가 
다시 체크 하시면 주소창이 생깁니다 
==============================================================================================================

- 상품마스타조회 신규 팝업 에러 
에러내용: ShowEditModal()에서 다음 자바스크립트 오류가 발생 
Type Error: 액세스가 거부되었습니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.18(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 18:40 --> 령경이 생일 초대장 완성, IT 술자리(배팀장, 이대리, 정애씨, 박대리) 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
- 메일 보내기(새창)(/webmail/wmail_startwebmail.asp) 
- 사장님에게 메일 보내기(/MainMgr/i3CEOMail/i3CEOMailWriteP.jsp) 
SELECT * FROM T_CEOBOARD   ---> CEO 메시지(메일 아님) 

메일 보내기(102번 메일 서버로 연결) 
<iframe id="editBox" src="http://i3shop.com/webmail/Email_Redirect.asp?userID=test01&gubun=1& 
sender=<%=(String)util.getSesValue("USER_ID",request)%>&p_email=<%=p_email%>"  
frameborder="0" height="500" width="800" marginheight="0" marginwidth="0" scrolling="no"></iframe> 

http://210.123.133.31/MainMgr/Maill/javamail.htm 
==============================================================================================================

-- 개인업무관리 조회(그룹웨이)  --> MS-SQL  @@@@@@@@ 
SELECT B_No, B_Subject AS 업무명, B_start_dt AS 시작일, B_end_dt AS 종료일, 
(CASE WHEN  B_state = '01' THEN '시작안함' WHEN  B_state = '02' THEN '진행중'   WHEN  B_state = '03' THEN '완료' 
WHEN  B_state = '04' THEN '지연' WHEN  B_state = '05' THEN '보류'       WHEN  B_state = '06' THEN '중단' 
WHEN  B_state = '07' THEN '업무이관'  ELSE B_state END)  완료상태,   
(CASE WHEN  B_important = '01' THEN '낮음' WHEN  B_important = '02' THEN '보통'  WHEN  B_important = '03' THEN '높음' 
ELSE B_important END) 중요도 
FROM T_Business_Diary  
WHERE post_CD = 'D302' --부서코드 
   AND Employee_ID = '000245' --직원ID 
   AND ((B_start_dt <= convert(char(10),getdate(),121) AND B_end_dt >= convert(char(10),getdate(),121)) 
    OR (B_Start_DT <= convert(char(10),getdate(),121) AND isnull(B_done_dt,'') = ''))  
   --AND B_end_dt >= convert(char(10),getdate(),121) --시작일 
; 
-------------------------------------------------------------------------------------------------------------------- 

-- 개인업무관리 삭제  @@@@@@@@ 
DELETE FROM T_Business_Diary 
WHERE B_No IN ('6233', '6234') 
; 
==============================================================================================================

- 정수기 수정 
주문번호 20476 산소발생기 소음으로 접수되어 있는데 기타로 변경 
==============================================================================================================

- Layer 크기 줄이기(포토샵) 
Ctrl + T(Edit --> Transform --> Scale) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.19(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:10 ~ 21:30 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
http://210.123.133.31/MainMgr/Maill/javamail.htm 
----------------------------------------------------------------------------------------------------------  
-- 건의사항관리 수정 @@@@@@@@ 
-- UPDATE T_MEMSUGGEST 
SET  UP_DT = SYSDATE, 
DISPLAY_STS = '01', 
SUGGESTKIND_CD = '11', 
ANSWERWAY_CD = '03', 
UP_ID = 'tamario', 
UP_IP = '210.123.133.31' 
WHERE SUGGEST_NO = 54644 
; 
==============================================================================================================

- 세금계산서 에러 
노혜선(nhs01180)  Member 
010001-2006090300260 
원인: T_TAX_BILL_DTL(세금계산서 상세 정보) 데이타 없음 
----------------------------------------------------------------------------------------------------------  
김미애(miae1023miae) 무료회원 
세금계산서 출력안된다고 하심 
* FAX) 02-554-0240 
처리: 네이트온으로 접속해서 처리 못 함(네트웍 불안) --> 팩스로 보냄 
- 팩스 사용법(FAX) 
온훅 버튼 누름 --> 0번 -->  전화번호입력-> 조금 후 삐 소리남 --> 시작 전송버튼 누름 
==============================================================================================================

- 네이트온 원격제어  ===> 윈도우2000도 가능 
http://nateonweb.nate.com/help/guide_demo_pc_v3_028.htm#1 

예) [임모] 더블클릭 --> 새창 뜸(메세지 적기 가능) --> 공유 
대화창을 닫으면 원격제어가 종료 
==============================================================================================================

- 오즈 출력 오류 
- 오즈 레포트 출력 에러(Windows XP용 일 경우) 
1. Windows XP용 JVM 를 다운 받아서 설치 하시고 재부팅 해보세요. 
(http://www.i3shop.com/board/data_view.asp?i_id=169) 
2. 레포트(영수증 출력등) 출력창 오류 시 조치방법(1번을 설치 했는데도 안되면) 
(http://www.i3shop.com/board/data_view.asp?i_id=189) 
 가. appletregistry.zip (621K) 을 내려 받고 appletregistry.zip를 압축을 푼다. 
 나. 압축을 푼 appletregistry 폴더에서 ozappletviewer_xp.reg를 더블 클릭 
 다. 레지스터리 등록 여부를 물으면 "예"를 클릭 
 라. 레지스터리 등록 성공 
 마. 재부팅 후 출력이 가능해짐  
실행(R) --> regedit --> 레지스터리 편집기 
 편집(E) --> 찾기(F) --> applet 또는 MSjava   ====> MSjava가 검색되면 정상 
==============================================================================================================

- JVM 설치 여부 확인 
1. 정상 설치 
C:\Documents and Settings\Administrator> jview 
Microsoft (R) Command-line Loader for Java Version 5.00.3810 
Copyright (C) Microsoft Corp 1996-2000. All rights reserved. 
사용법: JView [옵션] <클래스 이름> [인수] 
옵션:  
클래스 이름: 
    실행할 .CLASS 파일 
인수: 
    클래스 파일에 적용되는 명령줄 인수 
----------------------------------------------------------------------------------------------------------  -- 
오즈 애플릿이 동작이 되지 않는다면, 
1. 오즈 뷰어의 경로를 확인하시고, 
2. sun에서 나온 JVM이 설치되어있을 때에는 인터넷 옵션->고급에서 sun JVM의 체크를 빼고 사용해 주시기 바랍니다. 
3. 그리고 사용자 보안설정으로 확인하셔서, 보안설정을 낮음으로 해주시면 됩니다. (일단 보통에서도 동작은 되지만  
특정컴퓨터의 세팅에 따라 낮음으로 해야되는 경우가 있습니다.) 
4. 인터넷옵션->고급->자바콘솔사용을 체크 하신후, 보기->자바콘솔을 띄우셔서 
오즈호출 할때 에러가 나오는 지도 체크해 주시면 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.20(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
http://210.123.133.31/MainMgr/Maill/javamail.htm 
==============================================================================================================

- 신용카드 결제 확인 
※카드번호: 4009 0660 3785 1015  -> LG카드 
※명의자: 김지영 * 
정상결제됨: 20060920 오후 2시 33분 ID: kjy222로 결제 함 
==============================================================================================================

- 쇼핑몰 제작 조사 
정홍이 매형(손범준) * 누나 * 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.21(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:40  --> 풋살 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
http://210.123.133.31/MainMgr/Maill/javamail.htm 
http://int.i3shop.com/ServiceMgr/Maill/javamail.htm 

- 메일 발송 에러  
[위치 :MailSendThread] [시각 : 20060921120840] 
[메세지] 연결 에러  
java.net.ConnectException: Connection timed out: connect 
/* =============================================================================== */ 
/* =============================================================================== */ 
[시각 : 20060921120840] [코드 : 607] [메세지 : [to : *@*.*] [type : NONE]] 
/* =============================================================================== */ 
메일 에러 로그 기록에 에러가 발생했습니다. 
java.io.FileNotFoundException: \home\i3shop\mailLog\err\err_20060921 (지정된 경로를 찾을 수 없습니다) 
------------------------------------------------------------------------ 

원인: 메일 관련 환경설정이 잘못 됨(D:\Project\i3shop_env\daco.env 파일 수정) 
#========================================================# 
# 메일 관련 환경설정 # 
#========================================================# 
MAILLOGPOS=/home/i3shop/mailLog 
#MAILLOGPOS=D:\\orion_int\\log\\mailLog   --> 로컬Eclipse 에서 
#SMTPDOMAIN=dacosystem.com 
#SMTPSERVERIP=211.233.5.103 
#SMTPSERVERPORT=11190 
SMTPDOMAIN=i3shop.com #SMTP 도메인 
SMTPSERVERIP=211.233.5.102 #SMTP 호스트 주소(i3shop.com) 
SMTPSERVERPORT=25 #SMTP PORT 
==============================================================================================================

- 수신확인 
일단 메일를 보내실때 메일코드에 내용을 html형식으로 보내시고  
내용중에는 <iframe></iframe>으로 클라이언트에서 메일를 읽었을때   
처리할 코드가 들어있는 서버쪽에 주소를 넣어주십시요  
그럼 메일수신자가 메일을 읽을때 자동으로 iframe안에 들어있는 내용을 서버에 요청을 하게되는겁니다. 
ifame예제는  
<iframe src=http://www.test.com/mail/mailConfirm.jsp?mailuser=test width=0 height=0 frameborder=no scrolling=no></iframe> 

http://www.test.com/mail/mailConfirm.jsp 위주소에는 mailConfirm.jsp  
파일에는 메일을 읽었을때 처리하는 코드를 넣으세요.  
그리고 ?mailuser=test은 메일수신자를 확인하기 위한 파라메터 입니다.  
http://www.test.com/mail/mailConfirm.jsp 파일에서 request로 받으심 됨니다.  

참고로 아웃룩같이 받는사람이 수신메일를 보내겠다고 확인하였을때만  
보내고 싶다면 자바스크립트에 도움을 받는다면 간단히 처리할 수 있겠죠 
==============================================================================================================

- SMS 전송 대상 추출 
9월 22일 (내일)오전에 sms 보낼 대상입니다. 
최근 3개월 내 출산유아매장 카테고리 + i3mart매장 최다고객 2,500명 (매출순) 
8302 --> 5302 
==============================================================================================================

- SmartSQL 설치(오라클 DB 미들웨어) 
http://smartsql.hubweb.net 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.22(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp)  
T_MEMSUGGEST_ITEM(회원건의사항 상품 정보) 테이블 추가 
: 
----------------------------------------------------------------------------------------------------------------------  

- 건의사항 메일 보내기와 상품정보를 분리
./build.sh BoardMgr 
./build.sh BuyingMgr 
./build.sh DeliveryMgr 
./build.sh ItemMgr 
./build.sh ItemStockMgr 
./build.sh ReportMgr 
./build.sh SaleMgr 
----------------------------------------------------------------------------------------------------------------------  
  
- 담당 바이어에게 메일 보내기(/display/com/sendMailBuyerItemDetail.jsp) --> 상품상세보기 
- 건의사항관리(/admin/suggest/resellerSuggestWritefP.jsp) --> 리셀러 어드민  
==============================================================================================================

- SMS 전송 대상 추출 
최근 5개월내 화장품 구매회원(무료회원,리셀러)수 --> 5,958 건 
----------------------------------------------------------------------------------------------------------------------  
- SMS전송 미리보기 추출 정보 테이블 생성(T_SMS_SEND_PREV_CHU) 
- SMS전송 미리보기 추출 정보 Sequence 넘버 생성 
-- DROP SEQUENCE IIISHOP.T_SMS_SEND_PREV_CHU_SEQ; 
CREATE SEQUENCE IIISHOP.T_SMS_SEND_PREV_CHU_SEQ 
  START WITH 10001 
  MAXVALUE 999999999999999999999999999 
  MINVALUE 0 
  NOCYCLE 
  NOCACHE 
  NOORDER; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.23(토) 작업 ■■■■■■■■■■■■■■■■ \
--> 08:10 ~ 18:00 

- 쇼핑몰 수정
- 건의사항관리 수정 
(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
상품상세보기 추가 
==============================================================================================================

- 쇼핑몰 제작 컨설팅 
정홍이 매형(손범준) * 누나 * 
동아침장 053)257-7977 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.25(월) 작업 ■■■■■■■■■■■■■■■■
--> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 건의사항관리 수정(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
==============================================================================================================

- 수신확인 
일단 메일를 보내실때 메일코드에 내용을 html형식으로 보내시고  
내용중에는 <iframe></iframe>으로 클라이언트에서 메일를 읽었을때   
처리할 코드가 들어있는 서버쪽에 주소를 넣어주십시요  
그럼 메일수신자가 메일을 읽을때 자동으로 iframe안에 들어있는 내용을 서버에 요청을 하게되는겁니다. 
ifame예제는  
<iframe src=http://www.test.com/mail/mailConfirm.jsp?mailuser=test width=0 height=0 frameborder=no scrolling=no></iframe> 
==============================================================================================================

- 모질라 FireFox 
오른쪽에 지금다운로드 클릭해서 Firefox Setup 1.5.0.7.exe 다운 받아 클릭만 하면 끝 
http://www.mozilla.or.kr/products/firefox/ 
비 표준 Java Script 또는 Active X를 이용함으로써 발생 할 수 있는 문제  --> W3C 표준 따름 
==============================================================================================================

- 전세집 계약 
부동산 수수료: 135,000원(계약금의 00.5%) 
대구시 동구 신천4동 427-15 리베라 빌라 302호  우)701-828 
전세금: 2천 7백 만원(관리비 3만원) 
계약금: 백만원(4만원 선불) 통장에 입금 예정  
--> 09.26(화) 96만원 인터넷 뱅킹으로 입금 완료 
통장: 대구은행: 225-07-009132-8(예금주: 이진수) 
예상 이사일: 10월 12일(목) 
---------------------------------------------------------------------------------------------------------------------- 
화신부동산 이나원 실장(벼룩시장) --> 3770 
HP) *, * 
대구시 수성구 범어1동 752-1 Tel: 053)741-2121  
---------------------------------------------------------------------------------------------------------------------- 

- 전세집 보는 방법 
1. 주변 경관(시끄러운가, 주택가 인가) 
2. 수도물이 잘 나오는 지 여부 
3. 도시가스 사용 여부 
4. 화장실 변기가 잘 빠지는 지 여부 
5. 도배, 장판은 새로 해주는지 여부 
6. 주차공간이 있는 지 여부 
==============================================================================================================

- 대구도시 가스 Tel: 053)751-1114~5 Tel) 1577-1190 
한전(http://www.kepco.co.kr/cyber) 전기 자동이체 신청, 해지 
Tel) 123 고객번호: 05-1657-9676 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.26(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:10 ~ 23:00 

- 쇼핑몰 수정
- 세금 계산서 출력 수정 
(/inquiry/taxBill/popOZPrint_taxBill.jsp) 
세금계산서 일련번호 창 뛰울 때 마다 생성 --> 
세금계산서 일련번호 정보가 이미 존재하면 새로 생성 안함 
(일련번호에 대한 정확한 협의가 미흡) 
==============================================================================================================

- 세금 계산서 출력 에러 
02-2290-2012  박인기 
원인: 회원이 applet 레지스터리 등록을 처리 안 했음 
ozappletviewer_xp.reg를 등록 에러 
처리: NateOn으로 원격 연결하여 처리 
----------------------------------------------------------------------------------------------------------------------
- 세금 계산서 출력 방법 안내 작성 
(http://tamario.i3shop.cc/inquiry/taxBill/popUsagePrintP.jsp) 
http://tamario.i3shop.cc/inquiry/taxBill/taxBillListP_2.jsp 
==============================================================================================================

- 공인인증서 수정 
심봉애(i4shop26)  --> 고용순(k-cool01) 
명의 변경 건 
==============================================================================================================

- 신용카드 점검 
홍은영   766218   224416   Management-M   
법인 카드인데 공용인지 개인용인지 모르겠다고함. 00을 비롯한 비번으로 3회 오류해서 사용이  
당사 쇼핑몰에서는 안되는 상태이고 카드사로 문의하니 오류가 없다 정상 사용 되는 카드다라고 했다함 
--> 기업은행 비씨카드 9440 0300 6714 7989 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.27(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 세금 계산서 출력 수정 
(/inquiry/taxBill/popOZPrint_taxBill.jsp) 
출력화면 크게 수정(캡쳐해서 출력) 
출력 -> 크기 140%로 설정 --> 인쇄 
==============================================================================================================

- 우편번호 업그레이(48,652 --> 49,034)   
2006년 01월 05일자 업데이트(우체국 기준) 
http://www.epost.go.kr --> 우편번호 검색 --> 우편번호 다운로드 --> 정통부 고시우편번호 DB 
http://service.epost.go.kr/zipcode/search/search1.jsp# 
T_ZIPCODE: 우편번호 정보 
T_REGION_SHIP_MERCHANT: 도서산간 배송료 정보 
==============================================================================================================

- SMS 전송 대상 추출 
최근 5개월내 화장품 구매회원(무료회원,리셀러)수 --> 5,958 건 
==============================================================================================================

- 장롱 상품 조사 
투서랍장(6만원) 2개, 이불장(5만5천원) 1개  --> 17만 5천원 ==> 23만 5천원(배송료 6만원) 
길이: 243cm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09..28(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 18:40  --> 풋살 

- 쇼핑몰 수정
- SMS 수신여부 추가 
SMS_YN  CHAR(1)    --SMS수신여부 
/MemberSvcBean.java 수정 
getMemberBasicDetail() --> 조회 registReseller()  --> 등록 updateMember()  --> 수정 
getMemberBasicDetail() --> 조회 registFreeMember()  --> 등록 updateMember()  --> 수정 
---------------------------------------------------------------------------------------------------------------- 

- 회원 정보 수정(/customer/resellerUpdatefP.jsp) 
- 무료회원 정보 수정(/customer/freememRegistfP.jsp) 
 -- 인덱스 생성  @@@@@@ 
CREATE INDEX I_01_I1_T_MEMBER ON T_MEMBER(SMS_YN) NOLOGGING 
 -- 인덱스 생성  @@@@@@ 
CREATE INDEX I_01_I2_T_MEMBER ON T_MEMBER(MNO, SMS_YN) NOLOGGING 
 -- 인덱스 생성  @@@@@@ 
CREATE INDEX I_01_I3_T_MEMBER ON T_MEMBER(HPHONE, SMS_YN) NOLOGGING ---> 삭제  
--인덱스 삭제 @@@@@@ 
DROP INDEX I_01_I3_T_MEMBER CASCADE ; 
 -- 인덱스 생성  @@@@ 함수기반 인덱스 사용 
CREATE INDEX T_MEMBER_idx ON T_MEMBER REPLACE(RTRIM(HPHONE), '-','');   ---> 적용  
---------------------------------------------------------------------------------------------------------------- 

SELECT A.MNO, A.MEM_NM, A.MEM_SSN, A.PHONE, A.HPHONE, 
A.POST, A.FIX_ADDR, A.DTL_ADDR, A.EMAIL, A.MAIL_YN AS 메일수신여부,  
A.SMS_YN AS SMS수신여부, A.ACCOUNT_NM 
FROM T_MEMBER A 
WHERE A.MEM_ID = 'tamario26' 
AND A.SMS_YN = 'N' --SMS수신여부 
--; 
==============================================================================================================

- 근로자우대 찾음  
예금액: 11,720,000 원  --> 총 출금액: 12,521,574 원(이자: 801,574원) 
- 동양 CMA 통장 에서 대여 
2,700,000 출금(300,000 입금)  --> 2,400,000 대여 --> 200,000 출금   --> 총: 2,600,000 대여  
- 새마을 금고 예금(우대예탁금) ==> 생계형 저축(진덕근) 
만기: 2007-09-28    입금: 19,000,000원 만기지금액: 19,988,000원 
만기: 2007-09-29    입금: 1,000,000원 만기지금액: 1,052,000원 
만기: 2007-09-29    입금: 20,000,000원 만기지금액: 21,040,000원  ==> 순이자: 1,040,000원(년 5.2%)  
==============================================================================================================

- 동양 CMA 통장 에서 
2,700,000 출금(300,000 입금)  --> 2,400,000 대여 --> 200,000 출금   --> 총: 2,600,000 대여 
- 근로자우대 찾음 --> 11,720,000 원  --> 총: 12,521,574 원(이자: 801,574원) 
- 새마을 금고 예금(우대예탁금) ==> 생계형 저축(진덕근) 
만기: 2007-09-28    입금: 19,000,000원      만기지금액: 19,988,000원 
만기: 2007-09-29    입금: 1,000,000원       만기지금액: 1,052,000원 
만기: 2007-09-29    입금: 20,000,000원      만기지금액: 21,040,000원  ==> 순이자: 1,040,000원(년 5.2%) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.29(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:50 ~ 23:00 

- 쇼핑몰 수정
- SMS 수신여부 추가(실서버 적용) 
- 무료회원 가입(/customer/freememRegistfP.jsp)  ===> registFreeMember() 
- 무료회원 개인정보 수정(/customer/freememUpdatefP.jsp) ===> updateMember() 
- 리셀러 회원 가입(/customer/resellerRegistfP.jsp) ===> registReseller() 
http://www.i3shop.co.kr/customer/resellerRegistfP.jsp?p_nm=진태규&p_ssn=*  --> tamario2fami 
- 리셀러 개인정보 수정(/customer/resellerUpdatefP.jsp) ===> updateMember() 
/MemberSvcBean.java 수정  ==> getMemberBasicDetail() --> 조회  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.09.30(토) 작업 ■■■■■■■■■■■■■■■■
--> 07:50 ~ 18:00 

- 쇼핑몰 수정
- SMS전송관리(VB 프로그램)에 추가    
SMS 수신여부 추가 
---------------------------------------------------------------------------------------------------------------- 

- 세금계산서 수정 
발행일자 = 발행된 주문상세정보의 주문번호의 가장 최근값의 매출일자 
SELECT A.SELLING_DT AS SELLING_DT  
FROM T_ORDER A 
WHERE (A.COMPANY_CD, A.MERCHANT_CD, A.ORDER_DT, A.ORDER_NO) IN  
( 
SELECT MAX(COMPANY_CD), MAX(MERCHANT_CD), MAX(ORDER_DT),  MAX(ORDER_NO)  
FROM T_TAX_BILL_DTL 
WHERE PUBLIC_NO = '35358591'  --발행번호  
) 
---------------------------------------------------------------------------------------------------------------- 

35365462 nacasio 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■