

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.10.02(화) 작업 ■■■■■■■■■■■■■■■■■
--> 07:50 ~ 18:50   --> 이종필 대리 생일(수성 경찰서 옆 고기집) --> 대구 작은 아버지집 

- 쇼핑몰 수정
- SMS전송관리(VB 프로그램)에 추가    
SMS 수신여부 추가 
---------------------------------------------------------------------------------------------------------------- 

-- SMS수신거부자 정보 삭제 @@@@@@@@  
DELETE FROM T_SMS_SEND_PREV_CHU A 
WHERE A.SMS_GB = '103'   --SMS전송 구분 
 --AND A.MEM_ID = 'psy66' 
 AND ROWID > (SELECT MIN(ROWID)  --SMS수신 거부를 한 데이타 
  FROM T_MEMBER 
  WHERE HPHONE IS NOT NULL 
AND REPLACE(RTRIM(HPHONE), '-','') = REPLACE(RTRIM(A.HPHONE), '-','')   --휴대폰번호  
AND SMS_YN = 'N'   --SMS수신여부  
  ) 
--; 
--=================================================================================================== 

- BC카드 연계 행사 
BC카드 최다 금액 구매자 11명에게 에어스텔 공기청정기 지급 
RnF, 하이이머니, c2c 매장이용자는 제외 
http://tamario.i3shop.cc/popup/bccardRankP.jsp 
http://euijae.mart.cc/popup/bccardRankP.html 
---------------------------------------------------------------------------------------------------------------- 

--BC카드 주문 정보 조회 @@@@@@@@@ 
SELECT A.REG_ID AS 회원ID, A.MEM_NM AS 회원명, MAX(MEM_PHONE) AS 회원전화번호, MAX(MEM_EMAIL) AS 회원EMAIL, 
   NVL(SUM(B.REAL_SALE_PRICE),0) AS 주문금액 
FROM T_ORDER A, T_ORDER_DTL B, T_AR C 
WHERE A.COMPANY_CD = B.COMPANY_CD 
AND A.MERCHANT_CD = B.MERCHANT_CD 
AND A.ORDER_DT = B.ORDER_DT 
AND A.ORDER_NO = B.ORDER_NO 
AND A.COMPANY_CD = C.COMPANY_CD 
AND A.MERCHANT_CD = C.MERCHANT_CD 
AND A.ORDER_DT = C.ORDER_DT 
AND A.ORDER_NO = C.ORDER_NO 
AND A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001' 
AND A.ORDER_TP IN ('01') --주문유형(01:정상주문, 03:반품주문) 
AND A.ORDER_STS > '02' --주문상태 
AND A.ORDER_DT >= '20061009' --주문일자(이벤트 일자) 
AND A.ORDER_DT <= '20061107'  
AND A.ORDER_DT <= TO_CHAR(TO_DATE(SYSDATE),'YYYYMMDD')     --주문일자(오늘) 
AND (SELECT CARD_NM FROM T_CARD_BIN WHERE CARD_BIN LIKE SUBSTR(C.CARD_NO,0, 6)) = 'BCcard' 
AND A.AR_WAY_CD IN ('02', '03')  --결제방법코드(01:현금, 02:카드, 03:현금/카드, 04:R&F머니) 
AND C.AR_WAY_CD IN('20')  --시제유형코드(10:현금, 20:카드, 30:포인트, 40:쿠폰) 
AND C.AR_STS IN ('21')       --결제상태(21:카드승인)    
--AND A.REG_ID = 'hi51' --등록자ID  
AND B.DISPLAY_STORE_CD NOT IN('S013')   --매장코드(R&F매장이 아닌 것) 
AND NOT (B.DISPLAY_STORE_CD = 'S063' --하이이머니 매장이 아닌 것   
AND B.CATEGORY_CD IN ('W51010101', 'W51010102', 'W51010103','W51020101', 'W51020201', 'W51020301', 'W51020401')) 
GROUP BY A.REG_ID, A.MEM_NM 
ORDER BY SUM(B.REAL_SALE_PRICE) DESC  
--;  
---------------------------------------------------------------------------------------------------------------- 

--주문상세 정보 조회 @@@@@@@@@@@@@ 
SELECT SEQ_NO, ORDER_DT, ORDER_NO,      
ITEM_CD, ITEM_NM, BONUS_ITEM_CL AS 상품구분,    --수당상품구분(01:L&B, 02:R&F, 03:구L&B) 
       REAL_QTY AS 완료수량, SALE_PRICE AS 일반판매가, REAL_SALE_PRICE AS 실제판매가,  
       REG_ID, UP_ID 
-- SELECT * 
FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT = '20061009'     --주문일자  20060927 00229 
AND REG_ID = 'hi51' --회원ID 
AND DISPLAY_STORE_CD NOT IN('S013')   --매장코드(R&F매장이 아닌 것) 
AND NOT (DISPLAY_STORE_CD = 'S063' --하이이머니 매장이 아닌 것   
AND CATEGORY_CD IN ('W51010101', 'W51010102', 'W51010103','W51020101', 'W51020201', 'W51020301', 'W51020401'))   
ORDER BY SEQ_NO 
--;  
---------------------------------------------------------------------------------------------------------------- 

--주문상세 정보 조회 @@@@@@@@@@@@@ 
SELECT SUM(REAL_QTY) AS 완료수량, SUM(SALE_PRICE) AS 일반판매가, SUM(REAL_SALE_PRICE) AS 실제판매가  
-- SELECT * 
FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT = '20061009'     --주문일자  20060927 00229 
AND REG_ID = 'hi51'    --회원ID 
AND DISPLAY_STORE_CD NOT IN('S013')   --매장코드(R&F매장이 아닌 것) 
AND NOT (DISPLAY_STORE_CD = 'S063' --하이이머니 매장이 아닌 것   
AND CATEGORY_CD IN ('W51010101', 'W51010102', 'W51010103','W51020101', 'W51020201', 'W51020301', 'W51020401'))   
ORDER BY SEQ_NO 
--; 
--=================================================================================================== 
  
- 신용카드 서비스 일시 중지 안내 
1. 안전결제(ISP)서비스 시스템 점검에 따른 발급 관련 서비스 일시 중지 안내 
대상 카드: 신용카드(BC, KB(국민), 우리) 인터넷 안전결제(ISP) 
점검 시간: 2006년 10월 7일(토) 01:00 ~ 09:00(총 8시간) 
내용: 카드사의 안전결제(ISP) 점검 작업으로 인해 해당 시간에 서비스가 일시 중지될 수 있습니다. 
---------------------------------------------------------------------------------------------------------------- 
2. 신한은행 통합관련에 따른 서비스 일시 중지 안내 
대상 은행: (구)신한, (구)조흥은행 
대상 카드: 신한체크카드(단, 신한카드 서비스는 정상 승인 됨) 
점검 시간: 2006년 10월 4일(수) 23:30 ~ 10월 9일(월) 08:30 
내용: (구)신한은행과 (구)조흥은행의 통합작업으로 인해 해당 시간에 서비스가 일시 중지될 수 있습니다. 
==============================================================================================================
  
- 장롱 상품 조사  
35만 5천원(배송비 3만원포함)  ==> 81*49*210cm(길이: 243cm)  ==> 246,667(배송비 3만원포함)  
---------------------------------------------------------------------------------------------------------------- 
솜씨방 가구(http://itempage.auction.co.kr/detailview.aspx?itemno=A056476839) 
투서랍장(6만원) 2개, 이불장(5만) 1개, 이단봉장(5만) 1개: 16만원 ==> 총: 22만원(배송료 6만원) ==> 길이: 243cm 
최서방 가구(http://itempage.auction.co.kr/detailview.aspx?itemno=A056178907&frm=rcview) 
투서랍장(6만원) 2개, 이불장(5만5천원) 1개 :  ==> 총: 23만 5천원(배송료 6만원)  ==> 길이: 243cm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.03(수) 작업 ■■■■■■■■■■■■■■■■
--> 08:50 ~ 18:00 --> 공휴일 

- 쇼핑몰 수정
- BC카드 연계 행사 
BC카드 최다 금액 구매자 11명에게 에어스텔 공기청정기 지급 
RnF, 하이이머니, c2c 매장이용자는 제외 
http://tamario.i3shop.cc/popup/bccardRankP.jsp 
http://euijae.mart.cc/popup/bccardRankP.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.04(수) 작업 ■■■■■■■■■■■■■■■■
--> 08:50 ~ 19:00  --> 종욱이 아제집(정상 근무) 

- 쇼핑몰 수정
- BC카드 연계 행사 
BC카드 최다 금액 구매자 11명에게 에어스텔 공기청정기 지급 
http://tamario.i3shop.cc/display/event/lnb20061009/eventP.jsp 
http://tamario.i3shop.cc/popup/bccardRankP.jsp 
==============================================================================================================

- 공인인증서 에러 
공인인증과 카드를 사용하여 결재하는데 에러나는 건입니다. 
아이디 : muzic9 
에러내용 : 3D 인증실패. 안심클릭 현재 정보와 공인인증 정보가 서로 일치하지 않습니다. 
안심클릭을 새로 등록 하였으나 안되고, 씨티 카드사에 문의 해 본결과 가맹점 또는 공인인증기관에 문의 하라고  
안내 하였다고 합니다. 
확인 좀 부탁 드리겠습니다. (어제 저녁 내내 안되어서 오늘 9시 30분에 연락 드리기로 했습니다).  
조치: 공인인증서 보다는 안심클릭 등록 에러로 추정됩니다. 
일단 공인인증서 신규발급으로 수정 했으니 공인인증서 다시 다운 받아서 해보라고 하세요. 
---------------------------------------------------------------------------------------------------------------- 
- 공인인증서 확인 방법 
한국정보인증 홈페이지(http://www.signgate.com) 
--> 개인 --> 인증서 관리(http://www.signgate.com/individual/indi05.htm) --> 4. 인증서 보기  --> 선택(새창 뜸) 
인증서 관리(새창 화면) 
선택된 인증서 정보 --> 인증서 검증(클릭)  ---> "인증서 검증을 성공적으로 완료 했습니다" 
==> 인증서 정상 
==============================================================================================================

- 신용카드 점검 
김정희   kjh570   BC카드 할부개월수 오류라고 자꾸 뜬다고하세요. 
카드번호:  9440-3210-2190-1078 
조치: 개인카드 한도 문제로 추정됨(카드사 문의) 
==============================================================================================================

- 농협 예금 찾음 
예금액: 20,000,000 원  --> 총 출금액: 20,848,477 원(이자: 848,477원)  
- 새마을 금고 예금(우대예탁금) ==> 생계형 저축(진덕근)  
만기: 2007-09-29    입금: 20,000,000원 만기지급액: 21,040,000원 ==> 순이자(비과세): 1,040,000원(년 5.2%)  
만기: 2007-10-04    입금: 10,000,000원 만기지급액: 19,988,000원 ==> 순이자(세금우대): 1,040,000원(년 4.9%)  
만기: 2007-10-04    입금: 5,000,000원 만기지급액: 1,052,000원 ==> 순이자(세금우대): 1,040,000원(년 4.9%) 
==> 총금액: 35,000,000 원(만기지급액 --> 36,776,053원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.09(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- BC카드 연계 행사  --> 정식 오픈 
BC카드 최다 금액 구매자 11명에게 에어스텔 공기청정기 지급 
http://tamario.i3shop.cc/display/event/lnb20061009/eventP.jsp 
---------------------------------------------------------------------------------------------------------------- 
- SMS 전송 대상 추출 
1-9월 중 BC카드 Lnb, 마트 이용자 1000명 건(매출순) 
==============================================================================================================

- 우편번호 업그레이(48,652 --> 49,032)   
2006년 01월 05일자 업데이트(우체국 기준) 
http://www.epost.go.kr --> 우편번호 검색 --> 우편번호 다운로드 --> 정통부 고시우편번호 DB 
http://service.epost.go.kr/zipcode/search/search1.jsp# 
20060701_우편번호(기존형태).xls 
T_ZIPCODE: 우편번호 정보 T_REGION_SHIP_MERCHANT: 도서산간 배송료 정보  
---------------------------------------------------------------------------------------------------------------- 
우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
==============================================================================================================

- 노블레스CD구매 확인 
* 박혜화(xingfuu)  --> 박효숙 
농협 입금장: 박주선 
==============================================================================================================

- 세금 계산서 수정 
노혜선  nhs01180 
세금계산서  발행번호 : 35365383  -> 출력하면 페이지오류 화면 확인 
==============================================================================================================

- 원룸 포장이사 
080-053-1124 
---------------------------------------------------------------------------------------------------------------- 
- 장롱 거수비(신천4동사무소) 
120cm 1쪽 10,000 120cm이상 
100cm 1쪽  8,000     ====> 현재 구형 장롱 크기로 추정 
90cm  1쪽  7,000 90cm 미만 
신천4동사무소 TEL: (053)743-5283 
해동자원(동사무소 위탁업체) TEL: (053)985-3830 
http://www.dong.daegu.kr/newch/sc4/minwon/minwon_main.html 
---------------------------------------------------------------------------------------------------------------- 
- 가방 리터 계산 
23L 27*15*42cm 25L 30*16*43cm 
28L 31*18*44cm 30L 32*15*50cm 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.10(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 9월 세금계산서 월발행(발행일: 20060930,   신청일: 20060930) 
T_TAX_BILL: 15,179, T_TAX_BILL_DTL: 216,739 
---------------------------------------------------------------------------------------------------------------- 
-- 발행방식(01:주민번호)  
1. 주문 발행 
과세: 4,558 비과세: 2,160 
2. 반품 발행 
과세: 474 비과세: 73 
-------------------------------------- 
-- 발행방식(02:사업자번호) 
1. 반품 발행 
과세: 1 비과세: 0 
---------------------------------------------------------------------------------------------------------------- 
- 9월 세금계산서 월발행 
- SMS 문자 전송 --> 세금계산서발행공지(07)  --> 3,982 건 전송 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 9월 세금계산서가 발행 되어 있습니다.출력가능함"   
==============================================================================================================

- 우편번호 업그레이(48,652 --> 49,032)   
2006년 01월 05일자 업데이트(우체국 기준) 
http://www.epost.go.kr --> 우편번호 검색 --> 우편번호 다운로드 --> 정통부 고시우편번호 DB 
http://service.epost.go.kr/zipcode/search/search1.jsp# 
20060701_우편번호(기존형태).xls 
-우편번호 업로드하기(VB) 
GITA 필드에 있는 번지수를 BUNJI 필드로 분리하기 
교하읍(DONG) 동패리(RI) 책향기마을우남퍼스트빌아파트 1401-1412(GITA) 
교하읍 동패리 책향기마을우남퍼스트빌아파트(DONG)  1401-1412(ADDR) 

문산5리, 동패리 
T_ZIPCODE: 우편번호 정보 T_REGION_SHIP_MERCHANT: 도서산간 배송료 정보  
---------------------------------------------------------------------------------------------------------------- 
우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
==============================================================================================================

-- 이전달 조회 
SELECT TO_CHAR((LAST_DAY(ADD_MONTHS(SYSDATE,-2)) + 1),'YYYYMMDD') AS 이전달_첫째일,   
TO_CHAR(LAST_DAY(SYSDATE-30),'YYYYMMDD') AS 이전달_말일 
FROM DUAL 
--; 
==============================================================================================================

- SMS 전송 대상 추출 
대상자 : 최근 3개월내 출산유아매장 2,500명, 미만시 i3mart 매장 내 최다 매출 고객순(무료회원포함) 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2006.10.11(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:30 

- 쇼핑몰 수정
- 9월 세금계산서 월발행(발행일: 20060930,   신청일: 20060930) 
T_TAX_BILL: 15,179, T_TAX_BILL_DTL: 216,739 
---------------------------------------------------------------------------------------------------------------- ------- 
-- 발행방식(01:주민번호)  
1. 주문 발행 
과세: 4,558 비과세: 2,160 
2. 반품 발행 
과세: 474 비과세: 73 
-------------------------------------- 
-- 발행방식(02:사업자번호) 
1. 반품 발행 
과세: 1 비과세: 0 
---------------------------------------------------------------------------------------------------------------- 
- 9월 세금계산서 월발행 
- SMS 문자 전송 --> 세금계산서발행공지(07)  --> 39,52 건 전송 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 9월 세금계산서가 발행 되어 있습니다.출력가능함"   
==============================================================================================================

- 우편번호 업그레이(48,652 --> 49,032)   
2006년 01월 05일자 업데이트(우체국 기준) 
http://www.epost.go.kr --> 우편번호 검색 --> 우편번호 다운로드 --> 정통부 고시우편번호 DB 
http://service.epost.go.kr/zipcode/search/search1.jsp# 
20060701_우편번호(기존형태).xls 
-우편번호 업로드하기(VB) 
GITA 필드에 있는 번지수를 BUNJI 필드(ADDR)로 분리하기 
교하읍(DONG) 동패리(RI) 책향기마을우남퍼스트빌아파트 1401-1412(GITA) 
교하읍 동패리 책향기마을우남퍼스트빌아파트(DONG)  1401-1412(ADDR)  --> T_ZIPCODE 테이블 필드  
T_ZIPCODE: 우편번호 정보 T_REGION_SHIP_MERCHANT: 도서산간 배송료 정보(문산5리, 동패리) 
---------------------------------------------------------------------------------------------------------------- 
- 우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
==============================================================================================================

--영문인지 숫자인지 구별을 해주는 함수 @@@@@@@@ 
CREATE OR REPLACE FUNCTION  UDF_ISNUM      
( 
param_STR  IN  VARCHAR2 
)  
RETURN NUMBER 
IS 
  v_NUM      PLS_INTEGER  DEFAULT 0; 
BEGIN   

  SELECT TO_NUMBER(param_STR) INTO v_NUM FROM DUAL; 
  RETURN 1; 

  EXCEPTION 
    WHEN INVALID_NUMBER THEN  --ORA-01722 
      RETURN 0; 
     
    WHEN OTHERS THEN 
      DBMS_OUTPUT.PUT_LINE('param_STR : '  param_STR  ' : '   
                           TO_CHAR(SQLCODE)  ':'  SQLERRM); 
      RETURN 0; 

END UDF_ISNUM; 
---------------------------------------------------------------------------------------------------------------- 

SELECT UDF_ISNUM('1234'), UDF_ISNUM('123A') FROM DUAL; 
==============================================================================================================

- 세금계산서 수정 
세금계산서 출력13일까지 연장 
수정 전: 3분기 10월 10일까지 
수정 후: 3분기 10월 13일까지(추석 연휴로 해서 임시 연장) 
==============================================================================================================

- 공인인증서 오류 
★ 대리님~ 아래와 같이 오류 뜨는건 인증서가 카드소유자의 인증서가 아니라서 그렇다고 안내드렸는데,  
카드소유자의 인증서가 맞다고 하시거든요....근데 안된다고 하는데 어떻게 된건지 확인가능할까요?  
참...그리고 씨티비자 → 안심클릭이 맞나요? 확인후 메모좀 주세요 ^ ^  
윤소영        jsm0801        Gold-M 
카드번호: 4404-4680-5828-0002 씨티비자카드 / 결제금액 320만원 정도  
└-> 안심클릭 등록했고, 공인인증서 창이 떴을때 [고객님의 인증서가 본인의 인증서랑 다르다?] 라는 오류가  
뜨면서 결제가 안된다고 하시며 문의? 확인후 전화 * 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.12(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:30  --> 풋살(이사짐 정리: 2시까지) 

- 쇼핑몰 수정
- 우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
- 우편번호 최종 테스트 쇼핑몰 
http://tamario.i3shop.cc/customer/T_resellerUpdatefP.jsp 
http://tamario.i3shop.cc/customer/T_findPostfP.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.13(금) 작업 ■■■■■■■■■■■■■■■■
--> 15:00 ~ 18:30  --> 년차(이사: 리베라 302호): 5개 사용(6개 남음) 

- 쇼핑몰 수정
- 세금계산서 수정 
회원ID: lim80 회원번호:727368 
35371815 
35367731, 35360821,  35354062 
35358074 
0100012006070700134 사업자번호 --> 35372287 
0100012006070400498 주민번호 --> 35372284 
0100012006070400500 주민번호 --> 35372285 
0100012006070400501 주민번호 --> 35372286 
사업자등록번호: 504-81-53027 
==============================================================================================================

- 원룸 이사
08:00 기상 
09:00 이사짐 정리(엄마, 큰누나, 진협) 
10:30 가구 도착(병오 아제) 
11:30 원룸 이동(신천4동 427-15 리베라 하이츠 302호) 
12:00 가구, 냉장고, 세탁기 옮기기 ---> 주인과 계약 
12:40 점심(중국집) 
14:40 종료 
15:00 전세금 송금(회사): 26,135,000원(계약금 백 제외) 
16:20 확정일자 신고(신천4동사무소)  
18:30 회식(현애씨 생일)  
20:30 종료 
20:40 귀가 
----------------------------------------------------------------------------- 
세대주: 손정수(대구은행 021-13-125692)  --> * 
대구시 동구 신천4동 427-15 리베라 하이츠 302호(701-828) 
관리비: 월 3만원(도시가스비, 전기세, 유선방송비 제외) 
==============================================================================================================

- 전세금 송금 
대구은행 021-13-125692 손정수  --> 16,007,290원 송금(주인) 
대구은행 225-07-009132-8 이진수  --> 10,135,000원 송금(부동산 업자) 
------------------------------------------------------- 
리베라 주인 16,000,000   
관리비 30,000  
농협 적금 총합 16,030,000  
전기료 대납 예정 -8,760 
도시가스료 대납 -13,950 
총합 16,007,290 
-------------------------------------------------------  
도시가스 설치(설치비: 7,000원, 10월, 11월 요금 1,700원 
도시가스 설치(설치비: 15,000원) 
확정일자 받기(신청4동사무소) 수수료(600원) 
유선방송 설치비 33,000원(관리비에서 제외): 월 6천원 
열쇠 맞춤: 3만원  TEL)767-4343   HP)011-808-3079 
==============================================================================================================

- 신천 4동 이사  
한전(http://www.kepco.co.kr/cyber) 전기 자동이체 신청, 해지 
Tel: 053-757-2233, Tel) 123 고객번호: 05-1657-9676 
현재 9월분(08월 10일 ~ 09월 09일까지)은 납부를 한 상태 입니다. 
10월13일 10시 이전에 고객님께서 그 동안 사용한 계량기의 검침숫자(검정부분)를 메모하여  
고객센터(국번없이123)나 동대구지점 요금관리팀 요금(757-2241~3)으로 이사정산 요청을 하시면 상담원이  
10월분(9월10일~10월9일) 및 잔침분을 계산한 금액을 알려 드릴 것 입니다. 
이사 정산 금액을 건물주 또는 세입자에게 전달하면서 10월분 전기요금 고지서가  도착하면 납부하시라고  
알려드리면 되겠습니다.   
한전동대구지점 고객지원팀 최무룡 드림 757-2233 
------------------------------------------------------------------------ 
대구도시 가스 Tel: 053)751-1114~5 Tel) 1577-1190 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.16(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:30   --> 주물럭 파티(현정, 현애, 신혜) 

- 쇼핑몰 수정
- 우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
- 우편번호 최종 테스트 쇼핑몰 
http://tamario.i3shop.cc/customer/T_resellerUpdatefP.jsp 

T_REGION_SHIP_MERCHANT: 742건(48,653건 --> 49,032건)  
----------------------------------------------------------------------------- 

 --우편도서산간 관리 조회 @@@@@@@@@ 
 SELECT COUNT(*) 
FROM T_ZIPCODE_T_NEW A, T_REGION_SHIP_MERCHANT_T_NEW B 
WHERE A.ZIPCODE_SEQ = B.SEQ_NO_NEW(+)   
--AND A.ZIPCODE_SEQ = N.SEQ_NO(+) 
--AND M.ZIPCODE_SEQ = N.SEQ_NO 
--AND N.ADD_SHIP_PRICE IS NOT NULL 
--AND A.DONG LIKE '울릉%'' 
AND NVL((SELECT MAX(BB.ADD_SHIP_PRICE) FROM T_ZIPCODE AA, T_REGION_SHIP_MERCHANT BB 
    WHERE AA.ZIPCODE_SEQ = BB.SEQ_NO AND AA.STATE = A.STATE 
      AND AA.CITY = A.CITY AND AA.DONG = A.DONG),0) > 0   --도서산간료 존재 
ORDER BY A.ZIPCODE_SEQ 
---------------------------------------------------------------- 

--도서산간 정보 수정 @@@@@@@@  
-- UPDATE T_REGION_SHIP_MERCHANT_T U 
SET U.ZIP_NO = (SELECT B.ZIP_NO 
       FROM T_ZIPCODE B 
   WHERE U.SEQ_NO = B.ZIPCODE_SEQ 
)   
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_ZIPCODE B 
WHERE U.SEQ_NO = B.ZIPCODE_SEQ 
  )  
--;    
==============================================================================================================

- 건의사항관리(/ServiceMgr/memsuggest/memSuggestMgrMainP.jsp) 
lyj0479(이영재) * 
==============================================================================================================

- 세금계산서 확인 
이용배   ybljt   
주문일자 20060930 주문번호 0100012006093000070 
입금내역 쿠폰 20060930             입금 20061002 
--------------------------------------------------------------------------- 
주문번호 0100012006092900092 \1,254,000  
9.29이 주문해서 9.30일 입금하였는데 주민번호 월발행에 없어요. 
이건도 좀전건(전석원) 처럼 사업자등록증으로 신청할수 있도록 해주세요... 
근데 이건은 30일 마감일에 입금처리 되었는데 왜 주민번호로 발행안되었죠? 
==============================================================================================================

- 장롱 수거비 송금 
대구은행 055-04-001380-9(055040013809) 
예금주: 해동자원  HP)016-896-6936 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.17(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 우편도서산간 관리(/BizMgr/ReportMgr/PostMgr/PostRegionP.jsp) 
T_REGION_SHIP_MERCHANT: (742건  --> 714건) 
T_ZIPCODE: (48,653건 --> 49,032건)  
http://tamario.i3shop.cc/customer/T_findPostfP.jsp 
==============================================================================================================

- 정수기 수정 
주문자 미확인으로 조치  
20589 0100012004083111708 
20565  0100012004083111708 
20327  0100012004083111708 
20258  0100012004083111708 
------------------------------------------------------------------------ 
오늘날짜로 52in산소수기 주문건 결제완료 1건 
0100012006101700283 
==============================================================================================================

- 세금계산서 발행 수정 
여춘동      dg7100      Active-Master 
※ 35368936  발행  주민번호  과세  7  4,207,900  월발행  20060930  
사업자등록증으로 발행 변경 
------------------------------------------------------------------------ 
세금계산서 합계표 관리에서 
사업자번호로 발행일자 기준하여 7월 8월 9월 각각 조회하니 
7월분과 9월분  매출처수와 금액이 달라요. 
리스트금액이랑 바로 밑에 집계표 금액이랑 
이제 부가세 신고준비를 시작하였어요.   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.18(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 21:30 

- 쇼핑몰 수정
- 우편번호, 도서산간료 실서버 적용(실패) 
T_REGION_SHIP_MERCHANT: (742건  --> 714건) 
T_ZIPCODE: (48,653건 --> 49,032건)  
http://tamario.i3shop.cc/customer/T_findPostfP.jsp  --> 동패리  
==============================================================================================================

- 세금계산서 발행 민원 처리 
네이트온 원격제어   
김선정(today11) T) 053-572-3727 
------------------------------------------------------------ 
회원명: 한대운(clover2) 
10월분에 대하여 세금계산서 발행요청을 할려고 하니 
주문번호별 출력불가능 이라고 뜨고 치약이런제품에도 비과세라고 뜨거든요. 
발행번호: 35372241 
http://clover.nara.cc/index.jsp 
------------------------------------------------------------ 
- I3SHOP 홈페이지(IR) 일반 자료실 등록 
http://www.i3shop.com/admin (i3shop/9093) 
==============================================================================================================

- 세금계산서 발행 민원 처리 
강동화(tittat) T) 043-262-5536 
http://www.i3shop.com/board/data_list.asp 
==============================================================================================================

- 노동부 한국고용정보원(http://www.work.go.kr) 회원 재가입 
tamario26/ss*****9 
------------------------------------------------------------ 
- 전기료 납부 
인터넷 지로(http://www.giro.or.kr/index.html) 
7,220원(06/09/04 ~ 10/03) 
전기 자동이체 신청(http://www.kepco.co.kr/cyber), 명의변경 
성명: 장경은, 고객번호: 05 1565 3579(0515653579) 
11월 27일 부터 자동이체 됨(전기료 대납 예정 금액: -1,540원(총: 8,760원)) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.19(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:30   --> 풋살(2시간), 맥주(동규, 일남과 동변동에서 한잔) 

- 쇼핑몰 수정
- 고객상품평 보기(/display/com/UsePSInfoP.jsp) 
- 고객상품평 쓰기(/display/com/UsePSP.jsp?p_store_cd=S065&p_category_cd=U02010104&p_item_cd=00164992&p_display_cd=51) 
- 상품평관리(/BizMgr/ItemWebMgr/itemUsePsP.jsp) 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010303&p_display_cd=11&p_item_cd=00150293 
==============================================================================================================

- 세금계산서 발행 처리 
아이디:miheejang 박미희 
유성물류(주) 134-86-23090 8월 과세 세금계산서발행분이 이중으로 들어가 있는거 같아요. 
합계표관리에도 더해져 있구요.목록 합계랑 합계표금액이랑 같은걸 보면 그런거 같아요. 
발행번호는 35344883 입니다. 
------------------------------------------------------------------------------------------------------------------- 
9월 매출발행분에 아이쓰리샵으로 테스트 한건이 두건 있네요. 
이건 주문자체를 삭제해야할꺼 같은데요... 
발행번호:35372256,   35372255 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.20(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 우편번호, 도서산간료 실서버 적용 
T_REGION_SHIP_MERCHANT: (742건  --> 714건) 
T_ZIPCODE: (48,653건 --> 49,032건)  
http://tamario.i3shop.cc/customer/T_findPostfP.jsp  --> 동패리 
==============================================================================================================

- 고객상품평 보기(/display/com/UsePSInfoP.jsp) 
- 고객상품평 쓰기(/display/com/UsePSP.jsp?p_store_cd=S065&p_category_cd=U02010104&p_item_cd=00164992&p_display_cd=51) 
- 상품평관리(/BizMgr/ItemWebMgr/itemUsePsP.jsp)  
쇼핑몰에 고객상품평 중 Dept 131, 131(131:R식품, 132:R식품(HI)) 와 관련되어 작성된 
글을 삭제하고 해당 Dept에 대해 고객 상품평 등록을 못하게 수정 
==============================================================================================================

- 공인인증서 명의 변경 
리셀러 어드민 공인 인증서 다운르도 받는데 
"공인 인증 정보와 일치하지 않는다고 나온다함" 
최은희  hahoho   * 
==============================================================================================================

- 공제증권 중계서버 환경 재설정(IP변경) 
\\211.233.5.103(공제조합/Mail 서버) administrator/i3shop1030321 
변경된 IP주소: 218.54.137.210 
- 증권재발급[미발급분](/MlmMgr/allowanceMgr/Order/reqBillP.jsp) 
MLM관리/매출관리/ 
----------------------------------------------------------------- 
- 공제조합에 장원석 과장(02-3498-4950/*)  
20061021 64건 
20061022 41건 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.21(토) 작업 ■■■■■■■■■■■■■■■■
--> 12:00 ~ 20:00 --> 격주 휴무 

- 쇼핑몰 수정
- 고객상품평 보기(/display/com/UsePSInfoP.jsp) 
- 고객상품평 쓰기(/display/com/UsePSP.jsp?p_store_cd=S065&p_category_cd=U02010104&p_item_cd=00164992&p_display_cd=51) 
- 상품평관리(/BizMgr/ItemWebMgr/itemUsePsP.jsp)  
쇼핑몰에 고객상품평 중 Dept 131, 131(131:R식품, 132:R식품(HI)) 와 관련되어 작성된 
글을 삭제하고 해당 Dept에 대해 고객 상품평 등록을 못하게 수정 
==============================================================================================================

- 웹서피어(Websphere) 서버 에러 
"ADGU2008E 관리 클라이언트가 관리서버로 연결하는 데 실패했습니다" 
원인: adminserver 이상으로 추정(adminserver 2개 이상이면 하나 지우고 재시작) 
]# ps -ef  grep admin  
root       971   933  0 Jan09 pts/3    00:00:00 /bin/sh ./adminserver.sh 
root      4127  4084  0 16:05 pts/9    00:00:00 grep admin 
]# kill -9 971 
]# reboot -n   --> 재시작 
----------------------------------------------------------------- 
210.123.133.101 root/1q2w3e  --> 웹서피어(Websphere) 재시작 서버(리눅스) 
==============================================================================================================
  
--> 이미지 연결 
]# cd /opt/WebSphere/AppServer/installedApps/BizStore.ear/BizStore.war 
[root@i3shop_ccdom6 BizStore.war]# df --이미지 연결 확인(재부팅 후에 만 할 것) 
[root@i3shop_ccdom6 BizStore.war]# mount -t smbfs -o username=administrator,password=i3shop,uid=i3shop,
gid=i3shop //192.168.1.126/img ./img   ---> 이미지 서버(211.233.5.126) 
[root@i3shop_ccdom6 BizStore.war]# mount -t smbfs -o username=administrator,password=i3shop1040321,
uid=i3shop,gid=i3shop //192.168.1.104/entPost_img ./entPost_img  ---> 이전 이미지 서버(211.233.5.104) 
[root@i3shop_ccdom6 BizStore.war]# mount -t smbfs -o username=administrator,password=i3shop1040321,
uid=i3shop,gid=i3shop //192.168.1.104/c2c_img ./c2c_img 
[root@i3shop_ccdom6 BizStore.war]# df --이미지 연결 확인(재부팅 후에 만 할 것) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.23(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 고객상품평 보기(/display/com/UsePSInfoP.jsp)   --> 실서버 적용 
- 고객상품평 쓰기(/display/com/UsePSP.jsp?p_store_cd=S065&p_category_cd=U02010104&p_item_cd=00164992&p_display_cd=51) 
- 상품평관리(/BizMgr/ItemWebMgr/itemUsePsP.jsp)  
쇼핑몰에 고객상품평 중 Dept 131, 132(131:R식품, 132:R식품(HI)) 와 관련되어 작성된 
글을 삭제하고 해당 Dept에 대해 고객 상품평 등록을 못하게 수정 
==============================================================================================================

- R&F 매장 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S013&p_category_cd=T03010303&p_display_cd=11&p_item_cd=00150293 
- H-E 매장 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S063&p_category_cd=W51010101&p_display_cd=51&p_item_cd=00159669 
- I3MART 매장 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010106&p_item_cd=00164496&p_display_cd=01 
- L&B 매장 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T11080303&p_item_cd=00162762&p_display_cd=01 
==============================================================================================================

- 세금계산서 발행 수정 
세금계산서합계표관리(BizMgr/TaxBill/TaxBillHapListP.jsp) 
시제유형 총합계 추가 
---------------------------------------------------------------------------------------------------------------------------- 
- 세금계산서 발행 처리 
염선숙(yss71)      Active-Master   * 전->염선숙 
발행번호 :  35368120 / 2,077,270 과세 
발행번호 :  35371133 / 45.450\  비과세 
주민번호 -> 사업자번호로 발급 변경 요청 
사업자등록번호 217-05-50739 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.24(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 발행 수정 
세금계산서합계표관리(BizMgr/TaxBill/TaxBillHapListP.jsp) 
시제유형 총합계 추가 
==============================================================================================================

- 국민카드 2006년 10월 요금(11월 27일 결제)  
244,760 --> 180,750 이 정확 
2006-10-27 22:36 30005612 일시불 KB016 37,000 홈마트  전표미매입  
2006-10-27 16:39 30005606 일시불 KB016 6,000 (주)옥션  전표미매입 
2006-10-22 13:04 30005590 일시불 KB016 12,700 홈플러스성서점  전표매입  
2006-10-17 13:26 30005585 일시불 KB016 8,900 (주)인터파크  전표매입  
2006-10-16 14:55 40000100 일시불 KB016 64,010 이마트만촌점  취소전표매입   ---> 취소 
2006-10-15 19:11 30005574 일시불 KB016 60,140 이마트만촌점  전표매입  
2006-10-15 17:54 30005564 일시불 KB016 56,010 이마트만촌점  전표매입  
2006-10-14 20:54 30005554 일시불 KB016 64,010 이마트만촌점  전표매입 ---> 취소 
==============================================================================================================

- 공인인증서 명의 변경(신규 신청) 
유명월 jang55 
장정숙 ymw79(신청 안 되어 있음)  --> 신규 신청 
------------------------------------------------------------- 
-- 공인인증 정보 수정(명의 변경) @@@@@@ 
-- UPDATE T_KICA_REQ 
SET MNO = 766443, MEM_ID = 'ymw79', MEM_NM ='장정숙', MEM_SSN = '5510202540913',    --주민번호 
PHONE = '02-514-1383', HPHONE = '011-9023-3428', EMAIL = '*@*.*',   --이메일   
POST = '136750',  
  FIX_ADDR = '서울 성북구 동소문동4가 송산아파트', DTL_ADDR= '102-512',       
REQ_YN = 'Y', REQ_DATE = '', DN_YN = 'N', DN_DATE = '',  
BILL_METHOD = 'N', BILL_SEQ = NULL, BILL_DATE = NULL, USER_DN = NULL  
WHERE MEM_ID = 'jang55'  
--; 
------------------------------------------------------------- 

--공인인증서 정보 수정(결제 정보 변경)  @@@@@@ 
UPDATE T_KICA_BILL A 
SET A.REG_ID = 'ymw79', A.MNO = 766443 
WHERE  A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001' 
AND A.REG_ID = 'jang55'       --등록자ID 
AND (A.APPROVAL_CODE ='0000' OR A.APPROVAL_CODE ='O')    --승인코드(0000:정상완료) 
AND A.ORDER_DT ='20060610' 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.25(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 발행 수정 
세금계산서합계표관리(BizMgr/TaxBill/TaxBillHapListP.jsp) 
시제유형 총합계 추가 
신용카드 매출전표(신용카드, 현금영수증) 등 발행금액 중 세금계산서(계산서) 교부내역 
1. 세금계산서 교부금액: 2. 계산서 교부금액: 
==============================================================================================================

- 입고 반품 관리(/BizMgr/DeliveryMgr/StoreIn/storeinRiP.jsp) 
returnItemReqS.jsp 
TRNS-50015 에러 
DEPART1코드(DEPART1_CD) 가 다르면 에러가 남 
거래처: 미소네 
김가루 1, 김파래 김자반 볶음 2, 남문 꽃 소금 1 
==============================================================================================================

- 정수기 수정 
12762   0100012004083111209 
주문유형을 신품교체로 변경 
11753 0100012004030100335(신품교체) ---> 처리 완료(해피콜에서 조회): 색상(흰색 --> 파란) 
처리 완료에서 조회 안됨 
==============================================================================================================

- 이상철  농협: 795-02-215910(79502215910) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.26(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:40 --> 구조 조정 명단 발표(최현수, 강금순), 풋살 

- 쇼핑몰 수정
- 입고 반품 관리(/BizMgr/DeliveryMgr/StoreIn/storeinRiP.jsp) 
returnItemReqS.jsp 
TRNS-50015 에러 
DEPART1코드(DEPART1_CD) 가 다르면 에러가 남 
--> 알람창 띄워서 등록 못하게 함 
거래처: 미소네 
김가루 1, 김파래 김자반 볶음 2, 남문 꽃 소금 1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.27(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 명의변경내역조회(/MlmMgr/organizeMgr/changeHistoryMainP.jsp) 
getTransferHistory 
changeHistorySearch.jsp 
log("[/DeliveryMgrBean.java]::[addStoreinRi()]::[SQL]=====>\n"+ sql);  
==============================================================================================================

- 공인인증서 에러 
LG카드(jkh0467) 
에러내용: "72060  서명문에 문제가 있습니다." 
------------------------------------------------------------- 
- 공인인증서 확인 방법 
한국정보인증 홈페이지(http://www.signgate.com) 
--> 개인 --> 인증서 관리(http://www.signgate.com/individual/indi05.htm)   ==========> 
7. PC시간 맞추기(가입자 PC의 시간을 국제 표준시로 다시 설정) 
4. 인증서 보기  --> 선택(새창 뜸)인증서 관리(새창 화면) 
선택된 인증서 정보 --> 인증서 검증(클릭)  ---> "인증서 검증을 성공적으로 완료 했습니다" 
==> 인증서 정상 
--------------------------------------------- 
한국정보인증 김재중 과장 02-360-3157(3114) 
==============================================================================================================

- 롯데카드 무이자 적용 
롯데카드: 2006.10.27 ~ 2006.11.30 (5만원 이상 2~3개월 할부거래) 
==============================================================================================================

- RA 사이트 
ra.i3shop.com  i3103/3174 
==============================================================================================================

- 네이트온 회원가입(아버지 주민번호) 
http://www.nate.com   tamario3/ss*****9 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.28(토) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 13:30 --> 포항행(15시 기차) 

- 쇼핑몰 수정
- 공인인증서 명의변경(/BizMgr/Remittance/PublicCertificate_ChP.jsp)  
log("[/DeliveryMgrBean.java]::[addStoreinRi()]::[SQL]=====>\n"+ sql);  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.30(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 22:00 

- 쇼핑몰 수정
- 공인인증서 명의변경(/BizMgr/Remittance/PublicCertificate_ChP.jsp)  
MIS_PublicCertificateCh 
log("[/DeliveryMgrBean.java]::[addStoreinRi()]::[SQL]=====>\n"+ sql);  
==============================================================================================================

-- 디파트별 전시상품 조회(상품검색 조회)  @@@@@@@@  ---> 쇼핑몰에 전시된 상품  
SELECT A.DEPART1_CD AS DEPART1, E.CATEGORY1_NM, A.DEPART2_CD AS DEPART2, E.CATEGORY2_NM,  
	   A.DEPART3_CD AS DEPART3, E.CATEGORY3_NM, 
	   C.CATEGORY_CD, A.ITEM_CD AS 상품코드, A.ITEM_NM AS 상품명, E.END_DT 
-- SELECT COUNT(*) 
FROM T_ITEM A, T_MERCHANT_ITEM B, T_CATEGORY_ITEM C, T_ITEM_WEB D, T_CATEGORY E 
WHERE B.COMPANY_CD = A.COMPANY_CD 
AND B.ITEM_CD = A.ITEM_CD 
AND B.COMPANY_CD = C.COMPANY_CD 
AND B.ITEM_CD = C.ITEM_CD         
AND B.COMPANY_CD = D.COMPANY_CD(+)         
AND B.ITEM_CD = D.ITEM_CD(+) 
AND B.COMPANY_CD = E.COMPANY_CD         
AND C.STORE_CD = E.STORE_CD 
AND C.CATEGORY_CD = E.CATEGORY_CD    
AND B.COMPANY_CD = '01' 
AND B.MERCHANT_CD = '0001' 
AND B.SALE_STS_CL IN('01','02')  --판매상태구분(01:ACTIVE, 02:PENDING, 03:INACTIVE, 05:DELETE) 
AND A.DEPART1_CD IN ('510', '520', '530', '610')   --DEPART1코드 
--AND A.ITEM_CD = '00165126'      --상품코드 
AND A.USE_YN = 'Y'  --사용여부  
AND E.USE_YN = 'Y'  --사용여부  
AND (E.END_DT IS NULL OR E.END_DT >= TO_CHAR(TO_DATE(SYSDATE),'YYYYMMDD')) --완료일자 
ORDER BY A.DEPART1_CD, A.DEPART2_CD, A.DEPART3_CD, A.ITEM_NM 
--; 
==============================================================================================================

- 정수기 요청 
정수기 프로그램 설치, 사용자 등록 --> 김은수(kes504/dmstn0199) 
==============================================================================================================

- Eclipse 에러 
JNDI 등록 객체호출을 실패했습니다. 
javax.naming.NameNotFoundException: BizStore/MemberSvc not found in Ccdom 
해결책: Eclipse --> 프로젝트(P) --> 모두 빌드(A) Ctr + B  ==> 클릭: 정확히게 모두 빌드 시킬 것 
모두 다시 빌드(L)   ==> 클릭 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.10.31(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:30 ~ 18:30 --> 구조조정 퇴사(총 16명) 

- 쇼핑몰 수정
- 공인인증서 명의변경(/BizMgr/Remittance/PublicCertificate_ChP.jsp) 
==============================================================================================================

- [IT개발팀 회식]
19:00 갈비둥지(수성 경찰서 근처): (강금순 주임, 최현수 사원 송별회) 
20:00 노래방  
23:30 일식집  
24:30 종료(귀가) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■