

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.08.01(화) 작업 ■■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 실적평가시트 하반기 작성 
==============================================================================================================

- 세금계산서 수정 
김옥란    nacasio 7월주문건에대해서  세금계산서 발행요청한건 통합요청한게 모두 7/3일자로 되어있다고  
7월 말일자로 수정해달라고 하십니다.    
발행번호 :  35344763 / 35344762 / 35344761 / 35344760 
-----------------------------------------------------------------------------------------------------------------------------
발행일 --> 여러 건이면 최근 주문번호의 매출일자(20060713, 20060719로 수정했어요) --> (발행일 =  매출일자) 
7월 말일자로 수정 불가능 합니다. 
==============================================================================================================

- 신용카드 점검 
0100012006073100202 
김화숙씨,엘지카드고 금액은 47,100원 4건이에요~ 
--> 우리 쇼핑몰에서 결제 승인 후 데이타 이상으로  
자동 승인취소가 된 것으로 추정 됨 
==============================================================================================================

- 세금계산서 수정 
세금계산서 출력하다가 화면이 안나오더래요 
근데 지금 출력상태이거든요 
35344793            비투엠네트웍스(landmar3) 
답변 바로 해주시겠어요 02-566-2368 
원인: 오즈 출력이 안 됨(출력 방법 안내해 줌) 
==============================================================================================================

- SMS 전송 데이타 추출 
전송구분명: 여름별미 or 보신 특별 할인전(91) 
대상: 최근 3개월내 Dept 130,160 구매자중 최다고객 3000명(매출 순) 
==============================================================================================================

- 근로자우대 확인(2007년 12월 만기) 
국민은행 750056-04-001291 10,000원 
11,710,000원  --> 12,437,715 원(순이자: 727,715 원) 
==============================================================================================================

- 자바 Compile 
./build_T.sh CommonUtil 에러 
CommonUtil.java 에서 
s = s.replaceAll(" ","").trim(); --> 에러남.. 
원인: replaceAll 함수가 자바 jdk1.3 버전에서 안 먹음 

./build_T.sh AHeader 
./build_T.sh AAuthBean 
./build_T.sh AccountAuth 
./build_T.sh SocketManager 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.02(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 --> IT개발실, 이사님과 점심(중국집: 만촌 이마트 근처) 

- 쇼핑몰 수정
- 직원구매 작업 분석 
수기 주문 등록(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=526836 
&p_domain_nm=cini.i3shop.cc&p_mem_id=cini26&p_mem_nm=남명환) 
상품검색(/BizMgr/SaleMgr/WebOrderMgr/inc/searchToDirectOrderItemP.jsp) 
----------------------------------------------------------------------------------------------------------------- 

-- 상품검색 조회 @@@@@@@@ 
SELECT  A.ITEM_CD, A.PV, A.BV, 
(SELECT CODE_NM FROM T_BASECODE WHERE GROUP_ID = 'G155' AND CODE = A.EMONEY_CL) AS EMONEY_CL_NM, 
NVL(A.EMONEY_CL,'00') EMONEY_CL, A.HI_EMONEY, A.EMONEY, A.CMONEY, A.POINT, 
A.ORIGIN_NM, A.BONUS_ITEM_CL, A.UNIT_CD, 
(SELECT CODE_NM FROM T_BASECODE WHERE GROUP_ID = 'G133' AND CODE = A.UNIT_CD) AS UNIT_NM, A.BRAND_NM, 
A.ITEM_SPEC, A.SHIP_PRICE, A.SALE_MAX_QTY,  A.SALE_MIN_QTY, A.CONSUMER_PRICE, 
NVL(D.ITEM_WEB_NM,A.ITEM_NM) AS ITEM_WEB_NM, NVL(D.MODEL_WEB_NM,A.MODEL_NM) AS MODEL_WEB_NM, 
NVL(D.MFG_WEB_NM,A.MFG_NM) AS MFG_WEB_NM, NVL(D.AR_WAY_CD,'03') AS AR_WAY_CD, D.GIFT_NO,  
DECODE(D.GIFT_NO,'','N',(DECODE(D.GIFT_NO,'0','N','Y'))) AS GIFT_YN, C.STORE_CD,   
(SELECT STORE_NM FROM T_STORE WHERE COMPANY_CD = '01' AND STORE_CD = C.STORE_CD) AS STORE_NM, 
C.CATEGORY_CD, B.SALE_PRICE, B.RESELLER_PRICE, B.SHIP_CL_CD, B.SALE_STS_CL, 
B.LIMIT_SALE_YN, B.LIMIT_SALE_QTY, fun_getNewProdYN(B.MERCHANT_CD,B.ITEM_CD) AS NEW_ITEM_YN 
FROM T_ITEM A, T_MERCHANT_ITEM B, T_CATEGORY_ITEM C, T_ITEM_WEB D 
WHERE B.COMPANY_CD = A.COMPANY_CD 
AND B.ITEM_CD = A.ITEM_CD 
AND B.COMPANY_CD = C.COMPANY_CD 
AND B.ITEM_CD = C.ITEM_CD         
AND B.COMPANY_CD = D.COMPANY_CD(+)         
AND B.ITEM_CD = D.ITEM_CD(+)    
AND B.COMPANY_CD = '01' 
AND B.MERCHANT_CD = '0001' 
AND B.SALE_STS_CL IN('01','02')  --판매상태구분(01:ACTIVE, 02:PENDING, 03:INACTIVE, 05:DELETE) 
AND A.ITEM_CD = '00147993'      --상품코드 
AND A.USE_YN = 'Y' 
--; 
==============================================================================================================

- 공인인증서 에러 
아이디: icheon-0 김창식(*) 
-공인인증서 신청 정보 TB 
회원번호: 739568  회원ID: 2000nongyup 
-회원정보 TB 
회원번호: 739568  회원ID: icheon-0 
원인: 공인인증서 신청시 회원ID를 잘못 등록하였거나 회원정보 TB에서 회원ID를 변경 한 것으로 추정됨 
2000nongyup --> icheon-0 
==============================================================================================================

- 선풍기 구입 
웅진 14인치 스탠드 선풍기 WF-1455 
킬러앱 판매가: 18,900원 매입가: 21,700원 옥션 판매가: 27,400원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.03(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 07:00(철야) ---> 7월 마감(마감 당직) 

- 쇼핑몰 수정
- 직원구매 작업 
수기 주문 등록(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=526836 
&p_domain_nm=cini.i3shop.cc&p_mem_id=cini26&p_mem_nm=남명환) 
상품검색(/BizMgr/SaleMgr/WebOrderMgr/inc/searchToDirectOrderItemP.jsp) 
직원구매 신청서  
==============================================================================================================

- 신용카드 에러 
반옥자    2079622   Member 
카드+현금결제를 선택하고 다음 누르면 다음정보를 확인하세요(주민번호 유효성) 이라고 뜬다하세요.  
원인: 노블레스CD 구매시 약관란 밑에 주민번호 넣는 란에 주민번호를 잘못 넣어서 에러가 뜸(결제랑 상관 없음) 
처리: 전화(*)를 해서 설명하니 정상적으로 된다고 하심 
==============================================================================================================

- 빈공간 없애는 함수 
jsp 에서 지원되는 trim() 은 2바이트 공백 처리를 못하더군요. 
str.length() 하면 3 이 나오게 하구 싶은데. 

<%!   //@@@@@@@@@@    빈공간 없애는 함수 @@@@@@@@@ 
public String replace(String s, String old, String replacement)  
{  
int i = s.indexOf(old);  
StringBuffer r = new StringBuffer();  

if (i == -1) return s;  
r.append(s.substring(0,i) + replacement);  

if (i + old.length() < s.length())  
r.append(replace(s.substring(i + old.length(), s.length()),old, replacement));  

return r.toString();  
}  
%> 

String BankName = aBean.getBankName().trim(); 
BankName = replace(BankName, "　", ""); 

http://tamario.i3shop.cc/accauth/accauth.jsp 
==============================================================================================================

- 노블레스CD 구매 에러 
아이디 : c6802   최기한 
------------------------------------------------------------------------------------------------------------------------------

- 공인인증서 에러 
아이디 : hee67 
아이디 : 3435  
----> 위 사람은 명의 변경으로 인하여 정보가 안 맞습니다. 처리 좀 부탁 드리겠습니다. 
==============================================================================================================

- 마감작업(01시에 시작) 
200607 마감 폴더 
100Server  --> 약 30MB --> 신혜씨 꺼 
116Server --> 약 264M --> 신혜씨 꺼 
104Server --> 약 574M 
108Server --> 약 328M      ========> 전체 1.16GB(2개의 alz 파일 생성) 
------------------------------------------------------------------------------------------------------------------------------

- 분할 압축하기 
200606마감 폴더 --> 오른쪽 클릭 --> 알집으로 압축하기(L) --> 
분할 압축: 650MB --> 압축(A) 클릭 --> 200606마감.alz 파일 생성됨 
------------------------------------------------------------------------------------------------------------------------------

- SYSDBA 접속, 서버 종료 
Enterprise Manager Console 에서 일반 --> 로그인  독립적으로 실행(S) 체크 후 확인 --> 콘솔 창에서 
IIISHOP 오른쪽 클릭 -->  접속(C) --> 데이타베이스 접속 정보 
사용자이름(U): sys    암호(P): iiishop   다음으로 접속(A): SYSDBA  확인 누름 --> 
IIISHOP 오른쪽 클릭 -->  종료 --> 즉시 체크 후 확인을 누름 
- SYSDBA 접속, 서버 시작. 
IIISHOP 오른쪽 클릭 -->  시작 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.04(금) 작업 ■■■■■■■■■■■■■■■■
---> 00:00 ~ 12:30 --> 오전 근무(마감 당직) 

- 쇼핑몰 수정
- 직원구매 작업 
수기 주문 등록(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=526836 
&p_domain_nm=cini.i3shop.cc&p_mem_id=cini26&p_mem_nm=남명환) 
상품검색(/BizMgr/SaleMgr/WebOrderMgr/inc/searchToDirectOrderItemP.jsp) 
직원구매 신청서  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.05(토) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 20:00 

- 쇼핑몰 수정
- 직원구매 작업 
수기 주문 등록(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=526836 
&p_domain_nm=cini.i3shop.cc&p_mem_id=cini26&p_mem_nm=남명환) 
상품검색(/BizMgr/SaleMgr/WebOrderMgr/inc/searchToDirectOrderItemP.jsp) 
직원구매 신청서  
==============================================================================================================

- [i3shop 개인 컴퓨터 사양]
모델명: DreamSys TG 
CPU: Intel 팬티엄4 2.6GHz 
메모리: 1,534 Mbyte(1GB) 
HDD 용량: 111.86G Byte(C:40GB, D:80GB) 
CD ROM: 52 배속 
그래픽 카드: RADEON 9200 SERIES 
사운드카드: Sound MAX Intergrated Digital Audio 
네트웍 카드: (Intel(R) PRO/100 VE 
모니터: 현대 칼라 모니터 F910 19 인치 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.07(월) 작업 ■■■■■■■■■■■■■■■■
--> 06:50 ~ 19:00 --> 아제 횟집(19:00 ~ 22:20): 해운정회집(여직원: 현현신) 

- 쇼핑몰 수정
- 직원구매 작업 
수기 주문 등록(/BizMgr/SaleMgr/WebOrderMgr/directOrderCartP.jsp?p_mno=526836 
&p_domain_nm=cini.i3shop.cc&p_mem_id=cini26&p_mem_nm=남명환) 
상품검색(/BizMgr/SaleMgr/WebOrderMgr/inc/searchToDirectOrderItemP.jsp) 
직원구매 신청서  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.08(화) 작업 ■■■■■■■■■■■■■■■■
--> 06:50 ~ 23:00 

- 쇼핑몰 수정
- 안심클릭 인증방식 변경 
http://test.mart.cc/order/KSNET_ver2/KSpayAuth.html 
http://test.mart.cc/order/KSNET_ver1/KSpayAuth.html 

MPI: 카드 번호를 입력 한 후 각 카드사 창을 띄우게 하고 각 카드사 창에서 카드 비밀번호를 입력 
XMPI: 각 카드 번호는 카드사가 제공하는 안심클릭 창에서 입력 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.09(수) 작업 ■■■■■■■■■■■■■■■■
--> 06:50 ~ 23:00 

- 쇼핑몰 수정
- 안심클릭 인증방식 변경 
http://test.mart.cc/order/KSNET_ver2/KSpayAuth.html 
  
- 안심클릭 결제 부분 수정(/order/orderPutP_2_Ansim.jsp) 
1. 이유: 우리 쇼핑몰의 결제 대행사인 (주)케이에스넷부터 금융감독원의 전자금융거래 안전성 강화 대책’에  
따른 변경된 안심클릭 인증절차 변경 요청 공문을 받음 
2. 변경 내용 
 가. 기존: 우리 쇼핑몰에서 카드번호를 넣고 결제를 클릭하면 카드번호 앞자리에서 카드사를 인식하여 
해당 카드사에 맞는 안심클릭 창이 띄움(MPI) 
--> 문제점: 보안에 취안하여 카드번호가 해킹 당할 위험이 있음 
 나. 수정: 우리 쇼핑몰에서 카드사를 선택하고 결제를 클릭하면 카드사가 제공하는 안심클릭 창이 뜨고  
카드번호를 입력(XMPI)  
==> 결제 후 카드번호를 받아서 우리 DB에도 저장 가능 
3. 적용일자: 8월 28일 ~ 31일 
- 현재 로컬에서 테스트 완료(8월 중 적용예정) 
- 2006.09.01(금) 부터 미적용시 결제가 불가할 수 있음 
==============================================================================================================

- 이전 모듈(116번 서버에 세팅) 
http://tamario.i3shop.cc/order/TEST/KSNET_ver1/KSpayAuth.html 
- 변경 모듈 
http://tamario.i3shop.cc/order/TEST/KSNET_ver2/KSpayAuth.html 
==============================================================================================================

- 신용카드 테스트(--> 삭제함) 
0100012006080900375 주문자명: 아이쓰리샵    카드명: 외환카드 
0100012006080900347 주문자명: 아이쓰리샵    카드명: LG카드 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.10(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:00 ~ 18:40 ----> 풋살(자호 회장 당선) 

- 쇼핑몰 수정
- 7월 세금계산서 월발행(발행일: 20060731,   신청일: 20060731) 
T_TAX_BILL: 8,239, T_TAX_BILL_DTL: 92,704 
-------------------------------------------------------------------------------------------- 
-- 발행방식(01:주민번호)  @@@@@@@@ 
1. 주문 발행 
과세: 4,301 비과세: 2,026 
2. 반품 발행 
과세:  356 비과세: 50 
-------------------------------------------------------------------------------------------- 
-- 발행방식(02:사업자번호)  @@@@@@@@  
1. 반품 발행 
과세: 1 비과세: 0 
==============================================================================================================

- 세금계산서 발행 조사 
전자레인지 굴비 세트(업체배송): 00163991  --> 비과세 상품(과세로 잘못 등록) 
과세로 세금계산서 요청한 건 없음 
==============================================================================================================

- SMS 전송 데이타 추출 
최근 5개월내 화장품 구매 회원  --> 4,752 건 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.11(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 7월 세금계산서 월발행(발행일: 20060731,   신청일: 20060731) 
-------------------------------------------------------------------------------------------- 
- SMS 문자 전송 --> 세금계산서발행공지(07)  --> 4,072 건 전송 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 7월 세금계산서가 발행 되어 있습니다.출력가능함"  
==============================================================================================================

- 세금계산서 문의 
박영희(765203)    park111  Member  
20060714, 박영희(배가은), 0100012006071400315, 20060721 
1 - R&F매장 - i3 노블레스 소프트웨어 Ver 2.0+휴대폰() -  - 1299000 - -1 
반품코드  0100012006071400315   환불완료  
반품.환불된건에 대해서도 세금계산서 주민분발행되었다는 sms가 가나요? 
--> 정상 주문하고 반품을 했기 때문에 세금계산서가 발행 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.12(토) 작업 ■■■■■■■■■■■■■■■■
--> 08:50 ~ 20:00 --> 토요 격주 휴무 

- 쇼핑몰 수정
- 웹 보안 강의 듣기 
비밀번호: 101 or 1=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.14(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:00 ~ 19:00 

- 쇼핑몰 수정
- 안심클릭 인증방식 변경 
==============================================================================================================

- 세금계산서 SMS 전송 확인 
고치석 kopo9874(766226)    
--> 본인 탈퇴했는데 세금계산서 SMS 왔다고 항의하세요 
주문: 2006년 07월 14일 
탈퇴일자: 2006년 07월 19일 
세금계산서 전송일자: 2006년 08월 11일 
------------------------------------------------------------------------------------------------------------------ 

--세금계산서 발행 삭제 @@@@@@@@  ----> 회원상태가 정상이 아니면 삭제 
DELETE FROM T_TAX_BILL M 
WHERE M.REPUBLISH_WAY = '01'  --발행방식(01:월발행, 02:요청발행)  
AND M.TAX_YN = 'Y'        --과세여부(Y:과세, N:비과세) 
AND TO_CHAR(M.REQUEST_DT,'YYYYMMDD') = '20060731'    --신청일   
--AND M.MNO = 766226      --회원번호 
AND ROWID > ( SELECT MIN(ROWID) --이전 데이타 삭제 
FROM T_MEMBER B 
WHERE M.MNO = B.MNO 
  AND B.MEM_STS <> '01'  --회원상태코드(01:정상) 
  AND B.HPHONE IS NOT NULL 
) 
--; 
==============================================================================================================

- Sky-HDTV한국형 HDTV수신카드  
http://itempage.auction.co.kr/DetailView.aspx?ItemNo=A056164252 

- 김밥 
http://cook.naver.com/search/recipe.nhn?p_no=1389 

- 전세집 
미래공인(써브) * 
신천4동 귀빈예식장부근 원룸 12평 전2500 심야난방 융자無 8월말~9월초입주가  
==============================================================================================================

- IT개발실 스캔 설정(HP scanjet 5470c) 
http://kin.naver.com/db/detail.php?d1id=1&dir_id=10402&eid=unuNIaIVi25txPod20mv1zf9z6l9fdov&qb=SFAgc2NhbiA1NDAw  
http://h10025.www1.hp.com/ewfrf/wc/softwareCategory?lc=ko&cc=kr&dlc=ko&product=61930&lang=ko& 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.21(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:00 ~ 23:00 

- 쇼핑몰 수정
- SMS전송 데이타 추출 
최근 5개월내 화장품 구매회원 4,000건(리셀러)   
==============================================================================================================

- 정수기 수정 
문경희 - 9679 
배송일을 2005/7/20일로 입력해 주세요. 
==============================================================================================================

- 네트워크 연결 에러 
\\210.123.133.224 연결 실패 
"지정된 네트워크를 더이상 사용할수없습니다." 라는 에러 
"지정된 네트워크 이름을 더이상 사용할수없습니다." 라는 에러 
--------------------------------------------------------------------------------------------------------------- 
개인적으로 대부분 님처럼 해결을 하면 99%는 보입니다. 그런데 네트웍공유에 대한 이야기를 네이버 사이트에서  
답변을 내리고 같이 연구를 해봐도 아무런 이유없이 네트웍공유가 안되는 XP가 한개씩 나옵니다. 
그래서 아무리 레지스터리도 고쳐봐도 뭘해봐도 안될때가 있어요. 
그게 1% 안된다고 표현을 하는 것입다. 
==============================================================================================================

- 동호회 게시판 수정 
http://test.mart.cc/entertain/club/clubBoardListP.jsp?p_bbs_no=50481&p_club_no=50121 
http://test.mart.cc/entertain/club/clubBoardInfoP.jsp 
--------------------------------------------------------------------------------------------------------------- 

-- 동호회 정보 조회 @@@@@@@@@@@@@ 
SELECT /* Mall_ClubSvcBean.java_getClubBoardList()_06053101_(JinTM) */  
M.CLUB_NO, M.BBS_NO, M.BBS_NM, 
M.ACCESS_CD, M.BOARD_NO, M.PBOARD_NO, 
M.DOWNLOAD_CNT, M.READ_CNT, M.REG_ID, 
M.REG_MNO, M.REG_NM, M.ATTACHFILE, 
M.TITLE, M.CONTENTS, M.REG_DT AS REG_DT1, LEVEL 
FROM (SELECT A.CLUB_NO, A.BBS_NO, A.BBS_NM, 
A.ACCESS_CD, B.BOARD_NO, B.PBOARD_NO, B.TITLE, 
B.DOWNLOAD_CNT,B.READ_CNT,B.REG_ID, 
B.REG_MNO, B.REG_NM, B.ATTACHFILE, 
TO_CHAR(B.REG_DT,'YYYYMMDD') REG_DT, B.CONTENTS 
FROM T_CLUBBBS A, T_CLUBBOARD B 
WHERE A.BBS_NO = B.BBS_NO 
AND A.BBS_NO = 794 
AND B.DISPLAY_STS = '01' 
ORDER BY B.REG_DT DESC  
) M 
WHERE M.BBS_NO IS NOT NULL 
CONNECT BY PRIOR BOARD_NO = M.PBOARD_NO 
START WITH M.PBOARD_NO = 0 
--; 
==============================================================================================================

- 도서 
나의 꿈 10억 만들기 
김대중 저  원앤원북스  2003년 07월  
http://www.yes24.com/Goods/FTGoodsView.aspx?goodsNo=372946&CategoryNumber=001001025010004 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.22(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 안심클릭 인증방식 변경 
i3shop 웹스피어 JDK버젼이 jdk 1.3 이여서 KSNET에서 제공하는 최신 JDK버젼(jdk 1.4.1)과  
호환이 안 되어 디버깅하는데 어려움이 있었음. 
(Eclipse(jdk 1.4.1)에서는 정상 실행되는데 실서버(jdk 1.3)에서는 에러가 남) 

KSNET에서 제공된 hagent01.jsp 파일에서 아래 내용 제외 
response.setHeader('cache-control','no-cache');    --> jdk 1.3 에서 버전 문제로 에러 발생 
http://tamario.i3shop.cc/order/TEST/KSNET_ver2/KSpayCreditFormMN.jsp 
http://test.mart.cc/order/TEST/KSNET_ver2/KSpayAuth.html 
==============================================================================================================

- 카드 결제 확인 
임영숙(youngs0603) * 
에러내용: 카드 창에서 1306 에러남 
원인 및 조치: 카드사 문제로 카드사에 문의하라고 통보 
--------------------------------------------------------------------------------------------------- 
- 카드 결제 후 삭제(주문 내역 모두 삭제) 
주문자: 진태만 
0100012006082200066 12,900 BC카드 
0100012006082200063 12,900 LG카드 
==============================================================================================================

- 오즈 레포트 출력 에러(Windows XP용 일 경우) 
박선희(gio123) * 
FAX) 02-6366-7965 
==============================================================================================================

- SMS전송 데이타 추출 
디파트 510, 520, 530, 610 --> 1,500건 
L&B매장 상위 --> 3,500건 
Lnb매장 구매자 3500명(주방,생활 구매자 1500명 포함) 
==============================================================================================================

- Toad 8.0에서 실행계획 에러 
partition table 에 대해 plan 을 실행하면 "ORA-00904 PARTITION_STOP" 에러가 발생합니다. 
메뉴의 View -> Options 에서 좌측을 보시면 "Data Types"라는게 있습니다.  
거기서 우측 보시면 Include Timestamp/Interval  Types (Oracle 9i) 를 체크해주십시오. 
Plan에 대해서는 별다른 조치를 하지 않아도 파티션 테이블에 대한 플랜은 토드에서 잘 떠집니다. 
위와 마찬가지로 View->Options에서 좌측을 보시면  
Oracle -> General 에서.. 우측의 TOAD_PLAN_TABLE 인가를 그냥 PLAN_TABLE로 변경하시면  
별도로 Toad를 위한 Plan_table을 만들지 않아도 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.23(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 안심클릭 인증방식 변경 
LG, 외환, 롯데 카드 실서버 테스트 및 적용 
카드번호 : 4670081699642006 김중호(todagi26) 
안심클릭 패스워드: ho063400 CVC: 718  
--------------------------------------------------------------------------------------------------- 

 - LG카드(큰 매형)  =============> 
카드번호: 9410803255269007(9410 8032 5526 9007) 
홈페이지: kijin00/ta****9 
유효기간: 200902/9597 CVC:891 
640712 - 1703812 
==============================================================================================================

- 정수기 수정 
주문번호 : 20351 수령자 : 이재은 
어제 유상으로 접수를 했었는데요 무상으로 바꿀수 있습니까 
==============================================================================================================

- 이용가능 ID 뒷자리 숫자 체크  
kiss0407    
http://test.mart.cc/customer/freememRegistfP.jsp 
http://test.mart.cc/customer/searchIDP.jsp?p_mem_id=kiss0407 

<script language="javascript"> 
<!--   
function searchID(p_mem_id) { //회원 ID 검색 함수 
p_mem_id = trim(p_mem_id); //회원 ID 
} 
//--> 
</script> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.24(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 18:40 --> 풋살(맥주집(자호, 일남, 태성, 등등) 

- 쇼핑몰 수정
- 찜목록, 장바구니 상세보기 
http://test.mart.cc/cart/cartGetP.jsp?p_cartshow=Y 

cartPut.jsp 에서 
String p_display_cd = request.getParameter("p_display_cd"); //전시유형 
inputHash.put("p_display_cd", p_display_cd); //전시유형  

cartGetP.jsp 에서 
function popStockDetail(p_store_cd, p_category_cd, p_item_cd, p_display_cd) { //상품 상세보기 띄우기(새창) 
var p_url = "/display/prd/prd.jsp?p_store_cd="+ p_store_cd +""; 
p_url += "&p_category_cd="+ p_category_cd +"&p_item_cd="+ p_item_cd +"&p_display_cd="+ p_display_cd; 
window.open(p_url,"open_win1","toolbar=yes,location=yes,directories=yes,status=yes,menubar=yes,scrollbars=yes,resizable=yes, top=10,left=20,width=950,height=800"); 
} 
-------------------------------------------------------------------------------------------------------------------------------

- 건의사항관리 --> 제목: 화면 연결 
다름이 아니라, 상품을 찜하기 하거나 장바구니에 있는 상품을 클릭하면 선택한 상품과 
상세 내용을 다시 볼수 있는 시스템이 되었으면 합니다. 현재는 다시 그 상품을 찾기 위해  
매장을 휘저어야 하는 불편함이 있습니다.  

그리고 하나더... ^^; 상품을 찜하기 하면 찜목록에 추가 되었다는 안내창이 나오잖아요.  
확인 을 눌렀을때 쇼핑하던 창으로 찾아서 돌아갈수 있는 것도 가능하도록 부탁드립니다.  
편리한 쇼핑을 위해 작은 부탁을 드립니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.25(금) 작업 ■■■■■■■■■■■■■■■■
--> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 찜목록, 장바구니 상세보기 
http://test.mart.cc/cart/cartGetP.jsp?p_cartshow=Y 
==============================================================================================================

- 쇼핑몰 DB 문제(원인 모름) 
10:00 ~ 14:30 
==============================================================================================================

- KFA유니폼 티 구입(가격: 6,400원 --> 가격: 3,900원, 배송비: 2,500원) 
http://itempage.auction.co.kr/detailview.aspx?itemno=A057046452&frm=itempage 
- KFA유니폼 세트 ===> 추천상품(총가격: 15,300원 --> 가격: 12,800원, 배송비: 2,500원) 
http://itempage.auction.co.kr/detailview.aspx?itemno=A057046447 
==============================================================================================================

- 동강 래프팅 
1. 동강 래프팅 약도 
[대구출발] 대구금호분기점(중앙) → 제천IC→ 단양,영월방향,외곽전용도로 → 영월→ 동강 톨게이트 →  
동강 톨게이트에서 좌회전 하여 영월 시내방향으로 2.5Km가시면우측에 동강 어라연 들어가는  
작은다리(덕삼교)를 건너서 직진 → 둥글바위→삼옥교 건너서 500m지점 동강농원 한마음래프팅 입니다 
영월역에서 태백, 사북 방면으로 약 3분정도 가면 언덕진 곳의 삼거리가 나옵니다.  
그 곳에서 동강 어라연 방향으로 고객를 넘으면 한마음 래프팅 입니다. 
-------------------------------------------------------------------------------------------------------------------------------
2. 펜션 예약: 한마음래프팅(http://www.betayo.com) 
상호 : 한마음래프팅 / 주소 : 강원도 영월군 영월읍 삼옥 2리 2반 
T) 033-374-2874     T) 033-375-2500     대표: 정낙연(*) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.26(토) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 13:00 

- 쇼핑몰 수정
- 수기등록 수정(통합) 
찜목록, 장바구니 상세보기 를 하기 위해서 전시유형을 추가 해줘야 함 
<input type="hidden" name="p_display_cd" value=""> <!--전시유형 --> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.28(월) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 실적평가시트 하반기 작성 
==============================================================================================================

- SMS전송 데이타 추출 
* 대상 : 최근 3개월내 유아 매장카테고리+i3mart 매장  
            최다고객 2,500명(매출순) 
==============================================================================================================

- 가오리 반지갑 사용 
결제:2006-08-19, 배송:2006-08-22, 사용:2006-08-28 
가격: 24,800원(이마트 가격: 41,200원) 
http://itempage.auction.co.kr/detailview.aspx?ItemNo=A056170704 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.29(화) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 실적평가시트 하반기 작성 
==============================================================================================================

- 동호회 개설신청 수정(/entertain/club/clubRegistfP.jsp) 
에러 내용: Undefined variable: filedistlog 
  new FileDist(filedistlog, fullpathfile, remotePath).start(); 
----------------------------------------------------------------------------------------------------------------------------

해결책: /entertain/club/clubBoardWrite.jsp 파일에 
<jsp:useBean id="filedistlog" class="com.daco.util.FileDistLog" scope="application" /> 추가 
==============================================================================================================

- anypack 하드 USB Device 에러 
USB Device 는 직역하면 USB장치 라는 뜻입니다. 
여기서는 USB로 연결하는 엠피가 되겠지요 
원래모든 장치는  끼우고 나서 드라이브 설치를 해야합니다. 
제조사를 모르면 대략 난감인데 
어떻게든 회사를 알아내셔서 거기에서 2000용 드라이브를 받아 설치해야합니다. 
엠피 사진 올려주시면 갈켜드릴 수도 있습니다. 
XP라도 모르는 제조사 USB자동설치 해주지는 않습니다 
해결: anypak_driver폴더 안의 SETUP.EXE 실행( 안 되면 제거, 제부팅 후 다시 설치) 
----------------------------------------------------------------------------------------------------------------------------
Anypak 2.5" HDD (USB 2.0 구모델) 외장형 하드케이스 
경기도 성남시 상대원동 크란츠테크노빌딩 1503호  ㈜ 유에스비넷 
Tel : 031-745-2345 ---> 2 
Website: www.usbnet.co.kr *@*.* 
==============================================================================================================

- 상품 검색(개인) 
제품명: MG25-테란(USB2.0 외장하드) 업체명: MG텍 
HDD: 80GB(삼성하드 5400RPM/버퍼8MB) 가격: 119,000원 특징: USB메모리처럼 바로 연결 
http://itempage.auction.co.kr/detailview.aspx?itemno=A053855846 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.30(수) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 실적평가시트 하반기 작성 
==============================================================================================================

- 신용카드 결제 확인 
배진은   missdal31   Member  
롯데카드로 노블CD 결제를 하는데 오류난다하십니다.  
무슨오류냐고하니 정확히 모르겠다고하셨구요. 
카드번호 : 4670-0815-4838-7001 롯데 
==============================================================================================================

- 롯데 체크 카드 수령 및 등록(개인) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.08.31(목) 작업 ■■■■■■■■■■■■■■■■
--> 07:20 ~ 18:40 ----> 풋살(몰아지경: 캐논FC) 

- 쇼핑몰 수정
- 인증 및 세션 관리 수정 
==============================================================================================================

- 실행계획(Explain plan) 생성 
1. PLAN_TABLE 생성(SQL문에 대한 분석 결과 저장) 
C:\Oracle\Ora81\RDBMS\ADMIN\utlxplan.sql 
utlxplan.sql 스크립트를 실행하면 PLAN_TABLE이 생성 
또는 Toad에서 바로 PLAN_TABLE이 생성 해도 됨 
create table PLAN_TABLE ( 
statement_id  varchar2(30), 
timestamp     date, 
remarks       varchar2(80), 
operation     varchar2(30), 
options        varchar2(30), 
object_node   varchar2(128), 
object_owner  varchar2(30), 
object_name   varchar2(30), 
object_instance numeric, 
object_type     varchar2(30), 
optimizer       varchar2(255), 
search_columns  number, 
id numeric, 
parent_id numeric, 
position numeric, 
cost numeric, 
cardinality numeric, 
bytes numeric, 
other_tag       varchar2(255), 
partition_start varchar2(255), 
        partition_stop  varchar2(255), 
        partition_id    numeric, 
other long, 
distribution    varchar2(30)); 
3. SQL> EXPLAIN PLAN SET STAEMENT_ID = 'dba'   --사용자의 분석 결과라는 것을 표현 
INOT PLAN_TABLE FOR 
SELECT * FROM BIG_EMP WHERE DEPTNO = 10 
; 
4. SQL> SELECT ID, LPAD(' ', 2*LEVEL)  OPERATION  DECODE(ID 0, 'Cost = '  position id) 
"Operation", options "Options", object_name "Object" 
FROM PLAN_TABLE 
WHERE STATEMENT_ID = 'dba'   --사용자의 분석 결과라는 것을 표현 
CONNETC BY PRIOR ID =  'dba'   
START WITH ID = 0 
ORDERY BY ID 
; 
------------------------------------------------------------------------------------- 

1. PLAN_TABLE 생성(SQL문에 대한 분석 결과 저장) 
Toad에서 바로 PLAN_TABLE이 생성  @@@@@@@2 
create table PLAN_TABLE ( 
statement_id  varchar2(30), 
timestamp     date, 
remarks       varchar2(80), 
operation     varchar2(30), 
options        varchar2(30), 
object_node   varchar2(128), 
object_owner  varchar2(30), 
object_name   varchar2(30), 
object_instance numeric, 
object_type     varchar2(30), 
optimizer       varchar2(255), 
search_columns  number, 
id numeric, 
parent_id numeric, 
position numeric, 
cost numeric, 
cardinality numeric, 
bytes numeric, 
other_tag       varchar2(255), 
partition_start varchar2(255), 
        partition_stop  varchar2(255), 
        partition_id    numeric, 
other long, 
distribution    varchar2(30)); 
2. SET AUTOTRACE ON --한번만 실행하면 SQL문이 실행될 때마다 실행계획 출력 
3. SET AUTOTRACE OFF 
==============================================================================================================

- SQL*TRACE 사용법 
SQL문의 실행계획과 더불어 실행소요 시간과 디스크 및 메모리로부터 읽은 블록 수에 대한 정보도 포함 
1. INIT.ORA 파일에 파라미트 추가로 설정 
MAX_DUMP_FILE_SIZE = 10240    # 파일에 분석 결과가 저장될 떄 최대 크기 
TIMED_STATISTICS = true # 실행 시간에 관련된 통계 정보를 수집 
USER_DUMP_DEST = C:\Oracle\admin\TAMAORA\udump # 분석 결과가 저장되는 디렉토리 경로 
2. 모든 사용자가 실행한 SQL문 결과 분석 
INIT.ORA 파일에서 
SQL_TACE = TURE 또는  
SQL> ALTER SESSION SET SQL_TRACE = TRUE 
; 
3. SQL문 실행 
분석 결과가 저장되는 디렉토리 경로(C:\Oracle\admin\TAMAORA\udump)에 분석 결과 생성됨 
4. SQL문 종료 
SLQ> EXIT 
==============================================================================================================

- TKPROF 사용법 
트레이스 파일이 생성되었으면 TKPROF 유틸리티를 이용하여 개발자가 확인 가능한 텍스트 파일로 전환 
1. TKPROF [트레이스 파일명] [분석 결과 파일명] [옵션] 
C:\Oracle\admin\TAMAORA\udump> TKPROF ORA01428.TRC t01428.tkf sys=no explain=iiishop/iiishop 
t01428.tkf 파일 생성 
==============================================================================================================

- 리눅스에서 파일 찾기 
$ find / -name *.TRC tkf --  *.tkf 
==============================================================================================================

- 세금계산서 수정 
발행번호 35352990 월발행건 취소했다가 다시 재발행했는데 안되는건가요? 
발행취소 --> 재발행 
최주희(juhee5726) 
==============================================================================================================

2006/08/21  은행이체입금  ＬＧ드리미  0  12,500  
------------------------------------------------------------- 

동양CMA 현대CMA 
1,599,432 3,352,533 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■