

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.12.01(금) 작업 ■■■■■■■■■■■■■■■■■
---> 07:50 ~ 21:00 --> 파티마 병원 응급실(기령경 폐렴) 

- 쇼핑몰 수정
- 간편메뉴 
내가 본 상품(/main_tpl/common/inc_Main_Myviewitem.jsp) 
--> 최근 본 상품(/main_tpl/common/inc_Main_MyRecentItem.jsp) 
내가 본 상품(세션 사용) --> 최근 본 상품(쿠키 사용)  
[myViewitemVec][{p_item_cd=00164496, p_item_nm=멜라프리(Mela-free) 90g*2EA, p_store_cd=S063,  
p_sale_price=48000, p_reseller_price=32000, p_category_cd=W51010102, p_display_cd=51}] 

- 쿠키 설정 
C:\Documents and Settings\Administrator\Cookies\administrator@cjmall[2].txt 

- 쇼핑몰에서 오늘 본 상품 출력하는 방법 
http://www.okjsp.pe.kr/seq/68848 

/* 현재 페이지 쿠키 기록 */ 
function setCrmCookie()  
{ 
    var uri_referer = "/index_tab1.jsp"; 
    var query_string = ""; 

    document.cookie = "URI_REFERER=" + uri_referer + "; path=/";  
    document.cookie = "QUERY_STRING=" + query_string + "; path=/"; 
} 
setCrmCookie(); 
==============================================================================================================

- 킬러앱 매장 
카테고리 추가  --> 2006년 3월 6일(실서버 적용일자) 
기존: 식품(U02010101), 비식품(U02010102) 
수정: 가전(U02010101), 마트식품(U02010102), 생활/패션/건강(U02010103),  
식품(U02010104), 마트비식품(U02010105), 화장품(U02010106) 
==============================================================================================================

/* * 쿠키 설정 */ 
setCookie("TODAY_VIEW_ITEM", "<%=p_item_cd%>" , 1); 
alert("[상품상세 javascript]:[test]"); 

function setCookie(name, value, expiredays) 
{ 
alert("[setCookie]:[name]"+ name +"[value]"+ value +"[expiredays]"+ expiredays); 
   var endDate = new Date(); 
   endDate.setDate( endDate.getDate()+ expiredays ); 
   document.cookie = name + "=" + escape( value ) + "; path=/; expires=" + endDate.toGMTString() + ";" 
} 

http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T01070203&p_item_cd=00165255&p_display_cd=01 

setCookie("TODAY_VIEW_ITEM", "00164496" , 1); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.02(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 17:00 --> 일남애 돌잔치 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품(/main_tpl/common/inc_Main_MyRecentItem.jsp) 
http://test.mart.cc/01_TEST/TEST_addCookie.jsp 
http://test.mart.cc/01_TEST/TEST.jsp 
http://test.mart.cc/01_TEST/JSSESSION.jsp 

- 쿠키 설정 
C:\Documents and Settings\Administrator\Cookies\administrator@cjmall[2].txt 

- (J2SE) jdk 1.3.1_07 다운로드 받을 수 있는 곳 
http://java.sun.com/products/archive/j2se/1.3.1_07/index.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.04(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품(/main_tpl/common/inc_Main_MyRecentItem.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/01_TEST/TEST.jsp 
RECENT_VIEW_ITEM 
#00166076,S065,U02010101,51#00164170,S065,U02010106,51 
------------------------------------------------------------------------------------------------------ 
http://test.mart.cc/01_TEST/TEST_setCookie.jsp 
http://test.mart.cc/01_TEST/TEST.jsp 
http://test.mart.cc/01_TEST/TEST_addCookie.jsp 
http://test.mart.cc/01_TEST/TEST_addCookie_51.jsp 
http://test.mart.cc/01_TEST/JSSESSION.jsp 
------------------------------------------------------------------------------------------------------ 
- HashMap 
http://kr.blog.yahoo.com/sdsduck/120  
==============================================================================================================

- 공인인증서 수정 
최미예(my57) 
* 를 * 으로 수정 
신규발급으로 설정 
==============================================================================================================

- 녹즙기 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51&p_item_cd=00166076 
엔유씨전자 080-711-1111 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.05(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/display/com/itemDetaiInfoP.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/01_TEST/TEST.jsp 
RECENT_VIEW_ITEM 
#00166076,S065,U02010101,51#00164170,S065,U02010106,51 
------------------------------------------------------------------------------------------------------ 

- 최근 본 상품 오른쪽 메뉴(/main_tpl/common/inc_Main_MyRecentItem.jsp) 
<%!   
//@@@@@@@@@@   문자 split   함수 @@@@@@@@@ 
public String splitTokenizer(String newString, String gunbunCharacter)  
{ 
StringTokenizer strTemp = new StringTokenizer(newString, gunbunCharacter); //문자 분리 

while (strTemp.hasMoreTokens()) { 
int length = strTemp.countTokens(); //분리된 수 
String[] strs =null; 
strs = new String[length]; 
String p_split_text =""; 

if( length > 0) { //분리된 수가 1개 이상 일때 
for(int j=0; j < length; j++) { 
strs[j] = strTemp.nextToken().trim(); 
   
if( j == 0) { //분리된 수가 1개 일 때 
newString = ""+ strs[j] +""+ p_split_text; 
} else { //분리된 수가 1개 이상 일 때 
newString = ""+ strs[j] +""+ p_split_text; 
} 
} //end of for 
  
} //end of if --> //분리된 수가 1개 이상 일때 
} //end of while  

return newString;  
} 
%>  
==============================================================================================================

- 하이이머니 매장 정렬 수정 
전시순서별 정렬 --> A.DISPLAY_SEQ: 전시순서(T_CATEGORY_ITEM) 
http://test.mart.cc/emoney/itemHiE_ListP.jsp?p_store_cd=S063&p_category_cd=W51000000&p_display_cd=51  
==============================================================================================================

- 공인인증서 수정 
이정근(ljg0518) 회원 번호(771140) 
다시 결제할 수 있도록 초기화 
==============================================================================================================

- 스키여행 
여행사는 '서라벌 관광' 이구요, 
12/9    05:15 까지 법원 건너편 농협 앞에 나오세요. 
요금은 \68,000 인데 동호회 지원금 \20,000 제외 하고 \48,000 을 목요일 까지 이정애 씨 동호회 국민은행  
계좌로 입금 바랍니다.(계좌 번호는 정애씨 한테 문의 바랍니다) 
------------------------------------------------------------------------------------------------------ 
국민은행(이정애) : 045-21-1103-987 
스키장 렌탈비 48,000 원 입금 완료 
------------------------------------------------------------------------------------------------------  
- 서라벌 여행사(http://www.surabul.com) 
버스 당일 운행 코스(http://www.surabul.com/popup/map02.htm) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.06(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:30 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/display/com/itemDetaiInfoP.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/01_TEST/TEST.jsp 
RECENT_VIEW_ITEM 
#00166076,S065,U02010101,51#00164170,S065,U02010106,51 
==============================================================================================================

- 정수기 수정 
오류데이터 수정요청-20061206.xls 처리 
==============================================================================================================

- 신용카드 점검 
권태형(kwon3001) 
결제에러: 미등록 가맹점(신한카드) 538만원 
개인카드 문제로 추정됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.07(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:40 --> 풋살(비, 2시간 풋살, 일남이한테 스키복 대여) 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/display/com/itemDetaiInfoP.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/main_tpl/common/pop_MyRecentItemP.jsp 

RECENT_VIEW_ITEM 
#00166076,S065,U02010101,51#00164170,S065,U02010106,51 
==============================================================================================================

- 하이이머니 매장 정렬 수정 실서버 적용 
전시순서별 정렬 --> A.DISPLAY_SEQ: 전시순서(T_CATEGORY_ITEM) 
http://tamario.i3shop.cc/emoney/itemHiE_ListP.jsp?p_store_cd=S063&p_category_cd=W51000000&p_display_cd=51  
==============================================================================================================

- DEPEND 설치법 
C 드라이브(C:\)에서 Pacakge.zip 압축을 푼 후 DEPEND.exe 더블 클릭하면 설치 됩니다. 
==============================================================================================================

- 신용카드 점검  
결제에러: 미등록 가맹점(신한카드) 538만원 
원인: 신규 카드여서 신용카드BIN 정보 테이블(T_CARD_BIN)에 미 존재 
조치:신용카드BIN 정보 테이블(T_CARD_BIN)에 저장  
------------------------------------------------------------- 
권태형(kwon3001)   
신한카드: 3779 8220 1045 642(377982201045642) 
이영혜 PM(pretty8) *   
------------------------------------------------------------- 
-- 신용카드BIN 정보 정보 저장  @@@@@@@@@@@@@  
-- INSERT INTO T_CARD_BIN 
(CARD_BIN, CARD_NM, MEMO_DESC, USE_YN,     
 USE_DT, REG_ID,  REG_DT 
) 
VALUES ('37798', 'SHINHANcard', '신한카드_NEW', 'Y', 
    '20061207', 'admin(vb)', SYSDATE 
   ) 
--; 
==============================================================================================================

- 주문 에러 
장병하    izlme    무료회원 
아토팜 65g + 뮤지컬 기차 + 진동으로가는 무당벌레  
-> 이상품들 주문중 아래와 같은 메세지가 나옵니다.. 
[에러코드] : A2G [에러메세지] : [2006120715 2555 0833]시스템 에러입니다. 관리자에게 문의하십시오.  
------------------------------------------------------------------------------------ 
원인: EC팀에서 상품등록시 L&B매장 "NEW 치코 완구류" 카테고리에서 카테고리코드명이 길게 등록해서 에러가 남  
조치: EC팀에서 카테고리명 수정 후 정상 결제 됨 
카테고리코드: T07120607 
상품코드: 00165583  
L&B매장   카테고리코드명: <b>NEW 치코 완구류</b> <font color=red>30%할인</font>  ---> 에러남 
기획매장  카테고리코드명: 장난감  ---> 정상 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.08(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 04:00 --> 철야 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/display/com/itemDetaiInfoP.jsp) 
최근 본 상품 전체보기(/display/com/pop_MyRecentItemP.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/main_tpl/common/pop_MyRecentItemP.jsp 

<!-- // 최근 본 상품 쿠키 설정  //--> 
<%@ include file="/main_tpl/common/inc_Setcookie.jsp" %>  
==============================================================================================================

- 관리비 송금(월 3만원 선납) 
대구은행: 021-13-125692 예금주: 손정수 
의뢰인: 리베라302_12월관리비(12.13 ~ 01.12) 
==============================================================================================================

- 휴대폰  
장애인(장애인 복지카드 앞뒤 사본): 가입비 무료, 전화료 약 30%DC 
LP4500 
http://itempage.auction.co.kr/DetailView.aspx?ItemNo=A071251457&frm2=through 
LP4300  
http://itempage.auction.co.kr/DetailView.aspx?ItemNo=A071253334&frm2=through 

http://itempage.auction.co.kr/DetailView.aspx?ItemNo=A071176503&frm2=through 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.11(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/display/com/itemDetaiInfoP.jsp) 
최근 본 상품 전체보기(/display/com/pop_MyRecentItemP.jsp) 
상품 중복, 진열 순서 
http://test.mart.cc/main_tpl/common/pop_MyRecentItemP.jsp 

 <!-- // 최근 본 상품 쿠키 설정  //--> 
<%@ include file="/main_tpl/common/inc_Setcookie.jsp" %>  
==============================================================================================================

- 테스트 서버 
테스트 웹 서버: 210.123.133.254(i3shop/i3shop1170506) 
테스트 DB 서버: 210.123.133.224(SID: ORCL, IIISHOP/IIISHP) 
자바버전: JAVA 1.3.1 
==============================================================================================================

- 11월 세금계산서 월발행(발행일: 20061130,   신청일: 20061130) 
T_TAX_BILL: 34,399, T_TAX_BILL_DTL: 378,928 
--------------------------------------------------------------------------------- 
--발행방식(01:주민번호)  
1. 주문 발행 
과세: 3,709 비과세: 1,500 
2. 반품 발행 
과세: 337 비과세: 17  
--------------------------------------------------------------------------------- 
- 11월 세금계산서 월발행 
- SMS 문자 전송 --> 세금계산서발행공지(07)  --> 3,198 건 전송 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 11월 세금계산서가 발행 되어 있습니다.출력가능함"   
==============================================================================================================

- 배송완료 처리 
자인물류에서 택배출고가 아닌 용차 배송으로 배송완료 처리 안 됨 
배송중 --> 배송완료 
--------------------------------------------------------------------------------- 
--주문정보 정보 수정 @@@@@@@@   --> 42 건 처리 
-- UPDATE T_ORDER U 
SET U.ORDER_STS = '09'  --주문상태(01:주문접수, 03:결제완료, 04:배송중, 09:배송완료) 
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_ORDER_SHIP_DONE B 
WHERE U.COMPANY_CD = B.COMPANY_CD 
AND U.MERCHANT_CD = B.MERCHANT_CD 
AND U.ORDER_DT = B.ORDER_DT 
AND U.ORDER_NO = B.ORDER_NO 
AND U.ORDER_STS = '04'    --주문상태(01:주문접수, 03:결제완료, 04:배송중, 09:배송완료) 
  )   
  AND U.ORDER_DT >= '20051220'  --주문일자 
  AND U.ORDER_DT <= '20061117' 
  AND U.ORDER_STS = '04'    --주문상태 
--;    
--==============================================================================================================

--주문상세 정보 수정 @@@@@@@@   --> 55,147 건 처리 
-- UPDATE T_ORDER_DTL U 
SET U.SHIP_STS = '09'    --배송상태(01:주문접수, 06:배송중, 09:배송완료) 
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_ORDER_SHIP_DONE B 
WHERE U.COMPANY_CD = B.COMPANY_CD 
AND U.MERCHANT_CD = B.MERCHANT_CD 
AND U.ORDER_DT = B.ORDER_DT 
AND U.ORDER_NO = B.ORDER_NO 
AND U.SHIP_STS = '06'    --배송상태(01:주문접수, 06:배송중, 09:배송완료) 
  )   
  AND U.ORDER_DT >= '20051220'  --주문일자 
  AND U.ORDER_DT <= '20061117' 
  AND U.SHIP_STS = '06'    --배송상태(01:주문접수, 06:배송중, 09:배송완료) 
--;   
--==============================================================================================================

- BC카드 한도 수정 
전승호(ho82) 
신청자: 김인숙 PM: *  
0100012006120400904 
0100012006120400938 
--==============================================================================================================

- 세금계산서 수정 
강동화  tittat  Master 
20061124, 강동화, 0100012006112400316, 20061204  144000  
0100012006112400316 --> 0100012006120400316로 수정(추후 정정 요망)  ==> 정상 수정 함 
발행일자: 20061204로 수정 했어요.(발행번호: 35378037)  
==============================================================================================================

- 신용카드 확인 
KS NET 측에서 12월 11일 17시 17분 회전 장애로 인해 주문번호: 2006121100438를 정상 결제로 
처리함(i3shop에서 승인 실패: 잠시후재시도    1003-PS1-1T-) 
KS NET 직원이 전화해서 확인 요청(최식: *) --> 결제 취소하라고 함 
고명자(ko42) 
==============================================================================================================

- 창맥 동기회 
일시: 2006.12.16(토)  20시 
인원: 일현, 현노, 상진, 순란, 현구 
해운정 횟집 T:053)745-1288 
MBC방송국에서 GS카드 충전소 삼거리에서 2군 사령부 방향으로 가다가 동원 초등학교 4거리 
해운정 횟집 T)745-1288 
==============================================================================================================

- [2006년 스키 여행] 휘닉스파크 
http://blog.daum.net/_blog/ArticleCateList.do?blogid=08FXO&CATEGORYID=284466&dispkind=  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.12(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:00 

- 쇼핑몰 수정
- 간편메뉴 
최근 본 상품 쿠키 설정(/main_tpl/common/inc_Setcookie.jsp) 
상품 중복, 진열 순서 
------------------------------------------------------------------------------------------ 

- 간편메뉴 
간편 장바구니 
http://www.cjmall.com/widzet/cart.jsp?cust_no=" + cust_no + "&time=" + time 
http://www.cjmall.com/widzet/cart.jsp?cust_no=200501102284&time=20061212204700 
http://www.cjmall.com/widzet/order_list.jsp?cust_no=200501102284  
==============================================================================================================

- 테스트 서버 
테스트 웹 서버: 210.123.133.254(i3shop/i3shop1170506) 
테스트 DB 서버: 210.123.133.224(SID:ORCL, IIISHOP/IIISHP) 
자바버전: JAVA 1.3.1 
==============================================================================================================

#---  테스트 DB서버 TNS 연결 DB 환경( iiishop / iiishop)  ========================== 
ORCL = 
  (DESCRIPTION = 
    (ADDRESS_LIST = 
      (ADDRESS = (PROTOCOL = TCP)(HOST = 210.123.133.224)(PORT = 1521)) 
    ) 
    (CONNECT_DATA = 
      (SERVICE_NAME = ORCL) 
    ) 
  )  
#--- ===============================================================================  

- TAMA 개인 컴퓨터(i3shop) 
IP:  210.123.133.31 
SN: 255.255.255.0 
GW: 210.123.133.1 
DNS: 168.126.63.1 
==============================================================================================================

- 정수기 작업 
주문이관 처리 주문번호: 0100012006121200147   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.13(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
간편 장바구니 
http://www.cjmall.com/widzet/cart.jsp?cust_no=" + cust_no + "&time=" + time 
http://www.cjmall.com/widzet/cart.jsp?cust_no=200501102284&time=20061212204700 //XML 소스 받아오기(장바구니) 
http://www.cjmall.com/widzet/order_list.jsp?cust_no=200501102284 

- 플래쉬 디버깅 
trace ("[cart_XML.onLoad = function]:[_l2]"+ _l2);  
http://test.mart.cc/main_tpl/common/inc_flash/flash_cartP.jsp 
http://tamario.i3shop.cc/main_tpl/common/inc_flash/flash_cartP.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.14(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:50 --> 풋살(동규차: 이마트 베이비 파우더 반품) 

- 쇼핑몰 수정
- 간편메뉴 
간편 주문배송 조회 --> flash_orderP.jsp에서 XML 내용을 못 불러 옴 
[cart_XML.onLoad = function]:[xml_list3]:[_root.orderArray0] 0 
http://tamario.i3shop.cc/main_tpl/common/inc_flash/flash_orderP.jsp 
http://test.mart.cc/main_tpl/common/inc_flash/flash_orderP.jsp 
==============================================================================================================

- XML문제 
rss.php 에서 xml 을 작성하고 플래시에 직접 xml 문자열을 뿌려주는 것이고요..Xml.load("rss.php") 하시면 불러와집니다. 
그러면..플래시에서는 XMLDOM 이 생성되는 것이교.. 플래시의 XML 클래스 메소드를 사용하셔서 만지시면 되겠습니다...  
xml은 문자열입니다...http도 text base 고요....xml 문자열이 전해지는 것이죠..그걸 파싱하기위해..xml parser가 있는 것이고요.. 

xml파일을 불러와서 사용할 수 있습니다. 파싱을 자체적으로 합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.15(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
간편 장바구니(http://test.mart.cc/main_tpl/common/inc_flash/flash_cartP.jsp) 
원인: XML에서는 세션이 안 먹음 
대책: DB나 쿠키를 사용해서 넘김 
간편 주문배송조회(http://test.mart.cc/main_tpl/common/inc_flash/flash_orderP.jsp)  
==============================================================================================================

- 세금계산서 수정  
김오곤(kog26)    Active-Master 
발행번호 : 35377958   / 품목 : 백설 쇠고기 다시다 1kg 외 로 수정부탁드립니다. 
0100012006111300624 2 00158529 (K)미쟝센 펄샤이닝 샴푸기획  ---> 
0100012006111000675 134  00158529 (K)백설?쇠고기?다시다?1kg 로 임시 수정  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.19(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 22:30 --> i3shop 빌딩 무인경비 시스템 운용 

- 쇼핑몰 수정
- 간편메뉴 
간편 장바구니(http://test.mart.cc/main_tpl/common/inc_flash/flash_cartP.jsp) 
원인: XML에서는 세션이 안 먹음 
대책: DB나 쿠키를 사용해서 넘김 
간편 주문배송조회(http://test.mart.cc/main_tpl/common/inc_flash/flash_orderP.jsp) 

System.useCodepage = true; //한글깨짐 방지코드 --> 안 먹음 
==============================================================================================================

- 연말정산 필요 서류 
호적 등본(부모님 이름 같이 등록되어 있는 것) 
2007년 1월 6일까지 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.20(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 --> 플래쉬 없이 jsp만 다시 구성 
간편 장바구니(http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_easyCartP.jsp)  
간편 주문배송조회(http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_easyOrderP.jsp)  
==============================================================================================================

- 팝업 링크를 누루면 팝업은 없어지고 부모창에서 링크로 이동하는 소스 
(창닫기 -> URL 이동) 
<script language="JavaScript" type="text/JavaScript"> 
<!-- 
function linkToOpener(URL) { 
	if (window.opener && !window.opener.closed) 
	window.opener.location = URL; 
	window.close(); 
} 
//--> 
</script>  

<a href="javascript:linkToOpener('/cart/cartGetP.jsp?p_cartshow=Y');"> 
[전체 장바구니 이동]</a> 
-------------------------------------------------------------------------------------------- 
- 창닫기 클릭 
<a href="JavaScript:window.close();" target="_self">[자신 창닫기]</a> 
==============================================================================================================

- 세금계산서 수정 
--> 수정 전 ==> 발행일자(주문일자=작성일자) 
string writen_dt_year;  //작성일자(년) 
writen_dt_year =  (string)#BILL_DTL.ORDER_YEAR#;  //작성일자(년)  
setattr("caption",writen_dt_year); 

--> 수정(substr 함수 사용)  ==> 발행일자(작성일자=결제일자 = 마감일자) 
(taxBill.xml, taxBill_noTax.xml 파일 수정) 
global string republish_dt ;  //발행일자_13 
::republish_dt = #OZParam.republish_dt#;  //발행일자_13 

string writen_dt_year;  //작성일자(년) 
writen_dt_year = (string)substr((string)::republish_dt,0,4);   //작성일자(년) 
setattr("caption",writen_dt_year); 
string writen_dt_month;  //작성일자(월) 
writen_dt_month = (string)substr((string)::republish_dt,4,2);   //작성일자(월) 
setattr("caption",writen_dt_month); 
string writen_dt_day;  //작성일자(일) 
writen_dt_day = (string)substr((string)::republish_dt,6,2);   //작성일자(일) 
setattr("caption",writen_dt_day); 
---------------------------------------------------------------------------- 

--매출일자가 주문일자 보다 적은 것 조회 
SELECT MAX(A.SELLING_DT) AS 매출일자, MAX(A.ORDER_DT) AS 주문일자  --//매출일자 
FROM T_ORDER A 
WHERE (A.COMPANY_CD, A.MERCHANT_CD, A.ORDER_DT, A.ORDER_NO) IN  
(  
SELECT MAX(COMPANY_CD), MAX(MERCHANT_CD), ORDER_DT,  ORDER_NO   
FROM T_TAX_BILL_DTL 
WHERE ORDER_DT >= '20060901'   
--WHERE PUBLIC_NO = '35377984'  --발행번호  
GROUP BY ORDER_DT, ORDER_NO 
) 
HAVING  MAX(A.SELLING_DT) < MAX(A.ORDER_DT)    
-- HAVING  MAX(A.SELLING_DT) >= MAX(A.ORDER_DT) 
==============================================================================================================

- 우편번호 점검(우체국 기준) 
http://service.epost.go.kr/zipcode/search/search1.jsp 
인천시 서구 불로동 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.21(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30 --> IT개발실 송년회 

- 쇼핑몰 수정
- 간편메뉴 
간편 주문배송조회(http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_easyOrderP.jsp) 
http://tamario.i3shop.cc/main_tpl/common/easyMenu_RecentStock/pop_easyOrderP.jsp 
  
<%!  
    public static String change2Seats(int oldString)  //일자 2자리수 만들기 함수 
    {  
	String strLine = ""; 
        if (oldString<10) { 
		strLine = "0" + oldString; 
	} else { 
		strLine = ""+ oldString; 
	} 
	return strLine; 
    } 
//----------------------------------------------------------> 
%>  
String cmonth_test = 6; 
String p_month_str_test = change2Seats(cmonth_test); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.22(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 간편메뉴 
간편 장바구니(http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_easyCartP.jsp) 
간편 주문배송조회(http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_easyOrderP.jsp) 
최근 본 상품 전체보기(/display/com/pop_MyRecentItemP.jsp) 
http://test.mart.cc/main_tpl/common/easyMenu_RecentStock/pop_MyRecentItemP.jsp 

http://tamario.i3shop.cc/indexMain_90.jsp 
==============================================================================================================

- 형변환 
올림 -->  myVar = Math.ceil(20.35); -> 21 
내림 --> myVar = Math.floor(19.99); -> 19 
반올림 --> myVar = Math.round(2.13);   -> 2 
-- double d_total_page = Math.ceil((double)intCartCnt/(double)ip_pagerow);  //전체 페이지수 
(int)i_total_page = (int)Math.ceil((double)intCartCnt/(double)ip_pagerow);  //전체 페이지수 
int ip_pagerow = util.parseInt(p_pagerow); //페이지당 로우수 
==============================================================================================================

조의재 대리 컴퓨터(예비 서버) 
IP: 211.33.193.168 --> pwd: i3shop2006 
------------------------------------------------------------------------------------------- - 
백환일 대리 컴퓨터(예비 서버) 
IP: 211.33.193.151 --> pwd: i3shop2006 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.23(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 

- 쇼핑몰 수정
- 고객상품평 보기(/display/com/UsePSInfoP.jsp) 
- 고객상품평 쓰기(/display/com/UsePSP.jsp?p_store_cd=S001&p_category_cd=T01070104&p_item_cd=00166004&p_display_cd=01) 
- 상품평관리(/BizMgr/ItemWebMgr/itemUsePsP.jsp): 추후 수정 
http://test.mart.cc/display/com/UsePSP.jsp?p_store_cd=S001&p_category_cd=T01070104&p_item_cd=00166004&p_display_cd=01 
http://test.mart.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T01070104&p_item_cd=00166004&p_display_cd=01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.26(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 22:00 

- 재고조사 점검
   1. 내용 
  가. 판매분 상품 데이타 등록 
  나. 매출 데이타 등록(매출 원가 RnF, 매출 매가 RnF, 매출 원가 LnB, 매출 매가 LnB 
매출 원가 Hi-E, 매출 매가 Hi-E) 
  다. 재고 쉬트지 작성 프로그램 점검(PDA, i3shop_JaegoSearch 프로그램 점검) 
  라. 재고조사 프로그램으로 테스트 재고조사 실시 및 점검 
  마. 실 재고조사 실시(2006년 12월 29일) 
  바. 재고조사 편차 재고 검증 및 이상 원인 파악 
  사. 재고조사 요약보고서 검증 
==============================================================================================================

- PDA 1대 고장 
1) 구성요소를 찾을 수 없습니다.  
해결책: PDA 뒷부분 맨위 랜카드 넣는 부분의 나사를 풀어서 랜카드를 다시 끼움 
2) 클립을 사용하여 리셋 
PDA 장비 뒷부분 RESET이라고 적힌 글자 앞 구멍에 클립을 집어 넣어 리셋 시킴 
(정상적으로 화면을 안 뜨서 OS 포맷이 불가능 할 때) 
==============================================================================================================

- 신용카드 수정 
BC카드 ID당 300만원 한도 수정(/BCcard_Hando.jsp, /BCcard_Hando.jsp) 
--> 500만원으로 수정(현재 500만원 초과 ID 4건) 
==============================================================================================================

- 정수기 수정 
오류데이터 수정요청-20061226.xls 파일 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.27(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 재고조사 점검
1. 내용 
  가. 판매분 상품 데이타 등록 
  나. 매출 데이타 등록(매출 원가 RnF, 매출 매가 RnF, 매출 원가 LnB, 매출 매가 LnB 매출 원가 Hi-E, 매출 매가 Hi-E) 
  다. 재고 쉬트지 작성 프로그램 점검(PDA, i3shop_JaegoSearch 프로그램 점검) 
  라. 재고조사 프로그램으로 테스트 재고조사 실시 및 점검 
  마. 실 재고조사 실시(2006년 12월 29일) 
  바. 재고조사 편차 재고 검증 및 이상 원인 파악 
  사. 재고조사 요약보고서 검증  
==============================================================================================================

- 하이 이머니 수정(쇼핑몰 하이 이머니 전시) 
기존: T_ITEM 테이블의 EMONEY_CL(E머니상품구분)으로 HI-E머니 구분(00:일반E머니, 01:HI-E머니, 02:킬러앱) 
상품 등록시에 여전히 MONEY_CL(E머니상품구분)가 살아 있음 
수정: T_CATEGORY 테이블의 CATEGORY_CD로 HI-E머니 구분 
수정일: 2006.07.21(금) 
W51010101: 건강기능식품, W51010102: 1차식품/가공식품, W51010103: 냉동식품/추출음료 
W51020101: 화장품, W51020201: 퍼스널케어, W51020401: 패션 W51020301: 생활용품/세제 
==============================================================================================================

- 주문 내역 점검 
신용카드 결제(정상 승인) --> 결제 에러: ORDER_STS = '00'(결제 에러) --> 회계팀에서 카드 취소  
--> 현금 입금 완료를 누군가 건드림: ORDER_STS = '03'(결제완료)  --> 출고정보(T_STOREOUT) 미 존재  --> 
수당마감 수행  --> 영업마감 미 수행(마감일자 미존재) 
주문번호: 0100012006120700067 
==============================================================================================================

- 후남이 형부: 현대차 안병서(*) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.28(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:40 --> 풋살(유니폼 지급) 

- 재고조사 점검
- 재고조사 프로그램으로 테스트 재고조사 실시 및 점검  
T_STOCK_INQUIRY_BK 테이블에 존재     실사일자: 20061228(재고 조사 하루 전) 
==============================================================================================================

/CartBean.java 에서 
public Hashtable makeOrderMasterValue(HttpServletRequest req) throws Err { 
Hashtable ordHash = getOrdInfoHash(); //지금까지 입력된 주문정보에 합침 

try { 
/주문번호 --> 주문을 딴 이후에 채움 
//주문발생상세유형코드(일반(01) 혹은 R&F(02)) 
if (getOrderCrtDtlTp()==null  getOrderCrtDtlTp().equals("")) { 
_errflag = true; 
_errstr += " [주문발생상세유형] " ; 
} else { 
ordHash.put("p_order_dtl_tp_cd",getOrderCrtDtlTp()); 
} 
} 
} 
------------------------------------------------------------------------------------------------------------------------- 
- 주문발생상세유형코드(일반(01) 혹은 R&F(02)) 
getOrderCrtDtlTp() 
p_order_dtl_tp_cd  ==> 02로 설정 
==============================================================================================================

- 연말정산 자료 팩스 신청(전화ARS로 자동 신청) 
대한생명: 1588-6363 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.26(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 01:00 --> 2006년 하반기 재고조사 

- 재고조사 점검
1. 내용 
  가. 판매분 상품 데이타 등록 
  나. 매출 데이타 등록(매출 원가 RnF, 매출 매가 RnF, 매출 원가 LnB, 매출 매가 LnB 
매출 원가 Hi-E, 매출 매가 Hi-E) 
  다. 재고 쉬트지 작성 프로그램 점검(PDA, i3shop_JaegoSearch 프로그램 점검) 
  라. 재고조사 프로그램으로 테스트 재고조사 실시 및 점검 
  마. 실 재고조사 실시(2006년 12월 29일) 
  바. 재고조사 편차 재고 검증 및 이상 원인 파악 
  사. 재고조사 요약보고서 검증 
------------------------------------------------------------------------------ 

1. IP변경: 211.33.193.133 
2. 매출 데이타 등록(당일 분: 20061229) 
3. 수불장 돌리기(18:34 ~ 53   ==> 19분 소요) 
상품코드: 00152565(재고조정된 상품 확인 --> 재고조정이 안 돔 --> 다시 돌림) 
4. 전산 입력자 점코드 변경(자인물류점)  
임미옥(mo7494),  피은지(beauty), 김정순(000221) 
5. 재고 실사(20시 ~ 22시) 
1차 재고편차: 7,716,531(편차원가 총합)  ==> 카운팅 에러, 로케이션 잘못 등록 
2차 재고편차: -37,135(편차원가 총합) 
3차 재고편차: -210,635(편차원가 총합) 
6. 재고 편차 조회(총합) 엑셀 출력 만듬 
04. 재고 편차 조회(총합).xls 
7. 전산 입력자 점코드 변경(온라인점점)  
임미옥(mo7494),  피은지(beauty) 
8. 재고 조사 종료(01시) 
----------------------------------------------------------------------------- 

- 재고조정승인일자 수정 
재고 조정 2차승인(/BizMgr/ItemStockMgr/stockAdjustApp2P.jsp) 
- T_STOCK_ADJUST 테이블에서 2차승인일자(APPROVAL2_DT) 저장시 
2차승인일자가 존재하면 등록 못 하도록 수정할 것 
(수불장 돌릴 때 수불일자가 요청일보다 크거나 같으면 수불일자 데이타를  
모두 지우고 다시 등록함) 
- T_STOCK_ADJUST 테이블에서 2차승인일자(APPROVAL2_DT)가  
현재일(TO_CHAR(TO_DATE(SYSDATE),'YYYYMMDD'))이 되도록 수정 
(실제 재고조정일자 = 2차승인일자) 
-------------------------------------------------------------------------------------- 

- 재고조사 검증 작업 1 
재고 편차 조회 (/BizMgr/ItemStockMgr/stockInquiryStatDeclinP.jsp)에서 
편차금액 총합계 
LnB원가 + RnF원가 = (stockInquirySummary_Report.xml에서 편재 존재 품목 총합) 
(-19,613) + (-12,100) = -31,713 
==============================================================================================================

- 배송완료 처리(배송완료 처리요청(06_12.29).xls) 
자인물류에서 택배출고가 아닌 용차 배송으로 배송완료 처리 안 됨 
배송중 --> 배송완료 
--------------------------------------------------------------- 
-- 주문정보 정보 수정 @@@@@@@@   --> 47 건 처리 
-- UPDATE T_ORDER U 
SET U.ORDER_STS = '09'  --주문상태(01:주문접수, 03:결제완료, 04:배송중, 09:배송완료) 
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_ORDER_SHIP_DONE B 
WHERE U.COMPANY_CD = B.COMPANY_CD 
AND U.MERCHANT_CD = B.MERCHANT_CD 
AND U.ORDER_DT = B.ORDER_DT 
AND U.ORDER_NO = B.ORDER_NO 
AND B.ORDER_STS = '04'    --주문상태(01:주문접수, 03:결제완료, 04:배송중, 09:배송완료) 
AND U.ORDER_STS = '04'    --주문상태(01:주문접수, 03:결제완료, 04:배송중, 09:배송완료) 
  )   
  AND U.ORDER_DT >= '20061101'  --주문일자 
  AND U.ORDER_DT <= '20061230' 
  AND U.ORDER_STS = '04'    --주문상태 
--; 
==============================================================================================================

- 연말정산 자료 제출 
총무팀에 2006년 근로소득자소득공제신고서.doc 양식 및 관련 서류 제출 
==============================================================================================================

- 생선뼈 목에 걸림 
1. 먼저 물마시고 
2. 밥에다 김치를 먹습니다. 
3. 병원가서 빼셔야 할듯합니다 
--> 야간에 통닭, 피자를 많이 먹으니 내려감 
==============================================================================================================

주문번호 [010001-2006122900096]의 주문내역입니다 
판매가격: 45,200원 
우리은행 가상계좌: 216628-19-318821로 
46,800원(46,500원 + 300원 2번 입금) 
차감액: 1,600 원을 우리은행 가상계좌 환불 해주시면 감사하겠어요. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.12.30(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00 

- 쇼핑몰 수정
- 신용카드 무이자 상세보기 
무이자 자동 설정(/common/inc_SetDate.jsp) 
LG : 전매장(3개월만) 
BC, 롯데 : 전매장(2, 3개월) 
KB카드: 제외 
==============================================================================================================

- 손, 귀 무좀균 치료 
세브란스 연합의원(봉화약국 2층): T)745-7588 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■