  

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+---------------------------------------------// Memo(2011.03) //----------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á


¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.01(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30  --> »ïÀÏÀý(°øÈÞÀÏ) 

- SFR
07:30 ±â»ó(ºñ¿Í¼­ Ãà±¸ÇÏ·¯ ¸ø °¨) 
08:30 Áý Ãâ¹ß 
08:50 Super Fast-Reading ÇÐ¿ø µµÂø 
09:00 ÈÆ·Ã(ÀÌ»è, ½Âºó°¡Á·, ÀÌÁ¤¼÷´Ô, À±Á¤ÀÚ¸Å, ½ÅÀÔ 3¸í) 
- ¹®Á¦Á¡ ÁöÀû: °æÁ÷, ´« ±ôºý°Å¸², ÀÔÅ» ¾ÈµÊ, ÃÊÁ¡ »ê¸¸, ´« ³»·Á±ô 
12:00 Áß½Ä  
13:00 µ¶¹ý ÈÆ·Ã ==> ¸ñ»ç´ÔÀÌ ¸ñÀÌ ¾ÈÁÁ¾Æ ÀÏÂï ¸¶Ä§  
15:30 Á¾·á 
16:30 ±Í°¡ 
00:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.02(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:45 ~ 18:30  -->  ¾ÆÄ§ ´ç¹ø, CSÈ¸ÀÇ, ÁÖ°£º¸°í¼­ ÀÛ¼º 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. ³³ÀÔÇöÈ²(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS Àü¼Û: http://thome.hi.co.kr/7color/sms_test.jsp  
3. °³¹ß ´ã´çÀÚ: ÀÌÅÂÈ£ »ç¿ø T)721-0313  ===> »ó ´çÇØ¼­ ±Ý¿äÀÏ Ãâ±Ù 
1) °³¹ßÆÀ À¯ÈñÁ¤ ÆÀÀå T)721-0306 --> * ÃÖÁ¾ÇÊ ´ëÀÎ/´ë¹° 1°Ç  ==> 17Ãþ¿¡ ¿Í¼­ ³­¸®Ä§(±×ÂÊ ¿¡·¯ÀÓ) 
==============================================================================================================

- B2B Á¤È¸¿ø °ü¸® µî·Ï ¿¡·¯ 
1. b2b Á¤È¸¿ø °ü¸® ¶ó°í ÀÖ´Âµ¥¿ä..½Å±Ôµî·Ï ¿¡·¯ 
¿¡·¯ ³»¿ë: ½Ã½ºÅÛ Á¡°Ë Áß ÀÔ´Ï´Ù. 
/b2b/manager/servlet/MemberJoin.java 
´ã´ç: ÅðÁ÷º¸ÇèÆÀ ÀÌÇÏ³ª »ç¿ø 
´ã´ç: °øÅëÆÀ ±èÈñ°æ ´ë¸® 
/manager/b2b/member/mb_list.jsp ==> /hi-mgr/java_src/hi/b2b/manager/control/ZCT308UCtl.java 
==============================================================================================================

- ÁúÀÇ½ÅÃ»¼­Á¶È¸ Á¦¸ñ ±úÁö´Â ¹®Á¦ 
1. ±â¾÷º¸Çè -> ÁúÀÇ½ÅÃ»¼­Á¶È¸ 
http://tb2b.hi.co.kr/b2bmall/fireinsu/fire_house/fire_house04.jsp 
/b2bmall/counsel/servlet/RequestServlet.java 

select auth_id,auth_time,to_char(to_date(auth_time,'yyyymmddhh24miss'),'yyyy-mm-dd hh24:mi') auth_time_str, 
        auth_name,subject,auth_email,read_gubun,co_name, app_id  
from b2b_quest_mstr 
where quest_id <> 'F' 
order by auth_time desc 
==============================================================================================================

- ÆÇ¸Å»óÇ°ÁßÀÎ/ÁßÁö»óÇ°¿¡¼­ 
1. º¸Á¾ÄÚµå/Á¾ÇüÄÚµå ¼öÁ¤ ½Ã ¹Ý¿µ ¾ÈµÊ 
2. ´ë¿ë·® ÆÄÀÏ Ã·ºÎ½Ã ¿ë·®Á¦ÇÑ ÀÖÀ½ 
3. È¨ÆäÀÌÁö¿¡¼­ ¾à°üÀÌ ¿­¸®´Â ¼Óµµ°¡ ´À¸®°Å³ª ¾È¿­¸² ===> ½Ã½ºÅÛ ¼Óµµ, ÆÄÀÏ ¿ë·® ¹®Á¦  
http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
http://www.hi.co.kr/data/goods/hicar(110302)_1.pdf --> 836KB 
http://www.hi.co.kr/data/goods/Hicarpersonalcar(20090416)_1.pdf --> 755.23KB 
http://www.hi.co.kr/data/goods/Hicarpersonalcar(20081201)_1.pdf  --> 5.24M 
==============================================================================================================

- P20110214-0026[½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] Ã³¸® 
1. 98. ¼³¹®Á¶»ç ÀÀ¸ðÀÚ.xll 
2. 99. smart_¸¸Á·µµ ¼³¹®Á¶»ç °á°ú.xll 
==============================================================================================================

- Ãâ·Â¹° 
À©µµ¿ì7 64bit¸¦ Á¦¿Ü ÇÏ°í´Â ´Ù Ãâ·ÂÀÌ µË´Ï´Ù. 
°í°´¿¡°Ô À©µµ¿ì7 64bitÀÎÁö ¹°¾î º¸½Ã°í ¾Æ´Ï¶ó°í ÇÏ¸é 
°í°´¿¡°Ô ÀÌ ÇÁ·Î±×·¥ ¾ÐÃà Ç®¾î¼­ ¼³Ä¡ÇØº¸¶ó°í ÇÏ¼¼¿ä. 
==============================================================================================================
   
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.03(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110223-0024[¾î¸°ÀÌº¸Çè ÆÇ¸ÅÁö¿ø ÀÌº¥Æ® ¾È³» ¸ÞÀÏ ¹ß¼Û] ÀÌÇà ¿Ï·á 
1. ¾î¸°ÀÌº¸Çè ÆÇ¸ÅÁö¿ø ÀÌº¥Æ® ÀÌ¸ÞÀÏ ¹ß¼Û.xls 
http://www.hi.co.kr/events/21102001/kids_safe_main.jsp?hipath=childquiz201102_mail 
* ÇÏÀÌÄÝÁ¾ÇÕº¸Çè, * ÃÖÀºÁý  
==============================================================================================================

- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. ³³ÀÔÇöÈ²(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS Àü¼Û: http://thome.hi.co.kr/7color/sms_test.jsp  

<cvrNm> 
<cvrNm_row index="0">ÀÚÂ÷</cvrNm_row> 
</cvrNm> 
==============================================================================================================

- CIS ±¸ºñ¼­·ù ¿©ºÎ ¿À·ù Ã³¸® 
Y Ç¥½Ã°¡ ºñÁ¤»ó ¹ÌÃ·ºÎ ¼­·ùµµ Y·Î Ç¥½Ã....  
Ç¥½ÃµÇ´Â °ªÀÌ 2/22 ºÎÅÍ ºñÁ¤»ó È®ÀÎ ==> Ã³¸® ¿Ï·á(/JubsuMgr.java ¼öÁ¤) 
==============================================================================================================

- [½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] ´çÃ·ÀÚ ¾È³» SMS ¹ß¼Û 
1. SMS Àü¼Û: http://thome.hi.co.kr/7color/sms_test.jsp  
¸Þ¼¼Áö: Çö´ëÇØ»ó ¼³¹®Á¶»ç ÀÌº¥Æ® ´çÃ·! ½º¸¶Æ® °í°´¼¾ÅÍ °øÁö »çÇ×À» È®ÀÎÇØº¸¼¼¿ä~ 
/blog/servlet/BlogSmsTest.java 
==============================================================================================================

- ÈÞ´ëÆù ÁÖ¼Ò·Ï Ã³¸® ¹æ¹ý 
1. ÈÞ´ëÆù¿¡¼­ °¡Á® ¿À±â 
 1) Å©·¡µé ¿¬°á --> µ¿±âÈ­ --> ÁÖ¼Ò·Ï °¡Á® °¡±â 
 2) SDÄ«µå¿¡¼­ 00002.vcf ÆÄÀÏ PC·Î °¡Á® °¡±â 
 3) ±¸±Û ¸ÞÀÏ(https://mail.google.com/mail)¿¡¼­ °¡Á®¿À±â ¼³Á¤ ==> D:\01. TAMA Work\91. So on\02. My_ÁÖ¼Ò·Ï\0002.vcf ÆÄÀÏ   
 4) ±¸±Û ¸Þ¿¡¼­ ´Ù½Ã contacts.csvÆÄÀÏ ¼±ÅÃ ÈÄ ³»º¸³»±â ´Ù½Ã ¼³Á¤ 
 5) PC¿¡¼­ ¼öÁ¤ ÀÛ¾÷ ÈÄ ±¸±Û ¸ÞÀÏ(https://mail.google.com/mail)¿¡¼­ ¼öÁ¤ÇÑ contacts.csvÆÄÀÏÀ» ´Ù½Ã °¡Á®¿À±â ¼³Á¤ 
 6) ÈÞ´ëÆù¿¡¼­ ±¸±Û µ¿±âÈ­ ¼³Á¤ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.04(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. ³³ÀÔÇöÈ²(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS Àü¼Û: http://thome.hi.co.kr/7color/sms_test.jsp  

<cvrNm> 
<cvrNm_row index="0">ÀÚÂ÷</cvrNm_row> 
</cvrNm> 
==============================================================================================================

- ÁúÀÇ½ÅÃ»¼­Á¶È¸ Á¦¸ñ ±úÁö´Â ¹®Á¦ 
1. ±â¾÷º¸Çè -> ÁúÀÇ½ÅÃ»¼­Á¶È¸ 
http://tb2b.hi.co.kr/b2bmall/fireinsu/fire_house/fire_house04.jsp ¿¡¼­  
º¸Çè»óÇ°¸í: <td><input name="prdt_name" type="text" class="txt" style="width: 200px;" value="ÁÖÅÃÈ­Àçº¸Çè" readonly/></td> 
<input type="hidden" name="subject" value="°¡ÀÔ½ÅÃ»"> 
/b2bmall/counsel/servlet/RequestServlet.java ¿¡¼­ 
String tmp_subject = "["+CommonUtil.getParameter(req,"prdt_name")+CommonUtil.getParameter(req,"subject")+"]";  //Á¦¸ñ 

--ÁúÀÇ/½ÅÃ»¼­ °ü¸®È­¸é Á¶È¸ @@@@@@@@@@@@@ 
SELECT AUTH_ID,AUTH_TIME,TO_CHAR(TO_DATE(AUTH_TIME,'YYYYMMDDHH24MISS'),'YYYY-MM-DD HH24:MI') AUTH_TIME_STR, 
AUTH_NAME,SUBJECT,AUTH_EMAIL,READ_GUBUN,CO_NAME, APP_ID  
FROM B2B_QUEST_MSTR 
WHERE QUEST_ID <> 'F' 
ORDER BY AUTH_TIME DESC 
==============================================================================================================

- B2B Á¤È¸¿ø °ü¸® µî·Ï ¿¡·¯ 
1. b2b Á¤È¸¿ø °ü¸® ¶ó°í ÀÖ´Âµ¥¿ä..½Å±Ôµî·Ï ¿¡·¯ 
¿¡·¯ ³»¿ë: ½Ã½ºÅÛ Á¡°Ë Áß ÀÔ´Ï´Ù. 
/b2b/manager/servlet/MemberJoin.java 
´ã´ç: ÅðÁ÷º¸ÇèÆÀ ÀÌÇÏ³ª »ç¿ø 
´ã´ç: °øÅëÆÀ ±èÈñ°æ ´ë¸® 
/manager/b2b/member/mb_list.jsp ==> /hi-mgr/java_src/hi/b2b/manager/control/ZCT308UCtl.java 
==============================================================================================================

- PSM ºñ¹Ð¹øÈ£ º¯°æ(2°³¿ù¿¡ ÇÑ¹ø¾¿ ½ÃÇà) 
1. PSM ºñ¹Ð¹øÈ£: s*j**201003(IA1308)  ===> ÁÖ±âÀû º¯°æ ÇØ¾ß ÇÔ(ºñ¹Ð¹øÈ£ º¯°æ 5ÀÏ ³²¾Ò½À´Ï´Ù.) 
http://im.hi-portal.co.kr/IM/user/hmuser/HMUserAuth.jsp?type=LP 
1. PMS: http://ppms.hi.co.kr:7001/PMS/login2.jsp 
2. HOMEAMDIN: http://homeadmin.hi.co.kr/portal/index.jsp 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.05(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- SFR(21Â°ÁÖ)
07:50 ±â»ó 
08:10 Áý Ãâ¹ß 
08:30 Super Fast-Reading ÇÐ¿ø µµÂø 
09:00 ÈÆ·Ã(Ã¢ÈÖ ³²¸Å, ½Âºó°¡Á·, À±Á¤ÀÚ¸Å) 
- ¸ñ»ç´ÔÀÌ ¸»µµ ¾ÈµÇ´Â ¼Ò¸®ÇØ¼­ ¿­¹ÞÀ½(´ë²Ù ÀÚÁ¦ÇÒ °Í)  ==> ÀúÀÚÀÇ ¸¶À½À» ÀÐ¾î¶ó. 
12:20 Áß½Ä 
13:00 µ¶¹ý ÈÆ·Ã  
17:30 Á¾·á 
20:00 ±Í°¡ 
00:00 ÃëÄ§ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.06(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

¢ËÁ¶±âÃà±¸
06:00 ±â»ó 
07:00 ¿¹¹è(±¤¸²±³È¸) 
08:30 Á¾·á 
08:40 ½Å±¸ÃÊµîÇÐ±³ 
08:50 °ÔÀÓ(5:4 ½Â): Áã³² 
10:00 Á¾·á 
10:30 ±¹¸³ ±¹¸³ÀÇ·á¿ø(ÇÑ»óºÀ °¨»ç ¸ð»ó): ºÎÀÇ±Ý 5¸¸¿ø(±¤¼öÇü¿¡°Ô 3¸¸¿ø ºô¸²) 
12:30 Á¾·á 
14:00 Super Fast-Reading ÇÐ¿ø): µ¶¹ý(ÀÌ¿µ¼÷´Ô, Àå¿øÀå´Ô, ÀÌÀå·Î´Ô, ¼±ÇýÀÚ¸Å, À±Á¤ÀÚ¸Å, Ã¢ÈÖ³²¸Å, ÀÌ»è, ½Âºó°¡Á·) 
       - ÀÌÀå·Î´ÔÀÌ Áã³ª´Â ¹®Á¦·Î Ä§ ³õ¾Æ ÁÜ(Çã¸®°¡ ¿øÀÎÀÌ¶ó°í ÇÔ --> ÁÁ¾ÆÁü) 
17:30 ¼®½Ä(ÄÅ¶ó¸é ¹ä) 
18:00 µ¶¹ý ÈÆ·Ã 
19:00 Á¾·á 
20:40 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.07(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:20 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110304-0037[º¸Çè±Ý ±¸ºñ¼­·ù º¯°æ ÀÛ¾÷] ÀÌÇà 
==============================================================================================================

- P20110304-0033[º¸Çè±Ý Ã»±¸ ¾ç½Ä Ãß°¡ ÀÛ¾÷] ÀÌÇà 
==============================================================================================================

- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
1. ³³ÀÔÇöÈ²(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==>  
/cybercenter/longterm/servlet/LIA07AUServlet.java, /LTMUE004M01LBean.java 
2. EDMS ÀÌ¹ÌÁö Àü¼Û, ÇÇÇØ¹° »çÁøÁ¶È¸ 
==============================================================================================================

- EDMS ¿¬µ¿ ¼öÁ¤(EDMS¿¡¼­ ÀÌ¹ÌÁö ÆÄÀÏ ºÒ·¯ ¿È) --> 2010.11.03(¼ö) ÀÌÇà ¿Ï·áÇÒ °Í(Á¶¿µ¿ì »ç¿ø(º¸»ó¼Õ»çÆÀ): T)721-0256)  
1. º¸»óÃ¢±¸/ÀÚµ¿Â÷º¸»ó --> »çÁøº¸±â(»õÃ¢) ==> ¹«±ÃÈ­»ïÃµ¸®(*), Á¢¼ö¹øÈ£: 1006004509-´ë¹°-001 
    ==> È«¼®¿î(*), Á¢¼ö¹øÈ£: 1004066429 -ÀÚÂ÷-001 
2. /bosangCarTypeView.jsp, /servlet/hi.amends.servlet.ViewSagoImageServlet: String ifId = "IR_HI-HOME_0964"; 
==============================================================================================================
   
1. ÇÇÇØÀÚ / ÇÇÇØ¹°¿¡¼­ º¸¿©ÁÙ µ¥ÀÌÅÍ°¡ ¾øÀ»½Ã   ==> ¿Ï·á 
    : "ÇØ´ç ³»¿ªÀ¸·Î Á¢¼öµÈ ³»¿ëÀÌ ¾ø½À´Ï´Ù"  
2. ¼­·ù¹ß±Þ ¸µÅ©  ==> ¿Ï·á 
    : Áõ¸í¼­ ¹ß±Þ- ÀÚµ¿Â÷ º¸Çè È­¸é ¿¬°á 
3. ÇÒÀÎÇÒÁõ¹®ÀÇ ==> ¿Ï·á 
   cisÀü¹®ÀÇ ÇÃ·¡³Ê ÀüÈ­¹øÈ£ ºÒ·¯¿Í¼­ 
   ¹®ÀÚÀü¼ÛÇÏ°Ô ¸¸µé±â...    
4. ¹®ÀÚÀü¼Û È­¸é Ã¢ Å©±â Á¶Àý...  ==> ¿Ï·á 
------------------------------------------------------------------------------------------------------------------- 
Á¢¼ö¹øÈ£ 1102046631 ´ëÀÎ 001 ±èµµÇå 
ÇÇº¸ÇèÀÚ * ÀåÅÂ¼º 
°ú½ÇµµÇ¥ 253 ÈÄ¹ÌÃßµ¹  
==============================================================================================================

- È¸½Ä(Âü¿©´ë»ó: Çù·Â¾÷Ã¼Á÷¿ø, ÆÄÆ®¼±ÀÓ, ÆÀÀå´Ô)   
ÀÏ½Ã: 2011.03.07 ¿ù¿äÀÏ Àú³á 7½Ã 
Àå¼Ò: ¾ûÅÍ¸®»ý°í±â(¼¾ÅÍÁø±ÞÀÚÈ¸½Ä µ¿ÀÏÀå¼Ò) 
        http://blog.naver.com/npaba?Redirect=Log&logNo=130078913314 
ÀÏÁ¤: ¾ûÅÍ¸®»ý°í±â(19:00), »ý¸ÆÁÖ(21:00), Á¾·á(22:00), ±Í°¡(22:40) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.08(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30  --> ÁÖ°£º¸°í¼­ ÀÛ¼º 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
1. ³³ÀÔÇöÈ²(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==>  
/cybercenter/longterm/servlet/LIA07AUServlet.java, /LTMUE004M01LBean.java 
2. EDMS ÀÌ¹ÌÁö Àü¼Û, ÇÇÇØ¹° »çÁøÁ¶È¸ 
´ëºÐ·ù: CM(ÀÚµ¿Â÷º¸»ó), ÁßºÐ·ù: 31(°í°´Á¦°øÀÚ·á), ¼­½Ä: 3253(°í°´Á÷Á¢Á¦°øÀÚ·á) 

1. EDMS »çÁø Àü¼Û 
»ç°íÁ¢¼ö¹øÈ£ ==> ´ëºÐ·ù: CM(ÀÚµ¿Â÷º¸»ó), ÁßºÐ·ù: 31(°í°´Á¦°øÀÚ·á), ¼­½Ä: 3253(°í°´Á÷Á¢Á¦°øÀÚ·á) 
--> ´ãº¸ºÐ·ùÄÚµå, ¼­¿­ ÇÔ²² º¸³»¾ß ÇÔ 
2. ÇÇÇØ¹° »çÁø Á¶È¸ 
»ç°íÁ¢¼ö¹øÈ£ ==> ´ãº¸ºÐ·ùÄÚµå, ¼­¿­ 
»ç°íÁ¢¼ö¹øÈ£·Î Á¶È¸ ====> Àü¹® º¯°æ(CM03:000106508´ëÀÎ001  ==> CM01:Á¢¼ö¹øÈ£) 
3. °ü·Ã ´ã´çÀÚ 
 1) Á¶¿µ¿ì »ç¿ø(º¸»ó¼Õ»çÆÀ): T)721-0256  
 2) ÀÌ±ÔÈñ »ç¿ø(¼Ö·ç¼ÇÆÀ): T)721-0181)  ===> ´ã´ç 
==============================================================================================================

1. ¼­½ÄÄÚµå°¡ »çÁø(0123)ÀÌ  
- ÀüÀÚ¹®¼­ µî·Ï(È­¸é): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.09(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 21:00  --> CS È¸ÀÇ, ¾ß±Ù(21:00, ¼®½Ä(»ó°øÈ¸ÀÇ¼Ò ½Ä´ç: 3,800¿ø)) 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
1. EDMS ÀÌ¹ÌÁö Àü¼Û, ÇÇÇØ¹° »çÁøÁ¶È¸ 
´ëºÐ·ù: CM(ÀÚµ¿Â÷º¸»ó), ÁßºÐ·ù: 31(°í°´Á¦°øÀÚ·á), ¼­½Ä: 3253(°í°´Á÷Á¢Á¦°øÀÚ·á) 

1. EDMS »çÁø Àü¼Û 
»ç°íÁ¢¼ö¹øÈ£ ==> ´ëºÐ·ù: CM(ÀÚµ¿Â÷º¸»ó), ÁßºÐ·ù: 31(°í°´Á¦°øÀÚ·á), ¼­½Ä: 3253(°í°´Á÷Á¢Á¦°øÀÚ·á) 
--> ´ãº¸ºÐ·ùÄÚµå, ¼­¿­ ÇÔ²² º¸³»¾ß ÇÔ 
2. ÇÇÇØ¹° »çÁø Á¶È¸ 
»ç°íÁ¢¼ö¹øÈ£ ==> ´ãº¸ºÐ·ùÄÚµå, ¼­¿­ 
»ç°íÁ¢¼ö¹øÈ£·Î Á¶È¸ ====> Àü¹® º¯°æ(CM03:000106508´ëÀÎ001  ==> CM01:Á¢¼ö¹øÈ£) 
3. °ü·Ã ´ã´çÀÚ 
 1) Á¶¿µ¿ì »ç¿ø(º¸»ó¼Õ»çÆÀ): T)721-0256  
 2) ÀÌ±ÔÈñ »ç¿ø(¼Ö·ç¼ÇÆÀ): T)721-0181)  ===> ´ã´ç 

 Tel. 02-557-2757  Cel. *  Email. È²¹®¼± ÆÀÀå<*@*.*> 
--------------------------------------------------------------------------------------------------------- 

- °ËÁõ°è Æ÷Å» ·Î±ä ÈÄ 
ºÎ°¡¾÷¹«>EDMS Å¬¸¯ÈÄ  
Á¶È¸ > °Ë»ö 
°Ë»ö±âÁØ : Á¢¼ö¹øÈ£ 
°Ë»ö°ª : 080856799´ë¹°001 
³ÖÀ¸½Ã°í Ãß°¡ ÇÏ½ÅµÚ Á¶È¸ ¹öÆ° ´©¸£½Ã¸é µÎ°ÇÀÌ Á¶È¸ 

1. »ç°íÁ¢¼ö¹øÈ£: 1005059427  
ÁßºÐ·ù(01:»ç°íÁ¢¼ö) 
2. ¼­½ÄÄÚµå(0123:»çÁø) 
[°Ë»ö¹øÈ£]CM01:1005059427;CM03:1005059427ÀÚÂ÷000 
EDMS Á¶È¸ --> http://qa-core.cis.co.kr/common/init/main.jsp? 

1. »ç°íÁ¢¼ö¹øÈ£: 080856799  
ÁßºÐ·ù(01:»ç°íÁ¢¼ö) 
2. ¼­½ÄÄÚµå(0123:»çÁø) 
[search_no] ==> CM01:080856799´ë¹°001  
==============================================================================================================

1. ¸ÞÀÎ ÆäÀÌÁö Ã¹È­¸é¿¡ ¾÷·Îµå ÄÄÆ÷³ÍÆ® ¼³Ä¡ µÉ ¼ö ÀÖµµ·Ï ÇØÁÖ½Ã°í¿ä ==> ¿Ï·á 
2. step2 ´Ü°è µðÀÚÀÎ ÇßÀ¸´Ï ¾÷·Îµå ÄÄÆ÷³ÍÆ® ¼öµ¿¼³Ä¡ ÆÄÀÏ 
   ¸µÅ©ÇØ ÁÖ½Ã±â ¹Ù¶ø´Ï´Ù.  ==> ¿Ï·á 
3. µðÀÚÀÎ ÀÔÇûÀ¸´Ï ±×¿¡ ¸Â°Ô Àû¿ëÇØÁÖ½Ã°í¿ä ==>   
4. ¾Æ±î ¿À·ù ³ª´ø°Å È®ÀÎ ºÎÅ¹µå·Á¿ä...  ==> *  --> CIS¿¡ Àü¹® È®ÀÎ ¿äÃ» 
--> 7607081162738(ÇÇº¸ÇèÀÚ Á¶È¸): Á¶È¸ µÊ 
==============================================================================================================

- R20110309-0005[3¿ù ¸ÞÀÏÁø ÇÁ¸®Å×½ºÆ® ¹× ¹ß¼Û ÀÛ¾÷ ¿äÃ»] 
1. °í°´¸í / È¨ÆäÀÌÁö °¡ÀÔÀÏÀÚ ÀÏÄ¡ ¿©ºÎ¸¸ È®ÀÎ 
ÁöÀ±Á¤  2004.02.27 
È«¹Ì¶ó 2010.12.25  
±èÁ¤ÈÆ 2010.12.24 
±èÇöÅÃ 2004.06.25  
±è¼ºÁß 2003.11.18  
ÁÖÀÏ¾ï 2004.07.09  
¹Ú½Å¼º 2003.03.18  

ÀÌÁ¾È£  2007.12.26 
ÀÌ½Â±³  2005.06.29  
¹Ú´öÁ×  2007.03.03  
==============================================================================================================

--°í°´ Á¤º¸ Á¤º¸ Á¶È¸ @@@@@@@@@@@@  ==> ¼ö½Å_µ¿ÀÇÀÏ È®ÀÎ ==> ==> 51_EMAIL_WEB, 
SELECT A.RSN_NO, A.NM, A.EMAIL, TO_CHAR(A.CRET_DT,'YYYY.MM.DD') as ¼ö½Å_µ¿ÀÇÀÏ 
FROM CUSTOMER A 
WHERE 1=1   
   AND (  (A.NM IN ('ÀÌÁ¾È£') AND TO_CHAR(A.CRET_DT,'YYYY.MM.DD') IN ('2007.12.26')) 
OR (A.NM IN ('ÀÌ½Â±³') AND TO_CHAR(A.CRET_DT,'YYYY.MM.DD') IN ('2005.06.29')) 
OR (A.NM IN ('¹Ú´öÁ×') AND TO_CHAR(A.CRET_DT,'YYYY.MM.DD') IN ('2007.03.03')) 
);  
==============================================================================================================

- ¸ÞÀÏ CRUD°¡ ÇÊ¿äÇÑ Å×ÀÌºí¸ñ·Ï 
1. M_CAMPAIGN1(º¸Çè°è¾à´ëÃâ°ñÇÁº¸Çè) 
2. M_TEMP(ÀÓ½ÃÅ×ÀÌºí) 
==============================================================================================================

- ¿µÀÎÇÁ·±Æ¼¾î ÁÖ½Ä È¯¸Å 
1. ¿ø±Ý: 15,225,000¿ø 
2. È¯¸Å±Þ¾×: 1,800,000¿ø 
3. ÀÌÀÍ: 2,775,000¿ø(18.23% ÀÌÀÍ) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.10(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:40 ~ 18:30  --> ¾ÆÄ§´ç¹ø, ¾ß±Ù(21:00, Á¤´ë¸®°¡ µîµÚ¿¡¼­ ÆÄÀÏ º¹»ç ¿î¿îÇØ¼­ ¿­¹Þ¾Æ¼­ Áý¿¡ °¨) 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] 
1. EDMS ÀÌ¹ÌÁö Àü¼Û, ÇÇÇØ¹° »çÁøÁ¶È¸ 
´ëºÐ·ù: CM(ÀÚµ¿Â÷º¸»ó), ÁßºÐ·ù: 31(°í°´Á¦°øÀÚ·á), ¼­½Ä: 3253(°í°´Á÷Á¢Á¦°øÀÚ·á)  
==============================================================================================================

- Å×½ºÆ® °úÁ¤ Áß ¼öÁ¤»çÇ× 
1. °¡Àå Áß¿äÇÑ°Çµ¥.. step5 º¸Çè±Ý Áö±Þ / Á¾°á¿¡¼­ 
   ´ëÀÎÁö±Þº¸Çè±ÝÀº ****Ã³¸® ÇØÁÖ¼¼¿ä ==> Ã³¸® ¿Ï·á 
2. step2->3´Ü°è ³Ñ¾î°¥¶§ »õÃ¢¶ß´Â ¹®Á¦ 
3. step2 ¾îÁ¦ µðÀÚÀÎ ¼öÁ¤µÈ°Å ¹Ý¿µ ¾ÈµÈ¹®Á¦ ==> Ã³¸® ¿Ï·á 
4.. ¼ýÀÚ Ç¥½Ã Ãµ´ÜÀ§·Î ÄÞ¸¶(,) Ç¥½Ã  ==> <%=DataFormat.number(insuredList[i].getElagCvrClsInsdAmt())%> ±Ý¾× 
5. step4 ÇÇÇØÀÚ¹°/Á¶»ç°ü¸® ¿¬¶ôÃ³ Á¦¸ñ->´ã´çÀÚ ¿¬¶ôÃ³ ¼öÁ¤  ==> Ã³¸® ¿Ï·á 
6. °ú½ÇµµÇ¥ Á¶È¸.... ¾ÈµÇ´Â ¹®Á¦.. ==> CISÂÊ¿¡¼­´Â °ú½ÇµµÇ¥°¡ ¿ø·¡ Á¶È¸ ¾ÈµÈ´Ù°í ÇÏ´Ï °ú½ÇµµÇ¥°¡ Á¸ÀçÇÏ´Â °É·Î ÇÏ³ª ¾Ë·ÁÁÖ¼¼¿ä. 
1) ÇÏÀÌÇÃ·¡³Ê ¹®ÀÚÀü¼Û  ===> Ã³¸® ¿Ï·á 
------------------------------------------------------------------------------------------------------------------------- 

1. *  --> Ã³¸® ¿Ï·á 
2. * ->  1101055879 ÇÏÀÌÇÃ·¡³Ê ¿¬¶ôÃ³°¡ (ÁÖ)Á¤ÈÆº¸Çè´ë¸®Á¡ * ÀÎµ¥...  
Áö±Ý cis ÂÊ¿¡¼­ ¿ì¸®ÂÊÀ¸·Î µé¾î¿À´Â ÀüÈ­¹øÈ£´Â *¶ó°í¿ä   ==> Ã³¸® ¿Ï·á 
IR_HI-HOME_1003¿¡¼­ 
<hiPlanerTelNo>*</hiPlanerTelNo>: ÇÏÀÌÇÃ·¡³Ê ¿¬¶ôÃ³ 
===> <hiPlanerTelNo>*</hiPlanerTelNo>·Î º¯°æ ¿ä¸Á 
==============================================================================================================

- ¾÷¹«º° Áß¿ä DB Å×ÀÌºí 
- º¸»ó 
1. SAGO_JUBSU(»ç°íÁ¢¼ö) 
- È¸»ç¼Ò°³ 
1. DECLARED(°ø½ÃÈ¸»ç_°ü·ÃÁ¤º¸) 
2. GOODS_LIST(ÆÇ¸ÅÁßÀÎ_ÆÇ¸ÅÁßÁö»óÇ°¸ñ·Ï) 
- ¸ÞÀÏ 
1. M_CAMPAIGN1(º¸Çè°è¾à´ëÃâ°ñÇÁº¸Çè) 
2. M_TEMP(ÀÓ½ÃÅ×ÀÌºí) 
3. EMS_MASS_SEND_LIST_01(¸ÞÀÏÀü¼Û¸®½ºÆ®01) 
4. M_ERROR_EMAIL(ÀÌ¸ÞÀÏ¿¡·¯ÀÚÅ×ÀÌºí) 
5. EMAIL_SVC(ÀÌ¸ÞÀÏ¼­ºñ½º°ü¸®) 
- B2B 
1. B2B_QUEST_MSTR(°ü¸®ÀÚ¼ö½ÅÇÔ) 
2. B2B_MB_BASIC(±â¾÷º¸ÇèÈ¸¿øÁ¤º¸) 
3. MB_BASIC(È¨ÆäÀÌÁöÈ¸¿øÁ¤º¸¸ñ·Ï) 
==============================================================================================================

- ÀçÇØº¹±¸ ¸ðÀÇÈÆ·Ã(Çö´ëHDS) 
1. ÈÆ·ÃÁÖ°üÆÀÀ¸·Î ¹®ÀÚ¸Þ½ÃÁö Àü´Þ(013-3366-5656) 
(FORMAT: ¼Ò¼Ó/ÆÀ/¼º¸íÁ÷À§/À§Ä¡Á¤º¸/¾ÏÈ£ -> ±¸ºÐÀº ¡°/¡± ±× ¿Ü´Â ¸ðµÎ ºÙ¿©¾²±â) 
(¿¹) Ã¤³Î¼­ºñ½º¼¾ÅÍ/ÅëÇÕÃ¤³ÎÆÀ/ÁøÅÂ¸¸°úÀå/¼­¿ï¹æ¹èµ¿/(¾ÏÈ£) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.11(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:00 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] ÀÌÇà ¿Ï·á 
==> ÀÚ¿ø
: 35°³(JSP: 11, JAVA: 21, XML: 1, CSS: 1, JS: 1)  
==> (JSP: 22, JAVA: 42, CLASS: 21, XML: 2, CSS: 1, JS: 2)(»êÃâ¹° Æ÷ÇÔ) ==> ÃÑ 90°³  
1. FG71_90_InnoPU_goods.js_00.xls ÆÄÀÏ ´©¶ôÀ¸·Î ±ä±Þ Àç»ó½Å ÇÔ(¼¾ÅÍÀå °áÀç Ãß°¡)  
==============================================================================================================

- ActiveX ÀÌ ¼³Ä¡°¡ ¾ÈµÈ´Ù¸é 
1. IE --> µµ±¸(T) --> ÀÎÅÍ³Ý¿É¼Ç(O) ¿¡ µµ±¸/º¸¾ÈTab 
1) ActiveXÄÁÆ®·Ñ ¹× ÇÃ·¯±× ÀÎ  
°¡) ¼­¸í ¾ÈµÈ ActiveXÄÁÆ®·Ñ ´Ù¿î·Îµå 
³ª) ¼­¸íµÈ ActiveXÄÁÆ®·Ñ ´Ù¿î·Îµå 
´Ù) ¾ÈÀüÇÏÁö ¾Ê´Â°ÍÀ¸·Î Ç¥½ÃµÈ ActiveXÄÁÆ®·Ñ ÃÊ±âÈ­ ¹× ½ºÅ©¸³Æ®  
¶ó) ¾ÈÀüÇÑ °ÍÀ¸·Î Ç¥½ÃµÈ ActiveXÄÁÆ®·Ñ ½ºÅ©¸³Æ®  
¸¶) ActiveXÄÁÆ®·Ñ ¹× ÇÃ·¯±× ÀÎ ½ÇÇà  ==>  ¸ðµç Ç×¸ñ¿¡ Ã¼Å© 
==============================================================================================================

- P20110214-0026[½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] Ãß°¡ ¿äÃ» 
1. "Á¤¸» ±ä±ÞÃâµ¿¼­ºñ½º´Â ÁÁÀº°Í °°½À´Ï´Ù. ¾ÆÁ÷ º¸Çè»óÇ°ÀÌ ³ª¿ÀÁö ¾Ê¾Ò´Âµ¥ º¸Çè»óÇ°À» ¼Ò°³ÇÏ´Â ¿©·¯°¡ÁöÀÇ  
ÄÁÅÙÃ÷ µéÀÌ ÇÔ²² ³ª¿À¸é ½Ã°£ÀÌ ³¯¶§ ¸¶´Ù º¼ °Í °°¾Æ ÁÁÀº Á¤º¸°¡ µÇÁö ¾Ê°Ú³ªÇÏ´Â »ý°¢ÀÌ µì´Ï´Ù." 
2. ¾ÆÁ÷ ¾÷µ¥ÀÌÆ® µÇÁö ¾ÊÀº Ç×¸ñµéÀÌ ¸¹Àº °Í °°À¸´Ï ºü¸¥ Á¶Ä¡ ¹Ù¶÷ 
3. »çÁøÃ·ºÎ1ÀåÀº ³Ê¹« ÀÛÀº°Å °°À½. 
4. "Àü¹ÝÀûÀÎ ³»¿ëÀÌ³ª ¸Þ´º¾óÀÌ ¸¸Á· ÇÕ´Ï´Ù. 
ÇÏÁö¸¸ ¸ðµç ¸Þ´º¾óÀÌ µÇÁö ¾Ê´Â°ÍÀÌ ÀÖ¾î ÀÌ¿ëÀ» ¸øÇÏ°í ÀÖ½À´Ï´Ù. 
°¡´ÉÇÑ ¸ðµç ¸Þ´º¾óÀÌ »¡¸® µÆÀ¸¸é ÇÕ´Ï´Ù." 
==============================================================================================================

--ÁÖ¹Î¹øÈ£ º°Ç¥ º¸ÀÌ°Ô ÇÏ±â(Orange¿¡¼­´Â ºÒ°¡´É) 
SELECT decode(A.JUMIN, 'ÇÑ±¹', '') as ÁÖ¹Î¹øÈ£_0, A.JUMIN as ÁÖ¹Î¹øÈ£ 
FROM HDCAR_COUPON A 
; 
==============================================================================================================

- ÇÐ¿øºñ ³³ºÎ 
1. Á¦ÀÏÀºÇà(ÅëÀå»çº») 130-10, ¿¹±ÝÁÖ: ÇÑ±¹»ý»ê¼ºº»ºÎ  
2. ½ÇÁ¦ ³³ºÎ ºñ¿ë: 115¸¸¿ø) 
3. ÇÑ±¹»ý»ê¼ºº»ºÎ ÄÁ¹öÀü½ºÁö½Ä¼¾ÅÍ ³²Ã¢¿ì ¿¬±¸¿ø(010-6470-0, *@*.*) 
Tel : 02-724-0   Fax : 02-724-0 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.12(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- SFR(22Â°ÁÖ)
05:30 ±â»ó 
06:00 Áý Ãâ¹ß 
06:40 ½Å±¸ÃÊµîÇÐ±³ 
06:50 ¼ô°ÔÀÓ(3:0 ÆÐ) 
08:10 Á¾·á 
09:05 Super Fast-Reading ÇÐ¿ø µµÂø 
09:05 µ¶¹ý ÈÆ·Ã(Ã¢ÈÖ ³²¸Å, ½Âºó°¡Á·, À±Á¤ÀÚ¸Å)  
12:20 Áß½Ä 
14:30 µ¶¹ý ÈÆ·Ã Á¾·á 
14:50 ¼Ó¹ý ÈÆ·Ã 
17:30 ¼®½Ä 
19:00 Á¾·á 
19:30 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.13(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- ISA(½ÉÈ­)(1ÁÖÂ÷)
06:00 ±â»ó 
07:00 ¿¹¹è(±¤¸²±³È¸) ==> ¼³±³(±è¼±µµ °¨µ¶: ¼º°øÇÏ´Â »ç¶÷ÀÇ ¿¹¹è) 
08:20 Á¾·á 
08:40 ISA(½ÉÈ­) µî·Ï(KPC 4®) ==> °áÀç(115¸¸¿ø) 
09:00 [D01] °¨¸® °­ÀÇ(±èÀºÁ¤ °¨¸®»ç: 401È£): °¨¸® ½ÃÇè(´ÙÀ½ÁÖºÎÅÍ °øºÎÇØ¼­ ½ÃÇè Ä¥ °Í) 
12:00 Áß½Ä 
13:00 [D01] °¨¸® °­ÀÇ2 
17:30 Á¾·á  
19:30 ±Í°¡ 
==============================================================================================================

- KPC Á¤º¸½Ã½ºÅÛ°¨¸®»ç ½ÉÈ­¹Ý(http://www.kpcit.or.kr) 
1. ±³À°±â°£: 3¿ù 13ÀÏ(ÀÏ) ~ 6¿ù 26ÀÏ(ÀÏ) 
2. ±³À°ºñ¿ë: 150¸¸¿ø(½ÇÁ¦ ³³ºÎ ºñ¿ë: 115¸¸¿ø) 
3. ±³À°½Ã°£: 16ÀÏ(128 ½Ã°£) 
4: ´ã´çÀÚ: ³²Ã¢¿ì, Tel. 02-724-1218 
5. ±³À° ³¯Â¥: 2011-03-13(ÀÏ) ~ 06-26(ÀÏ) 
5. ±³À° ½Ã°£: 09:00~18:00 
==============================================================================================================

- HD TV(ÃÑ: 612,000¿ø) ±¸ÀÔ(Æ÷Ç×Áý¿¡ ¹è¼Û) 
http://leadlcd.co.kr/product/cartList.php 
1. ÇÃ·¡Æ®·ÐLCD M2762D-PM  http://leadlcd.co.kr/product/productView.php?nProdCode=956972, °¡°Ý: 361,000¿ø 
2. ÇÃ·¡Æ®·ÐLCD M2362D http://leadlcd.co.kr/product/productView.php?nProdCode=935406, °¡°Ý: 251,000¿ø 
³óÇùÁß¾ÓÈ¸ 3020205556581 ¿¹±ÝÁÖ: È²Çü¼ø  
1) CJ ÅÃ¹è(http://www.cjgls.co.kr/parcel): 100420731824 
- 20011³â ½Å»ç Á¶±âÈ¸ ÃÑ¹« °èÁÂ(È¸ºñ) 
1. ½ÅÇÑÀºÇà(110-318-342822) ±¸Ã¢¿ø  ==> 24¸¸¿ø(1³âÄ¡) ¼Û±Ý 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.14(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110223-0033[ÀÚµ¿Â÷º¸»ó½Ç½Ã°£Ã³¸®Á¶È¸½Ã½ºÅÛ °³¹ß] ¼öÁ¤ 
1. ¸µÅ© ÆäÀÌÁö º¯°æ 
1) http://thome.hi.co.kr/amends/index.jsp ÀÚµ¿Â÷º¸Çè º¸»óÃ³¸®Á¶È¸ 
2) http://thome.hi.co.kr/amends/car/process/carProcessView.jsp 
   ÆäÀÌÁö ¿ÞÂÊ ¸Þ´º ÀÚµ¿Â÷º¸»ó-º¸»óÃ³¸®Á¶È¸ ¸µÅ©  
* http://thome.hi.co.kr/amends/motor_car/process_search/step00_jubsuMain.jsp (°³ÆíµÈ ÆäÀÌÁö ¸µÅ©·Î º¯°æ) 
2. ´ã´çÀÚ ÀÇ°ß¶õ '-' Ç¥½Ã 
3. EDMS »çÁøº¸±â : »çÁøÄÚµå º¯°æ ¹Ý¿µ  ==> Ã³¸® ¿Ï·á 
06. »ç°íÁ¢¼ö¿Ï·á: /amends/damage/care/accident_take_process_06.jsp  
==> ½Å±Ô ÀÎÅÍÆäÀÌ½º µî·Ï(°³¹ßÀÚ°¡ PMS¿¡¼­ Á÷Á¢ ÇØ¾ß ÇÔ): IR_HI-HOME_0002, IR_HI-HOME_0003 µî·ÏÀÌ ¾ÈµÇ¾î ÀÖÀ½. 
==============================================================================================================

- P20110311-0016[È¨ÆäÀÌÁö È¸»ç¼Ò°³ ¼öÁ¤ ÀÛ¾÷¿äÃ»] ÀÌÇà ¿Ï·á   
==============================================================================================================

- P20110311-0019[3¿ù ¸ÞÀÏÁø ÇÁ¸®Å×½ºÆ® ¹× ¹ß¼Û ÀÛ¾÷ ¿äÃ»] ÀÌÇà ¿Ï·á  
==============================================================================================================

- ÀÔ·Â ¼øÀ¸·Î Á¶È¸ ¾ÈµÊ    
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.15(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30   --> °è¾à ÇØÁö Åëº¸(ÅëÇÕÃ¤³ÎÆÀ °­¼º¿À ÆÀÀå°ú ¸é´ã), ÁÖ°£º¸°í¼­ ÀÛ¼º 

- Çö´ëÇØ»ó SM
- P20110311-0017[3¿ù »çº¸ ÀÌ¸ÞÀÏ ¹ß¼Û] ÀÌÇà ¿Ï·á 
03¿ù »çº¸ [1]ÇÏÀÌÇÃ·¡³Ê 
03¿ù »çº¸ [2]ÀÓÁ÷¿ø  [Çö´ëÇØ»ó] »çº¸ Çö´ëÇØ»ó 03¿ùÈ£ÀÔ´Ï´Ù. 
03¿ù »çº¸ [3]°¡Á· [Çö´ëÇØ»ó] »çº¸ Çö´ëÇØ»ó 03¿ùÈ£ÀÔ´Ï´Ù.  
--> »çº¸¸ÞÀÏÁøÇÃ·¡³Ê05.xllÆÄÀÏ¿¡ ÁÖ¹Î¹øÈ£ °¡Â¥·Î ¸¸µé¾î¼­ 03. °¡Á· ¸®½ºÆ®.txt·Î IMPORT ÈÄ Àü¼Û 
==============================================================================================================

- P20110311-0018[±â»óÁ¤º¸ SMS ¼­ºñ½º ¸¸Á·µµ ¼³¹®Á¶»ç] 
==> ÀÚ¿ø
: 3°³(JSP: 1, JAVA: 2) ==> (JSP: 2, JAVA: 4, CLASS: 2(»êÃâ¹° Æ÷ÇÔ)) ==> ÃÑ 8°³ 
-- TEMP Á¤º¸ ¼öÁ¤(FLAG °ª »ý¼º: ID¼ø¹øÀ¸·Î 1¾¿ ÀÚµ¿ Áõ°¡) @@@@@@@@@@@@@@@@@@@ 
UPDATE M_TEMP 
SET ID = ROWNUM 
; 
==============================================================================================================

- P20110214-0026[½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] Ã³¸® 
1. 4¹ø ¹®Ç× ÁÖ¹Î¹øÈ£, ÀÌ¸§ ÆÄÀÏ·Î Àü¼Û(99. smart_¸¸Á·µµ ¼³¹®Á¶»ç °á°ú_4¹ø ´ä.xll) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.16(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30   --> CSÈ¸ÀÇ 

- Çö´ëÇØ»ó SM
- P20110315-0032[Á¦ÈÞÈ«º¸ ¹× ¾î¸°ÀÌº¸Çè ÀÌº¥Æ® ÅëÇÕ ¾È³» ¸ÞÀÏ ¹ß¼Û ¿äÃ»] ÀÌÇà, ¸ÞÀÏ ¹ß¼Û ¿Ï·á 
==> ÀÚ¿ø
: 1°³(JSP: 1) ==> (JSP: 2(»êÃâ¹° Æ÷ÇÔ)) ==> ÃÑ 2°³ 
´ë»óÀÚ¶û °¡ÀÔÀÏÀÚ¸¸ È®ÀÎ ºÎÅ¹µå¸±²¾¿ä!  
ÀÌºÀ¶õ  2007.02.19 
ÀÌ½Â±³  2005.06.29  
¹Ú´öÁ× 2007.03.03   
==============================================================================================================

- P20110311-0018[±â»óÁ¤º¸ SMS ¼­ºñ½º ¸¸Á·µµ ¼³¹®Á¶»ç] ¸ÞÀÏ ¹ß¼Û ¿Ï·á 
-- ¼³¹®Á¶»ç Á¤º¸(TEST) »èÁ¦ @@@@@@@@@@@@@  ==> Å×ÀÌºí°ü¸®¿¡¼­ »ç¿ëÇÒ °Í 
DELETE HP_SURVEY 
WHERE TITLE = 'email_research_201103' AND RSN_NO IN ('76123', '76124') 
; 

- Å×ÀÌºí°ü¸®(http://homeadmin.hi.co.kr/manager/home/replace/req_replace.jsp) 
¼±ÅÃ: DELETE 
Å×ÀÌºí¸í: HP_SURVEY 
Á¶°Ç(WHEREÀý): TITLE = 'email_research_201103' AND RSN_NO IN ('76123', '76124')  ==> µî·Ï 
==============================================================================================================

- P20110315-0017[ÀÚµ¿Â÷ º¸Çè Áõ±Ç, ¾à°ü ÀÌ¸ÞÀÏ ÀåÁ¡ ¾È³» ÀÌ¸ÞÀÏ ¹ß¼Û] --> 18ÀÏ(±Ý) 
==============================================================================================================

- ISA(½ÉÈ­) ¼÷Á¦ 
1. ¹®Á¦ 5°³ ÀÛ¼º ¿Ï·á(kpc °¨¸®»ç ½ÉÈ­°úÁ¤_¹®Á¦(03.13)(ÁøÅÂ¸¸).doc) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.17(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:30 

- Çö´ëÇØ»ó SM
- P20110315-0033[3¿ù ½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ ¼³¹®Á¶»ç ÀÛ¾÷ÀÇ·Ú] ÀÌÇà ¿Ï·á 
==> ÀÚ¿ø
: 3°³(JSP: 1, JAVA: 2) ==> (JSP: 2, JAVA: 4, CLASS: 2(»êÃâ¹° Æ÷ÇÔ)) ==> ÃÑ 8°³ 
--¸ÞÀÏ ¹ß¼Û °á°ú Á¤º¸ Á¶È¸ @@@@@@@@@@@@@@  
SELECT A.*  
FROM EMS_MASS_SEND_LIST_02 A   --EMS_MASS_SEND_LIST_01(1¿ù), EMS_MASS_SEND_LIST_02(2¿ù), EMS_MASS_SEND_LIST_03(3¿ù)  
WHERE 1=1 
     AND POST_ID ='2011021500001' --POST_ID 
    --AND A.EMAIL_ID ='*@*.*'   --EMAIL 
    --AND OPEN_CNT > 0   --¿ÀÇÂ°Ç¼ö 
    --AND to_char(A.SEND_TIME, 'YYYYMMDD') BETWEEN '20110201' AND '20110221'   
--ORDER BY A.SEND_TIME DESC 
; 
==============================================================================================================

- °¡»óFAX(/UEJ82AUServlet.java --> /CLRF0100M01IBean.java) 
1. request ÇÒ¶§(CLRF0100M01I(IR_HI-HOME_0089) TRANÄÝÇÒ¶§)  
   requestVO ÂÊÀÇ bzFlag ¶ó´Â ÄÃ·³ÀÌÀÖ´Âµ¥, ÀÌÄÃ·³¿¡ "Y"°¡ µé¾î¿Í¾ß °¡»óÆÑ½º »ý¼º ¸ðµâÀ» Å½ 
   1-2  clrf0111vo »ç°ÇVO¸®½ºÆ®   ¹Ø¿¡  
ÆÑ½º¿äÃ» »ç¹ø Á¤º¸°¡   ÆÑ½º¿äÃ» »ç¹ø 
    1-2-XX : etprChgrEmpNo  -> 999997   (SETTING) 

2. response ¹ÞÀ»¶§  
tranÀÌ Á¾·áµÇ°í response ¹ÞÀ»¶§ , °¡»óÆÑ½º »ý¼º ¸ðµâÀ» Á¤»óÀ¸·Î ÅÀÀ¸¸é, 
responseVO ¹Ø¿¡ clrf0112vo °¡ »ý¼ºµÇ¾úÀ»°Å°í,  
<bzCat>X</bzCat>   --°¡Á¢¼öÀÓ(U:ÁøÁ¢¼ö,X:°¡Á¢¼ö) 
<acdtRcpNo>1102159372</acdtRcpNo>--°¡Á¢¼ö¹øÈ£ 
<faxNo>02-3470-5447        </faxNo>--°¡»óÆÑ½º¹øÈ£ 
<faxIssuDt>20110224</faxIssuDt>--°¡»óÆÑ½º¹ß»ýÀÏÀÚ 
<faxIssuTm>091209</faxIssuTm>--°¡»óÆÑ½º¹ß»ý½Ã°£ 
<faxVldDt>20110224</faxVldDt>--°¡»óÆÑ½ºÀ¯È¿ÀÏÀÚ 
<faxVldTm>111209</faxVldTm>--°¡»óÆÑ½ºÀ¯È¿½Ã°£ 
<faxResCode>00000000</faxResCode>--°¡»óÆÑ½º¸®ÅÏÄÚµå 
<faxResDesc>success</faxResDesc>--°¡»óÆÑ½º¸®ÅÏÄÚµå¼³¸í 
==============================================================================================================

- ÅðÁ÷º¸Çè > ±ÞºÎ±Ý°ü¸® > ±ÞºÎ±ÝÀÏ°ýµî·Ï¹×Ã»±¸  
http://tb2b.hi.co.kr/retirement/mydesk/mydeskView02_4.jsp?AGMT_NUM=P20040000523&AGMT_SEQ=00000&AGMT_FORM=01 
==============================================================================================================

- ¿¢¼¿, htm º¯È¯ 
htm º¯È¯ ¹æ¹ýÀº '´Ù¸¥ ÀÌ¸§À¸·Î ÀúÀå' ¼±ÅÃÇÏ½Ã±¸, htm Çü½ÄÀ¸·Î ÀúÀå 
¿¢¼¿ ÆÄÀÏÀ» ¸Þ´º - ÆÄÀÏ - ´Ù¸¥ÀÌ¸§À¸·Î ÀúÀåÀ» ¼±ÅÃÇØ¼­ ÆÄÀÏÇü½ÄÀ» 
À¥ ÆäÀÌÁö(*.htm; *.html) ·Î ÇØ¼­ ÀúÀåÇÏ¼¼¿ä... 
ÇÑ±Û¿¡¼­ ºÒ·¯¿À±â¸¦ ÇÒ¶§ ÆÄÀÏÇü½ÄÀ» ÀÎÅÍ³Ý ¹®¼­((*.htm; *.html; *.asp; *.php) ÆÄÀÏÇü½ÄÀ¸·Î ÇØ¼­ ¿­¾î º¸¼¼¿ä. 
http://file.naver.com/pc/view.html?fnum=224395&cat=30 

- ÀÚ»ê¿¬°èÇü°ø½Ã 
ÀÚ»ê±¸¼º³»¿ª: http://tmgr.hi.co.kr/manager/company/declared/writeForm.jsp?code=AK01&type=1 
http://thome.hi.co.kr/company/ko/notice/asset/assetView03.jsp 
==============================================================================================================

- ±âºÎ 
1. ³óÇù 747-01-014121, ¿¹±ÝÁÖ: »çÈ¸º¹Áö¹ýÀÎ ÇØ¼Ö(±è°æÅÂ(T)010-2617-7568): »çÃÌ µ¿»ý)) 
2. Á¦ÀÏÀºÇà ÀÚµ¿ÀÌÃ¼ ½ÅÃ»ÇÒ °Í(¿ù 1¸¸¿ø) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.18(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:40 ~ 18:30  --> ¾ÆÄ§ ´ç¹ø 

- Çö´ëÇØ»ó SM
- P20110315-0017[ÀÚµ¿Â÷ º¸Çè Áõ±Ç, ¾à°ü ÀÌ¸ÞÀÏ ÀåÁ¡ ¾È³» ÀÌ¸ÞÀÏ ¹ß¼Û] ÀÌÇà ¿Ï·á 
==============================================================================================================

- P20110315-0033[3¿ù ½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ ¼³¹®Á¶»ç ÀÛ¾÷ÀÇ·Ú] Á¡°Ë 
1. 3040°Ç(2¿ù) - ¼³¹®Á¶»ç ÀÀ¸ð °Ç(257°Ç) ===> 3¿ù Àü¼Û ¿¹Á¤ °Ç(1,987(Å¸°Ù°Ç¼ö)) 
- ÆÀ¿ø ÁÖ¹Î¹øÈ£  
==============================================================================================================

- P20110225-0001[º¸Çè°è¾à´ëÃâ Ã¤³ÎÀüÈ¯, °¡´É±Ý¾× ÀÌ¸ÞÀÏ] 
1. °¡´É±Ý¾×´ë»óÀÚ(°¡´É±Ý¾×´ë»óÀÚ:LOAN1) ¸ÞÀÏ ¹ß¼Û  
1) °¡´É±Ý¾× ´ë»óÀÚ  
2. Ã¤³ÎÀüÈ¯ ÀÌº¥Æ® ÀÌ¸ÞÀÏ ´ë»óÀÚ(ÄÝ¼¾ÅÍ:CALL, Ã¢±¸:DESK) ¸ÞÀÏ ¹ß¼Û 
1) °¡´É±Ý¾× ´ë»óÀÚÀÌ°í º¸Çè°è¾à´ëÃâ ´ë»óÀÚ  
==============================================================================================================

- ¾à°ü ¹Ìµî·Ï È®ÀÎ ¿äÃ»(*) 
1. ¿øÀÎ: ÆÇ¸ÅÁßÁöÀÏ(END_DATE)ÀÌ 20110301ÀÌ±â ¶§¹®¿¡ ¾à°ü ¹Ìµî·ÏÀÌ µÇ´Â °Å¿¹¿ä.. 
http://thome.hi.co.kr/servlet/hi.cybercenter.cmts.servlet.P2001AGServlet 
SELECT STIPULATION, END_DATE            
FROM GOODS_LIST                
WHERE INS_CD = '5108'  
AND ( PLAN_CD1 = '0000' OR PLAN_CD2 = '0000' OR   PLAN_CD3 = '0000' OR PLAN_CD4 = '0000' OR                         
    PLAN_CD5 = '0000' OR PLAN_CD6 = '0000' OR PLAN_CD7 = '0000' OR PLAN_CD8 = '0000' OR                         
    PLAN_CD9 = '0000' OR PLAN_CD10 = '0000' OR PLAN_CD11 = '0000' OR PLAN_CD12 = '0000' OR                        
    PLAN_CD13 = '0000' OR PLAN_CD14 = '0000' OR PLAN_CD15 = '0000' OR PLAN_CD16 = '0000' OR                        
    PLAN_CD17 = '0000' OR PLAN_CD18 = '0000' OR PLAN_CD19 = '0000' OR PLAN_CD20 = '0000'                         
  ) 
--AND END_DATE IS NULL   --ÆÇ¸ÅÁßÁöÀÏ 
; 
==============================================================================================================

- DB ±ÇÇÑ Ãß°¡ ¿äÃ»(DAÆÀ ÀÌ±¤¸ñ »ç¿ø¿¡°Ô ¿äÃ») 
EMS(¸ÞÀÏ¼­¹ö) DB(dpimasdba¿¡)¿¡  
CMPN_EM_BASE CM, CMPN_EM_CUST Å×ÀÌºíÀÇ Á¶È¸ ±ÇÇÑÀ» ¿äÃ» 
==============================================================================================================

- ÇÁ¶óÀÓ ÀúÃàÀºÇà ¿¹±Ý °¡ÀÔ ==> 2011³â 3¿ù 18ÀÏ 
1. ÃÑ 40,000,000 ¿ø 
2. »óÇ°¸í: Á¤±â¿¹±Ý(º¹¸®), ½Å±Ô°èÁÂ¹øÈ£: 011-02-24-1045831  
¿¹Ä¡±â°£: 12 °³¿ù, ¿¹Ä¡±Ý¾×: 7,000,000 ¿ø  
ÀÌÀÚÁö±Þ¹æ¹ý: ¸¸±âÀÏ½ÃÁö±Þ(º¹¸®),  °è¾à±Ý¾×: 7,000,000 ¿ø  
¼¼±Ý¿ì´ë¿©ºÎ: ¼¼±Ý¿ì´ë, ±âº»ÀÌÀ²/Æ¯º°ÀÌÀ²: 5.53 % 
¸¸±âÀÏÀÚ: 2012/03/18, ÀÚµ¿ÀÌÃ¼µî·Ï¿©ºÎ:  ¹Ìµî·Ï   
Ãâ±Ý°èÁÂ¹øÈ£: 011-02-13-0086600  

3. »óÇ°¸í: Á¤±â¿¹±Ý(º¹¸®), ½Å±Ô°èÁÂ¹øÈ£:  011-02-24-1045849  
¿¹Ä¡±â°£: 12 °³¿ù, ¿¹Ä¡±Ý¾×: 33,000,000 ¿ø  
ÀÌÀÚÁö±Þ¹æ¹ý: ¸¸±âÀÏ½ÃÁö±Þ(º¹¸®), °è¾à±Ý¾×: 33,000,000 ¿ø  
¼¼±Ý¿ì´ë¿©ºÎ: ÀÏ¹Ý, ±âº»ÀÌÀ²/Æ¯º°ÀÌÀ²: 5.53 % 
¸¸±âÀÏÀÚ 2012/03/18, ÀÚµ¿ÀÌÃ¼µî·Ï¿©ºÎ: ¹Ìµî·Ï   
Ãâ±Ý°èÁÂ¹øÈ£: 011-02-13-0086600 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.19(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- SFR(23Â°ÁÖ)
05:30 ±â»ó 
06:00 Áý Ãâ¹ß 
06:40 ½Å±¸ÃÊµîÇÐ±³ 
06:50 ¼ô°ÔÀÓ(3:2 ÆÐ) 
08:00 Á¾·á 
08:40 Super Fast-Reading ÇÐ¿ø µµÂø 
09:05 µ¶¹ý ÈÆ·Ã(Ã¢¼®, ±ÇÁÖ¸¸±âÀÚ, ÀÌÀå·Î´Ô, ½Âºó°¡Á·, À±Á¤ÀÚ¸Å, ÀÌ»è)  
12:20 Áß½Ä 
14:30 µ¶¹ý ÈÆ·Ã Á¾·á 
14:50 µ¶¹ý ÈÆ·Ã 
17:30 ¼®½Ä 
18:00 Á¾·á 
18:30 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.20(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- ISA(½ÉÈ­)(2ÁÖÂ÷)
06:00 ±â»ó 
07:00 ¿¹¹è(±¤¸²±³È¸) ==> ¼³±³(±èÁ¤¼® ¸ñ»ç: °í³­ÀÇ ¿¹Ç¥°¡ µÇ½Å ¿¹¼ö´Ô) 
08:30 Á¾·á 
08:35 ¾Ð±¸Á¤¿ª(7-2Ãâ±¸) 
08:50 °æº¹±Ã¿ª(6¹ø Ãâ±¸) 
08:50 KPC µµÂø 
09:00 [D02] »ç¾÷°ü¸® ½ÃÇè(80¹®Á¦)(205È£) 
10:00 [D02] »ç¾÷°ü¸® °­ÀÇ(±èÀºÁ¤ °¨¸®»ç) 
12:00 Áß½Ä 
13:00 [D02] »ç¾÷°ü¸® °­ÀÇ2 
17:30 Á¾·á 
19:30 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.21(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00  --> ÆÀÀå´Ô ¸é´ã(Ã¶¼öÀÏÁ¤ È®Á¤: 3¿ù 31ÀÏ(¸ñ)), ´ëÃ»¼Ò(¾²·¹±â ¸ðµÎ ¹ö¸²) 

- Çö´ëÇØ»ó SM
- P20110225-0001[º¸Çè°è¾à´ëÃâ Ã¤³ÎÀüÈ¯, °¡´É±Ý¾× ÀÌ¸ÞÀÏ] ÀÌÇà ¿Ï·á  
==============================================================================================================

- P20110214-0026[½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] ¸ÞÀÏ ¹ß¼Û 
- Å×ÀÌºí°ü¸®(http://homeadmin.hi.co.kr/manager/home/replace/req_replace.jsp) 
¼±ÅÃ: DELETE 
Å×ÀÌºí¸í: HP_SURVEY 
Á¶°Ç(WHEREÀý): TITLE = 'smart_research_201103' AND RSN_NO IN ('1452')  ==> µî·Ï 
==============================================================================================================

- P20110321-0003[È¨ÆäÀÌÁö Ò® È¸»ç¼Ò°³ ¼öÁ¤ »çÇ×] ÀÌÇà ¿Ï·á 
==> ÀÚ¿ø
: 6°³(JSP: 4, JAVA: 1, XML: 1) ==> (JSP: 8, JAVA: 2, CLASS: 1, XML: 2)(»êÃâ¹° Æ÷ÇÔ) ==> ÃÑ 13°³ 
==============================================================================================================

- SKºê·Îµå¹êµå ÀÚµ¿ÀÌÃ¼ ½ÅÃ»(http://www.skbroadband.com) 
1. ³³ÀÔÀÚ¹øÈ£: 0023365415 
2. Áø´ö±Ù: * 
3. SKºê·Îµå¹êµå ÄÝ¼¾ÅÍ(±¹¹ø¾øÀÌ: 106, 080-8282-106) 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.22(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00 

- Çö´ëÇØ»ó SM
--1. °´°ü½Ä ´ÙÁß ¼±ÅÃ °á°ú(¸®½ºÆ® ¹Ú½º) @@@@ 
SELECT SUM(MM.ANS_1) as ANS_1, SUM(MM.ANS_2) as ANS_2, SUM(MM.ANS_3) as ANS_3, SUM(MM.ANS_4) as ANS_4,  
SUM(MM.ANS_5) as ANS_5, SUM(MM.ANS_6) as ANS_6, SUM(MM.ANS_7) as ANS_7, SUM(MM.ANS_8) as ANS_8 
FROM 
   ( SELECT M.PROB_2, M.ANS_1, M.ANS_2, M.ANS_3, M.ANS_4, M.ANS_5, M.ANS_6, M.ANS_7, M.ANS_8 
    FROM 
        ( 
        SELECT  ANS_7 AS PROB_2, MAX(REG_DT) REG_DT,  
                DECODE(SUBSTR(ANS_7, 0, 1), '1', '1') "ANS_1",  
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '2', '2')=2 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '2', '2')=2 
		THEN '1' ELSE '0' END) as "ANS_2",  
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '3', '3')=3 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '3', '3')=3 
HEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '3', '3')=3 THEN '1' ELSE '0' END) as "ANS_3",       
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '4', '4')=4 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '4', '4')=4 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '4', '4')=4 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 4, 1), '4', '4')=4 
			THEN '1' ELSE '0' END) as "ANS_4", 
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '5', '5')=5 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '5', '5')=5
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '5', '5')=5 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 4, 1), '5', '5')=5 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 5, 1), '5', '5')=5 THEN '1' ELSE '0' END) as "ANS_5", 
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '6', '6')=6 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '6', '6')=6 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '6', '6')=6 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 4, 1), '6', '6')=6 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 5, 1), '6', '6')=6 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 6, 1), '6', '6')=6 THEN '1'  
			ELSE '0' END) as "ANS_6", 
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '7', '7')=7 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '7', '7')=7 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '7', '7')=7 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 4, 1), '7', '7')=7 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 5, 1), '7', '7')=7 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 6, 1), '7', '7')=7 THEN '1'  
			WHEN DECODE(SUBSTR(ANS_7, 7, 1), '7', '7')=7 THEN '1'  ELSE '0' END) as "ANS_7", 
                (CASE WHEN DECODE(SUBSTR(ANS_7, 0, 1), '8', '8')=8 THEN '1'  WHEN DECODE(SUBSTR(ANS_7, 2, 1), '8', '8')=8 
			THEN '1' WHEN DECODE(SUBSTR(ANS_7, 3, 1), '8', '8')=8 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 4, 1), '8', '8')=8 THEN '1' 
			WHEN DECODE(SUBSTR(ANS_7, 5, 1), '8', '8')=8 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 6, 1), '8', '8')=8 THEN '1'  
			WHEN DECODE(SUBSTR(ANS_7, 7, 1), '8', '8')=8 THEN '1' WHEN DECODE(SUBSTR(ANS_7, 8, 1), '8', '8')=8 THEN '1'  
			ELSE '0' END) as "ANS_8" 
        FROM HP_SURVEY 
        WHERE TITLE = 'smart_research_201102' 
        GROUP BY ANS_7 
          ) M 
    GROUP BY M.PROB_2, M.ANS_1, M.ANS_2, M.ANS_3, M.ANS_4, M.ANS_5, M.ANS_6, M.ANS_7, M.ANS_8 
    ORDER BY MAX(M.REG_DT) DESC 
    ) MM 
;  
==============================================================================================================

- B2BÁúÀÇ/½ÅÃ»¼­ °ü¸®È­¸é Á¦¸ñ ±úÁü ¼öÁ¤ 
Á¦¸ñ: [°Ç¼³°ø»çº¸Çè°¡ÀÔ½ÅÃ»] ==> [°Ç¼³°ø»çº¸Çè_°¡ÀÔ½ÅÃ»] 
http://tb2b.hi.co.kr/b2bmall/techinsu/construction/constructionView04.jsp 
http://tmgr.hi.co.kr/servlet/hi.b2b.manager.servlet.InquiryServlet  
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.23(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00  --> CSÈ¸ÀÇ, È¨ÆäÀÌÁö ÆÄÆ® ÀÎ¼öÀÎ°è È¸ÀÇ(ÇÔ°úÀåÀÌ ¸ÞÀÏ ÀÎ¼ö ¾È ¹Þ´Â´Ù°í È¸ÀÇ Áß ÅðÀå) 

- Çö´ëÇØ»ó SM
- P20110322-0029[º¸»ó»ó´ãÀÚ º¯°æ] 

receiver_id = "Á¶±ÔÈ£/680519/HDMF";  ==> *@*.* 
receiver_id = "¹®º´¿ì/H00224/HDMF";  ==> *@*.* 
==============================================================================================================

- R20110321-00383[Hi ¿©¼º ±ÝÀ¶¾ÆÄ«µ¥¹Ì 2±â ¸ðÁý ¾È³» ÆäÀÌÁö] 
ÀÌ°Å 4¿ù 1ÀÏ ¿ÀÇÂ¿¹Á¤ÀÎµ¥¿ä... 
1) 1->2±â·Î º¯°æ 
2) ÀÏÁ¤, Àå¼Ò µî ³»¿ë ¼öÁ¤(ÀÌ¹ÌÁö ÀÛ¾÷) 
3) »çÁø µî·Ï »èÁ¦ 
4) Ãâ½ÅÇÐ±³, Á÷Àå¸í Ãß°¡    
´ÙÁß°ª    
==============================================================================================================

- HP_SURVEY Å×ÀÌºí º¹±¸ ¿äÃ»(¼¾ÅÍ±â¼úÆÀ ±èÁ¤ÈÆ ==> DAÆÀ ±è¹ÎÈ£ ´ë¸®) 
1. ¼³¹®Á¶»ç Á¤º¸ Å×ÀÌºí(HP_SURVEY) 
2. µî·ÏÀÏ(REG_DT): 2011³â 3¿ù 16ÀÏ ~ 22ÀÏ µ¥ÀÌÅ¸ 
1) HOST IP: 10.18.5.170, HOST NAME: www.hi.co.kr 
2) º¹±¸½ÃÁ¡: 2011.03.16 00:00 ~ 2011.03.21 10:30 
------------------------------------------------------------------------------------------------------------------------------- 

- P20110311-0018[±â»óÁ¤º¸ SMS ¼­ºñ½º ¸¸Á·µµ ¼³¹®Á¶»ç] ¸ÞÀÏ ¹ß¼Û ¿Ï·á 
1. P20110311-0018[±â»óÁ¤º¸ SMS ¼­ºñ½º ¸¸Á·µµ ¼³¹®Á¶»ç] ¸ÞÀÏ ¹ß¼Û ¾÷¹«¿¡¼­ 
 Çö¾÷ÀÌ ¸ÞÀÏ Å×½ºÆ® ¹ß¼Û Áß »èÁ¦ ¿äÃ»À¸·Î ÀÎÇÑ »èÁ¦  
2. ±âÁ¸¿¡´Â ¼³¹®Á¶»ç Á¤º¸ Å×ÀÌºí(HP_SURVEY) »èÁ¦ ±ÇÇÑ Á¸Àç ===> 3¿ù ÀÌÈÄ·Î DAÆÀ¿¡¼­ »èÁ¦ ±ÇÇÑ È¸¼ö 
3. Å×ÀÌºí°ü¸®(http://homeadmin.hi.co.kr/manager/home/replace/req_replace.jsp)¿¡¼­ Ã³¸® 
  ==> »èÁ¦ ÇÊµå Á¦´ë·Î ³Ö¾ú´Âµ¥ »èÁ¦µÈ °ÍÀ¸·Î ÃßÁ¤µÊ  
4. ¼¾ÅÍ±â¼úÆÀ ±èÁ¤ÈÆ »ç¿ø¿¡ º¹±¸ ¿äÃ»(2011.03.22(È­)) 
5. ±èÁ¤ÈÆ »ç¿øÀÌ Ã³¸®ÇØ¼­  DAÆÀ ±è¹ÎÈ£ ´ë¸®¿¡¼­ Àü´Þ(µ¥ÀÌÅ¸´Â Á¸ÀçÇÏ´Â °ÍÀ¸·Î Åëº¸ ÇØÁÜ) 
Backupº¹±¸ÀÇ·Ú¼­(HI_DC).xll 
http://www.hi.co.kr/data/goods/hicar(110302)_1.pdf  ==> /B2C/upload2/hib2c/data/goods/hicar(110302)_1.pdf 
==============================================================================================================

- ÀÎ¼öÀÎ°è ÀÏÁ¤ 
1. º¸»ó: 2011.03.28(¿ù) 
 1) ÀÚµ¿Â÷ º¸»ó 
 2) »óÇØ/Áúº´ º¸»ó 
2. ¸ÞÀÏ: 2011.03.29(È­) ~ 03.30(¼ö) 
1) ´ë·® ¸ÞÀÏ Å×½ºÆ® ¹ß¼Û 
2) ÀÌº¥Æ® ¸ÞÀÏ Å×½ºÆ® ¹ß¼Û 
3. B2B: 2011.03.31(¸ñ) 
 1) °è¾à°ü¸® 
 2) ¸¶ÀÌµ¥½ºÅ© 
 3) ±ÞºÎ±Ý°ü¸® 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.24(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00 

- Çö´ëÇØ»ó SM
- P20110322-0029[º¸»ó»ó´ãÀÚ º¯°æ] ÀÌÇà ¿Ï·á 
==> ÀÚ¿ø
: 9°³(JSP: 5 JAVA: 4) ==> (JSP: 10, JAVA: 8, CLASS: 4)(»êÃâ¹° Æ÷ÇÔ) ==> ÃÑ 22°³ 
http://thome.hi.co.kr/amends/counsel/expert/amendsoneconselSelectView.jsp  
==============================================================================================================

- Çö´ëÇØ»ó SM »êÃâ¹° ÀÛ¼º 
1. »óÇØ_Áúº´ º¸»ó 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.25(±Ý) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00 

- Çö´ëÇØ»ó SM
- Çö´ëÇØ»ó SM »êÃâ¹° ÀÛ¼º 
1. ÀÚµ¿Â÷ º¸»ó 
==============================================================================================================

- HP_SURVEY_RECOVER(¼³¹®Á¶»ç º¹±¸ Å×ÀÌºí) ÀÛ¾÷(100°Ç ÃßÃâÇØ¼­ ¿¢¼¿·Î º¸³¿) 
--TEMP Á¤º¸ ¼öÁ¤ @@@@@@@@   --> 100 °Ç Ã³¸® 
UPDATE M_TEMP U 
SET U.FLAG = 'S'   --FLAGE 
WHERE EXISTS 
   (SELECT 'x' 
    FROM M_TEMP B 
WHERE B.RSN_NO = U.ID  --FLAG°ª 
            AND B.ID = 'D' --FLAGE 
  ) 
  AND U.ID <>'D'  --FLAGE 
; 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.26(Åä) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- SFR(24Â°ÁÖ)
05:30 ±â»ó 
06:00 Áý Ãâ¹ß 
06:40 ½Å±¸ÃÊµîÇÐ±³ 
06:50 ¼ô°ÔÀÓ(4:3 ÆÐ) 
08:10 Á¾·á 
08:55 Super Fast-Reading ÇÐ¿ø µµÂø 
09:05 µ¶¹ý ÈÆ·Ã(ÀÌÀå·Î´Ô, ±ÇÁÖ¸¸ ±âÀÚ, ÀÌ»è, À±Á¤ÀÚ¸Å) ===> ¿ª¼Ó¹ý Àû¿ë 
12:20 Áß½Ä 
14:30 µ¶¹ý ÈÆ·Ã Á¾·á 
14:50 ¼Ó¹ý ÈÆ·Ã 
80:00 Á¾·á 
19:30 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.27(ÀÏ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:30 ~ 00:00 

- ISA(½ÉÈ­)(3ÁÖÂ÷)
06:00 ±â»ó 
07:00 ¿¹¹è(±¤¸²±³È¸) ==> ¼³±³(±èÁ¤¼® ¸ñ»ç: »ý¸í·Â ÀÖ´Â ¹ÏÀ½À» ¼ÒÀ¯ÇÏ¶ó) 
08:30 Á¾·á 
08:35 ¾Ð±¸Á¤¿ª(7-2Ãâ±¸) 
08:50 °æº¹±Ã¿ª(6¹ø Ãâ±¸) 
08:50 KPC µµÂø 
09:00 [D03] DB ½ÃÇè(60¹®Á¦)(405È£ --> 401È£)  ==> °øºÎ Á¦´ë·Î ÇÒ °Í 
10:00 [D03] DB °­ÀÇ(±èÀºÁ¤ °¨¸®»ç) 
12:00 Áß½Ä 
13:00 [D03] DB °­ÀÇ2 
17:30 Á¾·á 
19:30 ±Í°¡ 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.28(¿ù) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 07:40 ~ 18:00  --> ¾ÆÄ§ ´ç¹ø, ÆÀÀå´Ô ¸é´ã(ÀÎ¼öÀÎ°è ¹üÀ§ ÀçÁ¤ÀÇ), ÇÔ°úÀå ¸é´ã(Ä¿ÇÇ¼¥ Á¤´ë¸®¶û ½Î¿ö¼­ Åð»ç ÇÑ´ÙÇÔ) 

- Çö´ëÇØ»ó SM
- Çö´ëÇØ»ó SM º¸»ó ÀÎ¼öÀÎ°è ¼öÇà 
1. º¸»ó(R:\01_È¨ÆäÀÌÁö\ÀÎÅÍ³Ý\22    ¾÷¹« ÀÎ¼öÀÎ°è\ÀÎ¼öÀÎ°è(ÁøÅÂ¸¸)) 
 1) ÀÎ¼öÀÎ°èÀÚ: ±Ç¿Àµæ ´ë¸®, Ãµ¼¼¼± °úÀå 
2. ÀÌ¸ÞÀÏ 
 1) ÀÎ¼öÀÎ°èÀÚ: ¾ÈÀç±¤ Â÷Àå, ÇÔÀºÁø °úÀå, Á¤ÀÏ¿µ ´ë¸® 
 2) ÀÎ¼öÀÎ°è »êÃâ¹° °æ·Î: R:\01_È¨ÆäÀÌÁö\ÀÎÅÍ³Ý\22 ¾÷¹« ÀÎ¼öÀÎ°è\ÀÎ¼öÀÎ°è(ÁøÅÂ¸¸) 
==============================================================================================================


- ±³Åë»ç°í»çÇ× ¹× Áö±Þ°áÀÇÈ®ÀÎ¼­ Á¶È¸ 
1. 7811071178414(¹ÚÁöÈÆ)À¸·Î Á¶È¸ 
 1) ±³Åë»ç°í»çÇ×¸®½ºÆ®(ÇÇÇØÀÚ·Î Á¶È¸): 1°Ç 
  - 1010027617(Á¢¼ö¹øÈ£) ¹ÚÁöÈÆ 
 2) ±³Åë»ç°í»çÇ×¸®½ºÆ®(ÇÇº¸ÇèÀÚ·Î Á¶È¸): 1°Ç 
  - 1010027617(Á¢¼ö¹øÈ£) ·ùÁØ¿í 
  - 1010027617(Á¢¼ö¹øÈ£) ÀÓÇÑ¿ë 
  - 1010027617(Á¢¼ö¹øÈ£) ¹ÚÁöÈÆ 
==============================================================================================================

º¸»ó  --> 2011.03.28(¿ù) ~ 2011.03.30(¼ö) 
 - »ç°íÁ¢¼ö(Àå±â) ¾÷¹«¼³¸í ¹× ÀÎÅÍÆäÀÌ½º ¼³¸í            2011.03.28(¿ù) 15:00 ~ 16:00 
 - »ç°íÁ¢¼ö(ÀÚµ¿Â÷) ¾÷¹«¼³¸í ¹× ÀÎÅÍÆäÀÌ½º ¼³¸í          2011.03.28(¿ù) 15:00 ~ 16:00 
 - ÆÄÀÏ¾÷·Îµå ÄÄÆ÷³ÍÆ® ¼³¸í, ´ã´çÀÚ ¿¬¶ô¹æ¹ý             2011.03.29(È­) 10:00 ~ 11:00 
 - º¸»óÃ³¸®Á¶È¸(Àå±â) ¾÷¹«¼³¸í ¹× ÀÎÅÍÆäÀÌ½º ¼³¸í        2011.03.29(¿ù) 15:00 ~ 16:00 
 - º¸»óÃ³¸®Á¶È¸(ÀÚµ¿Â÷) ¾÷¹«¼³¸í ¹× ÀÎÅÍÆäÀÌ½º ¼³¸í      2011.03.29(¿ù) 15:00 ~ 16:00 
 - ±³Åë»ç°í Áö±Þ°áÀÇÈ®ÀÎ¼­ ¼³¸í¹×Ãâ·Â¹æ¹ý(Å×½ºÆ®,¸®¾ó)   2011.03.29(¿ù) 15:00 ~ 16:00 

¸ÞÀÏ  --> 2011.03.28(¿ù) ~ 2011.03.29(È­) 
- ¸ÞÀÏ¹ß¼Û½Ã ¾÷¹«ºÎ°¡ ¾î¶»°Ô ¿äÃ»ÇÏ´ÂÁö ¹× ´ëÀÀ¹æ¹ý ?   2011.03.28(¿ù) 14:00 ~ 15:00 
- ´ë·®¸ÞÀÏ¹ß¼Û Å×½ºÆ®¹ß¼Û 2011.03.28(¿ù) 14:00 ~ 15:00 
- ´ë·®¸ÞÀÏ¹ß¼Û 2011.03.28(¿ù) 14:00 ~ 15:00 
- ÀÌº¥Æ®¸ÞÀÏ¹ß¼Û Å×½ºÆ®¹ß¼Û 2011.03.29(È­) 14:00 ~ 15:00 
- ÀÌº¥Æ®¸ÞÀÏ¹ß¼Û 2011.03.29(È­) 14:00 ~ 15:00 
- ¸ÞÀÏ¹ß¼ÛÈÄ ÀÌ»ó¿©ºÎ È®ÀÎ 2011.03.29(È­) 14:00 ~ 15:00 
- ¸ÞÀÏ¹ß¼Û ½ÇÆÐ½Ã Á¶Ä¡¹æ¹ý 2011.03.29(È­) 14:00 ~ 15:00 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.29(È­) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:20 ~ 18:00 

- Çö´ëÇØ»ó SM
- Çö´ëÇØ»ó SM º¸»ó ÀÎ¼öÀÎ°è ¼öÇà 
1. ÀÌ¸ÞÀÏ(ÇÑ¿ì¸® ¼³¹®Á¶»ç) 
 1) ÀÎ¼öÀÎ°èÀÚ: ¾ÈÀç±¤ Â÷Àå, ÇÔÀºÁø °úÀå, Á¤ÀÏ¿µ ´ë¸® 
http://thome.hi.co.kr/common/research_0911.jsp  
==============================================================================================================

- B2B ¸ÞÀÎ Á¡°Ë(ÀÌ¿¬ÀÇ ´ë¸® ¿äÃ») 
http://tb2b.hi.co.kr/portal/index.jsp 
==============================================================================================================

- °¡°èºÎ ÇÁ·Î±×·¥ ºÐ¼®(VB À©7 XP ´Ù¿î±×·¹ÀÌµå) 
http://www.devpia.com/Maeul/Contents/Detail.aspx?BoardID=47&MAEULNO=19&no=297152&ref=297152 
http://pgr.m.oolzo.com/View.aspx?site=192&page=7&divpage=18&no=101019 
1. C# º¯È¯À» °í¹ÎÇÒ °Í, ¿À¶óÅ¬ DB ¼³Ä¡ 
- ¼¼¸®°¨¸®»ç(http://www.serigamrisa.com), hejhej/abc1234 
==============================================================================================================

- ÀÏÀÏ °èÈ¹Ç¥ ÀÛ¼º 
==============================================================================================================

- DB ==> CUBE, ROLLUP ¿¬»ê 
http://backbaram.blog.me/20110015262 
- M_TEMP Å×ÀÌºí µ¥ÀÌÅ¸  @@@@@@ 
B_ID;I_ID;T_ID;TOTAL 
B1;I1;T1;100 
B1;I2;T2;200 
B1;I3;T3;150 
B2;I1;T1;120 
B2;I2;T2;50 
B2;I4;T3;40 
----------------------------------------------------------------- 
  
1. GROUP BY ROLLUP (x, y) 
= GROUP BY x,y + GROUP BY x + ALL ROWS 
SELECT FLAG, FLAG2, COUNT(*) 
FROM M_TEMP 
GROUP BY FLAG, FLAG2 
UNION 
SELECT FLAG, NULL, COUNT(*) 
FROM M_TEMP 
GROUP BY FLAG 
UNION 
SELECT NULL, NULL, COUNT(*) 
FROM M_TEMP 
; 

-- Á¶È¸ @@@@@@ 
SELECT FLAG as B_ID, FLAG2 as I_ID, COUNT(*) as ÇÕ°è 
FROM M_TEMP 
GROUP BY ROLLUP(FLAG, FLAG2) 
HAVING MAX(ID) ='TEST' 
; 
-- Á¶È¸ °á°ú Data @@@@@@ ===> 9°Ç 
B_ID I_ID ÇÕ°è 
B1 I1 2 
B1 I2 2 
B1 I3 2 
B1 NULL 6 
B2 I1 2 
B2 I2 2 
B2 I4 2 
B2 NULL 6 
NULL NULL386646   

2. GROUP BY CUBE(x, y) 
= GROUP BY x,y + GROUP BY x + GROUP BY y + ALL ROWS  
CUBEÀÇ °æ¿ì ROLLUP°ú ´Ù¸£°Ô °ýÈ£¼Ó ¸¶Áö¸· Á¶°ÇÀ» Á¦¿ÜÇÏ´Â °ÍÀÌ ¾Æ´Ï¶ó °ýÈ£¼Ó¿¡¼­  
³ª¿Ã ¼ö ÀÖ´Â ¸ðµç °æ¿ìÀÇ ¼ö¸¦ GROUP À¸·Î ¹­¾î¼­ º¸¿©ÁÖ°Ô µË´Ï´Ù. 
-- Á¶È¸ @@@@@@ 
SELECT FLAG as B_ID, FLAG2 as I_ID, COUNT(*) as ÇÕ°è   
FROM M_TEMP 
GROUP BY CUBE(FLAG, FLAG2) 
HAVING MAX(ID) ='TEST' 
; 
-- Á¶È¸ °á°ú Data @@@@@@ ===> 13°Ç 
B_ID I_ID ÇÕ°è 
NULL NULL386646 
NULL I1 4 
NULL I2 4 
NULL I3 2 
NULL I4 2 
B1 NULL 6 
B1 I1 2 
B1 I2 2 
B1 I3 2 
B2 NULL 6 
B2 I1 2 
B2 I2 2 
B2 I4 2 

3. GROUP BY GROUPING SETS ÀÇ ±¸¼º¿ä¼Ò¿Í ¿ªÇÒ 
= GROUP BY GROUPING SETS((x,y,z),(x,z)) 
À§ÀÇ CUBE°°Àº °æ¿ì ³Ê¹« ¸¹Àº °á°ú°ªÀÌ ³ª¿­µÇ¾î¼­ È­¸é¿¡ »Ñ·ÁÁý´Ï´Ù.  
±× Áß¿¡¼­ ÇÊ¿äÇÑ °ª¸¸À» ¹­¾î¼­ º¸±â À§ÇØ¼­ ¸¸µé¾îÁø °ÍÀÌ GROUPING SETSÀÔ´Ï´Ù. 
Áï, ÇÊ¿äÇÑ °á°ú°ª¸¸À» ¼±ÅÃÇØ¼­ º¼ ¼ö ÀÖ°Ô ÇØÁÖ´Â °ÍÀÔ´Ï´Ù. 
-- Á¶È¸ @@@@@@ 
SELECT FLAG as B_ID, FLAG2 as I_ID, COUNT(*) as ÇÕ°è  
FROM M_TEMP 
GROUP BY GROUPING SETS (FLAG, FLAG2, ()) 
HAVING MAX(ID) ='TEST' 
; 
-- Á¶È¸ °á°ú Data @@@@@@ ===> 7°Ç 
B_ID I_ID ÇÕ°è 
B1 NULL 6 
B2 NULL 6 
NULL I1 4 
NULL I2 4 
NULL I3 2 
NULL I4 2 
NULLNULL 386646 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.30(¼ö) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00  --> ÇÏ·çÀ£ ½Ä±Ç È¯ºÒ(16Àå: 72,000¿ø): ¿Ï·á 

- Çö´ëÇØ»ó SM
- Çö´ëÇØ»ó SM º¸»ó ÀÎ¼öÀÎ°è »êÃâ¹° Á¤¸® 
==============================================================================================================

- º¸Çè°è¾à´ëÃâ È°¼ºÈ­ ÀÌº¥Æ® 
¡Ú °¡´É±Ý¾×´ë»óÀÚ ÃßÃâ ¹æ¹ý 
1. °í°´(CUSTOMER) Å×ÀÌºí¿¡¼­ email ¼ö½ÅÄÚµå°¡ ±¤°í¸ÞÀÏÀÌ°í Ä·ÆäÀÎ ÀûÀçÀÏ½Ã ±âÁØ(3¿ùÀÇ °æ¿ì: 2¿ù 22ÀÏ¿¡ ÀûÀçµÊ)À¸·Î  
ÀûÁ¦µÈ µ¥ÀÌÅ¸¸¦ ±âÁØÀ¸·Î Á¶È¸ 

¡Ú º¸Çè°è¾à´ëÃâ Ã¤³ÎÀüÈ¯ ÀÌº¥Æ®(ÄÝ¼¾ÅÍ:CALL, Ã¢±¸:DESK) 
1. ÅëÇÕÃ¤³ÎÆÀ ±Ç¿Àµæ ´ë¸®¿¡°Ô 0125_02. º¸Çè°è¾à´ëÃâ_2(°¡´É±Ý¾×).txt ÆÄÀÏ ¹ÞÀº µ¥ÀÌÅ¸¿¡¼­ Ã¤³Î(ÄÝ¼¾ÅÍ:CALL, Ã¢±¸:DESK)·Î ±¸ºÐ 
2. Ã¤³Î(ÄÝ¼¾ÅÍ:CALL, Ã¢±¸:DESK)ÀÌ°í Ä·ÆäÀÎ ÀûÀçÀÏ½Ã ±âÁØ(3¿ùÀÇ °æ¿ì: 2¿ù 22ÀÏ¿¡ ÀûÀçµÊ)À¸·Î ÀûÁ¦µÈ µ¥ÀÌÅ¸¸¦ ±âÁØÀ¸·Î Á¶È¸ 
==============================================================================================================

- °¡°èºÎ ÇÁ·Î±×·¥ ºÐ¼®(VB À©7 XP ´Ù¿î±×·¹ÀÌµå) 
À©7 VM C# 
1. ¼Ò¼³°°Àº C# 
2. C# Programming Bible 
==============================================================================================================

- °¨¸®»ç ¹®Á¦ ºÐ¼®(2007³â) 
58. µ¥ÀÌÅÍº£ÀÌ½º¿¡¼­ µ¥ÀÌÅÍÀÇ ºü¸¥ °Ë»öÀ» À§ÇØ ÇØ½Ì(Hashing)À» »ç¿ëÇÑ 
´Ù. ÇØ½ÌÀ» È¿À²ÀûÀ¸·Î »ç¿ëÇÏ±â À§ÇØ¼­´Â ÇØ½¬ ÇÔ¼ö(Hash Function)¸¦ 
Àß ¼±ÅÃÇØ¾ß ÇÑ´Ù. ¾Æ·¡ µ¥ÀÌÅÍ¸¦ ´ë»óÀ¸·Î ÇÒ ¶§ °¡Àå È¿À²ÀûÀÎ ÇØ½¬ 
ÇÔ¼ö¸¦ ¼ø¼­´ë·Î ³ª¿­ÇÑ °ÍÀº? 
-- µ¥ÀÌÅÍ Å×ÀÌºí @@@@@@ 
key product_id type_id data 
1 12 1 aa 
2 12 2 aa 
3 14 13 cc 
4 13 4 dd 
- ÇØ½¬ÇÔ¼ö 
°¡. h(x) = product_id % 10 + type_id % 2 
³ª. h(x) = product_id + type_id 
´Ù. h(x) = product_id * 2 + type_id % 4 
¨ç °¡ > ³ª > ´Ù 
¨è °¡ > ´Ù > ³ª 
¨é ´Ù = ³ª > °¡ 
¨ê ³ª > °¡ = ´Ù 

-- Á¶È¸ °á°ú Data @@@@@@ 
key  product_id type_id °¡ ³ª ´Ù 
1 12 1 1.7 13 24.25 
2 12 2 2.2 14 24.5 
3 14 13 7.9 27 31.25 
4 13 4 3.3 17 27 
ÇÕ°è 15.1 71 107 

58-¨ê 
==============================================================================================================

¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á 2011.03.31(¸ñ) ÀÛ¾÷ ¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
---> 08:10 ~ 18:00  --> Çö´ëÇØ»ó SM Ã¶¼ö(ÃâÀÔÁõ ¹Ý³³) 

- Çö´ëÇØ»ó SM
- Çö´ëÇØ»ó SM º¸»ó ÀÎ¼öÀÎ°è »êÃâ¹° Á¤¸® ¹× Ã¶¼ö 
==============================================================================================================

- [½º¸¶Æ® °í°´¼¾ÅÍ ÀÌ¿ë ¸¸Á·µµ Á¶»ç ÀÛ¾÷ÀÇ·Ú] ´çÃ·ÀÚ ¾È³» SMS ¹ß¼Û 
1. SMS Àü¼Û: http://thome.hi.co.kr/7color/sms_test.jsp  
¸Þ¼¼Áö: Çö´ëÇØ»ó ¼³¹®Á¶»ç ÀÌº¥Æ® ´çÃ·! ½º¸¶Æ® °í°´¼¾ÅÍ °øÁö »çÇ×À» È®ÀÎÇØº¸¼¼¿ä~ 
/blog/servlet/BlogSmsTest.java 

SELECT SEQ, SABUN AS RSN_NO, NM, MOBILE, MSG, SENDER   
FROM TRM_BLOG_TEMP  
WHERE SEQ >= 1 AND SEQ <= 100  ORDER BY SEQ 
; 
==============================================================================================================

- À©7 ocx 
1. Visual Studio 6.0 À» ¸»¾¸ÇÏ½Ã´Â °Å¶ó¸é Windows 7 ¿¡¼­´Â È£È¯µÇÁö ¾ÊÀ½. 
2. MSCOMCTL.OCX ¿¡·¯´Â C-->WINDOWS-->System32 ¿¡ ³Ö¾îÁÜ 
http://jeonheejun.com/399 
==============================================================================================================

- SK ºê·Îµå¹êµå °í°´¼¾ÅÍ(ÀÎÅÍ³Ý)
1. °ü¾ÇÇàº¹¼¾ÅÍ T) 1600-0216, ÁÖ¼Ò: ¼­¿ïÆ¯º°½Ã °ü¾Ç±¸ ÀºÃµµ¿ 937-6 ¿øÀÍºôµù 4Ãþ(http://www.skbroadband.com) 
==> 4¿ù 4ÀÏ(¿ù) 9½Ã 30ºÐ A/S ¹æ¹® ¾à¼Ó ÀâÀ½ 
==============================================================================================================
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á
+--------------------------------------------------------// End //--------------------------------------------------------+
¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á¡á