  

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.01.01(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- 2011년 신묘년(辛卯年) 신년 목표
1. 빛 보기 득도(3분 1독) 
2. 7월 감리사 수석 시험 합격 ===> 기술사 시험과 연계 
==============================================================================================================

- SFR(12째주)
07:30 기상 
07:40 개인 훈련 
08:40 집 출발  
08:50 Super Fast-Reading 학원(독법은 혼자 나와서 속법반과 함께 수업): 애들 때문에 시끄러움  
12:20 중식 
13:20 훈련 
16:20 독법 훈련(목사님이 문제점 지적): 유연성, 사뿐(어깨 이용), 짧은 미소, 전투적 실속 
	-  전공책(IT 프레임워크 조언: 내용 요약하라고 함) 
19:20 석식 
17:40 석식(이목사님이 떡국 끓여줌) 
20:20 귀가(정전도사님이 차 태워줌) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.02(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00  

▦조기축구07:00 기상 
08:00 신구초등학교(눈 쌓여 있음)  ==> 디카 가지고 가서 사진 찍음 
08:50 숏게임(3:2 승) 
10:30 게임(5:4 패) 
10:20 종료 
10:30 중식(떡라면 끓여먹음) 
11:00 재설 작업 
12:30 종료 
13:50 Super Fast-Reading 학원 
14:00 독법 휴강(2층에서 개인 훈련(이정숙씨: 외환 딜러 공부) ==> 득도(암독, 영통), 입탈이 안됨 
17:30 석식(컵라면 밥) 
18:00 훈련 
19:30 종료 
19:40 귀가(정전도사님이 차 태워줌) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.03(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:15 ~ 18:30 

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업] 이행 완료 
==> 자원
: 3개(JSP: 2, JAR: 1) ==> (JSP: 4, JAR: 2)(산출물 포함) ==> 총 6개 
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp  
==============================================================================================================

- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지] 
1. Hi 여성 금융아카데미 지원서 신청 
2. 이벤트 메인 레이어 띄우기 
3. 2010년 1월 5일 이행 
Hi 여성 금융아카데미 1기 모집: http://thome.hi.co.kr/events/21101002/hi_finance_academy_sub_2.jsp  
http://thome.hi.co.kr/data/sagojupsu/201011/132.gif 
http://thome.hi.co.kr/data/event/financeacademy1/201101/01.%20증명사진.jpg 

- 사진 올리기 확인 
<script Language="JavaScript">   
var imgNm_full_url = "<%=p_img_full_Nm%>"; //사진업로드명(full URL)   
opener.document.<%=frm%>.<%=imgNm_full_url%>.value = imgNm_full_url; //사진업로드명(full URL)  
opener.document.getElementById('inner_imgUpload').innerHTML = "<img src='"+ imgNm_full_url +"'>";  //부모창을 찾을 때   
self.close(); 
</script> 

<div id="inner_imgUpload" style="border: 1px solid #dcddde;width:104px"> 
<img src="/images/event/2011_01/hi_finance_academy/photo_sample.jpg"></div> <!--// 사진 image //--> 
========================================================================================================= 

- 보상 1월 일정 
1월 초부터 중순: 장기보상 프로세스 리뉴얼 작업 
1월 중순 ~ 2월 초: 자동차보상 실시간 보상처리조회 시스템 개발 
==============================================================================================================

- KPC 정보시스템감리사 심화반(http://www.kpcit.or.kr) 
1. 교육기간: 3월 개강 예정(3월 6일(일) 예상) 
2. 교육비용: 150만원(실제 납부 비용: 115만원) 
3. 교육시간: 16일(128 시간) 
4: 담당자: 남창우, Tel. 02-724-1218 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:05 ~ 18:30  --> 주간보고서 작성 

- 현대해상 SM
- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지] 
1. Hi 여성 금융아카데미 지원서 신청 
2. 이벤트 메인 레이어 띄우기 
3. 2010년 1월 5일 이행 
Hi 여성 금융아카데미 1기 모집: http://thome.hi.co.kr/events/21101002/hi_finance_academy_sub_2.jsp  
/cybercenter/contractcenter/change/contractInfoView.jsp 
EVT_WOMEN_ACA: 하이여성금융아카데미_기본사항 
EVT_WOMEN_ACA_2: 하이여성금융아카데미_가족사항 
EVT_WOMEN_ACA_3: 하이여성금융아카데미_경력사항  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30  --> CS 회의, 아침 당번 

- 현대해상 SM
- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지] 이행 완료 
==> 자원
: 11개(JSP: 9, JAVA: 2) ==> (JSP: 18, JAVA: 4, CLASS: 2)(산출물 포함) ==> 총 22개 
- 추가 개발 
Hi 여성 금융아카데미 1기 모집 신청 리스트: /events/21101002/hi_finance_academy_list.jsp 
Hi 여성 금융아카데미 1기 모집 신청 리스트 상세조회: /events/21101002/hi_finance_academy_dtl.jsp 
Hi 여성 금융아카데미 1기 모집 신청 리스트 엑셀 다운로드: /events/21101002/hi_finance_academy_excel.jsp 
/manager/opark/cine/cine_view.jsp 
==============================================================================================================

- P20110104-0003[장기 사고접수 관련 포털이전 작업 요청] 이행 완료 
==> 자원
: 5개(JSP: 1, JAVA: 4) ==> (JSP: 2, JAVA: 8, CLASS: 4)(산출물 포함) ==> 총14개 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- 10시 이전에 Flash 파일 배포서버(/B2C/Appl/hib2c/docs/flash)에 등록할 것 
퀵메뉴: /flash/sub_banner.swf(/quickmenu_event.jsp 파일에 적용 되어 있음) 
1. 서브 이벤트 롤링 배너(SERVICE MENU 밑 오른쪽 배너) 변경 
 1) 10시 이전에 배포서버(/B2C/Appl/hib2c/docs/flash)에 신규 sub_banner.swf(여성 금융아카데미 1기 배너 포함) 파일 등록 
 2) 10시 이후에 이전 sub_banner.swf 파일을 배포서버에 올린 파일(sub_banner.swf)로 변경 
--------------------------------------------------------------------------------------------------------------------- 

- 운영서버에서 파일 업로(/uploadImg_action.jsp)시 아래 에러 발생 
1. 에러 내용: 업로드 처리중 오류가 발생 하였습니다. 
java.lang.IllegalArgumentException: Not a directory: /upload2/hib2c/data/event/financeacademy1/201101,0,  
2. 조치: 배포서버에 폴더 생성 후 테스트 파일 등록(/B2C/upload2/hib2c/data/event/financeacademy1/201101) 
- 01. 증명사진.jpg ==> JAVA에서 폴더 2개(/financeacademy1/201101)는 생성이 안됨 
==============================================================================================================

- P20110106-0024[Hi 여성 금융 아카데미 수정]: 이행 완료(추가 요청) 
1. 사진 필수로 변경 
2. 로그인시 얼럿창 
1) Hi 여성 금융아카데미에 신청하시기 위해서는 로그인이 필요합니다. 감사합니다.  
==============================================================================================================

- 자동차 보상 회의 
1. 일시: 01.06(목) 10시  
2. 장소: 현대해상 10층 회의실 
3. 인원: 유성철 대리, 민운기 대리(보상지원부) 
5. 인터페이스 개발일정: 1/17 ~ 1/21로 계획 
6. 담당자: 이태호(보상손사팀) 
==============================================================================================================

- 운영서버(Admin) 로그 보기 
[SC3-devwas02:hidev01] tail -f /WS11/hib2c/WAS/hib2cSvr11_1/SystemOut.log 
[SC3-devwas02:hidev01] tail -f /WS12/hib2c/WAS/hib2cSvr12_1/SystemOut.log 
[SC3-devwas02:hidev01] tail -f /WS13/hib2c/WAS/hib2cSvr13_1/SystemOut.log 
[SC3-devwas02:hidev01] tail -f /WS14/hib2c/WAS/hib2cSvr14_1/SystemOut.log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 공수 등록 

- 현대해상 SM
- P20110107-0001[Hi 여성 금융아카데미 통계화면 개발] 이행완료 
==> 자원
: 7개(JSP: 6, JAVA: 1) ==> (JSP: 12, JAVA: 2, CLASS: 1)(산출물 포함) ==> 총 15개  
==============================================================================================================

- P20110107-0001[Hi 여성 금융아카데미 통계화면 개발] 
1. Hi 여성 금융아카데미 1기 모집 신청 리스트(페이징 처리): /hi_finance_academy_list_2.jsp 생성 
(http://thome.hi.co.kr/amends/case/amends/amendsknowView01.jsp)  
납입현황 조회(계약조회): /cybercenter/contractcenter/contractlist/longTermView04.jsp 
납입현황 조회: /cis/cisbean/longterm/LTMUE004M01LBean.java 
PageVO 

- 페이징 처리 조회(2번째 페이지) 
SELECT * FROM (   
    SELECT * FROM (          
        SELECT  SEQ_NO, HNAME, JUMIN, BIRTHDAY, ADDR1, EMAIL,                                                                   
        TEL1, TEL2, TEL3, MOBILE1, MOBILE2, MOBILE3,                                                                     
        REG_DATE                                                                         
      FROM EVT_WOMEN_ACA                               
      WHERE APPLY_WAY = '1'                                    
      ORDER BY REG_DATE DESC   
  ) WHERE ROWNUM <=20    
  ORDER BY REG_DATE ASC   --ORDER BY 처리 
  ) WHERE ROWNUM <= 10  
  ORDER BY REG_DATE DESC    
;  
==============================================================================================================

- 장기사고접수 EDMS 연동작업 수정 
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp  
2. 김현성(손해사정 서류관리팀) 
==============================================================================================================

- 통합채널팀 신년회 
일시 : 2011년1월7일(금) 저녁 20시 
장소 : 박찬수 과장님 집(서울 강남구 개포동 주공 4단지 450동 505호: 개포동역(분당선)) 

18:20 퇴근 
18:40 지하철(시청역 --> 종로3가역 --> 대치역) 
19:30 택시(팀장, 정대리, 안차장) 
20:30 도착(개포동 주공 4단지 450동): 아파트 낡고 좁고 우풍 심함 
20:40 석식(피자 --> 통닭 --> 탕수육): 통닭 남은거 4마리 사옴 
22:20 종료 
22:30 버스(461번) 
23:30 행운동 주민센터 
23:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.08(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(13째주) 
08:10 기상 
08:40 집 출발  
08:50 Super Fast-Reading 학원(합동 훈련: 독법은 2명(장로님, 신입 기자), 속법반과 함께 수업): 애들 때문에 시끄러움  
12:20 중식  
16:20 독법 훈련 
17:20 종료 
18:40 흑서점(중고 성경책 구경) 
19:20 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.09(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00  

▦조기축구
08:00 기상 
09:00 신구초등학교 
09:20 게임(2:3 패) 
10:00 종료 
10:10 게임(6:2 승): 3골 1어시스트  
11:00 종료 
11:20 류명국 해장국(이영민 신입회장님이 쏨) ==> 이영환(*)이 펀드 추천해준다고 함 
12:20 당구장(병춘이형이랑 같이 80 놓고 승) 
13:40 종료 
14:30 Super Fast-Reading 학원(지각해서 목사님한테 혼남): 3층 교회에서 속법, 독법(장원장님, 김흥선씨) 분리해서 훈련 
15:00 독법 훈련(목사님이 문제점 지적): 빰, 뺌, 뱃(라운드, 몸): 탈입, 눈 크게(편안) 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:10 종료 
19:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- P20110107-0045[Lfie is Hi 內 날씨정보 메뉴 및 링크 추가 작업] 
1. Life is Hi: http://thome.hi.co.kr/happyplus/life/LifeView01.jsp 
<MainMenu nm = "날씨정보" url = "http://weather.hi.co.kr" link = "_blank" cd = "12" ></MainMenu>  
==============================================================================================================

- P20110107-0044[장기사고접수 프로세스 개선작업] 
http://thome.hi.co.kr/amends/damage/receipt/step00_jubsuMain.jsp 
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp  
==============================================================================================================

- 자동차 보상 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp 
==============================================================================================================

- P20110107-0040[1월 메일진 발송 작업] 
1. 이메일(대량) 발송 인수인계 
2. 메일진 담당자 김희진 사원 
3. 이미지 서버: /images/newimages/mail/mailzine/해당월 (ex.201101) 
==============================================================================================================

** 홈페이지 작업 공지 **** 
현재 각 업무에서 홈페이지 테이블에 있는 회원정보(주소, 연락처, 전번, 기타 등등)를 보여주는 화면을 CIS연동을 
통해서 기간계 정보로 보여주려합니다. 
이에 따라 대상을 파악해서 1월 28까지 반영해야 하므로 1월 11일까지 확인 부탁드립니다. 
대상테이블 : CUSTOMER, ADDRESS 
==============================================================================================================

- 다운로드 창 2개뜸 
원인: XP와 IE7, 8에서 POST 방식 파일 다운로드를 제대로 인식 못하고 같은 이미지 파일을 창 2개로 띠움 
조치: GET 방식 파일 다운로드로 변경 
인터넷 옵션 --> 고급 에서 SmartScreen 필터 사용 체크 해제하면 이 현상이 해결된다. 
http://thome.hi.co.kr/amends/damage/care/imgDown_T.jsp 
http://thome.hi.co.kr/amends/damage/care/ViewAccidentList.jsp 
==============================================================================================================

- 펀드 가입(제일은행: 월 10만원 적립(25일 자동이체)) 
1. 계좌번호: 275-612-029206(고객번호: 0607042) 
2. 펀드명: 한국골드적립삼성주식C1 
3. 펀드유형: 추가형(개방): 자유적립식  
4. 만기일: 2016년 1월 11일 
- 키움증권 펀드 계좌 신청(제일은행) 
1. 증권계좌: 4139 506098 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  --> 주간보고서 작성 

- 현대해상 SM
- P20110111-0010[하이 여성 금융아카데미 추가사항]: 이행 완료 
==> 자원: 4개(JSP: 4) ==> (JSP: 8)(산출물 포함) ==> 총 8개 
==============================================================================================================

- P20110107-0044[장기사고접수 프로세스 개선작업] 
http://thome.hi.co.kr/amends/damage/receipt/step00_jubsuMain.jsp 
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp 
/amends/servlet/JubSuListNewServlet.java 
==============================================================================================================

- P20110107-0040[1월 메일진 발송 작업] 
1. 이메일(대량) 발송 인수인계 
2. 메일진 담당자: 김희진 사원 
3. 이미지 서버: /images/newimages/mail/mailzine/해당월 (ex.201101) 
4. 테스트 요청: 1월 메일진(프리테스트) 테스트 부탁 드립니다.  ==> 1월 메일진(프리테스트) 발송 
4. 실제 메일 테스트 요청: 1월 메일진 ==> 1월 메일진 발송(다음날 발송) 
==============================================================================================================

- P20110107-0045[Lfie is Hi 內 날씨정보 메뉴 및 링크 추가 작업] ==> 01.13(목) 이행 예정 
1. Life is Hi: http://thome.hi.co.kr/happyplus/life/LifeView01.jsp 
<MainMenu nm = "날씨정보" url = "http://weather.hi.co.kr" link = "_blank" cd = "12" ></MainMenu>  
==============================================================================================================

- 창맥 최종윤 결혼 
1. 일시: 2011.01.21(토) 17시 
2. 장소: 서울 신도림 테크노 마트 8층 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  --> CS회의 

- 현대해상 SM
- P20110107-0040[1월 메일진 발송 작업] 이행 완료  
1. 제목 넣기 및 최종 확인(현업 담당자): 1월 메일진 ==> 1월 메일진 발송 
==============================================================================================================

- P20110107-0044[장기사고접수 프로세스 개선작업] 
http://thome.hi.co.kr/amends/damage/receipt/step00_jubsuMain.jsp 
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp 
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp 
/amends/servlet/JubSuListNewServlet.java 
==============================================================================================================

- 업무 인수인계 관련 메뉴얼 및 문서 작성  
\\10.81.17.33\\01_홈페이지\인터넷\22 업무 인수인계\인수인계(장미정) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30  --> 아침당번 

- 현대해상 SM
- P20110107-0045[Lfie is Hi 內 날씨정보 메뉴 및 링크 추가 작업] 이행 완료 
==> 자원
: 1개(JSP: 1, XML: 1) ==> (JSP: 1, XML: 1)(산출물 포함) ==> 총 2개 
1. Life is Hi: http://thome.hi.co.kr/happyplus/life/LifeView01.jsp 
<MainMenu nm = "날씨정보" url = "http://weather.hi.co.kr" link = "_blank" cd = "12" ></MainMenu>  
==============================================================================================================

- P20110112-0042[홈페이지 內 회사소개 수정] 
1. 연도별 연혁: http://thome.hi.co.kr/company/ko/info/history/historyView03.jsp 
==============================================================================================================

- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
1. 공시 등록/수정에 대한 로그 파일 확인 가능 하도록 작업 
2. 등록 파일 용량 제한 개선 
3. 엑셀 파일 업로드 방식 병행으로 편의성 증대 

판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
개인연금신공시이율(관리자):http://tmgr.hi.co.kr/manager/company/declared/writeForm.jsp?code=AE01&type=1 
개인연금신공시이율: http://thome.hi.co.kr/company/ko/notice/products/productsView06_7.jsp 
==============================================================================================================

- 사진 안 보임 
파일 형식이 틀려서 안보인다고 합니다. 
박미영 http://www.hi.co.kr/data/event/financeacademy1/201101/증명사진.hwp  ====> hwp 파일 형식에 안 맞음(직접 치면 나옴) 
이남경 http://www.hi.co.kr/data/event/financeacademy1/201101/%EA%B0%80%EC%A1%B1%EC%82%AC%EC%A7%84059.jpg 
고선미 http://www.hi.co.kr/data/event/financeacademy1/201101/%EA%BE%B8%EB%AF%B8%EA%B8%B0_6.JPG 
==============================================================================================================

- 미래에셋 펀드 계좌 신청(제일은행) 
1. 증권계좌: 052 99 007971(05299007971) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.0114(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30 

- 현대해상 SM
- P20110112-0042[홈페이지 內 회사소개 수정] 이행 완료 
==> 자원
: 8개(JSP: 7, CSS: 1) ==>  (JSP: 14, CSS: 1)(산출물 포함(CSS 산출물 없음)) ==> 총 15개 
1. 연도별 연혁(전체보기): /company/ko/info/history/historyView03_1.jsp 
2. 연도별 연혁(연도별보기): /company/ko/info/history/historyView03.jsp 
3. 고객만족 활동: /company/ko/info/cs/csView01.jsp 
4. 대외수상내역: /company/ko/pr/award/award01.jsp 
5. 예금자보호: /company/ko/notice/products/productsView07.jsp 
6. 하계/동계 이동보상센터: /amends/service/summer/m_centerView01.jsp 
7. 현대해상 부가서비스: /amends/service/add/addView01.jsp 
==============================================================================================================

- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 

#판매중/판매중지 상품 File Path  ==> b2c.upload.path=/Appl/upload2/hib2c 
b2c.goods.img.path=/data/goods 
==============================================================================================================

- 예금주와피보험자와의관계 수정 
1. 예금주와 피보험자와의 관계가 01,02 이렇게 들어와야 함 
/CLRF0100M01IBean.java 파일에서 
String strInsrdRlCat = ""; 
if (strInsrdRlCatNm.equals("P"))   //예금주와피보험자와의관계(01:본인, 02:부모) 
	strInsrdRlCat = "02"; 
else { 
	strInsrdRlCat = "01"; 
} 

reqList1.setRqptInsrdRlCat(strInsrdRlCat); //예금주와피보험자와의관계(New)(01:본인, 02:부모) 
 ==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.15(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(14째주)
08:10 기상 
08:40 집 출발  
08:50 Super Fast-Reading 학원(합동 훈련: 독법은 5명(이영숙님, 장로님, 권주만 기자), 속법반과 함께 수업): 애들 때문에 시끄러움  
12:20 중식 
16:20 독법 훈련(뺨, 뺌, 뱃) --> 사뿐, 부드러움 
17:00 종료  
17:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.16(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
07:30 기상 
08:30 신구초등학교(최고로 추움: 영하 17.8도) 
08:50 게임(5:4 승) 
10:00 종료 
10:50 놀부부대찌게(치근이형이 쏨): 상요형이 교회 나오라고 꼬심  
12:20 종료 
12:30 이영환집(서울시 강남구 논현동 9-9 301호: 영동중앙교회 뒷편)  ==> 펀드 조언 들음(경기선행 지수) 
	==> 통계청(http://www.kostat.go.k) ==> 통계DB  ==> 경기종합지수 (경기선행 지수가 마이너스 일때 매입할 것) 
14:50 Super Fast-Reading 학원(2번째 지각): 3층 교회에서 속법, 독법(이영숙님, 장원장님, 이한의사님,  권주만 기자) 분리해서 훈련 
15:00 독법 훈련(목사님이 문제점 지적): 빰, 뺌, 뱃(라운드, 몸): 탈입, 눈 크게(편안) 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:10 종료 
19:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.17(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:10 ~ 18:30 

- 현대해상 SM
- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
==============================================================================================================

- PEIM 일정 
- 93회 
1. 일시: 2011년 02월 20(일) 
2. 결과발표: 2011년 04월 01(금) 
--------------------------------------------------------------------- 
- 95회 
1. 일시: 2011년 08월 07(일) 
2. 결과발표: 2011년 09월 30(금) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 09:40 ~ 18:30  --> 지각(지하철 고장), 주간보고서 작성 

- 현대해상 SM
- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
==============================================================================================================

- P20110118-0020[하이 여성 금융아카데미 이벤트 기간 연장] 이행 완료 
==> 자원: 3개(JSP: 3) ==> (JSP: 6)(산출물 포함) ==> 총 6개 
1. 수정 기간: 2011년 01월 06일(목) ~ 20일(목) 
2. 이미지 수정 
/images/event/2011_01/hi_finance_academy/mainlayer_hifinance2.jpg 
/images/event/2011_01/hi_finance_academy/hi_finance_academy12.jpg 
==============================================================================================================

- 퇴직연금사업자공시(관리자) 
http://tmgr.hi.co.kr/manager/company/declared/list.jsp?code=AO01&type=2 
1. 퇴직연금사업자공시: http://thome.hi.co.kr/company/ko/notice/retirefee/retirefeeView01_4.jsp 
==============================================================================================================

- eclipse 줄번호 
1. window - preference 에서, Java - Editor로 이동한 다음 "Show line numbers"를 체크 
==============================================================================================================

- 미래에셋 
http://www.miraeassetaccount.com,  tamario2/ss*t**1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.19(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> CS회의 

- 현대해상 SM
- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 등록: /manager/company/goods/goods_ins.jsp 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
==============================================================================================================

- P20110118-0041[Hi+고객할인서비스(제휴할인서비스) 리뉴얼 안내 이메일] 이행 완료 
1. 메일 발송 전 확인 요청: 희진씨, 메일 확인 요청 드립니다. 
http://211.192.0.42/ems60/MassStatPrevMsg.do 
3. 이미지 서버: /images/newimages/mail/event/201101 
==============================================================================================================

- 통합채널팀 카랜더 추가요건 
1) 마우스 오버시 풍선도움말/추가정보  둘 중 하나만 나오도록... 
   -> 내용은 핸드폰 번호로 변경 
2) 통합채널팀 조직도 화면에 포함 
3) 당직자 임시배정 기능(자동배정 -> 수정) / 입력방법 선택 
    -> 당직자 및 주요작업이 한정적임 
4) 상단의 선택사항 (당직자 칼랜더/주요작업 칼랜더) 
   -선택 사항추가 (전체/파트별) 
5) 이전달 내용 복사기능(??) 
6) 당직자에게 전날 저녁 21시에 sms 발송하기 
7) 입력값 앞부분에 홈:----/방:---/채:---/모:---구분값 추가 
   (홈페이지,방카,채널,모바일) 
==============================================================================================================

- IP 주소(현대해상 SM), PNP NAT 변경 
IP 주소: 10.81.17.61 
GW: 10.81.17.1, SM: 255.255.255.0 
DNS: 10.1.17.242, 10.3.22.50 
PNP NAT(진태만): 050761/ssjtm881(진태만) ==>  050761/aa050761(진태만), STGClient: IA1038/IA1038 
PNP NAT(장미정 사원): 101636/aa101636(장미정 사원) 
사번: i050761, PMS ID: IA1308/ssj**8** 
==============================================================================================================

- 휴대폰 추천(핸드폰) 
1. 큐브릭2: http://blog.naver.com/dmlgus916?Redirect=Log&logNo=150093294868 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
 - P20110119-0022[한우리 만족도 조사 이메일 발송] 이행 완료 
 ==> 자원: 1개(JSP: 1) ==> (JSP: 2)(산출물 포함) ==> 총 2개 
http://thome.hi.co.kr/common/research_0911.jsp?flag=10051 
==============================================================================================================

- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 등록: /manager/company/goods/goods_ins.jsp 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
==============================================================================================================

- 팩스 수신 오류  
1. 현상 
1) 홈페이지 보상창구-팩스수신확인 에서 발신팩스번호를 입력하고 조회를 하면 수신내역이 보이지 않는다고 합니다. 
(포털에서는 팩스로 보내주신 서류가 6장 조회가 됨)  
* 권도연 : 800427-2178213(*)  /  팩스번호 : 02-721-3294(027213294) 
2. 조치: 
1) CLMQ9200M03LBean.java에 팩스 수신 CIS 확인 에러 확인(CIS 전문 에러로 추정됨) 
1) CIS 전문(IR_HI-HOME_0975(이미지팩스수신조회))을 보상손사팀 윤종규씨에게 전송하여 처리 부탁 
3. 결과 
 1) CIS 보상손사팀에서 모듈 추가 후 schCat 필드 추가를 우리쪽에 통보 안해줘서 조회 안 된것으로 추정됨 
 2) schCat 필드 추가(21일(금)에 이행하기로 함) 
- /cis/cisbean/amends/CLMQ9200M03LBean.java 파일에서 추가 
<schCat>1</schCat> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 아침당번 

- 현대해상 SM
- P20110119-0016[홈페이지 內  회사소개 수정(기업정보, 공시실 외) 작업] 이행 완료  
==> 자원
: 4개(JSP: 4) ==>  (JSP: 8)(산출물 포함) ==> 총 8개 
==============================================================================================================

- P20110121-0005[팩스수신조회 수정에 따른 수정사항 반영] 이행 완료  
==> 자원
: 1개(JAVA: 1) ==> (JAVA: 1, CLASS: 1)(산출물 포함) ==> 총 3개 
- /cis/cisbean/amends/CLMQ9200M03LBean.java 파일에서 추가 
<schCat>1</schCat> 
==============================================================================================================

- P20110121-0006[문구수정작업] 이행 완료  
==> 자원
: 1개(JSP: 1) ==>  (JSP: 1)(산출물 포함) ==> 총 2개 
1. 담보별 상세내용조회: /cybercenter/bosangcenter/bosangDamboDetail.jsp 
==============================================================================================================

- P20110119-0022[한우리 만족도 조사 이메일 발송 처리] 이메일 발송 완료 
http://211.192.0.42/ems60/MassStatPrevMsg.do에서  
한우리 만족도 조사 --> 대량 메시지 --> 작성중 목록 
캠페인: 한우리 만족도 조사 
1. 우수고객(회원): SQL*Loader 한우리설문(회원): 메일 주소 없음(한우리설문(회원).txt) 
2. 우수고객(비회원): 파일 타겟팅(한우리설문(비회원).txt) 
- 이메일 발송테스트는 해봐야 합니다. 
- 만족도 조사라 고유 넘버는 회원메일당 하나씩 일괄 부여 했어요. 
----------------------------------------------------------------------------------- 

01. 회원: SQL*Loader 한우리설문(회원): 메일 주소 없음(한우리설문(회원).txt) 
02. 비회원: 파일 타겟팅(한우리설문(비회원).txt) 
정천효 1 : 설문내용 111111 
심상헌 4048 : 설문내용 22222  
---------------------------------------------------------------------------------------- 

- SQL*Loader 에러 
1. 원인: TNS 에러 
SQL*Loader-704: Internal error: ulconnect: OCIServerAttach [0] 
ORA-12154: TNS:서비스명를 해석할 수 없습니다 
2. 조치: sqlldr userid=dpimasdba/imasdba07@RAC1_1 ==> sqlldr userid=dpimasdba/imasdba07@01_HOME로 변경 
==============================================================================================================

- R20110113-0010[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 등록: /manager/company/goods/goods_ins.jsp 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.22(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(15째주)
08:10 기상 
08:20 청소 
08:40 집 출발  
09:05 Super Fast-Reading 학원(합동 훈련: 독법은 5명(장로님, 권주만 기자), 속법반과 함께 수업): 승찬, 승빈 
	독법반으로 올라옴(여전히 시끄러움) 
13:00 중식 
14:50 종료 
15:30 귀가 
15:40 SK 브로드밴드 설치(기사 방문) 
17:00 최종윤 결혼(서울 신도림 테크노 마트 8층 웨딩홀): 현구, 현노, 광영, 두영 
17:40 석식 
22:00 봉천동 키(초짜) 
21:00 귀가 
==============================================================================================================

- SK 브로드밴드 설치(오전 10시 기사가 와서 설치 완료)  ==> LG파워콤 해지할 것 
1. 신청서비스: B인터넷(광랜W) 
2. 3년 약정: 월 22,000원(장애인 30% 할인) 
3. 계약일: 2011년 01월 21일(3년 약정) 
4. 연락처: SK 브로드밴드: T)6746-0338, 유광현: T)010-9916-4190, 무료상담 전화)080-8282-106 
5. 인터넷품질테스트:  한국정보화진흥원(http://speed.nia.or.kr/speedtest/default.asp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.23(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
08:00 기상 
08:50 신구초등학교 
08:50 게임(10:6 패): 1골 넣음 
10:30 종료 
11:20 다미식당(상요형이 쏨): 압구정역 2번 출구 우리은행 압구정점 근처 
12:10 상요형 가게(미성 아파트 상가내) ==> 남권이형이 상요형 용달차 빌림 
12:20 남권이형 오토차 운전(남권이형 이삿짐 나름 도움) 
12:50 한남동 아파트에서 이삿짐 싣기(남권이형 예전집)  ==> 눈 많이 옴 
14:20 이삿짐 내리기(한남동 빌라) 
14:30 종료  ==> 수고비(만원)와 소니 노트북 가방 선물 받음 
14:40 신사역  
15:30 Super Fast-Reading 학원(3번째 지각): 3층 교회에서 속법, 독법(이영숙님, 장원장님, 이한의사님,  권주만 기자) 분리해서 훈련 
       - 독법책 2, 3권 받음 
15:00 독법 훈련: 빰, 뺌, 뱃(라운드, 몸): 탈입 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
19:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:30 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 등록: /manager/company/goods/goods_ins.jsp 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 

GOODS_LIST, GOODS_LIST_HIS(판매중인_판매중지상품목록_기록) 
DECLARED, DECLARED_HIS(공시회사_관련정보_기록) 
기록: 공시회사_관련정보_기록 
기록: 판매중인_판매중지상품목록_기록 
------------------------------------------------------------------------------------------------- 

- 메뉴등록(관리자 화면) 
<i50><b>* 기록</b> 
/manager/history/history_list.jsp 
<i51>기록 - 공시회사_관련정보 
/manager/history/history_list.jsp 
<i52>기록 - 판매중인_판매중지상품목록 
/manager/history/history_list.jsp?his_sort=2 
==============================================================================================================

- P20110121-0005[팩스수신조회 수정에 따른 수정사항 반영] 수정 
1. /cis/cisbean/amends/CLRF5500M01LBean.java 파일에서 추가 
<schCat>1</schCat> //조건 구분값 (1:발신번호, 2:수신번호, 3:사고번호) 
해도 팩스 번호 운영계에서 에러가 납니다. 
팩스번호: (027213294, 0221665092)  ==> IR_HI-HOME_0975(이미지팩스수신조회)  
<recvfaxno></recvfaxno>    //수신번호 추가 
<acdtrcpno></acdtrcpno> //사고번호 추가 
가상팩스 : 송대근, 02-2166-1989  
==============================================================================================================

- R20110124-0042[맘스파티 산모교실 2차 메일 발송] 이행 완료  
메일 발송 정보에 존재하는 캠페인명(맘스파티) 1차 개봉자 조회 ==> 2,082건 
캠페인명(맘스파티) 1차 개봉자 ==> 2,146건  
메일 발송 정보 조회 ==> 10,297건 
맘스파티2차 메일 발송 타겟건수  ==> 10,285건(실제 발송 예정 건수) 
맘스파티1차 ==> 12,241건 
===> 190건 차이(이유: EDW_MAIL_AGMT 테이블 다시 조회를 함) 
==============================================================================================================

--메일 발송 결과 정보 조회 @@@@@@@@@@@@@@ ==> 에이메일(dpamailweb/amailweb0903) 
SELECT COUNT(*)    --COUNT(*); 
FROM EMS_MASS_SEND_LIST_01 
WHERE POST_ID ='2011011800001' --캠페인명(맘스파티) 개봉자 ==> 2,146건 
AND OPEN_CNT > 0   -- 메일 열어본 사람  
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:30 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
판매중인상품 등록: /manager/company/goods/goods_ins.jsp 
판매중인상품 수정: /manager/company/goods/goods_edit.jsp 
판매상품목록(상품공시) http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp  
his_flag(기록 데이타 여부): 사용 해야 할 것으로 판단됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.25(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 주간보고서 작성, 하루웰 식권 구매(22장: 9만 9천원) 

- 현대해상 SM
- P20110125-0008 [팩스 수신조회 내역 변경 사항 반영작업] 이행 완료  
==> 자원
: 2개(JAVA: 2) ==> (JAVA: 4, CLASS: 2)(산출물 포함) ==> 총6개 
==============================================================================================================

- R20110124-0038[보험계약대출 채널전환이벤트 및 가능금액 이메일 발송] 이행 완료   
메일 발송 정보 조회 ==> 10,297건 
==============================================================================================================

- R20110124-0042[맘스파티 산모교실 2차 메일 발송] 이행 완료  
메일 발송 정보에 존재하는 캠페인명(맘스파티) 1차 개봉자 조회 ==> 2,082건 
캠페인명(맘스파티) 1차 개봉자 ==> 2,146건  
메일 발송 정보 조회 ==> 10,297건 
==============================================================================================================

- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
판매중인상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=S 
판매중지상품 list: http://tmgr.hi.co.kr/manager/company/goods/goods_list.jsp?DIV=N 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.26(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> CS회의 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
1. 상품공시 수정 
금리연동형상품별적용율: http://tmgr.hi.co.kr/manager/company/declared/writeForm.jsp?code=AA01&type=1 
보험계약대출이율: http://tmgr.hi.co.kr/manager/company/declared/writeForm.jsp?code=AC01&type=2 
구분값(2011년, 2010년)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 설연휴 기차표 구매(서울역 방문, 입석): 2월 2일 13:20분(18,800원) 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업]  
3. 기록 - 공시회사_관련정보 메인: /manager/history/history_main.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods 
4. 기록 - 공시회사_관련정보: /manager/history/history_list.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods 

- TR 링크 걸기(TR a href=) 
<a href="/manager/company/declared/writeForm.jsp?seq_no=<%=rse.getString("SEQ_NO")%>"> 
<tr onmouseover="this.style.backgroundColor='#fdefb1'" onmouseout="this.style.backgroundColor='#fff'" style="cursor:hand"> 
<td width="40" height="28" align="center"><%=rse.getString("SEQ_NO")%></td> 
<td width="80" height="28"><%=rse.getString("SEQ")%></td>  
</tr></a> 
==============================================================================================================

- 예금자보호관련 페이지 수정 Flash 등록(배포 서버) 
/flash/newflash/footer1.swf 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 공수 등록 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 
3. 기록 - 공시관련 정보 메인: /manager/history/history_main.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods 
4. 기록 - 공시관련 정보 리스트: /manager/history/historyGongsi_list.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods 
5. 기록 - 회사소개관련 정보 리스트: /manager/history/history_list.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods  
6. 기록 - 공시회사_관련정보 상세조회: /manager/history/history_detail.jsp 
C:\svnroot\homeadmin\HOMEADMIN\ONLINE\hi_mgr.ear\hi_mgr.war/manager/company/goods  
==============================================================================================================

- R20110126-0005[설연휴 여행보험 이메일 발송] 취소 
==> 보험업법 개정에 따라 상품설명서 추가가 선행이 되어야 하는 상황이 발생해서 발송하지 않는 것으로  
결론 지음(현업: 이병식 과장) 
1그룹 : [1]당사 계약자(TRIP_1) ==> 453,503건 
2그룹 : [2]비계약자(TRIP_3) ==> 345,184건 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(16째주)
07:40 기상 
08:10 집 출발 
09:30 Super Fast-Reading 학원(합동 훈련: 독법은 6명(승빈가족, 이삭, 장로님, 권주만 기자), 속법반과 함께 수업) 
- 바른 자세, 잔상 훈련 
13:00 중식 
18:00 종료 
18:30 귀가 
20:00 석식 
22:00 신림 키(아영: 대 실망) 
23:00 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.30(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
06:10 기상 
07:00 예배(광림교회: 처음으로 감) 
08:30 종료(정문에서 상요형과 전도사님 봄) 
08:40 신구초등학교 
08:50 게임(5:5 무): 1골 넣음 
10:30 종료 
11:00 수정식당(남권형이 쏨) 
13:00 Super Fast-Reading 학원: 3층 교회에서 속법, 독법(이영숙님, 장원장님, 승빈가족) 분리해서 훈련 
       - 목사님이 몸이 안좋아 계속 훈련만 함 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
19:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.01.31(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30   --> 아침당번 

- 현대해상 SM
- P20110124-0019[회사소개_교통기후연구소 신규 페이지 추가] 수정 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■