  

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.02) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.02.01(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:00 

- 현대해상 SM
- P20110124-0019[회사소개_교통기후연구소 신규 페이지 추가] 이행완료 
==> 자원
: 9개(JSP: 9) ==>  (JSP: 18)(산출물 포함) ==> 총 18개 
==============================================================================================================

- 사고접수 오류 
1. 피보험자(INSURED_NAME)과 사고당사자(PIBO_NM) 필드 바뀜 
2. 791200 차진영 ==>  사고접수 정상적으로 되었는데 홈페이지에서 사고접수 내역 안뜸 
계약자명 피보험자명 사고당사자 
최종민 최종민 차진영 
최종민 최종민 차진영 
217341 L20043327786 차진영(피보험자)   최종민(계약자)   
217114 L20043327786 차진영(피보험자)   최종민(계약자)    
==============================================================================================================

- SAGO_JUBSU 테이블에서 
계약자 주민번호(INSURANT_NO), 계약자(INSURANT_NAME) 
사고당사자 주민번호(대표피보험자 등록번호)(PIBO_RSNNO), 사고당사자(대표피보험자)(PIBO_NM) 
피보험자 주민번호(INSURED_NO), 피보험자(INSURED_NAME)   ==> 사용 안함  
==============================================================================================================

- SLA 대비 파일 프로그램명 정리 작업 
1. 작업본 - 201101_팀별화면수 조사(통합채널팀).xll 
==============================================================================================================

- 명절 SMS 문자(명절 문자) 
1. 2.3(수) 서울역 -> 동대구(13:20) 무궁화, 2.5(토) 포항 -> 서울(00:20)  심야우등 
==============================================================================================================

1. LG 파워콤 취소: 1644-7000  ===> 2월 1일에 취소할 것(취소 완료) 
2, 진덕근 주민번호 등록일자: 2000.02.19(360710-10) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.02(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 설 연휴
07:00 기상 
07:10 목욕(봉천동 태화 사우나: 4,500원)  
08:10 귀가 
09:00 광속독 훈련 
11:50 종료 
12:00 중식 
12:30 집 출발 
13:10 서울역 
13:10 무궁화호(서울 --> 옥천): 입석 
15:30 무궁화호(옥천 --> 동대구): 좌석 
17:20 동대구역 
17:30 리무진 버스(동대구역 --> 포항 터미널: 7,300원): 영천IC, 경주 국도 경유 
18:40 포항 터미널 
18:50 107번 버스 승차 
19:10 최가네 삼겹살(참석비: 2만, 1월까지 회비:4만): 총 6만원 납부 ==> 동영형, 봉춘, 정하 미차석 
21:20 종료 
21:30 당구(주남형, 정철, 50 놓고 짐): 7,000원 
22:50 종료 
23:50 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.01(토) 작업 ■■■■■■■■■■■■■■■■
  2011.02.03(목) 작업   
■■■■■■■■■■■■■■■■■■ 2011.02.01(토) 작업 ■■■■■■■■■■■■■■■■    
---> 08:00 ~ 00:00 

설날 

07:30 기상   
08:10 작은 아버지, 대규 
08:20 차례(수일 용돈: 만원) 
09:20 대동 우방 203호 
09:40 차례 
11:30 이모집(경태 딸 나연에게 만원 줌) 
14:00 피곤해서 이모집에서 잠 
17:00 석식(떡국) 
19:00 외가집(영철, 성철 외삼촌(동훈)) 
20:00 외할매 용돈(2만원) 
20:40 귀가 
23:30 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.01(토) 작업 ■■■■■■■■■■■■■■■■
  2011.02.04(금) 작업   
■■■■■■■■■■■■■■■■■■ 2011.02.01(토) 작업 ■■■■■■■■■■■■■■■■    
---> 08:00 ~ 00:00 

설 연휴 

09:00 기상 
10:00 조식 
13:20 염색(DR 맥스루미넌스(흑갈색)): 5,980원 
14:00 포항집 출발 
14:40 전자랜드(에어컨 비교 견적) 
15:40 하이마트(에어컨 비교 견적) 
16:00 전자랜드로 결정 ==> 우현점 남현준 부점장 HP)010-6230-5719, *@*.*,  제일은: 754-10-012796 
16:30 귀가 
22:20 석식 
23:10 포항집 출발 
00:10 포항 고속버스 터미널 
00:30 포항 출발 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.05(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(17째주)
04:30 강남터미널(4시간 걸림) 
05:30 4318 버스(고속터미널) 
05:40 5524 버스(방배경찰서) 
06:00 귀가 
08:20 집 출발 
08:30 Super Fast-Reading 학원 
09:00 훈련(승빈가족, 이삭, 장로님, 권주만 기자) - 바른 자세, 잔상 훈련 
13:00 중식 
17:30 석식 
19:30 종료  
20:00 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.06(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
06:00 기상 
07:00 예배(광림교회: 새가족환영(남권이형 --> 고양식 장로님(안상요 집사)) 
08:30 종료 
08:40 신구초등학교 
08:50 게임(5:5 무): 1골 넣음 
10:30 게임(8:8 무) 
11:20 종료 
11:30 떡꾹 끓여 먹음 
12:10 상요형 가게(지하: 막걸리) 
14:20 용산역 아이파크 몰(남권이형이 성경책 선물(29,000원)) 
16:00 Super Fast-Reading 학원(3번째 지각): 독법(이영숙님, 장원장님, 이장료님, 선혜, 이삭, 승빈가족) 분리해서 훈련 
       - 입, 빰, 뺌, 탈, 뱃(라운드, 몸) 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
19:40 성경 구입(개역개정판: 4,000원): 흑서점 
20:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.07(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- P20110107-0044[장기사고접수 프로세스 개선작업] 수정 
1. 00. 상해/질병 보험 사고접수 메인 화면:  /amends/damage/receipt/step00_jubsuMain.jsp  --> 완료 
2. 00. 보험금지급 계좌 확인: /amends/damage/receipt/step00_jubsuAccountCheck.jsp  --> 완료 
3. 01. 사고사항 입력: /amends/damage/receipt/step01_JubsuIns.jsp 
4. 02. 접수가능 계약선택: /amends/damage/receipt/step02_jubsuPossiContract.jsp 
5. 03. 구비서류 첨부방법선택: /amends/damage/receipt/step03_PaperAttachWay.jsp 
6. 04. 구비서류접수: /cybercenter/elecinsu/step04_PaperJubsu.jsp 
7. 05. 접수확인서명: /amends/damage/receipt/step05_JubsuConfirmSign.jsp 
==============================================================================================================

- 사고사항 입력 화면에서 
1. 추가 사항 
 1) 사고원인, 이메일 추가 
2. 변경 사항 
 1) 교통상해 ==> 운전(탑승) 차량번호(QUESTION3) ==> 차량(오토바이), 보행  
==============================================================================================================

- P20110119-0022[한우리 만족도 조사 이메일 발송] 한우리설문 결과 데이타 
1. 김희진씨에게 엑셀로 전달(99. 한우리설문 결과.xls) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.08(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 주간보고서 작성 

- 현대해상 SM
- P20110107-0044[장기사고접수 프로세스 개선작업] 작업 
1. 00. 상해/질병 보험 사고접수 메인 화면:  /amends/damage/receipt/step00_jubsuMain.jsp  --> 완료 
2. 00. 보험금지급 계좌 확인: /amends/damage/receipt/step00_jubsuAccountCheck.jsp  --> 완료 
3. 01. 사고사항 입력: /amends/damage/receipt/step01_JubsuIns.jsp --> 완료(일부 완료) 
4. 02. 접수가능 계약선택: /amends/damage/receipt/step02_jubsuPosContract_long.jsp --> 완료(일부 완료) 
4. 02. 접수가능 계약선택: /amends/damage/receipt/step02_jubsuPosContract_longPibo.jsp --> 완료(일부 완료) 
5. 03. 구비서류 첨부방법선택: /amends/damage/receipt/step03_paperAttachWay.jsp  --> 완료 
6. 04. 구비서류접수: /cybercenter/elecinsu/step04_paperJubsuInfo.jsp 
7. 05. 접수확인서명: /amends/damage/receipt/step05_JubsuConfirmSign.jsp 
==============================================================================================================

- 영화 회원권(1년 24편) 
http://ticketmoney.co.kr  ==> SK 브로드밴드 가입 사은품 (유효기간: 2011년 05월 25일) 
1. 성경 전체의 줄거리: http://blog.naver.com/boomer27?Redirect=Log&logNo=100045727411 
2. 성경가이드 동영상: http://tvpot.daum.net/my/Top.do?ownerid=EkARSoEjy_E0&lu=v_my 
3. http://blog.daum.net/dw7055/15718331 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.09(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> CS회의 

- 현대해상 SM
- P20110208-0036[홈페이지 > 회사소개 수정 작업] 작업 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
CLMQ2000I.java CLMQ2001S.java CLMQ2002VO.java CLMQ2003VO.java CLMQ2004VO.java CLMQ2005VO.java CLMQ2006VO.java 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.10(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- P20110124-0019[관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업] 이행 완료 
==> 자원
: 23개(JSP: 13, JS: 4, CAB: 1, JAR: 1, JAVA: 4) ==> (JSP: 26, JS: 8, CAB: 2, JAR: 2, JAVA: 8, CLASS: 4(산출물 포함)) ==> 총 50개 
-------------------------------------------------------------------------------------------------------------------------------

- PMS 수정 
PMS에서 자원 --> Application 현황에서 
자원 ID: Declared.java로 조회 
DB사용구분: 데이터 변경(IUD) ==> 해당사항 없음으로 변경 
손형수 대리(품질관리팀)에서 전화해서 처리함: T)721-0356 
==============================================================================================================

- P20110208-0036[홈페이지 > 회사소개 수정 작업] 이행 완료 
==> 자원
: 8개(JSP: 6, XML: 2) ==> (JSP: 12, XML: 4)(산출물 포함) ==> 총 16개 
==============================================================================================================

- FTP 설정 
91. 배포 서버(B2C) ==> /B2C/Appl/hib2c/docs/images ==> FTP서버(S): 10.18.5.74, 포트:, hihom_d1/hihom_d1 
92. 배포 서버(HOMEADMIN) ==> /Appl/webroot/adminhome/images ==> FTP서버(S): 10.18.5.74, 포트:, homea_d1/homea_d1 
http://homeadmin.hi.co.kr/images/newimages/common/box/round06_btmr.gif 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.11(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30  --> 아침 당번 

- 현대해상 SM
- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
사고유형코드 : EVNT_ACDT_TYP_CAT   ====> evntAcdtTypCat: 사고유형구분코드 
,사고구분코드 : EVNT_ACDT_CAT   ====> evntAcdtCat: 사고구분코드     
,사고원인명 : EVNT_ACDT_CSE_CD   ====> evntAcdtCseCd: 사고원인코드   
==============================================================================================================

- P20110211-0009[관리자화면 內 홈페이지 파일 업로드 수정 및 기타 홈페이지 수정 작업] 이행 완료 
==> 자원
: 8개(JSP: 1, JS: 4, CAB: 1, JAVA: 2) ==> (JSP: 2, JS: 8, CAB: 2, JAVA: 4, CLASS: 2(산출물 포함)) ==> 총 18개 
1. InnoPU_js_cab 3일 이내 재이행 ===> SVN 경로 틀림(/webroot/docs/js --> /webroot/js로 수정) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.12(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(18째주)
07:50 기상 
08:10 집 출발 
08:30 Super Fast-Reading 학원 도착 
09:00 훈련(승빈가족, 이삭, 권주만 기자, 재찬형제, 윤정자매) 
- 바른 자세, 바른 마음 
12:20 중식  
13:00 독법 훈련 
17:00 종료 
17:50 장보기(세제, 샴푸, 참치 통조림, 칫솔) 
18:20 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.13(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
06:00 기상 
07:00 예배(광림교회: 상요형(남권이형 결석)) 
08:30 종료 
08:32 성경책(Slim BEST BIBLE(성서원)) 선물 받음(전도사님, 성서원 기독 백화점에서 교환할 것) ==> 상요형이 과자 박스 선물로 줌 
08:40 신구초등학교 
08:50 게임(2:1 패) 
10:00 2011년 시무식 및 고사 
10:30 게임(3:1 패) 
11:20 종료 
11:30 김치찌게 끓여 먹음(쥐가 남) 
12:30 종료 
13:40 Super Fast-Reading 학원 도착 
14:00 훈련(승빈가족, 장원장님 가족, 이삭, 이영숙님, 선혜) - 바른 자세(입탈이 너무 큼) 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
20:00 귀가 
21:00 신림 츄(초희M) 
22:99 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.14(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- 관리자화면 內 홈페이지_공시실 관련 메뉴 수정 작업 
http://thome.hi.co.kr/amends/damage/care/InnoPU/goods/goods_list.jsp 
java.lang.IllegalArgumentException: Not a directory: /Appl/upload2/hib2c/data/goods 업로드 실패 
http://www.hi.co.kr/data/goods/Hicarpersonalcar(201011)_1.pdf  
==============================================================================================================

- P20110210-0022[2월 메일진 프리테스트 및 발송 작업 요청] 
시스템 코드 관리(http://211.192.0.42/ems60/SysMgrSysCode.do) 
==> 코드명: (T1)현대해상 DB 필터링 
http://thome.hi.co.kr/common/research_smart.jsp 
==============================================================================================================

-  담보별 상세조회 제한  
1. 원인: 해당 건은 사고유형구분코드가 (01:자동차)이기에 담보별 상세조회 서비스가 제공되지 않습니다. 
==> 사고유형구분코드(02:일반)만 조회 가능 
2. alert창: 담보별 상세조회 서비스는 일부 상해(질병)보험 보상에 한해서만 조회가 가능합니다. 

3. 보상처리 상세 조회 시 조회 불가한 대상자 및 화면 입니다! 
- 주민번호 : 680421107 
- 접수번호 : 1007085936 
- 상품명 : 무배당하이카운전자상해보험(Hi0710)  ==> 사고유형구분코드가 (01:자동차) 
/cybercenter/bosangcenter/bosangLongTermIlbanView.jsp 파일에서 
<input type="text" name="REQ_CAT" value="<%=acdInfo.getAcdtTypCat()%>"> 
==============================================================================================================

- 특수문자(EditPlus 에서: 로마 문자)  
1. ㅁ + 한자: 공표,세모(○, △) 생성,  ㅍ+ 한자: 엑스표(Ｘ)  
(ㅈ+한자키:Ⅶ,ⅸ,ⅱ등등 여러가지 로마숫자) 
--> Ⅰ, Ⅱ, Ⅲ,  Ⅳ, Ⅴ,  Ⅵ, Ⅶ, Ⅷ, Ⅸ, ∩(교집합: A⊂B이면 --> A∪B)   
참고: 윈도우 --> 시작 → 모든 프로그램 → 보조프로그램→ 시스템 도구→ 문자표 
---------------------------------------------------------------------------------------------------- 
2. 기타 문자 
★ ♡ ▦ ＃ ♥ ☎ ● ┃ ┏┓ 
==============================================================================================================

- 공지사항 
1. 휴대폰: http://www.ppomppu.co.kr/zboard/zboard.php?id=pmarket2 
2. 성서원 기독 백화점T)587-10, 성서원(http://www.biblehouse.co.kr): T)765-0 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.15(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 18:30 

- 현대해상 SM
- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- P20110215-0011[관리자화면 內 홈페이지_파일 업로드 수정(오류로 인한 재수정)] 
http://thome.hi.co.kr/amends/damage/care/InnoPU/goods/goods_list.jsp 
java.lang.IllegalArgumentException: Not a directory: /Appl/upload2/hib2c/data/goods 업로드 실패  
src="http://www.hi.co.kr/images/ 
http://www.hi.co.kr/images/newimages/mail/research/smart 
==============================================================================================================

- P20110214-0026[스마트 고객센터 이용 만족도 조사 작업의뢰]  
1. 설문 대상 : 1월 스마트 고객센터 이용 고객 중 홈페이지DB(customer table)에 이메일 주소가 있는 사람 
http://thome.hi.co.kr/common/research_smart.jsp 
==============================================================================================================

- Textarea 글자수 보이기 및  제한 
function CheckStrLength(obj, cnt)  {    //Textarea 글자수 제한 
   //변수의 초기화  
   var now_str = obj.value;    //이벤트가 발생한 컨트롤의 value값  
   var now_len = obj.value.length;    //현재 value값의 글자 수  
   var max_len = cnt;    //제한할 최대 글자 수  
   var i = 0;            //for문에서 사용할 변수  
   var cnt_byte = 0;    //한글일 경우 2 그외에는 1바이트 수 저장  
   var sub_cnt = 0;    //substring 할때 사용할 제한 길이를 저장  
   var chk_letter = ""; //현재 한/영 체크할 letter를 저장  
   var lmt_str = "";    //제한된 글자 수만큼만 저장  
   //'alert("[/research_smart.jsp][CheckStrLength()] [obj]"+obj +"[cnt]"+cnt );  

   for (i=0; i<now_len; i++)  
   {  
       //1글자만 추출  
       chk_letter = now_str.charAt(i);  

       // 체크문자가 한글일 경우 2byte 그 외의 경우 1byte 증가  
       if (escape(chk_letter).length > 4)  
       {  
           //한글인 경우 2byte  
           cnt_byte += 2;  
       }else{  
           //그외의 경우 1byte 증가  
           cnt_byte++;  
       }  
         
       //만약 전체 크기가 제한 글자 수를 넘지 않으면  
       if (cnt_byte <= max_len)  
       {  
           // 제한할 문자까지의 count값을 sub_cnt에 누적  
           sub_cnt = i + 1;  
       }  
   }  
         
   // 만약 전체 크기가 제한 글자 수를 넘으면(Textarea 글자수 제한)   
   if (cnt_byte > max_len) {  
       alert("최대" + max_len + "글자 이상 쓸수 없습니다!");  
       lmt_str = now_str.substring(0, sub_cnt);  
       obj.value = lmt_str;  
   }   
   obj.focus();  

   document.getElementById('remLen').value = parseInt(cnt_byte);  //Textarea 글자수 보이기 
}  

function return_chk(obj,cnt,max)  {   //Textarea 줄 수 제한 
   var obj_str = obj.value;  
   var lmt_line = cnt  
   var lmt_len = max  

   line = obj_str.split("\r\n");  
   line_cnt = line.length;  

   if (line_cnt == lmt_line && event.keyCode == 13)  
   {  
       alert("최대" + lmt_line + "줄 을 넘을 수 없습니다!");  
       event.returnValue=false;  
   }  
}   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.16(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:15 ~ 18:30  --> CS회의 

- 현대해상 SM
- P20110214-0026[스마트 고객센터 이용 만족도 조사 작업의뢰] 이행 완료(반려) 
==> 자원
: 3개(JSP: 1, JAVA: 2) ==> (JSP: 2, JAVA: 4, CLASS: 2(산출물 포함)) ==> 총 8개 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- 휴대폰 구입 
1. LG OPTIMUS ONE: http://www.ppomppu.co.kr/zboard/view.php?id=pmarket2&page=1&sn1=&divpage=8&sn=off&ss=on
&sc=off&select_arrange=headnum&desc=asc&no=35635 
2. 안심데이터100 : 500M(3G: 1달에 만원) 
3. 구입처: 백마장 매장*@*.* 
==============================================================================================================

- 포항집 에어컨 구입(1등급) 
1. 전자랜드(포항 우현점) 
2. 142만원 부모님 통장으로 이체 처리함 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2011.02.17(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:15 ~ 18:30 

- 현대해상 SM
- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- 자동차 보상 변경 사항 
1. 기존 정보의 상세화 
 1) 사진(서류) 등록 가능, 2) 사진(서류) EDMS 전송, 3) 피해 접수 담당자에게 SMS 전송 
2. 실시간으로 단계별 조회로 세분화 
 1) 기존: 종결 건만 조회 
3. 사용자가 현장 실시간 등록 
 1) 기존: 사용자가 사진만 조회 가능 
----------------------------------------------------------------------------------------------------------- 

STEP1: 사고접수(기존) 
--> 1) 사진(서류) 등록 가능, 2) 사진(서류) EDMS 전송, 3) 피해 접수 담당자에게 SMS 전송 
STEP2: 사고조사/과실확정(신규) 
STEP3: 피해자/물조사, 관리(신규) 
STEP4: 보험금 지급/종결(신규) 
==============================================================================================================

- 상해/질병 사고접수 변경 사항 
1. 전체 프로세스 단계 변경 
 1) 기존: 
STEP 1. 사고유형 선택 
STEP 2. 사고사항 입력 
STEP 3. 접수내역 확인 및 전자서명 
STEP 4. 접수가능 계약 선택 
STEP 5. 구비서류 접수: 업로드 컴포넌트 
STEP 6. 접수 확인(CIS 전문 전송)  
STEP 6. 서명 
 2) 변경:  
STEP 1. 보험금지급 계좌 입력, 확인 
STEP 2. 사고사항 입력(교통상해, 질병상해, 일반상해 별로 선택 구분) ==> 설문내용 입력 통합 
STEP 3. 접수가능 계약 선택 
STEP 4. 구비서류 첨부방법 선택(파일전송, 팩스전송 선택)(신규) 
STEP 5. 구비서류 접수: 업로드 컴포넌트 
STEP 6. 접수 확인(CIS 전문 전송) 
STEP 7. 구비서류 EDMS 처리(신규) 
STEP 8. 서명 
==============================================================================================================

- InnoPU 테스트 
http://thome.hi.co.kr/amends/damage/care/InnoPU/style_browser.jsp 
==============================================================================================================

- 하루웰 식당 식권 
1. 9장(40,500) ==> 3,800원 
- 중앙대병원(http://ch.caumc.or.kr) T) 6299-1114 ==> 신경외과(진료의뢰서를 지참할 것) 
1. 예약: 02.22(화) 15:40 ==> 2만 2천원 ===> 현대HDS 휴가 신청 처리 완료(2일 사용) 
- 사랑의 병원(http://www.lovehospital.co.kr) T) 880-0114 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.18(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:15 ~ 18:30 

- 현대해상 SM
- P20110214-0026[스마트 고객센터 이용 만족도 조사 작업의뢰] 재이행 완료 
==> 자원
: 3개(JSP: 1, JAVA: 2) ==> (JSP: 2, JAVA: 4, CLASS: 2(산출물 포함)) ==> 총 8개 
==============================================================================================================

- P20110217-0060[연금저축보험 메일 발송] 이행 완료 
1. xecurelinks(이메일, HTML) 
<a href="http://www.hi.co.kr/common/xecurelinks.jsp?xecure=true&redir=/insurance/counsel/coun.jsp&ProdCD=1597
&amp;SubCat=0000" target="_blank"> 
<img src="http://www.hi.co.kr/images/newimages/mail/prod_mail/mail_pension_img07.jpg" border="0" ></a>
<!--// 상품신청 바로가기 URL 링크//--> 
--------------------------------------------------------------------------------------------------------------------------

2. 기본 대상자 : 당사 홈페이지 비계약자 회원 중 광고 이메일 수신 동의자 (임직원 포함/하이플래너 제외) 
--계약자 회원 제외  ===> 888,838 
UPDATE M_CAMPAIGN1 
SET FIELD1='DEL_CONTRACT' 
WHERE FIELD1 ='ZINE5' 
AND EMS_M_ID IN (SELECT DISTINCT AGCUS_REGNO FROM EDW_MAIL_AGMT WHERE AGCUS_REGNO > 0)   --보험계약자정보TB 
; 

--임직원 포함/하이플래너 제외 
UPDATE M_CAMPAIGN1 
SET FIELD1='DEL_EMPLOYEE' 
WHERE FIELD1 ='ZINE5' 
AND EMS_M_ID IN (SELECT IDNO FROM EDW_SAWON WHERE SUBSTR(EMPNO,1,1)<>'3')  --임직원:3번 
; 
==============================================================================================================

- P20110218-0003[보상처리 조회 프로세스 개선] 
1. 담보별 상세조회 제한 해제  
 1) 사고유형구분코드(02:일반)만 조회 가능 ==> 모두 가능 
 2) 주민번호: 68042110(/cybercenter/bosangcenter/bosangLongTermIlbanView.jsp) 
2. 피보험자 주민번호(PIBO_RSNNO) 수정(기존: 피보험자 주민번호(INSURED_NO)) ==> 79012020 차진영(/amends/dao/JubsuMgr.java) 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0 
==============================================================================================================

- EDMS 전송 처리 변경(손사) 
1. 기존: http://tmgr.hi.co.kr에서 진접수번호 입력 --> EDMS 전송 --> 진접수번호 중심(EDMS서버) 
2. 변경: http://tmgr.hi.co.kr에서 가접수번호(홈페이지) --> EDMS 전송 --> 가접수번호 중심(EDMS서버)  
==============================================================================================================

[보안점검공지] PC 불법소프트웨어 점검 안내 
"PC 불법소프트웨어" 점검을 실시하오니 첨부된 '불법소프트웨어 검사 파일'을 실행하여 
결과 파일을 M드라이브에 Upload 하여 주시기 바랍니다. 
1. 불법소프트웨어 점검(개인점검): 2월 18일(금) ~ 22일(월) 
2. 점검 결과 파일 Upload : 2월 22일(화) 14:00 까지 
경로 :  M:\공유함_new\02_주고받기문서\@내부통제_불법소프트웨어 점검(201102) 
첨부파일 : 불법SW점검 매뉴얼.ppt 
Ins6A-Lite.zip → 불법소프트웨어점검 프로그램 
문의 사항 : 내부통제팀 이지연 사원(내선: 348) 
==============================================================================================================

- 휴대폰 구입 개통 
1. LG OPTIMUS ONE: http://www.ppomppu.co.kr/zboard/view.php?id=pmarket2&page=1&sn1=&divpage=8&sn=off&ss=on
&sc=off&select_arrange=headnum&desc=asc&no=35635 
 1) 화면 잠금변경 비밀번호: III* 
2. 안심데이터100 : 500M(3G: 1달에 만원) 
3. 구입처: 백마장 매장(T)070-7996-0, *@*.*), 개통(T)516-0으로 전화함) 
4. SKT 가입(표준 요금제: 12,000원(부가세 별도)) 
==============================================================================================================

- 공유기 웹 설정창 진입 
1. http://192.168.123.254/html/index.asp,  ssp**88*(기본: admin)   sspeim881 
2. 무선 보안 설정  
 1)  SSID(네트워크 이름): myLGNet_TAMA, WEP 키 입력 Key1: aa11221122(기본: 123456789a) 
==============================================================================================================

- 장미정씨 송별회 
18:30 퇴근 
18:50 둘둘치킨(맥주) 
18:50 선물(장미정씨 애기 옷) 
20:50 종료  
00:20 취침 
==> 정산: 34,350원, 국민 878301-01-090624, 예금주: 권오득 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.19(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(19째주) 
07:50 기상 
08:10 집 출발 
08:30 Super Fast-Reading 학원 도착 
09:00 훈련(이삭, 권주만 기자, 재찬형제, 윤정자매) 
- 옥점(적발, 빛 윤곽 뚜렷), 활점(산발, 빛의 확산) 
12:20 중식  
13:00 독법 훈련 
19:30 종료 
20:00 귀가 
21:20 LG OPTIMUS ONE upgrade 하는 중에 멈춤(LG A/S 문의 할 것) ==> 휴대폰 안됨 
00:20 취침 
==============================================================================================================

- LG OPTIMUS ONE 휴대폰 구입 방법 
1. LG OPTIMUS ONE:  LG-SU370 
http://www.ppomppu.co.kr/zboard/view.php?id=pmarket2&page=1&sn1=&divpage=8&sn=off&ss=on&sc=off&select_arrange
=headnum&desc=asc&no=35635 
 1) 번호이동 신청하기(클릭) --> 신청서 작성  --> 구입처에 전화(백마장 매장(T)070-7996-2040)  
 2) 휴대폰 택배로 배송됨(2~3일 소요) 
 3) 개통 요청 전화(T)516-1040) 
 4) 개통 완료 
2. SKT 가입(표준 요금제: 12,000원(부가세 별도)) 
5. 정성락 전도사: *, *@*.* 
==============================================================================================================

- 2011년 신사 조기회 총무 계좌(회비) 
1. 신한은행(110-318-342822) 구창원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.20(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

▦조기축구
06:00 기상 
07:00 예배(광림교회: 상요형(남권이형 결석)) 
08:30 종료  
08:40 신구초등학교 
08:50 게임(3:2 승) --> 1골 넣음 
10:30 게임(5:3 승) --> 1골 넣음 
11:20 종료 
12:00 서울 중앙병원(영민 회장 조모상: 부조 5만원 함) 
14:25 Super Fast-Reading 학원 도착 
14:30 훈련(승빈가족, 장원장님 가족, 이삭, 선혜, 김흥권씨) 
- 실속(짦게 봄, 잔상), 부드러움 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
20:00 귀가 
==============================================================================================================

- PEIM 일정 
- 93회 
1. 일시: 2011년 02월 20(일) 
2. 결과발표: 2011년 04월 01(금) 
------------------------------------------------------------------------------------------------------------------------------- 

- 95회 
1. 일시: 2011년 08월 07(일) 
2. 결과발표: 2011년 09월 30(금) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.21(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  --> 아침당번(버스 출근: 뛰어서 8시에 겨우 도착) 

- 현대해상 SM
- P20110218-0003[보상처리 조회 프로세스 개선] 이행 완료 
==> 자원
: 2개(JSP: 1, JAVA: 1) ==> (JSP: 2, JAVA: 2, CLASS: 1(산출물 포함)) ==> 총 5개 
==============================================================================================================

- P20110214-0026[스마트 고객센터 이용 만족도 조사 작업의뢰] 메일 발송 
http://www.hi.co.kr/common/research_smart.jsp 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java  
2. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- 파일 변경 
/amends/damage/care/InnoPU/goods/downloadFile.jsp 
Hicar 개인용자동차보험(20101122).. 각각의 파일 (약관. 방법서, 요약서)가 안떠요  
http://www.hi.co.kr/company/ko/notice/products/productsView04.jsp 
http://www.hi.co.kr/data/goods/Hicarpersonal_101122.pdf  

http://www.hi.co.kr/data/goods/plusbusinesscar(20100906)_1.pdf 
http://www.hi.co.kr/data/goods/plusbusinesscar(201011)_1.pdf 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.22(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  --> 휴가 
  
- 현대해상 휴가
07:00 기상 
07:10 훈련 
09:00 집출발  
09:40 LG A/S 서초서비스센터(반포상가 2층 best서비스) 방문 ==> 휴대폰 업그레이드 에러 처리, 기존 주소록 이동  
	- http://upgrade.cyon.co.kr, 1544-7777 
10:10 종료 
10:40 성서원 기독 백화점(남부터미널 1번 출구) ==> 글씨 작은 책 없어서 돌아옴 
11:50  Super Fast-Reading 학원 도착 
12:00 중식(컵라면 밥) 
13:00 훈련(이영숙님, 이장로님, 재홍, 민국, 재진형재, 윤정)  
	- 입, 탈후의 빛(잔상), 눈꺼풀, 표정(가상: 잘하려는 마음을 버려라), 부드러움 
13:30 중앙대병원 예약 취소(http://ch.caumc.or.kr) T) 6299-1114 ==> 신경외과 
16:00 종료 
16:50 성서원 기독 백화점 재방문(책 교환: Slim BEST BIBLE ==> 큰글자 성경전서(예장출, NO: YS0022)) 
17:30 형 이비인후과 ===> 귀치료(아토비 검사 받음) T)873-1101 - 평일: 9 ~ 19, 토요일: 9 ~ 15 
18:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.23(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> CS회의(취소됨) 

- 현대해상 SM
- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java  
2. 개발 담당자: 이태호 사원 T)721-0313  
01. 사고접수 상세내용: /amends/motor_car/process_search/step01_jubsuDetailView.jsp  --> 완료 
02. 사고조사/과실확정: /amends/motor_car/process_search/step02_acciSearchConFirm.jsp   --> 완료 
---------------------------------------------------------------------------------------------------------------------- 

1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp 
==============================================================================================================

- Email 주소 수정 
1. mail.setParameter("EMAIL","A","***"+EMAIL.trim().substring(3)) ; //EMAIL 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.24(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30 

- 현대해상 SM
- P20110223-0054[홈페이지  회사소개(상품공시) 수정 작업 요청] 이행 완료 
==> 자원
: 3개(JSP: 3) ==> (JSP: 6)(산출물 포함) ==> 총 6개 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
1. 01. SMS 전송: /amends/motor_car/process_search/step01_sendSMS.jsp  --> 완료 
2. 03. 피해자/물조사, 관리: /amends/motor_car/process_search/step03_ManPhySearchControl.jsp 
------------------------------------------------------------------------------------------------------------------------------- 

1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp 
==============================================================================================================

- *  이인희  
홈페이지 사고접수를 2월24일 당일 했습니다.  
상태값 A1, S 인데 접수되었다고 문자를 받았다고 합니다.  
여러사항 확인내용중  
 *  홈페이지 회원명이 "이" 로만 등록 되어있음. 
> 고객분께는 회원탈퇴후 재가입하시고 다시 사고접수 안내 
계약번호(L20050701898)에 대해 사고 접수를 3번 등록 되었고 같은 내용을 2번 배당을 친 것을 판단됩니다. 
홈페이지 회원명은 정상적으로 이인희씨로 보입니다. (안 보인다면 화면 캡처를 떠서 보내주세요) 
==============================================================================================================

- 홈페이지 가접수시 가상팩스번호(FAX) 생성 관련 수정 
1. request 하실때 (CLRF0100M01I TRAN콜할때)  
requestVO 쪽의 bzFlag 라는 컬럼이있는데, 이컬럼에 "Y"가 들어와야 가상팩스 생성 모듈을 타게 됨 
2. response 받을때  
tran이 종료되고 response 받을때 , 가상팩스 생성 모듈을 정상으로 탔으면, responseVO 밑에 clrf0112vo 가 생성되었을거고,  
<bzCat>X</bzCat>   --가접수임(U:진접수,X:가접수) 
<acdtRcpNo>1102159372</acdtRcpNo>--가접수번호 
<faxNo>02-3470-5447        </faxNo>--가상팩스번호 
<faxIssuDt>20110224</faxIssuDt>--가상팩스발생일자 
<faxIssuTm>091209</faxIssuTm>--가상팩스발생시간 
<faxVldDt>20110224</faxVldDt>--가상팩스유효일자 
<faxVldTm>111209</faxVldTm>--가상팩스유효시간 
<faxResCode>00000000</faxResCode>--가상팩스리턴코드 
<faxResDesc>success</faxResDesc>--가상팩스리턴코드설명 
==============================================================================================================

- 권한 등록 처리 
관리자 화면(http://homeadmin.hi.co.kr)에서 권한 등록  
사번: 306633, 안은미(B2B  정회원관리) 
==============================================================================================================

- 펀드 
1. KB 밸류 포커스 증권 자투자신탁(주식) 
- TV: http://www.etnews.co.kr/news/detail.html?id=201102230107&mc=m_013_00003  
- 팀장님 계약직 미팅 
1. 일시: 3월 9일(수) 19시 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.25(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 18:30  --> 중식(신진NTS 이순복 사장), 하루웰 식권 구매 

- 현대해상 SM
- P20110225-0001[보험계약대출 채널전환, 가능금액 이메일] 이행 완료 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
1. 01. SMS 전송: /amends/motor_car/process_search/step01_sendSMS.jsp  --> 완료 
2. 03. 피해자/물조사, 관리: /amends/motor_car/process_search/step03_ManPhySearchControl.jsp 
---------------------------------------------------------------------------------------------------------------------- 

1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp 
==============================================================================================================

- CMTS 대상자 중 회원탈퇴 이력  
이메일 받는 테이블 중 아마 CMTS라고 있을 것이라고 합니다. 명칭은 CIS이전의 명칭이지만 통상적으로  
사용하고 있고 보통 CMTS라 부르는것은 홈페이지 회원이 아니면서 하이포탈에 이메일 주소가 있는 그런  
사람들을 통상적으로 칭합니다. 
그 CMTS 중 홈페이지 탈퇴한 사람들에겐 회원탈퇴 이력이 있는 사람에게는 안보낸다는 의미로 보입니다. 
CMTS는 발송 안하는게 좋다고 합니다. 민원 들어올 가능성이 높다고 합니다. 이메일 발송하면 난 왜 받겠다고 
안했는데  왜 보내느냐 등  민원이 빈번하다고 합니다. 
==============================================================================================================
     
- UtraEdit(울트라 에디터) 세로 자르기 
1. Column --> Column Mode 선택 
2. 변경 원하는 위치 클릭 
3. 마지막 위치 Shift + 클릭(세로줄이 선택됨) --> ; 
==> 예) 1 002241036117 --> 1;002241036117 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.26(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR(20째주)
07:50 기상 
08:10 집 출발 
08:30 Super Fast-Reading 학원 도착 
09:00 훈련(이삭, 권주만 기자, 윤정 자매)  - 옥점(적발, 빛 윤곽 뚜렷), 활점(산발, 빛의 확산) 
12:20 중식  
13:00 독법 훈련  ==> 독법 조기 훈련 종료(원음이가 광속법 과학적인가 질문으로 목사님 기분 상함) 
14:00 속법 훈련 
19:30 종료 
20:00 귀가 
00:00 취침 
==============================================================================================================

- 족욕기 
1. 토브 족욕기(http://with.gsshop.com/prd/prd.gs?prdid=4824612) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.27(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- SFR
06:00 기상 
07:00 예배(광림교회)  ==> 설교: 선한 일을 도모하는 그리스도인(김정석 목사님) 
08:30 종료  
08:40 신구초등학교(비와서 축구 안함)  ==> 축의금 창원이형에게 전달(유영역 전 회장님 아들 결혼(5만원 함)) 
09:10 새생명반(광림교회 지하 양의 문) 
09:40 새가족을 위한 성경 공부 ==> 새생명반 강의(Section 6: 나를 드리는 예배(이요한 목사님)) 
10:30 종료 
10:40 새가족을 위한 성경 공부 ==> 통신문 작성 
12:00 완료 
12:10 중식(교횐 지하 식당: 무료) 
12:30 23교구 스데반 선교회 모임(건강떡집 주관: 홍칠태 회장): 추연복 목사님, 이지수 전도사님 
==> 매주 3째주 
14:00 간식(탕수육) 
14:30 종료 
15:30 Super Fast-Reading 학원 도착 
14:30 훈련(장원장님 가족, 이정숙님, 윤정, 선혜 가족, 김흥권씨) 
- 지각, 결석, 숙제, 이해도 80ㅇ%이상 안되면 탈퇴 시킨다는 서약서 쓰라고 함 
17:30 석식(컵라면 밥) 
18:00 독법 훈련 
19:00 종료 
20:00 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.02.28(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30 

- 현대해상 SM
- P20110223-0024[어린이보험 판매지원 이벤트 안내 메일 발송] 
1. 어린이보험 판매지원 이벤트 이메일 발송.xls 
굿앤굿 어린이CI 보종 코드 : 2280~2289,1950 ~ 1952 
하이라이프웰스 어린이보험 보종 코드 : 1570 ~ 1571, 1940 
==============================================================================================================

- P20110223-0033[자동차보상실시간처리조회시스템 개발] 
http://thome.hi.co.kr/amends/car/my_amends/checkView01.jsp 
1. 납입현황(paging): /cybercenter/contractcenter/contractlist/longTermView04.jsp ==> /LTMUE004M01LBean.java 
2. SMS 전송: http://thome.hi.co.kr/7color/sms_test.jsp  
3. 개발 담당자: 이태호 사원 T)721-0313 
==============================================================================================================

- B2B 정회원 관리 등록 에러 
1. b2b 정회원 관리 라고 있는데요..  신규등록 에러 
에러 내용: 시스템 점검 중입니다. 
/b2b/manager/servlet/MemberJoin.java 
담당: 퇴직보험팀 이하나 사원 
담당: 공통팀 김희경 대리 
/manager/b2b/member/mb_list.jsp ==> /hi-mgr/java_src/hi/b2b/manager/control/ZCT308UCtl.java 
==============================================================================================================

- 질의신청서조회 제목 깨지는 문제 
1. 기업보험 -> 질의신청서조회 
http://tb2b.hi.co.kr/b2bmall/fireinsu/fire_house/fire_house04.jsp 
select auth_id,auth_time,to_char(to_date(auth_time,'yyyymmddhh24miss'),'yyyy-mm-dd hh24:mi') auth_time_str, 
        auth_name,subject,auth_email,read_gubun,co_name, app_id  
from b2b_quest_mstr  
where quest_id <> 'F'   
order by auth_time desc  
==============================================================================================================

- 판매상품중인/중지상품에서
1. 보종코드/종형코드 수정 시 반영 안됨 
2. 대용량 파일 첨부시 용량제한 있음 
3. 홈페이지에서 약관이 열리는 속도가 느리거나,,안열림 ㅠ  ===>  
해서 보종/종형코드 수정할때, 등록한 내용을 아예 삭제했다가 등록하기도 하구요. 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■