

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+------------------------------------------// 51. 주요 업무(24년) ■ //-------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 51. 주요 업무(24년) ■■■■
- 11월 주요 업무 ■■■
 
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 10월 주요 업무 ■■■
- (LG U+ 익시오(IXI-O) SM 투입(08:30, LG U+ 마곡 사옥) (2024.10.02(수)]
1. 프로젝트 명 : LG U+ IXI 솔루션-Call Agent SM
2. 고객사 : LG U+
3. 수행사 : (주)에버커스
4. 계약사 : (주)에버커스
5. 용역기간 : 2024년 10월 01일 ~ 2025년 09월 30일
6. 근무장소 :  
7. 프로젝트 내용 : 
8. 월단가 : ***만원
9. 월용역비 지급일시 : 매 익월 10일 (휴일일 경우 전일지급)
10. 계약방식 : 개인 3.3 % 공제방식 (산재보험료 추가 차감 : 13,780원 + 고용 보험)
============================================================================================================= 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 09월 주요 업무 ■■■
- 5차 실업 인정신청 포기[★] (24.09.12(목))]  ==> 완료[♥♡] 
5차 09/13( 08/09 ~ 09/13)  ==> 실업 수당: 9일 * 66,000원 = 594,000원
1. 취업 사실 신고(온라인) [24.08.31(토)]
-------------------------------------------------------------------------------------------------------------- 
- 실업 수당 5차(9일분)  594,000원 입금됨[★]
============================================================================================================= 

- 국세청 운영 프로젝트 철수[24.09.26(목)] ==> 완료[♥♡] 
24.09.05(목) SPC 나일도 이사에게 전화해서 철수 요청(1. PL이 무능하고 너무 갈굼, 2. 업무 파악할 시간을 안주고 막 굴림)
24.09.05(목) 18:00 야근 안하고 정시에 퇴근
24.09.07(토) 국세청 운영 프로젝트 상황 보고 작성 후 나일도 이사에게 메일 보냄
24.09.10(화) 14:00 PM 면담(9월말 인수 인계 후 철수하기로 합의 함: PL이 내가 무능 로그 찍을 때부터 철수 요청했다고 함)
24.09.09(월) 18:00 권기석 부장 야근 안 한다고 한 소리함: 무시하고 퇴근
24.09.11(수) 10:30 일정 회의(9층 회의실: 권기석과 언쟁: CH172_859  처리 후 인수인계하고 철수 한다고 통보)
24.09.23(월) 10:52 인수 인계자 도착(오상현 부장(73년생)), 10:30 6층에서	오상현 부장과 면담(객관적으로 현 상황 설명해줌)
					13:30 커피(이디아 커피, 김동은 대리, 오상현 부장[쏨]: 프로젝트 상환 설명: 오 부장 투입 포기한다고 함)
24.09.25(수) 17:50 권기석 부장이 갑자기 내 자리에 와서 CH172..859 (양도 소득세)..배치 건 가지고 난리 침):난 이클립스 에러로 제대로 개발 
	진행 못 한다고 쪽지로 보고 헸다고 함) => 개인 PC 백업 폴더에서 JAVA 파일명 변경한다고 내 등 뒤에 붙어서 짜증 내길래 내가 열받아서 
	욕하고 소리침, 이준곤 차장에게 수정 개빌한 배치 파일(3개) 쪽지로 보내고 퇴근
24.09.26(목) 17:44 권기석 부장이 철수 통보, 17:50 PM 면담(9월 급여 정상 지급 한다고 함), 18:05 SPC 나일도 이사에게 전화해서 통보
				, 19:10 짐싸서(이마트 백) 철수, 18:18 석식(국세청 구내 식당), 19:55 첫마을 1단지 장류장 => 61번 탑승, 20:15 한국 영상대 도착
				, 20:55 귀가, 21:30 짐 싸기(여행용 캐리어, 백팩), 22:30 취침
==============================================================================================================
 
- 숀리 엑스 바이크 구입(24.09.28(토) 13시, 당근) ==> 완료[♥♡] 
1. 관악구 신림 1단지 주공 아파트 103동 10층 => 만원(당근 거래)
=============================================================================================================

- - 현아트빌 404호 인터넷 설치[24.09.30(월)]
1. LG U+ 인터넷 설치
--------------------------------------------------------------------------------------------------------------

==========상품정보==========
★구성 
- 인터넷: LG(3년약정) + 500Mbps + WiFi (의무임대)
- 결합1: 참쉬운가족결합+  / 후결
- 월요금: 33,000(미결합) / 23,100(결합)
- 설치비: 36,300
- 주말 추가설치비: 9,075(1회)
- 사은품:  330,000(현금: 330,000)
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 08월 주요 업무 ■■■
- 국세청 운영 프로젝트 투입
24.08.06(화) 국세청 운영 프로젝트 면접(마크원 에비뉴 빌딩(세종 국세청로 32 마크원 에비뉴 B동 802호) 방문
	권선희 PM --> 1. 24년 7월에 10년 동안 국세청 운영한 업체 교체(업체에서 기존 인력 모두 철수), 2. 야근도 많이 해야 한다고 함.
	==> 권선희 PM이 24년 08월 19일 출근하라고 함
2024.08.19(월) 차세대 국세 행정시 스템(NTIS) 운영 Prj 투입(09시, 세종시 마크원 에비뉴 B동 802호)
1. 장소 : 세종시(국세청) ==> 680만원
2. 스킬 : Java, 웹스퀘어, DB2
3. 기간 : 즉시~  년단위 운영
2024.08.19(월) 13:50 코쿤 하우스 방문 ==> 3층 304호 월세 계약(월세: 22만원, 보증금:10만원)
==============================================================================================================

- 51. Kotlin 문법 종합반_수강 시작 ==> 24.07.01(월)[♥♡]
- Kotlin_1주차: Kotlin을 시작하기 전에 알아야할 내용[24.07.01(월)]
https://spartacodingclub.kr/online/kotlin
 1) 수강 기간: 07월 01일(월) ~ 08월 04일(일): 5주
 2) 강사: 김진영 튜터 ==> 강의 수강
--------------------------------------------------------------------------------------------------------------------------

- 51. Kotlin 문법 종합반_종강 ==> 24.07.12(금) 완료[♥♡] 
- Kotlin_1주차: Kotlin을 시작하기 전에 알아야할 내용[24.07.01(월)]
https://spartacodingclub.kr/online/kotlin
 1) 수강 기간: 07월 01일(월) ~ 08월 04일(일): 5주
 2) 강사: 김진영 튜터 ==> 강의 수강
============================================================================================================== 

- 4차 실업 인정신청[★] [24.08.08(목) 08:40] 의무 출석(10 ~ 11시) 완료[♥♡]
3차 08/08(07/12 ~  08/08): 온라인 교육 ==> 실업 수당: 28일 * 66,000원 = 1,848,000원
-------------------------------------------------------------------------------------------------------------- 
- 실업 수당 4차(30일분) 1,848,000원 입금됨[★] ==> 완료[♥♡]
============================================================================================================= 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 07월 주요 업무 ■■■
- 51. Kotlin 문법 종합반_수강 시작 ==> 24.07.01(월)[♥♡]
- Kotlin_1주차: Kotlin을 시작하기 전에 알아야할 내용[24.07.01(월)]
https://spartacodingclub.kr/online/kotlin
 1) 수강 기간: 07월 01일(월) ~ 08월 04일(일): 5주
 2) 강사: 김진영 튜터 ==> 강의 수강
--------------------------------------------------------------------------------------------------------------------------

- 51. Kotlin 문법 종합반_종강 ==> 24.07.12(금) 완료[♥♡] 
- Kotlin_1주차: Kotlin을 시작하기 전에 알아야할 내용[24.07.01(월)]
https://spartacodingclub.kr/online/kotlin
 1) 수강 기간: 07월 01일(월) ~ 08월 04일(일): 5주
 2) 강사: 김진영 튜터 ==> 강의 수강
============================================================================================================== 

- 52. Kotlin으로 만드는 공공데이터 활용 안드로이드 앱_종강 ==> 24.07.09(화) 완료[♥♡] 
https://spartacodingclub.kr/online/bio_app
 1) 훈련기간: 2024-06-18 ~ 2024-07-22 (4회차) [국비지원] 
 2) 강사: 황성희 튜터
============================================================================================================== 

- 3차 실업 인정신청[★] [24.07.11(목) 08:40] 완료[♥♡]
3차 06/13(06/14 ~  07/11): 온라인 교육 ==> 실업 수당: 28일 * 66,000원 = 1,848,000원
-------------------------------------------------------------------------------------------------------------- 
- 실업 수당 3차(20일분)  1,848,000원 입금됨[★] ==> 완료[♥♡]
=============================================================================================================

- 리액트 분석
=============================================================================================================

- 플러터 앱 기획, 마케팅 분석
============================================================================================================= 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 06월 주요 업무 ■■■   
1. [왕초보] 플러터(Flutter)로 시작하는 앱개발 종강 ==> 24.06.24(월) 완료[♥♡]
https://www.hrd.go.kr/hrdp/co/pcobo/PCOBO0100P.do?tracseId=AIG20230000413063&tracseTme=61&crseTracseSe=C0105
 1) 훈련기간: 2024-05-21 ~ 2024-06-24 (61회차) ==> 수강 신청[24.05.20(월)]
 2) 강사: 임상원 튜터[앱개발 종합반] 
============================================================================================================== 

- 2차 실업 인정신청[★] ==> 24.06.12(목) 완료[♥♡]
2차 실업 인정일(0시 ~17시, 온라인)
2차 06/13(05/17 ~  06/13)
-------------------------------------------------------------------------------------------------------------- 
- 실업 수당 2차(20일분)  1,848,000원 입금됨[★] ==> 24.0614(금) 완료[♥♡]
=============================================================================================================

1. [왕초보] 플러터(Flutter)로 시작하는 앱개발_수강 시작 ==> 24.06.18(화)[♥♡]
 1) 훈련기간: 2024-05-21 ~ 2024-06-24 (61회차) ==> 수강 신청[24.05.20(월)] ■■■■■
 2) 강사: 임상원 튜터[앱개발 종합반]
https://www.hrd.go.kr/hrdp/co/pcobo/PCOBO0100P.do?tracseId=AIG20230000413063&tracseTme=61&crseTracseSe=C0105
=============================================================================================================
 
- 미래에셋 CMA 계좌(010-3072-0898-8)에 입금  ==> 24.06.18(화) 완료[♥♡]
0. 퇴직 연금(개인형 IRP(010-3072-0898-7)에 잘못 입금하여 미래에셋 콜센터에 전화해서 수정 처리함
1. 천만원 입금(상시 입출금 가능)
1,000만원 이하 이자:	3.55%, 1,000만원 초과 이자: 3.10%
----------------------------------------------------------------------------------------------------------------------

- 제발 예금 적금 파킹통장 그만 찾으세요. 목돈은 그냥 여기에 넣어두세요
https://www.youtube.com/watch?v=H3Agnjf17Qs 
=============================================================================================================

- 52. Kotlin으로 만드는 공공데이터 활용 안드로이드 앱_강의 수장[24.06.18(화)] ==> 수강 시작
https://spartacodingclub.kr/online/bio_app
 1) 훈련기간: 2024-06-18 ~ 2024-07-22 (4회차) [국비지원] 
 2) 강사: 황성희 튜터
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 05월 주요 업무 ■■■   
- 자체 휴가[★]	==> 24.05.01(수) 완료[♥♡]
1. 5월달에 최성오 책임 믿고 암센터 프로젝트 기다린다고 실패함
2. 적극적인 구직 활동 할 것
=============================================================================================================
 
- 01. 2023년 귀속 종합소득세 신고[★] ==> 24.05.01(수) 완료[♥♡]
1. 신청
=============================================================================================================
 
- 실업 급여 신청[★] ==> 24.05.02(목) 완료[♥♡]
-------------------------------------------------------------------------------------------------------------- 
- 1차 실업 인정 교육(10:10, 서울 관악고용 센터) [★] ==> 24.05.02(목) 완료[♥♡]
-------------------------------------------------------------------------------------------------------------- 
 - 실업 수당 1차(8일분) 528,000원 입금됨[★] ==> 24.05.03(금) 완료[♥♡]
=============================================================================================================

1. [왕초보] 플러터(Flutter)로 시작하는 앱개발_수강 시작 ==> 24.05.21(화) 완료[♥♡]
https://www.hrd.go.kr/hrdp/co/pcobo/PCOBO0100P.do?tracseId=AIG20230000413063&tracseTme=61&crseTracseSe=C0105
 1) 훈련기간: 2024-05-21 ~ 2024-06-24 (61회차) ==> 수강 신청[24.05.20(월)]
 2) 강사: 임상원 튜터[앱개발 종합반] 
============================================================================================================== 

- 51. 오라클 백업, 복구(데이타 펌프) 처리[★]	==> 24.005.08(수) 완료[♥♡]
-- NHLD02 계정 백업(PARALLEL[병렬]+ 압축): 강추(데이타 용량 절약) ■
PS C:\Users\TAMA_HAart_404> cd D:\oracle\app\oracle\oradata\NHWMSDB\dpump
PS D:\oracle\app\oracle\oradata\NHWMSDB\dpump> expdp NHLD02/asas1212!! COMPRESSION=ALL PARALLEL=4 
DIRECTORY=MY_DPUMP DUMPFILE=EXPDP_NHLD02_PCOMP_240508_%U.DMP LOGFILE=EXPDP_NHLD02_PCOMP_240508.log; 
----------------------------------------------------------------------------------------------------------------

-- 전체 백업(PARALLEL[병렬]+ 압축): 강추(데이타 용량 절약) ■
PS C:\Users\TAMA_HAart_404> cd D:\oracle\app\oracle\oradata\NHWMSDB\dpump
PS D:\oracle\app\oracle\oradata\NHWMSDB\dpump> expdp system/asas1212##A FULL=YES COMPRESSION=ALL 
PARALLEL=4 DIRECTORY=MY_DPUMP DUMPFILE=EXPDP_NHWMSDB_FULL_PCOMP_240508_%U.DMP 
LOGFILE=EXPDP_NHWMSDB_FULL_PCOMP_240508.log; 
==============================================================================================================

-- 전체 복구(PARALLEL[병렬]+ 압축): 참조
D:\oracle\app\oracle\oradata\NHWMSDB\dpump> impdp system/asas1212##A FULL=YES COMPRESSION=ALL PARALLEL=4 
DIRECTORY=MY_DPUMP DUMPFILE=EXPDP_NHWMSDB_FULL_PCOMP_240508_%U.DMP LOGFILE=IMPDP_NHWMSDB_FULL_PCOMP_240508.log;
 
-- 01. NHLD02 계정 복구(PARALLEL[병렬]+ 압축): 참조
D:\oracle\app\oracle\oradata\NHWMSDB\dpump> impdp NHLD02/aasas1212!! COMPRESSION=ALL PARALLEL=4 
DIRECTORY=MY_DPUMP DUMPFILE=EXPDP_NHLD02_PCOMP_240508_%U.DMP LOGFILE=IMPDP_NHLD02_PCOMP_240508.log;
==============================================================================================================
 
- 01. 1인 개발자 분석[★] ==> 24.05.09(목) 완료[♥♡]
1. 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 04월 주요 업무 ■■■
- 자체 휴가[★]	==> 24.04.01(월) 완료[♥♡]
1. 취업 활동할 것
=============================================================================================================
 
- 01. PL_SQL 분석[★] ==> 24.04.01(월) 완료[♥♡]
1. SP_R2_DATA_MAKE_WK_DT.sql 생성, 수정
=============================================================================================================
 
- ast_vrfc.py(자산 검증) 수정[★] ==> 24.04.19(금) 완료[♥♡]
1. ast_vrfc.py(자산 검증) 소스 수정
2. st_vrfc.py 파일 실행(Visual Studio Code에서 수행)
==============================================================================================================
 
- 애니 데스크(anydesk)을 집 PC 원격 제어[Tuya Smart(투야)][★] ==> 24.04.20(토) 완료[♥♡]
1. 집 PC(TAMA-HAart-404)에 본체에 외장 GPU(가로 하단)에 더미 플러그(Dummy HDMI) 꽃기
  1) 내장 GPU(세로 상단)에 DP 케이블 제거하여 외장 GPU(가로 하단)에 DP 케이블 꽃기
2. Tuya Smart(핸드폰에서) 앱에서 집 PC에서 PC 켜기 ==> 1. 현아드빌 404호
3. 애니 데스크(anydesk) 앱으로 집 PC 원격 제어
 1) TAMA-HAart-404[집 PC] 워크스테이션 번호: 1 472 713 540(1472713540)
   가. 워크스테이션 비밀번호 변경(부재중 엑세스 비밃번호 설정) asa*12**!!  
=============================================================================================================

- Nexacro 환경 설정_03[★]: 사용 안함 ==> 24.04.09(화) 완료[♥♡]
0. D:\00_Prj■\01_Nexa\NHL_DEV_03\workspace\NHLWM\src\main\nxui\NHLWM.xprj
03. Tomcat v9.0 Server(NHL_DEV_03)■
=============================================================================================================

- Nexacro 환경 설정_04[★] ==> 24.04.14(일) 완료[♥♡]
0. D:\00_Prj■\01_Nexa\NHL_DEV_04\workspace\NHLWM\src\main\nxui\NHLWM.xprj
03. Tomcat v9.0 Server(NHL_DEV_04)■
=============================================================================================================
 
- Oracle 19c(19.3) home 설치[★]	==> 24.04.25(목) 완료[♥♡]
1. Oracle 11g R2이 이미 설치되어 있음(오라클 2개 설치됨)
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 03월 주요 업무 ■■■ 
- 알뜰폰 신청[★]	==> 24.03.10(일) 완료[♥♡]
[24.03.10(일)] ◆ ==> 완료[♥♡]
- 월 11GB + 매일 2GB
https://www.moyoplan.com/plans/9197?from=internet-bundle-lgu-plan
1. 데이터 다 써도 저화질 영상 재생 가능 (3mbps), 월 27,500원(12개월 이후 36,300원)
 1) 전화: 무제한, 문자: 무제한. LG U+망 사용, LTE
2. 이마트24 편의점에서 원칩 유심(8,800원) 구입
3. 롯데카드 신청
 1) LG 헬로비전 롯데카드로 LGU+망 통신요금 자동납부 연결 (LGU+망 제휴사는 아래 대상 제휴사 참조)
 2) 지난달 실적 30만원 이상 충족
  기. 30만원 이상: 만 7천원, 70만원 이상: 만 9천원, 100만원 이상: 2만 천원
 3) 연회비: 해외겸용(MASTER): 만 2천원
 https://www.moyoplan.com/benefits/hellovision-lotte-card-x-moyo 
------------------------------------------------------------------------------------------------
 
- 알뜰폰 개통[24.03.11(월)] ◆ ==> 완료[♥♡]
1. 스마텔 알뜰폰에서 유심 사진과 생년월일 전송 요청 받음
2. 스마텔 알뜰폰에서 유심 사진과 생년월일 문자로 보냄
3. 11시 50분 경에 도보 중 핸드폰 연결 종료(인터넷 사용 불가)
4. 사업장 복귀 후 새 유심으로 갈아 끼우기
==> 샤오미 Redmi Note 13 핸드폰 사용(13시)
==============================================================================================================
 
- 이어폰 2개 구입[24.03.05(화)] ◆ ==> 완료[♥♡]
- 유선 헤드셋 인이어 휴대폰 라인 제어, 마이크 통화, E18, 3.5mm 튜닝, Gold,  가격: 2,846원
https://ko.aliexpress.com/item/1005005118884769.html?spm=a2g0o.productlist.0.0.4b97kJwxkJwxe0&mp=1&gatewayAdapt=glo2kor

- 유선 헤드셋 마이크 포함, 블랙 마카롱 인이어 게임용 인터페이스 헤드셋, Black, 가격: 1,596원
https://ko.aliexpress.com/item/1005005118884769.html?spm=a2g0o.productlist.0.0.4b97kJwxkJwxe0&mp=1&gatewayAdapt=glo2kor 
==============================================================================================================
 
- 현아트빌 농협물류 Prj 처리[24.03.17(일)] ◆ ==> 완료[♥♡]
1. 출고 업무 수정(개인 PC에서)
 1) WAVE관리[03S] 화면, 피킹 확정[04S] 지시, 피킹 확정[05S] 화면, 출고 확정[06S] 화면, 출고 마감[07S] 화면
 2) D:\00_Prj■\01_Nexa\NHL_DEV 
==============================================================================================================
 
- 농협물류 Prj 철수[24.03.29(금)] ◆ ==> 완료[♥♡]
1. PM이 철수하고 함(PM하고 말싸움이 원인이 된 것 같음)
 1) 야근, 주말 근무 요구해서 힘들었음
 2) 프로젝트 초보인 PM(김범두 상무), PL(조재원 부장)과 일하느라 힘들었음
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 02월 주요 업무 ■■■ 
1. 롯데 백화점 모바일 상품권 교환 ◆
 1) 롯데 백화점 30만원권 ==> 모바일 상품권 교환 ==> 완료[♥♡]
===============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 01월 주요 업무 ■■■ 
- 회사 노트북 오라클 DB 설정 분석◆
01. GQMS_Tst[HD_S 개발S] ==> 01. GQMS_Tst[HD_S, 개발S(19.09)]
1. host: TAMA-HOME:1521, Database: TAMADB   ---> GQMS_TST/tama339
------------------------------------------------------------------------------------------------------------------

02. NOXMAT_MAP[HD_S 위험물Prj 개발S] ==> 02. NOXMAT_MAP[HD_S 위험물Prj, 개발S(20.01.13)]
1. host: TAMA-HOME:1521, Database: TAMADB   ---> NOXMAT_MAP/tama339
==============================================================================================================
 
- HL_DEV(농협 물류 Prj) 셋팅 ◆ ==> 개인 PC에서
1. D 드라이브에 셋팅 ==> 완료[♥♡]
 1) D:\00_Prj■\01_Nexa\NHL_DEV
2. NHL_DEV 분석
==============================================================================================================

- 오라클 데이타 Data Pump 백업 ◆ ==> 완료[♥♡]
1. 오라클 DataPump 분석
2  오라클 DataPump 실행 ==> 노트북[사업장]에서 
==============================================================================================================

- 오라클 데이타 백업 ◆
- [오라클 기초 강좌] 28 - EXPORT & IMPORT - Table/User/Full Export, Dump, Backup & Recovery
https://www.youtube.com/watch?v=Cdgux_ggb8w
1. 특정 Table 만 exp 하기
[oracle@server128 ~]$ exp scott/tiger tables=emp,dept file='C:\scott.dmp'
exp userid=scott/tiger file='C:\exp.dmp' tables=(EMP, DEPT) log=exp.log
출처: https://godlvkhj.tistory.com/215 [하은양 믿음군 효실맘 호홍홍집s:티스토리]

[oracle@server128 ~]$ imp system/oracle file='C:\scott.dmp' fromuser=scott tables=test01 ignore=n
출처: https://oracle-childschool.tistory.com/26 [오라클유치원:티스토 ]
------------------------------------------------------------------------------------------------------------------

- [DBeaver] 덤프 생성하는 법
https://velog.io/@dailylifecoding/PostgreSQL-dbeaver-ddl-oneshot

- 디비버에서 테이블 복수로 DDL 생성
1. 01. 농협물류Prj > Schema > NHLD02 > Tables
 1) TB_OB_DLR_BSC, TB_OB_DLR_DTL --> 2개 테이블 선택 --> 마우스 우 클릭 ==> SQL 생성 > DDL: 클릭 ==> Copy 
==============================================================================================================
  
- ast_vrfc.py(자산 검증) 수정 ◆
1. 자산 내용 추가
 1) 91. 주식 Tab 삭제
 2) 자산(2023) Tab 추가
  가. 78. 발행어음 만기형_개인(181~270)
  나. 91. 퇴직 연금(개인형 IRP)
==============================================================================================================

- LOT 콘센트 구입[4.02.22(목)] ◆ ==> 완료[♥♡]
1. 갤럭시 탭으로 원격지원[테크몽] (Anydesk, lot 콘센트)
- [스마트홈] 알리 할인 플러그는 이걸로 사세요. | 쓸만한 저가 wifi 스마트 플러그 구입
https://www.youtube.com/watch?v=9o7CRAnedTs
1. 투야 와이파이 스마트 플러그 EU 스마트 소켓, 전원 모니터링 타이밍 기능, 16A(lot 콘센트), 가격: 7,676원
https://ko.aliexpress.com/item/1005005601443212.html 
==============================================================================================================

- 샤오미 레드미 13 핸드폰 구입[24.02.25(일)] ◆ ==> 완료[♥♡]
- 글로벌 버전 Redmi Note 13 휴대폰 스냅드래곤® 685 MIUI 14 108MP 카메라 120Hz 6.67" AMOLED 디스플레이 33W 충전기 스마트폰
0. 가격: 241,315원, 2. 예상 배송일: 3월 13일[약 3주 걸림] ,8일 이내 품목출하 
https://www.aliexpress.com/item/1005006577883221.html?spm=a2g0o.cart.0.0.469656bad2reYJ&mp=1
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


 



■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
==============================================================================================================
■1. OX ↑↓ ↔  ⇒ ⇔  ==> 개발 중[☞☜]＃＆＠ § ※ ☆ ★ ○ ●◎ ◇ ◆ □ ■ △ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣ ╊ ■
==> 완료[♥♥] ==> 진행 중[☞☜]
==============================================================================================================
