 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2024.10) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■■■■■ 2024.10.01(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 국군의 날(임시 공휴일)

- 휴가[★]
06:17 기상
06:24 조식
06:39 집 출발(도보{자전거: 내림), 도림천 <=> 대림역)
07:07 귀가
07:30 조식(수종)
08:30 인터넷 서핑
09:10 아정당 카페 후기, 블로그 후기 작성
11:30 중식(짜파게티: 3봉): 수종
11:45 실내 도보
11:60 수종 센터에 감
12:50 종료
13:30 인터넷 서핑  
13:50 노트북 점검 ==> SW 삭제
16:30 집 출발(자전거): 도림천 => 오금교 => 구일역
17:00 구일역 1번 출구 도착 ==> 당근 앱을 통해서 쇼파 바이크 실내 자전거 거래 시도: 손오공이라는 판매자가 약속 어김
17:35 귀가
17:40 석식
17:52 실내 도보 ==> 수종 귀가
18:50 종료
19:45 인터넷 서핑
20:00 노트북 점검 ==> 사내 업무 시스템 마당 ID 등록 에러 발생, 이민우 선임에게 메일 보냄
20:20 실내 자전거 판매자(손오공) 방문 ==> 현아트빌 1층에서 쇼파 바이크 실내 자전거 거래(만원)
	--> 수종 쇼파 바이크 타보더니 별로 마음에 안 들어 함(실패)
21:00 프로젝트 투입 물품 정리(백팩)
22:30 취침
==============================================================================================================

- 사은품 정보
아정당에서 LG U+ 인터넷 설치 사은품(현금) 입금 확인: 330,000원 ==> 24.09.30(월)
사은품(아정당 카페 후기 작성) 지급(2만원) ==> 24.10.02(수)
사은품(아정당 블로그 후기 작성) 지급(3만원) ==> 24.10.04(금)
==> 총 38만원 받음 ■■■
==============================================================================================================

- 사내 업무시스템 마당(LG U+) 
1. https://ucloud.lguplus.co.kr, tamario2/0e4144460f  --> as**12**!!
==============================================================================================================

- 원드라이브(Onedrive) [24.10.01(화))] 
https://sen0204-my.sharepoint.com/my	 ==> tamario@daedong.sen.es.kr / 20*0오*h@
1. 01■. 진수종(대동초) OneDrive(1TB) [20.07.17] ■.txt
==============================================================================================================
 
※ 카페 후기(사진4장첨부) 작성 ※  
- 서울 관악구 LG U+ SK 500메가 통신사변경 사은품 많이 주는곳 솔직한 설치 후기[24.10.01(화)]
https://cafe.naver.com/suddenhaja/78632?boardType=I

※ 블로그 후기(사진4장+동영상 1분이상) 작성 ※  
- 서울 관악구 LG U+ SK 500메가 통신사변경 사은품 많이 주는곳 솔직한 설치 후기[24.10.01(화)]
https://blog.naver.com/tamario/223602821178 

- 아정당 블로그 후기 참여 방법
https://cafe.naver.com/suddenhaja/985
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■■■■■ 2024.10.02(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> LG U+ ixi 솔루션 SM 투입(08:30, LG U+ 마곡 사옥)

- LG U+ ixi-O SM Prj[★]
1. 이메일: tamario2@lgupluspartners.co.kr
 1) 한광희 선임/AI 솔루션 개발팀, 윤현노 선임/AI 솔루션 개발팀
==============================================================================================================

- 익시오(ixi-O) SM 첫출근[★]
04:50 기상
05:05 조식
05:25 집 출발(백팩: 신대방역 => 영등포 구청역 => 발산역)
06:30 발산역 9번 도착
07:10 LG U+(LG 사이언스 빌딩 E9동) 지하 1층 도착
07:11 도보 종료
08:00 LG U+ 1충 방 이성진 담당 만남
08:05 커피(바닐라 라떼, 지하 1층 카페[U+ 카페 마곡점]: 이담당이 쏨
08:35 에버커스 금정우 팀장, 이민우 선임 만남
08:45 안내 데스크에서 내방객 방문 카드 발급(LG U+ 모바일 신분증 사용 불가: 싸오미 핸드폰으로 출입 안됨(NFC 미설치))
08:55 LG U+ 5충 방문 ==> AI 솔루션 개발팀 윤현노 선임 만남: 자리에 짐 풀기
11:30 중식(샐러드:지하 1층 식당): 윤현노 선임이 쏨
11:55 실내 도보
12:45 종료
13:00 노트북에 환경 설정
14:10 회의(5층 E9-02 소 회의실) ==> 윤현노 선임이 프로젝트 설명
15:10 종료
18:00 퇴근(발산역 => 영등포 구청역 => 신대방역): 수종 엄마집에 놀러 간다고 전화옴(자전거 받침대 설치 요청)
18:52 귀가 ==> 수종 은천 센터에서 식료품 및 생활용품 받아옴(마지막)
19:00 석식
19:10 실내 도보
18:50 종료
19:20 인터넷 서핑
22:30 취침
==============================================================================================================

- Cloud PC 접속 에러(U Cloud에서
https://ucloud.lguplus.co.kr/vmCube/Launcher/DesktopLauncher/ViewDesktop
1. 현상:
외부망 접근이 차단 되었습니다.
서비스 신청 > 외부접속/모바일앱사용 신청을 하시기 바랍니다.
==============================================================================================================
 
- LG U+ ixi-O SM Prj[ 와이파이(보안)
1. 네트워크 이름(SSID): U+Net6398
2. 비밀번호: 63FC2P#B3A
------------------------------------------------------------------------------------------------
 
- LG U+ ixi-O SM Prj[ 와이파이
1. 네트워크 이름(SSID): LGU_GUEST
2. 비밀번호: 
==============================================================================================================

- Slack ID
https://slack.com/signin#/workspaces, tamario@naver.com/as**12**!!
-----------------------------------------------------------------------------------------------

01. ixio-datadog-운영
02. 애버커스-ixio(한광희, 윤현노 선임)
==============================================================================================================
 
- 깃 허브(git hub)
0. https://github.com/login ==> tamario2@lgupluspartners.co.kr/asasff1212!! -> JINTAEMAN2
1. Settings(이메일 주소 확인) ==> https://github.com/settings/admin
 1) Search by username, full name, or email address: tamario2@lgupluspartners.co.kr
2. LG 유플러스 통합 로그인 에러
https://lguplus.okta.com/app/UserHome?session_hint=AUTHENTICATED
 1) 현상: tamario2@lgupluspartners.co.kr/asasff1212!! --> 비빌번호 에러 발생  
0. https://github.com/login ==> JINTAEMAN/ asas12@@!!tam@
1. 프로젝트 - AICallAgent ==> https://github.com/AICallAgent-AIServer
==============================================================================================================

- 사업장 개인 노트북(MSI) 윈도우 비밀번호 변경[24.10.02(수)]
1. as**12**!! ==> qw**23**@*
==============================================================================================================

- 회의(14:10, 5층 E9-02  소 회의실)
1. 익시오(IXI-I) Prj 설명(윤현노 선임)
 0) 구글 제미나이(Gemini) 사용: 텍스트, 이미지, 오디오, 동영상을 모두 이해할 수 있는 구글의 새롭고 강력한 인공지능 모델
 1) NLP 팀(비식별 모델 개발, 금칙어(badWordFilter), LLM 모델 후 처리)
 2) LLM 팀(LLM 모델 개발)
 3) 음성 기술팀(TTS)
 4) AI 솔루션 개발팀(celery_task(worker) 개발)
 5) AI 플랫폼 개발팀(VIOLET): 도커 < 쿠버 네티스(Kubernetes) < AWS)
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.03(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 개천절(공휴일)

- 개천절[★]
04:50 기상
05:05 조식
05:25 집 출발(도보{자전거), 도림천 <=> 대림역)
07:07 귀가
07:30 조식(수종)
08:30 인터넷 서핑 ==> 쿠버네티스 분석
11:30 중식(라면, 참치, 햄, 돈가스 2개)
11:45 집 출발(수종 자전거) 
11:52 관악 자전거 방문 ==> 개천절 휴무
11:52 대림 종합 자전거 방문 ==> 수종 자전거 스텐드 설치(5 천원[중고] --> 새 것[만 5천원])
12:45 귀가
12:55 집 출발(자전거)
13:10 대림 종합 자전거 방문 ==> 중고 자전거 구입 합의(구 자전거에서 바구니, 클락션, 안장, 짐 받이 등을 떼서 구입한 중고 자전거에 달기로 함)
	, 총 4만원에 구입하라고 합의, 자전거 부품 --> https://www.dcbike.co.kr/shop/shopbrand.html?xcode=185&type=X
13:20 대림 종합 자전거 출발(도보)
13:50 귀가
14:00 인터넷 서핑
15:00 낮잠
16:40 기상
17:00 석식
17:15 집 출발(도보)
17:52 대림 종합 자전거 방문 ==> 자전거 교체 안되어 있음(내일쯤에 작업 완료 한다고 함)
18:30 귀가
19:50 인터넷 서핑 
20:38 수종 귀가
22:30 취침
==============================================================================================================

- [따배쿠] 0. 따라하면서 배우는 쿠버네티스 입문편 - OT[TTABAE-LEARN]
https://www.youtube.com/watch?v=6n5obRKsCRQ&list=PLApuRlvrZKohaBHvXAOhUD-RxD0uQ3z0c&index=1

- 개발자를 위한 쉬운 도커 (2024 NEW) | 컨테이너, 도커, 쿠버네티스의 개념을 엄청 쉽게 알려드려요.[인프런]
https://www.youtube.com/watch?v=eRfHp16qJq8&list=WL&index=2
1. 컨테이버: 한대의 서버에 여러 개의 소프트웨어를 안전하고 휴윤적으로 운영(이전 VM 가상화, OS 미존재)
2. 도커(배): 컨테이너를 관리하기 위한 도구(SW)
3. 쿠버네티스: 서버가 여러 대 있는 환경에서 각각의 서버의 도커에게 대신 지시해주는 오케스트이션 도구:

- 대세는 쿠버네티스 [초급~중급] | 강의 소개│인프런
https://www.youtube.com/watch?v=p8HjgQU58wU&list=PLpkj8RKr48waxSGXsBQFDn8LfWIjdvkEW 
==============================================================================================================
  
- 생성AI를 활용한 세상에서 제일 쉬운 파이썬 개발 클래스 _Part 1. 파이썬 개요 (1)
https://www.youtube.com/watch?v=gXTqaq4Jz08
==============================================================================================================

- 테무에서 주문한 내역
0. 주문 상품수: 3 상품:, 가격: 30,073원, 주문 시간: 2024년 10월 3일주문 ID: PO-185-18761405445671468
 1) 도착 예정: 10월 8일-14일, 5일 이내
1. 일본 문화에서 영감을 받은 책상 매트(대용량 마우스 패드), 35x16인치(90x40cm), 가격: 10,244원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099540584411&
2. 남성용 경량 방수 비 재킷, 가격: 15,609원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099517290590&
3. 1켤레 운동화 쿠션 TPU 가죽 고탄성 충격 방지 항균 방취 깔창, EU43-44(270mm/10.63인치): 2장, 가격: 4,220원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099515322968&
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.04(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 윤현노 선임 휴가(다음주 까지), 06:30 카톡으로 방문 예약 신청 => 한광희 선임이 승인 해줌), 07:30 1층 출입 검색
	대에서 LG U+ 방문 출입용 QR코드 찍고 출근(5층은 안됨), 07:45 한광희 선임 만남, 07:50 커피(바닐라 라떼, 지하 1층 카페[U+ 카페 마곡점]: 
	한광희 선임[쏨])

- LG U+ ixi-O SM Prj[★]
- 01. okta
1, https://lguplus.at.okta.com/next/request-types/all, tamario2@lgupluspartners.co.kr/as**12**!!

02. Datadog
1, https://app.datadoghq.com/apm/home, tamario2@lgupluspartners.co.kr/as**12**!!

03. 보안 Cloud PC --> PCPC03S034
==============================================================================================================

- 업무 Cloud PC 접속 에러 문의
안녕하세요? 24.10.02(수)에 LG U+ LG U+ ixi-O SM Prj에 투입된 외주 직원 입니다.
당일은 업무 Cloud PC 접속이 정상적으로 되었는데 오늘[24.10.04(금}] 출근해서 접송를 하니
"원격접속 툴 사용 중에는 VDI 사용이 불가능 합니다."라는 에러가 뜹니다.
접속 장애 자가 조치: LOG OFF를 하고 노트북을 재 시작가고 접속을 해도 안됩니다.
확인 부탁 드립니다.
감사합니다.
------------------------------------------------------------------------------------------------------

1. 현상: deviceName: ANYDESK.EXE
2. 조치:
 1) LG U+ 보안 솔루션 운영(070-4080-921)에 전화
 2) PC에서 AnyDesk SW 시작 앱에서 제거하라고 함 ==> AnyDesk SW 조치 후 정상 접속 됨
==============================================================================================================

- LG 유플러스 통합 로그인(비빌번호 변경)
https://lguplus.okta.com/app/UserHome?session_hint=AUTHENTICATED, tamario2@lgupluspartners.co.kr/as**12**!!
==============================================================================================================

- 회의(14:00, 5층 소 희의실 E9-03)
0. 익시오(ixi-O) Prj 설명(한광희 선임)
1. 아이폰(IOS) ==> BFF(AI APIM) ==> API Server: API Server에서 부터 음성을 Text로 변환된 전송됨
2. Gemini(GCP)에 가입한 회원, 임직원 대상으로 시범 운영될 예정(SKT: A.Dot)
------------------------------------------------------------------------------------------------------------

- 주요 API
1. API Server
2. Auth
3. Job Queue
4. Job Worker ==> celery_task: python(ython application 에서 많은 양의 작업들을 나눠서 처리할 수 있도록 해주는 분산 시스템
 1) LLM: 대형 언어 모델(Large Language Models, LLM) --> 방대한 양의 텍스트 데이터를 학습하여 다양한 종류의 텍스트를 생성할 수 있는
능력을 갖춘 모델
 2) TTS(Text-to-Speech): 사용자가 요청한 내용(텍스트)을 음성으로 변환하는 API
 3) 비식별화: 저의 이름이 <NAME> 입니다.
5. BIF: 주기적으로 메세지 발행(Scheduler)
6. DB(RDS)
7. 학습 데이타 저장(API): 데아타 전송
------------------------------------------------------------------------------------------------------------

- 주요 API_02
1. API
2. Worker
3. BIF: 주기적으로 메세지 발행(Scheduler)
4. Auth
---------------------------------------------------------------------------------------------------------------------------

- LLM 정의
1. 요약
2. 상세 요약
3. 키워드
4. AI Task 제안 ==> 학습 데이타 저장(API) 전송시 제외됨
---------------------------------------------------------------------------------------------------------------------------

- DB 테이블
0. Mysql(RDS)
1. job_status TB(job_id)
2. result_data TB
---------------------------------------------------------------------------------------------------------------------------

1. SM 권한 신청 진행 중
 1. Data Dog
  가. 에러 로그 확인
2. AWS
3. 보안 Cloud PC
---------------------------------------------------------------------------------------------------------------------------

- 장애 순서
1. Critical: 전화 옴
2. Major: Slack으로 문자옴
3. Minor: 해당 사항 없음
==============================================================================================================

- SQS(아마존)
1. StandAlone
2. FIFO: Quee에 들어간 Text 5분 안에 처리 ==> DLC: 2분 경과 후 삭제
==============================================================================================================

- LG U+  익시오(ixi-O) SM 방문 예약 신청(매일)
https://visit.lg.com
1. 담당자: 한광희 선임: 010-3247-6657
2. 애버커스(주)
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.05(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 
	
- 주말[★]
06:00 기상
06:10 조식(돈가스, 치킨): 수종
06:35 집 출발(수종 자전거: 보라매공원 => 노량진역 => 노들역 => 동작 대교 => 반포 대교 => 영동 대교 => 성수 대교 
	=> 청담 대교==> 탄천 => 봉은사로 => 봉은사역 => 삼성역 => 포스코 센터 => 선릉역(1번 출구)
08:03 누네안과 병원 도착
08:02 무인 접수(접수증 받아서 소지)
08:05 안과 검사(15층): 1번(안압 검사), 2번(시력 검사)
08:10 망막 검사(13층): 눈약 넣기, 1번(망막 CT 촬영: 파란 십자가), 2번(망막 전체 사진 촬영(볼 데기): 파란 원), 3번(안저 촬영(노란 X표))
		==> 광각 형광 안저혈관 조영술[편축]: 형광 물질 주사기로 투입 후 측정(노란 오줌): 혈압: 142 ~ 97mmHg
08:48 검사 종료 
09:11 진료(최순일 원장: 망막 상태가 좋다고 함, 6개월 후 다시 오라고 함, 백내장 증상이 약간 있다고 함)
09:14 수납(136,300원) ==> 예약(25년 04월 12일(토) 08:10)
09:30 선릉역 출발((수종 자전거: 선릉역(1번 출구) => 청담 대교 => 동작 대교 => 노량진역)
10:56 최희정 내과 방문 ==> 혈압: 135 ~82mmHg(맥박수: 86bpm)
11:07 진료: 최희정 원장 ==> 당화혈색소: 6.6, 모든 수치 좋은데 혈압이 높다고 함(당뇨약 2개월치 처방 받음, 혈압 처방 받음: 5,200원)
11:12 5층엔 약국 방문 ==> 조제(당뇨약[다이아 벡스 엑스 알서방], 혈압약[노바스크 정 5mg]:2 달치 일치: 15,400원)
11:30 귀가
11:40 중식(라면)
11:56 집 출발(도보)
12:30 대림 종합 자전거 방문 ==> 자전거 중고 교환 구매(4만원): 짐 받이 설치해서 안장 높낮이 조정 손으로 안됨, 클락션 고장 나서 다시
	방문해서 중고 설치
13:44 귀가
14:20 인터넷 서핑 
15:00 낮잠(자전거 4시간 타서 피곤함)
16:40 기상
17:30 석식
17:45 실내 도보
18:50 종료
19:30 인터넷 서핑
22:30 취침
============================================================================================================== 

- 노트북 구입 검토[24.10.06(일)]
- 국가권력급(?) 사양...!" 2024년 2월 고사양 고성능 노트북 추천 BEST[원포인트c]
https://www.youtube.com/watch?v=72F0AbSuPDU
==============================================================================================================

- 노트북 고르는 법 쉽게 알려드립니다 (feat. 사무용).[코딩하는 거니]
https://www.youtube.com/watch?v=_lW4Oc1AElU&list=PLLcbGhhl4sQDOYzzB8eNB7m0IdVffIyLM&index=8
============================================================================================================== 

- [추천] 2024년 10월 만두얏의 가성비 노트북 추천! [가성비 덕후 만두얏]
https://www.youtube.com/watch?v=hmKWw1rELCM

- 만두얏의 가성비 창고
https://sites.google.com/view/mandooyat-gadget/%EB%85%B8%ED%8A%B8%EB%B6%81-%EA%B0%80%EA%B2%A9%EB%B6%84%EC%84%9D
============================================================================================================== 
 
- LG전자 그램 프로17 17Z90SP-GA5HK [SSD 1TB], 가격: 1,708,850원
https://www.enuri.com/detail.jsp?modelno=118503734
------------------------------------------------------------------------------------------------------------------

- LG 그램17 17ZD90SU-GX56K 가벼운 노트북 Ultra5 16GB, 가격: 1,812,000원
https://www.coupang.com/vp/products/7956091560?itemId=24086480310&vendorItemId=91105989697
==============================================================================================================

- 17인치 노트북 추천 특가 BEST5 I  2024년 역대급 가성비 인기 순위 I LG그램 I ASUS
https://www.youtube.com/watch?v=eJqgMBzOmJQ 
1위 : 에이수스 2024 TUF 게이밍 F17 인텔코어i7-13620H 지포스 RTX 4060, 가격: 1,599,000원
👉https://link.coupang.com/a/bOSuyq
2위 : LG그램 17인치 13세대 인텔 i7 Win11 터치스크린 32GB RAM 2TB, 가격: 1,699,000원
👉https://link.coupang.com/a/bOSw6B
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.06(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 

- 주말2[★]
06:00 기상(흐림)
06:08 조식(돈가스, 치킨)
06:28 집 출발(도보: 도림천 <=> 관악산역 <=> 서울대 입구(반환점))
08:10 귀가
08:20 빨래
08:40 인터넷 서핑
11:30 중식(라면)
11:45 집 출발(자전거[백팩(물병 2개), 접이식 물통]: 도림천 <=> 보리매 공원)
11:55 도보
12:45 보리매 공원 수도 -> 물 떠 오기(비 약간 내림)
13:10 귀가
14:00 인터넷 서핑
17:25 석식
18:30 종료
18:30 실내 도보
18:50 종료
19:10 수종 귀가
20:00 청소(바닥 쓸기, 바닥 닦기): 수종
21:00 샤워(냉수: 체중: 68.4kg ==> BMI: 23.67(과 체중)
21:00 인터넷 서핑
21:30 LG U+ 알뜰폰 마블링 요금제 신청
	1. 월 11GB + 매일 2GB
	1) 데이터 다 써도 저화질 영상 재생 가능 (3mbps), 월 23,000원[7개월 이후 34,060원]
21:50 갤럭시 A35 핸드폰 구입
23:00 취침
==============================================================================================================

- SK 에이닷 3.0(앱) [24.10.06(일)]
- 이 영상 망하면 AI 탓임[UNDERkg]
https://www.youtube.com/watch?v=gFvtLdmRc08&t=524s

- ☆대학생 주목☆ 앱 하나로 7개 AI 한 번에 쓰는 법 / 스브스뉴스
https://www.youtube.com/watch?v=yGcGSODmvd8
------------------------------------------------------------------------------------------------------------------

- SK 에이닷 3.0(앱)
1. 계졍 관리  01030720898	--> 이메일: tamario@naver.com
2. 일정 등록(음성으로: 구글 일정 관리 연계)
 1) 오늘의 주요 뉴스 알려줘
 2) 10월 15일 발행 어음 만기 등록 해줘
3. 멀티 LLM 에이전트: 앱 하나로 7개 AI 한 번에 사용
==============================================================================================================

- 갤럭시 A35 핸드폰 구입
- 갤럭시 A35 자급제 128GB SM-A356N 5G[자급제 공기계], 가격: 439,000원
https://www.shinsegaetvshopping.com/display/detail/30198992
https://www.enuri.com/detail.jsp?modelno=125587558
-------------------------------------------------------------------------------------------------------------

77. 신세계 쇼핑
https://www.shinsegaetvshopping.com, tamario2/as**12**
==============================================================================================================

 [요금제 신청 완료]
진태만님, 마블링 요금제 신청이 완료되었습니다.
▪️ 통신사명 : 마블링
▪️ 가입유형 : 번호이동
▪️ 요금제명 : 마블링 프라임 11GB+매일2GB+3Mbps (LGU) 
 1. 데이터 다 써도 저화질 영상 재생 가능 (3mbps), 월 23,000원[7개월 이후 34,060원]
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.07(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 05:30 LG전자 27인치 모니터(27MK430H) 가지고 와서 LG U+ 사무실에 설치, 18:00 퇴근(도보 => 발산역), 18:30 
	신도림역 2번 출구 도착, 18:35 도보(도림천), 19:30 귀가, 20:30 LG U+ Cloud 개인 PC에 셋팅(1. 업무 클라우드, 2. 보안 클라우드 셋팅)

- LG U+ ixi-O SM Prj[★]
- 한광희 선임 메모
1. 빠르면 이번주부터 ixi-O 출시가 예정되어 있어서 몇 가지 내용 공유드리겠습니다.
IXIO 서버 장애 전파를 가장 먼저 책임님이 받으실텐데, SOP가 안되실 경우 다음의 연락망에 따라서 연락 주시면 됩니다.
 1) 한광희 선임/ AI솔루션개발팀 / 010-3247-6657
 2) 윤현노 선임 / AI솔루션개발팀 / 010-7111-9153
2. 오늘부터 데이터독 기반으로 일간 모니터링 부탁드립니다.
 1) 선임님, 데이터독 사이트는 열리는데 구체적으로 어떻게 모니터링 하는 겁니까? 가이드 부탁 드립니다.
 2) 데이터독 접속하셔서 service catalog 에서 아래 3가지 서비스 확인되시는 지 보시고, 리소스 및 로그 정보 데이터독에서 확인 
보통 서비스에 대한 리소스는 service catalog 에서, 로그는 error explorer 메뉴에서 확인하실수 있습니다.
3. SOP 조치를 위한 Violet 접속 권한 및 AWS 접속 권한은 확인해서 이번주 중에 공유드리겠습니다. 
=============================================================================================================

- 보안 클라우드 셋팅 성공
0. 로그인 권한 획득 후 구글 계정으로 로그인
- VIOLET(보안 클라우드에서)
1. https://mgmt.temp-sp.violet.uplus.co.kr, (Dev) 글 계정으로 로그인 :tamario2@lgupluspartners.co.kr/as**12**!!
2. https://mgmt.stg-sp.violet.uplus.co.kr, (Stg)
3. https://mgmt.prd-sp.violet.uplus.co.kr, (Prd) 
-------------------------------------------------------------------------------------------------------------

- VIOLET 로그 분석(보안 클라우드에서)
1. Service Manger(왼쪽 메뉴) > sc-commai-ixi-api(Name): 클릭 > Service Detail > Monitoring > Logs(Tab 클릭)
> sc-commai-ixi-api-66n97.....pod  선택  --> 해당 로그 VIEW
==============================================================================================================

- 01. U Cloud★
https://ucloud.lguplus.co.kr/vmCube/Login, tamario2@lgupluspartners.co.kr/as**12**!!

- 02. Datadog
https://app.datadoghq.com, tamario2@lgupluspartners.co.kr/qw**23**@*
--> Using Single Sign-On(https://app.datadoghq.com/account/login/by_email?next=%2Fapm%2Fhome)
1. Sign in with Your Organization: tamario2@lgupluspartners.co.kr => Next
2. Confirm Your Email(enter the 8 digit verification code): 12345678  => 8자리 코드 입력(하루에 한번 입력)
3. Select an Organization
 1) LGU Violetplatform => 클릭
 
- 03. LG U+ okta
https://lguplus.okta.com, tamario2@lgupluspartners.co.kr/as**12**!!
==============================================================================================================
 
- 서비스(APM Services[02. Datadog에서]) 모니터링[24.10.07(월)]
https://app.datadoghq.com/apm/home

sc-ixiauth-commai => Auth(인증) 처리 ■■ ==> 보안 클라우드에서 만 보임
sc-commai-ixi-api ==> API Server ■■
sc-commai-ixi-beat ==> 주기적으로 메세지 발행(Scheduler) ■■
sc-commai-ixi-worker ==> Job Worker ■■
sc-exaone-dev-test ==> LLM 모델 테스트하는 서비스 ■■ ==> 보안 클라우드에서 만 보임
sc-ixi-studio-batch ==> batch Scheduler
pymysql ==> My SQL DB Server
==============================================================================================================
 
- Issue Details
https://app.datadoghq.com/apm/home

1. greenlet.GreenletExit:Traceback (most recent call last):
 1) What happened
The issue was last seen 53 minutes ago (12:23 pm) on version 0.0.49
The issue was first seen 13 days ago (Sep 24, 4:25 pm) on version 0.0.47

 2) Traceback (most recent call last):  
File "/datadog-lib/ddtrace_pkgs/site-packages-ddtrace-py3.10-manylinux2014/ddtrace/contrib/requests/connection.py", 
line 110,\ in _wrap_send
    response = func(*args, **kwargs)	
	
File "src/gevent/_gevent_c_greenlet_primitives.pxd", line 35, in gevent._gevent_c_greenlet_primitives._greenlet_switch 
============================================================================================================== 

2. app.exceptions.TtsInappropriateTextError: Inappropriate Text Errorr: 부적절한 텍스트 오류			
 1) What happened
The issue was last seen 4 minutes ago (1:22 pm) on version 0.0.7
The issue was first seen 2 months ago (Jul 29, 3:00 pm) on version 0.0.10

 2) Traceback (most recent call last):  
File "/datadog-lib/ddtrace_pkgs/site-packages-ddtrace-py3.10-manylinux2014/ddtrace/contrib/asgi/middleware.py", 
line 291, in __call__
    return await self.app(scope, receive, wrapped_send)
Show 15 third-party frames
  
File "/app/app/api/v1/tts.py", line 64, in post_tts
    raise e
  
File "/app/app/api/v1/tts.py", line 52, in post_tts
    raise TtsInappropriateTextError()
2. 원인: post_tts.py 파일에서 Text를 Speech로 변환하는 과정에서 input된 텍스트가 부적절한 텍스트로 에러가 발생한 것으로 추정됨
============================================================================================================== 

- 사용자 방화벽 신청[24.10.07(월)] ==> 신청 완료[♥♥]
제목: Violet 사용을 위한 서버 접근 신청
1. 신청사유: Violet 사용을 위한 서버 접근 신청
2. 출발지: SECURITY_CLOUDPC
3. 만료일시: 작성 필(최대 1년)
4. 서버IP: 
	172.20.96.0/26  ==> Dev
	172.20.96.64/26  ==> Dev
	172.31.152.0/26  ==> Stg
	172.31.152.64/26  ==> Stg
	172.31.152.128/26  ==> Prd
	172.31.152.192/26  ==> Prd	
5. 포트작성(TCP): 80, 443
6. 사용목적 작성: 80(http), 443(https)
=============================================================================================================
 
- 용어 정의
1. SOP: 표준 운영 절차(Standard Operating Procedure): 조직이 과거 적응과정에서의 경험에 기초하여 유형화한 업무추진 절차
2. Unknown Vulnerability Risk: 알려지지 않은 취약성 위험
3. Attack Exposure: 공격 노출
4. Latency Breakdown: 지연 (또는 대기)  시간 분석
==============================================================================================================

- HTTP 상태 코드(HTTP status code)
https://velog.io/@honeysuckle/HTTP-%EC%83%81%ED%83%9C-%EC%BD%94%EB%93%9C-HTTP-status-code- 
1. 상태 코드 202: 요청은 받아들여졌으나, 아직 동작을 수행하지 않은 상태로 요청이 적절함을 의미함
============================================================================================================== 

- VSC_터미널 위치 설정 에러
1. 현상: 사용자 설정에 쓸 수 없습니다. 사용자 설정을 열어 오류/경고를 수정하고 다시 시도하세요.
-------------------------------------------------------------------------------------------------------------

- /ast_vrfc.py 파일 에러 @@@
Traceback (most recent call last):
  File "D:\PythonWorkspace\01_ast_vrfc\ast_vrfc.py", line 1, in <module>
    BeautifulSouprequests# -*- coding: utf-8 -*-		# 문자 인코딩(한글 사용)
    ^^^^^^^^^^^^^^^^^^^
NameError: name 'BeautifulSouprequests' is not defined
1. 조치:  # BeautifulSouprequests		# 주석 처리 ■
-------------------------------------------------------------------------------------------------------------
 
- 파이썬 확인 @@@
$ python --version
Python 3.11.4
$ pip uninstall requests		-- 에러와 무관함
$ pip install requests
============================================================================================================== 

- VSC 로그인하여 설정 동기화
1. MS 로그인 ==> tamario@daedong.sen.es.kr
==============================================================================================================

- LG U+ Cloud 개인 PC에 셋팅(20:30, 집): 완료[♥♥]
1. 업무 클라우드 셋팅,보안 클라우드 셋팅
2. 아래 버튼을 클릭하시면 Cloud PC에 접속 ==> 클릭
3. C:\Users\TAMA_HAart_404\Downloads\ 폴더에 vmcubeLauncher.ica 파일이 생성되고 멈춤
==> 조치: 소프트웨어 다운로드에서 CitrixWorkspaceApp_2203_CU3.exe 파일 다운로드 받아서 설치
-------------------------------------------------------------------------------------------------------------

- 업무 Cloud PC 접속 에러 문의 메일 보냄(lgupluspartners.co.kr): 자체 해결되어서 메일 취소홤
안녕하세요? 24.10.02(수)에 LG U+ LG U+ ixi-O SM Prj에 투입된 외주 개밥자 입니다.
LG U+ 마곡 사업장에서는 업무 Cloud PC 접속이 정상적으로 됩니다.

그런데 집에서 업무 클라우드를 로그인하고 연결하려고 하면 첨부한 이미지(01. 업무 클라우드.jpg)처럼
"아래 버튼을 클릭하시면 Cloud PC에 접속"==> 클릭하면
C:\Users\TAMA_HAart_404\Downloads\ 폴더에 vmcubeLauncher.ica 파일이 생성되고 더 이상 실행이 되지 않고 멈추어 버립니다.

확인 부탁 드립니다.
감사합니다.
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 05:30 집 출발(도보 => 도림천), 06:24 신도림역 도착, 06:57 출근, 15:20 출입 카드 수령(출입 L 3143), 18:00 퇴근
	(도보 => 발산역), 18:30 	신도림역 2번 출구 도착, 18:35 도보(도림천) (도보 중 식빵 4개 시식), 19:30 귀가
	
- LG U+ ixi-O SM Prj[★]
- 회의(14:00, 5층 E9-02 소 회의실)
0. IXIO SM SOP 업무 소개(한광희 선임) 
1. INSTANCE 생성(INSTANCE 화면에서[ixi VIOLET > 커뮤니케이션 AI[보안 Cloud PC에서])
 1) CTEATE AN INSTANCE: 클릭
 2) New Instance(화면)
  가. Name: test-commai-Instance
  나. Image: (shared) 1367: sc-commai-ixi-api-base-img ■ 
  다. Node Group:
    가) eks-violet-service-communication-p4d-24xlarge-ng ==> p4d: GPU 존재(LLM 일때 사용) ■ 
    나) eks-violet-service-communication-c6i-2xlarge-ng ==> c6i: 일반  
  라. Flavor: (CPU) - GPU: 0, CPU: 0.5, MEMORY: 1Gi
==> SAVE: 클릭
------------------------------------------------------------------------------------------------------------

2. SERVICE 생성(VIOLET 화면에서[보안 Cloud PC])
 1) INSTANCE Grid에서 actions 칼럼 ▼ 버튼(Add Service) 클릭 ==> 서비스 추가
 2) Service Registry: ready(새창)
  가. Title: 14: commai-ixi-api (sc-commai-ixi-api) ==> 기존 서비스: 선택 ■(참조 --> 15: commai-ixi-worker (sc-commai-ixi-worker))
  나. Service Type: Service Core: 선택(참조 --> Custom Reusable Service)
  다. Description
  라. Version: 0.0.54 --> 0.0.55 ■ 
  마. Release Note:
	241008
	- deploy 'dev' branch
==> SAVE: 클릭
------------------------------------------------------------------------------------------------------------

3. VSC 화면으로 이동(VIOLET 화면에서[보안 Cloud PC])
 1) INSTANCE Grid에서 actions 칼럼 ■■ 버튼(Connect) 클릭 ==> VSC 화면으로 이동 
1) 터미널 보기 단축키: Ctrl + ~
2. ./startup.sh ==>  ./startup_beat.sh,  /startup_worker.sh
$ git status 	 -- 현재 상태 확인 
$ git checkout dev		-- dev 브랜치로 전환
$ git branch   -v 		 -- 현재 브랜치 확인 
$ git pull origin dev
$ history
--------------------------------------------------------------------------------

$ git pull origin dev
$ git fetch.dev
fetch, pull 둘 다 원격저장소의 내용을 가져오는데 사용됩니다. fetch는 가져온 변경내용을 로컬에 영향을 미치지 않으며, 병합하기
전에 확인하는 용도로 사용하는 것이 좋습니다. pull은 가져온 변경내용을 로컬에 병합합니다. 하지만 로컬에서 작업하다가 변경된 
내용을 pull할 경우 충돌이 일어날 수 있습니다.왠만해선 fetch후 pull을 로컬이 깨끗한 상태에서 사용하는게 좋습니다. fetch와 
pull을 적절하게 사용합시다.
--------------------------------------------------------------------------------

3. post_text.sh 파일 수정
1. curl --location -vvv 'http://localhost:8080/v1/text'
2 --header 'X-Txi-Project-key: dddd'
==============================================================================================================

- LG U+ ixi-O SM Prj[와이파이: 보안) 변경
1. 네트워크 이름(SSID): UPLUS_WLAN --> 에러 발생:수정(보안 강화됨: 파일 첨부 안됨)
2. ID: tamario2, 비밀번호: as**12**!!
 - 신규로 받은 Local PC에서 외부 인터넷에 https로 접근 시 인증되지 않습니다 라는 메시지가 발생합니다. 
 https://ucloud.lguplus.co.kr/vmCube/Board/Faq/FaqList/?txtSearch=&sCate=04.%EC%9D%B8%ED%84%B0%EB%84%B7+%EC%82%AC%EC%9A%A9#.zip  
------------------------------------------------------------------------------------------------------------
   
- LG U+ ixi-O SM Prj[ 와이파이(보안): 기존
1. 네트워크 이름(SSID): U+Net6398
2. 비밀번호: 63FC2P#B3A
============================================================================================================== 
 
- 와이파이 변경(UPLUS_WLAN) 후 에러
https://app.datadoghq.com/ 
1. 현상:연결이 비공개로 설정되어 있지 않습니다.
2.조치:인증서_설치_파일(LGUPLUS_CERT.exe) 다운로드 받은 후 재 설정
============================================================================================================== 

- 크롬 다크 모드 설정 네이버까지 찐 다크 모드 설정하는 법
https://m.blog.naver.com/saporo2373/223079154920
1. chrome://flags ==> dark mode 검색
 1) Auto Dark Mode for Web Contents --> Enable => 선택
==============================================================================================================
 
- 메모잇 자주 쓰는 단축키 모음
https://blog.naver.com/airbag1/222877595591
새메모: Ctrl + Alt + Insert
보이는 메모 정렬: Ctrl + Alt + Left
화면메모 보이기/감추기: Ctrl + Alt + Down ■■
최근 편집한 메모 보기: Ctrl + Alt + Up  
메모관리자 열기/닫기: Ctrl + Alt + Right  ===> 사용■■ 
(설정 방법: Ctrl 단축키 누르고 동시에 Alt 단축키 누르고 동시에 Right 단축키 누룸) ■■
// 메모관리자 열기/닫기: ▶( Right) ===> 사용 안함
// 달력 보이기/감추기: Ctrl + Alt + Right  ===> 사용 안함
제목 변경: F2
검색: F3
접기/펼치기: F4
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.09(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 한글날(공휴일)

- 한글날[★]
05:57 기상
06:05 조식
06:25 집 출발(도보{자전거), 도림천 <=> 대림역) ==> 보라매 공원(쓰레기)
07:57 귀가
08:30 인터넷 서핑
11:30 중식(라면, 참치) 
11:45 집 출발(도보{자전거), 도림천 <=> 대림역) 
13:50 귀가
14:00 인터넷 서핑
15:00 AI 이해를 위한 파이썬 기초 강의 시청
17:30 석식
17:45 실내 도보
18:50 종료
19:50 인터넷 서핑 
20:47 수종 귀가
22:30 취침
==============================================================================================================

- AI 이해를 위한 파이썬 기초(인프런) [24.10.09(목)]
https://www.inflearn.com/course/ai-%EC%9D%B4%ED%95%B4-%ED%8C%8C%EC%9D%B4%EC%8D%AC%EA%B8%B0%EC%B4%88
==============================================================================================================

- A35 없는 기능 많은데? 그래도 추천하는 이유 | 장점, 초기설정, 필수 굿락 까지 모두 알려 줌 
https://www.youtube.com/watch?v=ICSTozqixHs&list=WL&index=3
==============================================================================================================

- 휴대폰 인증번호 앞으로는 외우지 마세요! 자동으로 입력됩니다!
https://www.youtube.com/watch?v=ADyjfBFeFJs

- 핸드폰 화면캡쳐 가장 쉬운 방법! 한손으로 이것만 누르시면 됩니다!
https://www.youtube.com/watch?v=CdF035gDNCs

- 문서, 핸드폰 카메라로 찍으면 안돼요! "이렇게" 하시면 100배 선명하게 저장됩니다
https://www.youtube.com/watch?v=fK-RS11XT-M
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.10(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 12:30 류대영 대리 만남(LG U+ 빌딩 E9동 지하 1층 U+ 카페 마곡점(바닐라 라떼[류대리가 쏨])), 16:00 와이파이 
	변경(U+Net6398로 다시 변경), 16:30 이성진 담당에게 주간 보고, 월간 보고도 보고서 양식 요청 문자 보냄
	, 24년 08월 급여(국세청 운영 Prj): SPC 4,448,200원 입금됨, 24년 08월 급여(국세청 운영 Prj): 나날SMI(주)  2,018,700원 입금됨
	, 한강 노벨 문학상 수상(연세대 국문학과 89학번: 광주:작별하지 않는다, 채식주의자, 소년이 온다)
	
- LG U+ ixi-O SM Prj[★]
- for 문 콘솔 로그 @@@
print("\n\n [@_T] ■■■ [/ast_vrfc.py] ==> [T_01] ■■■■■■ [######################### [익시오(ixi-O) 파일 TEST Start] #########################] ■■■■■■ ")
print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_01]" )

i = 0

for badword in badwords:
	print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_51] [badwords_번째]"+ str(i) +"[01. badwords]"+ str(badwords) )

	if badword in tts_scripte:
		check_result[0] = badword
		check_result[1] = 1
		print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_61] [badwords_번째]"+ str(i) +"[01. badwords]"+ str(check_result[0]) )	
print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_99] ■■■■■■ [######################### [익시오(ixi-O) 파일 TEST End] #########################] ■■■■■■\n\n\n\n")
# ■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ ------------------->
------------------------------------------------------------------------------------------------------------

- for 문2 @@@
while total_summary_num != 0:
	for k_list in new_reslut:
		if k_list == []; 
			continue	-- k_list 값이 []이 아닐 땨먼 출력(continue== jump) ■
		if total_summary_num == 0:
			break   	-- 반복문 전체를 빠져 나옴 ■ 
------------------------------------------------------------------------------------------------------------

- for 문3 @@@
num = 0

while num < 6:
	num += 1
 
	if num == 2:
		continue	-- num 값이 2가 아닐 때만 출력(continue== jump) ■
	if num == 4:
		break	  	-- num 값이 4이면 반복문 전체를 빠져 나옴 ■ 
	print(num)
------------------------------------------------------------------------------------------------------------

-- 결과값 @@@
0
1
3
4
------------------------------------------------------------------------------------------------------------

 - for 문4 @@@ 
for field in required_fields[entity_type]: 
	if field not in entity_dict.keys():		# field 객체가 널이면■
		return None
	elif len(str(entity_dict(field])) == 0:		# field 갯수가 0이면■
		return None
	else:
		return_entity_dict = str(entity_dict(field])
	return return_entity_dict
==============================================================================================================

- Gunicorn 란? 쓰는 이유는?
https://leffept.tistory.com/345
1. Client ==> Nginx(Web Server) ==> gunicorn(WSGI) ==> djiango(Application Server)
============================================================================================================== 

- 키보드 한영전환 한글 안쳐질때 해결 법
https://m.post.naver.com/viewer/postView.naver?volumeNo=36997835&memberNo=23090
============================================================================================================== 

- [python] 코드가 너무 길다면(줄 바꾸기)
1. Backslash 사용하기
0. 줄 바꾸고 싶은 부분에 \를 기입하고 줄을 바꾸면 됨
image = glob.glob(dirs_path + '/**/*_01.jpg', recursive=True) \
+ glob.glob(dirs_path + '/**/*_02.jpg', recursive=True) \
+ glob.glob(dirs_path + '/**/*_03.jpg', recursive=True)

2. 괄호() 사용하기
image = (glob.glob(dirs_path + '/**/*_01.jpg', recursive=True)
+ glob.glob(dirs_path + '/**/*_02.jpg', recursive=True)
+ glob.glob(dirs_path + '/**/*_03.jpg', recursive=True))
============================================================================================================== 

- 비주얼 스튜디오 코드(VSCode) 코드정렬 방법(feat. Prettier) 
1. vscode의 강력한 확장 프로그램인 Prettier - code formatter
============================================================================================================== 

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.11(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 08:00 주간 보고서 작성, 18:00 퇴근, 18:15 발산역, 18:40 신길역(1번 출구), 19:25 귀가(삼성 갤럭시 A35 핸드폰 
	택배로 도착함), 19:40 수종 용돈(수학 95점 받아서 상금으로 줌): 향후 전 과목에서 90점 이상 받으면 준다고 약속함, 19:55 이마트24
	관악 신빌리지점 방문 ==> 모두의 유심, 원칩 구입(8,800원)

- LG U+ ixi-O SM Prj[★]
- 회의(14:00, 5층 E9-01 중 회의실)
0. IXIO SM SOP 업무 소개(한광희 선임) 
1. Violet SP 재기동 방식 내용 공유
 1) $ /startup.sh
 2) $ /app/client/text/post_text.sh
 3) $ /app/client/text/get_text_result.sh
 4) $ /app/client/tts/tts.sh
2. SERVICE Deploy
3. Datadog 분석 및 문서화 작업
 1) Datadog 문서화 작업 예정
============================================================================================================== 

- [ixi 솔루션 - Call Agent SM]10월 2주차_주간보고 작성
A. 금주계획(10/07~10/11)
1. 분석, 모니터링
데이터독 환경 설정 및 일간 모니터링: ~ 10/07
3개 서비스 중심으로 Error Tracking, 시스템 모니터링
이번주부터 ixi-O 출시 예정  오픈 대기 및 모니터링 강화

2. 개발
보안 클라우드 환경 설정: ~ 10/08
IXI-VIOLET 환경 설정
  - Dev, Stg, Prd 사이트 크롬으로 연결
  - Dev 서버에서 INSTANCE 생성, SERVICE 생성, VSC 화면 연결
ixi-O 소스 분석: ~ 10/10
소스 코드 분석

2. 기타 회의
IXIO SM SOP 업무 소개 회의(한광희 선임): ~ 10/08
IXIO Prj 전반적인 흐름 이해 
 - AI APIM, API Server, Job Queue, Job Worker, TTS, 비식별화, LLM
SK AI 개인비서, 에이닷 분석
 - 멀티 LLM Agent 사용 장단점 분석
------------------------------------------------------------------------------------------------------------

B. 전주실적10/02~10/04)
 1. 투입 및 개발 환경 설정
프로젝트 투입: ~ 10/02
개발 환경 설정: ~ 10/02

2, 기타 회의
IXIO SM SOP 업무 소개 회의(한광희 선임): ~ 10/04
IXIO Prj 전반적인 흐름 
==============================================================================================================

- 자주 사용하는 주간, 월간 업무보고 양식
https://m.blog.naver.com/ahnmoon/222422040411
==============================================================================================================

- Git Hub(깃 허브) 계정[24.10.11(금)]
- 02. 깃 허브(진태만2): 업무용
https://github.com, JINTAEMAN2/zxzx3434##  --> tamario2
1. tamario2@lgupluspartners.co.kr
------------------------------------------------------------------------------------------------------------

- 01. 깃 허브(진태만): 개인용
https://github.com, JINTAEMAN/as**12**  --> tamario
1. tamario@naver.com
============================================================================================================== 

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.12(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 
	
- 주말[★] 
06:20 기상
06:30 조식(치친 2개, 소고기): 수종
06:40 집 출발(도보: 도림천 <-> 대림역)
07:50 귀가
09:55 인터넷 서핑
10:10 LG U+ 알뜰폰 개통
11:10 중식(라면)
11:45 집 출발(자전거: 도보: 도림천 <-> 대림역)
12:50 도림천 => 리미티드 방문
13:00 삼성 갤럭시 A35 핸드폰 케이스[지갑형] 구입(8,000원)
13:15 귀가
13:50 인터넷 서핑
17:30 석식
17:30 석식
17:45 실내 도보
18:50 종료
20:00 인터넷 서핑 
23:00 취침
============================================================================================================== 

- 삼성 갤럭시 A35 핸드폰 개통(13시, 집) [24.10.12(토)]
- 요금제 개통 요금제(마블링)
https://www.moyoplan.com/mypage/orders/1001583

- [개통 및 결합 상담 신청 완료]
안녕하세요. 진태만님, 모요입니다!
진태만님의 요금제 개통이 완료되었습니다.

▪️ 통신사명 : 마블링
▪️ 요금제명 : 마블링 프라임 11GB + 매일 2GB + 3Mbps (LGU 망)
▪️ 가입유형 : 번호이동
▪️ 개통번호 : 01030720898
==============================================================================================================

- LG U+ 알뜰폰 파트너스 모두의 유심 원칩
https://www.youtube.com/watch?v=nmYdi8rVNuQ
1. 관악 신빌리지점 방문 ==> 모두의 유심, 원칩 구입(8,800원)
2. 모두의 유심, 원칩 정보
 1) 유심 모델명: U 868001
 2) 일련번호(마지막 8자리): 00169667
3. 셀프 개통 가능 시간 --> 번호 이동: 10시 ~ 20시
==============================================================================================================

- 하이온 갤럭시A35 강화유리 필름 지문인식 P글라스 1매, 가격: 6,000원
https://www.coupang.com/vp/products/7972560874?itemId=22087721764&vendorItemId=89134745629

- 갤럭시A35 갤럭시A55 강화유리 지문인식 액정보호필름 2매, 가격: 10,400원
https://sinjimall.com/product/%EA%B0%A4%EB%9F%AD%EC%8B%9Ca35-%EA%B0%A4%EB%9F%AD%EC%8B%9Ca55-%EA%B0%95%ED%99%94%EC%9C%A0%EB%A6%AC-%EC%A7%80%EB%AC%B8%EC%9D%B8%EC%8B%9D-%EC%95%A1%EC%A0%95%EB%B3%B4%ED%98%B8%ED%95%84%EB%A6%84-2%EB%A7%A4/1489/
==============================================================================================================

- 갤럭시 A35 5G 단점
1. 굿락에서 Camera Assistant, 원더랜드 지원 안됨
2. AR 줄자 사용 지원 안됨(카메라 실행 > 더보기(하단) > AR 존 > 간편 측정: 없음)
=============================================================================================================  

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.13(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 

- 주말2[★]
06:02 기상
06:12 조식(돈가스 2개, 소고기)
06:30 집 출발(도보: 도림천 <=> 관악산역 <=> 서울대 입구(반환점))
08:10 귀가
08:40 인터넷 서핑
11:30 중식(라면)
11:45 집 출발(자전거 도림천 <=> 보리매 공원)
13:10 귀가
14:00 인터넷 서핑
17:25 석식
17:40 수종 귀가
17:45 실내 도보
18:50 종료
20:00 청소(바닥 쓸기, 바닥 닦기) 
21:00 샤워(체중: 68.7kg -> BMI: 23.77(과체중)
21:00 인터넷 서핑
23:00 취침
==============================================================================================================

1. e알리미 앱 비밀번호 변경(진수종)
https://www.ealimi.com, 진태민 로그인 --> 01030720898/as**12**!!(tamario@naver.com)
1. 진수종: 남부초 5학년 4반 16번
2. 손목 닥터
1) tamario/as**12**
3. 미래에셋 증권
 1) 간편 인증번호:0**9*0
4. MS Slack(슬랙) 앱
https://app.slack.com/client/T042G2USCSE/D042V44QMUZ, tamario@naver.com/as**1212!*
=============================================================================================================
 
- 갤럭시 A35 5G 사자마자 해야할 설정 20가지ᅵ(Galaxy A35 Setup) 
https://www.youtube.com/watch?v=XefYHuPpSIo&t=449s

- 새로 나온 갤럭시 A35 5G 한 달 동안 썼는데, 벗어날 수 없었습니다..! (색상, 무게, 디스플레이, 카메라, 배터리, 성능)
https://www.youtube.com/watch?v=rhRuGcQpHOM&list=WL&index=7

- A35 없는 기능 많은데? 그래도 추천하는 이유 | 장점, 초기설정, 필수 굿락 까지 모두 알려 줌 
https://www.youtube.com/watch?v=ICSTozqixHs&list=WL&index=3
=============================================================================================================  

- 갤럭시 A35 AR 줄자 사용 안됨 글 동록
https://www.samsungsvc.co.kr/cust/complain/view/TCKT0005296132 \
1. 카메라 실행 > 더보기(하단) > AR 존 > 간편 측정 > 거리를 측정할 물체 스캔 > 거리 표시
=============================================================================================================
    
- 검은 콩 구입[24.10.13(일)]
1. 맛봉달 블랙 렌틸콩 렌즈콩 미국산 10kg, 가격: 29,010원
https://item.gmarket.co.kr/Item?goodscode=2056369389
https://www.enuri.com/detail.jsp?modelno=104080121
=============================================================================================================

- 하이온 갤럭시A35 강화유리 필름 지문인식 P글라스 1매 구입, 가격: 6,000원
https://www.coupang.com/vp/products/7972560874?itemId=22087721764&vendorItemId=89134745629
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■■■■■ 2024.10.14(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>

- LG U+ ixi-O SM Prj[★]
- GIT 소스 처리(ixi-VIOLET 화면에서[보안 Cloud PC]) 
$ git fetch -a		 # 원격 저장소에서 가져오기(merge 안함)

- ixi API  @@@
$ git checkout dev		# dev 브랜치로 전환
$ git pull origin dev
-- $ git branch  -v 	 #로컬 branch의 정보를 마지막 커밋 내역 확인
-- $ git branch -r	 	# 리모트 저장소의 branch 정보 확인
1. 현상:
Your Code: 774F-8189
$ git pull origin dev 하면 GitHub Authentication 연결이 나오고 외부 접속이 안됩니다. 

2. 조치: 외부 Git Auth(https://github.com/login/device)에서 Your Code 입력 후 Google authenticatior 인증
 1)  Two-factor authentication 확인
https://github.com/settings/security
1. Google authenticatior에 GitHub: 설정
--> Google authenticatior에 lguplus.at.okta.com 설정 되어 있음
=============================================================================================================

- SUB MODULE @@@
(ixigen_post_utils) --> https://github.com/AICallAgent-AIServer/callAgent-ixiGENPost-Badwordfilter
$ cd /app/app/libs/ixigen_post_utils		# 01. 경로 선택 ■
$ git checkout dev		# dev 브랜치로 전환
$ git pull origin dev		# 02. dev 브런치에서 소스 받아 오기 ■ 
$ git reset --hard origin/dev		# 원하는 지점의 커밋으로 되돌아가는 가기 ■■ 
$ git log		# 00. Git 커밋 이력조회 ■
$ git reset --hard 해시값
ex) $ git reset --hard 13fed34029807a6dedcbcc6b865250fe5897b71b
$ git log		# 00. Git 커밋 이력조회 ■ 
출처: https://systorage.tistory.com/entry/Git-원하는-지점의-커밋으로-되돌아가는-방법-git-reset-hard [SY Storage:티스토리]
-----------------------------------------------------------------------------------------------

- SUB MODULE_02 @@@
(llm_utils) -->  https://github.com/AICallAgent-AIServer/callAgent-ixigen-utils
$ cd /app/app/libs/llm_utils	# 01. 경로 선택 ■  
$ git checkout dev		# dev 브랜치로 전환 
$ git fetch --prune		# dev 브랜치에서 remote에 존재하지 않는 refs(참조)를 지우기 처리 ■ 
$ git pull origin dev		# 02. dev 브런치에서 소스 받아 오기 ■
-----------------------------------------------------------------------------------------------

- 파이썬 패키지 업데이트 @@@
$ cd /app
$ poetry update		# 파이썬 패키지 업데이트 ■
$ pyproject.toml -> poetry.lock 파일에 실제 사용한 패키지 기록 및 가상 환경 업데이트 
=============================================================================================================

- API test @@@
-- local에서 API 서버 띄우는 명령어 @@@
$ cd /app
$ ./startup.sh 		# 서버 시작 ■  (8080 포트 사용)
==> 3개의 Applicatin startup 완료됨 ==> 정상적으로 시작됨
-----------------------------------------------------------------------------------------------------------

- debug 모드로 호출 하는 방법 @@@
.vscode/launch.json 파일 참조하셔서 vscode 의 debug 모드 실행 (8000)
하기 4가지 sh 스크립트로 로컬로 호출한 API 서버를 테스트할수 있습니다.
8080 / 8000 포트 변경

1. post_text.sh 파일 수정
 1) curl --location -vvv 'http://localhost:8080/v1/text'		# 포트 수정(8000 --> 8080) ■
 2) --header 'X-Txi-Project-key: dddd'		# Project-key 수정 ■
--------------------------------------------------------------------------------

$ /app/client/text/post_text.sh	# post tex 생성 ■
1. input: Project Key 입력 --> dddd
2. output: jobid 생성
--> {responseCode: 20200000, responseMsg: "Queue Accepted", Jobid: "380b8297-ebc7-4c58...", . ....}

$ /app/client/text/get_job_status.sh	# JOB 상태 ■
1. input: jobid 입력 --> 380b8297-ebc7-4c58...Project Key 입력 --> dddd
2. output:
--> {responseCode: 20100000, responseMsg: "Completed", ....}

$ /app/client/text/get_text_result.sh	# tex 결과 ■
1. input: jobid 입력 --> 380b8297-ebc7-4c58...Project Key 입력 --> dddd
2. output:
--> {responseCode: 500000000, responseMsg: "argument should de bytes,", ....}

$ /app/client/tts/tts.sh	# tts 테스트 ■
1. input: jobid 입력 --> 380b8297-ebc7-4c58..
2. output: 
--> Project Key 입력 --> {responseCode: 20000000, responseMsg: "Success", ...., "resutl":{"buffer" :"UklGRsxASBDD"....}}
=============================================================================================================
 
- 웹, 로컬 PC, 보안 Cloud PC에서 원노트 사용(편집용)
1. https://onedrive.live.com/edit.aspx?resid=746D42F7CF74156F!s6241a68d42b84619a00d6e55d00724b7& 
==> tamario@naver.com / tam*3*9@
==============================================================================================================

- 원노트 간단한 사용법 OneNote 앱 설명[IB 96]
https://youtu.be/fLfs4dN1lSI
 
- [OneNote] 원노트 사용법 1편 - 원노트 기본 개념 및 구성 설명 (feat. 전자필기장, 섹션, 페이지)
https://youtu.be/4PJK_nwJ5CE
==============================================================================================================

- 보안 기능 안되는 문제로 삼성전자 서비스 센터에 전화(09:20, 사업장)
1. 콜센터에서 갤럭시 원격 서비스 앱 설치하라고 하고 상담해줌
 1) 원인: 안면 인식 기능을 해놔서 얼굴 보이면 자동으로 잠금 해지됨 ==> 안면 인식 기능 제거
============================================================================================================= 
 
- LG U+ 모바일 사원증 재 발급(15:40, 사업장)
1. LG U+ 모바일 사원증 앱 URL로 받음(한광희 선임이 보내줌)
2. LG U+ 모바일 사원증 앱 설치
1) 로그인 --> tamario2(마당 ID) /as**12**!!
------------------------------------------------------------------------------
- 출처를 알 수 없는 앱 설치 방법(안드로이드13)
https://blog.naver.com/redwine812/223116083626
============================================================================================================= 
 
- 상주 연장 요청(17:30)
1. 한광희 선임 메모
2, 이성진 담당에게 카톡으로 보고
 1) 상주를 11월 29일(11월 말)까지도 괜찮으실까요? 익시오 출시 일정이 연기되서 11월 7일 즈음으로 예정되어 있고, 11월 7일 이후
부터 실제 VoC(VoE)가 들어올것 같아서, 11월 한달간 같이 SOP 조치나 VoC파악을 같이 해보시는게 어떠실까 해서요
============================================================================================================= 

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.15(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 10:45 이성진 담당 만남(커피[1. 상주 한 달 연장 확정, 2. 데이타독 메뉴얼 요청: 알아 본다고 함], 이민우 선임 
	만남: 5층 맞은편 장소에서 내년 3월까지 프로젝트 진행), 18:00 도시 가스 안전 점검(수종이가 집에 있어서 처리함)

- LG U+ ixi-O SM Prj[★]
1. 데이타독 기반 데일리 체크 리스트 작성 요청(한광희 선임) ==> 이성진 담당에게 전화해서 데이타독 메뉴얼 요청(09:20)
=============================================================================================================

- Dash 2020: Guide to Datadog’s newest announcements
https://ap1.datadoghq.com, tamario2@lgupluspartners.co.kr/qw**23**@*
============================================================================================================== 
 
- API test @@@
# lsof -ti :8080   	# list open files(시스템에서 열린 파일 목록을 알려주고 사용하는 프로세스) ■ (-t: 동작하고 있는 
프로세서들의 PID만 출력, i: 특정 프로토콜과 포트 정보를 출력)
Port 8080 is already in use
# ps -ef | grep gunicorn	 # 특정 파일에서 특정 문자열 찾기 ■
# kil -9 25510   # 해당 프로세스 종료 ■
==============================================================================================================

- local variable A is assigned to but never used 에러
1. 현상:  ob_id_01 = "SS" 
local variable A is assigned to but never used: 해당 변수가 전혀 사용하지 않고 있다는 말(변수를 선언해 놓	고 사용하지 않더라도 
우선은 메모리 공간을 잡는 행동을 하기 때문}
2, 조치: ob_id_01 = ob_id_01 + "SS"
--------------------------------------------------------------------------------

- missing whitespace 에러
1. 현상:if f r.status_code !=200: 입력시 PEP 8: E225 missing whitespace around operator
2, 조치: if r.status_code != 200: 공백을 주면 물결 밑줄 제거됨
==============================================================================================================

- Alphakey 권한 신청
1. https://lguplus.alphakey.kr/web/dashboard/user,  tamario2@lgupluspartners.co.kr/as**12**
 1) 익시오 SM 업무 수행을 위한 권한 신청(지라, 컴플루언스)
=============================================================================================================

- MSI 노트북 키보드 한글 안 쳐질때 해결 법[24.10.15(화)]
1. MSI 개인 업무용 노트북 정보(MSI A10SD-i7) (17인치: 모델명, S/N) 
- 키보드 한영 전환 한글 안쳐질때 해결 법 
https://m.post.naver.com/viewer/postView.naver?volumeNo=36997835&memberNo=23090
1. 하드웨어 키보드 레이아웃 변경(MSI A10SD-i7 노트북(업무용 17인치)에서)
 1) 한글 키보드(101키) 종류 3(한/영 전환: Shift + Space) ==> 한글 키보드(101키) 종류 1(한/영 전환: 오는쪽 <Alt> 키)
============================================================================================================== 
 
- "ArgoCD" 계정 신청
1. Violet SP에서 배포하시는 서비스 모니터링 및 구성도 설정할수 있어서 AWS K9S 접속안하셔도 일단 ArgoCD로 대응 가능
============================================================================================================== 
 
- 강화 유리 도착 및 필름 붙이기(22:30, 집)
- 액정 보호필름 완벽 붙이기 / 갤럭시 아이폰 태블릿 / 강화유리 방탄유리 PET 필름 붙이는 방법
https://www.youtube.com/watch?v=142Q9hyAxDM
==============================================================================================================

- 노트북 메모리 구매 검토(MSI GE60_2OE 노트북용)
- 노트북 메모리 RAM 하이닉스 칩 SEC 칩, 16GB, 1개, 가격: 14,300원
https://www.coupang.com/vp/products/8176058826?itemId=23364757362&vendorItemId=90498509361& 
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:30 ==> 스마트 워킹 데이(매월 둘째, 셋째 주 수요일 17시에 퇴근)

- LG U+ ixi-O SM Prj[★]
- ixi-O 데일리 체크 리스트 작성
1. ixi-O 데일리 체크 리스트 정리
2. 일일 점검 사항 정리
==> ixi-O 데일리 체크 리스트.xlsx 파일 작성 후 한광희 선임에게 메일로 보냄
=============================================================================================================
 
- 회의(14:00, 6층 오픈룸 E9-01)
1. 운영 서버 정기 배포 및 시연(한광희 선임)
 1) 비식별화 api 추가
 2) 한글 음력 달력 lib: korean-lunar-calendar lib 추가
 ==> Agile 품질 프로페선: 이정현(차장)
---------------------------------------------------------------------------------------------------------------------------

- Confluence 접근
https://lgu-cto.atlassian.net/wiki/spaces/AIX/overview
1. 문서 작업 중
-----------------------------------------------------------------------------------------------

- ArgoCD란? 개념부터 설치 배포까지
https://wlsdn3004.tistory.com/37
1. "ArgoCD" 계정 신청
2. ArgoCD: Kubernetes 환경에서의 애플리케이션 배포와 관리를 지원하는 도구
- Argo CD 이해하기 1편: 컨셉[악분 일상]
https://www.youtube.com/watch?v=cLgzqc_hwIg&list=PL1mta2YyMpPWItLT-9XCaSsdF_EysOS4Z
=============================================================================================================

- 사용자 방화벽 신청 추가[24.10.16(수)] ==> 신청 완료[♥♥]
제목: Violet 사용을 위한 서버 접근 신청
1. 신청사유: Violet 사용을 위한 서버 접근 신청
2. 출발지: SECURITY_CLOUDPC
3. 만료일시: 작성 필(최대 1년)
4. 서버IP:   
		211.115.75.60  ==> Prd
		211.115.75.69	==> Prd
		211.115.75.73	==> Prd
		61.101.245.250	==> Prd
5. 포트작성(TCP): 80, 443
6. 사용목적 작성: 80(http), 443(https)
=============================================================================================================

- 02. API test @@@
- A. 01. post tex 실행 테스트 @@@
- DEBUG 모드로 호출 하는 방법(ixi-VIOLET 화면에서[보안 Cloud PC])
0. Ctrl + z ==>./startup.sh # 서버 시작 중지 ■
# lsof -ti :8000   	# list open files(시스템에서 열린 파일 목록을 알려주고 사용하는 프로세스) ■=
1. /post_text.sh 파일 수정
 1) curl --location -vvv 'http://localhost:8000/v1/text'		# 포트 수정(8080 -> 8000[debug 모드]) ■ 
-----------------------------------------------------------------------------------------------------

2. DEBUG > RUN AND DEBUG > Python: FastAPI(/.vscode/launch.json 파일에서 설정되어 있음): ▶ 버튼: 클릭(실행)
INFO: Start server process [1812]
INFO: Application startup complete.
-----------------------------------------------------------------------------------------------------

3. /llm_model.py 파일에서(/v1/) 수정
@router.post("", response_model=ResponsePostTextBody)
async de post_text(

)
	sMsg = "\n\n\n ■■■ [#### JOB ID 생성 Start ####] ■■■"
	print("■■■ [/llm_model.py] [post_text()] ==> [T_01]" + sMsg )
 
	resquest_tlo = get_request_tlo(      	# ===> breakpoint 설정 ■■■

	}
	
	job_request_datetime = get_timestamp()
	request_date = request.model_dump(by_alias=True)
	job_id = str(uuid.uujid4())	
	sMsg = "■■■ 01.JOB ID 생성  ■■■\n"
	sMsg += "[■ 01. job_id]" + job_id
	print("■■■ [/llm_model.py] [post_text()] ==> [T_42]" + sMsg )
	
	task = llm_proecss_task.apply_async(
		kwagrs={
			"data": mes_data.model_dump (),
		},
		MessageGroupId=get_mes_group_id(),
		MessageDeduplication=call_id,
	)
	
	if task:
		sMsg = "■■■ 91. JOB ID 생성 결과 ■■■\n"
		sMsg += "[■01. respnseCode]20200000"
		sMsg += "[■02. respnseMsg]Queue Accepted\n\n\n"
		print("■■■ [/llm_model.py] [post_text()] ==> [T_91]" + sMsg )
		
		return JSONRespnse(	
		) 
	
	sMsg = "■■■ 99. JOB ID 생성 결과_에러 ■■■\n"
	sMsg += "[■01. respnseCode]999999\n\n"
	print("■■■ [/llm_model.py] [post_text()] ==> [T_99]" + sMsg )   # missing withespace around operator
	
	raise QueueError()
}
-----------------------------------------------------------------------------------------------------

4. post text 실행 ■ ==> TERMINAL(Tab)에서
$ /app/client/text/post_text.sh	# post tex 실행 ■  ==> DEBUG 모드로 전환됨  ■■■■■■

5. 로그 확인 ■ ==> DEBUG CONSOLE(Tab)에서
■■■ [/llm_model.py] [post_text()] ==> [T_01] ■■■ [#### LLM 모델 Start ####] ■■■ 
■■■ [/llm_model.py] [post_text()] ==> [T_41] [job_id]7047ade2-ab82-4cdc-=b54c-0d2fb8899abc
■■■ [/llm_model.py] [post_text()] ==> [T_42] ■■ 01. post text 처리 ■■■
■ 01. job_id]7047ade2-ab82-4cdc-=b54c-0d2fb8899abc

■■■ [/llm_model.py] [post_text()] ==> [T_91] ■■ 91. post text 결과 ■■■
[■01. respnseCode]20200000[■02. respnseMsg]Queue Accepted

INFO: 127.0.0.1:56864 - "POST /api/vi/text HTTP/1.1" 202 Accepted
=============================================================================================================

- 유튜브 음악으로 스마트폰 벨소리 만드는 방법 (쉽고 간단하게 좋아하는 음악으로 바꾸는 법)
https://www.youtube.com/watch?v=qD8ukhoSDgE&list=WL&index=7
1. 핸드폰 벨소리 변경(01. 논꽃(벨소리용).mp3
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.17(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

- LG U+ ixi-O SM Prj[★]
- ixi-O 데일리 체크 리스트 수정
1. ixi-O 데일리 체크 리스트 정리 수정
 1) DATADOG 홈 연결 추가
2. 일일 점검 사항 정리 수정
==> ixi-O 데일리 체크 리스트.xlsx 파일 작성 후 한광희 선임에게 메일로 보냄
=============================================================================================================
 
- ixi-O 데일리 체크 리스트(10.17) 등록
https://lgu-cto.atlassian.net/wiki/spaces/AIX/pages/38465537159/Report
=============================================================================================================

- API test @@@
# lsof -ti :8080   	# list open files(시스템에서 열린 파일 목록을 알려주고 사용하는 프로세스) ■ (-t: 동작하고 있는 
프로세서들의 PID만 출력, i: 특정 프로토콜과 포트 정보를 출력)
Port 8080 is already in use
# ps -ef | grep gunicorn	 # 특정 파일에서 특정 문자열 찾기 
# kil -9 25510   # 해당 프로세스 종료 ■
==============================================================================================================

- step 2. JOB 상태 테스트 @@@
- DEBUG 모드로 호출 하는 방법(ixi-VIOLET 화면에서[보안 Cloud PC])
0. Ctrl + z ==>./startup.sh # 서버 시작 중지 ■
# lsof -ti :8000   	# list open files(시스템에서 열린 파일 목록을 알려주고 사용하는 프로세스) ■=
1. /post_text.sh 파일 수정
 1) curl --location -vvv 'http://localhost:8000/v1/text'		# 포트 수정(8080 -> 8000[debug 모드]) ■ 
-----------------------------------------------------------------------------------------------------

2. DEBUG > RUN AND DEBUG > Python: FastAPI(/.vscode/launch.json 파일에서 설정되어 있음): ▶ 버튼: 클릭(실행)
INFO: Start server process [1812]
INFO: Application startup complete. 
-----------------------------------------------------------------------------------------------------

3. /llm_model.py 파일에서(/v1/) 수정
@router.get("/job-status", response_model=ResponsePostTextBody)
async de post_text(

)
	sMsg = "■■■ [#### step 2. JOB 상태 확인 Start ####] ■■■"
	print("\n\n\n ■■■ [/llm_model.py] [post_text()] ==> [T_01]" + sMsg )
 
	resquest_tlo = get_request_tlo(      	# ===> breakpoint 설정 ■■■

	}
	
	job_request_datetime = get_timestamp()
	request_date = request.model_dump(by_alias=True)
	job_id = str(uuid.uujid4())	
	sMsg = "■■■ 01. JOB 상태 확인 ■■■\n"
	sMsg += "[■ 01. job_id]" + job_id
	print("■■■ [/llm_model.py] [post_text()] ==> [T_42]" + sMsg )
	
	task = llm_proecss_task.apply_async(
		kwagrs={
			"data": mes_data.model_dump (),
		},
		MessageGroupId=get_mes_group_id(),
		MessageDeduplication=call_id,
	)
	
	if task:
		sMsg = "■■■ 91. JOB 상태 결과 ■■■\n"
		sMsg += "[■ 01. respnseCode]20200000"
		sMsg += "[■ 02. respnseMsg]Queue Accepted\n\n\n"
		print("■■■ [/llm_model.py] [post_text()] ==> [T_91]" + sMsg )
		
		return JSONRespnse(	
		) 
	
	sMsg = "■■■ 99.JOB 상태 결과_에러 ■■■\n"
	sMsg += "[■01. respnseCode]999999\n\n"
	print("■■■ [/llm_model.py] [post_text()] ==> [T_99]" + sMsg )   # missing withespace around operator
	
	raise QueueError()
}
-----------------------------------------------------------------------------------------------------

4. post text 실행 ■ ==> TERMINAL(Tab)에서
$ /app/client/text/get_job_status.sh	# JOB 상태 확인 ■ 	 ==> DEBUG 모드로 전환됨  ■■■■■■

5. 로그 확인 ■ ==> DEBUG CONSOLE(Tab)에서
■■■ [/llm_model.py] [post_text()] ==> [T_01] ■■■ [#### step 2. JOB 상태 확인 Start ####] ■■■ 
■■■ [/llm_model.py] [post_text()] ==> [T_41] [job_id]7047ade2-ab82-4cdc-=b54c-0d2fb8899abc
■■■ [/llm_model.py] [post_text()] ==> [T_42] ■■ 01. post text 처리 ■■■
■ 01. job_id]7047ade2-ab82-4cdc-=b54c-0d2fb8899abc

■■■ [/llm_model.py] [post_text()] ==> [T_91] ■■ 91. post text 결과 ■■■
[■ 01. respnseCode]20200000[■ 02. respnseMsg]Queue Accepted

INFO: 127.0.0.1:56864 - "POST /api/vi/text HTTP/1.1" 202 Accepted
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

- [python] flake8에서 뱉는 메시지의 의미 @@@
https://itholic.github.io/python-flake8-list/

E501 line too long (89 > 79 characters)
파이썬에서는 한 줄이 79자 이상 넘어가지 않기를 권고한다.
---------------------------------------------------------------------------------------------------------------------

E101 indentation contains mixed spaces and tabs
들여쓰기에 스페이스와 탭이 섞여있다는 뜻이다.
---------------------------------------------------------------------------------------------------------------------

s =  'Hello, World!'
E222 multiple spaces after operator
변수를 선언하거나 하는 부분에서 ‘=’ 뒤쪽에 공백이 여러개 포함됐다는 의미이다.
(파이썬에서는 ‘=’ 연산자의 앞뒤로 공백 하나씩만을 포함하도록 권고■)
---------------------------------------------------------------------------------------------------------------------

s='Hello, World!'
참고로 다음과 같이 ‘=’ 연산자 앞뒤로 공백을 쓰지 않아도 권고사항이 발생한다.
 이 경우는 E225 missing whitespace around operator 권고사항이 발생
==============================================================================================================

- print log(파이썬에서)
sMsg = "\n\n\n ■■■ [#### JOB ID 생성 Start ####] ■■■"
print("■■■ [/llm_model.py] [post_text()] ==> [T_01]" + sMsg )

sMsg = "■■■ [#### [BMI 계산 Startt ####] ■■■\n" 
print("■■■ [/bmi_calculate.py] ==> [T_01]" + sMsg )

sMsg = "■■■ 01. job_id 생성 ■■■\n"
sMsg += "[■ 01. job_id]" + job_id
print("■■■ [/llm_model.py] [post_text()] ==> [T_42]" + sMsg )
==============================================================================================================

- 12. 운영[AI솔루션D] (Confluence)
https://lgu-cto.atlassian.net/wiki/spaces/AIX/pages/38419496963/12.
==============================================================================================================

- LG U+ ixi-O SM Prj[와이파이(보안) [24.10.17(목)] --> 사용할 것 ■ 
1. 네트워크 이름(SSID): U+Net6398_5G
2. 비밀번호: 63FC2P#B3A
============================================================================================================== 

- 노트북 명 변경
1. 노트북 명: TAMA-NT-23-NH-WMS  ==> TAMA-MSI-A10SD-I7-21Y 
------------------------------------------------------------------------------

- MSI 개인 업무용 노트북 정보(MSI A10SD-i7) [21.10.23(토) 구입]
1. 제품 이름: Creator 17 A10SD-1015XKR-GG71075H16GXXDXX
2. 모델명: 9S7-17G312-1015[Creator 17 A10SD-1015XKR]
3. S/N(일련 번호): K2101N0018559
 1) CHK: 7BE
============================================================================================================== 

- 윈도우 단축키 모음 100개
https://chakhani.tistory.com/101
1. 윈도우키 + A: 알림 센터 설정(와이파이, 블루투스, 음량 조절)
2. 윈도우키 + I : 설정 화면 ==> 홈(새창)
 1. 시스템 ==> 정보
   1) 장치 사양■ 
   2) Windows 사양■
==============================================================================================================

- 스마트폰 액정 보호 필름 붙이는 법, 어렵지 않아요. (기포 먼지제거 꿀팁, 갤럭시 우레탄, 아이폰 강화유리)
https://www.youtube.com/watch?v=qhIy7lAwaik
1. 핸드폰 전원 끄기
2. 딱기(먼지 제거: 스카치 테이프 이용)
3. 필름에서 접착면(뒷면 테이프) 1/2 만 떼어내서 핸드폰에 붙임(카메라, 수화부 등 각이 맞는지 꼼꼼히 확인)
4. 필름에서 접착면 빨리 떼기
5. 잔여 기포 및 먼지 제거 하기
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.18(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 05:22 집 출발(백팩[우산 소지, 쓰레기], 06:55 출근[유통기간 지난 빵 획득], 17:00 퇴근(11시 이후 약한 비 ->
	퇴근할 때 비 안 옴[백팩 2개]), 17:30 우장산역 초가, 18;25 다이소 우장산역점 방문 => 충전기 어댑터 25W -S(화이트) SOLUM(삼성 
	전자 납부용: 5천원) 구입(수종이 방에 설치 해줌), 18:00 신길역 도착, 18:25 보라매역 도착(도림천 출입 통제: 육교 이용), 18:35 귀가
	, 한광희, 윤현노 선임 재택 근무

- LG U+ ixi-O SM Prj[★]
- 일간, 주간 보고 작성
ixi-O 데일리 체크 리스트(10.18).xlsx
[ixi 솔루션 - Call Agent SM]10월 3주차_주간보고.pptx
==============================================================================================================

- 동영상 교육 시청
- [Datadog 웨비나] Front-End 애플리케이션 모니터링 및 최적화
https://www.youtube.com/watch?v=xAMFnk0T-RE&list=WL&index=2
==============================================================================================================
 
- Latency: 지연 시간
1. [Performance] 지연 시간 메트릭 마스터하기: P90, P95, P99는 Latency Metrics에서 중요한 퍼센타일 지표로, 각각 90%, 95%, 99%의 
요청이 특정 시간 이하로 처리되는지를 나타낸다.  
==============================================================================================================
 
- 스마트 관악
https://smart.gwanak.go.kr
1. 도림천 수위 상세정보
 1) 08: 00 --> 현재상태 안전: 현재는 안전한 상태입니다.
 2) 15: 30 --> [별빛내린천 이용 통제 안내]  ==> 도림천 수위: 0.14 미터 --> 비 20mm 이상 내림(10월 강우량 역대 2위)
  가. 기상청 비 예보로 별빛내린천 진입을 전면 통제 중입니다. 고립사고의 위험이 있으니 출입을 금지하여 주시기 바랍니다. 
  통제기간: 강우 소강 시까지
==============================================================================================================

- 초보자를 위한 파이썬 300제
https://wikidocs.net/book/922
==============================================================================================================

- 유튜브 메인 화면 썸네일 갯수가 4개에서 1개로 줄어듬
https://kin.naver.com/qna/detail.nhn?d1id=1&dirId=10604&docId=339405323
==============================================================================================================

- 개발자로 긴 커리어를 가지고 싶다면?│인프콘2024
https://www.youtube.com/watch?v=FPdWTYxcdeM&list=WL&index=13
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.19(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 
	
- 주말[★] 
06:02 기상
06:12 조식(돈가스 2개, 소고기): 수종
06:30 집 출발(도보: 도림천 <=> 관악산역 <=> 서울대 입구(반환점))
08:10 귀가
08:40 인터넷 서핑
09:07 집 출발(자전거)
09:54 전자랜드 본관 지하 2층 도착
10:10 매티스(https://notelcd.com) 방문 ==> MSI GE60_2OE 노트북(15.6인치) 액정 수리 요청(중고:6만원)
10:30 중고 액정 교체 완료(사각 4분데 흰점, 왼쪽 가운데 흰점 발견) ==> 모티터 연결해서 사용하면 문제 없다고 함
10:35 용산 출발
11:03 레알짱 노량진3호점 도착 ==> 뷔페 7천원: 너무 비쌈(포기)
11:25 제주 보쌈(해태 보라매 타워, 보라매역 2번 출구) 도착
11:30 중식(정식: 4천원[제주 보쌈(해태 보라매 타워]): 처음 시식 
11:45 도보: 도림천 <-> 대림역
12:51 귀가
13:50 인터넷 서핑
14:00 MSI 노트북 OS 재 설치 --> CMOS 비밀번호 설정되어 있어서 OS 포맷 실패 --> 윈도우 11 바이오스 진입 방법으로 설치 
	1. C:\ 로컬 디스크(HD_2014_03B(HB_1TB)) (C:)   ==> OS 설치: Main @@@ ==> 설치 후 속도 많이 느려짐 
17:30 석식
17:45 실내 도보
18:50 종료
20:00 인터넷 서핑 
20:10 MSI 노트북 SW 재 설치
23:00 취침
============================================================================================================== 

- 기본 프로그램 설치 @@@
A. Window 11 x64 설치 ==> 업데이트로 설치 ■
1. 컴퓨터 이름: SOOJING_NT --> 수종 노트북
2. 드라이브 명
 1) C:\ 로컬 디스크(SSD_256GB) (C:) ==> OS 설치: Main @@@  --> 다시 설치■
 2) D:\ DHD_2014_03B(HB_1TB) (D:)
-------------------------------------------------------------------------------------------------------------

- 윈도우11 바이오스 진입 방법
https://m.blog.naver.com/pnt0405/223048230958
1, 키보드의 [Shift] 키를 누른 채 [전원] > [다시 시작]을 선택 
2. 잠시 기다리면 재부팅 되면서 평소와는 달리 옵션 선택 화면이 뜨게 되는데요, ==> [문제 해결]을 눌러줍니다.
3. 다음 화면에서 [고급 옵션]을 눌러줍니다.
============================================================================================================== 

- 진수종 Microsoft 계정 생성
1. soojong24@hotmail.com/soo0508@ 
--------------------------------------------------------------------------------

2. 보안 정보 추가(진수종 네이버)
 1) https://mail.naver.com, soojong2021@naver.com / soo0508@ 
==============================================================================================================
 
- 귀신이 걸어놓은 노트북의 바이오스 암호 푸는 방법
https://www.youtube.com/watch?v=CNGPRdIDBBI

- 컴퓨터와 노트북 바이오스 암호는 어떻게 풀까?? 이 영상보시면 아실수있습니다.
https://www.youtube.com/watch?v=4lavdiUdHPA
==============================================================================================================

- 사이렌 아이핀(나이스 아이핀 앱 설치) [24.10.19(토)]
1. 발급기관: 한국신용평가정보 ==> https://www.siren24.com ==> tamario / 202*오*h@ --> 2차 비밀번호: hp수*16*1
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.20(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 

- 주말2[★]
06:02 기상
06:12 조식(돈가스 2개, 소고기)
06:30 집 출발(도보: 도림천 <=> 관악산역 <=> 서울대 입구(반환점)): 기온 급냉 8도(바람 많이 붐, 잠바 착용)
08:10 귀가
08:40 인터넷 서핑
11:20 출발(자전거)
11:27 중식(정식: 4천원[제주 보쌈(해태 보라매 타워])
11:50 종료
11:50 집 출발(자전거 도림천 <=> 보리매 공원)
11:52 도보: 도림천 <-> 대림역
12:55 귀가
13:40 인터넷 서핑
14:00 MSI 노트북 SW 재 설치
17:25 석식(라면, 햅반) 
17:45 실내 도보
18:50 종료
19:10 수종 귀가
19:15 MSI 노트북 포맷 후 OS 재 설치 --> CMOS 비밀번호 수정이가 알려줌(soo0508@) --> OS 설치 과정에서 USB 장치 인식 못함(USB: 
	SanDisk Cruzer Blade Z50 [16G])	--> 윈도우11 바이오스 진입 방법 ==> C: D: 드라이버 포맷 후 OS 재 설치
	1. C:\ 로컬 디스크(SSD_256GB) (C:) ==> OS 설치: Main @@@	
20:00 청소(바닥 쓸기, 바닥 닦기) 
21:00 샤워(체중: 68.7kg -> BMI: 23.77(과체중)
21:00 인터넷 서핑
23:00 취침
==============================================================================================================
 
- 컴퓨터부팅(CMOS BIOS) 비밀번호 설정
https://dolphin11.tistory.com/66 

- [마루PC] USB를 이용한 윈도우11 설치 방법 : MSI. ASUS 메인보드 BIOS 부팅 순서 설정 바꾸기 !
https://blog.naver.com/marupc_/223033728520
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■■■■■ 2024.10.21(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 05:22 집 출발(기온 급하강 10도: 잠바 착용), 삼성 1:5 기아(한국 시리즈 1차전, 18:30, 광주, 우천
	중단[23(수) 6회부터 다시 시작 --> 기아 1차전 승])

- LG U+ ixi-O SM Prj[★]
- A. commai-ixi-beat 배포
1. SERVICE Deploy 베포 에러
 1) 현상: 실패: Degraded(OutOfSync)
==============================================================================================================

- sc-commai-ixi-api Summary URL 변경
1. sc-commai-ixi-api Summary URL(1d로 설정)
https://app.datadoghq.com/apm/services/sc-commai-ixi-api/operations/fastapi.request/resources?dependencyMap=qson%3A%28data%3A%28telemetrySelection%3Aall_sources%29%2Cversion%3A%210%29&deployments=qson%3A%28data%3A%28hits%3A%28selected%3Aversion_count%29%2Cerrors%3A%28selected%3Aversion_count%29%2Clatency%3A%2195%2CtopN%3A%215%29%2Cversion%3A%210%29&env=prd&fromUser=true&groupMapByOperation=null&infrastructure=qson%3A%28data%3A%28viewType%3Apods%29%2Cversion%3A%210%29&panels=qson%3A%28data%3A%28%29%2Cversion%3A%210%29&resources=qson%3A%28data%3A%28visible%3A%21t%2Chits%3A%28selected%3Atotal%29%2Cerrors%3A%28selected%3Atotal%29%2Clatency%3A%28selected%3Ap95%29%2CtopN%3A%215%29%2Cversion%3A%211%29&summary=qson%3A%28data%3A%28visible%3A%21t%2Cchanges%3A%28%29%2Cerrors%3A%28selected%3Acount%29%2Chits%3A%28selected%3Acount%29%2Clatency%3A%28selected%3Alatency%2Cslot%3A%28agg%3A95%29%2Cdistribution%3A%28isLogScale%3A%21f%29%2CshowTraceOutliers%3A%21t%29%2Csublayer%3A%28slot%3A%28layers%3Aservice%29%2Cselected%3Apercentage%29%2ClagMetrics%3A%28selectedMetric%3A%21s%2CselectedGroupBy%3A%21s%29%29%2Cversion%3A%211%29&start=1729383412005&end=1729469812005&paused=false
1. &start=1729383412005&end=1729469812005
 
2. sc-commai-ixi-api Summary URL(1d로 설정)
https://app.datadoghq.com/apm/services/sc-commai-ixi-api/operations/fastapi.request/resources?dependencyMap=qson%3A%28data%3A%28telemetrySelection%3Aall_sources%29%2Cversion%3A%210%29&deployments=qson%3A%28data%3A%28hits%3A%28selected%3Aversion_count%29%2Cerrors%3A%28selected%3Aversion_count%29%2Clatency%3A%2195%2CtopN%3A%215%29%2Cversion%3A%210%29&env=prd&fromUser=true&groupMapByOperation=null&infrastructure=qson%3A%28data%3A%28viewType%3Apods%29%2Cversion%3A%210%29&panels=qson%3A%28data%3A%28%29%2Cversion%3A%210%29&resources=qson%3A%28data%3A%28visible%3A%21t%2Chits%3A%28selected%3Atotal%29%2Cerrors%3A%28selected%3Atotal%29%2Clatency%3A%28selected%3Ap95%29%2CtopN%3A%215%29%2Cversion%3A%211%29&summary=qson%3A%28data%3A%28visible%3A%21t%2Cchanges%3A%28%29%2Cerrors%3A%28selected%3Acount%29%2Chits%3A%28selected%3Acount%29%2Clatency%3A%28selected%3Alatency%2Cslot%3A%28agg%3A95%29%2Cdistribution%3A%28isLogScale%3A%21f%29%2CshowTraceOutliers%3A%21t%29%2Csublayer%3A%28slot%3A%28layers%3Aservice%29%2Cselected%3Apercentage%29%2ClagMetrics%3A%28selectedMetric%3A%21s%2CselectedGroupBy%3A%21s%29%29%2Cversion%3A%211%29&start=1729465875015&end=1729469475015&paused=false
1. &start=1729465875015&end=1729469475015
 1) start, end가 변경됨
2. 조치: &groupMapByOperation 추가
============================================================================================================== 

- MSI 노트북 OS 재 설치, 환경 설정(20시, 집)
1. MSI 노트북  BIOS 진입 후 BOOT 순서에서 Sandisk USB 인식하게 설정
 1) Sandisk USB를 USB 3.0 포트에 삽일할 것
2. 윈도우 11 OS 재 설치
3. SW 재 설치
==============================================================================================================

- 01. 개인 노트북 정보(MSI A10SD-i7) 정보 
1. 노트북 명: TAMA-NT-23-NH-WMS  ==> TAMA-MSI-A10SD-I7-21Y 
2. 로그인 비밀번호: qw**23**@*
 1) 계정 > 로그인 옵션 > PIN 번호: as**12**!!
------------------------------------------------------------------------------
- MSI 개인 업무용 노트북 정보(MSI A10SD-i7) [21.10.23(토) 구입]
1. 제품 이름: Creator 17 A10SD-1015XKR-GG71075H16GXXDXX
2. 모델명: 9S7-17G312-1015[Creator 17 A10SD-1015XKR]
3. S/N(일련 번호): K2101N0018559
 1) CHK: 7BE
============================================================================================================== 

- 변경 개발
1. ixio "변경개발" 사항의 요청이 또 생겨서, 차주 수요일에 다음의 내용을 변경 개발 적용 예정
 1) /api/v1/text/result 응답 반환 이후 반환된 job_id의 result_data 테이블에서 레코드 삭제 및 job_status에서 해당 job_id의 
상태 변경(업데이트 일자 및 result_code: 20400000) 진행
============================================================================================================== 

- api/worker/beat 재기동(개발기에서)
1. (개발기) 에서 api/worker/beat 재기동 한번 직접 해봐주세요. SOP 조치 하시려면 재기동 해보시면서 Violet SP에 익숙해지시는
게 필요할것 같아요. SP 배포시에 참고하실 설정값들 아래 컨플루언스에 각 입력사항 정리해두었습니다.
============================================================================================================== 

- 병원 서류 떼기 귀찮았는데…실손보험금 손쉽게 받게 된다 | 한국경제
1. https://www.hankyung.com/article/202410184525i
2. 실손24 앱(보험 개발원에서 개발, 운영)으로 보험금 청구
============================================================================================================== 

- 수종 노트북(MSI GE60_2OE) OS 재 설치, 환경 설정(20시, 집)
1. MSI 노트북  BIOS 진입 후 BOOT 순서에서 Sandisk USB 인식하게 설정
 1) Sandisk USB를 USB 3.0 포트에 삽일할 것 ==> 성공
 2) 컴퓨터 부팅(CMOS BIOS) 비밀번호 제거 ==> 성공
2. 윈도우 11 OS 재 설치 
1. 컴퓨터 이름: SOOJING_NT --> 수종 노트북
2. 드라이브 명
 1) C:\ 로컬 디스크(SSD_256GB) (C:) ==> OS 설치: Main @@@ ==> 속도 엄청 빨라짐
 2) D:\ DHD_2014_03B(HB_1TB) (D:)
3. SW 재 설치
==============================================================================================================

- [보안] 컴퓨터 보안을 위한 CMOS 비밀번호 설정 및 해제 안내
https://coreaone.net/1390
1. CMOS 비밀번호 해제하기
 1) CMOS 비밀번호를 입력하고 BIOS 설정화면으로 진입
 2) BIOS 진입 후 Power on Password를 disable로 변경! 완료~ 
 3) 비밀번호를 지우고 싶으시면 비밀번호변경에 가서 현재 비밀번호를 치고 바꿀 비밀번호에 '빈칸' 엔터 ==> F10(저장)
==============================================================================================================

- [Microsoft] SSD 윈도우 설치시 EFI 시스템에서는 GPT 디스크에서만 윈도우 설치되는 문제 해결
 https://softinfo.co.kr/article/%EC%9E%90%EC%A3%BC-%EB%AC%BB%EB%8A%94-%EC%A7%88%EB%AC%B8/3/1724/
1. 현상: "이 디스크에 Windows를 설치할 수 없습니다. 선택한 디스크에 MBR 파티션 테이블이 있습니다. ER1 시스템에서는 
GPT 디스크에만 윈도우를 설치할 수 있습니다."라는 에러 문구 뜸
2. 조치:
 1) Shift + F10: 명령프롬프트 창 실행
 2) > diskpart
 3) DISKPART> list disk   ==> 디스크 번호 / 크기 / 사용가능 확인
 4) DISKPART> select disk 0     ==> 디스크 선택
 5) DISKPART> clean   	==> 디스크 파트에서 선택한 디스크 포맷 (데이터 모두 사라지니 주의)
 6) DISKPART> convert gpt	==> GPT로 변경됨
 7) DISKPART> exit
 8) Wnddows 설치 프로그램(화면)으로 바뀜
  가. 새로 고침(R): 클릭
  나. 하단에 "드라이브 0 파티션1에 를 Windows를 설치할 수 없습니다" 라는 문구 ==> 사라짐
  다. 다음(N): 클릭 --> 설치 진행됨
 ==============================================================================================================

- 01. 개인 노트북(MSI A10SD-i7) 사양[2021.10.23(토) 구입] 
1. 컴퓨터 이름: TAMA-MSI-A10SD-I7-21Y --> 개인 업무용 노트북
2. 드라이브 명
 1) C:\ 로컬 디스크(SSD_660G) (C:)  ==> OS 설치: Main @@@
 2) D:\ D_Drive(SSD_292G) (D:)
------------------------------------------------------------------------------------------------------------------
 
- MSI 개인 업무용 노트북 정보(MSI A10SD-i7) (모델명m, S/N) [2021.10.23(토) 구입] 
1. CPU: Intel(R) Core(TM) i7-10750H CPU @ 2.60GHz 2.59 GHz
2. RAM(메모리): DDR4 32.0GB(31.8GB 사용 가능: 2슬롯[16G 2개) ■■ ==> 16G + 32G(추가) = 48G 가능 ■
3. 저장 장치: SSD 1TB
 1) OS: 미포함(FreeDos) ==> Windows 10 Enterprise 64비트 운영 체제, x64 기반 프로세서 
4. 그래픽 카드(GPU): GTX1660 Ti Max-Q
5. 화면 크기: 17.3 인치
6. 무게: 2.2kg
7. 단자: USB 3.0, USB Type C
------------------------------------------------------------------------------------------------------------------
 
- MSI 개인 업무용 노트북 메모리 추가 검토
- 삼성전자 노트북 DDR4-3200 (32GB), 가격: 108,390원 ==> 구매 검토
http://itempage3.auction.co.kr/DetailView.aspx?itemno=E743613516
https://prod.danawa.com/info/?pcode=10881360&deliveryYN=Y
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.22(화) 작업 ■■■■■■■■■■■■■■■■■■
-> 07:00 ~ 18:00 ==> 05:22 집 출발(보슬비: 우산 소지), 18:00 퇴근(보슬비: 우산)

- LG U+ ixi-O SM Prj[★]
- 검수용 자료 작성
1. 매월 20일 작성 후 이성진 담당, 한광희 선임에게 메일로 보낼 것
 1) 애버커스_ixi-O_운영유지보수_검수용자료_2410.xlsx
 2) 13:50 ixi-O 데일리 체크 리스트(10.22).xlsx 파일 담당에게 메일로 보냄 ==> 잘못 됨
============================================================================================================== 

- 배포(10시, 내 자리, 윤현노 선임이 가이드 해줌)
- A. commai-ixi-api 배포
3. SERVICE Deploy
 1) Service Manager(화면) > Service Manager Grid에서 Action 칼럼 ╊ 버튼(Deploy): 클릭
 2) Service Deploy(새창)
  가. Select Service Version: 0.0.62  --> 생성한 이미지 버전 ■
  나. Select Rentime Language: Python
  다. Command:./bin/bash
  라. Arguments: -c /app/startup.sh 	■■■■
  마. Env: 기본 값
  바. Select Secret: commai-encrypt-key
  사. Contact Port: 8080  ==> APIKEY: Disable(체크  박스 해제) , Strict Affinity: Enable(체크 박스 설정) ■
  아. StartupProbe - Failure Threshold, AutoScale, AutoScale - Min Relicas, AutoScale - Max Relicas
	300, 10, 12, 20 	--> 300, 20, 1, 1: 개발 서버
  자. Requests - CPU, Requests - Memory, Limits - CPU, Limits - Memory
	1, 2Gi, 1, 2Gi 	--> 1, 2Gi, 1, 2Gi : 개발 서버
 차. Gpu
	0
  카. 노드 그룹
   	가) Select Node Groups: eks-violet-service-communication-p4d-24xlarge-ng - Exist GPU	==> p4d: GPU 존재(LLM 일때 사용) ■
	나) Select Node Groups: eks-violet-service-communication-c6i-4xlarge-ng - Only CPU 	==> c6i: 일반 ■
==> DEPLOY: 클릭

 3) Service Manager(화면) > Service Manager Grid에서 Latest Version 칼럼에서 0.0.60  ==> 데이타 확인 ■  
  가. 성공: Progressing --> Heathy로 변경됨 ■
============================================================================================================== 

B. commai-ixi-worker @@@
3. SERVICE Deploy
 1) Service Manager(화면) > Service Manager Grid에서 Action 칼럼 ╊ 버튼(Deploy): 클릭
 2) Service Deploy(새창)
  가. Select Service Version: 0.0.63  --> 생성한 이미지 버전 ■
  나. Select Rentime Language: Python
  다. Command:./bin/bash
  라. Arguments: -c /app/startup_worker.sh 	■■■■
  마. Env: 기본 값
  바. Select Secret: commai-encrypt-key
  사. Contact Port: 8080  ==> APIKEY: Disable(체크  박스 해제) , Strict Affinity: Enable(체크 박스 설정) ■
  아. StartupProbe - Failure Threshold, AutoScale, AutoScale - Min Relicas, AutoScale - Max Relicas
	300, 10, 30, 30	--> 300, 20, 2, 2: 개발 서버	  
  자. Requests - CPU, Requests - Memory, Limits - CPU, Limits - Memory
	1, 4Gi, 1, 4Gi 	  	--> 1, 4Gi, 1, 4Gi: 개발 서버
 차. Gpu
	0
  카. 노드 그룹
   	가) Select Node Groups: eks-violet-service-communication-p4d-24xlarge-ng - Exist GPU	==> p4d: GPU 존재(LLM 일때 사용) ■
	나) Select Node Groups: eks-violet-service-communication-c6i-4xlarge-ng - Only CPU 	==> c6i: 일반 ■
==> DEPLOY: 클릭

  3) Service Manager(화면) > Service Manager Grid에서 Latest Version 칼럼에서 0.0.55  ==> 데이타 확인 ■  
  가. 성공: Progressing --> Heathy로 변경됨 ■
============================================================================================================== 

C. commai-ixi-beat @@@
3. SERVICE Deploy
 1) Service Manager(화면) > Service Manager Grid에서 atest Version 칼럼에서 0.0.20(0.0.21)  ==> 데이타 확인 ■
 ==> Action 칼럼 ╊ 버튼(Deploy): 클릭 
 2) Service Deploy(새창)
  가. Select Service Version: 0.0.24  --> 생성한 이미지 버전 ■
  나. Select Rentime Language: Python
  다. Command:./bin/bash
  라. Arguments: -c /app/startup_beat.sh ■■■■
  마. Env: 기본 값
  바. Select Secret: commai-encrypt-key
  사. Contact Port: 8080  ==> APIKEY: Disable(체크  박스 해제) , Strict Affinity: Enable(체크 박스 설정) ■
  아. StartupProbe - Failure Threshold, AutoScale, AutoScale - Min Relicas, AutoScale - Max Relicas
	20, 20, 2, 2	--> 300, 20, 1, 1: 개발 서버 
  자. Requests - CPU, Requests - Memory, Limits - CPU, Limits - Memory
	1, 1Gi, 1, 1Gi	--> 500m, 500Mi, 500m, 500Mi: 개발 서버 
 차. Gpu
	0
  카. 노드 그룹   
	가) Select Node Groups: eks-violet-service-communication-p4d-24xlarge-ng - Exist GPU	==> p4d: GPU 존재(LLM 일때 사용) ■
	나) Select Node Groups: eks-violet-service-communication-c6i-4xlarge-ng - Only CPU 	==> c6i: 일반 ■
==> DEPLOY: 클릭

 3) Service Manager(화면) > Service Manager Grid에서 Latest Version 칼럼에서 0.0.22  ==> 데이타 확인 ■
  가. 성공: Progressing --> Heathy로 변경됨 ■
  나. 실패: Degraded(OutOfSync) ■  ==> Degraded 후 IMAGE 재생성( Instance(화면) Service Version 생성)에서 할 것
==============================================================================================================

- ArgoCD 설정
1. https://deploy.temp-sp.violet.uplus.co.kr, ixioadmin/ixioadm!n1  ==> 보안 클라우드에서 접속
 1) 개발기에서 배포 실패 하신후 원인 분석 및 트러블슈팅을 하실떄 ArgoCD의 대시보드를 이용해주세요. ArgoCD에서 직접 쿠버네티스 
Resource에 대한 제어가 가능하니, 운용하실떄 주의 부탁드립니다.
==============================================================================================================

- Auto Scaling 개념 원리 & 사용 세팅
https://inpa.tistory.com/entry/AWS-📚-EC2-오토-스케일링-ELB-로드-밸런서-개념-구축-세팅-💯-정리
==============================================================================================================
 
- 수종 노트북(MSI GE60_2OE) 환경 설정(20시, 집) ==> 완료[♥♡]
1. SW 재 설치
==============================================================================================================
 
- 수종 MSI 노트북 메모리 주문 ==> 품절로 주문 취소됨[♥♡]
- 노트북 메모리 RAM 하이닉스 칩 SEC 칩, 16GB, 1개, 가격: 14,300원
https://www.coupang.com/vp/products/8176058826?itemId=23364757362&vendorItemId=90498509361&
1. PC3L PC3 DDR3 1066Mhz 1333hz 1, 04 16GB, 1개 ==> 11/7(목) 도착 예정
==============================================================================================================

- 신한은행에서 미래에셋 CMA 통장에 천만원 송금(21:20, 집)
1. 010-3072-0898-8, 종합, 51. CMA_어음: 10,000,000원
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.23(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석(10시, 내 자리, 윤현노 선임이 설명 해줌)
1. post tex 데이타 즉시 파기 소스 분석
 1) tb_job_status TB에서 결과 코드(result_code), 수정 일시(updated_at) 필드 데이타 수정
 2) tb_result_data TB에서 해당 데이타 삭제 처리 ==> 다시 조회 안되게 처리
2. background_tasks.py 추가(get_text_result.py 파일에서 background_tasks.add_task(delete_job_result, job_id) ) 
==============================================================================================================

$ git status	# git 상태 확인
▶ On branch dev
▶ Your branch is up to date with 'origin/dev'.

▶ Changes not staged for commit:  # staged에 안 올라간 상태
  (use "git add <file>..." to uddate what will be commited)"
	modified:   app/api/vi/llm_model.py
 
$ git clean -fd  	# untracked 파일, 폴더 모두 삭제 ■
▶ Removing app/api/vi/llm_model.py

$ git clean -fd --dry-run	# untracked 파일, 폴더 모두 삭제 전 미리 보기 ■
-----------------------------------------------------------------------------------------------

$ git status    # git 상태 확인
▶ On branch dev
▶ Changes to be committed:  	# 변경 이후 staged에 올라간 상태
  (use "git restore --staged <file>..." to unstage)
        modified:   app/api/vi/llm_model.py
		
$ git reset HEAD -- app/api/vi/llm_model.py	 	# Staged된 파일 삭제 ■  
-- $ git checkout  -- 01_ast_vrfc/bmi_calculate.py	 # Staged된 파일 삭제 ■( Modified상태 파일을 최근 커밋한 상태(또는 clone했을 때 상태)로 되돌리기
 
▶ Unstaged changes after reset:
M       app/api/vi/llm_model.py
==============================================================================================================
 
- 유튜브로 배우는 코딩 Git 강좌 시청
https://www.youtube.com/watch?v=JZJQ4_8XoPM&list=PLHF1wYTaCuixewA1hAn8u6hzx5mNenAGM
 - 03.저장소 만들기와 커밋(Commit) 하기
$ git init
$ git add filename
$ git commit
$ git status
$ gitk    # 시각적으로 보기
$ git log --all --oneline 	 # log 시각적으로 보기
---------------------------------------------------------------------------------------

$ git branch  -v 	 	# 등록된 브랜치의 상세한 정보 확인
$ git branch --merged 		# 브랜치 상태 확인(-merged,  --no-merged ) 
$ git checkout main # master에 체크 아웃  
$ git merge test		#  test브랜치의 코드를 main에 합침
---------------------------------------------------------------------------------------

$ git clone			# 원격 저장소에서 내용 복제
$ git fetch -a		# 원격 저장소에서 변경 내용 모두 가져오기
$ git pull		 		# 원격 저장소에서 내용 가져오기
$ git push			# 원격 저장소에서 내용 보내기
---------------------------------------------------------------------------------------

- [Git] Branch와 Merge
https://velog.io/@marksen/Git-Branch%EC%99%80-Merge
==============================================================================================================

- 나눔 동기계 계비 자동이체 신청
1. SC 은행: 550 20 405451(계모임 통장), 예금주: 장광석
2. 24년 10부터 사용(월 15,000원)
============================================================================================================== 

- 테무에서 주문한 내역
0. 주문 상품수: 4 상품:, 가격: 17,306원, 주문 시간: 2024년 10월 23일, 주문 ID: PO-185-20479344513831468
 1) 도착 예정: 10월 28일-11월 1일, 5일 이내
1. 삼성 갤럭시 A35 강화 유리 3개 세트 풀 스크린 워터 젤 필름, 가격: 2,224원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099637761539&
2. 삼성 갤럭시 A35 액정 필름 4개 세트, 풀 스크린 워터 젤 필름, 가격: 2,247원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099608644615&
3. 삼성 갤럭시 S22 액정 필름, 울트라 HD 보호 필름, 가격: 2,240원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099534641052&
4. 노트북용 ENTADM 고성능 DDR3 RAM - 8GB, PC3-12800, 1.5V SO-DIMM 메모리 모듈, 가격: 10,595원
https://www.temu.com/goods.html?_bg_fs=1&goods_id=601099643613018&
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■■■■■ 2024.10.24(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석
1. post tex 데이타 즉시 파기 소스 분석
 1) tb_job_status TB에서 결과 코드(result_code), 수정 일시(updated_at) 필드 데이타 수정
 2) tb_result_data TB에서 해당 데이타 삭제 처리 ==> 다시 조회 안되게 처리
2. background_tasks.py 추가(get_text_result.py 파일에서 background_tasks.add_task(delete_job_result, job_id) ) 
==============================================================================================================

- VS Code에서 북마크(책갈피) 생성하는 법
https://inpa.tistory.com/m/entry/VS-Code-%F0%9F%92%BD-bookMarks-%EC%9D%B5%EC%8A%A4%ED%85%90%EC%85%98

1. 희망 지점: 마우스 우 클릭 ==> Add Labeled Bookmark: 클릭 ==> 01. cal_bmi(): BMI 계산 함수: 입럭 후 Enter
2. 왼쪽 메뉴바에서 Bookmark 라벨 클릭 ==> Bookmark 리스트
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■■■■■ 2024.10.25(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 08:00 [IXI 솔루션 - Call Agent SM] 10월 4주차_주간보고 작성, 19:40 수도 검침 --> 사용량 11㎥

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석 
4. /background_tasks.py 파일에서(/v1/) 수정
async def delete_job_result(job_id: str):
	sMsg2 = "[T_01 ■■■ [#### background_tasks 처리 Start ####] ■■■"
	sMsg = "[delete_job_result()] ==> "
	sMsg = "\n\n\n ■■■ [/delete_job_result.py] " + sMsg
	print(sMsg + sMsg2)
  
	delete_sql_stmt = delete(ResultData).where(ResultData.job_id == job_id)  	# table에 있는 정보 삭제 처리
	delete_result = await session.execute(delete_sql_stmt)	# 삭제 결과
	await session.commit()
	
	sMsg2 = "[T_51] ■■■ tb_result_data TB 데이타 삭제 처리 ■■■\n"
	sMsg2 += "DELETE FROM result_data  "
	sMsg2 += "WHERE tb_result_data.job_id =s \n"
	sMsg2 += "[■ 00. job_id(P)]" + job_id + " \n"
	print(sMsg + sMsg2)
==============================================================================================================
 
- 회의(14:00, 6층 오픈룸 E9-02)
1. 운영 서버 배포 및 시연(한광희 선임)
 1) post tex 데이타 즉시 파기 적용
==> LG U+ 테스트 폰(아이폰: 010-8333-9790)으로 AI 비서 테스트
=============================================================================================================
 
 - LLM 모델  GCP 이관
1. 11월부터 작업
2. AWS 같이 사용
 ==============================================================================================================
 
- train_data(학습데이터) API 가 모두 200으로 응답 받는지 확인]
1. c61e7a1c-7c5f-46c3-ad4e-1550e1ce6eed
2024-10-25T14:56:27.371538+0900 | INFO | 0:39:51.199002 | PID: 171 | ThreadID: 140049978379136 | train_data_handler.py:
request_training_data:134 | [job_id: c61e7a1c-7c5f-46c3-ad4e-1550e1ce6eed][call_id: AISOL_STG_TC_1_000] Training data response status_code: 200

2. ef551664-2136-48b6-beaf-ec8d4fd0903f
2024-10-25T14:56:52.549409+0900 | INFO | 0:36:03.358854 | PID: 170 | ThreadID: 140105109986176 | train_data_handler.py:
request_training_data:134 | [job_id: ef551664-2136-48b6-beaf-ec8d4fd0903f][call_id: AISOL_STG_TC_2_000] Training data response status_code: 200

3. d88a5694-5062-45b3-82fe-caa67fa6ec31
2024-10-25T14:57:05.670401+0900 | INFO | 0:40:36.072135 | PID: 170 | ThreadID: 139904038210432 | train_data_handler.py:
request_training_data:134 | [job_id: d88a5694-5062-45b3-82fe-caa67fa6ec31][call_id: AISOL_STG_TC_3_000] Training data response status_code: 200

4. 832d656d-8bee-4d49-8c79-6db622a86670
2024-10-25T14:57:32.151703+0900 | INFO | 0:40:55.973500 | PID: 171 | ThreadID: 139962149104512 | train_data_handler.py:
request_training_data:134 | [job_id: 832d656d-8bee-4d49-8c79-6db622a86670][call_id: AISOL_STG_TC_4_00000] Training data response status_code: 200

5. ca47de63-bdf0-4c90-bea1-a9741bf6cd66
2024-10-25T14:57:42.523886+0900 | INFO | 0:40:07.713427 | PID: 170 | ThreadID: 139870364916608 | train_data_handler.py:
request_training_data:134 | [job_id: ca47de63-bdf0-4c90-bea1-a9741bf6cd66][call_id: AISOL_STG_TC_5_0000] Training data response status_code: 200
 ==============================================================================================================
 
- 24년 안전 한국 훈련(LG 사이언스 파크 민.관.군 합동)
1. 일시: 24.10.25(금) 10 ~ 12시
2. 대상 마곡 사옥 전 임직원(협력사 포함)
3. 내용:
 1) 비상 대피 방송이 송출되면 비상 계단을 이용해 비상 집결지(서울 식물원)로 대피
 2) 문자 수신 받은 주소에 접속하여 자신의 '대피 상태' 남기기
==> 09:05 훈련 시작((AI 솔루션 개발 팀(5명)과 비상 계단으로 1층으로 내려감 --> 서울 식물원에 도착)
==> 09:20 핸드폰으로 자신의 '대피 상태' 남기기
==> 09:38 훈련 종료(문자 받음)
==> 10:45 GS 25 강서 LG 사이언스점 방문 ==> 바리스타 룰스 커피(AI 솔루션 개발 팀 팀장이 쏨)
==> 10:50 사무실 복귀(5층)
==============================================================================================================

- VS Code에서 계정 동기화
1. 왼쪽 메뉴 바 ==> 계정 Tab > 로그인하여 계정 동기화 
- VS Code 동기화 사용
https://velog.io/@leesjpr/VS-Code-%EB%8F%99%EA%B8%B0%ED%99%94-%EC%82%AC%EC%9A%A9

- VS Code 동기화
https://www.youtube.com/results?search_query=VS+Code+%EB%8F%99%EA%B8%B0%ED%99%94
==============================================================================================================
 
- VS Code에서 북마크(책갈피) 생성하는 법
https://inpa.tistory.com/m/entry/VS-Code-%F0%9F%92%BD-bookMarks-%EC%9D%B5%EC%8A%A4%ED%85%90%EC%85%98

1. 희망 지점: 마우스 우 클릭 ==> Add Labeled Bookmark: 클릭 ==> 01. cal_bmi(): BMI 계산 함수: 입럭 후 Enter
2. 왼쪽 메뉴바에서 Bookmark 라벨 클릭 ==> Bookmark 리스트
----------------------------------------------------------------------------------------------------------------------------

- Add BookMark(북마크) 설정 @@@
/ast_vrfc.py
91. URL 경로(01_ast_vrfc/)
00. 자산 검증 파일 TEST Start
01. 자산 Tab
02. 총자산 Tab 
--------------------------------------------------------------

/bmi_calculate.py
01. BMI 계산 Start
02. BMI 계산 함수
==============================================================================================================
 
- 서울 남부초(진수종: 5학년 4반)
https://seoulnambu.sen.es.kr, soojong/soojong0508@
1. 이메일: soojong@seoul.go.kr
------------------------------------------------------------------------------------------------------------
 
- 학생용 원드라이브 생성
https://www.youtube.com/results?search_query=%ED%95%99%EC%83%9D%EC%9A%A9+%EC%9B%90%EB%93%9C%EB%9D%BC%EC%9D%B4%EB%B8%8C+%EC%83%9D%EC%84%B1
==============================================================================================================

- PM 8주 완성반: 데이터로 설계하는 성공적인 서비스 기획(with. AI) [Fast campus]
https://fastcampus.co.kr/b2g_kdc_startpm?utm_source=sms&utm_medium=sales&utm_campaign=b2g_241024_216739&utm_content=conv_urgency
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.26(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 
	
- 주말[★] 
06:04 기상
06:13 조식(돈가스 2개, 치킨): 수종
06:33 집 출발(도보{자전거), 도림천 <=> 대림역)
08:10 귀가
08:40 인터넷 서핑
10:00 가계부 월말 결산 SW 수정
11:22 집 출발(자전거) 
11:30 중식(정식: 4천원[제주 보쌈(해태 보라매 타워])
11:45 도보: 도림천 <-> 대림역
12:51 귀가
13:10 수종 엄마집에 놀러감
13:50 인터넷 서핑
14:00 가계부 월말 결산 SW 수정
17:30 석식
17:45 실내 도보
18:50 종료
20:00 인터넷 서핑 
20:10 가계부 월말 결산 SW 수정
23:00 취침
============================================================================================================== 
   
- 윈도우 11 버전 24H2…OS 설치 시간·재부팅 시간 대폭 감소 | 케이벤치 주요뉴스
1. https://kbench.com/?q=node/261327
============================================================================================================== 

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.27(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 

- 주말2[★]
06:05 기상(흐림: 저녁에 빗방울 약간 내림)
06:10 조식(돈가스 2개, 소고기)
06:30 집 출발(도보: 도림천 <=> 관악산역 <=> 서울대 입구(반환점))
08:10 귀가
08:40 빨래
08:60 인터넷 서핑
11:22 집 출발(자전거) 
11:35 중식(정식: 4천원[제주 보쌈(해태 보라매 타워])
11:45 도보: 도림천 <-> 대림역
12:50 보리매 공원 수도 -> 물 떠 오기
13:10 귀가
13:40 인터넷 서핑
15:30 수종 귀가
17:25 석식(짜파게티 2봉, 밥): 수종
17:45 실내 도보
18:50 종료 
20:00 청소(바닥 쓸기, 바닥 닦기) 
21:00 샤워(체중: 69.8kg -> BMI: 24.15(과체중) ==> 심각: 식방 자재할 것
21:00 인터넷 서핑
22:30 취침
==============================================================================================================
  
- 00. Git 분석 ●●●
https://github.com/JINTAEMAN/PythonWorkspace,.   ----> INTAEMAN/asas1212!!tama

1. ghtHub에서 소스 다운로드 ●
$ cd /d
$ git clone https://github.com/JINTAEMAN/PythonWorkspace
============================================================================================================-

1. ghtHub에서 소스 받아 오기 ●
$ git fetch -a		# dev 브랜치로 전환 
$ git pull origin main	# main 브런치에서 소스 받아 오기 ■
============================================================================================================-

1. ghtHub에 올리기 받아 오기 ●
$ git add .
$ git commit -m "Add to main: 77_실행_파일_만들기, 97. 파이썬 자료_■ 폴더 올리기[24.10.26(T_01)], by tamario]";
$ git commit -m "Add to main: 파이썬 자료_■ 폴더 올리기[24.10.26(T_01)], by tamario]"; 	
$ git commit -m "Add to main:  파이썬 자료_■ 폴더 올리기[24.10.26(T_01)], by tamario]"; 	
$ git commit -m "Add to main: 01. /ast_vrfc.py 수정(채권 Tab에서 CMA 금액 없을 경우)[24.10.76(T_01)], by tamario]"; 	

$ git push origin		# main 브런치에 소스 올리기 ■
$ git log --all --oneline  		# log 시각적으로 보기
----------------------------------------------------------------------------------------------

1. ghtHub에 올리기 받아 오기_Real(VS Code > bash 터미널에서) ●
tamar@TAMA-MSI-A10SD-I7-21Y MINGW64 /d/PythonWorkspace (main)
$ git add .;
git commit -m "▶ [24.10.28 09:33] 00. Git 분석 파일 수정(by tamario)";
git push origin;		# 원격 서버에 소스 올리기 ■
git status;		# git 상태 확인

[main 1fb417a] ▶ [24.10.28 09:33] 00. Git 분석 파일 수정(by tamario)
1 file changed, 12 insertions(+), 11 deletions(-)

Your branch is up to date with 'origin/main'.

nothing to commit, working tree clean
==> 하단 상태 바에서 Git Graph: 클릭 -->  ▶ [24.10.28 08:31] 00. Git 분석 파일 수정(by tamario): 클릭 --> 변경 내용 확인 
============================================================================================================-  

- 가계부 월말 결산 SW 수정(10시, 집)
1. /ast_vrfc.py 수정
rowNo = add_row + 7
cmaRowNo = add_row + 7
# 채권 보유현황 @@@
cma_prchs_amt79 = ws_03_bond[f'E{rowNo}'].value   # 04. 매입금액(79. 발행어음 CMA_개인)  ==> 22. 채권 Tab에서 @@@
if ws_03_bond[f'E{rowNo}'].value != None :    # 04. 매입금액(79. 발행어음 CMA_개인)이 널이 아니면
    cma_prchs_amt79 = ws_03_bond[f'E{rowNo}'].value   # 04. 매입금액(79. 발행어음 CMA_개인)
else:
    cma_prchs_amt79 = 0   # 04. 매입금액(79. 발행어음 CMA_개인)
print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_32] [04. 매입금액(79. 발행어음 CMA_개인)]"+ str(ws_03_bond[f'E{rowNo}'].value) 
	+"[04. 매입금액(79. 발행어음 CMA_개인)_22]"+ str(cma_prchs_amt79) )
 
if ws_03_bond[f'E{cmaRowNo}'].value != None  :  # 05. 평가금액(79. 발행어음 CMA_개인)이 널이 아니면   ==> 01. 자산 Tab에서 @@@
    ws[f'B{rowNo}'].value = format(cma_eval_amt79, ',')    # 79. 발행어음 CMA_개인(01. 금액) value ■
    ws[f'C{rowNo}'].value = format(cma_prchs_amt79, ',')   # 79. 발행어음 CMA_개인(02. 원금) value ■
    ws[f'D{rowNo}'].value = format(eval_profit_loss79, ',')   # 79. 발행어음 CMA_개인(03. 손익) value ■
    ws[f'E{rowNo}'].value = f'{eval_profit_loss_rate79:.2f}'  # 79. 발행어음 CMA_개인(03. 수익률(%)) value ■
else:
    ws[f'B{rowNo}'].value = ""   # 79. 발행어음 CMA_개인(01. 금액) value ■
    ws[f'C{rowNo}'].value = ""   # 79. 발행어음 CMA_개인(02. 원금) value ■
    ws[f'D{rowNo}'].value = ""   # 79. 발행어음 CMA_개인(03. 손익) value ■
    ws[f'E{rowNo}'].value = ""   # 79. 발행어음 CMA_개인(03. 수익률(%)) value ■
print("[@_T] ■■■ [/ast_vrfc.py] ==> [T_71_14] [05. 평가금액(79. 발행어음 CMA_개인)]"+ str(ws[f'B{rowNo}'].value))  
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.28(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 18:30 삼성 5:7 기아(한국 시리즈 5차전[4승 1패로 기아 우승[KIA V12], MVP 김선빈(포수 김태군에게 1표차 수상)
	, 나성범 주장, 이범호 감독), 19:30 귀가(수종이 엄마가 단감 1kg 택배로 보내줌)

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석
1. /post_text.sh 파일 수정 @@@
port_no="8000"		# 00. 포트 번호(8080: 정상, 8000: 디버깅 모드) ■
project_key="dddd"		#  02. 프로젝트 키 ■
echo "	■■■ [/post_text.sh] [T_01] ■■■ [#### step 1. post text 실행 ####] ■■■ [00. 포트 번호■]${port_no}
[02. 프로젝트 키■]${project_key}"
 
curl --location -vvv 'http://localhost:'"${port_no}"''/api/v1/text'	 \
--header 'Transaction-Id: TR_20240122_13...-04f3c'		\
--header 'X-Ixi-Project-Id: PJ000000' 	\
--header 'X-Ixi-Project-Key: '"${project_key}"''' 	\
--header 'Content-Type: application/json'	 \
--data '{
		"modelId": "ixi-gen/8.8b0v1.0:commai-2406",
		"modelParams":  {
			"text":  {
				"input":  {	
					"callTimeStt": "2024-06-13 15:22:32:32.22932",
					"callTimeEnd": "2024-06-13 15:28:28:32.22932",
					"Content": [
								{
									"turn": "1",
									"speaker": "TX",
									"sttText": "아빠, 안녕하세요. 오늘 하루는 어땠어요?",
									"startTime": "00:00:05",
									"endTime": "00:00:07"
								},
								{
									"turn": "2",
									"speaker": "RX",
									"sttText": "안녕, 철수야! 오늘은 회사에서 바빴지만 보람찬 하루였엉. 너는 어땠어?",
									"startTime": "00:00:08",
									"endTime": "00:00:12"
								},
							]
		}
	}'

$ /app/client/text/get_text_result.sh		# step 1. post text 실행(JOB ID 생성) ■
▶ {responseCode: 20200000, responseMsg: "Queue Accepted", jobId: "380b8297-ebc7-4c58.7217d", . ....}
----------------------------------------------------------------------------------------------------------

2. /get_job_status.sh 파일 수정 @@@ 
job_id="380b8297-ebc7-4c58.7217d"		# 01. job_id ■
project_key="dddd"		#  02. 프로젝트 키 ■
port_no="8000"		# 00. 포트 번호(8080: 정상, 8000: 디버깅 모드) ■ 

curl -X GET "http://localhost:${port_no}/api/v1/text/job-status"	 \
--H "Content-Type: application/json"	 \
--H "Tranaasction-Id: PJTR_20240122_13...-04f3c000000" \
--H "X-Ixi-Project-Id: PJ000000" 	\
--H "X-Ixi-Project-Key: ${project_key}" 	\
--d ' {"jobId": "'"${job_id}"'", "common": null}' -vvv	 \		# 데이타 셋팅 ■■■
echo "	■■■ [/get_job_status.sh] [T_99] ■■■ [#### step 2. post tex 상태 확인 결과 ####] ■■■ [00. 포트 번호■]
${port_no}[01. job_id■]${job_id}[02. 프로젝트 키■]${project_key}"

$ /app/client/text/get_job_status.sh		# step 2. post tex 상태 확인 ■
▶ {responseCode: 20100000, responseMsg: "Completed", ....}   --> 정상 
----------------------------------------------------------------------------------------------------------

3. /get_text_result.sh 파일 수정 @@@ 
job_id="380b8297-ebc7-4c58.7217d"		# 01. job_id ■ 
project_key="dddd"		#  02. 프로젝트 키 ■
port_no="8000"		# 00. 포트 번호(8080: 정상, 8000: 디버깅 모드) ■

curl -X GET "http://localhost:${port_no}/api/v1/text/result"	 \
--H "Content-Type: application/json"	 \
--H "Tranaasction-Id: PJTR_20240122_13...-04f3c000000" \
--H "X-Ixi-Project-Id: PJ000000" 	\
--H "X-Ixi-Project-Key: ${project_key}" 	\
--d ' {"jobId": "'"${job_id}"'", "common": null}' -vvv	 \		# 데이타 셋팅 ■■■
echo "	■■■ [/get_text_result.sh] [T_99] ■■■ [#### step 3. post tex 결과 ####] ■■■ [00. 포트 번호■]
${port_no}[01. job_id■]${job_id}[02. 프로젝트 키■]${project_key}"

$ /app/client/text/get_text_result.sh		# step 3. post tex 결과 확인 ■
▶  {responseCode: 500000000, responseMsg: "argument should de bytes,", ....}	--> 정상
----------------------------------------------------------------------------------------------------------

4. /tts.sh 파일 수정 @@@ 
$ /app/client/tts/tts.sh		# step 4. post tts 실행 ■
port_no="8000"		# 00. 포트 번호(8080: 정상, 8000: 디버깅 모드) ■
project_key="dddd"		#  02. 프로젝트 키 ■
echo "	■■■ [/sh.sh] [T_01] ■■■ [#### step 4. post tts 실행 ####] ■■■ [00. 포트 번호■]${port_no}
[02. 프로젝트 키■]${project_key}"
 
curl --location -vvv 'http://localhost:'"${port_no}"''/api/v1/audio/tts'	 \
--header 'Transaction-Id: TR_20240122_13...-04f3c' 	\
--header 'X-Ixi-Project-Id: PJ000000' 	\
--header 'X-Ixi-Project-Key: '"${project_key}"''' 	\
--header 'Content-Type: application/json'		 \
--data '{
		"modelId": "ixi-audio/tts:commai-2406",
		"modelParams":  {
			"text": : "안녕하세요. 제가 다시 연락드리겠습니다",
			"speaker": "M_W00J00"  
		}
	}'
	
$ /app/client/tts/tts.sh		# step 4. post tts 실행 ■
▶ {responseCode: 20000000, responseMsg: "Success", modelId: "ixi-audio/tts:commai-2406:", 
, "resutl":{"buffer" :"AAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"....}} 	--> 정상
=============================================================================================================

- bash 스크립트에서 curl 호출시 변수를 어떻게 사용할 수 있을까요?
출처: https://sdr1982.tistory.com/331 [라이언(Ryan)의 블로그:티스토리]
curl -X POST -H 'Content-type: application/json' --data "{\"text\": \"${message}\"}"

curl -X POST -H 'Content-type: application/json' --data '{"text": "'"${message}"'" }'
==============================================================================================================

- API가 호출하는 코드를 curl 방식으로 공유
https://outofgreed.tistory.com/275

curl -XPOST http://a.b.com/api\					# -X : --request. 요청 메소드 지정
	 -H 'Content-Type: application/json'\		# -H : --header. HTTP Header에 추가
	 -d '[															# -d : --data. HTTP POST data 지정 
		{
		  "name1": value1,
		  "name2": value2,
		  "name3": value3
		},
		...
	  ]'
----------------------------------------------------------------------------------------------------------

# 예시
curl -X POST "https://gitlab.example.com/api/v4/projects" -H "Accept-Encoding: gzip" -H "Content-Type: application/json" 
-d '{"message": "hello"}'
 ==============================================================================================================
 
- 나의 첫 쉘 스크립트 작성하기
https://techbukket.com/blog/shell-script-guide
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.29(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석
==============================================================================================================

- git merge 와 conflict 해결 @@@
- [코드잇] Git에서 conflict(충돌) 해결하기
https://blog.naver.com/codeitofficial/221938658754
==============================================================================================================

- [Python] Celery를 활용한 스케줄링 시스템
https://2hyes.tistory.com/193
1. 파이썬 프레임워크로, 비동기 테스크 큐 + 스케줄링 툴
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.30(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석
- [Python] ORM을 이용한 파이썬 실습(게시판 구현)
https://gongdeanam-it.tistory.com/entry/PythonORM%EC%9D%84-%EC%9D%B4%EC%9A%A9%ED%95%9C-%ED%8C%8C%EC%9D%B4%EC%8D%AC-%EC%8B%A4%EC%8A%B5%EA%B2%8C%EC%8B%9C%ED%8C%90-%EA%B5%AC%ED%98%84

from sqlalchemy import Column, Integer, String
from sqlalchemy.ext.declarative import declarative_base

Base = declarative_base()

# 테이블 정의
class User(Base):
    __tablename__ = 'users'  	# 테이블 명
    id = Column(Integer, primary_key=True)
    name = Column(String(50))
    age = Column(Integer)
-------------------------------------------------------------------------------------------

from sqlalchemy.orm import sessionmaker

Session = sessionmaker(bind=engine)
session = Session()

# 데이터 조회
users = session.query(User).all()
for user in users:
    print(user.id, user.name, user.age)

# 데이터 삽입
user = User(name='Alice', age=25)
session.add(user)
session.commit()

# 데이터 수정
user = session.query(User).filter_by(name='Alice').first()
user.age = 26
session.commit()

# 데이터 삭제
session.delete(user)
session.commit()
==============================================================================================================
 
- [VS Code] 필요없는 공백 한번에 제거하기
https://zoosso.tistory.com/1160
1. 확장 프로그램: Trailing Spaces
 1) 프로그램 설치하면 후행 공백이 붉은 하이라이트(Highlight)  처리됨
 2) 파렛트(Ctrl + Shift + P) > trailing > Trailing Spaces: Delete」 검색 -> 클릭 ==> (해당 파일의) 후행 공백 삭제
 3) 단축키 설정
1. [파일] - [기본 설정] - [바로 가기 키] ==> [바로 가기 키(화면) --> 키 바인딩: 더블 클릭
2. 원하는 키 조합을 누르고 <Enter>키를 누르세요.
 1) Ctrl + Alt + Z  --> 입력 후 <Enter>키 누름
==============================================================================================================
 
- 파이썬에서 탭과 스페이스 에러
1. 현상:
 1) inconsistnent use of tabs and spaces in indentation(들여쓰기에서 탭과 스페이스를 혼용)
 2) blank line contains whitespace(빈 라인에 공백 함유)
2. 조치:
 1) 노트패드++에서 탭, 스페이스, 특수 문자 표시
1. 보기(View) > 기호 보기(Show Symbol) >
공백과 탭 표시(Show Whitespace and Tab): 체크, 특수 문자 표시: 체크
- /llm_model.py 파일에서 @@@
sMsg = "■■■ 40. tb_job_status TB 조회 ■■■	\n"
sMsg += "SELECT * FROM tb_job_status \n"
sMsg += "WHERE job_id = s"
sMsg += "[■ 02. 현재 일시(P)]" + str(curren_datatime_kst) + "  \n"
sMsg += "[■ 00. job_id(P)]" + job_id + "  \n" ---> 빈공간 발견 ■■ --> 수정■■■■
print("n\n ■■■ [/llm_model.py] [get_text_result()] ==> [T_40]" + sMsg) 
--------------------------------------------------------------------------------------

- 비주얼 스튜디오 코드에서 빈 줄 없애기(참고)
1. 찾아 바꾸기 : Ctrl+H
 1) 정규식 사용 클릭
 2) ^$\n  ==> 입력창에 입력
 3) 모두 바꾸기 클릭
==============================================================================================================

- GitLens
https://www.youtube.com/results?search_query=GitLens
==============================================================================================================
 
- conflict 해결
https://www.youtube.com/results?search_query=conflict+%ED%95%B4%EA%B2%B0

- 갑자기 헷갈린 git 명령어 pull, merge
https://j-louis.tistory.com/10
=============================================================================================================

- [Git] fetch와 Pull의 차이점은?
https://velog.io/@msung99/push-%EB%B8%8C%EB%9E%9C%EC%B9%98-%EA%B9%83%ED%94%8C%EB%A1%9C%EC%9A%B0-pull

$ git checkout dev	# main Branch로 전환
$ git fetch -a		 	# 원격 저장소에서 내용 모두 가져오기(merge 안함) 
$ git merge FETCH_HEAD   # main 브랜치에 Branch 브랜치를 머지
$ git rebase FETCH_HEAD   # main 브랜치에 base를 새롭게 설정한다는 의미
$ git log	 #  Git 커밋 이력 조회 ■
$ git diff	 #  commit 이나 branch 사이에 다른점 혹은 파일이나 Repository와 Working Directory 사이의 다른점을 보여주는 명령어 ■
------------------------------------------------------------------------------------------------------------------------------

- Rebase와 Merge의 차이점
https://velog.io/@kwonh/Git-Rebase%E
------------------------------------------------------------------------------------------------------------------------------

$ git pull origin dev		# dev Branch에서 내용 가져오기(merge)■
=============================================================================================================

- Windows 키 + X: 빠른 링크(Quick Link) 이후 실행 안됨
1.  Windows 키 + X: 빠른 링크(Quick Link)
> 작업관리자(T): 클릭 --> 하단 Tray에서 보임: 클릭해서 활성화 안됨
> 시스템(Y): 클릭
https://mspoweruser.com/ko/taskbar-not-working/
https://4ddig.tenorshare.com/kr/windows-problems/task-bar-not-working.html

- 윈도우11 작업표시줄이 먹통이됩니다.
https://answers.microsoft.com/ko-kr/windows/forum/all/%EC%9C%88%EB%8F%84%EC%9A%B011/7faf490b-e352-4d5d-a8cf-e443eb144e5c

https://m.blog.naver.com/toruin84/222687877171
=============================================================================================================

- 실손 24(보험 개발원)
https://www.silson24.or.kr, tamario2/tama339! --> 카카오톡 간편 인증 등록
==============================================================================================================

- 국민 건강 보험료[24.10.30(수)]
1. 건강 보험료 청구서 수신
 1) 납부자 번호: 21017603269 11
 2) 납부할 금액: 56,110원
  가. 건강 보험료: 49,680원
  나. 장기 요양 보험료: 6,430원
 3) 출금일: 24.11.10
 4) 출금 카드: 롯데 카드
 ==> 건강보험료 조정 신청[24.07.08(월)] 후 금액:192,376원 
=============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■ 2024.10.31(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 가계부 월말 결산(20:30, 집), 22:30 수종 용돈(수학 90점 받아 와서 상금으로 줌[2번째])

- LG U+ ixi-O SM Prj[★]
- ixi API 소스 분석
1. /badword_filter.py 파일에서(app > libs> ixigen_post_uitls > badwordfilter >) 수정
def badword_fitlter_executor(badwords: list, tts_script: str) -> Tuple[str, str]:
	sMsg2 = "[T_01] ■■■ [#### badword 필터링 처리 Start ####] ■■■"
	sMsg2 += "[■ 01. tts_script]" + tts_script + " \n"
	sMsg2 += "[■ 51. badwords 타입]" +  str(type(badwords)) + " \n"	# badwords 타입 ==> list ■■■
	sMsg2 += "[■ 52. badword 총 갯수]" + str(len(badwords)) + " \n" # badwords 타입 ==> 756개 ■■■
	sMsg2 += "[■ 53. badwords " + str(badwords) + " \n"				 	# badwords list ■■■
	sMsg = "[badword_fitlter_executor()] ==> "
	sMsg = "\n\n ■■■ [/badword_filter.py] " + sMsg
	print(sMsg + sMsg2)
=============================================================================================================
 
- 16. tuple(튜플)
https://wikidocs.net/16042
1. tuple(튜플)은 불변한 순서가 있는 객체의 집합
=============================================================================================================

- [Python] 파이썬 list 함수와 다양한 활용법
https://easyitwanner.tistory.com/263

0. 반복문을 사용하여 요소에 접근하기
my_list = [10, 20, 30, 40] 

# 1. for 문 사용
for item in my_list:
	print(item) 
	print(type(item)) 	# item 타입 확인
	print(len(item)) 	# item 길이 구하기
-----------------------------------------------------------------------------------------------------

# 2. enumerate() 함수와 for 문을 사용하여 인덱스와 요소에 접근하기 
for index, item in enumerate(my_list):     
	print(f"Element at index {index} is {item}")
-----------------------------------------------------------------------------------------------------

# 3. while 문을 사용하여 요소에 접근하기
index = 0
while index < len(my_list):
	print(my_list[index])
	index += 1
=============================================================================================================

- 포스트맨(Postman) 사용법과 API 실행해 보기
https://binit.tistory.com/17

- 포스트맨(Postman) 회원 가입
https://identity.getpostman.com, JINTAEMAN/as**12**!!  ==> 이메일: tamario@naver.com
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 