

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2012.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2012.12.01(토) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 19:00 --> 토요 근무 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. 엑셀 다운로드 ===> 완료 
 1) poi-bin-3.8-20120326\poi-3.8.jar 파일 다운로드 
poi-bin-3.8-20120326\poi-3.8폴더의 .jar 파일 복사하여 C:\EasyValidator\SSMEV2\lib 폴더에 붙여넣기  
==> Java Buid Paht(새창): Add External JARs  
 2) http://breezydawn.tistory.com/154  
2. progress bar 생성 
1) 완료 
==============================================================================================================

- 벳남 신랑 만남(19:30)  
19:00 퇴근  
19:50 치킨뱅이(사당역 8번 출구: 종민씨(응아 남편), 원석씨(홍 남편) 만남) 
20:30 순대국집(내가 쏨: 5만 5천원)    
22:10 종료 
22:20 귀가(종민씨 차) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.02(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
07:00 기상 
08:00 신구초등학교(버스 타고 감)   
08:30 숏게임(1:1 무) 
09:10 게임(3:1 승) 
10:20 숏게임(1:1 무)  
11:00 종료  
11:20 중식(류명국해장국: 부대찌게 ==> 흥국이형이 쏨)  
12:10 종료  
12:40 귀가  
13:00 낮잠 
19:00 기상  
20:00 석식 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.03(월) 작업 ■■■■■■■■■■■■■■■
---> 06:20 ~ 19:00 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. Select 클릭 수정: 완료 
2. Progress 수정 
==============================================================================================================
  
- Web ChatON 기능테스트 작성: 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.04(화) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 --> 새벽 3시 30분에 ChatON상황실에서 문자옴 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. Progress 수정 
2. EV 통합매뉴얼 작성(6. Dashboard 테스트 방법) 
-------------------------------------------------------------------------------------------------------- 

http://cafe.naver.com/profeel/202 
==============================================================================================================
  
- 국결 혼인신고(서초구청) 완료 
1. 1주일 후 가족관계증명서 떼 볼것 
2. 강남역 --> 서초구청(양재역): 걸어서 17분 걸림(12:30 ~ 13:30) 
3. 혼인신고(증인 2명의 사인이 꼭 필요함) 
-------------------------------------------------------------------------------------------------------- 

- 베트남 결혼인터뷰 준비서류 
1. 인간증명서 1통(동사무소 발급) ==> 처리   
2. 인감 도장 날인 한 위임장 1장(동그라미 친 부분): 처리 완료 
3. 혼인 관계 증명서 2통(동사무소 발급) ==> 처리   
4. 가족 관계 증명서 1통(동사무소 발급) ==> 처리   
5. 기본 증명서 1통(동사무소 발급) ==> 처리  
6. 신부님 신분증(원본): 처리 완료 
7. 여권 앞면(본인 사진 나와 있는 면): 처리 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.05(수) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 --> 첫눈 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. EV 통합매뉴얼 작성(6. Dashboard 테스트 방법) 
6.1. Dashboard 테스트 메인 창  
6.2. GLD Server 
6.3. Contact Server 
6.4. Message Server 
6.5. File Server 
6.6. Message Context Server 
6.7. Service Server 
6.8. SMS G/W Server 
6.9. Content Mgt Server 
6.10. SPP 
==============================================================================================================

- eclipe에서 jar 생성 
1. eclipse > /SSMEV2(마우스 우 버튼 클릭) > export > java > Runnable JAR file(Next 버튼 클릭)  
 > Runnable JAR file Export(새창) 
 1) Launch configuration: 01. SSMEmulator - SSMEV2 ===> New_configuration - 
 2) Export destinateion: SSMEV2/SSMEV2.jar(Finish 버튼 클릭) 
- jar 실행 
> java -jar SSMEV2.jar 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2012.12.06(목) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 19:00 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. EV 통합매뉴얼 작성(6. Dashboard 테스트 방법) 
==============================================================================================================

- ChatON_개발환경구축 
1. JDK 설치: Jdk 1.0.6_26(jdk-6u26-windows-i586.exe) 
http://www.oracle.com/technetwork/java/javase/downloads/jdk-6u26-download-400750.html 
 1) 확인 
C:\Users\TAMA> java -version 
java version "1.6.0_37"   ===> java version "1.6.0_26"  
Java(TM) SE Runtime Environment (build 1.6.0_37-b06) 
Java HotSpot(TM) Client VM (build 20.12-b01, mixed mode, sharing) 

2. Path 추가 
컴퓨터 > 속성 > 고급 시스템 설정 > 고급 탭 > 환경 변수 설정 > Path 
C:\Program Files\Intel\WiFi\bin\;C:\Program Files\Common Files\Intel\WirelessCommon\C:\eclipse; 
C:\Program Files\Java\jdk1.6.0_26\bin; 
3. 2.4  Perforce 형상 연결 ==> 현재 사용 안됨 
P4 Connections > 오른쪽 클릭 > New Connection 선택 
Server : svn://70.4.121.240/CHATON ==> tamario0.jin/sds2012  
3. 2.5  SVN Repositories ==> 현재 사용 
SVN Repositories = > 오른쪽 클릭 > New > New Repository Location 
URL : svn://70.4.121.240/CHATON ==> tamario0.jin/sds2012  

3. 2. IDE 설치   
1) NewDocument\02.Design\01.Install\chaton.zip 복사하여 C:\chaton.zip 붙여넣기 
2) Workspace: C:\chaton\workspace 로 설정 
==============================================================================================================

- SVN 설치 
1. eclipse > Help > Eclipse Marketplace > Eclipse Marketplace(새창) 
 1) SVN 을 검색 ==> Subversive - SVN Team Provider(install 클릭) > 완료 
==============================================================================================================
  
- MyEclipse UML plug-in 설치 
1) Eclipse(실행) > Help > Install New Software(클릭) 
2. Add > Name, Location 입력(OK) 
 1) Name : MyElipse-UML 
 2) Location : http://downloads.myeclipseide.com/downloads/products/eworkbench/indigo/enterprise-stable/ 
3. MyEclipse > Enterprise Workbench 선택 > Maven Support for MyEclipse 선택 해제 > Next 
==============================================================================================================

- 신안저축은행 예금, 적금 만기해지 ==> 은행에 안가고 인터넷 뱅킹으로 처리함 
1. 예금 ==> 원금: 23,000,000원, 총입금: 24,015,891원 
2. 예금 ==> 원금: 7,000,000원, 총입금: 7,330,754원 
3. 적금 ==> 원금: 6,000,000원, 총입금: 6,153,980원 
==> 038-01-21-0093579 [저축예금] 37,500,625원 
==============================================================================================================
  
- 메리츠종금증권 통장 개설 ==> 2012.12.06(목)   
1. 통장번호: 2013-0898-01[2013089801] ==> tamario/s*j**8*1 
2. THE CMA plus(발행 어음형) 
 1) 연동금리/수시 이자 지급식   
 2) 기본금리: 2.9%(일) ~ 3.3%(5천 만원까지 예금자 보호) 
 3) 카드만 발급 받음(통장 미발급) 
 4) 이체 수수료, ATM 출금 수수료 무료(1년간) 
3. 주소: 서울 강남구 대치동 891-44 노벨빌딩 3층 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2012.12.07(금) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 19:00 

- ChatON 운영 Prj
- Dashboard Test 개발 
1. 테스트 확인 
==============================================================================================================

- ChatON 분석 문서 작성 
1. 소스분석 
/service/trunk/ServiceServer/src/main/java/com/samsungchaton/api/contact/service/BlockBuddyManager.java 
/service/trunk/ServiceServer/src/main/java/com/samsungchaton/api/poston/service/PostOnServiceImpl.java 
/service/trunk/ServiceServer/src/main/java/com/samsungchaton/api/recommendation/buddy/service/BuddyRecommendationServiceImpl.java 
2. 업무process정의 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.08(토) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 22:00  

- 집에서 쉼 @@@
10:00 기상  
12:00 중식 
18:00 석식 
21:00 루옌(부인)과 화상통화(응아씨와 함께) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.09(일) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 22:00  

- 집에서 쉼 @@@ ==> 늦에 일어나고 영하 13도, 운동장에 눈 쌓여서 축구 안 감(실내온도 10도) 
08:30 기상  
12:00 중식 
18:00 석식 
21:20 루옌(부인)과 화상통화 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.10(월) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:30 --> ChatON 추가 투입(5명): 이승민 과장, 전해성과장, 인호진 과장, 한일평 과장, 강동현 과장 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 업무process정의 
==============================================================================================================
  
- Package explorer 보이기 
1. eclipse > Window > Show View > Others > Show View(새창) > java > Package explorer(클릭)  
==============================================================================================================

- 혼인신고 우편 발송 ==> 처리 완료 
1. 우편발송 예정일: 2012.12.11(화): 처리 완료 
2. 가족관계증명서 떼 볼것: 처리 완료 
3. 등기 발송비: 2천 2백원(서울 --> 인천: 내일 도착) 
-------------------------------------------------------------------------------------------------------- 

- 베트남 결혼인터뷰 준비서류 
1. 인간증명서 1통: 처리 완료 
2. 인감 도장 날인 한 위임장 1장(동그라미 친 부분): 처리 완료 
3. 혼인 관계 증명서 2통: 처리 완료 
4. 가족 관계 증명서 1통: 처리 완료 
5. 기본 증명서 1통: 처리 완료 
6. 신부님 신분증(원본): 처리 완료 
7. 여권 앞면(본인 사진 나와 있는 면): 처리 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.11(화) 작업 ■■■■■■■■■■■■■■■ \
---> 06:45 ~ 18:00 --> ChatON 회식(SDS 주관: 신동궁뼈숯불구이(역삼동 823빌딩 근처)) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석(Trunk) 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 업무process정의 
==============================================================================================================

- SDSS SW설치 ==> 개인SW 설치 금지 
ISSP(http://70.2.140.140:9043/iSSP/security/IsspInit.jsp) > 정보자료실 > S/W 자료실 --> 검색: 오피스(클릭): 
MS Office Pro Plus 2010(SW 설치: 클릭) 
1. \\70.2.204.10\sdsmis\전사 라이센스 SW류 
 1) \\70.2.204.10\sdsmis\전사 라이센스 SW류\04. MS Office 2010\MS Office 2010(Kor)\setup.exe 
==============================================================================================================

- my Single 변경 
1. tamario0.jin/ssp**m88*1(http://www.samsung.net/portalWeb/ptmanager/ep/desktop) 
- NASCA(Excel 파일) 
mySingle ID: tamario0.jin, NASCA 암호: ssj**8*1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.12(수) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:30 --> 스판 남 타이즈 입고 옴 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석(Trunk) 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 업무process정의 
==============================================================================================================

- Mysql5.5 버전 다운 
http://blog.naver.com/goldrushing?Redirect=Log&logNo=130147912701 
==============================================================================================================

- 금일 비정기 Deploy 관련 인수인계 참관 요청 ==> 참관 취소됨 
1. 일시: 2012.12.13(목) 01:00 ~ 03:00 
2. 장소: 삼성전자 수원 사업장 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.13(목) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 19:00  

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석(Trunk) 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 작업 진행 진척 상황 
 1) 2012.12.12(수): 201. POST trunklist 
 2) 2012.12.13(목): 202. GET trunk 
==============================================================================================================

- start UML: 분석 설계 툴 
StarUML 5.0 사용자 가이드(http://staruml.sourceforge.net/docs/user-guide(ko)/toc.html) 
StarUML 5.0 개발자 가이드(http://staruml.sourceforge.net/docs/developer-guide(ko)/toc.html) 
OPEN API(http://staruml.sourceforge.net/docs/api-doc/index.html) 
==============================================================================================================
  
- 현대스위스2저축은행 적금 만기해지 ==> 은행에 안가고 인터넷 뱅킹으로 처리함  
1. 적금 ==> 원금: 6,000,000원, 총금액: 6,150,930원 ==> 2013-0898-01 [총금액]6,150,930원 
-------------------------------------------------------------------------------------------------------- 

- 메리츠종금증권 거래내역 
1. 통장번호: 2013-0898-01[2013089801] ==> tamario/s*j**8*1 
 1) 2012.12.06(목): 37,500,625원(신안저축은행 예금, 적금) 
 2) 2012.12.13(목): 6,150,930원(현대스위스2저축은행 적금) 
 3) 총금액: 43,651,555원 
==============================================================================================================
  
- 프린터 서버(미림타워 4층) 
01. SCX-7635 Series PCL6(4층) --> IP 주소: 70.4.121.235 
http://blog.naver.com/mltrjsh?Redirect=Log&logNo=140160366013 
02. Samsung CLP-670 Series(4층) --> IP 주소: 70.4.121.234 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.14(금) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 19:00  

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석(Trunk) 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 작업 진행 진척 상황 
 1) 2012.12.12(수): 201. POST trunklist 
 2) 2012.12.13(목): 202. GET trunk 
 3) 2012.12.14(금): 203. GET trunk/itemlist 
==============================================================================================================

- 출근시간 체크 Program 
1. java에서 mdb DB 사용 
http://blog.naver.com/sarah7_2000?Redirect=Log&logNo=80169859987 
==============================================================================================================

- 강남역 도레미사우나(서울 서초구 서초동 1330-16(우성아파트 사거리 뒷편), T: 525-5004) 
http://doremisauna.com/90158701087, 1인당: 만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.15(토) 작업 ■■■■■■■■■■■■■■■  
---> 08:45 ~ 18:00 --> 토요 근무 

- ChatON 운영 Prj
- UML Study 
1. UML 모델링 도구(01. Start UML, 02. RSA) 
(01. Start UML Downlaod ==> http://sourceforge.net/projects/staruml/files/staruml/5.0/staruml-5.0-with-cm.exe/download 
http://sourceforge.net/projects/staruml/files/staruml/5.0/staruml-src.zip/download 
http://chogoon.tistory.com/19  
2. UML 강의 ==> http://www.ojtkorea.com/contents/e-learning/?code=uml 
--> http://blog.naver.com/giragi?Redirect=Log&logNo=89721857 
3. 01. Use Case Diagram 자료 ==> http://chogoon.tistory.com/19  
4. [StarUML]Manual.pdf ==> http://blog.naver.com/hakssung?Redirect=Log&logNo=70119049872 
5. Eclipse UML ==> http://www.omondo.com/download/index.html 
==============================================================================================================

- 귤 택배 송금(한진택배: 010-3754-0) 완료 
1. 국민은행 83270101190000 이원옥 ==> 국결행사 카페 매니저님이 귤 보냄 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.16(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
06:30 기상  
06:50 신봉천 주유소(태훈이형 차)  
07:30 신구초등학교    
08:10 게임(6:0 패) 
09:10 게임(4:2 승): 골키퍼 
10:00 게임(1:1 무): 한골 넣음  
10:30 종료 
10:40 회장 선거(신구초등학교 식당): 한상봉 부회장님이 거수로 당선됨 
          ==> 오세림 고문, 신창원 총무가 후보로 나왔는데 본인들이 고사함
11:20 중식(류명국해장국: 한상봉 신임 회장이 쏨) ==> 김치찌게: 맛 없음  
12:10 종료 
12:40 귀가 
20:00 석식 
21:10 루옌(부인)이 눈 아프다고 Facebook 채팅만 잠깐 함 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.17(월) 작업 ■■■■■■■■■■■■■■■
---> 06:15 ~ 19:00 --> 메일 발송 문제로 김팀장님에게 잔소리 들음, 루옌 하노이에서 한국 교육 받음(1주일) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 소스분석(Trunk) 
/service/trunk/ServiceServer/src/main/resources/applicationContext.xml 
2. 작업 진행 진척 상황 
 1) 2012.12.12(수): 201. POST trunklist 
 2) 2012.12.13(목): 202. GET trunk 
 3) 2012.12.14(금): 203. GET trunk/itemlist 
 4) 2012.12.17(월): 204. GET trunk/item 
==============================================================================================================

- 변액보험 중도인출 
1. 보험 가입 후 중도인출을 하더라도 보통 해약환급금의 50~70%까지만 중도인출을 할 수 있습니다. 
2. 변액유니버셜은 목돈마련을 위해 장기간 유지해야 하는 상품이기에 가능하면 계속 유지하는 것이 좋겠지만 
상황이 좋지 않다면 중도인출을 통해 일단 필요한 자금을 사용하시고 가입한지 5년이 지난 후에는 보험료  
납입중지가 가능하니 나중에라도 여유가 되실 때에 다시 계약을 유지하는 것이 좋을 듯 합니다. 
3. 10년이상 유지시 비과세혜택 뿐만 아니라 복리효과까지 누릴 수 있음 
-------------------------------------------------------------------------------------------------------- 

- 가입한 보험 확인 
1. MetLeft 생명: 무배당 마스터플랜 변액유니버셜종신보험 ==> 가입일: 2006.04.30(월 85,600원 적립 중) 
2. PCA 생명: 무배당 PCA드림링크 변액유니버셜보험 II ==> 가입일: 2006.05.10(월 30만원 적립 중) 
3. 대한생명: 대생연금보험 ==> 2005.08.30(월 20만원 적립 중) 
==============================================================================================================

- 보안 교육  및 보안 교육 결과 결재 요청 
1. 보안 교육: 김성채 팀장님이 실시 
2. 보안 교육 결과 결재: 이치훈 책임이 김원기 PM에서 대신 요청함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.18(화) 작업 ■■■■■■■■■■■■■■■
---> 06:55 ~ 19:00 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 1.5.2. Get Trunk List(based timestamp) ==> Done  
==============================================================================================================

- Service 파트 요청 사항[deploy 관련 회의] 
1. Deploy 작업 순서를 순차적으로 나열해 주었으면 좋겠음. 
 1) 예 
> /production/service/de.sh pd ./war/ChatON_Service_Server-vX.X.X-rcXXXX.war 
> cd /home/chaton/service/bin/ 
> ls 
> kill.sh 
> run.sh 
> tail -f /home/chaton/service/log/system.log 
2. Deploy 작업 중 에러 발생시 조치 사항이 궁금함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.19(수) 작업 ■■■■■■■■■■■■■■■
---> 06:10 ~ 19:00 --> 임시공휴일 

- ChatON 운영 Prj
- ChatON 분석 문서 작성  
2. 1.6.1. Mark As Read ==> Done 
==============================================================================================================
   
06:00 기상 
06:40 대통령 선거 투표(관악중학교) 
07:10 신봉천 주유소(태훈이형 차)  
07:40 신구초등학교    
08:10 숏게임(1:1 무) 
09:50 종료 
11:20 중식(문경세재: 만원) ==> 갈비탕  
11:40 종료 
11:50 출근(용길이 차): 미림타워 4층 
18:45 퇴근 
20:00 석식 
21:10 루옌(부인)이 화상통화 ==> 하노이에서 한국 교육 받고 있음(응아, 프헝) 
21:30 대통령 선거 개표 방송 
23:40 취침 
==============================================================================================================

- 18대 대통령선거일 
1. 새누리당 박근혜: 51.7% ==> 당선 
2. 민주통합당 문재인: 47.9% 
==> 투표율: 75.8%, 득표차: 3.6%(1,080,496표) 
3. 기타: 입후보 등록시 3억 공탁( 투표율 10 ~15% 미만: 절반 반환, 투표율 10% 미만: 없음) 
==============================================================================================================

- 제주도 신혼여행 
1. 보람21세기트레블(전용길(신사 조기축구)이 에게 부탁) 
http://www.boram21.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.20(목) 작업 ■■■■■■■■■■■■■■■
---> 07:05 ~ 19:00 --> 베트남 2차 인터뷰 일정 통보 받음(12월 27일(목)) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성  
1. 1.6.3. Get My Item List ==> Done 
2. 1.6.5. Get Item(based Item-info) ==> Done 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.21(금) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 눈 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1. 1.6.6. Get Item ID ==> Done 
==============================================================================================================

- 프린터 출력 설정 
1. Secu Print 설치 
==============================================================================================================

 - 용산 방문 
18:00 퇴근  
19:00 코모운(전자랜드 별관 광장(지하1)층 47호): SC은행 지하(신관, 별관에서 헤멤): 응아씨 노트북 구입 
19:05 CD-ROM 달아줌 
19:15 휴대폰 가죽케이스(갤럭시2) 구입 
19:45 응아씨 노트북 마우스 구입(만 3천원) 
20:30 귀가 
20:50 식사(라면) 
22:00 MSI 노트북 OS 설치 
01:00 취침 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2012.12.22(토) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 1:00  

- 종민씨 만남(18:30)  
08:30 기상 
10:00 MSI 노트북 프로그램 설치 
12:40 중식 
16:30 집출발(MSI 노트북 가지고 감) 
17:20 이마트 mtro 이수점 방문(초코파이, 인삼사탕) 
18:30 사당역 롯데슈퍼(종민씨 도착) 
18:40 횟집(종민씨가 쏨: 노트북 전달함) 
20:00 남권이형에게 전화옴(공증은 무효고 돈은 2~3달 후에 준다고 함) 
20:50 귀가(종민씨 차) 
21:20 루옌(부인)과 화상통화 
23:00 취침 
==============================================================================================================

- 응아 남편 노트북 구입 
- MSI A617-i5 Project MX, 가격  699,000원(CD-ROM 4만원 포함) 
http://prod.danawa.com/info/?pcode=1732246&cate1=860&cate2=869&cate3=12734&cate4=&keyword=MSI ;;A617-i5 Project MX 
판매처: 코모운: T)703-2861, 서울시 용산구 원효로3가 전자랜드 별관 광장(지하1)층 47호  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2012.12.23(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
06:40 기상(-8도: 엄청 추움) 
07:00 신봉천 주유소(태훈이형 차)  
07:50 신구초등학교   
08:10 숏게임(2:1 승) 
09:10 게임(2:1 승): 골키퍼 
10:00 게임(2:1 패) 
10:20 게임(2:0 승) 
10:50 종료 
11:20 커피숍4명) 
11:40 중식(문경세재: 만원) ==> 갈비탕  
12:40 종료  
13:40 귀가 
14:00 낮잠 
17:00 기상 
17:10 정병인 과장에게 업무 교체 희망 전화 옴(mobileB로 오고 싶다고 함) 
20:00 석식 
20:30 루옌(부인)이 화상통화 ==> 12월 26일 내가 베트남 간다고 기뻐하고 있음 
21:30 종료 
23:30 베트남 출국 짐 정리 
23:50 2차 인터뷰장에서 하고 싶은 말 작성 
01:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.24(월) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00 

- ChatON 운영 Prj
- ChatON 분석 문서 작성  
1. 1.6.7. Delete Item ==> Done 
2. 1.6.8. Delete Items ==> Done 
==============================================================================================================

- 웹챗온(Web ChatON) 
https://web.samsungchaton.com/index.html ==> *@*.*/tama339 
==============================================================================================================

- 비자서류준비 도착(가원웨딩 등기우편으로 미림타워 4층으로 도착)  @@@@@@ 
1. 혼인관계증명서, 가족관계증명서, 주민등록등본, 주민등록증 앞뒤복사, 여권복사, 인감증명 2부 
2. 재직증명서(재직중인 회사에 요청) 
3. 근로소득원천징수영수증(재직중인 회사에 요청)  
4. 사업자등록증명원(회사에 요청) 인터넷 국체청에 들어가면 무료발급가능 
5. 집등기부등본, 전세계약서 ==> 확인 @@@ 
6. 건물, 토지등기부등본, 긱종 보험가입확인서, 국민연금가입서, 자동차등록증, 적금 및 주식 등 
==> PCA, 한화생명, MET종신, 국민연금가입서, 메리츠증권, 동양펀드, KB미래펀드 
7. 납세영수증, 자동차등록증원부(국세청) 
8. 이혼사유서(해당사항 없음)(제외) ==> 확인 @@@ 
9. 1년간 통장거래내역서, 회사원이면 월급 입금되는 통장(SC은행에서 발급) ==> 확인 @@@ 
10. 본인신용정보조회서(전국은행협회) 
11. 건강진단서 ==> 확인 @@@ 
12. 
 1) 범죄경력조회 회신서(최근 10년이내의 금고이상의 형에 해당하는 범죄경력) 유효기간 3개월 
 2) 범죄경력. 수사경력조회 회보서(2개 발급 받을 것) 
13. 초정장 3장(견본과 문서는 회사에서 줌) 
14. 교제경위서(별도로 회사대표가 씀) - 쓴 후 인감도장찍고 인감을 첨부해야 함. 
15. 신원보증서(뒤에 인감증명 부착)(견본과 문서는 회사에서 줌) - 보장기간은 3년 ==> 확인 
16. 국제결혼프로그램이수중 ==> 확인 
17. 혼인관계입증자료(통화내역서(전화카드 사용하면 편리함)) 
18. 결혼사진 1매 ==> 확인 @@@ 
19. 가원커플 국제결혼 등록증, 사업자등록증 또는 사업자등록증명원 ==> 확인 @@@ 
20. 소개경위서(소개인이 있을 경우) - 소개인을 쓰고 신분증, 혼인관계증명서(??) 
21. 사증심사시 참고자료(한국인 배우자가 기재): 하노이 지역(제외) ==> 확인 @@@ 
-------------------------------------------------------------------------------------------------------- 

- 비자서류준비(주)아이엘포유에 요청) @@@@@@ 
2.  재직증명서(재직중인 회사)  
3. 근로소득원천징수영수증 
4. 사업자등록증명원(재직중인 회사꺼) 
 1) (주)아이엘포유: 서울시 서초구 양재동 67번지 혜인빌딩 4층(T: 571-0) 
==============================================================================================================

- SC은행 방문(점심 시간)[2012.12.24(월)] @@@ 
1. 환전(SC은행)  
 1) 1달러: 1,089원 ==> 1,000달러: 1,089,000원(추석 방문때 남은 300달러 존재함) 
 2) SC은행에서 단골고객으로 환전 
2. 1년간 통장거래내역서, 회사원이면 월급 입금되는 통장(SC은행에서 발급)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.25(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 성탄절 

07:30 기상(태훈형이 축구 못 간다고 하고 눈와서 못 감) 
12:00 중식 
15:00 목목욕(봉천동 태화사우나): 5천 5백원 
17:00 종료 
17:30 GS슈퍼마트 
18:30 귀가 
20:00 석식 
22:40 취침 
==============================================================================================================
  
- 1일차: 12.26(수)  @@@@@@@@@@ ==> 베트남 처가 방문 
05:00 기상 
05:40 집출발(영하 14도: 무척 추움) 
06:00 공항버스 탑승(6003번[서울대입구역 --> 인천공항]: 9,000원) 
07:40 인천공항 도착(3층 4번 게이트 D 1-18로 이동) 
08:20 종민씨 만남 
08:30 수하물 체크인(2명이서 59.5kg 나옴 ==> 통과) 
08:50 보안검사(보딩패스 받음) 
09:00 출국심사 
09:20 롯데면세점(뚜원이 양주 2명, 담배 2갑 사오라고 해서 구입) 
10:10 베트남 항공 VN 417 탑승 
10:35 출국 
13:35 하노이 공항 도착(시차 2시간) ==> 5시간 걸림 
14:35 공항에 나옴(짐 찾는다고 1시간 걸림) 
14:45 뚜원 만남(프엉 남편외 1명 만남): 5명이서 차타고 감 
17:20 중식(정류소에서 쌀국수 먹음) 
18:20 정류소에서 베트남 여자 한명 더 태움(짐이 많아서 뒷쪽에 겨우 태움) 
20:00 처갓집 도착(짐 내리고 선물 드림) 
20:20 석식(종민씨 처가, 응아씨집) 
22:00 동가이 호텔 도착(305호): 이종민씨 부부(402호), 프헝씨 부부(303호) 
23:00 취침  
-------------------------------------------------------------------------------------------------------- 

- 2일차: 12.27(목)  @@@@@@@@@@ 
07:30 기상  
08:10 프헝씨 부부 방에서 뚜원에게 2차 인터뷰 교육 받음 
08:30 조식(베트남 쌀국수) 
09:30 하이퐁 서뜨팝 도착 
10:20 인터뷰(통역이 직장 어디 다니냐고 물어서 삼성전자 다닌다고 함 ==> 부인이 모른다고 이상하게 생각함) 
        신부는 한국어로 뭍는 질문 하나도 답변 못함 
11:50 인터뷰 3쌍 모두 종료 
12:10 뚜원 차로 출발 
13:20 중식(종민씨 처가, 응아씨집) 
14:30 처가집 도착 
16:00 할아버지댁 방문(파스와 용돈 드리고 옴) 
18:00 석식(처가집): 조부모님과 함께 식사함  
20:00 취침 
-------------------------------------------------------------------------------------------------------- 

- 3일차: 12.28(금)  @@@@@@@@@@ 
08:00 기상 
08:10 조식(베트남 쌀국수)  
10:20 응아씨 집(전통결혼식 준비) 
11:30 전통결혼 시작(아이패드로 비디오 촬영함 --> 잘못해서 거의 안 나옴) 
15:00 종료 
16:20 처갓집(걸어서 감): 프헝 부부, 응아 부부 
16:30 응아 노트북 와이파이 설정해줌(루옌 집 공유기 tenda 비밀번호: 12345678) 
18:00 석식(처가집) 
20:00 취침 
-------------------------------------------------------------------------------------------------------- 

- 4일차: 12.29(토)  @@@@@@@@@@ 
08:00 기상 
08:10 조식(베트남 쌀국수)  
10:00 뚜원 업체에서 기사가 차몰고 옴(프헝 부부, 응아 부부) 
10:30 뚜원 업체에서 미니 버스로 차 바꿈(프헝 어머니, 응아 어머니, 동생 추가) 
11:30 빅시 마트 도착 
11:40 쇼핑(마대 청소기, 드라이기, 와이셔츠, 샴푸, 바디워셔, 커피, 과자 등등) ==> 우리 부부 물건이 많다고 부러워함 
13:10 종료 
14:00 중식(처가집) 
16:00 할아버지댁 방문 
16:10 낚시(루옌 호수에서 낚시로 고기 2마리 잡음) 
17:30 석식(할아버지댁 마당에서 먹음) 
18:30 귀가 
20:00 선물 구입(처남 구두, 장인 휴대폰): 내구두 구입 
20:30 응아씨집에 잠깐 들림 
21:30 귀가 
22:00 취침 
-------------------------------------------------------------------------------------------------------- 

- 5일차: 12.30(일) @@@@@@@@@@ 
08:00 기상 
08:10 조식(베트남 쌀국수)  
12:00 중식(처가집) 
12:00 가방 구입(처남 오토바이): 나이키 운동화 구입 
13:30 응아씨집에 잠깐 들림 
14:30 귀가  
17:30 석식 
18:00 뚜원 업체에서 기사가 차몰고 옴(응아 부부) ==> 신부는 공항까지 안간다고 해서 응아 가족이 강력하게 
        항의해서 돈 추가로 지불하고 신부들 같이 공항까지 감 
21:00 공항 도착 
21:30 수하물 체크인(2명이서 59.5kg 나옴 ==> 통과): 플라스틱 소스 4병이 보안에 걸려서 루옌에게 줌 
21:50 보안검사(보딩패스 받음) 
22:00 출국심사 
22:40 베트남 항공 VN 416 탑승 
23:20 출국 
05:30 하노이 공항 도착(시차 2시간) ==> 7시간 걸림 ==> 2012.12.31(일) 
06:10 공항에 나옴(짐 빨리 찾음): 짐 찾고 다른 검사는 안함(농축산물 신고 서류로만 함) 
08:00 귀가 
10:00 휴식 
11:00 집출발 
11:40 남권이형 사무실(서초역 1번 출구 > 농협 건물 701호) 
12:30 중식(김치찌게: 남권형이 쏨): 돈 3천 2월 10일까지 달라고 요구(준다고 함) 
13:30 서초경찰서(범죄경력조회 회신서, 범죄경력. 수사경력조회 회보서 발급 받음) 
14:10 행운동 주민센터(혼인관계증명서, 가족관계증명서, 인감증명 2부 발급) 
14:30 귀가 
16:00 집 출발 
16:10 5530번 버스(낙성대 -> 말미고개정류장 하차 --> 하이마트 --> 은하마트(왼쪽 끼고 돌기) -> 대원(빌라) 1층 
       ==> 주소: 서울 특별시 금천구 시흥대로88길16(서울 특별시 금천구 시흥대 독산2동 1068-13) 
16:40 느씨 집 방문(부모님 선물 전달) 
18:40 귀가 
20:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.12.31(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
08:00 기상(눈 많이 옴) 
08:10 신봉천 주유소(태훈이형 차) 
08:40 신구초등학교 
09:30 제설작업 
10:20 게임(0:1 패): 역삼조기회 초청 
11:00 게임(1:0 승) 
12:25 게임(2:2 무) 
12:50 중식(문경세재: 갈비탕 ==> 조기회에서 쏨)  
13:30 종료 
14:30 귀가 
15:00 낮잠 
17:20 기상 
20:50 루이엔(부인)과 화상통화  
21:40 종료 
23:40 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
