

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2012.07) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2012.07.01(일) 작업 ■■■■■■■■■■■■■■■
---> 07:50 ~ 16:00 

- 1일차: 6월 30일(토)  @@@@@@@@@@ 
05:40 기상 
06:00 집출발 
06:20 공항버스 탑승(6003번[서울대입구역 --> 인천공항]: 9,000원) 
08:00 인천공항 도착(9번 게이트 3번으로 이동) 
08:05 최실장님 만남 
08:10 입국 수속 
09:35 출국 체크인 
09:40 비행기 탑승 
10:05 출국 
12:35 하노이 공항 도착(시차 2시간) 
13:00 하노이 출발 
16:20 하이퐁 투이웬 도착(동가이 호텔) 
16:50 호텔 출발 
17:55 하씨 언니집으로 이동 
18:10 맞선 
==> 1. 홍(20: 노, 오), 2. 민(22, 구두 공장, 부 없음:오, 노) ==> 마음에 안들었음 
3. 뚜엔(18: 자격 안됨), 4. 튀이(21: 노, 오) 
18:40 종료 
19:20 석식(아리랑 식당) 
21:00 호텔 도착 
22:00 취침  
-------------------------------------------------------------------------------------------------------- 

- 2일차: 07월 01일(일)  @@@@@@@@@@ 
07:00 기상(비 많이 옴) 
07:10 인터넷(1층 프런트) 
08:00 최실장님 투원 합류 
08:10 베트남 쌀국수 
09:00 1차 맞선(1 억 ) 
==>   1. 억(22: 161 오, 노), 2 남(27, 160: 노, 오) 
3 튀위(24 160: 오, 오); 믿음이 안가고 부모님이 일하러 가서 저녁에 온다고 해서 오후에 다시 보기로 함 
10: 00 2차 맞선(작은 마담집) 
==>   1. 화(19: 노, 노), 2 풀응(20: 노, 노), 3. 푸(21, 158, 잡화가게 점원: 오, 모): 투원이 밀어서 한번 더 봄 
4. 응아(25, 155: 모, 모), 5. 번(19), 6. 귀엔(20, 160, 가사: 노, 노) 
7. 쟌(23, 152, 회사원, 전문대: 오, 오): 계약서 작성 직전에 거부함 
8. 토와(19, 159, 미용학원: 고졸): 부모님 찾아 뵙기로 하고 매니저님이 어린 여자하지 말라고 해서 최종 결렬됨 
9. 마이(20, 160: 노, 노) 
10 루이엔(19, 163 , 고졸: 오, 오); 어머님 오셔서 면접보고 최종 결정, 부모님집 찾아감 
13 루이엔 부모님집 찾아감(장인, 처남2명, 조부모님, 고모) 
14:00 중식(예식장옆 식당); 루이엔(0976058762) 데리고 다님 
15:00 호텔 복구(루이엔과 베트남어책으로 공부함) 
17:00 호텔 출발 
17:20 코업 쇼핑몰(사람이 너무 많아서 쇼핑 포기) 
17:30 빅C 마트(미니 가방 반바지 루이엔 가방 구두 속옷 잠옷 세면도구 구입) 
20:00 석식(아리랑 한국 식당); 내가 쏨 
21:00 호텔 복귀 
22:00 루이엔 집에 감 
24:00 뚜원방에서 유로 결승 보면서 맥주 한잔 
02:00 취침 
-------------------------------------------------------------------------------------------------------- 

- 3일차: 07월 02일(월)  @@@@@@@@@@ 
08:00 기상(비) 
08:10 루이엔 호텔로 와서 신고 문서 작성 
09:00 조식(뚜언 루이엔 실장님) 
10:10 뚜언방에서 루이엔 신부화장 
11:00 머리 손질 받음 
11:50 결혼식장 도착 
12:00 야외 촬영(양복이 커다고 뚜엔에게 욕 먹음) 
12:20 결혼식 
12:50 피로연 
13:40 종료 
14:00 호텔 도착 
15:00 시청 혼인신고 문서 제출(루이엔 차 멀미로 오바이트 함) 
16:00 면사무소 혼인신고서 제출(루이엔 자술서 다시 작성 하라고 함) 
17:00 호텔 도착(체크 아웃) 
18:30 하롱베이 파라다이스 호텔 도착(신혼여행) 
20:00 석식(삼겹살) 
21:30 호텔 도착 
22:00 취침(첫날밤) 
-------------------------------------------------------------------------------------------------------- 

- 4일차: 07월 03일(화)  @@@@@@@@@@ 
07:30 기상 
08:00 호텔 부페(루이엔 최실장님) 
10:40 하롱베이 배 여행 
11:10 동굴 여행 
12:30 중식(선상 만찬) 
13:00 목걸이 구매(백달러) 
13:40 종료 
14:00 호텔 도착 
17:30 하롱베이 해수욕장 
18:30 야시장(가방 구매) 
19:00 석식(한국식당: 최실장님이 쏨) 
20:50 발맞사지(루옌, 최실장님, 뚜언 내가 쏨) 
22:20 종료 
22:50 호텔 도착 
23:20 취침 
-------------------------------------------------------------------------------------------------------- 

- 5일차: 07월 04(수) @@@@@@@@@@ 
07:00 기상 
07:30 1층 로비(야후 아이디) 
08:10 조식(최실장님과 길 엊갈림) 
11:00 체크아웃 
12:00 중식(베트남 식당) 
13:00 마담집(결혼 사진, CD 찾음) 
17:00 루이엔집(친척 선물 주고 받음) 
18:00 공항 출발(최실장님, 뚜언) 
19:10 석식(베트남 식당) 
20:40 하노이공항 도착 
23:40 베트남항공 탑승 
06:00 인천공항 도착  ==> 2012.07.05(목) @@@@ 
07:00 공항버스(6003번: 8,800원) 
09:00 귀가 
09:40 출근 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.05(목) 작업 ■■■■■■■■■■■■■■■
---> 09:40 ~ 19:00 

- IOSP(/oauth2) Prj
- createUserAuthToken() 수정 
==============================================================================================================

- 베트남 국결 후기 작성 
==============================================================================================================

- yahoo 
1. *@*.*/tama3**  
2. 야후 매신저 다운로드: http://kr.messenger.yahoo.com/beta/win 
==============================================================================================================

- 최실장님 네이버 블로그: http://blog.naver.com/skh6316 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.06(금) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 16:00 

- IOSP(/oauth2) Prj
- CR 2차 소스 수정 
==============================================================================================================

- 현용 만남 @@@@ 
1. 현용급여 2012.06.11 C9 ==> 6,285,500원 찾아서 현금으로 줌 
==============================================================================================================

- 베트남어 
1. 루이엔 보고 싶어요.(루이엔 무언 엠) 
2. 전화 끊을께요.(디엔 전 또와이) 
==============================================================================================================
- 베트남 여행 
1. 하나투어: http://sns.hanatour.com/hnt_net/ad/cap/cap0451.html 
=============================================================================================================

- 베트남 돈(http://blog.daum.net/ohhuck/153) 
1. 100달러: 약 200만동 ==>1$에 19,000동 
2. 베트남동 10만동을 한국돈 1만원정도  
10.000 원 = 158.600동  
==============================================================================================================

- 현용, 임모 만남 @@@@ 
19:00 퇴근 
19:30 귀가 
20:40 현용, 임모 만남 
20:50 해물탕집(결혼 사진 보여줌): 현용 쏨 
23:00 당구장(꼴찌함) 
00:00 술집: 내가 쏨(3만원) ==> 2012.07.07(토) @@@@ 
03:00 종료 
02:10 귀가 
02:20 취침 
10:00 기상 
11:00 빨래 
11:10 동영상 인코딩(베트남어 DVD) 
12:10 집출발 
13:30 무료결혼(단테인천님, 복돌이님): 인천 정모 
        장소: 간석오거리역 3번 출구(인천시 남동구 간석동 173-4 로얄호텔(인천)그랜드볼륨) 
16:00 종료 
16:30 가원 인천 사무실(동암역) 
17:30 종료 
18:50 귀가 
21:00 루이앤(부인)과 화상 통화(처음): 야후 메신저로 함(무료) 
23:50 취침 
==============================================================================================================

- 동영상 인코딩(휴대폰에서 사용할 수 있는 동영상 변경) 
1. 인코딩 프로그램(다음 팟인코더 v 2.0 BETA)을 이용 wmv 파일을 avi 파일로 변환 후 재생 
2. 사용 방법 
 1) 인코딩 > 불러오기(클릭): 파일 선택 ==> 00-1.성조.wmv 
 2) 휴대기기용 > 삼성(인코딩 옵션) > 삼성 P3 VBR(AVI): 선택 
 3) 인코딩(틀릭) ===> 00-1.성조.avi 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.08(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
06:00 기상 
06:35 신봉천 주유소(태훈이형 차) 
07:00 신구초등학교 
07:30 숏게임(0:2 패): 베트남 결혼 소식 알림 
08:30 게임(0:0 무) 
09:30 종료  
10:00 중식(순대국집): 회비에서 쏨 
11:30 종료  
12:30 귀가(버스로 옴) 
13:30 낮잠 
16:00 기상 
20:00 석식 
22:00 루이앤(부인)과 화상 통화 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.09(월) 작업 ■■■■■■■■■■■■■■■
---> 07:40 ~ 21:50 --> 민방위 훈련(마지막 해) 

- IOSP(/oauth2) Prj
- CR 2차 소스 수정 
1. OSP-1484: OSP2.0 인증API 추가 CR 요청 @@@@@@ 
 1) POST auth/oauth2/getSignedUserInfo (UserAuthenticationToken API) 신규 API   
 ==> client_id, access_token으로 서명된 사용자 정보를 제공 
 2) POST auth/oauth2/getSignedConfirmationInfo (UserConfirmationToken API) 신규 API 
 ==> User가 등록된 사용자 인지 조회 
-------------------------------------------------------------------------------------------------------- 

2. OSP-1486: Auth 6월1일 긴급배포 authorize API 수정 
3. 곧 적용예정: Party 약관 CR요청 
==============================================================================================================

- Navigator 추가(eclipse에서) 
1. Window > Show View: Navigator(클릭) 
2. Window > Show View: Project Explorer(클릭) 
==============================================================================================================

- 베트남어 정보 
1. 한송이의 베트남어 입문- 왕초보 
2. http://blog.naver.com/essayon?Redirect=Log&logNo=150128353270 
==============================================================================================================

- 부인 프로필 
1. 딘 티 루이엔(Phone: 001-8497-0, 84-9760-0) 
2. 야후 아이디: nuocmatsaobaccuc_ruacon20002000(야후 메신저: 영상 통화) 
3. 이메일:@yahoo.com 
4. 주소: 하이퐁시 투이 응웬구 렙레면 바이기엠리-13번지 
5. 무료국제전화 어플: OTO 무료국제전화 
==============================================================================================================

- 열차 예매(http://www.korail.com/servlets/pr.pr21100.sw_pr21111_i1Svt#move) 
1. 7월27일 (금): 1513 무궁화 일반실 용산 여천 19:28 ~ 00:29 일반예약(25,600원) 
2. 7월29일 (일): 4804 무궁화 일반실 여천 용산 18:38 ~ 23:24 일반예약(25,600원) 
3. 주소: 전남 여수시 학동 54 신동아파밀리에APT 107동 405호 
4. 18번 버스(신월동-송소)(여천역) ==> 여천중) 
5. 여수엑스포 아쿠아룸 예약 
==============================================================================================================

- 조일현:  @ex.co.kr, PH: 010-9465-0(회사), PH: 010-2538-0(개인) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.10(화) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 21:00 

- IOSP(/oauth2) Prj
- CR 2차 소스 수정 
1. OSP-1484: OSP2.0 인증API 추가 CR 요청 @@@@@@ 
 1) POST auth/oauth2/getSignedUserInfo (UserAuthenticationToken API) 신규 API   
 ==> client_id, access_token으로 서명된 사용자 정보를 제공 
 2) POST auth/oauth2/getSignedConfirmationInfo (UserConfirmationToken API) 신규 API 
 ==> User가 등록된 사용자 인지 조회 
-------------------------------------------------------------------------------------------------------- 

2. OSP-1486: Auth 6월1일 긴급배포 authorize API 수정 
 1) /auth/oauth2/authorize (로그인API 수정)  
   - 성능 이슈로 인하여 EU 사용자 정보도 localDB에 insert (TCSO_PRTY - TCSO_SVC_PRTY 간 foreign key 관계제거) 
3. 곧 적용예정: Party 약관 CR요청 
==============================================================================================================

- eclipse 서버 에러 
1. 현상: 2012. 7. 10 오후 6:31:06 org.apache.catalina.core.StandardServer await 
경고: StandardServer.await: Invalid command 'POST /auth/oauth2/authenticate HTTP/1.1' received 
2. 조치: tomcat 6.0 Modules 수정 후 재시작 여러 번 할 것 
==============================================================================================================

- 부동산 
1. 빌라 매매: 서울시 관악구 봉천동 
http://land.naver.com/article/articleDetailInfo.nhn?atclNo=1202245447&atclRletTypeCd=C02&rletTypeCd=C02 
==============================================================================================================

- 보유중인 노트북 사양 @@@@@@@@ 
- DELL Studio XPS 16 Full-HD2 사양(집에서 사용하는 노트북) ==> 2010.07.0.15(목) 구매 
1. CPU: 인텔 i7-720QM (1.6GHz) 
2. RAM(메모리): 4GB 1066 MHz DDR3(2 GB x 2), 메모리 슬롯 두 개 
3. OS: 윈도우 7 홈프리미엄 
4. LCD 크기: 15.6인치 
5. 무게: 2.91Kg 
6. HDD 용량: 500 GB SATA, 7200 rpm 
7. 그래픽 칩셋: ATI 모빌리티 레이디언 HD 5730  
8. 배터리: 1500mAh 
9. 카메라: 전면 VGA, 후면 500만 AF 카메라 
10. 해상도: 1920x1080  
11. 웹캠: 200만 화소 
12. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등  
-------------------------------------------------------------------------------------------------------- 

- 노트북 구매 
1. DELL Studio XPS 16 Full-HD2 가격: 1,555,000원(현금가)  ==> 정과장 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=15601&cate_c4=0&depth=3&prod_c=1125232 
서울시 용산구 한강로2가 15-2 나진상가 17동 가열 324호  T)715-9377 
2. Window 7 Product KEY: 7XJWQ-Y9FY-KXRCT-KFQXK-2CRWG  
==============================================================================================================

- MSI GT683DX-i7 Imperial(750GB) SSD(64G)(회사에서 사용하는 노트북) ==> 2012.01.27(금)구매 
1. CPU: 인텔 코어i7-2세대 i7-2670QM(동작 속도: 2.2 GHz, 최대 터보 부스트일 때: 3.1 GHz, 스마트 캐시 메모리: 6 MB)  
2. RAM(메모리): 8GB DDR3, 최대 32GB 메모리까지 인식 
3. OS: 운영체제 미포함 
4. LCD 크기: 15.6인치 
5. 무게: 3.5Kg 
6. HDD 용량: 750 GB SATA, 7200 rpm, HDD슬롯 x 1(+ 64GB SSD) 
7. 그래픽 칩셋: 엔비디아 지포스 GTX 570M 
8. 배터리: 1500mAh 
9. 카메라: 전면 VGA, 후면 500만 AF 카메라 
10. 해상도: 1920 x 1080  
11. 웹캠: HD고화질 웹캠(720p) 
12. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등  
-------------------------------------------------------------------------------------------------------- 

- 노트북 구매 
- MSI GT683DX-i7 Imperial(750GB) SSD(64G) + Edition, 1920x1080, 15In, 1,680,000원 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=12734&cate_c4=0&depth=3&prod_c=1515034 
주소: 서울시 용산구 한강로3가 16-9 전자랜드 별관 광장(지하1층) 47호, 703-2861  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.11(수) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 20:00 

- IOSP(/oauth2) Prj
- CR 2차 소스 수정(완료) 
1. OSP-1484: OSP2.0 인증API 추가 CR 요청 @@@@@@ 
 1) POST auth/oauth2/getSignedUserInfo (UserAuthenticationToken API) 신규 API   
 ==> client_id, access_token으로 서명된 사용자 정보를 제공 
1. http://eu.auth.samsungosp.com/auth/oauth2/authenticate 
grant_type=password&client_id=j5p7ll8g33&client_secret=5763D0052DC1462E13751F753384E9A9&username=@yopmail.com&password=osp123 

2. http://eu.auth.samsungosp.com/auth/oauth2/authorize?response_type=code&client_id=j5p7ll8g33&userauth_token=sccYFHCz9p 

3. http://eu.auth.samsungosp.com/auth/oauth2/token 
scope=test&client_id=j5p7ll8g33&grant_type=authorization_code&service_type=M&client_secret=
5763D0052DC1462E13751F753384E9A9&physical_address_text=test&code=QWr8X8gkeX 

7. http://eu.auth.samsungosp.com/auth/oauth2/getSignedUserInfo 
client_id=j5p7ll8g33&access_token=qti68UjnpR 
결과값: 
{ 
"issuetime": 1341985316, 
"expiretime": 1341987116, 
"userid": "01gg5uki5o", 
"signerid": "SamsungOSP", 
"signature": "bcE9ldni33sJTDrsEqMHNWwUU6bTHdDsC0f1O0zucBNz7gAmsINfx58fqyMk8v0zb+
+GtqaEBmfAgXnv6dN54K+VGBwnh2Vt6qZEaNjM1yk1PaZaFXRreH9wKh+TsBwVF71yU0AEkSxjuik9DPvwu6Qp4HCe2kmNzIpv0EdOw24=" 
} 
-------------------------------------------------------------------------------------- 

 2) POST auth/oauth2/getSignedConfirmationInfo (UserConfirmationToken API) 신규 API 
==> User가 등록된 사용자 인지 조회 
8. http://eu.auth.samsungosp.com/auth/oauth2/getSignedConfirmationInfo 
username=@yopmail.com&password=osp123 
결과값: 
{ 
"issuetime": 1341985363, 
"confirmed": true, 
"expiretime": 1341987163, 
"userid": "01gg5uki5o", 
"signerid": "SamsungOSP", 
"signature": "U6Ygq5y7YEf5/USEeZUKnSIZsD4Y566zb5XW99KxzGPrpFiZ6bxrxkZ0U/lvd2V9EFwYNTvfkDDyBG8qq38MuYW
+kjrxY5N0q7vdO4Foh44HGMjPnZ8qhHVbiFhlj7pxes3TnhpDNXTa/9O+AyDjcV0pRqt69QmYSxjdsQOp18g=" 
} 
--------------------------------------------------------------------------------------------------------  

2. OSP-1486: Auth 6월1일 긴급배포 authorize API 수정  @@@@@@ 
 1) /auth/oauth2/authorize (로그인API 수정)  
   - 성능 이슈로 인하여 EU 사용자 정보도 localDB에 insert (TCSO_PRTY - TCSO_SVC_PRTY 간 foreign key 관계제거) 
1. http://eu.auth.samsungosp.com/auth/oauth2/authenticate 
grant_type=password&client_id=j5p7ll8g33&client_secret=5763D0052DC1462E13751F753384E9A9&username=@yopmail.com&password=osp123 
결과값: 
{ 
"userauth_token": "jaGepxjFcC", 
"userId": "01gg5uki5o" 
} 

2. http://eu.auth.samsungosp.com/auth/oauth2/authorize?response_type=code&client_id=j5p7ll8g33&userauth_token=jaGepxjFcC 
결과값: 
{ 
"code": "Ff7vVVRYC6" 
} 
==============================================================================================================

- 인증서 파일 서버 등록(로컬) 
1. /bcprov-jdk16-143.jar 파일 등록 
 1) 로컬 서버에서 
  가. ecipse(로컬 서버)에서 bcprov-jdk16-143.jar파일 Java Build Pah(새창) > Librarie(탭) 에서 
Add External JARs에서 import 할 것 
 2) WAS 서버에서 
  가. /usr/lib/jvm/java-6-sun/jre/lib/security/java.security 파일  
53(line) security.provider.8=sun.security.smartcardio.SunPCSC 내용 다음에 아래 내용 추가 
-> security.provider.9=org.bouncycastle.jce.provider.BouncyCastleProvider 
   나. /usr/lib/jvm/java-6-sun/jre/lib/ext 경로에 다음의 jar 파일을 넣어주세요.  
-> bcprov-jdk16-143.jar   
-------------------------------------------------------------------------------------------------------- 

2. C:\OSP2.5\localhome\comp\auth\config 폴더에 
 1) SamsungOSP.der, SamsungOSP.p12 파일 복사해서 넣기 
-------------------------------------------------------------------------------------------------------- 

3. /local/applicationSystemConfig.US-U.xml 파일에서 
<!-- ==================================================================================================== --> 
<!--  Certification File Path --> 
<!-- ==================================================================================================== -->    
<entry key="ca.dir">C:/OSP2.5/localhome/comp/auth/config</entry> <!--// local dir(C:\OSP2.5\localhome\comp\auth\config) //--> 

<!-- Certification Meta --> 
<!-- <entry key="samsungca.cert">SamsungCA_shop.crt</entry> 
<entry key="codesign.cert">shop(SKT-KR-00).der</entry> 
<entry key="codesign.cert.p12">shop(SKT-KR-00).p12</entry> 
<entry key="privateKey.pwd">g57j</entry>     
<entry key="key.store.entry.alias">codeSign-shop(SKT-KR-00)</entry> --> 
<entry key="samsungca.cert">SamsungOSP.crt</entry> 
<entry key="codesign.cert">SamsungOSP.der</entry> 
<entry key="codesign.cert.p12">SamsungOSP.p12</entry> 
<entry key="privateKey.pwd">asdf</entry>     
<entry key="key.store.entry.alias">codeSign-SamsungOSP</entry> 
<!-- Certification Meta --> 
<entry key="subject.dn">SamsungOSP</entry> 
<entry key="time.Interval">1800</entry>  
-------------------------------------------------------------------------------------------------------- 

4. /applicationContext-external.xml 파일에서 
<!-- ==================================================================================================== --> 
<!--  Certification File Path --> 
<!-- ==================================================================================================== -->   
<bean id="userAuthorizeBiz" class="com.samsungosp.auth.oauth2.biz.UserAuthorizeBizImpl">  
<!--<property name="oauth2VerifyBiz" ref="oauth2VerifyBiz"/>  -->  
<!--<property name="oauth2CacheBiz" ref="oauth2CacheBiz"/>  -->  
 <!-- <property name="oauth2ErrorUtil" ref="oauth2ErrorUtil"/> -->  
<!-- <property name="licenseClient" ref="licenseClient"/> -->  
<property name="subjectDn" value="${subject.dn}"/>  
<property name="timeInterval" value="${time.Interval}"/>  
<property name="caDir" value="${ca.dir}"/>  
<property name="samsungCaCert" value="${samsungca.cert}"/>  
<property name="codeSignCert" value="${codesign.cert}"/>  
<property name="codeSignCertp12" value="${codesign.cert.p12}"/>  
<property name="privateKeyPwd" value="${privateKey.pwd}"/>  
<property name="keyStoreEntryAlias" value="${key.store.entry.alias}"/>  
</bean>  
==============================================================================================================

- 지라(MSC-JIRA) 이슈 등록 
1. 메인(http://10.254.218.34:8080/secure/Dashboard.jspa) > Create Issue > Create Issue(새창) 
2. assingnee(담당자): 노명석, Watch(참조자): 정태미 수석, 이동하 부장 
==============================================================================================================

1. 땡처리 닷컴: http://www.072.com ===> *@*.*/s*j**8*1 
 1) 서울, 하노이 왕복 항공요금(베트남항공): 465,000원(TAX불포함) ==> 8~90만원 예상 
==============================================================================================================
    
- 결혼 준비 @@@@ 
1. 집(아파트) 
 1) 풍림삼각산 아이원(서울 강북구 미아동 1357-3): 2억 9천 만원 
 2) SK북한산시티(서울시 강북구 미아동 1353)(81.43㎡: 24평): 23,500 만원 
 http://realestate.daum.net/popup/maemul/detail/print.daum 
2. 자동차 
 1) 아반떼 중고차(1,500만원) 
3. 혼수 
 1) 냉장고, TV, 침대, 장롱, 쇼파, 에어컨 
 http://cafe.naver.com/prettyjinnam/64408 
 http://blog.naver.com/lti50?Redirect=Log&logNo=130139223810 
 2) 한경희 스팀청소기, 토스터기 ==> 집들이 선물로 받을 것(나눔동기회, 창맥동기회, 신사조기회) 
-------------------------------------------------------------------------------------------------------- 

- 총 자산 
1. 총 예금액: 126,914,154원 
2. 남권형 대여금: 30,000,000원 
3. 전세금: 55,000,000원 
==> 총합: 211,914,154원(국제결혼 잔금: 500만원 제외됨) 
-------------------------------------------------------------------------------------------------------- 

- 보유 중인 보험명 
1. MET 종신 보험: 6,370,360원 
2. PCA 변액 보험: 21,900,000원 
3. 대생 연금 보험: 16,400,000원 
==> 총 보험금: 44,670,360원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.12(목) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 

- IOSP(/oauth2) Prj
- CR 2차 소스 수정 
1. 소스 점검 및 테스트 
==============================================================================================================

- 파워포인트로 캡처하는 방법 
1. 슬라이드 쇼(클릭) > 윈도누 키(클릭) > 모든 프로그램 --> SnagIt 7(캡쳐도구)(클릭) > 화면 캡처 > Save As(클릭) 
> test.jpg(파일 형식으로 변환)(저장(S)) 
==============================================================================================================

- 베트남어 
1. 친척: 뚜엉 도이 ==> 이 사람들은 친척 입니다.(눙 응어이 나이 라 뚜엉 도이.) 
2. 남동생: 안 엠 짜이 ==> 이 사람은 남동생 입니다.(응어이 나이 라 안 엠.) 
3. 누나: 반퐁 ==> 이 사람은 누나 입니다.(응어이 나이 라 안 엠.) 
4. 축하합니다.(씬, 쯔윽 므엉) 
==============================================================================================================

- 한국 노래 
1. 노사연의 - 만남(http://blog.naver.com/kukakzzang?Redirect=Log&logNo=120162598121)  
2. 이선희 - J 에게  
3. 이상우 - 그녀를 만나기 100m전 
변진섭 - 너에게로 또다시(1989年) 
이문세 - 옛사랑 
박효신 - 보고싶다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.13(금) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. 소스 점검 및 테스트 
==============================================================================================================

- try-catch-finally문 설명 
public class Test{ 
public static String output=""; 

public static void foo(int i) { 
	try { 
		if(i==1) {  // 1이면 에러 처리 
			throw new Exception(); 
		} 
			output+="1"; 

		} catch(Exception e) { 
			output += "2"; 
			return; 

		} finally {  //무조건 수행 
			output += "3"; 
		} 
		output += "4"; 
	} 

	public static void main(String args[]) { 
		foo(0);  //1번 수행 
		foo(1); //2번 수행 
	}  
} 
-------------------------------------------------------------------------------------------------------- 

결과값: 13423 

1, foo(0) 은 i==1이 아니므로 output에 1을 붙입니다. exception 상황이 아니므로 catch는 실행되지 않고  
무조건 수행되어야 하는 finally가 수행되어 3이 붙여지고 정상 수행이므로 이후 구문이 모두 수행됩니다.  
마지막 구문인 4가 붙여집니다. output= "134"; 
2. foo(1) 은 i==1 이므로 exception을 발생시킵니다. exception 상황이므로 catch가 실행됩니다.  
따라서 output에 2가 붙여집니다. 무조건 수행되어야 하는 finally만 수행되어 3이 붙여지고 종료합니다.  
output= "13423";  
==============================================================================================================

- 대구, 선희누나 만남 @@@@ 
18:10 퇴근 
19:00 공덕역(대규 만남) 
19:20 치킨집(공덕역 9번 출구) 
19:40 선희누나 합류(주제: 베트남 국제결혼 이야기) 
21:30 선희누나 먼저 감 
22:10 종료(내가 쏨: 52,000원) 
23:10 귀가 
23:30 취침 
==============================================================================================================

- BUX 세미나 
1. 일시: 2012.07.18(수) 13:30 ~ 17:20 
2, 장소: 데브멘토 캠퍼스(역삼역 6번 출구): 서울시 강남구 역삼동 640-13 
3. 제목: 스마트 시대의 비즈니스 혁신을 위한 성공 키워드, BUX  
http://www.devmento.co.kr/devmain/seminar/edumento_detail.jsp?main_id=&dataSeq=157 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.14(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:30 기상 
06:00 신봉천 주유소(태훈이형 차) 
06:30 신구초등학교 
06:40 조기축구(4:2 승): 1골 1AS ==> 태훈형에게 나이키 축구화 선물 받음 
07:40 종료 
08:00 조식(화정식당: 영석 형이 쏨) 
10:00 종료 
10:30 귀가  
10:20 집 출발 
10:30 낮잠  
16:00 기상 
16:30 베트남어 공부(가장 쉬운 베트남어 첫걸음: DVD) 
20:00 석식 
22:00 루이앤(부인)과 화상 통화 
22:00 허우(루이앤 친척 언니: 의정부시에 살고 있음)과 화상 통화 
23:00 베트남어 공부(가장 쉬운 베트남어 첫걸음: DVD) 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.15(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
06:00 기상 
06:35 신봉천 주유소(태훈이형 차) 
07:00 신구초등학교 
07:30 숏게임(3:2 승): 비 많이 옴 
09:30 게임(6:3 패) 
10:30 종료  
10:40 삼겹살 파티(학교 운동장) 
13:30 종료  
14:00 귀가(태훈이형 차) 
14:30 낮잠 
18:30 기상 
18:40 베트남어 공부(가장 쉬운 베트남어 첫걸음: DVD) 
20:00 석식 
22:00 루이앤(부인)과 통화 
23:00 베트남어 공부(가장 쉬운 베트남어 첫걸음: DVD): 1번 다 들음 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.16(월) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. 소스 점검 및 테스트 
==============================================================================================================

- auth1.0 인수인계 
1. 부분: auth1.0 > IDM(com.samsungosp.sf.idm.service) 
2. 인수자: 이선미 과장 
3. 기간: 07.19(목) ~ 20(금) 
4. 기타: ISOP Proj 12월까지 연장 될 수도 있다고 함 
==============================================================================================================

- 부동산 @@@@ 
1. 집(아파트) 
 1) 강북구 아파트 매매 
 http://land.naver.com/article/divisionInfo.nhn?rletTypeCd=A01&tradeTypeCd=A1&hscpTypeCd=&cortarNo=1130500000
 &articleOrderCode=3&cpId=&minPrc=&maxPrc=&minWrrnt=&maxWrrnt=&minLease=&maxLease=&minSpc=&maxSpc=
 &subDist=&mviDate=&hsehCnt=&rltrId=&mnex=&location=661 
 2) SK북한산시티(서울시 강북구 미아동 1353) 
http://realestate.daum.net/maemul/danji/8611/A1A3A4/*/maemullist?nil_profile=estatetop&nil_left=danji#t:DanjiMaemulList&c:A1A3A4&s:S 
 3) 풍림삼각산 아이원(서울 강북구 미아동 1357-3) 
 http://realestate.daum.net/maemul/danji/9487/A1A3A4/*/maemullist#t:DanjiMaemulList&c:A1A3A4&s:S 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.17(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. 소스 점검 및 테스트 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2012.07.18(수) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 19:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. 소스 점검 및 테스트 
==============================================================================================================

- BUX 세미나 
1. 일시: 2012.07.18(수) 13:30 ~ 17:20 
2, 장소: 데브멘토 캠퍼스(역삼역 6번 출구): 서울시 강남구 역삼동 640-13 
3. 제목: 스마트 시대의 비즈니스 혁신을 위한 성공 키워드, BUX  
http://www.devmento.co.kr/devmain/seminar/edumento_detail.jsp?main_id=&dataSeq=157 
4. 평가: 동영상 시청, 전체적으로 원론적인 수준(마음에 안듬) 
==============================================================================================================

- 안드로이드 어플 설치(휴대폰용) 
1. MX 플레이어(비디오) 
2. NGR Player(오디오) 
3. QuickPic(이미지) 
4. 야후 메신저(무료 화상통화) 
5. OTO무료통화(국제전화 국내요금 적용) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.19(목) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 20:10 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. CR 2차, 3차 수정 부분 지라에 등록(http://10.254.218.34:8080/browse/IOSP-146) 
==============================================================================================================

- auth2 정의 
1. 약관 체크 및 동의 
cc, mcc, tnc_type_code, privacy_accepted 
2. 이메일 검증 
check_email_validation 
3. 필수값 체크 
check_mandatory, country, appId, langCode 
4. 3rd Party disclaimer ==> 사용 안함 
appId, disclaimer(3rd Party(협력사 구분) 동의 여부) 
==============================================================================================================

1. stub-iosp-client로 createUser API 호출하여 SF Login ID(username) 생성 
/stub-iosp-client-sample/src/com/samsungosp/client/profile/ProfilePrf2lient.java 파일에서 @@@@  
public class ProfilePrfClient {   
	private static final String PRD_STG1_SERVER = "http:	//eu.auth.samsungosp.net/auth";   // STG1 서버 URL(Auth IOSP URL) 
	private static UserServiceResourceClient profileClient  = new UserServiceResourceClient(PRD_STG1_SERVER);    //서버 세팅 

	public static void main(String[] args) { 
		System.setProperty("osp.consumer.type", "internal");	//이게 없으면 This service requires a login. 에러발생 
		try 
		{      
			//1.createUser 처음 createUser작업을 한후 response값중 userId와 loginId를 위의 변수에 직접 바인팅하시고 
			// 2번 작업을 하시면 됩니다. 
			//이 API는 삼성에서 제공하는 서비스를 이용하기 위하여 Samsung Account를 생성한다.  
		inicreateUser();  
	} 
} 

/****************************************************************** 
* Profile2.0 createUser Trasaction 
*****************************************************************/ 
public static void inicreateUser() throws Exception {  
String l_osp_appId  = "t70f55z2q1";   //appId  ===> TEST 
String l_osp_userId = "z8oa0aj1dz";        
setProfileHeader(profileClient, l_osp_userId,l_osp_appId);  

UserCreateVO requestVo = new UserCreateVO();  
UserBaseVO  userBaseVO = new UserBaseVO();          

// 공통 코드 세팅 @@@@@@ 
userBaseVO.setUserName("Samsung Useral"); 
userBaseVO.setUserTypeCode("1"); 
userBaseVO.setUserStatusCode("1"); 
userBaseVO.setUserDisplayName("Sam"); 
userBaseVO.setUserLocalTimezoneCode("TZ0069"); 
userBaseVO.setLanguageCode("ENG"); 
 //userBaseVO.setCountryCode("USA"); 
userBaseVO.setCountryCode("GBR"); //국가코드(KOR:한국, US:미국, GBR:영국, FRA:프랑스)  ===> 임의 수정 

 userBaseVO.setUserBaseIndividualVO(userBaseIndividualVO);     

UserIdentificationVO userIdentificationVO = new UserIdentificationVO(); 

String strLoginId = "@mail.com";  //randomLoginId(userID)  ===> 임의 수정 ====> 
userIdentificationVO.setLoginID(strLoginId);  //randomLoginId(userID)  ===> 임의 수정 
/userIdentificationVO.setLoginID(randomLoginId());  //randomLoginId(userID)  
userIdentificationVO.setLoginIDTypeCode("003"); 
userIdentificationVO.setUserPassword("osp123"); 

requestVo.setUserBaseVO(userBaseVO);  // User Base VO 처리 
requestVo.setUserIdentificationVO(userIdentificationVO);    // UserIdentity 생성(서비스별 회원정보 저장) VO 처리 

StringVO ret = profileClient.createUser(requestVo);  

createUserId = ret.getValue();  
System.out.println("[createUser()] [strLoginId(임의 수정ID)]"+ strLoginId  +"[loginID(SF Login ID)]"+ strLoginId +"[createUserId]"+ createUserId  ); 

new XStream().toXML(ret, System.out); 
System.out.println("\n==========response End======================================"); 

//전역변수 
setTempUserId(ret.getValue()); 
} 
} 
-------------------------------------------------------------------------------------------------------- 

결과: 
[/stub-iosp-client-sample] [main()] ==> [test] [profileClient]com.samsungosp.profile.user.service.UserServiceResourceClient@e5b723 
===========// 1. inicreateUser Flow  // @@@@@@@@@ //==============>  
[inicreateUser()] ===========// 1. createUser Flow  // @@@@@@@@@ //==============>  
[inicreateUser()] [ret]null 
[inicreateUser()] [createUserId]null[loginID(SF Login ID)]*@*.* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.20(금) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 20:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. 소스 수정 
==============================================================================================================

- auth1.0 인수인계(완료) 
1. 부분: auth1.0 > IDM(com.samsungosp.sf.idm.service) 
2. 인수자: 이선미 과장 
3. 기간: 07.20(금) 
4. 기타: ISOP Proj 12월까지 연장 될 수도 있다고 함 
==============================================================================================================

- 신부집 중고 컴퓨터(국제결혼)(추가 비용)  
1. 기업은행(070-7390-0), 오병출(금성 부산: 010-3840-0): 116,000원 송금 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.21(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

06:30 기상 
07:10 성현동 작은 도서관(열람실 9시에 연다고 함) 
07:30 글빛 도서관(전기 사용 안됨) 
07:40 베트남어 공부(가장 쉬운 베트남어 첫걸음: DVD) 
19:20 종료 
19:30 3단, 2단 액자 구매  
20:00 귀가   
20:10 석식 
21:30 루이앤(부인)과 화상 통화(루이엔집 컴퓨터 설치: 2주 걸림) 
22:30 종료  
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.22(일) 작업 ■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:00 

▦조기축구
06:00 기상 
06:35 신봉천 주유소(태훈이형 차) 
07:00 신구초등학교 
07:30 숏게임(3:2 패): 비 많이 옴 
09:30 게임(6:3 패) 
10:40 종료  
11:10 문경세제(오고문님이 쏨) 
12:30 종료  
13:00 귀가(태훈이형 차) 
13:30 낮잠 
16:30 기상 
20:00 석식 
21:00 루이앤(부인)과 화상 통화 
22:30 종료  
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.23(월) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. IOSP-150 --> 작업 완료 
2. IOSP-151 --> 작업 완료 
3. IOSP-152 --> 작업 완료 
 1) OSPException에 Fault Code {} 값 설정 
throw new OSPException(Constants.BAD_REQUEST, "AUT_1084", MessageUtil.getMessage("AUTH.AUT_1084.400",  
new Object[] {Oauth2LibConstants.PARAM_ACCESS_TOKEN}), this.getClass().getName());   
//AUTH.AUT_1084.400=The value of {0} parameter is invalid. 
4. IOSP-153 --> 작업 완료 
==============================================================================================================

- 휴대폰 고장(옵티머스 빅) 
1. 점심시간에 LG전자 강남CYON서비스센터에 맞기고 옴(퇴근 후(18시 30분)에 찾으러 감) 
 1) 다이얼버튼에서 ##10306##을 누르면 자기번호(010-3072-0)가 안뜸 
 2) 단말기 S/W 고장으로 추정됨 
2. 원인: 단말기 내부 안테나 연결 부분이 빠졌다고 함 
3. 해외로밍: CMDA이기 때문에 자동 로밍 안됨(114 서비스로 신청할 수 있음) 
==============================================================================================================

- 이마트 장보기(이마트 구로점) 
1. 세면도구(베트남 방문용) 
2. 치약 
3. 결혼 사진 현상(47장, 장당 300원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.24(화) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 20:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. CR Tester 이지훈 연구원 Sinle e-mail(@partner.samsung.com) 메일 재발송 
==============================================================================================================

- 네이버 회원가입(진태규/루이엔) 
1. 유선(054-242-0) 인증 
2. 진태규(730625-10): 루이엔에게 만들어 줄 것 
3. tamaluyen/lulu1234 
==============================================================================================================

- 플래시 클럽(flash 공부) 
http://flashclub.co.kr 
==============================================================================================================

- 갤럭시 탭 
http://shopping.naver.com/detail/detail.nhn?cat_id=40002434&nv_mid=6491060187&frm=NVSCMOD&query=%EA%B5%AC%EA%B8%80%20%EB%84%A5%EC%84%9C%EC%8A%A47 

- Google 구글 Nexus 7(태블릿) 
http://shopping.naver.com/detail/detail.nhn?cat_id=40002434&nv_mid=6491060187&frm=NVSCMOD&query= 
1. 16G 38만원선 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.25(수) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. IOSP-149 --> 작업 완료  
2. IOSP-153 --> 작업 완료 
==============================================================================================================

- [IOSP account팀 회식)] 
1. 일시: 07.25(수) 19시 
2. 장소: 강남역 4번 출구(구오리: 02-597-5292, 서울 강남구 역삼동 831-19) 
3. 참석자: 이강현 책임, 나대균 책임, 김세중 사원 등 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.26(목) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 20:00 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정 
1. Resolve Issue  처리 
==============================================================================================================

- 카톡 보이스톡 
http://blog.naver.com/bsh5141?Redirect=Log&logNo=40160712601 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.27(금) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 18:10 

- IOSP(/oauth2) Prj
- CR 3차 소스 수정  
==============================================================================================================

- mysingle ID 신청 
1. 진태만 고유코드: C60WA967 
2. http://www.samsung.net에서 신규가입 신청 
3. http://www.samsung.net/portalWeb/default.jsp ==> tamario.jin/s*j**8*1, E-MAIL: @samsung.com 
==============================================================================================================

18:30 퇴근 
19:10 신용산역(발권 잘못 해서 Desk가서 재발권: 자동화기 보다 천원 더 들어감) 
19:28 무궁화호 탑승 
21:00 루이엔(부인)과 기차안에서 간단하게 화상 통화 
00:20 여천역 ==> 2012.07.28(월) @@@@ 
00:30 택시가 안 잡혀서 걸어감 
01:00 작은 누나집(남 여수시 학동 54 신동아파밀리에APT 107동 405호) 도착 
        - 어머니, 큰누나, 조차 령경 도착해서 있음(신부 선물 전달 및 사진, 앨범 보여줌) 
02:00 은아 컴퓨터에 야후, 웹캠 설치 
        - 누나 조언(APT: 남향, 동쪽을 가리면 안됨, 머리 스타일: 상고 머리) 
03:00 취침  
09:00 기상 
09:30 조식 
14:00 누나집 출발(큰누나 차) 
14:40 오리 고기집(작은 누나가 쏨) 
16:30 종료 
17:00 옹기 주차장에 차 세움 
17:30 셔틀버스 탑승 
18:00 입장(저녁 입장권: 만원): 큰누나가 쏨 
19:30 LG관 입장(1시간 반 기다림)(선크림 동나서 못 받음) 
20:00 네이버관 입장(부채 받음) 
20:30 전광관 TV시청(큰누나, 작은누나 비 공연 보러 감) 
22:30 버스 타러 감 
23:50 버스 탑승 
00:30 버스 귀가  ==> 2012.07.29(일) @@@@ 
00:30 루이엔(부인)과 가족 화상 통화(가족들이 모두 좋아함) 
02:00 취침 
09:00 기상 
09:30 조식 
17:00 석식 
17:50 집출발(은아, 령경에서 용돈 5만원씩 줌) 
18:20 여천역 도착 
18:38 무궁화호 탑승 
21:00 루이엔(부인)과 기차안에서 간단하게 화상 통화 
23:32 용산역 도착 
23:45 506번 버스 탑승 
00:10 귀가 
00:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.30(월) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 18:10 --> 루이엔(신부) 선물 T-shirts 금성부산님이 부산에서 택배로 도착 

- IOSP(/oauth2) Prj
- OSP1.0 SF API 수정건(auth 10. 운영 오민철 차장) 
1. 이메일 인증 필요여부 조회  
회원가입시 DB에 등록된 TCSO_PRTY.EMAIL_VLD_CHK=Y 이면서, 
회원이 이메일인증을 하지 않은 상태(LDAP emailvldynfg=N)이면 requireEmailValidation=Y 를 리턴해줌 
cf. 기존 2012-01-19이후 가입자면서, WEB가입자 체크는 삭제.  
2. getUserProfile(/sf/IDM)  
==============================================================================================================

- SK A/S 센터 
1. SK텔레콤 강남AS센터거리( 02-1544-0110), 서울시 강남구 역삼동 825-13 강남센터빌딩 5층 
2. 야후 메신저 화상통화 화면 꺼구로 보이는 문제 
==============================================================================================================

- 대규집(길음 뉴타운 4단지) 
1. 서울 성북구 길음동 1281(길음로 118)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.07.31(화) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 20:10 

- IOSP(/oauth2) Prj
- OSP1.0 SF API 수정건 
1. 이메일 인증 필요여부 조회 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■