

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2012.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2012.10.01(월) 작업 ■■■■■■■■■■■■■■■
---> 07:50 ~ 16:00  

- 4일차: 10.01(월) @@@@@@@@@@  
08:00 기상  
08:10 조식(쌀국수집) ==> 원석씨가 쏨  
09:00 집 도착  
09:10 택시 도착  
09:20 도선 출발(처남, 루이엔, 토와, 원석씨 부부)  
13:30 중식(홍씨 집): 도선 근처(원석씨 한국서 가지고 온 무선 공유기로 와이파이 연결)  
--> 아이패드에 게임 추가  
16:00 도선 방문(사진찍기)  
17:30 홍 부부 집에 바래다 줌  
19:30 석식(비빕쌀국수, 죽)  
19:30 집도착(택시비130만동[70,389원])  
21:00 취침(S)  
==============================================================================================================

- 5일차: 10.02(화) @@@@@@@@@@  
07:00 기상(S)  
07:10 조식(빵)  
09:10 허우씨집 방문(짜파게티 선물로 받음): 딸(세라), 아들(임신 중)  
11:30 루이엔 외가집 방문(과일)  
12:30 중식  
14:30 낮잠(S): 루이엔 S에 빠져듬  
13:30 루이엔 컴퓨터에 무선 공유기 설치(40동[21,658원], 한글 폰트 설치(A/S 기사 방문)  
17:00 능집 방문  
18:00 석식  
21:00 취침  
==============================================================================================================

- 6일차: 10.03(수) @@@@@@@@@@  
07:00 기상(S)  
07:10 조식(빵)  
09:10 하이퐁 시내 마트 쇼핑(장인, 처남 둘, 허우씨, 허우4촌, 허우 친구)  
---> 루이엔 헬멧, 큰처남 구두, 장인 시계 선물  
12:30 중식  
16:00 휴식  
17:20 석식(짐 정리)  
18:20 하이퐁 처가 출발(택시, 처남 둘, 루이엔): 루이엔에게 200불 선물  
21:30 하노이 공항 도착  
21:50 베트남 항공 수하물 체크인(25.6kg[20kg까지 가능]) ==> 전자항공권 발행 확인서 보여주고 진짜 티켓 받음  
22:00 출국심사 심사  
22:15 보안검사(보딩패스 받음)  
22:20 아시아나(22:50)항공 탑승 6번 출구에서 원석씨 만남  
23:20 베트남항공 VN416 탑승  
23:40 베트남항공 출발  
24:10 좌석 뒤로 안 재처져 승무원에게 항의(옆사람에게 자리 양보 받음) ==>2012.10.04(목)  
05:40 인천 공항 도착  
05:50 자동출국심사  
06:00 짐 찾기  
06:20 공항버스 탑승(6003번 버스)  
08:40 귀가  
09:30 출근  
==> 300불 가지고 가서 270불 사용(30뷸 가지고 옴)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.04(목) 작업 ■■■■■■■■■■■■■■■
---> 09:30 ~ 18:00 ==> 처가 방문 후 한국 입국(6시)  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.05(금) 작업 ■■■■■■■■■■■■■■■
---> 06:55 ~ 19:00  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST  
ping cn.auth.samsungosp.com  
ping cn.api.samsungosp.net  

01. AuthService-createAccessToken  
username:${createUser#Request#//UserCreateVO[1]/userIdentificationVO[1]/loginID[1]}  
--> loginID: *@*.*  

03. AuthService-createUserAuthToken  
username: ${#TestSuite#username}  
1. TestSuite > Test Properties에서  
username: *@*.* --> username: *@*.*로 변경  
--------------------------------------------------------------------------------------------------------  

- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
==> 정상  

02. AuthService-createAuthorizationCode  
1. createAuthorizationCode_200_06 ==> deleteUser  
1) error: USR_3116, Only user who withdraws all application services can withdraw the account.  

03. AuthService-createUserAuthToken  
1. createUserAuthToken_400_09 ==> createUserAuthToken_country_code_AUT_1037_01  
1) error: UserAuthToken 정상 발행됨(AUT_1037 발생해야 됨)  
2. createUserAuthToken_400_10 ==> createUserAuthToken_mobile_country_code_AUT_1037_01  
1) error: UserAuthToken 정상 발행됨(AUT_1037 발생해야 됨)  

3. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03  
1) error: UserAuthToken 정상 발행됨(username: ${#TestSuite#username})(AUT_1038 발생해야 됨)  
--> Service is not available in your country.(Cannot get the terms and condition content.) DB 조회를 하면  
최근 약관 동의가 존재하여 정상 조회가 안 됨 ==> AUT_1038 에러 발생  
AUTH.AUT_1038.400=Did not agree the latest terms and conditions.  
check_mandatory: 사용자 필수항목체크  
3)의 경우에는 check_mandatory가 Y이므로 country, appId, email, langCode 파라메터 모두 값이 있어야 하므로  
에러코드가 응답 되어야 합니다  
===> (N이면 isAcceptedRecentTNC: Y)  

4. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03  
1) error: UserAuthToken 정상 발행됨(username: ${#TestSuite#username})(AUT_1039 발생해야 됨)  
--> DB 조회를 하면 개인정보 동의 조회가 안 됨 ==> AUT_1039 에러 발생  
AUTH.AUT_1039.400=Did not agree the privacy conditions.  
===> (N이면 privacyAccepted: Y)  

5. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040(username: *@*.*)  
1) error: AUT_1008, The value of grant_type parameter must be present and have a non-empty value.  
--> DB 조회를 하면 최근 약관 동의가 존재하여 정상 조회가 안 됨 ==> AUT_1040 에러 발생  
AUTH.AUT_1040.400=Did not agree the latest terms and privacy conditions.  

6. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814(username: *@*.*)  
1) error: AUT_1804, There is no login ID.  
--> DB 조회를 이메일 인증 검증 조회가 안 됨 ==> AUT_1814 에러 발생  
AUTH.AUT_1814.400=The check_email_validation check is invalid.  
===> (N이면 check_email_validation: Y)  

7. createUserAuthToken_200_15 ==> deleteService_01  
1) error: FAILED  
8. createUserAuthToken_200_15 ==> deleteService_02  
1) error: FAILED  
9. createUserAuthToken_200_15 ==> deleteService_03  
1) error: FAILED  
10. createUserAuthToken_200_15 ==> deleteService_04  
1) error: FAILED  

04. AuthService-deauthenticate  
==> 정상  

05. AuthService-isValid  
==> 정상  

06. AuthService-revoke  
==> 정상  

07. AuthService-getSignedUserInfo  
1. getSignedUserInfo_200_01 ==> getSignedUserInfo  
1) error: AUT_5082, signature generation was failed.  
2. getSignedUserInfo_400_02 ==>getSignedUserInfo_client_id_AUT_1086_05  
1) error: AUT_1084, The value of access_token parameter is invalid.  
3. getSignedUserInfo_400_02 ==>getSignedUserInfo_client_id_AUT_1086_06  
1) error: AUT_1084, The value of access_token parameter is invalid.  

08. AuthService-getSignedConfirmationInfo  
1. getSignedConfirmationInfo_200_01 ==> getSignedConfirmationInfo  
1) error: AUT_5082, signature generation was failed.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.06(토) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~18:00  

05:30 기상  
06:10 신봉천 주유소(태훈이형 차)  
06:30 신구초등학교  
06:50 숏게임(2:1 패): 수인이형 슛에 맞아 손가락 다침  
07:50 종료  
09:00 귀가  
09:10 집도착  
09:50 강남터미널  
10:10 경주행 버스 출발  
14:10 경주 고속터미널 도착(4시간 걸림)  
15:10 누나차(동대교 앞)  
15:20 중식  
15:30 누나집(LG070 무선 공유기 확인)  
16:40 USB 무선 네트워크 구입(2만원)  
18:00 LG070 무선 공유기 설정(00 LG070_JIN/1231231213a)  
18:30 석식  
21:00 포항집(베트남 선물: 햄, 오징어, 과자, 커피)  
23:40 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.07(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

09:40 기상  
10:10 주남이형집(두산 제니스 30005호)  
10:30 PC에 XP 설치  
01. 네트워크: realtek RTL8168B  
02. 오디오: realtek High Definition Audio  
03. 비디오: Intel(R) G33/31 Express Chipset Family  
12:00 중식  
14:00 종료(유진에게 용돈 만원 줌)  
14:30 귀가  
15:30 석식  
16:10 집출발  
16:40 포항 고속버스 터미널  
17:00 포항 출발  
21:20 강남터미널  
21:50 귀가  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.08(월) 작업 ■■■■■■■■■■■■■■■
---> 06:50 ~ 20:00  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST  
==============================================================================================================

- 혼인여건인증서 받아야 할 서류[2012.10.08(월)] ==> 가원 사무실(인천)으로 우편발송할 것  
1. 영문 등본  
2. 여권 원본  
3. 공무원 채용건강진단서(에이즈, 성병, 정신질환 포함)[한글 1통, 영문 1통]  
0) E2,E9,E10,H2 법무부 지정의료기관 현황(12.9.7업데이트): http://imjdy.blog.me/70144615040  
1) 강남고려병원(서울 관악구 봉천동 36-83), T: 877-5533, 08:30 ~ 10:00 ==> 80,000원(현금 지불)  
2) 국립의료원(서울시 중구 을지로 245), T:2260-7432, 동대문역사문화공원역 13번 출구, 13:30 ~ 15:00 ==> 47,000원  
3) 보라매병원(서울 동작구 신대방동 425), T:870-3333, https://www.brmh.org (안됨)  
4) 가톨릭대학교 서울성모병원(서울 서초구 반포동 505), T: 2258-1870 ==> 70,000원 예상  
5) 연세대학교 의과대학 강남세브란스병원: 1599-6114 ==> 75,000원  
4. 결과: 다음부터는 국립의료원에서 신체검사 받을 것  
==============================================================================================================

- LG갤럭시S2 중고폰 구입  
1. LG 갤럭시 2 팝니다 12만원 A급(*): 수유역 6번 출구 --> 마을버스(4번): 애견샵  
1) 수유역 6번 출구 ==> 동익아파트 하차(도봉04번) 해서 전화  
2) LG U+ 온라인 기기 변경(http://www.uplus.co.kr/css/mncc/mnch/ReqPhoneChgTadvGuid.hpi?mid=2325)  
==============================================================================================================

- LG 갤럭시S2(SHW-M250L) 휴대폰 사양  
1. CPU: Samsung Exynos 4210 Processer(1.2Ghz Dual-core)  
2. RAM: 1GB  
3. OS: Google Android 2.3.3 (Gingerbread, 진저브레드)  
4. 크기: 66.1 x 125.3 x 9.4(mm)  
5. 무게: 116g  
6. 내장메모리: 16GB (13.7GB 사용가능)  
7. 외장메모리: MicroSD, MicroSDHC, TransFlash(최대 32GB)  
8. 배터리: 1650mAh  
9. 카메라: 전면 200만 화소 (2M), 후면800만 화소 (8M), 1080p 비디오 녹화  
10. 디스플레이: 4.3인치 Super AMOLED+ Display  
11. 해상도: 800x400 (WVGA)  
12. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등  
==============================================================================================================

- LG 갤럭시S2(SHW-M250L) 중고폰 정보(LG U+ 대리점에 가서 기기변통 개통함)  
1. 모델명: SHW-M250L  
2. S/N: R18B458049  
3. 일련번호: 016902  
4. 제조년월: 2011.04.27  
5. 휴대폰 비밀번호: mmm*  
6. 삼성계정 등록: *@*.*/ta**3*9  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.09(화) 작업 ■■■■■■■■■■■■■■■2022-08-31
---> 09:20 ~ 19:00 --> 채용건강진단(강남고려병원[봉천동], 8만원, 결과 1주일 걸림) 검사 받음  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
1. Auth (총 12/78 건 조치중)  
: 200 관련 TC 4/33 건 Fail 조치 중  
: 400 관련 TC 8/45 건 Fail 조치 중  
--------------------------------------------------------------------------------------------------------  

- 95. [메인] OSP 2_CN_IDC  
1. 109.10.162.143, auth/!iosp0000  
2. log 보기  
1) tail -f /home01/osp2/comp/auth/logs/system.log  
==============================================================================================================

- 채용건강진단  
1. 키: 170cm  
2. 몸무게: 75kg
3. 시력: 1.2(양쪽)  
4. 혈압: 130/80  
5. 결과 찾기: 결과 1주일 후(10월 16일(화) 8시에 찾으러감(영문, 한글 1통씩 찾을 것)  
==============================================================================================================

- LG 갤럭시S2(SHW-M250L) 중고폰 정보(LG U+ 대리점에 가서 기기변통 개통함)  
1. 모델명: SHW-M250L  
2. S/N: R18B458049  
3. 휴대폰 비밀번호: mmm*  
5. 삼성계정 등록: *@*.*/ta**3*9  
--------------------------------------------------------------------------------------------------------  

- LG 갤럭시S2(SHW-M250L) 휴대폰 사양  
1. CPU: Samsung Exynos 4210 Processer(1.2Ghz Dual-core)  
2. RAM: 1GB  
3. OS: Google Android 2.3.3 (Gingerbread, 진저브레드)  
4. 크기: 66.1 x 125.3 x 9.4(mm)  
5. 무게: 116g  
6. 내장메모리: 16GB (13.7GB 사용가능)  
7. 외장메모리: MicroSD, MicroSDHC, TransFlash(최대 32GB)  
8. 배터리: 1650mAh  
9. 카메라: 전면 200만 화소 (2M), 후면800만 화소 (8M), 1080p 비디오 녹화  
10. 디스플레이: 4.3인치 Super AMOLED+ Display  
11. 해상도: 800x400 (WVGA)  
12. 기타: GPS, WIFI, 영상통화, WIFI 다이렉트, DLNA, 블루투스 3.0, 2011년 5월 출시 등  
==============================================================================================================

- LG 갤럭시S2 업그레이드  
1.구글 안드로이드 운영체제 4.0 ICS(아이스크림 샌드위치) 업그레이드  
Kies 2.0 프로그램: http://www.samsung.com/sec/sppt/pcApplication.do  
2. 방법  
1) Kies 2.0 프로그램 > 도구 > 펌웨어 업그레이드 및 초기화(클릭)  
가. 기본 정보(메인) 설정  
펌웨어 정보  
현재 펌웨어 버전: PDA:EL21 / PHONE:EJ30  
최신 펌웨어 버전: PDA:UG28 / PHONE:UC21  
나. 설치 완료 확인 ==> 휴대폰 > 휴대폰 정보 > 안드로이드 정보: 4.0.4  
http://aneshim.blog.me/10134178049  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.10(수) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 20:00  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

- create User 생성 요청  
1. AUT_1038 에러 발생 User ID(최신 약관 동의 여부 검증)  
1) countryCode: KOR, tncAccepted:N, PrivacyAccepted: N  
2. AUT_1039 에러 발생 User ID(최신 약관 동의 여부 검증)  
1) countryCode: US, privacyAccepted: Y  
3. AUT_1040 에러 발생 User IDD(최신 약관 동의 여부 검증)  
1) countryCode: KOR, tncAccepted:Y, PrivacyAccepted: Y  
4. AUT_1814 에러 발생 User ID(이메일 인증 검증)  
1) check_email_validation: Y  
==============================================================================================================

- 91. [메인] PRD(cniosppro01)[OSP 2](4004) 연결  
1. 109.10.162.143, tamario.jin/s*jt*8*1  
2. log 보기  
1) tail -f /home01/osp2/comp/auth/logs/system.log  
3. CN IDC OSP 2.0 DB 연결(Hub 설정)  
109.10.164.151:1521 --> 4004 ==> Service Name: CNIOSP, wprf / #wprf789#!  
---------------------------------------------------------------------------------------  

99. [메인] CN_IDC[OSP 2](4005) 연결  
1. 109.10.162.143, auth/!iosp0000  
2. log 보기  
1) tail -f /home01/osp2/comp/auth/logs/system.log  
3. CN IDC OSP 2.0 DB 연결(Hub 설정)  
109.10.164.151:1521 --> 4005 ==> Service Name: CNIOSP, wprf / #wprf789#!  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.11(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:30  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
1. Auth (총 4/78 건 조치중)  
: 200 관련 TC 0/33 건 Fail 조치 중  
: 400 관련 TC 4/45 건 Fail 조치 중  
--------------------------------------------------------------------------------------------------------  

- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
==> 정상  

02. AuthService-createAuthorizationCode  
1. createAuthorizationCode_200_06 ==> deleteUser ==> 제외(사용 안함)  
1) error: USR_3116, Only user who withdraws all application services can withdraw the account.  

03. AuthService-createUserAuthToken  
1. createUserAuthToken_400_09 ==> createUserAuthToken_country_code_AUT_1037_01 ==> 제외(사용 안함)  
1) error: UserAuthToken 정상 발행됨(AUT_1037 발생해야 됨)  
2. createUserAuthToken_400_10 ==> createUserAuthToken_mobile_country_code_AUT_1037_01 ==> 제외(사용 안함)  
1) error: UserAuthToken 정상 발행됨(AUT_1037 발생해야 됨)  

3. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03  
1) error: UserAuthToken 정상 발행됨(username: ${#TestSuite#username})(AUT_1038 발생해야 됨)  
--> Service is not available in your country.(Cannot get the terms and condition content.) DB 조회를 하면  
최근 약관 동의가 존재하여 정상 조회가 안 됨 ==> AUT_1038 에러 발생  
AUTH.AUT_1038.400=Did not agree the latest terms and conditions.  
check_mandatory: 사용자 필수항목체크  
3)의 경우에는 check_mandatory가 Y이므로 country, appId, email, langCode 파라메터 모두 값이 있어야 하므로  
에러코드가 응답 되어야 합니다  
===> countryCode: KOR, tncAccepted:N, PrivacyAccepted: N  

4. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03  
1) error: UserAuthToken 정상 발행됨(username: ${#TestSuite#username})(AUT_1039 발생해야 됨)  
--> DB 조회를 하면 개인정보 동의 조회가 안 됨 ==> AUT_1039 에러 발생  
AUTH.AUT_1039.400=Did not agree the privacy conditions.  
===> countryCode: US, privacyAccepted: Y  
3oueaqmviq, *@*.*  
jayrdphflu, *@*.* => KOR, N, Y(OK): 반대로 설정할 것  
0dvzzax2vi, *@*.* => KOR, N, N  

5. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040(username: *@*.*)  
1) error: AUT_1040, Did not agree the latest terms and privacy conditions.  
--> DB 조회를 하면 최근 약관 동의가 존재하여 정상 조회가 안 됨 ==> AUT_1040 에러 발생  
AUTH.AUT_1040.400=Did not agree the latest terms and privacy conditions.  
===> countryCode: KOR, tncAccepted:Y, PrivacyAccepted: Y  

6. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814(username: *@*.*)  
1) error: AUT_1804, There is no login ID.  
--> DB 조회를 이메일 인증 검증 조회가 안 됨 ==> AUT_1814 에러 발생  
AUTH.AUT_1814.400=The check_email_validation check is invalid.  
===> check_email_validation: Y  

7. createUserAuthToken_200_15 ==> deleteService_01 ==> 제외(사용 안함)  
1) error: FAILED  
8. createUserAuthToken_200_15 ==> deleteService_02 ==> 제외(사용 안함)  
1) error: FAILED  
9. createUserAuthToken_200_15 ==> deleteService_03 ==> 제외(사용 안함)  
1) error: FAILED  
10. createUserAuthToken_200_15 ==> deleteService_04 ==> 제외(사용 안함)  
1) error: FAILED  

04. AuthService-deauthenticate  
==> 정상  

05. AuthService-isValid  
==> 정상  

06. AuthService-revoke  
==> 정상  

07. AuthService-getSignedUserInfo ==> 제외(미주 사용용으로 개발됨: CN에서 사용 안함)  
1. getSignedUserInfo_200_01 ==> getSignedUserInfo  
1) error: AUT_5082, signature generation was failed.  
2. getSignedUserInfo_400_02 ==>getSignedUserInfo_client_id_AUT_1086_05  
1) error: AUT_1084, The value of access_token parameter is invalid.  
3. getSignedUserInfo_400_02 ==>getSignedUserInfo_client_id_AUT_1086_06  
1) error: AUT_1084, The value of access_token parameter is invalid.  

08. AuthService-getSignedConfirmationInfo ==> 제외(미주 사용용으로 개발됨: CN에서 사용 안함)  
1. getSignedConfirmationInfo_200_01 ==> getSignedConfirmationInfo  
1) error: AUT_5082, signature generation was failed.  
==============================================================================================================

-- 1. 회원 인증 정보 조회 ==> 01. countryCode: KOR, 02. tncAccepted:Y, 03. PrivacyAccepted: N  
-- AUT_1038: countryCode: KOR, tncAccepted:Y, PrivacyAccepted: N  
-- AUT_1039: countryCode: USA, tncAccepted:N, privacyAccepted: Y  
-- AUT_1040: countryCode: KOR, tncAccepted:Y, PrivacyAccepted: Y  
SELECT T1.USR_ID AS "회원ID"  
, T1.CNTY_CD AS "01_국가코드", T3.TNC_ACPT_FG AS "02_약관동의_여부", T1.PRVC_ACPT_YN_FG AS "03_개인정보동의_여부"  
, T1.EMAIL_VLD_YN_FG AS "51_ 이메일 인증_여부"  
, T3.TNC_VER_TXT AS 약관_버전 , T2.RGN_CD AS "지역 코드", T1.USR_STS_CD AS "회원 상태 코드"  
, TO_CHAR( T1.JN_DT, 'YYYY-MM-DD HH24:MI:SS') 생성일  
, T1.*, T2.*  
FROM TCSO_PRTY T1 /* 회원정보 TB */  
, TSCO_CNTY T2 /* 국가정보 TB */  
, TCSO_TNC_ACPTNC T3 /* 약관 정보 TB */  
WHERE 1 = 1  
AND T1.USR_ID = '03wdtjfodc' -- 03wdtjfodc, 03wdtjfodc, 03wdtjfodc  
AND T1.USR_STS_CD <> '9'  
AND T1.CNTY_CD = T2.CNTY_CD  
AND T1.USR_ID = T3.USR_ID  
--;  
==============================================================================================================

- 현용급여 송금  
우리은행 1002-647-002609 / 300만원  
우리은행 607-067984-18-876 / 100만원  
우리은행 328-166021-18-891 / 100만원  
1. 현용급여: 5,000,000(2012.09.28 C9 ==> 5,000,000원)  
2. 현용급여 송금: 5,000,000(2012.10.11 ==> 0원)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.12(금) 작업 ■■■■■■■■■■■■■■■
---> 06:50 ~ 19:30  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
1. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03  
2. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03 ==> 해결  
3. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040  
4. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814  
==============================================================================================================

- sql developer(Oracle DB용) 설치  
1. 버전 3.1.07 빌드 MAIN-07.42  
2. 실행: F9  
==============================================================================================================

- 집구하기  
00. SK북한산(GS 부동산): 직접 방문  
서울 강북구 미아동 1353-5, 985-7900 / *  
01. SK북한산(벽산 부동산)  
서울 강북구 미아동 1354-5, 982-3400 / *  
02. SK북한산(21C 부동산)  
서울 강북구 미아동 1354-5, 982-7500 / *  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.13(토) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~18:00  

- 집구하기: 10월 13(토) @@@@@@@@@@  
06:00 기상(알람 소리 못 들어 태훈이 전화함)  
06:40 신봉천 주유소(태훈이형 차)  
06:50 신구초등학교  
06:50 숏게임(2:3 패)  
07:40 종료  
08:00 조식(화정식당: 호성이형이 쏨)  
10:30 종료  
11:10 귀가  
12:00 중식  
13:50 집출발  
14:40 길음역 7번 출구  
14:50 서울 미아 초교  
15:00 길음뉴타운 4단지: e-편안세상(대규 만남)  
15:10 GS부동산 도착  
15:40 GS부동산 만남(SK북한산시티: 서울 강북구 미아동 1354-5, 982-0 / 010-6510-0)  
16:00 123동 502호(3억 5백 만원), 33A(동향), 확장됨 ==> 깨끗하지만 동향이라 마음에 안듬  
16:30 120동 403호(2억 4천 만원), 24A(남향), 확장 안됨 ==> 지저분하고 확장안 되어 있고 테니스장이 있어 시끄러울 것 같음  
16:40 138동 502호(3억 2천 만원), 33B(남향), 확장됨 ==> 주인이 살고 있어서 깨끗하고 남향, 시원함(지대가 높음)  
17:00 143동 701호(2억 6천 만원), 24A(남서향), 확장됨 ==> 신혼부부가 살고 있어서 깨끗하고 남향, 시원함(지대가 높음)  
17:30 롯데슈퍼(화장지, 맥주)  
17:50 대규집(e-편안세상 14 11호)  
19:00 석식(대규집)  
21:00 종료  
21:30 길음역  
22:30 귀가  
22:40 화상통화  
23:00 종료  
23:30 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.14(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

▦조기축구
06:00 기상  
06:35 신봉천 주유소(태훈이형 차)  
06:50 신구초등학교  
07:20 숏게임(2:3 패)  
08:30 게임(2:0 패)  
09:30 게임(2:0 패)  
10:30 게임(4:2 승)  
11:10 종료  
11:30 중식(갈비탕: 문경세재(각자 냄))  
12:20 종료  
13:50 귀가  
14:20 낮잠  
18:00 기상  
18:30 장보기(GS 마트)  
20:00 석식  
21:30 루이엔(부인)과 화상통화  
22:30 종료  
23:40 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.15(월) 작업 ■■■■■■■■■■■■■■■
---> 06:43 ~ 20:00  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
1. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03 ==> 해결  
01gg5uki5o, @yopmail.com => 450, X, Y(DB) --> 450, Y, N(소스)  
jayrdphflu, *@*.* => 450, O, Y(DB) --> 450, N, N(소스)  
2. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03  
lfcodguth0, *@*.* => 310, X, X(DB) --> 310, Y, N(소스)--> 한국이 아니므로 무조건: N  
3. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040  
01gg5uki5o, @yopmail.com => 450, X, N(DB) --> 450, Y, Y(소스)  
1yh1ki8yem, *@*.* => 450, X, N(DB) --> 450, Y, Y(소스)  
4. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814 ==> 해결  
01gg5uki5o, @yopmail.com => N --> Y(소스)  
1yh1ki8yem, *@*.* => N --> Y(소스)  
==============================================================================================================

- create User 생성(/IOSP_Profile파일에서)  
01. MemberService_createMember  
1. createMember_200_OK_01 ==> REST createMember  
==============================================================================================================

SELECT  
/* [userAuthDAO.xml].[com.samsungosp.auth.user.dao.UserAuthDAO.getUserTNCAcceptance].[39] 변경일자(20110426) */  
T2.TNC_VER_TXT  
, T2.TNC_ACPT_FG  
, TO_CHAR(T2.TNC_ACPT_DT,'YYYYMMDD') TNC_ACPT_DT  
, T2.TNC_ACPT_LANG_CD  
, T2.CRT_APSVC_ID  
FROM  
TCSO_PRTY T1  
, TCSO_TNC_ACPTNC T2  
, TSCO_CNTY T3  
WHERE  
T2.USR_ID = '01gg5uki5o'  
AND T2.MBL_CNTY_CD = '450'  
AND T2.TNC_VER_TXT = '1.1'  
AND T2.DEL_YN_FG = 'N'  
AND T1.USR_ID = T2.USR_ID  
AND T1.USR_STS_CD <> '9'  
AND T1.CNTY_CD = T3.CNTY_CD  
AND T3.RGN_CD = 'US'  
AND ROWNUM = 1  
--;  

SELECT  
/* [commonDAO.xml].[com.samsungosp.auth.user.dao.CommonDAO.getTNCContentByMobileCountryCode].[06] 변경일자(20111017) */  
/*+ INDEX_DESC (TSCO_TNC_CTNT TSCO_TNC_CTNT_PK) */  
LANG_CD  
, TNC_VER_TXT  
, REP_LANG_FG  
, TNC_VER_FNL_FG  
FROM TSCO_TNC_CTNT  
WHERE  
MBL_CNTY_CD = '450'  
AND REP_LANG_FG = 'Y'  
AND TNC_TP_CD ='1'  
AND TNC_VER_FNL_FG = 'Y'  
--;  

SELECT  
/* [userAuthDAO.xml].[com.samsungosp.auth.user.dao.UserAuthDAO.getUserPrivacyAcceptance].[47] 변경일자(20111107) */  
T1.PRVC_ACPT_YN_FG  
FROM  
TCSO_PRTY T1  
, TSCO_CNTY T2  
WHERE  
T1.USR_ID = '01gg5uki5o'  
AND T1.USR_STS_CD <> '9'  
AND T1.CNTY_CD = T2.CNTY_CD  
==============================================================================================================

- 신혼집 구하는 요령  
1. 태양의 기운을 받는 남향집을 고른다.  
아파트는 구조상 땅기운을 받기가 어렵다．따라서 반드시 태양의 기운이 필요하기 때문에 볕이 잘  
드는 남향을 선택한다．  
일조권이 좋은 아파트는 팔 때 제값을 받을 수 있다는 이점도 있다. 아파트에서는 안방과 거실에 딸린  
베란다가 남쪽을 보고 있으면 남향집이라고 하는데 뜨는 해의 기운을 가장 많이 받는 방위를 의미.  
특히 땅의 기운을 제대로 받을 수 없는 고층 아파트가 태양의 기운마저 못 받는다면 큰 낭패.  
또한 베란다를 열었을 때 마주 보이는 곳이나 좌우 가까이에 다른 아파트가 보이지 않는 것이 좋다.  
도로가 끝나는 곳에 위치한 아파트나 막다른 도로를 바라보고 있는 아파트도 풍수학적으로 좋지 않다.  
2. 큰 길의 안쪽이 좋다.  
대부분의 사람들은 대로변을 선호하지만 풍수적으로 그다지 좋은 곳은 아니다．소음과 대기오염 등으로  
나쁜 기가 흐르기 때문．역세권 아파트도 역 바로 인근은 피하고, 걸어서 5∼10분 이내가 적당하다．  
3. 중간층을 선택하자.  
요즘 짓는 아파트는 거의가 초고층으로 지어지지만, 신혼부부가 살집이므로 너무 높지만 않다면, 중층  
(4~6층)이나 고층(7~14층) 아파트도 큰 문제가 없다. 그래도 높다는 기분이 든다면 일정 면적에 화분을  
들여놓아 항상 지기를 받을 수 있도록 하는 것이 좋다.  
4. 엇갈리게 지은 아파트는 피하세요  
좁은 땅에 서로 엇갈리거나 비스듬하게 지은 아파트는 좋은 기의 흐름을 막는다．동과 동이 평행으로  
지어진 아파트와 맞은편 아파트와도 충분히 떨어져 있는 것이 좋다．  
5. 주변 환경  
주변에 공장지대나 종합병원, 축사,고 압선이 있는지도 꼼꼼히 따져 본다. 편의를 위해 병원 가까이 집을  
얻으면 건강을 잃기 쉽다는 말도 있다. 즉, 병원 갈 일이 생긴다는 의미. 러브 호텔이나 술집들이 많은  
유흥가를 피하는 것도 상식.  
6. 새 아파트는 봄·여름에 지은 곳에 입주  
가을과 겨울에 지어진 새 아파트에는 덜 마른 시멘트와 마감재들의 나쁜 기운이 그대로 남아 있다．  
부득이한 경우에는 이사가기 전에 불을 넣어 완전히 건조시키거나 환기를 시킨 뒤 입주한다．  
7. 작은 평수의 아파트를 고르세요  
단둘이 살 신혼부부라면 작은 평수의 아파트를 선택하는 것이 좋다. 형편이 좋아서 큰 아파트를 선택할  
수도 있겠지만 태어날 아기까지 생각한다해도 최대 30평 이상을 넘지 않는 것이 방법. 아기를 포함한  
3인 가족에게는 30평도 적지 않은 공간이다.  
이유는 남아도는 방(사람이 머물지 않는 곳) 이 생기기 때문인데, 빈공간은 나쁜 기를 만들어 내므로  
집안에 창고로 쓰는 방은 되도록 두지 않는 것이 좋기때문.  
--------------------------------------------------------------------------------------------------------  

- 집구하기  
1. 신림현대  
2. 관악산 휴먼시아2단지  
3. 삼성산주공  
4. 올해 아파트 매입시 약 300만원 세금 절약됨  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.16(화) 작업 ■■■■■■■■■■■■■■■
---> 09:40 ~ 20:00 --> 채용건강진단 찾기(처리가 늦어서 화냄), 10월말 철수 확정(구차장이 통보)  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
1. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03 ==> 해결  
01gg5uki5o, @yopmail.com => 450, X, Y(DB) --> 450, Y, N(소스)  
jayrdphflu, @mail.com => 450, O, Y(DB) --> 450, N, N(소스)  
2. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03 ==> 해결  
lfcodguth0, @mail.com => 310, X, X(DB) --> 310, Y, N(소스)--> 한국이 아니므로 무조건: N  
3. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040 ==>  
01gg5uki5o, @yopmail.com => 450, X, N(DB) --> 450, Y, Y(소스)  
1yh1ki8yem, @mail.com => 450, X, N(DB) --> 450, Y, Y(소스)  
4. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814 ==> 해결  
01gg5uki5o, @yopmail.com => N --> Y(소스)  
1yh1ki8yem, @mail.com => N --> Y(소스)  
==============================================================================================================

kejzpgbkzb, oattest266898892 => 450, X, N(DB) --> 450, Y, Y(소스)  
vgscundhxv, vgscundhxv => 450, X, N(DB) --> 450, Y, Y(소스)  
==============================================================================================================

- 배상범과장(2008년 교보생명 Prj) 만남 @@@@  
18:20 퇴근  
18:50 던킨도너츠(선릉역 1번 출구, 포스코 빌딩 근처)  
19:00 삽겹살(배과장이 쏨) ==> 교보생명 Proj 팀원과 조만간 만나기로 함  
20:30 종료  
21:30 루이엔(부인)과 화상통화  
23:20 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.17(수) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~ 18:50  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
1. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03 ==> 해결  
01gg5uki5o, @yopmail.com => 450, X, Y(DB) --> 450, Y, N(소스)  
jayrdphflu, @mail.com => 450, O, Y(DB) --> 450, N, N(소스)  
2. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03 ==> 해결  
lfcodguth0, @mail.com => 310, X, X(DB) --> 310, Y, N(소스)--> 한국이 아니므로 무조건: N  
3. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040 ==>  
01gg5uki5o, @yopmail.com => 450, X, N(DB) --> 450, Y, Y(소스)  
1yh1ki8yem, @mail.com => 450, X, N(DB) --> 450, Y, Y(소스)  
4. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814 ==> 해결  
01gg5uki5o, @yopmail.com => N --> Y(소스)  
1yh1ki8yem, @mail.com => N --> Y(소스)  
==============================================================================================================

- 온라인 청첩장  
1. 구글링에다가 Wedding을 검색해서  
민트카드(www.mintcard.com), 라카르타 (www.lacarta.co.kr) , 예랑카드 (www.yrcard.com)  
http://author_k.blog.me/140158405860  
http://cafe.naver.com/haptic/131296  
http://blog.naver.com/bbo0619bbo?Redirect=Log&logNo=20168699250  
http://ggulldanji.blog.me/100167457812  
2. 청솔밭웨딩뷔페(티파니웨딩): http://www.chungsolbat.co.kr/  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.18(목) 작업 ■■■■■■■■■■■■■■■
---> 06:50 ~ 18:50  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
01. AuthService-createAccessToken  
1. createUserAuthToken_400_11 ==> createUserAuthToken_privacy_accepted_AUT_1038_03 ==> 해결  
01gg5uki5o, @yopmail.com => 450, X, Y(DB) --> 450, Y, N(소스)[DEV 서버]  
jayrdphflu, @mail.com => 450, O, Y(DB) --> 450, N, N(소스)[CN IDC OSP 2.0 서버]  
2. createUserAuthToken_400_13 ==> createUserAuthToken_privacy_accepted_AUT_1039_03 ==> 해결  
01gg5uki5o, @yopmail.com => 450, O, N(DB) --> 450, N, Y(소스)[DEV 서버]  
jim9n8s1pu, @mail.com => 450, O, N(DB) --> 450, N, Y(소스)[CN IDC OSP 2.0 서버]  
3. createUserAuthToken_400_14 ==> createUserAuthToken_privacy_accepted_tnc_accepted_AUT_1040 ==> 해결  
01gg5uki5o, @yopmail.com => 450, X, N(DB) --> 450, Y, Y(소스)[DEV 서버]  
6fwmofh4ot, @mail.com => 450, X, N(DB) --> 450, Y, Y(소스)[CN IDC OSP 2.0 서버]  
4. createUserAuthToken_400_19 ==> createUserAuthToken_check_email_validation_AUT_1814 ==> 해결  
01gg5uki5o, @yopmail.com => N --> Y(소스)[DEV 서버]  
1yh1ki8yem, @mail.com => N --> Y(소스)[CN IDC OSP 2.0 서버]  
==============================================================================================================

- [Narrative Report] 전교 750등 야구포기생, 최대로펌 변호사로…  
http://media.daum.net/society/others/newsview?newsid=20121018031613554  
1. 끈기만으로는 안된다… 이종훈씨의 공부 노하우  
이종훈 씨가 공부 비결에 눈뜬 것은 사법시험을 준비하면서부터다. 그전까지는 무조건 책상 앞에 오래 앉아있는  
끈기와 노력만으로 버텼다. 하지만 그것만으론 부족하다. 이 씨의 공부 노하우는 뭘까.  
①자신의 실력에 맞는 공부를 하라  
자신의 수준을 정확히 파악하고 솔직하게 인정하라. 고등학교 2학년이라도 중학교 1학년 수준이면 거기서부터  
시작해야 한다. 공부는 이해할 수 있어야 재미를 느낄 수 있고 다음 단계로 넘어갈 수 있다.  
②함께할 친구를 찾아라  
힘들 때 옆에서 위로하고 서로 끌어줄 친구가 필요하다. 단기간에 끝낼 수 있는 '벼락치기'라면 혼자서도 가능하다.  
하지만 6개월 이상의 장기전에서는 좋은 파트너가 있어야 지치지 않고 완주할 수 있다. 시험 직전에는 혼자 공부에  
'다걸기(올인)'하는 게 좋다.  
③책 한 권에 몰아넣어라  
고시 공부는 과목마다 주 교재를 하나 정해 강의 내용이나 다른 교재의 핵심 내용을 옮겨 적는 게 효과적이다.  
처음엔 내용을 적으면서 여러 교재를 봐야 해 시간이 많이 걸리지만 일단 모든 내용을 총망라한 교재가 만들어지면  
그 뒤로는 효율적으로 공부할 수 있다.  
④체력은 기본이다  
체력이 있어야 공부도 운동도 잘할 수 있다. 장기적인 공부에 체력은 필수다.  
⑤재미가 붙으면 그 다음은 쉽다  
공부를 잘 못하는 학생일수록 일단 한두 달만 '죽었다' 생각하고 공부에 전념해봐라. 그 성과를 바탕으로 모르던  
내용을 알게 되고 성적이 조금씩 오르면 '하면 되는구나' 하는 생각과 함께 공부에 재미를 느낄 수 있다. 그 다음  
부터는 스스로 공부에 빠져드는 선순환이 시작된다.  
==============================================================================================================

- BC TIIME 카드 결제 후 문자 알림 신청  
1. SC은행 강남타워점(월 300원)  
==============================================================================================================

- 임모 둘째 출산  
1. 로얄퀸 산후조리원(서울시 영등포구 신길3동 296-57)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.19(금) 작업 ■■■■■■■■■■■■■■■
---> 06:55 ~ 18:50 --> 현노 서울집 방문(집에서 술한잔함, 보일러 틈)  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

- 사진인화  
1. http://www.fotovil.com/product/photo.asp?pcat=1&scat=1  
2. (4*6)(100*150mm): 79원  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.20(토) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~18:00  

- 집구하기: 10월 12(토) @@@@@@@@@@  
09:00 기상  
09:30 조식(현노)  
10:10 집출발  
10:50 한빛 부동산 도착(신림현대: 서울 관악구 신림동 1694, 888-2446 / *)  
11:20 123동 502호(2억 6천 만원), 26평(동향) ==> 복도식, 빈집, 주인이 살았음  
12:30 발품 부동산 도착(신림동부: 서울 관악구 신림동 1604-34, 859-8953 / *)  
11:20 102동 502호(3억 3천 만원), 26평(남향) ==> 복도식, 지저분하고 시끄러움  
12:50 부동산 뱅크 도착(두산: 서울 관악구 봉천동 1708 두산아파트상가 1-105, 882-6700/ *)  
14:20 102동 502호(3억 5천 만원), 24평(남향) ==> 계단식, 조용, 마음에 듬  
==> 부동산 뱅크 사장이 서울 부동산이 소형이 많이 지어서 매년 1%씩 떨어지고 있다고 함.  
2014년 말에 소형APT를 구입하는게 적당하고 조언 함.(봉천두산, 서울대입구 아이원, 건영 전세 알아볼 예정)  
15:30 종료  
15:50 귀가  
17:40 집출발(자전거)  
18:30 국결행사 모임(병천유황오리)  
19:00 매니저님(국제결혼 관련 서류 전달)  
20:20 이종민씨 도착(응아 남편에게 선물(커피3, 사탕) 전달)  
21:50 호프집(2차)  
23:20 종료  
23:30 506번 버스(막차)  
24:20 귀가(자전거)  
24:30 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.21(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 창립기념일  

▦조기축구
05:30 기상  
06:00 신봉천 주유소(태훈이형 차)  
06:20 신구초등학교  
06:30 병규형(행사 집 나르기: 천막, 버너 등)  
07:50 게임(3:0 승)  
08:30 게임(3:1 승): 골키퍼  
09:30 게임(0:0 무): 동산정산고(여자팀) ==> 여자팀 실력이 상당 높았음(망신 당함)  
10:30 게임(3:1 승)  
11:40 종료  
11:50 중식(설렁탕, 돼지고기)  
13:40 종료  
14:00 귀가  
14:20 낮잠  
20:00 기상  
20:00 석식  
21:30 루이엔(부인)과 화상통화  
22:30 종료  
23:40 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.22(월) 작업 ■■■■■■■■■■■■■■■
---> 06:55 ~ 18:30 --> 비, 철수 결정 확정(추성훈 차장, 백종무 과장, 이종진 과장)  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

- 국제결혼 처리 절차  
1. 신부님 서류 한국으로 발송 ==> 2. 부부서류 주한 베트남대사관에 제출 ==> 3. 주한 베트남대사관 혼인요건  
인증서발급 및 혼인신고 ==> 4. 돌려받은 서류 베트남외교부에 제출 ==> 5. 한국에서 받은 서류 주베트남한국  
대사관에 제출 ==> 6. 베트남으로 서류 발송 ==> 7. 돌려받은 서류 해당지역 소트팝에 서류 인터뷰 접수  
==> 8. 신부님 소재지역 써뜨팝 인터뷰 ==> 9. 베트남 결혼증명서 발급 ==> 10. 주 베트남 대한민국대사관에  
신부님 비자 서류 접수  

1. 혼인요건인증서 베트남에서 도착 ==> 신원보증 ==> 혼인신고(관악구청) ==> 1주일 안에 혼인이 성립됐다는  
메시지 옴 ==> 혼인 서류 발급  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.23(화) 작업 ■■■■■■■■■■■■■■■
---> 06:55 ~ 18:30  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

51. Soci-Net: http://www.socinet.go.kr/soci/main/main.jsp?MENU_TYPE=S_TOP_SY  
91. Safeu(결제): http://www.safeu.co.kr/  
==============================================================================================================

- 아이패드 탈옥  
http://blog.naver.com/tumira?Redirect=Log&logNo=40159879542  
http://blog.naver.com/skid5?Redirect=Log&logNo=70143666064  
http://kgh70621.blog.me/70138950838  
==============================================================================================================

- 아이패드2 중고 구매  
1. 아이패드2(중고): 310,000원(화이트)[파우치]  
http://cafe.naver.com/joonggonara/133521030  
2. 세이프유 안전거래수수(천 5백원): http://www.safeu.co.kr, tamario/s*j**m8*1  
1) 무통장: 무료, 신용카드: 3.6% 공제  
2) 전관식(*, 031-877-9683): 우리은행(2674-91079-18921) 31만원 송금  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.24(수) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:30  

- IOSP(/oauth2) Prj
- CN IDC OSP 2.0 TEST 결과  
==============================================================================================================

- 아이패드2(16G, Wi-Fi) 중고 도착 및 사양  
1. 운영 체제: iOS 5.0.1( iOS 4.3)  
2. 프로세서: 1GHz, Dual-core Apple A5 SoC  
3. 디스플레이: 9.7인치, LED Backlight LCD(1024 X 768) PowerVR SGX 543 MP4+  
4. 하드: 16GB(구매한 것), 32GB, 64GB  
5. 무게: 약 0.54kg  
6. 웹 카메라: 전면 30만 화소 / 후면 70만화소  
7. 블루투스 4.0 / 터치패드(멀티터치)  
--------------------------------------------------------------------------------------------------------  

- 아이패드2(16G, Wi-Fi) 중고 정보  
1. 모델명: A1395, 모델: MC979KH)  
2. S/N: DLXGFQHLDKPH  
==============================================================================================================

- 아이패드2 중고 구매  
1. 아이패드2(중고): 310,000원(화이트)[파우치]  
http://cafe.naver.com/joonggonara/133521030  
2. 세이프유 안전거래수수(천 5백원): http://www.safeu.co.kr, tamario/s*j**m8*1  
1) 무통장: 무료, 신용카드: 3.6% 공제  
2) 전관식(*, 031-877-9683): 우리은행(2674-91079-18921) 31만원 송금  
==============================================================================================================

1. Apple ID(설정-iCloud 경로로 들어가시면, 무료ID생성가능 => 이후 설정-App 생성)  
1. Apple ID  
tamario@naver.com/ssjtm3390A 
2. Change your security questions.  
Q: 처음 만난 유명인?  
A: lulu
- iCloud  
*@*.*/lulu3*9A  
- iTunes Store  
*@*.*/lulu3*9A
- iMessage  
*@*.*/lulu3*9A
==============================================================================================================

- 모바일 admin 웹사이트 Prj 관련 모임(커피 shop: 13시)
1. 추차장, 박과장, 장영재 과장(김성채 팀장 주제)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.25(목) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:10  

- IOSP(/oauth2) Prj
- 인수인계  
1. 일시, 장소: 13:00 ~ 15;20(9층 2회의실)  
2, 참석: 김세중 사원, 구차장, 이선미 과장, 윤주영 과장(이강현 책임 주제)  
==============================================================================================================

- 휴대용 Wi-Fi 핫스팟 설정(휴대폰에 직접 설정)  
1. 환경설정 => 무선 및 네트워크 > 더보기 > 테더링 및 휴대폰 핫스팟 > 휴대용 Wi-Fi 핫스팟 구성  
네크워크 SSID: 00. TAMA_Android0898, 보안 : WPA2 PSK, 비밀번호: 11221122  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.26(금) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:10  

- IOSP(/oauth2) Prj
- 인수인계  
==============================================================================================================

- 뉴아이패드 탈옥  
http://sevensign.tistory.com/455 ==> http://greenpois0n.com: Jailbreak iOS 5.1.1 (4S/iPad2): absinthe-win-2.0.4 (Win)  
http://blog.naver.com/skid5?Redirect=Log&logNo=70143666064  
1. 소유한 뉴아이패드는 iOS 6.0(10A403)로 업그레이드가 된 상태라 iOS 5.1.1 탈옥은 불가능함  
--------------------------------------------------------------------------------------------------------  

- 아이패드2 탈옥  
http://blog.naver.com/availman?Redirect=Log&logNo=110112697648 ==> http://greenpois0n.com: Jailbreak iOS 5.0.1 (4S/iPad2): absinthe-win-0.4 (Win)  
리얼 레이싱2  
==============================================================================================================

- 국산 무료 화면 캡쳐프로그램 오픈캡쳐(OpenCapture v7.0)  
http://mmxii.tistory.com/31  
==============================================================================================================

- 임호수 둘째 돌 축하금  
1. 국민(631-21-0201-456) 임호수, 5만원 송금(나눔동기회)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.27(토) 작업 ■■■■■■■■■■■■■■■
---> 06:40 ~18:00  

09:40 기상  
12:10 중식(라면, 밥)  
13:00 501번 버스  
13:40 용산 도착  
13:50 피씨캠프 방문(삼성전자 DDR3 4G PC3-12800 구매): Dell 노트북 들고 가서 확인함 --> 속도 조금 빨라짐  
14:20 창조닷컴 방문(삼성전자 830 Series 노트북 패키지 구매)  
14:40 성일정보 방문(Dell 노트북에 있는 하이닉스 DDR3 2G 2개 판매: 6천원 받음)  
15:20 이마트 용산점 방문  
16:20 귀가  
20:00 루이엔(부인)과 화상통화 요청했는데 못 봐서 채팅 못함  
23:40 취침  
==============================================================================================================

- 노트북용 SSD 256G, RAM 구매 완료  
1. 삼성전자 830 Series 노트북 패키지(256GB, MZ-7PC256N/KR, 정품)  
1) 가격: 280.000원, 창조닷컴(한강로2가 나진상자 17동 나열 200호, 6733-0)  
2) http://joripcom.co.kr/product/productView.php?nProdCode=1512484&service_id=pcdn  
3) 삼성 SSD 830 Series 노트북 패키지 설치 후기: http://blog.daum.net/horihor/8633582  
2.삼성전자 노트북용 DDR3 4G PC3-12800(정품):  
1) 가격: 20.000원 2개 4만원, 피씨캠프(한강로2가 나진상가 18동, 6733-0)  
2) http://pccamp.net/product/productView.php?nProdCode=1596012&service_id=pcdn  
3. 램 메모리 판매  
1) 성일정보(용산구 한강로2가 선인상가 22동 3층 1호): http://www.topc.co.kr  
2) 하이닉스 노트북용 DDR3 2G PC3-10600, 가격: 3,000원 2개 ==> 6천원 받음  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.28(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

▦조기축구
06:00 기상  
06:35 신봉천 주유소(태훈이형 차)  
07:00 신구초등학교  
07:30 숏게임(7:5 패)  
08:30 게임(8:5 패)  
10:40 종료  
11:00 중식(운동장에서 류명국 해장국받은 해장국으로 점심 먹음)  
12:50 종료  
13:50 귀가(버스 타고 감)  
18:20 Y셔츠 다림질  
20:30 석식(비닐에 싸서 류명국 해장국 가지고 와서 먹음)  
20:50 루이엔(부인)과 화상통화(내가 자기를 진정 사랑하지 않는다고 해서 화내며 채팅 끝냄)  
22:00 종료  
23:40 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.29(월) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:10  

- IOSP(/oauth2) Prj
- 인수인계  
==============================================================================================================

- chatON 면접(13시)  
1. 장소: 미림타워 9층  
2. 참석: 박과장, 장영재 과장, 김성채 팀장(삼성SDS PM 면접) ==> 5명 중 나만 합격함  
3. 업무: chatON 운영 및 개발 업무  
==============================================================================================================

- UML을 활용한 시스템 분석 설계 구입  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.30(화) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:10 --> account팀 회식(18:30 ~ 20:00, 새마을 식당)  

- IOSP(/oauth2) Prj
- 인수인계  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.10.31(수) 작업 ■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00  

- IOSP(/oauth2) Prj
- IOSP Proj 철수 및 저장 장치 변경  
1. MSI 노브북 포맷 및 SSD 변경: 삼성전자 830 Series 노트북 패키지(64GB, MZ-7PC256N/KR)  
==> 삼성전자 830 Series 노트북 패키지(256GB, MZ-7PC256N/KR, 정품): 이강현 책임(드라이버 포함)이 도와줌  
2. MSI 노브북에 윈도우 7 Professional K 32 Bit 설치  
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■