

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2012.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2012.01.01(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- [2012년 임진년(壬辰年) 신년 목표]
1. wellbeing(최선, 마음 비우기) 
2. 살빼기(70kg, 건강) 
3. 전문성 향상(전문적 고객관리, 고연봉) 
4. 지속적 자기 개발(1. 경매) 
==============================================================================================================

▦조기축구
07:30 기상 
08:20 신구초등학교 
08:30 조기축구(7:5 패) 
11:00 종료 
11:20 중식(떡꾹 끓임: 설겆이): 의자 상효형 가게에 갖다 줌 
13:20 종료 
13:30 안(땡큐: 별이(Evnt)) 
14:50 낮잠 
19:00 석식(백반)  
19:50 귀가 
24:00 취침 
==============================================================================================================

- TAMA Asset(2011) ==> 2011.12.31 @@@
내용 금액 
KB미래펀드 8,456,342 
청약저축 1,000,000 
장기주택 2,020,000 
기타 308,446 
KB 총금액 11,784,788 
SC제일은행 6,163,894 
동양펀드 8,933,017 
저축-신안저축B 30,000,000 
저축-우리금융B 47,172,752 
적금(신안B, 현대S) 1,000,000 
기타(미래에셋KorChindia) 1,962,781 
기타(미래에셋브라질) 2,027,359  
기타(삼성펀드) 2,340,594 
기타 합계 6,330,734 
1. 총 예금액 111,385,185 
MET종신 5,855,060 
PCA변액 20,100,000 
대생연금 15,200,000 
2. 총 보험금 41,155,060 
남권형 대여금 30,000,000 
3. 전세금 55,000,000 
==> 총 합계 237,540,245 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.02(월) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 21:50 --> 야근(포시즌) 

- IMK 차세대 Prj
- TAB ORDER 순서 처리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.03(화) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 22:30 --> 야근(포시즌) 

- IMK 차세대 Prj
- 마감일관리 명칭 변경 
1. 마감일관리 --> 입고제한(grRstc) ===> MSCUM38P(입고제한) 
==============================================================================================================

- 제니퍼 TOP 쿼리 처리
1. BusinessPlaceSearchDQM.dListBusinessPlaceSearch 
2. ClmDQM.getPageRowCountClmList 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.04(수) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌) 

- IMK 차세대 Prj
- 사업장조회(MSCUM35M) 수정 
1. 페이징처리(Total_Count없이 처리) --> 사업장조회(HUCUM63M) 
2. 주소 2개 조회되는 거 수정 
==============================================================================================================

- [Hub] 품목, 공급사 Batch작업 수정 
1. 2011년 12월 배치 작업 수정 
==============================================================================================================

- 대소문자 구분 배제 
1. 회사조회, 사업장조회, 조직조회[MP, HUB] 검색조건인 회사명, Payer명은 대소문자 구분하지 않고 조회  
가능하도록 변경 
==============================================================================================================

- UI에서 TEST 서버 연결(/imk_mall/default_typedef.xml 파일에서) 
1. 로컬 서버: imk_mall ==> http://localhost:7001/imk_pjt/ 
2. TEST 서버: imk_mall ==> http://88.1.117.23/imk_mall/ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.05(목) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(포시즌) 

- IMK 차세대 Prj
- MP Hub DashBoard 년도별 조회조건 추가 
1. 년도 추가 
(SUBSTR(TO_CHAR(SYSDATE, 'YYYYMM'), 5, 6)) > ==> (SUBSTR(:inqYmd, 5, 2)) > 
TO_CHAR(SYSDATE, 'YYYY') ==> SUBSTR(:inqYmd, 0, 4) 
TO_CHAR(SYSDATE, 'YYYYMMDDHH24MISS') ==> :inqYmd '000000' 
==============================================================================================================

- 회사상세조회(MSCUM66T) 수정 
1. 프로세스정보탭에서 MRO 클릭하면, 입고팝업기준일자/입고팝업적용기간 필드가 활성화됨 

- 사업장상세조회(MSCUM67T) 수정 
1. 프로세스정보탭에서 MRO 클릭하면, 사야가격결정유형/자동발주/입고팝업기준일자/입고팝업적용기간 
필드가 활성화됨 
==============================================================================================================

- 회계사 소개 
1. 이도 세무회계 김봉숙 실장(H: *) 
2. 박찬일 차장(H:*) 소개 
==============================================================================================================

- 휴대폰(KT 가입시) 
0. 갤럭시 지오: 24개월 14만원 약정: http://ppomppu.co.kr/zboard/zboard.php?id=sponsor&no=3036&sn=on&keyword=64178 
1. http://www.dt.co.kr/contents.html?article_no=2012010502010531747002 
2. http://biz.heraldm.com/common/Detail.jsp?newsMLId=20120105000006 
==============================================================================================================

- 모니터
0. LG전자 M2450D-PN(24In), 267,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A571944839&frm3=V2 
0. LG싱크: http://lcdsync.co.kr/product/productView.php?nProdCode=1483133&service_id=pcdn, 주소: 서울시 용산구 한강로2가 선인상가 22동 2층 2034호 T: 702-7409 
1. LG전자 플래트론LED M2780D-PN(27In), 323,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A594859772&frm3=V2  
2. LG전자 플래트론LED E2351VQ-BN(23In), 206,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A593943584&frm3=V2 
1) http://commoum.co.kr/product/productView.php?nProdCode=1562148&service_id=pcdn  
3. LG전자 플래트론LED W2486LP-PF(24In), 244,500원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A565257885&frm3=V2 
4. LG전자 플래트론LED E2260-PN(21.5In), 182,200원: http://itempage3.auction.co.kr/DetailView.aspx?itemno=A566617969&frm=itempage&wfrm=vip_contents&frm3=V2 
91. 스탠드: http://blog.danawa.com/prod/?blogSection=1&cate_c1=860&cate_c2=13735&cate_c3=14885&cate_c4=14913&depth=4&prod_c=977267 
51. Alphascan TLED27:  
==============================================================================================================

- LCD 모니터 구매(2008.05.10(토)) 
1. WIDVIEW MT-202MWT(20.1In), 220,000원: 
http://www.interpark.com/product/MallDisplay.do?_method=Detail&sch=list&sbn=ane_prd&sc.shopNo=0000100000
&sc.dispNo=008001&sc.prdNo=61857119 
==============================================================================================================

- 노트북 
0. MSI GT683DX-i7 SSD(64G) + Edition, 1920x1080, 15In, 1,680,000원: http://blog.danawa.com/prod/?&cate_c1=860
&cate_c2=869&cate_c3=12734&cate_c4=0&depth=3&prod_c=1542262 
0. 피씨컴: http://pc-com.or.kr/product/productView.php?nProdCode=1542262&service_id=pcdn, 
주소: 서울시 용산구 한강로2가 나진상가 18동 3층 가열 19호 T: 707-3117 
0. MSI GX660DX I5SIGMA, 984,000원: http://blog.danawa.com/prod/?blogSection=1&cate_c1=860&cate_c2=869
&cate_c3=12734&cate_c4=0&depth=3&prod_c=1433139 
0. HP Envy 17-1000 CTO1 (리퍼비시), 1,590,000원:http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869
&cate_c3=10585&cate_c4=0&depth=3&prod_c=1291321 
1. 삼성전자 SENS NT700G7A-S73D, 1920x1080, 17.3In, 2,100,000원: http://blog.danawa.com/prod/?blogSection=4&prod_c=1529336 
2. 삼성전자 SENS NT-RF711-S99B, 1600x900, 17.3In, 1,988,000원: http://blog.danawa.com/prod/?blogSection=2&cate_c1=860
&cate_c2=869&cate_c3=10580&cate_c4=0&depth=3&prod_c=1572914 
3. 시리즈7 크로노스 15In: http://blog.danawa.com/prod/?blogSection=4&prod_c=1529336 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.06(금) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(팬다), 정수석 재면담(4월까지 연장 계약 조건으로 셀 이동 요청), 염색(흰색: 실패) 

- IMK 차세대 Prj
- MP Hub DashBoard 년도별 조회조건 추가 
1. 년도 추가 
==============================================================================================================

- 맛집(서울대입구역 근처) 
1. 아웃백 서울대점: http://place.daum.net/place/PointView.do?confirmid=10574772, H: 884-4761, 주소: 서울 관악구  
봉천동 1601-1번지, 서울대입구역 1번출구에서 50M 직진 후 오른쪽 건물 
2. 남도일식: http://place.daum.net/place/PointView.do?confirmid=10574772, H: 872-3392, 주소: 서울 관악구 봉천6동  
858-6번지, 서울대입구역 8번출구에서 10M 직진 후 좌회전 20M 직진 후 왼쪽 건물 
3. 카페베네 서울대점: http://place.daum.net/place/Top.do?confirmid=12283760, H: 888-6232, 주소: 서울 관악구 봉천동  
875-1번지 관악캠퍼스타워 1층 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.07(토) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 --> 토요근무, 중식(순대국집: 해장국), 조영주(H: *): 서울대입구역 아웃백 18시 

- IMK 차세대 Prj
- 재고관리 TEST 
1. 자재관리 > 재고관리 > 재고현황 
==============================================================================================================

- 맞선 
17:00 퇴근 
17:45 서울대입구역 아웃백(기다림) 
18:10 2층 자리 잡음 
18:15 조영주(전북 고창, 부모 두분 공무원)씨 도착 
18:20 석식(세트): 68,090원 
20:00 종료 
20:10 칵테일바(그냥 나옴) 
20:20 시너스 서울대점(시간이 안 맞아서 나옴) 
20:30 귀가 
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.08(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
07:50 기상 
08:50 신구초등학교 
09:00 조기축구(10:8 패): 1G ==> 3게임 뜀 
11:10 종료 
11:20 중식(문경세재: 갈비탕(만원)) 
13:20 종료 
15:00 낮잠 
19:45 기상 
21:00 석식(라면, 밥) 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.09(월) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 20:30 --> 야근(포시즌), 정수석 재면담2(1월달 철수 통보 받음) 

- IMK 차세대 Prj
- 05. 반품교환 요청내역(BYERB05P) 수정 
1. 처리구분이 요청, 요청취소 ==> 고객사 주문자 회사명 
2. 처리구분이 승인, 거부, 완료 ==> 공급사 회사 회사명 
==============================================================================================================

- MP대시보드 DM으로 조회하면 에러 발생 처리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.10(화) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 17:30 --> 강대성 과장 면담(최과장): 휴일 찾아 먹기, 새 Project 알아보기 

- IMK 차세대 Prj
- 힌트(Hint) 
1. /*+leading(T5) use_nl(T8)*/ 
2. /*+ ordered */ 을 사용하게 되면 from 절에 정의된 테이블 순서에 의해 드라이빙이 시작되며 조건절의경우 드라 
이빙 된 테이블의 조건을 추출하여야 한다. 
SELECT /*+ ORDERED */ NVL(A.CAL_VA1, 0) CAL_VAL 
FROM BASIC B, CONCEPT A  
/*+ ordered use_nl(b, a) */의 힌트 사용으로 강제적으로 해당 테이블의 드라이빙 및 데이타 추출 순서를 강제 조정  
할수 있다. 

3. 중첩(거듭 겹치거나 포개어짐)루프? : 단어의 의미 그대로 loop가 겹쳐져 있는 형태를 말합니다. 
for i in 1..10 loop -- outer 
for j in 1..100 loop -- inner 
if i=j then -- i와 j는 join key에 해당 
..... 
end if; 
end loop; 
end loop; 

4. 적용 전,후의 상황이 어떻게 풀이되는지? optimizer는 다양한 join method를 적용해서 plan을 생성합니다.  
하지만 통계정보의 신뢰성 등 다양한 원인으로 성능이 떨어지는 join method를 선택할 수 있습니다.  
이런 경우 query작성자는 hint를 써서 optimizer가 더 나은 plan을 선택하도록 유도할 수 있습니다. 
예) use_nl 적용 전: optimizer가 스스로 hash join을 선택해서 쿼리를 실행 
use_nl 적용 후: optimizer가 hint에서 유도하는 데로 nested loop join을 선택해서 쿼리를 실행 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.11(수) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 12:50 --> 면접(14시): 바로 퇴근, PMO 김용근 수석 면담(설 3일 휴가 얻음) 

- IMK 차세대 Prj
- 05. 반품교환 요청내역(BYERB05P) 수정 
==============================================================================================================

- 면접 
1. 01.10(화) 14:00 ==> 서울 강남구 역삼1동 역삼 823빌딩[포스코사거리 --> 823빌딩: 3.5km(30분 소요)] 
2. (주)아이엘포유 김성채 팀장, ITO사업부 윤종건 대리(010-8711-0), 571-01, 김미영 과장(010-3955-0) 
3. 삼성전자 바다OS V2.5 Project: 2월부터 5개월(570): 최민회 과장 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.12(목) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 17:30 --> PM 호경신(*) 수석 면담(핫초코) 

- IMK 차세대 Prj
- 반품교환관리(BYERM18M)) 수정 
1. 조회조건중 구매파트/팀 항목 active 되지않는 거 수정 
2. 구매파트/팀 조회(OrderTrackingMpDQM.selectImkPchOrg --> reqGetImkPchOrg()) */ 
	SELECT '' AS CD, '전체' AS CD_NM 
	FROM DUAL 
UNION ALL 
	SELECT M13.ORG_CUST_ID AS CD, M11.CUST_NM AS CD_NM 
	FROM MCUTG1130 M13, MCUTG1110 M11 
	WHERE M13.ORG_CUST_ID = M11.CUST_ID 
	AND M13.IMK_PCH_ORG_YN = 'Y' 
--; 
==============================================================================================================

- IMK 차세대 Prj 재계약 수정 
1. 기간: 2012.01.25(목) ~ 2011.01.31(목) ===> 02.29(수)에서 한달 줄임 
2. (주)아엘포유 김성채 팀장(H: 010-2352-0) ==> 삼성전자 바다OS V2.5 Project 2월 1일(수) 출근 확정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.13(금) 작업 ■■■■■■■■■■■■■■■
---> 07:15 ~ 17:30 

- IMK 차세대 Prj
- 반품교환처리현황(BYERB01M) 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.14(토) 작업 ■■■■■■■■■■■■■■■
---> 13:30 ~ 16:00 --> 글빛도서관 

- IMK 차세대 Prj
- 독서 
1. 칼의 노래(김훈) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.15(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
07:50 기상 
08:45 신구초등학교(정홍이한테 종록이형 돈 문제 설명) 
09:00 조기축구(2:1 패) 
11:00 조기축구(5:1 패) 
11:20 종료 
11:50 중식(문경세재: 호균이형이 쏨): 남근이형 상요형 소송 문제로 토론 
12:40 종료  
13:30 수화 AM(몸무게 76kg) 
13:40 그림이(1S: A IN Mode(감동)): 제시카 복귀 
14:40 종료 
14:50 낮잠(케이블TV 시청(CGV 영화: 다이하드4)) 
19:00 기상 
19:10 석식(백반, 양말) 
19:20 종료 
20:10 귀가 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.16(월) 작업 ■■■■■■■■■■■■■■■
---> 07:10 ~ 17:30 --> 현용 만남(삼계탕집, 맥주집(내가 쏨), 포장마차, 설 선물(김) 받음(택배, (주)아이엘포유) 

- IMK 차세대 Prj
- 90.인수인계 문서 작성 
==============================================================================================================

- 자동차 운전면허 적성검사 
1. 적성검사기간: 2016.06.25 ~ 2016.12.24 
2. 준비물: 면허증, 반명함판 칼라사진(3cm×4cm) 2매, 갱신 수수료: 10,000원, 지정병원의 신체검사서 
3. 운전면허시험 관리단(http://www.dla.go.kr) 
==============================================================================================================

http://cnews.mt.co.kr/mtview.php?no=2012011516583303388&type=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.17(화) 작업 ■■■■■■■■■■■■■■■
---> 07:25 ~ 18:00 

- IMK 차세대 Prj
- 사용자 매뉴얼 작성 
==============================================================================================================

- 나눔동기모임 
1. 일시: 2012.01.16(월) 19시 
2. 장소: 뚝심한우암소직판장(서울 강남구 도곡동 542-1): 강남세브란스병원과 도곡1동주민센터 중간 지점 
(모커리병원 옆) ==> (<-- 포스코사거리: 2.8km(46분)) 
3. T: 529-0
==============================================================================================================

18:00 퇴근 
19:00 뚝심한우암소직판장(걸어서 감) 
19:40 현용 임모 도착(인출한 돈 현용에게 전달(6,099,000원)) 
19:50 한우 등심, 갈비, 육회, 냉면(118,000원 ==> 내가 쏨) 
21:20 종료 
21:30 당구장(2판: 50 놓고 1등 함) 
22:30 호프집(현용 쏨) 
00:50 종료  
01:10 귀가(택시: 임모가 가는 길에 태워줌) 
01:20 취침 
--------------------------------------------------------------------------------------------------------- 

- 현용돈 인출 및 전달 
2012.01.13 14:17 0 4,029,186 19,257,186 Ｉ／Ｂ 우리 황찬호  
2011.12.26 15:23 0 1,283,296 10,383,136 전자금 국민 클라우드나인 
2011.12.15 12:05 0 785,692 11,738,855 전자금 국민 10월급여추가  
2011.12.12 11:24 0 4,029,186 15,482,349 전자금 국민 클라우드나인 ==> 송금 함 
총: 6,099,000원 ==> 5만원권 121장하고 49,000원(원래 금액: 6,098,174원) 
==============================================================================================================

- 카쉐어링(렌트카와 다름): http://www.greencar.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.18(수) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 

- IMK 차세대 Prj
- 사용자 매뉴얼 작성 
1. 반품교환 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.19(목) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 --> 남권이형 법률 사무실(한양) 이전했다고 통보 받음(호성이형) 

- IMK 차세대 Prj
- 사용자 매뉴얼 작성 
1. 대시보드 
==============================================================================================================

- 설 고속버스 예약(2012.01.22(일))] 
1. 서울경부 --> 포항 : 2012.01.22(일) 07:30, 동양(일반, 좌석: 9), 20,500원 
2. 포항 --> 서울경부 : 2012.01.25(목) 17:00, 한일(일반, 좌석: 5), 20,500원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.20(금) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 --> 포항계비 4만원, 모임비 2만원 ==> 총 6만원 총무(태정) 계좌로 송금, 떡뽑기(강과장, 최과장) 

- IMK 차세대 Prj
- 사용자 매뉴얼 작성 
1. 대시보드 
==============================================================================================================

- 설날 선물 
1. 백설 선물세트(강대성 과장이 챙겨줌) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.21(토) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 --> 조기축구(4:2 패), 조식(막걸리, 수인형, 승렬이형이 쏨) 

- IMK 차세대 Prj
- TV 시청(뿌리깊은 나무) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.21(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 설 연휴
06:00 기상 
06:20 조식 
06:50 집 출발 
07:20 강남터미널 도착 
07:30 서울 출발 
12:00 포항 고속터미널 도착(4시간 30분 소요) 
12:01 101번 버스 승차 
12:20 포항집(부모님 용돈 20만원 드림) 
17:30 집출발 
18:00 포항계 모임 ==> 고기킹 부페집(창포 갤러리아 웨딩홀 근처): 동영형, 정하, 진철, 봉춘 미참석 
20:00 종료 
20:10 당구(정철, 내 <--> 주남형, 진호형): 내가 냄(8,300원) 
21:20 종료(정철이 차) 
21:10 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.22(월) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 설날
07:00 기상  
09:00 작은 아버지, 대규 
09:10 차례(수일 용돈: 만원) 
10:00 작은 아버지집 차례(포항시 북구 풍림 아이원 102동 706호) 
10:20 차례 
13:00 드라이브(대구 차: 신항만, 칠포, 월포, 장사) 
15:30 이모집(포항시 북구 용흥동 373-15) 
17:00 떡국 
18:00 외가집 출발(문충까지 신 도로 타고 옴) 
18:30 외가집(외할매에게 3만원 드림) ==> 경태 이혼했다고 들음 
19:00 종료 
19:30 포항집(매형이랑 경태랑 술 --> 소주 3병) 
20:40 종료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.23(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 설 연휴
09:00 기상 
10:00 조식(큰누나네, 령경): 령경에게 중학교 갈때 쓰라고 10만원 줌  
13:00 석식 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.24(수) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 21:10 

- 설 연휴
- 포항집 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.25(목) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 21:10 

- 설 연휴
16:00 석식(포항집) 
16:30 포항집 출발(101번 버스) 
16:50 포항 고속버스 터미널 
17:00 포항 출발  
21:00 강남터미널 도착(4시간 소요) 
21:10 강남터미널 버스(643번) 
21:30 행운동주빈센터앞 도착 
21:40 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.27(금) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 

- IMK 차세대 Prj
10:00 기상 
12:00 조식
12:30 용산 노트북, 모니터 업체에 전화 
13:50 용산역 도착 
14:30 국민은행 현금 찾기 
14:50 전자랜드 변관 찾아 헤메기(전자랜드 맞은편 지하 1층) 
15:10 노트북 구매((주)서영정보 씨엔에스 
	1. 사양: MSI GT683DX-i7 SSD(64G) + Edition, 1920x1080, 15In, 1,680,000원 
	 1) URL ==> http://commoum.co.kr/product/productView.php?nProdCode=1542262&service_id=pcdn 
	2. 주소: 서울시 용산구 한강로3가 16-9 전자랜드 별관 광장(지하1층) 47호, 703-2861 
15:20 화면보호기(15.6인치): 3M PF 구입 
16:20 모니터 구매 
	1. 사양: LG전자 M2450D-PN(24In), 267,000원(http://lcdsync.co.kr/product/productView.php?nProdCode=1483133&service_id=pcdn) 
	2. 주소: 서울시 용산구 한강로2가 선인상가 22동 2층 2034호, 702-7409 
16:40 종료 
17:40 귀가 
23:40 뿌리깊은 나무 시청(24부작 완결) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.28(토) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 21:10 

- IMK 차세대 Prj
- 집에서 쉼 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.29(일) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
07:00 기상 
08:10 신구초등학교(버스에서 태훈형 만남) 
08:30 조기축구(4:4 무) 
10:30 고사(돼지머리, 떡) 
11:00 게임(1:1 무 --> 상봉조기회) 
11:30 종료 
11:40 본부석 막걸리 파티(조기회 고문들) 
12:30 문경세재(중식): 조기회에서 쏨 
13:20 종료 
13:30 산낙지가게(북경반점 근처): 상설형이 쏨 
14:20 종료 
15:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.30(월) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 

- IMK 차세대 Prj
- 인수인계 
1. 반품교환: 박성진 사원 
2. 대시보드: 김창화 사원 
==============================================================================================================

- IMK Prj 환송회 
1. 장소: 브라질리아(소고기 부페) 
2. 시각: 18:30 ~ 20:20 
3. 참석: 정승현 수석, 박성원 책임, 물류 3셀원  
==============================================================================================================

- 행운동 주소 
1. 도로명 주소: 서울특별시 관악구 행운6길 16-20(봉천동) 
2. 주번 주소: 서울특별시 관악구 봉천동 106-23 
==============================================================================================================

- 연말정산 서류 제출 
1. 아엘포유(강대성 과장) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2012.01.31(화) 작업 ■■■■■■■■■■■■■■■
---> 07:20 ~ 17:30 

- IMK 차세대 Prj
- IMK Proj 철수
1. 인수인계 ==>  
1) 반품교환: 박성진 사원 
2) 대시보드: 김창화 사원 
3. 노트북 포맷(15:00 ~ 16:00) 
4. 철수(17:30) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■