

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2016.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2016.12.01(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:10 ~ 21:00  ==> 석식(탕짬면, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- 신규발급(/cs01/CS01_NewIss_M.xml) 수정 
1. 대사관국적 DS 추가
- 재발급(/cs01/CS01_ReIss_M.xml) 수정 
1. 대사관국적 DS 추가
- 회원정보관리(/cs02/CS02_MembInfoMgt_M.xml) 수정    
1. 대사관국적 DS 추가
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.12.02(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:10 ~ 22:00  ==> 석식(잡채밥, 남경), 23시 퇴근 후 04시까지 가계부 월말 결산, 처가돈 정리

- 롯데 면세점 회원통합 Prj[★] 
- VIP회원해외점구매실적조회(/cs02/CS02_VipMembOvsStrPchsActrsltInqry_M.xml) 수정
1. VIP회원해외점구매실적상세목록 조회 수정(국내점 조회 추가)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.12.03(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
09:00 기상
09:20 조식(라면)
10:00 집출발(수종)
10:10 진료(명소아과): 수종 감기
10:40 조제(래미안 나나 약국): 수종 감기  
11:30 대림역(6511번 버스)
12:10 봉천중
12:50 글빛정보도서관(2층: 어린이도서관): 수종이 책 읽어 줌
1330 종료
14:00 중식(돈까스, 비빕밥, 김밥): 포마토 식당
15:00 봉천사거리(6511번 버스)
15:30 귀가
16:00 낮잠
19:00 석식
22:30 개인 업무(노트북)
02:30 종료
02:40 취침
==============================================================================================================

- 루옌 국민은행 통장 비밀번호 변경 
1. 계좌번호: 037401-04-130647(03740104130647) ==> 루옌 생활비 통장 
==> DINH THI ＬUYEN, luyen94 / 0**8  ==> https://obank.kbstar.com, luyen94 / t*m*05*8
==============================================================================================================
 
- 루옌 핸드폰 요금제 확인(20시, 집)
1. Tworld(SK 요금 확인) ==>  http://www.tworld.co.kr --> tamario/hptnwhd1601@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.04(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
07:30 기상
07:50 자전거(문영APT -> 대림운동장)
08:00 대림운동장  
08:20 게임(만리재 FC와 게임) ==> 4게임함(자실골 넣음)--> 1게임 포워드로 뜀
12:00 종료
12:30 중식(김치찌게: 서울식당): 회에서 쏨
13:30 종료
13:50 양평해장국(뼈해장, 3그릇: 양평해장국): 테이크아웃 
14:00 귀가
14:10 집출발(루옌 자진거 빵구나서 끌고 감)
14:30 명지성모병원(5층: 봉천동 루옌 언니 입원: 수종 데리고 옴)
14:50 뚜레쭈르 빵 구입(8천원, 수종)
15:10 대림역 자전거 점(루옌 자전거 기아가 없어서 잘 안나감, 빵구남[수리비 만원 예상]) ==> 7만원 더 주고 새 자전거로 교환
16:40 귀가
19:00 석식
21:00 이발, 염색 ==> 루옌이 해줌
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.05(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경), 롯데면세점 고의정 사원에서 반출 데이타 요청(내일까지 처리해준다고 함)

- 롯데 면세점 회원통합 Prj[★] 
- 국적별 카드발급현황(/cs01/CS01_BydayCardIssPrsts_M.xml) 수정 ==> 
1. 카드발급상세내역 Grid: 해외 국가코드 조회 가능
==============================================================================================================
 
- 원복 처리 후 수정
/cs02/CS02_VipMembPchsActrsltInqry_M.xml --> VIP회원구매실적조회 원복 처리함(김책임 요청) --> 재수정
==> dsVipMembInqryCndt.SetColumn( 0, "natnCdYn", "Y");  // 발급국가코드 조회여부 설정(2016.112,05, 진태만)

/cs/cs02/VipMembSQL.xml  --> 회원통합 수정(2016.12.02, 진태만)  ==> 67413번으로 원복 처리함(김책임 요청) --> 재수정
==> dsV
==============================================================================================================

- 공통 코드 조회
1. 국적코드(dsNatltCd): CO037, 대사관국적코드(dsEmbsNatltCd): CO001, 발급국가코드(dsNatnCd): CO001 중 코드 'KR’ 또는 관리속성값이 1인 국가만 필터링)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.06(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★]  
- 재발급, 개인정보 변경 화면에서 해외 등록
1. 국적구분, 롯데멈버스카드번호(ID: lmbsCardno) 확인
- UseData 사용 안하고 국적구분 필수항 목 설정
 if(dsVipMembInfo.GetColumn(0, "natltCd") == "KOR"){   // 내국인이면 추가(2016.12.06, 진태만) 
	dvVipMembInfo.stVipMembInfo_tb183_h_natltDvsCd.Style = "style_st_item_sub_bold"; 	// 국적구분이 필수로 처리(2016.12.06. 진태만)
} 
else	// 내국인이 아니면 추가(2016.12.01, 진태만)
{  
	dvVipMembInfo.stVipMembInfo_tb183_h_natltDvsCd.Style = "style_st_item_sub"; 	// 국적구분이 필수가 아닌 걸로 처리(2016.12.06. 진태만)
} 

if(cf_IsEmpty(dsVipMembInfo.GetColumn(0, "natltDvsCd"))){  // 국적구분이 널이면 --> 국적구분이 필수로 처리(2016.12.06, 진태만)
	cf_AlertBox("CO_ERR_064"); 	// 필수 입력 항목이 누락되었습니다.
	dvVipMembInfo.coNatltDvsCd.SetFocus();	// 국적구분 Comnbo 포커스 처리 
	return false;
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.07(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(잡채밥, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- gloB+ VIP회원 재발급(/cs01/CS01_ReIss_M.xml)수정 ==> 
1. /CS01_ReIss_M_inc.xmlD.xml  

dsNatltDvsCd: 국적구분 DS 추가
dsTelnoNatnCd: 휴대전화번호 국가코드 DS 추가
dsNatltCdAddr: DM주소 국적 DS 추가
----------------------------------------------------------------------------------

- dsVipMembInfo DS(VIP회원상세정보 DS)
<colinfo id="natltDvsCd" MapValue="국적구분코드" size="256" summ="default" type="STRING"/> 
<colinfo id="intrntStrGrdCd" MapValue="등급" size="256"  summ="default" type="STRING"/>
<colinfo id="rmks" size="256" summ="default" type="STRING"/>
<colinfo id="intrntMembId" MapValue="인터넷회원ID" size="256" summ="default" type="STRING"/> 

<colinfo id="mpnoNatnCd" MapValue="휴대전화번호국가코드" size="256" summ="default" type="STRING"/>	--> 신규 @@@
<colinfo id="mrgCmrtDt" MapValue="웨딩출국일(결혼기념일)" size="256" summ="default" type="STRING"/>	 --> 신규 @@@  
<colinfo id="empAsgmtDvsCdm" MapValue="임직원구분" size="256" summ="default" type="STRING"/>	--> 신규 @@@  
<colinfo id="empno" MapValue="사번" size="256" summ="default" type="STRING"/> 	--> 신규 @@@  
==============================================================================================================

- 눈높이펜 업그레이드(e눈높이한글똑똑 눈높이 음원 댜운로드_
1. 눈높이제품방( > 유아제품방) ==> http://learning.noonnoppi.com/Main/main_nnp.aspx 
2. e눈높이한글똑똑 > 눈높이펜 ==> http://child.noonnoppi.com/Child/eChildKor02.aspx
3. 음원 다운로드 설치 방법 ==> http://child.noonnoppi.com/Contents/Child/ChildPlay/pdf/download_guide.pdf
4. 진수종 회원 번호:, 정용숙 선생님
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.08(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(김치찌개, 예지분석)

- 롯데 면세점 회원통합 Prj[★] 
- gloB+ VIP회원 신규가입(/cs01/CS01_NewIss_M.xml) 수정 ==> 
1. /CS01_NewIss_M_DEFAULT.xml, /CS01_NewIss_M_ID.xml 
-----------------------------------------------------------------------------------------------------------
    	
- dsVipMembInfo DS(VIP회원상세정보 DS)
dsNatltDvsCd: 국적구분 DS 추가
dsTelnoNatnCd: 휴대전화번호 국가코드 DS 추가
dsNatltCdAddr: DM주소 국적 DS 추가
----------------------------------------------------------------------------------

- dsVipMembInfo DS(VIP회원상세정보 DS)
<colinfo id="natltDvsCd" MapValue="국적구분코드" size="256" summ="default" type="STRING"/> 
<colinfo id="intrntStrGrdCd" MapValue="등급" size="256"  summ="default" type="STRING"/>
<colinfo id="rmks" size="256" summ="default" type="STRING"/>
<colinfo id="intrntMembId" MapValue="인터넷회원ID" size="256" summ="default" type="STRING"/> 

<colinfo id="mpnoNatnCd" MapValue="휴대전화번호국가코드" size="256" summ="default" type="STRING"/>	--> 신규 @@@
<colinfo id="mrgCmrtDt" MapValue="웨딩출국일(결혼기념일)" size="256" summ="default" type="STRING"/>	 --> 신규 @@@  
<colinfo id="empAsgmtDvsCdm" MapValue="임직원구분" size="256" summ="default" type="STRING"/>	--> 신규 @@@  
<colinfo id="empno" MapValue="사번" size="256" summ="default" type="STRING"/> 	--> 신규 @@@  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.09(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경), 박근혜 대통령 탄핵안 가결(찬성 234·반대 56)

- 롯데 면세점 회원통합 Prj[★] 
- gloB+ 회원정보관리(/cs02/CS02_MembInfoMgt_M.xml) 수정 ==> 
1. /CS02_MembInfoMgt_M.xml 
log.debug("[/VipMembDAO.java] [updateVipMembInfo()] [회원신상정보 수정] [vipMembInfo]"+ vipMembInfo );
----------------------------------------------------------------------------------

- dsVipMembInfo DS(VIP회원상세정보 DS)
dsNatltDvsCd: 국적구분 DS 추가
dsTelnoNatnCd: 휴대전화번호 국가코드 DS 추가
dsNatltCdAddr: DM주소 국적 DS 추가
----------------------------------------------------------------------------------

- dsVipMembInfo DS(VIP회원상세정보 DS) 
<colinfo id="appPushRecvAgreeYn" MapValue="앱푸시수신동의여부" size="256" summ="default" type="STRING"/> 	--> 신규 @@@  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.10(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
09:00 기상
09:20 조식(라면)
10:00 집출발(수종)
10:10 진료(명소아과): 수종 감기
10:40 조제(래미안 나나 약국): 수종 감기  
11:30 쇼핑(진흥마트: 우유 4개 구입)
11:30 놀이터(구로리 공원): 추움
13:10 종료
13:30 귀가
13:40 중식
16:00 낮잠
17:30 기상
18:00 이마트
19:00 석식(맥스정식, 볶음밥, 아동정식): 루옌, 수종
19:40 종료
20:00 귀가
22:30 취침
==============================================================================================================

- 아이핀 발급(i-pin)[2016.12.10(토)]
1. tamario/ hp태만**1@ --> 2차 비밀번호: hp수종1**1  --> 이전: tamario/ hp수종1**1@ --> 2차 비밀번호: hp수종1**1
2. 발급기관: 한국신용평가정보  
==============================================================================================================
 
- 뉴스
연합뉴스 ==> http://www.yonhapnewstv.co.kr 
YTN ==> http://www.ytn.co.kr/hd/hd_live.html
JTBC ==> http://jtbc.joins.com/onair/onair.aspx
==============================================================================================================

- 쌀 구입 
1. NS홈쇼핑 NS단독 특가 2016년 햅쌀 나주쌀 20kg / 당일도정, 가격: 30,900원(2자루: 61,800원) ==> 옥션
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B273074299&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.11(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
07:00 기상
07:10 자전거(문영APT -> 대림운동장)
07:20 대림운동장(발이 시린 정도로 추움)
08:00 게임(신오 FC, 도신 FC와 게임) ==> 3게임함
12:00 종료
12:20 정기총회 
	1. 임시의장 선출
	2. 회칙 변경: 코치 1명 --> 코치 O명
	3. 차기 회장 선거 
	  1. 이상길(68): 22표 --> 회장 당선
	  2. 이용희: 9표
	  3. 서상배: 10표
	4. 감사 선출
         1. 김양수: 9표
	 2. 김대중: 20표  --> 수석 감사 당선
	 3. 정지경: 10표	--> 감사 당선
13:30 중식(삼겹살: 다솜): 회에서 쏨
16:00 종료 
16:10 귀가
16:30 낮잠
19:00 기상
19:20 석식
00:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.12(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- 국적별 카드발급현황(/cs01/CS01_BydayCardIssPrsts_M.xml) 수정 ==> 
1. 카드발급상세내역 Grid: 해외 국가코드 조회 가능
==============================================================================================================

- 기간별 카드발급현황(/cs01/CS01_PrdByCardIssPrsts_M.xml) 수정 ==> 
1. 조회조건- 점코드(해외) 추가, 발급국가 추가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.13(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- 회원정보변경이력조회(/cs02/CS02_MembInfoChngHistInqry_M.xml) @@@  ==>  
1. 발급국가 추가
==============================================================================================================

- Grid 변경에서 에러 발생
1. 원인: 다국어가 설정 안된 필드명을 Grid changeGrid 함수를 적용하면 width가 없어서 보이지 않은
2. 조치: 다국어가 설정되었는지 확인, 아니면 changeGrid 함수 주석 처리할 것

function changeGrid(obj, clmCd){
grMembInfoChngHistList.AutoFit = false;
	for(var i = 1; i < grMembInfoChngHistList.GetCellCount("Body"); i++){
		var colid = grMembInfoChngHistList.GetCellProp("Body", i,"colid");
		var width = dsWidth.LookUp("colid", colid, "width");
		trace("[/CS02_MembInfoChngHistInqry_M.xml] [changeGrid()] [i_번째]"+ i +"[colid]"+ colid +"[width]"+ width );
		 
		grMembInfoChngHistList.SetColProp(i,"Width",iif(cf_IsEmpty(width), 0, width));	 // width가  없으면 안보이게 처리함 					
	}
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.14(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 21:00  ==> 2016 송년회 모임(소프트원, 19시)

- 롯데 면세점 회원통합 Prj[★] 

- 고객클레임관리(/cs04/CS04_CustClaimMngt_M.xml) @@@  ==>  
1. 발급국가 추가
==============================================================================================================

- VIP회원해외점구매실적조회(/cs02/CS02_VipMembOvsStrPchsActrsltInqry_M.xml) @@@  ==>
1. gloB시스템 VIP회원의 해외 점 구매실적 및 구매상세 자료 조회
==============================================================================================================

- 2016 송년회 모임(소프트원, 19시)
1. 일시: 2016.12.14(수) 19시
2. 장소: 강서구 양천로 743, 나이아가라 호텔 지하 2층 연회장(참석: 80여명)
3. 진행
19:00 ~ 20:00 식사
20:20 ~ 21:00 장기 자랑(3팀)
21:00 ~ 21:30 팀별 소개
21:40 ~ 21:55 O, X 퀴즈
22:00 ~ 22:10 장기 근속자 시상
22:10 ~ 22:20 상품 추첨
22:20 ~ 22:30 종료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.15(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- 국적별 카드발급현황(/cs01/CS01_BydayCardIssPrsts_M.xml) 수정 ==> 
1. 카드발급상세내역 Grid: 해외 국가코드 조회 가능
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.16(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★] 
- 국적별 카드발급현황(/cs01/CS01_BydayCardIssPrsts_M.xml) 수정 ==> 
1. 카드발급상세내역 Grid: 해외 국가코드 조회 가능
==============================================================================================================

- SQL ORACLE 소수점 자리 표시  
/* 102. VIP회원해외점구매실적상세목록 조회 */
SELECT CC.PRDCD /* 상품코드 */ 
	, TO_CHAR(AA.PROD_CRCY_NSALAMT * NVL(BB.GL2_DLR_EXRT, 0), 'fm9999999999999.00') AS DLR_NSALAMT_04
FROM DUAL; 
1. 처리:
to_char(xxx, 'fm9999999999999.00')  as xxx  이렇게 주면 다 해결됩니다.(13자리). .00 은 고정으로 소수2자리를 표현해줍니다. 
.99를 사용하면 0으로 떨어질시 소수점만 출력되거나 한자리 없어집니다 
앞의 fm 은 (+/-)부호처리 그리고 공백없이 처리됩니다 
round는 round(xxx,2) 이렇게 주면 소수3자리에서 반올림해서 2자리표현해줍니다. 
round(xxx,-2) 하면 100단위 반올림해서  100 원단위로 처리됩니다. 
to_char() 와 round() 를 결합해서 출력해주면 됩니다. to_char() 가 바깥에 있어야 되겠죠~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.17(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
09:00 기상
09:20 조식(라면)
10:00 집출발(수종)
10:10 진료(명소아과): 수종 감기
10:40 조제(래미안 나나 약국): 수종 감기 
11:20 핸드폰 매장(KT, SKT) 방문(루옌 핸드폰 내년 상반기에 신규로 구입하리고 결론 냄)
11:30 대림역(6511번 버스)
12:10 봉천중
12:50 글빛정보도서관(2층: 어린이도서관): 수종이 책 읽어 줌
13:30 종료
13:40 피자 스쿨(치즈 피자: 7천원)
14:00 봉천사거리(6511번 버스)
14:30 귀가
16:00 낮잠
19:00 석식
20:30 TV 시청
00:40 취침
==============================================================================================================

- 루옌 핸드폰 구입 검토(10시, 집)
1. 2017년 상반기에 루옌 주민등록증 나오면 명의 변경할 것(지금 번호 그래도 사용할 수 있음)
2. SK 신규 가입, 데이타 요금 1.2G 사용, 갤럭시 S7 사용, 신한카드 한달 30만원 사용 ==> 월 4만 3천원 예상
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.12.18(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
07:30 기상
07:50 자전거(문영APT -> 대림운동장)
08:00 대림운동장  
08:20 자체게임 ==> 4게임함(2게임 래프트위으로 뜀)
10:40 종료(점심 식대는 이제부터 회비가 부족해서 개인 각출한다고 함)
11:00 양평해장국(뼈해장, 3그릇: 양평해장국): 테이크아웃 
12:20 귀가(루옌 짜장면 언니랑 놀러감)
13:00 낮잠
19:00 석식
00:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.19(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(덮밥, 남경), DW팀

- 롯데 면세점 회원통합 Prj[★] 
- gloB+ 소스 반영 체크
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2016.12.20(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:00  ==> 2016 송년회 모임(롯데면세점Prj, 19시): 신촌역, 소고기(육우), 2차: 맥주집

- 롯데 면세점 회원통합 Prj[★] 
- gloB 신규발급(/cs01/CS01_NewIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */ 
==============================================================================================================

- 프로시저(PROCEDURE) 로그
DBMS_OUTPUT.PUT_LINE('PR_WS_WA_IF_CUSTOMS_CRT_MGR(신고파일생성)] [D82: 기용품 용도외처분 보고] 
[WS_WA_기용품신고임시 TB(WS_WA_FLTSALES_H_TEMP) 저장] 세관신고번호(VC_CTM_DECL_NO)' || VC_CTM_DECL_NO );
 
DBMS_OUTPUT.PUT_LINE('[TkinCtmDeclDAO.java] [insertUdapCtmDeclSend()] [세관신고 확정 처리]  [declMap] '|| declMap ); 
DBMS_OUTPUT.PUT_LINE( T_NUM || ' ' || T_NAME || ' ' register is failed!'); 

1. 오라클 DB - PL/SQL, 프로시저 (Procedure)  ==> http://blog.naver.com/PostView.nhn?blogId=javaking75&logNo=140159226620
2. SQLGate for Oracle PL/SQL 쿼리 편집  ==> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.21(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 21:00  ==> 석식(잡채밥, 남경), 다이소에서 어린이날 수종 장난감 구입(어린이집에 보냄), 비 많이 옴

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 신규발급(/cs01/CS01_NewIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

- gloB+ 신규발급(/cs01/CS01_ReIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

- gloB+ 회원정보관리(/cs02/CS02_MembInfoMgt_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.22(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경), 김책임과 DW 일정, 이행 문제로 충돌(심각)

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 신규발급(/cs01/CS01_NewIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

- gloB+ 신규발급(/cs01/CS01_ReIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

- gloB+ 회원정보관리(/cs02/CS02_MembInfoMgt_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.23(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 신규발급(/cs01/CS01_NewIss_M.xml) 수정
1. IND_LMBS_MEMB_YN			 /* 인니롯데멤버스회원여부 추가(2016.12.20, 진태만) */
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.24(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  ==> 

- 주말
09:00 기상
09:20 조식(라면)
10:00 집출발(수종, 루옌)
10:10 진료(명소아과): 수종, 루옌, 수종 감기
10:40 조제(래미안 나나 약국): 수종, 루옌, 수종 감기
11:20 종료
11:30 귀가
14:00 낮잠
17:00 기상
18:00 이마트 구로점(케익 구입)
19:00 귀가
19:20 작은 누나 전화(은아 유치원 교사 시험 친다고 내년 11월까지 우리집에서 기거하게 해달라고 요청)
20:00 루옌에게 양해를 구했는데 불편하다고 거절(장인도 베트남 가라고 화냄 --> 이혼하자고 난리침)
00:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.25(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 성탄절

▦ 조기축구
07:30 기상
07:50 자전거(문영APT -> 대림운동장)
08:00 대림운동장  
08:20 자체게임 ==> 2게임함(1게임 포워드로 뜀)
10:30 종료
10:40 중식(뼈해장국: 전복 꽃게 감자탕&감자탕 식당): 회에서 쏨
	==> 강대훈 동기 다시 가입한다고 함
12:30 종료
12:40 강고문님 댁 지하실(카드 -> 족발, 만원 얻음)
16:30 종료
16:40 귀가
19:30 석식
19:50 루옌에게 사과하고 은아 다음주부터 우리집에서 기거하기로 함 ==> 작은 누나 장난감 사준다고 함
00:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.26(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:00  ==> 석식(탕짜면, 남경), 고의정 사원에서 반출 관련 개발 완료 메일 보냄.

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 수정
12. 기간별 카드발급현황  ==>  /cs01/CS01_PrdByCardIssPrsts_M.xml
==> 신규발급현황 Grid 수정(gloB와 동일하게 수정)
==============================================================================================================
 
- PL/SQL Develper 라이센스 v804[DBMS 관리 프로그램]
Code: jw6frj46k6db55y2yskp43elmjlhsmthl2pcj8ptd35r
s/n: 1883678366
Pw: xs374ca 
==> plsqldev804.exe 다운그레이드 설치(v804)
==> plsqldev1106.exe 업그레이드 하지 말 것(v1106용 라이센스 구할 것)
------------------------------------------------------------------------------------------------------

- PL/SQL Develper 라이센스 906[DBMS 관리 프로그램]
code: A6ST-UFLU-U2WR-DMCV-5VSU-TJMR-HE 
pass: xs374ca 
serial num: 198.84302 
lotte duty free
http://www.allroundautomations.com/registered/plsqldev.html
------------------------------------------------------------------------------------------------------

- squirrel SQL[DBMS 관리 프로그램]
http://opennaru.tistory.com/86
https://www.google.co.kr/#q=squirrel+sql+%ED%95%9C%EA%B8%80
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.27(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 수정
01. VIP회원정보(/cs/cs02/VipMembSQL.xml) 수정
==> 쿼리 수정
==============================================================================================================

02. VIP회원구매실적조회(영문)(/cs02/CS02_VipMembPchsActrsltInqryEM_M.xml) 개발
==> 영문으로 새로 생성, 메뉴 추가
------------------------------------------------------------------------------------------------------

- 02. VIP회원구매실적조회(영문) 프로그램, 메뉴 등록   ===> 개발서버에서 등록할 것
01. 프로그램관리(공통 > 시스템관리 >)
02. 메뉴관리(공통 > 시스템관리 >) 
==> VIP회원구매실적조회(영문)(CS02::CS02_VipMembPchsActrsltInqryEM_M.xml): 메뉴ID: K040239
btRunAdd: 신규
btRunDelete: 삭제
btRunExcel: 다운로드
btRunInit: 초기화
btRunPrint: 리포트
btRunRetrieve: 조회
btRunSave: 저장
==============================================================================================================

- ./images.res
1. bt_21A: 1088*20(bt_21A.Bmp) 파일 추가 ==> images.res(C:\Dev_LDFS\workspace\LDFS\src\main\webapp\ui\ldfs)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.28(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 21:00  ==> 석식(탕짜면, 남경)

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 수정
02. VIP회원구매실적조회(영문)(/cs02/CS02_VipMembPchsActrsltInqryEM_M.xml) 개발
==> 영문으로 새로 생성, 메뉴 추가
==============================================================================================================

-- 여권인식번호  호출
CALL FN_SL_PSPTNO_FIND_GL1('R2', 'A7944268')		--// 여권인식번호 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.29(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:00  ==> 석식(탕짜면, 남경), 최재식 이사가 커피샵에서 퇴사 지시(조대표에게 전화)

- 롯데 면세점 회원통합 Prj[★]  
- gloB+ 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.30(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:00  ==>  
 
- 롯데 면세점 회원통합 Prj[ 철수[★]
06:00 기상
06:30 [보고] 현상황에 대한 저의 입장 메일 작성 후 조대표, 조사장, 곽차장에게 보냄
08:00 출근
09:30 인수인계자 도착(장소영 과장[롯데 면세점 경험자, 육아 휴직 중, 남편 빈혈 환자, 골수 이식 예정])
09:40 이진정 책임에게 반말 한다고 한소리 함  
09"50 장소영 과장과 면담
11:30 중식(김치찌개): 예지식당 ==> 장소영 과장
12:30 종료
12:40 커피: 장소영 과장이 쏨
12:50 커피 shop: 최재식 이사가 SSD 구입한다고 하길래 거절함, 오늘 철수 시켜 달라고 함 ==> 오늘 철수로 결정남
14:00 장소영 과장에게 인수인계함
16:00 조대표님에게 전화 옴 ==> 다음주 월요일 본사에 출근해서 이야기 하자고 함
17:00 종료
17:30 롯데면세점 빌딩 19층에 노트북 맡김 ==> 내 노트북 데이타 복사, SSD 포맷 후 기존 하드를 노트북에 끼움 
19:30 철수 
20:30 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2016.12.31(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:00  ==> 

- 롯데 면세점 회원통합 Prj[ 철수[★]
08:30 기상
08:40 조식(라면)
09:30 집출발(장인 병원 진료 : 루엔 같이 감)
09:40 진료(명소아과): 수종 감기
09:50 조제(래미안 나나 약국): 수종 감기
10:30 귀가
12:00 중식
12:30 낮잠
17:00 내방 청소
17:30 은아 도착(짐 안들고 옴)
18:30 집출발
19:00 준수네고기생각 ==> 삼겹살, 주물럭, 맥주, 밥: 은아, 루옌, 장인 --> 6만 5천원 나옴
20:00 독서실, 구로 도서관, 청소년 독서실 알아보기 동행(은아)
21:00 귀가
23:30 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■