  

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.12.01(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:15 ~ 18:00 --> 나눔동기 만남 

- IMK 차세대Prj
- 회사/사업장 조회 팝업(MSCMM15P) 화면에서 비영업용 회사는 조회되지 않도록 변경 
1. DVS_CD 가 B이면 고객구분을 회사로 default Setting 후 변경불가처리 
2. 원자재 회사만 조회 되도록 처리해야 함 
3. 기준정보 > Buyer정보관리 > 고객프로파일관리(BYSIM05M) ==> 등록: 회사/사업장 조회 팝업(MSCMM15P)  
==============================================================================================================

- 사업장조회(HUCUM63M) 수정 
1. 사업장조회(MSCUM35M) 참조 
==============================================================================================================

- 나눔동기 만남(현용, 임모): 신도림역(19시) 
1. 삼겹살집, 소주집, 소주집, 당구장(승: 임모 꼴찌), 꼼장어집 
2. 현용 급여 대신 받아 달라고 요청 
3. 임모애 돌[2012.01.08(일)]
4. 2시 40분 종료(택시: 만 천원) 
==============================================================================================================

- TAMA 자산(2011) ==> 2011.11.30 @@@@@@@@@@@@@@@  
총 합계: 233,374,801 
==============================================================================================================

- 스마트폰 검색(SK로 번호이동시) @@@@@@@@ 
1. 캘럭시A(삼성): 24개월약정, 자유요금제 1. 캘럭시 지오(삼성): 12개월약정, 자유요금제  
==> http://itempage3.auction.co.kr/DetailView.aspx?itemno=A578870558&frm3=V2 
2. 미라크A(스카이): 24개월약정, 자유요금제 ==> http://itempage3.auction.co.kr/detailview.aspx?ItemNo=A532358268 
3. 베가S(스카이): 24개월약정, 자유요금제 ==> http://www.ppomppu.co.kr/zboard/view.php?id=ppomppu2&no=19163 
4. X10 MINI(소니에릭슨): 12개월약정, 자유요금제 ==> http://mall.t-view.kr/view/product/product_view.php?no=270 
5. 캘럭시A(삼성): 24개월약정, 무료음성19요금제 ==> http://itempage3.auction.co.kr/DetailView.aspx?itemno=A587303787&frm3=V2 
6. 캘럭시 지오(삼성): 12개월약정, 자유요금제 ==> http://itempage3.auction.co.kr/DetailView.aspx?itemno=A590456557&frm3=V2  
==============================================================================================================

- 노트북 
http://www.danawa.com/product/list.html?defSite=NOTEBOOK&cate1=860&cate2=869&cate3=&cate4 ==> e-SATA, USB 3.0, HDMI 
0. MSI GT683 i7 Midas, OS미포함, 가격: 1,237,000원 
http://blog.danawa.com/prod/?section_m=NOTEBOOK&prod_c=1429979&cate_c1=860&cate_c2=869&cate_c3=12734&cate_c4=0 
1. MSI GX660DX-i7 Crown, OS미포함, 가격: 1,879,000원 
http://blog.danawa.com/prod/?section_m=NOTEBOOK&prod_c=1433272&cate_c1=860&cate_c2=869&cate_c3=12734&cate_c4=0 
2. MSI GT683DX-i7 SSD+ Edition (정품), OS미포함, 가격: 1,686,000원 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=12734&cate_c4=0&depth=3&prod_c=1542262 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=10585&cate_c4=0&depth=3&prod_c=1374536 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=10585&cate_c4=0&depth=3&prod_c=1447308 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=10580&cate_c4=0&depth=3&prod_c=1510375  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.02(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:10 --> 야근(팬다), 자리 옮김(중간 지점: 3번째 옮김) 

- IMK 차세대Prj
- 사업장조회(MSCUM35M) 수정 
var toDate = new Date(); ===> var objDate = new Date(gv_currentDate); //서버 시간 가져 오기 
==============================================================================================================

- mask 처리 
expr:custRegSeq ==''  custRegSeq == null ? '':'0000' 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.03(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:20 --> 토요근무, 중식(낚지촌), 비닐(옷거리용[150cm*100cm], 유리창[150cm*140cm]) 구입 및 설치 

- MP Hub 품목 DashBoard 수정 
1. 등록건수 합계 데이타값 확인 ==> 정상 
2. 품목 Chart에서 등록 건수 지표 수정(UI --> UI, I/F, Bulk) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.04(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
07:50 기상 
08:50 신구초등학교 
09:00 조기축구(7:5 승): 1G, 1AS 
11:00 종료 
11:20 중식(문경세재: 영민이형이 내 밥값 내줌) 
14:30 귀가 
12:50 낮잠 
16:40 기상 
17:40 서울대입구역 
18:10 철산역 1번 출구 
18:20 포메인(베트남 쌀국수집) 
18:45 권희진(지각함) 
18:50 석식(닭가슴 볶음밥: 권희진씨가 쏨) 
19:30 락애락(칵테일: 내가 쏨): 두레생협(http://www.bsdure.or.kr): 부천시 원미구 상3동 587-1 크라운빌딩 205호 
21:00 종료 
21:30 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(포시즌) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 조회 조건 확인 
1. 팀(teamId)(COST_CENTER 코드), 파트(partId)(파트ID(COST_CENTER의 뒷자리 4개)) 파라미트를 넘겨서 처리 
==============================================================================================================

- 반품교환 조회 화면에서 물류유형이 STOCK인 물품을 직납으로 표시 
1. 주문번호: 2015539145, RA21000441 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.06(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:00 --> 야근(포시즌), 신안저축은행 예금, 적금 가입 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 희망일(Calendar) 공휴일 선택 alert 처리(DB에서 조회 안하도록 수정)  
==============================================================================================================

- 신안저축은행 예금, 적금 가입 
1. 신안저축은행: http://www.shinanbank.co.kr ===> tamario2/s*p***8**1 
1) 계좌번호: 038-01-21-0093579 [저축예금] 
2. 자동이체 신청 
1) 당행입금계좌번호(038-01-31-0346390), 출금계좌: 제일은행(13020502841), 이체일자: 6일, 이체금액: 500,000원 
==============================================================================================================

- PC 부품 중고 가격 사이트: http://www.topc.co.kr 
- C9(http://www.cloud9.co.kr): 서울시 금천구 가산동 롯데IT캐슬 2동 610호 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.07(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:00 --> 야근(포시즌) 

- IMK 차세대Prj
- MP대시보드 왼쪽 메뉴 부분 수정 
1. PO잔량, 미결현황 JCO 연결에서 DB 조회로 변경 
==============================================================================================================

- 회사조회팝업(MSCMM13P) 수정 ==> 미존재 
- 회사조회팝업(HUCMM15P) 수정 ==> 미존재 
- 조직조회팝업(MSCMM16P) 수정 
gfn_msgPopup("ACMCM0002", "A", "E",["bp"]); // 사업장 ==> alert("{사업장}은(는) 필수입력 항목입니다"); 
- 조직조회팝업(MSCMB16P) 수정 ==> 미존재 
- 사업장조회팝업(MSCMM14P) 수정 ==> 미존재 
- 사업장조회팝업(HUCMM16P) 수정 ==> 미존재 
- 회사/사업장 조회팝업(MSCMM15P) 수정 
gfn_msgPopup("AMSCM0003", "A", "E"); // alert("선택된 데이터가 없습니다."); 
==============================================================================================================

- 반품교환관리(BYERM18M), 반품교환처리현황(BYERB01M), 
G-ERP 반품교환관리(GLOMGH0M), 간소화 반품교환관리(STERD10M) 수정 
gfn_msgPopup("ABYER0003", "A", "E"); // alert("복수의 행이 선택되었습니다."); 
gfn_msgPopup("ABYER0004", "A", "E"); // alert("선택된 행이 없습니다.");  
==============================================================================================================

- 사업장조회(HUCUM63M) 수정 
1. 사업장조회(MSCUM35M) 참조 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:15 ~ 21:00 --> 야근(포시즌) 

- IMK 차세대Prj
- 사업장조회(HUCUM63M) 수정 
1. 사업장조회(MSCUM35M) 참조 
==============================================================================================================

- 팝업 파라미터 처리 ==> 고객프로파일관리(BYSIM05M)에서 
var gDvsCd ; //최상위품목분류코드(A:일반, B:원자재, C:사은품) 

if(gfn_IsNull(this.getOwnerFrame().dvsCd)) {	 //팝업 파라미터가 null 이면 
	gDvsCd = "A"; 
} else { 
	gDvsCd = dvsCd; 
} 
==============================================================================================================

02. 반품교환요청 POP(BYERB02P) 메시지 처리 
gfn_msgPopup("ABYER0007", "A", "E"); // alert("반품 요청 수량을 입력해 주세요."); 
gfn_msgPopup("ABYER0008", "A", "E"); // alert("교환 요청 수량을 입력해 주세요."); 
gfn_msgPopup("ABYER0009", "A", "E"); // alert("이 품목의 가능수량을 초과 하였습니다."); 
gfn_msgPopup("ABYER0010", "A", "E"); // alert("요청수량은 0보다 커야합니다."); 
gfn_msgPopup("ABYER0011", "A", "E"); // alert("요청수량이 없습니다."); 
gfn_msgPopup("ABYER0012", "A", "E",["reqAgd"]); // alert("{("요청사항}을(를) 입력하세요."); 
gfn_msgPopup("ABYER0013", "A", "E",["dtldRsn"]); // alert("{상세사유}를 선택하세요."); 
gfn_msgPopup("ABYER0014", "A", "E",[strPlusWorkingDate_f]);  
// alert("희망일은 "+ strPlusWorkingDate_f +" 이후여야 합니다.(현재일 +2 영업일부터 가능)"); 

04. 요청취소사유 POP(BYERB04P) 메시지 처리 
gfn_msgPopup("ACMCM0002", "A", "A",["canRsn"]); // alert("{취소사유}은(는) 필수입력 항목입니다"); 
gfn_msgPopup("ABYER0002", "C", "Q"); // alert("요청취소 하시겠습니까?"); 
gfn_msgPopup("ABYER0005", "A", "E"); // alert("정상적으로 등록되었습니다."); 
gfn_msgPopup("ABYER0006", "A", "E"); // alert("등록에 실패했습니다."); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:00 --> 야근(팬다), 석식(탕수육: 만 6천(최병석 과장, 내가 쏨)) 

- IMK 차세대Prj
- 반품교환관리(BYERM18M) 수정 
1. 반품교환관리(BYERM18M), 반품교환처리현황(BYERB01M)에서 Grid 클릭한 칼럼값 숫자로 인식하는 문제 수정 
2. if(e.col == 1) ==> if(e.col == gfn_getGridBindCellIdx(obj ,"itmCd"))로 처리 
3. 적용 화면 
01. 반품교환처리현황(BYERB01M) 
18. 반품교환관리(BYERM18M) 
21. G-ERP 반품교환관리(GLOMGH0M) 
22. 간소화 반품교환관리(STERD10M) 
------------------------------------------------------------------------------------------------------------ 

- 선택한 칼럼 인덱스값 처리(COMTRAN.xjs) 
//trace("[/MSCUM35M.xfdl][grd_businessPlace_oncellclick()] [e.cell]"+ e.cell +"[nIndex]"+ gfn_getGridBindCellIdx(obj ,"bpCustNm") ); 

if(e.cell == gfn_getGridBindCellIdx(obj ,"bpCustNm")){ //클릭한 칼럼이 사업장 칼럼 이면 
var sFormName = "사업장수정"; 
//"사업장수정(HUCUM64T)으로 이동 
fn_open_businessPlace(dsBusinessPlaceSearchDVOList.getColumn(dsBusinessPlaceSearchDVOList.rowposition,  
"cpCustId"), dsBusinessPlaceSearchDVOList.getColumn(dsBusinessPlaceSearchDVOList.rowposition, "bpCustId"), sFormName); 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.10(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 16:40 --> 토요근무, 중식(샤브샤브), 권희진(*@*.*): 스마트폰 검색해서 메일보냄 

- IMK 차세대Prj
- MP 영업 DashBoard(왼쪽 메뉴)(comMainLeftMB) 수정 
==============================================================================================================

06:30 기상 
07:30 출근 
12:20 중식(샤브샤브): 박성원 책임 
16:40 퇴근 
16:45 버스(2415번: 포스코사거리) 
16:55 청담역 
17:30 광명사거리역 
17:50 석식(푸딩플러스): 권희진씨, 내가 쏨 ==> 스마트폰 검색해서 알려줌 
19:50 CGV영화(오싹한 연애): 권희진씨, 내가쏨 
22:00 종료 
22:30 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.11(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
08:00 기상 
08:50 신구초등학교 
09:00 조기축구: 연예인팀 초청 
10:30 조기축구(3:0 패): 연예인팀(프랜즈: KBS 드라마 사랑과 전쟁)
12:00 조기축구(2:1 승): 연예인팀 
12:40 중식(문경세재: 만원) 
13:00 종료 
13:20 마을버스(신사역: 서초03번) 
13:30 강남역 
13:40 수화(몸무게 76kg) 
14:00 그림이(2S: A IN Mode(감동)) 
15:05 종료 
15:20 낮잠(쥐나서 2번 깸) 
20:00 기상 
20:10 석식(백반, 양말) 
20:20 종료 
20:40 귀가 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:00 --> 야근(포시즌) 

- IMK 차세대Prj
- MSCUM66T: MP 회사상세조회 개발 
MSCUM62S1: 회사 기본정보 
MSCUM62S2: 회사 수주정보 
MSCUM62S3: 회사 프로세스정보 
MSCUM62S4: 회사 여신 및 채권정보 
MSCUM62S5: 회사 거래유지정보 
MSCUM62S6: 회사 부가정보 
MSCUM62S7: 회사 - 품의정보 
==============================================================================================================

- import secui.* 에러 
1. 현상: secui.*. 빌드 에러 
2. 해결: D:\02. TAMA Project\2011.06(IMK 차세대Pro_신진)\99. 작업 Back up\secui.jar 복사해서 C:\workspace 
\imk_pjt\webapps\WEB-INF\lib폴더에 붙어넣기 ==> eclipse 재실행 

- COencapi 에러 
1. 현상: no COencapi in java.library.path 에러 
2. 해결: D:\02. TAMA Project\2011.06(IMK 차세대Pro_신진)\99. 작업 Back up\cubeone.properties 복사해서  
C:\workspace\imk_pjt\src\main\resources\properties폴더에 붙어넣기 ==> eclipse 재실행 

==> DB 암호화 로컬 서버 설치 http://122.1.20.30:8899/projects/DevGuide/wiki/cubeon%20env 
==============================================================================================================

- 사업장조회팝업(MSCMM14P)에서 return parameter 추가 
MRODV_ORGN -- MRO 사용여부 
RMTDV_ORGN -- 원자재 사용여부 
FFIDV_ORGN -- 사은품 사용여부 

- 사업장조회 예제 
MACUST_ID MICUST_ID CUST_REL_CD CUST_REL_DTLD_CD 
* 1000878 B03 * 
1000878 1000777 B04 * 
1000777 Z000123 E07 A 
1000777 Z000125 E07 B 
1. MACUST_ID: MASTER CUST_ID 
2. MICUST_ID: MINER CUST_ID  
3. CUST_REL_CD /* 고객관계코드[HT003](B03:회사, B04:사업장, B06:조직, E07:사업장담당자(DM)) */ 
4. CUST_REL_DTLD_CD /* 품목Division코드(A:MRO, B:원자재, C:사은품) */ 

- 사업장조회 @@@@@@@@@@  
SELECT 'Y' 
FROM MCUTG1160 X1 
WHERE T1.CUST_ID = X1.MACUST_ID 
AND X1.CUST_REL_DTLD_CD = 'A' /* 품목Division코드(A:MRO, B:원자재, C:사은품) */ 
AND X1.CUST_REL_CD = 'E07' /* 고객관계코드[HT003](B03:회사, B04:사업장, B06:조직, E07:사업장담당자(DM)) */ 
AND X1.VALI_TO_DT = '99991231235959' 
--; 
==============================================================================================================

- SQL 표준 정리 
1. 글꼴(F): Courier New, 글꼴모양(Y): Regular, 크기(S):10 
2. 탭과 공백 기호(A) 
==============================================================================================================

- 황현용 급여 송금 
1. 우리은행: 1002-235-280580 황현용, 급여: 4,029,186원 송금 
==============================================================================================================

- 다리에 쥐나는 현상 분석 
1. 다리에 쥐가 나는 원인은 근육의 성장 속도가 뼈의 성장 속도를 따라가지 못할 때(어린이,청소년), 무리한  
운동이나 작업으로 인하여 근육내의 영양분. 산소가 결핍되여 노폐물(젖산)이 쌓일 때. 탈수 증상, 신경계의  
이상, 혈액순환 장애를 유발하는 질병 등 입니다. 
2. 쥐가 나는 곳은 종아리, 발(발가락). 
3. 쥐가 일어나는 시기는 잠잘 때,기지개를 펼 때, 운동할 때. 
4. 대처방법은 스트레칭, 발의 앞 꿈치를 세게 뒤로 저친다. 
5. 예방은 운동중에는 전해질이 함유된 스포츠 음료(이온음료)를 마시고, 평상시에는 비타민B1 또는 마그네슘이  
풍부한 바나나, 견과류(호두, 아몬드)를 먹는다. 
==> 다리를 쭉 편 채로 엄지 발가락을 위로 젖히고 쭉 당겨서 들어 올리면 이내 풀어집니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌), 현대스위스2저축은행 적금 가입(50만원) 

- IMK 차세대Prj
- 회사사업장조회(MSCMM15P) 수정 
1. 회사명(고객사명) 추가 요망  
==============================================================================================================

- 조직조회(HUCUM66M, MSCUM31M) 수정 
1. 조직ID로 조회 시 조직분류 필수값으로 존재함 필수값에서 제외 시키고 조직ID 기준으로 만 조회 되도록 처리 
==============================================================================================================

- DB 암호화 로컬 처리 
1. CompanyBiz.java파일에서  
String dbDec = CommonUtil.setCubeEncDec("dec", companySVO.getHByVrtlBaccDVO().get(0).getBaccNo());  
//주석처리할 것 
==============================================================================================================

- IMK사원조회(MSCMM17P) 수정 
1. 제목 오류: 10으로 표기됨(IMK 사원 조회(UT_IM0010 --> imkEmpInq)) 
2. 품목관리 > Catalog 검색 > 상세검색 > 1203096000 (품목코드입력) > 조회 > 견적생성진행 > 견적서 요청에서  
담당자 아이콘 선택 > IMK 사원조회 화면 
==============================================================================================================

- 제일은행 이체한도 증액 포기(선릉점 방문) 
1. 1회 천만원에서 오천만원으로 증액 ==> 월 900원 SMS 전송 서비스에 가입해야 한다고 함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌), 크롬 설치(IE Tab(Active X 이용), 로보폼 설치) 

- IMK 차세대Prj
- 회사상세조회(MSCUM66T) 개발 
MSCUM62S1: 회사 기본정보 
MSCUM62S2: 회사 수주정보 
MSCUM62S3: 회사 프로세스정보 
MSCUM62S4: 회사 여신 및 채권정보 
MSCUM62S5: 회사 거래유지정보 
MSCUM62S6: 회사 부가정보 
------------------------------------------------------------------------------------------------------- 

ByCustAddressDQM.dListCustAddress, --> 01. 고객주소 조회 
ByCustAddInfoDQM.dListhAddedInformation, --> 02. 고객간관계 조회 
ByBusinessManDQM.dListBusinessMan, --> 03. 사업자 정보 조회 
ByCustCntcChnlDQM.dListContactChannel, --> 04. 고객연락채널 조회 
ByCustAddressDQM.dListCustAddress, --> 05. 고객주소 조회 
ByOodInfoDQM.dListHobtainOrderInformation, --> 06. 수주정보 조회 
ByOodPlnTagtDQM.dListHobtainOrderPlan, --> 07. 수주계획목표 조회 
ByCustRolDQM.dListHcustomerRole, --> 08. 고객역할 조회  
ByBycpTaxBillTypeDQM.dListHTaxBillType, --> 09. 고객사세금계산서유형 조회 
ByBycpAttDtldDQM.dListAttDtld, --> 10. 고객속성수정여부 조회 => MP사용 
ByBycpAttDtldDQM.dListNseChk, --> 10. 필수체크여부 조회여부 
ByPcesCtrDQM.dListPcesCtr, --> 11. 프로세스기준 조회 
ByCustRelDQM.dListCustRel, --> 12. 고객간관계 조회 
ByOrgHrchDQM.dListOrgHrch, --> 13. 조직체계 조회 
ByVrtlBaccDQM.dListVrtlBacc, --> 14. 가상계좌 조회 
==============================================================================================================

- OT상세화면에서 반품교환상세내역 확인 
1. 주문번호: 2015680144, 요청번호(반품번호): RA21000028 ===> R서버 
==============================================================================================================

- eclipse 패키지 폴더명 수정 및 이동 
1. eclipse > Refactory ==> Rename 
- eclipse History 파일 변경 
2. 톰캣 실행 상태에서 해당 파일 ==> Get Revision(이전 버전 얻기) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:10 --> 야근(포시즌), 품질과 납기에 대한 결의대회(17:00 ~, 호경신PM), 자리 옮김(창쪽: 4번째 옮김) 

- IMK 차세대Prj
- 사업장상세조회(MSCUM67T) 개발 
MSCUM64S1: 사업장 기본정보 
MSCUM64S2: 사업장 프로세스정보 
MSCUM64S3: 사업장 여신 및 채권정보 
MSCUM64S4: 사업장 거래유지정보 
MSCUM64S5: 사업장 부가정보 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.16(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 --> 야근(팬다), 선풍기 청소 

- IMK 차세대Prj
- 사업장상세조회(MSCUM67T) 수정 
1. MSCUM64S2: 사업장 프로세스정보 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.17(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:40 --> 토요근무, 중식(팬다: 쟁반짜장), 석식(김밥, 떡뽁기: 최과장, 전병석 차장 쏨), 피자(못 먹고 퇴근) 

- IMK 차세대Prj
- 반품교환 결제 유형 추가 
1. 실시간 계좌이체 추가: 1130 ==> 지불유형코드(A뱅크:계좌이체, V뱅크:무통장(TEST용)) 

- 카드결제 취소 정의 
1. 주문클래임카드내역(TORTG2540) TB은 데이타는 외부에서 제공 되어 져야 함 
(클레임등록여부(CLM_REG_YN) 필드가 NULL이여야 함) 
2. 반품교환관리(BYERM18M)에서 클레임등록여부(CLM_REG_YN)필드가 삭제(C)가 아닌 것만 조회 
3. 반품교환 카드취소(BYOMB74P) 시에 클레임등록여부(CLM_REG_YN)필드가 삭제(C)로 UPDATE 처리 
--------------------------------------------------------------------------------------------------------------------- 

- 주문 처리 절차 @@@@@@@@@@@ ==> 신용카드 주문 
A: BY 화면단에서 처리 
1. 로그인: 주문자ID(Z0678234) 
2. 주문처리 > 주문생성 > Catalog검색(BYOMBOOM): 상세검색(Tab: 클릭) --> 품목코드(1400018400), 조회 
(안 보임: 근처 클릭할 것) --> 바로구매(버튼: 클릭) --> Check/저장(버튼: 클릭): alert(저장되었습니다.) 
--> 주문(버튼: 클릭: 카드사선택(새창) 
카드 결제 처리(완료) 
3. 주문 > 주문배송현황 > 주문배송현황(BYOMB31M): 조회(확인) 

B: MP 화면단에서 처리 
1. 발주관리 > 납품 관리 > 납품예정관리(PUDMM20M): 주문번호(2015680933): 조회 --> 납품예정일, 납품예정수량 설정 
==> 저장 
2. 발주관리 > 운송관리 > 운송지시(PUDMMA0M): 주문번호(2015680933): 조회 --> 운송대상 그룹 Grid: 물류(직납): 클릭 
--> 운송대상 품목 Grid(대상 클릭) --> 품목별 운송지시(새창): 저장 
3. 주문관리 > 주문관리 > 유형별 주문현황(BYOMM11M): 주문번호(2015680933): 조회 --> Grid 상태 필드: 운송중(확인) 
--------------------------------------------------------------------------------------------------------------------- 

--카드 결제 정보 조회 @@@@@@@@@@@@@ ==> 카드결제여부 
SELECT T1.STL_ID AS 결제ID /* 승인번호/현재날자+랜덤키5자리 */ 
,T1.ORD_ID AS 주문번호 
,T1.PMT_TP_CD AS 지불유형코드 
,T1.STL_STU_CD AS 결제상태코드 /* 결제상태코드(50:승인, 51:승인취소) */ 
,T1.* 
FROM TORTG1130 T1 /* 카드 결제 TB */ 
WHERE 1 = 1 
AND T1.ORD_ID = '2015680933' /* 주문번호 */ 
--AND T1.PMT_TP_CD IN ('VBANK') /* 지불유형코드(ISP:신용카드, VISA:신용카드, VBANK:계좌이체, V뱅크:무통장(TEST용)) */ 
; 

--주문클래임카드내역 조회 @@@@@@@@@@@@@ ==> 카드(계좌이체)반영대상 
SELECT T1.ORD_ID AS 주문번호 
,T1.ORD_ITM_ID AS 주문품목ID 
,T1.ORD_CLM_ID AS 주문클레임ID 
,T1.* 
-- SELECT COUNT(*) 
FROM TORTG2540 T1 /* 카드 결제 TB */ 
WHERE 1 = 1 
--AND T1.ORD_ID = '2015680933' /* 주문번호 */ 
AND T1.ORD_CLM_ID = 'RA21000101' /* 주문클레임ID */ 
--AND T1.CLM_REG_YN IN ('Y') /* 클레임등록여부(Y:등록=> 1194건, C:삭제=> 0건) */ 
; 
==============================================================================================================

- 회사사업장조회(MSCMM15P)에서 고객구분(dsCpBpType) datasset에서 onrowposchanged 적용 안됨 
1) onrowposchanged는 Dataset의 rowposition이 변경된 후에 발생하는 Event 
2) 고객구분(cbo_bycpClsf) 콤보는 Dataset의 개념이라 보기 힘듬(인프라 파트 양경호 과장 의견) 
3) 테스트 결과 고객구분(cbo_bycpClsf) 콤보는 rowposition을 인식하지 못 함 
4) 고객구분(dsCpBpType) datasset에서 onrowposchanged은 주로 Grid에 사용 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.18(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
07:30 기상 
08:40 신구초등학교 
09:00 조기축구(7:6 패) 
10:30 종료 
11:20 중식(문경세재: 만원) 
12:20 종료 
13:20 선릉역 
13:30 산소(몸무게 75.5kg) 
14:10 제시카(2S: A IN Mode(하드), 대구): 17만 
15:05 종료 
15:20 낮잠 
17:00 기상 
17:10 석식(백반) 
18:20 종료 
18:40 귀가 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.19(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(석식: 부대찌게 -> 최과장이 쏨), 김정일 위원장 서거 

- IMK 차세대Prj
- 반품교환 결제 유형 추가 
1. 실시간 계좌이체 추가: 1130 ==> 지불유형코드(A뱅크:계좌이체, V뱅크:무통장(TEST용)) 
==============================================================================================================

- 올앳 적용 대상 카드 내역 INSERT 
1. 반품교환요청(BYERB02P)에서 반품 요청일 경우 ==> 주문클래임카드내역(TORTG2540) TB에 카드결제 건 INSERT 
2. 주문클래임카드내역(TORTG2540) TB 사용 목적 ==> 올앳(Van)카드 결제가 반품에 대해 하루에 한번밖에  
결제를 처리 못 함(하루에 한번 모아서 결제 처리) 
==============================================================================================================

- SQL 표준 정리 
1. 글꼴(F): Courier New, 글꼴모양(Y): Regular, 크기(S): 9 ==> 배경색: 76, 78, 194 
2. 탭과 공백 기호(A) 
3. UltraEdit v14 설치(wo7adm/TULMB-SNRPV-PLLCK-IJQCI-VBLOM-IMMKH-MTMUY-EROMK) 
1) Fixedsys 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.20(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌), SDS 서성혁씨 봉천동 이사 

- IMK 차세대Prj
- 반품교환 결제 유형 추가 
1. 실시간 계좌이체 추가: 1130 ==> 지불유형코드(A뱅크:계좌이체, V뱅크:무통장(TEST용)) 
2. 반품교환관리(BYERM18M) ==> 카드반품리스트(BYOMB75P)  
2. 주문수정취소 카드취소(BYOMM90P) > 카드취소(BYOMB74P) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.21(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌), IMK Prj 연장 제안(내년 4월까지, 정수석), 권희진씨에게 사과 받음 

- IMK 차세대Prj
- 조직조회 팝업(MSCMB16P) 수정 
1. 조회조건: 조직분류 콤보 추가, Grid 조직분류 칼럼 제거 
2. 데이타 확인 
1) 삼성전기(주) ==> 사업장:수원사업장, 사업부: 광Device, 부서: 화합물DEV자기응용제 
==> 자재관리 > 재고관리 > 재고이동(BYMCB11M) 
==============================================================================================================

- 조직조회 팝업(MSCMM16P) 수정  
1. 조회조건: 조직분류 콤보 추가, Grid 조직분류 칼럼 제거 
2. 데이타 확인 
1) 삼성전기(주) ==> 사업장:수원사업장, 사업부: 광Device, 부서: 화합물DEV자기응용제 
==> [BY] 자재관리 > 재고관리 > 재고이동(BYMCB11M) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.22(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(포시즌: 동지 팥죽), 중식(물류 3셀 & PM): 프로간장게장 

- IMK 차세대Prj
- 아모레퍼시픽 반품요청 시, 부분반품 못하도록 수정 
==============================================================================================================

- 멀티콤보 검색 
Map paramMap = customerSearchSVO.toMap(); 
String multicpCustType = (String)paramMap.remove("multicpCustType"); 
paramMap.put("multicpCustType", IMKStringUtil.stringToList(multicpCustType, ",")); // 멀티콤보 검색(회사타입) 
1. multicpCustType값 ==> '10021126, 10021131' --> '10021126', '10021131'로 변경 
2. AND T1.CUST_ID IN (:multicpCustType)  
==> AND T1.CUST_ID IN ('10021126, 10021131') --> AND T1.CUST_ID IN ('10021126', '10021131') 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.23(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(팬다), IMK Prj 연장 제안(내년 5월 중순 까지, (주)아엘포유 김성채 팀장) 

- IMK 차세대Prj
- 아모레퍼시픽 반품요청 시, 부분반품 못하도록 수정 
1. 기준정보 > Buyer정보관리 > 업무룰관리(MSCUM61M) 
2. 주문현황통합(BYOMM11M) 파일에서 BYOMB14M.xjs 
==============================================================================================================

- 미수채권 BW연동을 위한 인터페이스 정의서 작성 
==============================================================================================================

- G-ERP 반품교환관리(GLOMGH0M) 현행화 
==============================================================================================================

- 구로디지털단지역 근처 맛집 
1. mayB: http://local.daum.net/localn/header.html?url=http://blog.daum.net/bori11972/8602565 
1) T)859-3073, 주소: 서울 구로구 구로동 1124-49(구로디지털단지역 3번 출구 앞) 
2. 오늘 한점: http://local.daum.net/localn/header.html?url=http://blog.daum.net/bori11972/8602565 
1) 주소: 서울 구로구 구로동 1124-36(구로디지털단지역 2번 출구 --> 미니스톱 골목길 -> 와사비 앞) 
3. 한우농장: http://local.daum.net/localn/header.html?url=http://marketing360.tistory.com/422 
4. 이자까야-유다: http://local.daum.net/localn/header.html?url=http://blog.daum.net/designbee/12  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.24(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 18:20 --> 토요근무, 중식(순대국집: 해장국) 

- IMK 차세대Prj
- BW-미수채권 관련 Query 정보 연계확인 
==============================================================================================================

- MP Dashboard 정리 
1. 매출은 BW + 당일 SD 
2. 하단 주요지표는 BW기준으로 정리 
3. 좌측패널은 주요지표는 현재를 유지하되 DBA가 MView 반영되면 적용[OK] 
==============================================================================================================

- MP 영업 DashBoard(왼쪽 메뉴)(comMainLeftMB) Grid 링크 처리 
1. 대시보드 PO잔량을 클릭하면 유형별주문현황과 링크 처리 해야 함 
MP05120000: 유형별 주문현황(BYOMM11M) 
5. 대시보드 납품미결을 클릭하면 납품현황과 링크 처리 해야 함 
MP06210000: 납품대상조회(PUDMM20M) 
6. 대시보드 입고미결을 클릭하면 미입고현황과 링크 처리 해야 함 
MP06410000: 미입고현황(PUDMMF0M) 
2. 대시보드 GR IF Error을 클릭하면 GR IF ERROR 화면과 링크 처리 해야 함 
MP08210000: GR IF Error(BYIMM01M) 
3. 대시보드 PO IF Error을 클릭하면 PO IF ERROR 화면과 링크 처리 해야 함 
MP08110000: PO IF ERROR(BYIMM00M) 
4. 대시보드 교환/반품을 클릭하면 공급사 교환반품현황과 링크 처리 해야 함 
MP06510000: 반품교환관리(GLOMGH0M) 
대시보드 미수채권 BW 연계해서 상세화면 링크 처리해야함 

--메뉴관리 정보 조회 @@@@@@@@@@@@@@@@@@@@ 
SELECT A.MU_ID AS 메뉴ID 
,B.PIC_URL_ADDR AS 화면URL주소 
,A.PIC_ID AS 화면ID 
,B.PIC_NM AS 화면명 
,A.HRK_MU_ID AS 상위메뉴ID  
,A.SYS_GB_CD AS 시스템구분코드 
,LEVEL AS LVL 
,A.MU_KOR_NM AS 메뉴한글명 
FROM CUSTG0020 A, CUSTG0030 B /* 메뉴 TB, 화면[기능] TB */ 
WHERE 1 = 1 
AND A.PIC_ID = B.PIC_ID(+) 
AND SYS_GB_CD = 'MP' --시스템구분코드 
AND PIC_NM LIKE '%채권%' --화면명 
AND TO_CHAR(SYSDATE, 'YYYYMMDDHH24MISS') BETWEEN A.VALI_FR_DT AND 
A.VALI_TO_DT 
CONNECT BY PRIOR MU_ID = HRK_MU_ID 
START WITH HRK_MU_ID IS NULL 
ORDER SIBLINGS BY A.LNUP_ON 
--; 
==============================================================================================================

- PC부품 판매(최병석 과장이 용산에서 팔아줌(심부름값: 천원)) 
1. PC부품: HDD(500G SATA) 35,000원 1 35,000원 
2. PC부품: DDR램(3200)(4개) 3,000원 4 12,00원 
3. PC부품: HDD(80G IDE) 2,000원 1 2,000원 
4. 총: 39,000원 ===> 심부름값 제외 총 수익: 38,000원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.25(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00	==> 성탄절 

▦조기축구 
08:00 기상 
08:50 신구초등학교 
09:00 조기축구(7:6 패) 
11:10 종료 
11:30 중식(류명국 해장국: 류명국 회원이 쏨) 
14:00 귀가 
15:10 서울대입구역 
15:40 구로디지털단지역 3번 출구 
15:45 mayB(커피숍 
16:10 권희진(지각함) 
18:50 mayB(아이스크림: 권희진씨가 쏨) 
18:00 석식(낚지 비빕밥: 내가 쏨) 
18:20 종료 
19:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:30 --> 야근(포시즌), 정책임과 또 부딪침(영업 DashBoard 조회 조건 문제) 

- IMK 차세대Prj
- BW-미수채권 관련 Query 정보 연계확인 
==============================================================================================================

- BY 반품교환요청 POP(BYERB02P) 수정 
1. 회사ID 필수값으로 처리(로그인 회사외 조회 불가 하도록 처리) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.27(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 21:40 --> 야근(포시즌) 

- IMK 차세대Prj
- BW-미수채권 관련 Query 정보 연계확인 
1. 조회 가능 일자: 2011.11.30 
==============================================================================================================

- 세로 데이타 가로로 조회 
---> 10160058, 10021114, 10000868, 10250764 

/* 51.2. DASHBOARD Left 조회(Payer 조회)(DashBoardDQM.getPayerFromAnalGrpList --> reqGetDashBoardLeftList()) */ 
SELECT SUBSTR(XMLAGG(XMLELEMENT(A, ','  T1.PAY_PS_CUST_ID) ORDER BY ROWNUM).EXTRACT('//text()') 
.GETSTRINGVAL() 
,2) AS PAYER_ID 
FROM (SELECT DISTINCT T1.PAY_PS_CUST_ID 
FROM MCUTG1140 T1 
WHERE T1.ANAL_GRP_ID = :workCd /* 분석사업장코드 */ 
) T1 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 18:20 --> 야근(포시즌), 중식(초원 복집: 아엘포유 김성채 팀장), 회식(3셀): 오빠닭(18시 ~ 22시) 

- IMK 차세대Prj
- MP 영업 DashBoard PO, AR, GR 데이타 검증 및 확인 
1. 회사ID로 조회 불가능 ==> SAP에서 회사ID: 10000868(삼성전자) 값을 0010000868(10자리) 만들어주는 함수 미사용 
2. 테스트 주문(00. PMO_통합테스트_케이스데이타_V1.1_활용_UI.xlsx) 
1) Z0276884, V104924200(지게차부품) 주문금액: 17,379,100,000원 
3. 일별 매출 현황 일자 ==> SAP 생성일자 기준(주문일자 기준이 아님) 
==============================================================================================================

- 용어 정의 
1. PO(PURCHASE ORDER: 발주): IMK에 의해 실제로 공급사에게 주문을 내는 것 
2. AR(ACCOUNT RECEIVABLE: 매출채권): 기업이 상품을 판매하는 과정에서 발생한 채권으로 외상매출금과 
받을어음 등 ‘외상 판매대금’을 가리킴 
3. GR(GOOD RECEIPT: 잘 받았음): 입고 후 잘 받았다는 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.29(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(포시즌), 김성채 팀장에게 재계약 거부 요청(정책임 문제 설명) 

- IMK 차세대Prj
- MP 영업 DashBoard PO, AR, GR 데이타 검증 및 확인 
1. PO 데이타 김영수 차장에게 확인 요청 메일 보냄 
==============================================================================================================

- 제니퍼 TOP 쿼리 수정 
1. DashBoardSearchCondtionDQM.selectDmCompDList 
2. ClmDQM.getPageRowCountClmList 
3. BusinessPlaceCodeSearchDQM.dListByBp 
4. SupGusDashBoardDQM.getGusDashBoardList 
==============================================================================================================

- 입고 취소 확인 
1. 입고취소를 통해 반품교환 팝업을 띄우고 저장 버튼을 클릭해서 아모레퍼시픽 처리불가 확인 후 닫기 버튼을 
클릭하면 동작하지 않음 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:00 --> 야근(팬다), P2P(토렌트: http://www.torrent.kr) 

- IMK 차세대Prj
- MP 사업장 조회(MSCUM35M) 수정 
1. Scroll paging 적용(MSCMM15P: 회사사업장조회 팝업 참조) 
==============================================================================================================

- 금액 자리 
1. 소수점 자리수 조절 
SELECT TO_CHAR(1423.12304, 'fm999,999,999.99') FROM DUAL; --3째 자리에 금액표시, 소숫점 2째 자리에서 끊기 
==============================================================================================================

- ‘작지만 큰’ 노트북, 비결은 베젤 다이어트 
http://www.bloter.net/wp-content/bloter_html/2011/12/89959.html 
1. 시리즈7 크로노스 15인치형: http://blog.danawa.com/prod/?blogSection=4&prod_c=1529336 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.12.31(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:30 --> 토요근무, 중식(장독대), 케익(I/F 4셀장: 김형기 수석), 귤 2박스 작은 누나에게 선물 받음(1박스 주인 아줌마에게 선물함) 

- IMK 차세대Prj
- 사업장조회(HUCUM63M) 수정 
1. Scroll paging 적용 
==============================================================================================================

- MP 영업 DashBoard 수정 
1. 왼쪽 메뉴 공통 함수 수정 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■