

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.06.01(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
07:00 기상 
07:10 조식 
07:30 성현동 도서관(03. DB 복습) 
17:30 종료 
17:40 귀가 
18:00 석식 
19:30 5월 결산(가계부) 
21:00 뉴스 시청 
22:00 광속독 훈련(감리 교재 30분 실속 추가) 
23:30 취침 
==============================================================================================================

- 감리사 원서접수(신청) 
⊙ 원서접수 : 2011. 6. 1(수) 09:00 ~ 6. 10(금) 18:00  
==============================================================================================================

- 삼화 저축은행 예금 만기
▦ 적금(은행) @@@@@@ 
- 삼화 저축은행 예금 가입 ==> 2010년 5월 03일 
1. 상품명: 보통예금, 예금주: 진덕근(*) 
 1) 생계형(비과세) 정기예금복리(018-01-43-1532249 원금: 3천) 
실수령액: 31,495,862원, 이자율: 연4.98%, 예치기간: 13개월 
만기일자: 2011/06/03 
 2) 세금우대 정기예금복리(018-01-43-1532281 원금: 천 5백) 
실수령액: 15,676,891원, 이자율: 연4.98%, 예치기간: 13개월 
만기일자: 2011/06/03 
==> 총실수령액: 47,172,753원(삼화 저축은행 파산 --> 우리금융저축은행(http://www.woorifgsb.com)으로 인수됨) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(04. SF, 05. SW 복습) 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 감리사 공부(04. SF, 05. SW) 복습 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.03(금) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(02. SWE 복습) 
17:30 종료 
14:20 귀가 
16:00 감리사 원서접수(수정): 경력사항 전체 입력 
18:00 석식 
19:30 감리사 공부(04. SF, 05. SW) 복습 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

- 감리사 원서접수(수정) 
1. 경력사항 전체 입력 
2. 필기전형료 납부 
1) 입금계좌: 하나은행 404-097848-04004(한국정보화진흥원)  ==> 전형료: 100,000원 
------------------------------------------------------------------------------------------------------- 

- 정보처리기사 
자격증번호: 03201010432A 
발행기관: 한국산업인력공단 
취득일자: 2003.07.01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.04(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(KPC 실전 모의고사(1회) 자체 시험 실시: 53점 나옴(충격적)) 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 감리사 공부(문제 풀이) 복습 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.05(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- ISA(심화)(13주차)
06:00 기상 
07:00 예배(광림교회) ==> 설교(김정석 목사: 맡기면 이루시는 여호와) ==> 상요형이 밥 사먹으라고 5만원 줌 
08:30 종료 
08:35 압구정역(5-1) 
08:50 경복궁역(6번 출구) 
08:50 KPC 도착 
09:00 KPC 모의고사(1회) 시험(68점 나옴) 
11:10 KPC 모의고사(1회) 풀이 
12:30 중식 
14:00 KPC 모의고사(2회) 시험(61점 나옴) 
16:10 KPC 모의고사(2회) 풀이 
17:30 종료 
19:00 귀가 
24:00 취침 
==============================================================================================================

- 가계부 정리 
2011.06.03(금)  감리사 필기 응시료 100,000원 
2011.06.05(일)  김밥 4,000원 
2011.06.05(일)  상요형 50,000원 
2011.06.07(화)  이자(삼화저축은행 예금)  2,172,753원 
2011.06.07(화)  이자(제일은행 적금) 1,704원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.06(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00   --> 현충일 

- ISA Study
05:30 기상 
06:20 조기축구(숏게임: 3골 넣음) 
08:00 종료 
08:35 압구정역(5-1) 
08:50 경복궁역(6번 출구) 
08:50 KPC 도착 
09:00 KPC 모의고사(3회) 시험(60점 나옴) 
11:10 KPC 모의고사(3회) 풀이 
12:30 중식 
14:00 KPC 모의고사(4회) 시험(91점 나옴) 
16:10 KPC 모의고사(4회) 풀이  ==> 실전문제풀이반 출력물 얻어음(변상선씨가 빌려줌) 
17:30 종료 
19:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.07(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 우리금융저축은행 방문(예금 찾고 다시 예금, 제일은행 예금 해약) 

- ISA Study
- SFR 학원 --> 10:00 ~ 15:00 
1. 독법 훈련(창휘, 이영숙님(목사님한테 야단맞고 중식 후 귀가함), 이장로님) 
2. 미소(마음의 훈련) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.08(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(모의고사 문제집 복습) 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.09(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(01. 감리 복습) 
16:10 종료 
16:20 귀가 
16:30 SW개발자 신고 재신청 
18:00 석식 
19:30 감리사 공부(01. 감리 복습) 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

- KPC 기술사반 
1. 과정명: [Level1] IT Core Brain Basic Course-주말반 
2. 시간: 2011-08-13 ~ 2011-10-08, 매주 토요일 09:00~18:00 
3. 수강료: 55 만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.10(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 감리사 예상 문제 워드 작성(00. 감리사(문제).docx) ==> 도서관 안감 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 정보시스템감리 기본점검표 워드 작성(53. 정보시스템감리 기본점검표.doc)    
21:00 뉴스 시청 
22:00 정보시스템감리 기본점검표 워드 작성 계속 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.11(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(모의고사 문제집 복습) 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 감리사 공부(모의고사 문제집 복습) 
21:00 뉴스 시청 
22:00 정보시스템감리 기본점검표 워드 작성 계속 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.12(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- ISA(심화)(15주차)
06:00 기상 
07:00 예배(광림교회) ==> 설교(김정석 목사: 성령의 인도함 받는 인생) 
08:30 종료 
08:35 압구정역(5-1) 
08:50 경복궁역(6번 출구) 
08:50 KPC 도착 
09:00 KPC 모의고사(5회) 시험(79점 나옴) 
11:10 KPC 모의고사(5회) 풀이 
12:30 중식 
14:00 KPC 모의고사(6회) 시험(80점 나옴) 
16:10 KPC 모의고사(6회) 풀이 
17:30 종료 
19:00 귀가 
24:00 취침 
==============================================================================================================

- 가계부 정리 
2011.06.12(일) 김밥 4,000원 
2011.06.13(월) 라이지움 문제풀이 과정(수강료) 260,000원 
- 두드림 적금 자동이체 취소 처리 
275-90-100412 진태만 200,000 적금(두드림(자유적립, 일반)) 제일은행에서 자동이체 설정함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.13(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 라이지움 문제풀이 과정 등록 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(모의고사 문제집 복습) 
17:30 종료 
17:20 귀가 
18:00 석식 
18:00 석식 
19:00 라이지움 문제풀이 과정 2차 등록(26만원: 카드 결제) 
19:30 이론(문제풀이 과정) 
22:30 종료 
23:10 귀가 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

- 라이지움 과목별 Review & 실전모의고사 및 문제풀이 과정 등록 
1. 수강료: 26만원(작년 수강생 특전)  
2. 결제방법: 카드결제(T)5377-144) 
3. 2차반(라이지움 문제풀이 과정) 
 1) 이론(월/수/목): 2010. 6.13 ~ 6. 23 19:30 ~ 20:30 
 2) 실전모의고사((토): 6/18(토), 6/25(토), 7/2(토) 9:30 ~ 11:30, 12:30 ~ 16:30 
==============================================================================================================

- KPC 감리사 강사님 연락처 
1. 김은정 감리사: *, *@*.* 
2. 이정인 기술사: *, *@*.* 
3. 최석원 기술사: *@*.*  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.14(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(모의고사 문제집 복습) 
17:30 종료 
17:20 귀가 
18:00 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
21:00 뉴스 시청 
22:00 광속독 훈련(성경, 감리 교재 실속) 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.15(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 성현동 도서관(데이터베이스론 공부) 
11:00 종료 
11:20 귀가 
11:20 중식 
12:30 삼성역((주)신진 NTS 이순복 사장 만남) 
13:10 IMK 차세대Proj 면접(제상화 수석(삼성 SDS)) ==> 다음날부터 출근하기로 함(한달 동안 18시 퇴근 약속) 
14:30 라이지움 학원(데이터베이스론 공부) 
19:30 문제풀이 2차 강의(SW: 유지호 강사) 
22:30 종료 
23:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.16(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  --> 첫출근 

- IMK 차세대Prj
- IMK 차세대Proj 첫출근 
1. 프로젝트명: IMK 차세대Proj 
2. 기간: 2011.06.16(목) ~ 09.15(목) 
3. 노트북 포맷(XP 재설치), 보안 서약서 작성 
4. MP 영업 PL: 제상화 수석(삼성 SDS), 협력사명: (주)보우테크 조성학 과장(*) 
5. 장소: 서울시 강남구 삼성동 157-1 삼성동빌딩 14층 
==============================================================================================================

- IP 주소(IMK 차세대Proj) 
IP 주소: 122.1.18.157, GW: 122.1.18.1 
SM: 255.255.255.0, DNS: 203.241.132.34, 203.241.135.135 
- 파일 서버 
1. \\88.1.117.106\차세대(sds01/차세대123) 
2. V3 S/W 설치: \\122.1.23.153(imk/qwe123) --> \\122.1.22.40(1/imarket40)(구버전: 사용 안함) 

3. OPENPMS(http://122.1.20.204:8080/OPENPMS) 
4. 네트워크 인증(인캅스): 1703411/ssj**8** 
5. 프린터 서버(삼성 SCX-6545 Series PCL 6) --> IP 주소: 122.1.23.238 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
24:00 취침 
==============================================================================================================

- 감리 계약 시 필수 포함 사항 ==> 목사 기범 대권 
1. 감리대상 사업명  2. 감리계약 목적 
3. 감리대상 기간  4. 감리계약 범위 
5. 감리대상 범위  6. 회차별 감리 시행기간 및 투입인력 공수 
7. 감리법인, 발주기관 및 피감리인의 권리와 의무, 보안에 관한사항 
8. 감리대가 산정 및 지급에 관한 사항 
9. 기타 감리업무 수행에 필요한 사항 
- 감리 착수회의 포함사항 ==> 협, 계보, 지영, 현파 
1. 감리계획 설명, 상세점검 항목 협의 
2. 추가요청사항, 감리계획 보완 
3. 감리 대상사업 현황 파악 
4. 영역별 감리원/업무 담당자 확인 
4. 감리장소 등 발주기관 지원 사항 
- 감리보고서 포함 사항 ==> 검사 총의 기권 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.17(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00 

- IMK 차세대Prj
- 데이타 연계 관련 회의(13:30 ~ 14:30) 
1. BW에서 실시간 데이타 및 집계 데이타 불러와서 대쉬보드에 보여 줌 
2. 담당 업무: MP-Dashboard 개발(영업) 
- 네트워크 연결 완료(XP 재설치: D 드라이버에 설치되어 있어서 C드라이버에 다시 설치함) 
1. 개인 프로파일 작성 ==> 진태만(영업- 대시보드 개발).ppt 

- 프린터 설정 
1. 레이아웃 설정 -> 면당 페이지수: 2면, 페이지 순서: 위쪽, 2. 양면 인쇄: 긴면 묶음 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.18(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 공부 
08:00 종료 
08:10 집출발(지하철) 
09:00 라이지움 도착 
09:30 라이지움 실전 모의고사(1회)(71점 나옴) 
11:30 종료 
12:30 라이지움 실전 모의고사(1회) 풀이 
16:30 종료 
16:40 라이지움 랩실(9층: 총정리 DB 비디오 시청) 
18:00 종료 
19:00 귀가 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.19(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00 

- ISA 모의고사(2회)
06:00 기상 
07:00 예배(광림교회) ==> 설교(김정석 목사: 하나님께서 자기 일을 쉬심 같이) 
08:30 종료 
08:50 조기축구(2:1 승) 
10:50 종료 
11:30 문경세제(갈비탕: 이익환 부회장이 쏨) 
12:20 종료 
12:30 압구정역(5-1) 
12:55 경복궁역(6번 출구) 
13:10 KPC 도착(세면) 
13:30 KPC 실전모의고사 등록 
14:00 KPC 실전모의고사(2회) 시험(76점 나옴) 
16:00 KPC 실전모의고사(2회) 풀이 
17:50 종료 
19:00 이발 
19:20 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.20(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- MK 차세대Proj 분석 
1. MP(Market Place) 
2. 프로그램 조언: MP 영업2셀(이병권, 박성진 사원) 
3. XPlatform 분석 

- 개발 프로그램 설치(Z:\90. WorkPlace\02. 업무별Working\06. 아키텍쳐공통\16. FA\설치프로그램) 
1. JDK설치 ==> C:\Program Files\Java\jdk1.6.0_23 , 환경 설정: %JAVA_HOME\bin\%; 
2. WAS (WebLogic) 설치 
도메인 이름 : mpdomain 
도메인 위치 : C:\Oracle\Middleware\imk_pjt\domains 
weblogic 
3. IDE설치(eclipse) 
C:\workspace\ 
svn://122.1.20.30/project 
baseURL : http://122.1.20.30:8080/anyserver/ServerHandler 
Weblogic home: C:\Oracle\Middleware\wlserver_10.3 
Java home: C:\Oracle\Middleware\jrockit_160_17_R28.0.0-679 
Domain Directory: C:\Oracle\Middleware\imk_pjt\domains\mpdomain 
4. XPlatform 설치 
5. Oracle client11gR2 설치, TOAD 10 설치 
--------------------------------------------------------------------------------------------------------- 

- DB 서버 
IP: 188.1.117.22:1545 port: 1545, DBDMRO, mpusr/usrmp 
==============================================================================================================

- 프린터 재출력(감리 교재(all)) 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.21(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- XPlatform 샘플 분석 
Ⅰ. 서버개발가이드-DQM(dList): 조회 
1.1. 패키지 생성하기 
1.2. DQM개발하기(DQM, DVO 클래스가 생성된) 
Class Name: QuickguideDQM --> Quickguide3DQM 
Method : dListQuickguide 
DML Type : dList 
Method Name : Quickguide 리스트 
Description : Quickguide 리스트 

SELECT CPNT_ID 
      , LANG_CD 
      , RPRE_ABBR_NM 
      , RPRE_WHL_NM 
      , RPRE_EXPL_CN 
    , CPNT_GB_CD 
FROM CRUDSAMPLE2 
WHERE  1 = 1 
#if ($rpreAbbrNm && $rpreAbbrNm != '') 
AND RPRE_ABBR_NM LIKE '%'  :rpreAbbrNm  '%' 
#end 
#if ($rpreWhlNm && $rpreWhlNm != '') 
AND RPRE_WHL_NM LIKE '%'  :rpreWhlNm  '%' 
#end 
1.3. SVO 생성하기 
1.4. SVC Interface 개발하기 
1.5. SVC Impl 개발하기 
1.6. SVC Impl 개발하기-Bean Name 추가하기 
1.7. Biz Class 개발하기 

Ⅱ. 화면개발가이드-조회(dList) 
1. dsActionMapping: reqGetQuickguideList 
beanName: cm.sample.quickuideapp.QuickguideSvcImpl 
methodName: reqGetQuickguideList 
inputVOName: QuickguideSVO 

2. dsService: reqGetQuickguideList 
inDatasets: QuickguideSVO=dsQuickuide 
outDatasets: dsQuickguideDVOList=quickguideDVOList 

3. SVO 생성하기 
1) String--> rpreWhlNm (한글풀명), String rpreAbbrNm(한글약어명) 
2) List --> quickguideDVOList 
2.1. 개발화면 확인하기 
2.2. 공통 데이터셋 복사하기 
2.3. 그리드 Dataset 만들기 
2.4. 그리드 바인드 하기 
2.5. dsActionMapping 추가 
2.6. dsService 추가 
2.7. inDataset에 조회조건 연결하기 
2.8. 화면개발하기 
2.9. 조회버튼 개발하기 
2.10. 조회화면 확인하기  
==============================================================================================================

- Overriding(상속성, 재정의), Overloading(중복) 
1. 오버라이딩(Overriding): 상속 관계에 있는 두 클래스 중, 하위 클래스에서 상위 클래스의 메소드를 재정의하는 
것을 의미함 
class A { 
        void Pmethod() { } 
} 

class a extends A { 
        void Pmethod() { }         //오버라이딩 
        void Pmethod(int i) { }   //오버로딩 
        void Cmethod() { }         //오버로딩 
        void Cmethod(int i) { }    //오버로딩 
      // 메소드이름이 같아도 매개변수가 달라서 다른 메소드 취급 
} 

2. 오버로딩(Overloading): 한 클래스 내에서 같은 이름의 메소드를 여러개 정의하는 것을 의미합니다. 
class Calc {  
	 int add(int a, int b); // 정수형 변수를 처리하는 메소드 
	 double add(double a, double b); // 실수형 변수를 처리하는 메소드 
	 // 위 두 개의 메소드는 오버로딩된 상태 
} 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.22(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- XPlatform 샘플 테스트 
Ⅰ. 서버개발가이드-DQM(dList): 조회 
1.1. 패키지 생성하기 
1.2. DQM개발하기(DQM, DVO 클래스가 생성된) 
com.imk.mall.cm.sample.testguideapp 
Class Name: TestguideDQM, 퀵가이드 테스트 DQM 

Method : dListTestguide, DML Type : dList 
Method Name : Testguide 리스트, Testguide 리스트 

SELECT CPNT_ID 
      , LANG_CD 
      , RPRE_ABBR_NM 
      , RPRE_WHL_NM 
      , RPRE_EXPL_CN 
    , CPNT_GB_CD 
FROM CRUDSAMPLE2 
WHERE  1 = 1 
#if ($rpreAbbrNm && $rpreAbbrNm != '') 
AND RPRE_ABBR_NM LIKE '%'  :rpreAbbrNm  '%' 
#end 
#if ($rpreWhlNm && $rpreWhlNm != '') 
AND RPRE_WHL_NM LIKE '%'  :rpreWhlNm  '%' 
#end 

1.3. SVO 생성하기 
TestguideSVO, 퀵가이드 테스트 SVO  ==> TestguideSVO 
testguideDVOList, 퀵가이드 DVO, 퀵가이드목록 
rpreWhlNm(한글풀명), String rpreAbbrNm(한글약어명) 

1.4. SVC Interface 개발하기 
TestguideSvc 
1.5. SVC Impl 개발하기 
TestguideSvcImp 
Super class: com.sds.anyframe.extension.basic.abstractlayer.AbstractService 
1.6. SVC Impl 개발하기-Bean Name 추가하기 
1.7. Biz Class 개발하기 
TestguideBiz 
Super class: com.sds.anyframe.extension.basic.abstractlayer.AbstractService 

Ⅱ. 화면개발가이드-조회(dList) 
1. dsActionMapping: reqGetQuickguideList 
beanName: cm.sample.quickuideapp.QuickguideSvcImpl 
methodName: reqGetQuickguideList 
inputVOName: QuickguideSVO 

2. dsService: reqGetQuickguideList 
inDatasets: QuickguideSVO=dsQuickuide 
outDatasets: dsQuickguideDVOList=testguideDVOList 
 testguideDVOList 

3. SVO 생성하기 
1) String--> rpreWhlNm (한글풀명), String rpreAbbrNm(한글약어명) 
2) List --> quickguideDVOList 
2.1. 개발화면 확인하기 
2.2. 공통 데이터셋 복사하기 
2.3. 그리드 Dataset 만들기 
dsTestguideDVOList, dsTestguide 
2.4. 그리드 바인드 하기 
testguideDVOList 
2.5. dsActionMapping 추가 
id : reqGetTestguideList 
beanName : cm.sample.quickguideapp.TestguideSvcImpl 
methodName : reqGetTestguideList 
inputVoName : com.imk.mall.cm.sample.testguideapp.TestguideSVO 
  
2.6. dsService 추가 
id : reqGetQuickguideList 
outDatasets : dsTestguideDVOList=testguideDVOList 
svctp : R 
callback : fn_trans_callback 
message : tscsMsgId 
asyncyp : true 
bintp : false 
comtp : false 
TestguideSVO=dsTestguide 

2.7. inDataset에 조회 조건 연결하기 
2.8. 화면개발하기 
2.9. 조회버튼 개발하기 
2.10. 조회화면 확인하기 
--------------------------------------------------------------------------------------------------------- 

- 에러 
1. 에러내용: ava.lang.ClassNotFoundException: ava.lang.ClassNotFoundException: TestguideSVO 
2. 조치: dsActionMapping에서 inputVOName 수정(풀네임): com.imk.mall.cm.sample.quickguideapp.QuickguideSVO 
==============================================================================================================

- JAVA -> SAP ERP 연동 
1. RFC(Remote Function Call) 함수 호출 
- 테스트 서버 연결 
1. http://88.1.117.23/index.html  --> aaaaa/ 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:00 감리사 공부(SW) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.23(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- XPlatform 샘플 테스트
Ⅲ. 서버개발가이드-DEM: 입력, 수정, 삭제 
3.1. DEM개발하기 
CRUDSAMPLE2 로 검색 
Class Name: CRUDSAMPLE2, DAO Type: EM 
Package: com.imk.mall.cm.sample.qgapp.dao 
3.1. DEM개발하기-INSERT 
3.1. DEM개발하기-UPDATE 
3.1. DEM개발하기-DELETE 
3.1. DEM개발하기-SELECT문 
3.2. SVO개발하기-DEM의 List 추가하기 
Crudsample2DVO 클래스를 검색 
crudsample2DVOListInserted, insertBatch 리스트 
crudsample2DVOListUpdated, updateBatch  리스트 
crudsample2DVOListDeleted, deleteBatch  리스트 
  
Ⅳ. 화면개발가이드- Update, Delete, Insert 
4.1. Dataset 추가하기-dsActionmapping 
1) dsActionMapping 세팅 
reqExeTestguideList, Cm.sample.testguideapp.TestguideSvcImpl, reqExeTestguideList, com.imk.mall.cm.sample.testguideapp.TestguideSVO 
2) dsService 세팅 
reqExeTestguideList,   
inDatasets: TestguideSVO=dsTestguide crudsample2DVOList=dsTestguideDVOList:U 
outDatasets: dsTestguideDVOList=testguideDVOList 

Ⅴ. 페이징조회-DQM(dListPageRowCount) 
5.1. dListPageRowCount 
dListPageRowCountTestquide, dListPageRowCountTestquide 
5.2. SVO 편집하기 
1) pageSize(페이지사이즈), 2) pageIndex(페이지번호) 
3) comPageVoList(공통 페이징 처리 VO), RefClass: com.imk.mall.cm.cm.commonapp.ComPageVO 
5.3. SVC 메소드 추가 
5.4. SVC Impl 메소드 추가 
5.5. Biz Class 구현 
5.6. Dataset 추가 
5.7. 페이징 처리 구현 
dsService: reqGetTestguidePageList, divPageId: div_page 
dsActionMapping: reqGetTestguidePageList, reqGetTestguidePageList 
==============================================================================================================

- gfn_doRequest() 함수호출 에러 
uxs (992): Warning: [C:/workspace/imk_mall/lib/SMSCRIPT.xjs][line:101] Dataset에서 지정한 Column(asynctp)을 찾지 못했습니다. 
uxs (992): Warning: [C:/workspace/imk_mall/lib/SMSCRIPT.xjs][line:126] Dataset에서 지정한 Column(divPageId)을 찾지 못했습니다. 
==============================================================================================================

- Shock StartUp 설정(현재 사용자) 
1. 이름: 01. Windows 탐색기, 데이터: C:\WINDOWS\explorer.exe 
2. 이름: 02. EditPlus 3, 데이터: C:\Program Files\EditPlus 3\editplus.exe 
3. 이름: 03. IE 8, 데이터: C:\WINDOWS\ie8\iexplore.exe 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:00 감리사 공부(DB) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.24(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- XPlatform 샘플 테스트 
- 디버깅 
/TestguideSvcImpl.java 파일에서 
public TestguideSVO reqExeTestguideList(TestguideSVO testguideSVO) { 
 debug("\n\n [/TestguideSvcImpl.java]:: reqExeTestguideList() 시작 !!"); 
 TestguideBiz testguideBiz = new TestguideBiz(); 
 testguideBiz.exeTestguideList(testguideSVO); 
 return testguideBiz.getTestguideList(testguideSVO); 
} 

/TestguideBiz.java 파일에서 
public void exeTestguideList(TestguideSVO testguideSVO) { 
 debug("\n\n [/TestguideBiz.java][exeTestguideList()] 시작 !!"); 
 List<Crudsample2DVO> crudsample2DVOlistUpdated = testguideSVO.getCrudsample2DVOListUpdated();   
  
 if (!CollectionUtils.isEmpty(crudsample2DVOlistUpdated)) { 
  debug("\n\n [/TestguideBiz.java][exeTestguideList()][crudsample2DVOlistUpdated]"+ crudsample2DVOlistUpdated.toString());  
  crudsample2DEM.updateBatchCrudsample2(crudsample2DVOlistUpdated); 
 } 
} 
-------------------------------------------------------------------------------------------------------- 
  
- XPlatform 디버깅 
1. F9 --> FormSpy 
2. trace("[/TestguideBiz.java][gsUpdatedDatasets]" + gsUpdatedDatasets); 

- 메세지 정의(CMCM02M.fxdl): 공통 
==============================================================================================================

- Dashboard 소스 파일 
1. 메인: mpMainBY.xfdl, Left: comMainLeftMBy.xfdl 
==============================================================================================================

- KPC 기술사입문자를 위한 정보처리기술사 공개설명회(주말) 
1. 교육시간: 2011-07-23(토) 13:00~15:30 [1일 3시간] 
2. 교육장소: KPC 강의장 
3. 담당자: 오태융 팀장[Tel: 02-724-1216 / email: *@*.*] 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(전체 복습) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.25(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- ISA Study
06:30 기상 
06:40 조식 
07:00 공부 
08:00 종료 
08:10 집출발(지하철) 
09:00 라이지움 도착  ==> 라잊지움(이권준, 정용국) 
09:30 실전 모의고사(2회)(77점 나옴) 
11:30 종료 
12:30 라이지움 실전 모의고사(2회) 풀이(강사: 김은아 기술사) 
16:30 종료 
16:40 라이지움 랩실(9층: 총정리 감리 비디오 시청) 
18:30 종료 
18:30 화장실(변비) 
20:00 귀가 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.26(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 00:00  -->  ISA(심화) 종강 

- ISA(심화)(16주차)
06:00 기상 
07:00 예배(광림교회) ==> 설교(김선도 감독: 놀라운 회복을 주시는 하나님) 
08:30 종료 
08:35 압구정역(5-1) 
08:50 경복궁역(6번 출구) 
08:50 KPC 도착 
09:00 KPC 모의고사(7회) 시험(73점 나옴) 
11:10 KPC 모의고사(7회) 풀이 
12:30 중식 
14:00 KPC 모의고사(8회) 시험(74점 나옴) 
16:10 KPC 모의고사(8회) 풀이 
17:30 종료 ==> 종강(KPC 합격 예상자: 변상선, 김지현) 
19:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.27(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- Dashboard 소스 파일 
1. 메인: mpMainBY.xfdl, Left: comMainLeftMBy.xfdl 
==============================================================================================================

- Dashboard 서버단 개발 위치 문의 
1. UXStudio에서 영업 Dashboard(mpMainBY.xfdl)가 imk_mall/main 폴더 밑에 존재 
2. 서버단(eclipse)에서 com.imk.mall 밑에 main이 존재하지 않음 
3. JAVA -> SAP ERP 연동 자료 요청 ◈◈ 
1) RFC(Remote Function Call) 함수 호출 
==============================================================================================================

- 참조 소스 
ItAstMgtBiz(com.imk.mall.by.mc.bitassetmanageapp) ==> BYMCB14M.xfdl 
by.mc.bitassetmanageapp.ItAstMgtSvcImpl 

- 업무 분류 
대업무: CM(공통), BY(영업-MP), PU(구매-MP), MS(기준정보) 
중분류: CM(Common Management)(공통관리) 
==============================================================================================================

- IMK 사업 분야(아이마켓 코리아: www.imarketkorea.com) 
1. MRO(Maintenance Repair Operation): Maintenance(유지), Repair(보수), Operation(운영)의 약자로, 기업에서 
제품 생산에 필수인 직접 원자재를 제외한 소모성 자재와 간접 자재를 의미하며 기업소모성자재 또는 기업운영 
자재라고함 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.28(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- MK 차세대Proj 분석 
1. 콜백(callback): 호출될 함수를 알려 주어 다른 프로그램 또는 다른 모듈에서 함수를 호출하게 하는 방법. 일반적 
으로 운영 체계(OS)가 호출할 애플리케이션의 함수를 지정해 특정한 사건 또는 메시지가 발생했을 때 호출되도록 
지정할 수 있다. 이런 함수를 콜백 함수라고 한다. 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(모의고사 문제집) 복습 ==> 문제 속도 답이 있다.(정신 집중, 흐뭇, 편안) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.29(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- MK 차세대Proj 분석 
ByCmDashbaordBiz(com.imk.mall.by.cm.bycmdashboardapp) ==> mpMainBY.xfdl 
TestguideSVO=dsTestguide crudsample2DVOList=dsTestguideDVOList:U   
dsTestguideDVOList=testguideDVOList 
==============================================================================================================

- eclipse 에러 
1. 현상: 1) Module named '_auto_generated_ear_' failed to deploy. See Error Log view for more detail. 
An exception stack trace is not available. 
2) java.io.FileNotFoundException: C:\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp0\mpdomain
\_auto_generated_ear_\imk_pjt.war (지정된 파일을 찾을 수 없습니다) 
2. 조치: 재부팅 몇 번 함 
==============================================================================================================

- 업무 담당자 
01. MP 영업: 배준 부장(SAP BW1: 오픈타이드 코리아),  김상헌 컨설턴트(16층) 
01. MP 구매: 김화중 부장(MP 구매4셀) 
02. MP 허브: 박성원 책임(MP 구매1셀) --> SQL 만들어 준다고 함 
==============================================================================================================

- SAP --> MP 호출 
1. 소스: com.imk.mall.swcall.sapcallmp.ImkJcoServerCallMP 
- MP --> SAP 호출 
1. 구현 안됨 
==============================================================================================================

- ISA Study
18:00 퇴근 
18:30 귀가 
18:40 석식 
19:30 감리사 공부(총 복습) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.06.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

- IMK 차세대Prj
- XPlatform DashBoard 개발 
1. 경로: com.imk.mall.by.cm.bycmdashboardapp/ByCmDashBoardBiz 
2. 대시보드DQM 
 1) ByCmDashBoardDQM,  대시보드DQM, getBoardrList, DashBoard리스트 
==============================================================================================================

- ISA Study
18:00 퇴근
18:30 귀가 
18:40 석식 
19:30 감리사 공부(총 복습) 
24:00 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■