

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.09.01(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환(AS-IS 분석) 문서 작성 
2. 반품교환 합병 
==============================================================================================================

- 반품교환 분석(TO-BE) 
01. 반품교환요청[MP] ==> 관리자(aaaaa) -> 주문관리 > 주문관리 >  
유형별 주문현황(BYOMM11M) --> 상태:운송지시(미입고 처리), 상태:검수(입고 처리) 
> 주문진행현황(BYOMB32P)(Pop): 반품요청, 교환요청 > 반품교환요청 POP(BYERB02P): 반품교환요청 처리  
02. 요청취소[MP] ==> 관리자(aaaaa) -> 주문관리 > 교환/반품처리현황 > 교환/반품처리현황(BYERM18M):  
상태:요청(요청취소 처리) > 반품교환요청 POP(BYERB05P) > 요청취소사유 POP(BYERB04P): 요청취소 처리 
51. 반품교환요청[BY] ==> 윤혜용(Z0232426) -> 주문배송 > 주문배송현황(BYOMB31M)  
> 주문진행현황(BYOMB32P)(Pop) > 반품교환요청 POP(BYERB02P) 
52. 요청취소[BY] ==> 윤혜용(Z0232426) -> 주문배송 > 반품교환처리현황 > 반품교환처리현황(BYERB01M):  
상태:요청(요청취소 처리) > 반품교환요청 POP(BYERB05P) > 요청취소사유 POP(BYERB04P): 요청취소 처리 
71. 반품교환요청[BY] ==> 이기동(Z0096067) ==> 자재관리 > 입고처리현황(BYMCB01M): 입고취소(클릭) >  
입고취소사유등록(BYMCB05P)(Pop) --> 반품요청 POP(BYERB02P)(Pop) 
---------------------------------------------------------------------------------------------------------- 

- AS-IS 분석 
1. MP 테스트 계정 http://88.1.17.136:7099/(Stage 서버 = 품질서버)  
MP: 050028/q1w2e3r4, Buyer: HANWHA/q1w2e3r4, 1N080B/q1w2e3r4, YD001/q1w2e3r4, HANWHA_K/q1w2e3r4 
===> Order관리 > 납품관리 > 반품교환관리(M) 
2. 바이어로 접속 
1) 주문 tracking ==> 주문배송 > 주문배송현황(M) -> http://88.1.17.136:7099/Login.Servlet?cmd=ByLogin&id=9USWBVM8WU 
http://88.1.17.136:7099/Login.Servlet?cmd=ByLogin&id=HEQRW9FLED 
2) 입고 ==> 자재관리 > 입고검수관리 > 입고처리현황(M) -> http://88.1.17.136:7099/Login.Servlet?cmd=ByLogin&id=HEQRW9FLED 
==============================================================================================================

- 반품 요청 저장시 등록(AS-IS) 
1. 반품 요청문서 생성(LogisticsManagerEJB) ==> TREAST(반품/교환): I, LREAST(History): I, TDOAST(운송지시 Main): I 
2. 반품 입고취소(LogisticsManagerBean) ==> TGRAST(입고 Main): I, TGRBST(입고 vs 납품 Mapping): I 
- 반품 요청 저장시 등록(TO-BE) 
1. TORTG2230(주문클레임): I, TORTH2231(주문클레임변경이력): I, TORTH2233(주문클레임상태): I 
2. 반품 입고취소 ==> TORTG0320(고객입고): I, TORTH0321(고객입고변경이력): I, TORTG0350(입고BOM구성): I, TORTH0351(입고BOM구성변경이력): I 

- 교환 요청 저장시 등록(AS-IS) 
1. 교환 요청문서 생성(LogisticsManagerEJB) ==> TREAST(반품/교환): I, LREAST(History): I, TDOAST(운송지시 Main): I 
- 교환 요청 저장시 등록(TO-BE) 
1. TORTG2230(주문클레임): I, TORTH2231(주문클레임변경이력): I, TORTH2233(주문클레임상태): I 

- 취소 요청 저장시 등록(AS-IS) 
1. 교환 요청문서 생성(ReturnManagerEJB) ==> TREAST(반품/교환): U, LREAST(History): U, TDOAST(운송지시 Main): U 
- 취소 요청 저장시 등록(TO-BE) 
1. TORTG2230(주문클레임): U, TORTH2231(주문클레임변경이력): U, TORTH2233(주문클레임상태): U 

- 입고처리현황(AS-IS) 
1. 입고취소 ==> TORTG0320(고객입고): U, TORTH0321(고객입고변경이력): U ==> 반품 Process 처리 안함 
- 입고처리현황(TO-BE) ==> 입고 개발자(노광선 사원) 
1. 입고취소 ==> 반품 요청 저장시 등록 Process 처리 
==============================================================================================================

-- 입고 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@ ==> 2. 반품 입고취소 
SELECT T.PO_CREATOR_ID, T.* /* PO_CREATOR_ID(주문자 ID) */ 
FROM TGRAST T /* 입고 MAIN TB */  
WHERE 1=1  
--AND T.GR_NO = '6012267263' /* 입고번호 */  
AND T.PO_NO = '2010650933' /* 주문번호 */ 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.02(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 --> 영업 회식(07:30 ~ 21:00), 헤라1(21:30 ~ 22:40): 지영 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환요청 POP(BYERB02P) 수정 
trace("[/BYOMB32P.xfdl][BYOMB32P_onload()] [start] ===>"); 

edt_rtnExQty(교환요청수량) 
edt_rtnPosQty(교환가능수량)  
div_Detail.stc_rtnPosQty.visible = false; //교환가능수량 
div_Detail.edt_rtnPosQty.visible = false;  

교환요청 POP(BYERB03P) ==> by.er.exchangreturnapp.ExchangReturnImpl  
--> 반품교환요청 POP(BYERB02P)(Pop): reqExeRetrun ==> by.er.exchangreturnapp.ExchangReturnImpl  

01. 관리자(aaaaa) ==> 주문관리 > 주문관리 > 유형별 주문현황(BYOMM11M): 상태(운송완료) > 주문진행현황(BYOMB32P)(Pop) 
반품교환요청 POP(BYERB02P) 
==============================================================================================================

[changProduct()] [prg]Y[ordRelPsCustId]Z0096067[USER_ID]99999998[returnEnable]false[returnAdminBuyer]false 
div_dlvrDtlInfoMain_div_dlvrDtlInfoSub_grd_dlvrDtlInfoList_oncellclick()  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.03(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:10 ~ 21:00 --> 조기축구(3:3 무), 토요근무 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환요청 POP(BYERB02P) 수정 
2. 요청취소사유 POP(BYERB04P) 수정 
getRequestCalcleList ==> by.er.requestcancleapp.RequestCalcleSvcImpl 
==============================================================================================================

- 오더 트래킹 정보 처리(Procedure) 
CALL MPUSR.SP_BYOM_ORDER_TRACKING 
(  
'A' -- 주문상태분류코드  
,'TR950' --주문상태유형코드  
,'TR95U' --주문상태활동코드  
,'2000000817' --주문품목ID  
,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
,'10' --요청수량  
,'20110903' --요청생성일자 
,'152411' --요청생성시간 
,'Z9999998' --최초등록사용자ID  
,'127.0.0.1' --최초등록사용자IP  
,'BYERB04P' --최초등록어플리케이션ID  
) 

debug("\n\n [/OrderTrackingBiz.java][exeOrderTracking()][1.주문상태분류코드(활동분류코드)]"+ orderTrackingSVO.getOrdStuClsfCd()  
+"[2.주문상태유형코드]"+ orderTrackingSVO.getOrdStuTpCd()+"[3.주문상태활동코드]"+ orderTrackingSVO.getOrdStuAtvCd()  
+"[4.주문품목ID]"+ orderTrackingSVO.getOrdItmId()+"[5.참조ID]"+ orderTrackingSVO.getRefItmId() 
+"[6.요청수량]"+ orderTrackingSVO.getReqQty() 
+"[reqQty]"+ orderTrackingSVO.getReqQty()+"[regCreYmd]"+ regCreYmd 
+"[regCreHms]"+ regCreHms+"[userId]"+ userId );  

--주문품목 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@  
SELECT T11.ORD_ITM_ID AS 주문품목ID, T11.ORD_ID AS 주문ID, ORD_SEQ AS 주문일련번호,  
T41.FNL_STU_CD, /* 최종상태코드(T127:주민생성, TS942:운송중, TS955:운송완료) */  
(SELECT CD_NM FROM CCMTC0100 WHERE CD =T41. FNL_STU_CD AND CD_LST_ID = 'ST628') AS ORD_STU_CLSF_CD,  
T11.FST_REG_POT, T11.* 
FROM TORTG2110 T11 /* 주문품목 TB */  
, TORTG4110 T41 /* 주문상태추적(오더트래킹) */  
WHERE 1=1 
AND T11.ORD_ITM_ID = T41.ORD_ITM_ID(+) 
--AND T41. FNL_STU_CD IN ('TS942', 'TS955') /* 최종상태코드(T127:주민생성, TS942:운송중, TS955:운송완료, TS991:반품완료) */  
ORDER BY T11.FST_REG_POT DESC 
--;  
==============================================================================================================

--주문상태코드매핑 정보 조회 @@@@@@@ ===> TR100:일반MOR, TR200:사은품 
SELECT * 
FROM TORTG4130 
WHERE ORD_STU_ATV_CD = 'TR96V'; 
==============================================================================================================

- 추석 고속버스 예약(2011.09.03(토)) 
1. 서울경부 --> 포항 : 2011.09.11(일) 07:30 
2. 포항 --> 서울경부 : 2011.09.14(수) 01:00 
1. 서울경부 --> 포항 : 2011.09.11(일) 09:30 ==> 취소 수수료 10%(예약 후 출발일 1일 전일부터 차량출발 전까지)  
--------------------------------------------------------------------------------------------------------- 

- 포항집에 가져 가야 할 것 
1. 반찬통, 열쇠, 교통카드, 휴대폰 충전기, 속옷, 운동화 
- 포항집에서 가져 올 것 
2. 반찬 가져가지 말 것(묘사때 가져올 것) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.04(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:50 기상 
06:52 예배(광림교회) ==> 설교(김정석 목사: 은혜를 알고 그 안에 거하는 자) 
08:30 종료 
08:40 조기축구(4:2 승) 
10:30 종료 
10:40 홍어회(운동장: 호균이형 쏨) 
11:40 중식(신의주 순대국: 효순이형 쏨) 
12:30 종료 
14:20 BBQ(만원씩 냄) 
17:00 종료 
17:30 귀가(이은화 과장한테 전화 함 ==> 다시 연락하지 말라고 함) 
18:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.05(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:00 --> 야근(포시즌), 김용근 수석에게 재계약 요청[(주)아이엘포유 직접 계약: 550]

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환관리(BYERM18M) 수정 
==============================================================================================================

- /CommonManagerEJB.java(/by_snrereq_p.jsp) 파일에서 
public String getDeliveryTime(String inputdate, String leadtime)	// 팩토리 캘린더 납품 예정일 구하기 
{  
	sSqlSel = " select First " + leadtime + " id from TFCAST ";	// inputdate(주문일), leadtime(소요일수) 
	sSqlSel += " where id > '"+ inputdate +"' and no <> '1' " ;  
}  
------------------------------------------------------------------------------------------------------- 

--워킹데이 정보 조회 @@@@@@@ ==> AS-IS 
SELECT FIRST 2 ID FROM TFCAST  
WHERE ID > '20110905' AND NO <> '1' 
--; 

--카렌더 정보 조회 @@@@@@@ ==> TO-BE  
SELECT CLD_YMD 
FROM CCMTG0400 
WHERE CLD_YMD > '20110905' /* 희망일 */ 
AND HOL_GB_CD IS NULL /* 토, 일, 공휴일 제외(휴일구분코드['SA', 'SU', 'HO']) */  
AND ROWNUM <= 2 
--; 

- 테이블 컨버전스 
Z:\30. 개발\06. 설계연속산출물\03. 컨버젼목록,매핑정의서\컨버젼 테이블 List_20110502.xlsx 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.06(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:30 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환관리(BYERM18M) 수정 
==============================================================================================================

-- 카렌더(워킹데이) 정보 조회 @@@@@@@ ==> TO-BE  
SELECT 'A' AS WORK_GB, CLD_YMD, HOL_GB_CD /* 1일 증가일 */  
FROM CCMTG0400 
WHERE CLD_YMD > '20110906' /* 희망일 */ 
	AND HOL_GB_CD IS NULL /* 토, 일, 공휴일 제외(휴일구분코드['SA', 'SU', 'HO']) */ 
	AND ROWNUM <= 1 /* 증가일을 희망일 다음날까지로 한정 */ 
UNION ALL 
SELECT 'B' AS WORK_GB, CLD_YMD, HOL_GB_CD /* 공휴일 여부 */  
FROM CCMTG0400 
WHERE CLD_YMD = '20110906' /* 희망일 */  
	AND ROWNUM = 1  
	ORDER BY WORK_GB 
--; 
==============================================================================================================

- 교환반품 요청서 출력 호출 
var aParam = {"req_no":"'" + dsDlvrDtlSearchList.getColumn(e.row, "ordClmId")+"'"}; 
gfn_openRQReport("E", "BY/BYERB07R.rqx", aParam); 

1. globalvars 설정 
1) gv_rqreport: http://88.1.117.21/rqreport/rqviewer.jsp ==> http://88.1.117.23/rqreport/rqviewer.jsp(DBT서버) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.07(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환 요청내역(BYERB05P) 수정 
==============================================================================================================

- 출입증카드 
1. 카드번호: E000082, 사용기간: 2011-12-31 
==============================================================================================================

- 아이엘포유 면담(계약 협상) 및 기술 작성 후 메일 전송 
1. SI 사업부 김성채 팀장(H: 010-*****-****, T: 571-14340, *@*.*): 서초구 양재동 67번지 혜인BD 4층 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.08(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 --> 회식[새마을 식당(18:20 ~ 20:40)

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환 요청내역(BYERB05P) 수정  
==============================================================================================================

- BW로 부터 mp-adm 대시보드를 위한 데이터 i/f 스팩이 나왔습니다. 
1. SD와의 i/f 는 JCO를 이용한 RFC펑션을 호출 하는 방식 
2. BW와의 i/f 는 JCO를 이용한 JCO Table access하는 방식 
==============================================================================================================

- 유효종료일시 변경 
/ExchangReturnDQM.java 에서 
insertTorth2231 ==> VALI_TO_DT /* 유효종료일시(99991231125959 --> 99991231235959) */ 
==============================================================================================================

- 카드결제 취소  
1. 카드취소(BYOMB74P) 수정 
==============================================================================================================

- JUnit 실행 
1. Run ==> Run As ==> JUnit Test 
2. 소스: /ImkJcoTest.java 
==============================================================================================================

-- 주문클레임 정보 조회 @@@
SELECT ORD_CLM_ID as 주문클레임ID, CLM_ITM_ID as 클레임품목ID,  
LGI_PRS_GB_YN 물류처리구분여부, /* 물류처리구분여부(대한통운(Y) -> 10, 업체배송(N) -> 20 */ 
RTN_EX_TRNS_TP_CD AS 반품교환운송유형코드, /* 반품교환운송유형코드[ST613](10:운송사 대행, 20:공급사 배송, 30:공급사 직납) */ 
FROM TORTG2230 T11 /* 주문클레임 TB */  
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.09(금) 작업 ■■■■■■■■■■■■■■■■
---> 06:30 ~ 20:30 --> 야근(포시즌 장사 안함: 석식 안 먹음) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환 요청내역(BYERB05P) 수정  
==============================================================================================================

- DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정 
reqGetDashBoardList --> reqGetByDashBoardCn 
reqGetByDashBoardCn // ==> dsDashboardDVO --> 매출액당월실적(slsMPrfmncAmt), 매출액당월목표(slsMGlAmt) 
reqGetByDashBoardCn // ==> dsDashboardDVO 
System.out.println((int)Math.floor(7.999));  
BigDecimal salUnp = new BigDecimal(Double.parseDouble(procGrMpDvo.getSalUnpCalAft()));	// 판매금액 
==============================================================================================================

- 포항계 회비 송금 
1. 농협: 072-02-255993, 예금주: 권태정 07202255993 
2. 기간: 2011년 2월 ~ 9월, 회비: 8만원 
- 포항계 모임 
1. 영광회집(경북 포항시 북구 죽도1동 574-1) T:247-0180 ==> 장소 변경 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.10(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 21:00 --> 조기축구(5:2 승, 1골 2 AS), 토요근무 

- IMK 차세대Prj
- DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정 
/*------------------------------------------------------------------*/ 
//금액 Mask 처리 함수 
/*------------------------------------------------------------------*/ 
function fn_MoneyMask(rtnPosQty) { 
//trace("[/BYERB02P.xfdl][fn_MoneyMask()_0] [rtnPosQty]"+ rtnPosQty ); 
//alert("[fn_ShtMask()_0] [rtnPosQty]"+ rtnPosQty ); 
if(rtnPosQty != undefined){  
return "###,###,###,###,###"; /*Mask 처리 */ 
} else { 
return ""; 
} 
} 

/*------------------------------------------------------------------*/ 
// 백만원 단위 처리 Mask 처리 함수 
/*------------------------------------------------------------------*/ 
function fn_HundMask(TotAmt) { 
//trace("[/BYERB02P.xfdl][fn_HundMask()_0] [TotAmt]"+ TotAmt ); 
alert("[fn_HundMask()_0] [TotAmt]"+ TotAmt ); 

if(TotAmt != undefined){  
var TotAmt_2 = TotAmt.replace(".",""); //금액 
if(TotAmt != undefined){  

} 
//return "##,###.0"; /*Mask 처리 */ 
} else { 
return ""; 
} 
} 
==============================================================================================================

- 문자열 왼쪽열부터 자르기 
function Left(str,n){ 
if (n <= 0){ 
return ""; 
}else if (n > String(str).length){ 
return str; 
}else{ 
return String(str).substring(0,n); 
} 
}  

- 문자열 오른쪽부터 자르기 함수 
function Right(str,n){ 
if (n <= 0){ 
return ""; 
}else if (n > String(str).length){ 
return str; 
}else{ 
var iLen = String(str).length; 
return String(str).substring(iLen, iLen - n); 
} 
}  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.11(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 추석 연휴
06:00 기상 
06:20 조식 
06:50 집 출발 
07:20 강남터미널 도착 
07:30 서울 출발 
12:30 포항 고속터미널 도착(5시간 소요) 
12:30 102번 버스 승차 
13:00 귀가 
18:30 집출발 
19:00 포항계 모임 ==> 벌집삼겹살 창포점(포항시 북구 장성동 1573-1): 참석비(2만) 납부  
	==> 동영형, 정하 미참석(진호형 돌잔치 감사 찬조 10만원) 
21:00 종료  
21:10 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.12(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 추석
07:00 기상  
08:00 작은 아버지, 대규 
08:10 차례(수일 용돈: 만원) 
09:00 작은 아버지집 제사(포항시 북구 풍림 아이원 102동 706호) 
09:20 차례 
13:30 이모집(포항시 북구 용흥동 373-15) 
14:00 섯다(이모돈 만 9천원 받아서 모두 잃음 ==> 경태 딸 나연에게 만원 줌) 
20:00 종료 
23:40 귀가(두수형님 택시 얻어타고 옴) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.13(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 00:00 

- 추석 연휴3
09:00 기상 
10:00 조식(큰누나네, 령경): 령경에게 용돈 만원 줌  
21:00 석식 
23:30 포항집 출발 
00:30 포항 고속버스 터미널 ===> 2011.09.14(수) 
01:00 포항 출발  
05:00 강남터미널 도착 
05:10 강남터미널 버스(4318번) 
05:20 사당역 버스(5524번) 
05:30 행운동주빈센터앞 도착 
05:35 귀가 
06:20 출근 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.14(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:10 --> 야근(포시즌), 업무설명회(4셀): 16:30 ~ 20:30 

- IMK 차세대Prj
- DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정 
1) 금액 모두 반올림할 것 
2) 미결현황에서 미수채권은 FI와 협의
==============================================================================================================

- SVN update 에러 
1. 현상: update C:/workspace/imk_mall/BY/TD/BYTDM03M.xfdl -r 30004 --force 
svn: Checksum mismatch for 'C:\workspace\imk_mall\BY\TD\.svn\text-base\BYTDM03M.xfdl.svn-base';  
expected: 'b157c558945aa8d2ced7417d2df88497', actual: '8655ef99266a2550a0038e6b39526e58' 
2. 조치: 해당 Project(imk_mall) 삭제 후 다시 SVN update 처리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.15(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:40 --> 야근(포시즌) 

- IMK 차세대Prj
- DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정 
당월 전년대비(%) = ((매출액_당월실적 - 매출액_전년동월_실적)/매출액_전년동월_실적)*100 
expr:fn_ForPreYear(strslsYPrfmncAmt, strslsYPerForAmt) 
년누계 전년대비(%)= ((매출액_년누계_실적 - 매출액_전년_실적)/매출액_전년_실적)*100 
expr:fn_ForPreYear(slsYPrfmncAmt, slsYPerForPrvYr)  
==============================================================================================================

- BigDecimal 타입 사칙연산 
import java.math.BigDecimal; 
public class Test { 
	public static void main(String[] args) { 
		BigDecimal bdcl1 = new BigDecimal("12345678901234567899"); 
		BigDecimal bdcl2 = new BigDecimal("12345678901234567890");  
		BigDecimal p_add = bdcl1.add(bdcl2);			// 더하기  
		BigDecimal p_sub = bdcl1.subtract(bdcl2);		// 빼기  
		BigDecimal p_mul = bdcl1.multiply(bdcl2);		// 곱하기  
		BigDecimal p_div1 = bdcl1.divide(bdcl2, BigDecimal.ROUND_UP);	// 나누기 - 무조건 반올림 
		BigDecimal p_div2 = bdcl1.divide(bdcl2, 4, BigDecimal.ROUND_UP);	// 나누기 - 소수점 4번째 자리에서 반올림 
	} 
} 
==============================================================================================================

- 해외사업장 반품/교환 금지
1. 사업장번호(해외) 체크 
==============================================================================================================

- IMK 차세대Proj 재계약(아엘포유) 
1. 기간: 2011.09.15(목) ~ 2011.09.31(목) 
2. 내용: 정규직(1,050,000원), 프리랜서(4,363,000원, 2,181,500원) 2가지 계약 체결,  
4대보험, 퇴직금(1개월 일해도 수급 가능) 
3, 계약 대행: (주)아엘포유 SI 사업부 김성채 팀장(H: 010-2352-0): http://www.il4u.co.kr 
4. 제출 서류: 주민등록 등, 초본(군경력 기재), 졸업증명서, 통장사본 
1) 졸업증명서 신청(http://www.minwon.go.kr) 발급 장소: 대치4동주민센터(568-9311) 
- 국문수수료 : 1000원, 발급수수료 : 300원 ==> 총: 1,300원(복사본 제출) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.16(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:30 --> 야근(포시즌) 

- IMK 차세대 Prj
 - DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정)  
==============================================================================================================

- BigDecimal 타입 반올림 처리 
BigDecimal bdZero_dd = new BigDecimal("000000000001244"); 
BigDecimal poOrdAmtTot2 = round(bdZero_dd, 2, true);	//반올림 처리 

public static BigDecimal round(BigDecimal d, int scale, boolean roundUp) {  
	int mode = (roundUp) ? BigDecimal.ROUND_UP : BigDecimal.ROUND_DOWN;  
	System.out.println("[/DashBoardIfBiz.java][round()][d]"+ d +"[scale]"+ scale +"[mode]"+ mode ); 

	return d.setScale(scale, mode); 
}  
==============================================================================================================

- BigDecimal 타입 형변환 
String strLastday =""; 
BigDecimal rtSrchDay = new BigDecimal("000000000000000"); 
strLastday = StringUtil.removeChar(resultTable.getString("DATE").substring(8, 10), '0'); //일자(DB조회값) 
rtSrchDay = new BigDecimal(strLastday); 

http://www.jjangu.pe.kr/javaApi/java/math/BigDecimal.html 
int iTotalCount = svo.getBusinessPlaceSearchDVOList().get(0).getTotalCount().intValue(); //형변환(BigDecimal --> int) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.17(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:40 ~ 21:00 --> 조기축구(3:2 패), 토요근무 

- IMK 차세대Prj
- DashBoard 개발 
1. MP 영업 DashBoard(BYTDM03M) 수정 ===> 1차 개발 완료(차후 데이타 검증 필요) 
2. MP 고객사 DashBoard(BYTDM03M) 수정 
hu.cu.supgusdashapp.SupGusDashBoardSvcImpl --> reqGetGusDashBoardList 
==============================================================================================================

- 프로그램 설치 
1. PL.SQL.Developer.v8 설치 
2. Mtail 설치 
==============================================================================================================

- 현용 만남 
21:00 퇴근 
21:10 호프집(5만원: 내가 쏨): 선릉역 근처 
12:30 소주집(현용 쏨) ===> 2011.09.18(일) 
02:30 종료 
02:40 헤라2(20만원): 키위 
12:30 기상 
12:40 헤라 모닝콜(3만원) 
13:10 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.0919(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:30 --> 야근(포시즌) 

- IMK 차세대 Prj
 - DashBoard 개발  
1. MP 고객사 DashBoard(BYTDM03M) 수정 
hu.cu.supgusdashapp.SupGusDashBoardSvcImpl --> reqGetGusDashBoardList 

/* 고객역할TB */ 
SELECT * 
FROM HCUTG1170 T1 
WHERE T1.CUST_ROL_CD = 'B' 
	AND T1.TRAN_CNF_DT LIKE '201108%' 
--; 
==============================================================================================================

- DB 권한 설정 
eclipse --> imk_pjt ==> Properties for imk_pjt(새창) 
DB Explorer 설정 
Driver: /imk_pjt/webapps/WEB-INF/lib/ojdbc6.jar 
Driver Class Name: oracle.jdbc.driver.OracleDriver 
URL: jdbc: oracle:thin:@88.1.117.22:1545:DBDMRO 
User ID: mpusr/usrmp 

URL: jdbc:oracle:thin:@88.1.117.24:1546:DBTMRO ==> 고객사 D 
User ID: User ID: msusr/usrms 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.20(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:10 --> 야근(포시즌): 제수석 차타고 퇴근, 부문테스트(교환/반품) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환요청 POP(BYERB02P) 수정  
주문번호 : 2020000094 
교환/반품요청 팝업을 띄우면 주문수량은 1개인데 운송지시번호에 해당하는 레코드는 2개가 나옴  
<= 취소인 경우는 레코드가 보이지 않도록 처리하는 기능 필요함 
==============================================================================================================

- BYERB05P.xfdl 파일에서 
function div_work_buttons_btn_ordCan_onclick(obj:Button, e:ClickEventInfo) {		// 요청취소 버튼 onClick 
	var aParams = new Array(); 
	var popupId = "regCancel"; 
	aParams["popupId"] = popupId; 
	aParams["ordItmId"] = ""; 
	aParams["callCnslDtldId"] = "";  
	aParams["callbackFunc"] = "fn_popup_callback"; 

	return gfn_Dialog2(popupId, "BYER::BYERB04P.xfdl", 0, 0, 72, 21, true, "-1", aParams, false, false, true); 
}  

function fn_popup_callback(dsResult, popupId, aParams) {  
	if ( popupId == "regCancel") {	//요청취소 팝업 이면  
		gfn_doService("getRtnExList");		//요청내역 조회 
		gfn_doService("getRtnExDeList");  //반품교환처리내역 조회 
	} 
} 

- BYERB04P.xfdl 파일에서 
function fn_trans_callback(strSvcId, nErrorCode, strErrorMsg) {  
	if (strSvcId == "getRequestCalcleList") { 
		alert("요청취소사유가 정상적으로 등록 되었습니다"); 
		gfn_PopupReturn(); //저장 후 처리 
		form.close();  
	} 
} 
==============================================================================================================

- 교환 미입고 ORDER_TRACKING 로그 
[/RequestCalcleBiz.java][requestCalcle()][반품교환구분코드]B[반품교환상태코드]E[고객입고여부]N[ 
주문상태분류코드]TR100[strOrdStuTpCd]TR950[strStuAtvCd]TR95U ==> TR96U 

CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR950' --주문상태유형코드  
	,'TR95U' --주문상태활동코드  
	,'2000000166' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'1' --요청수량  
	,'20110920' --요청생성일자  
	,'171347' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB04P' --최초등록어플리케이션ID  
)  
---------------------------------------------------------------------------------------------------------------- 

- 교환 입고 ORDER_TRACKING 로그 
[/RequestCalcleBiz.java][requestCalcle()][반품교환구분코드]B[반품교환상태코드]E[고객입고여부]Y[ 
주문상태분류코드]TR100[strOrdStuTpCd]TR960[strStuAtvCd]TR96T ==> TR96T 

CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96T' --주문상태활동코드  
	,'2000002662' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'1' --요청수량  
	,'20110920' --요청생성일자  
	,'220244' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB02P' --최초등록어플리케이션ID  
)  
==============================================================================================================

- 원종록형 50만원 대여 
1. 계좌번호: 신한 110-289-707983 예금주: 원상연(*) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.21(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 22:10 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환요청 POP(BYERB02P) 수정 
1) 체크버튼 체크를 한번도 안 했을 경우 ==> 요청 내역을 선택 alert 
2. 반품교환관리(BYERM18M) 수정 
1) 품목상세내역 ==> 일반형(BYOMM02P.xfdl) 팝업 확인 
--> SLST_ID(소스리스트ID) 없으면 에러가 남  
==============================================================================================================

- 교환 요청(입고건) 등록 
[/RequestCalcleBiz.java][requestCalcle()]==> [반품교환구분코드]B[반품교환상태코드]E[고객입고여부]Y 
[주문상태분류코드]TR100[strOrdStuTpCd]TR960[strStuAtvCd]TR96B 
CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96B' --주문상태활동코드  
	,'2000002671' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'2' --요청수량  
	,'20110921' --요청생성일자  
	,'180109' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB04P' --최초등록어플리케이션ID  
)  
---------------------------------------------------------------------------------------------------------- 

- 교환 요청(입고건) 에러 
[/ExchangReturnBiz.java][getSaveRetrun()][custGrYnFig]Y[exchangReturnGbCd]B[strOrdStuTpCd]TR960[strStuAtvCd]TR96T 

CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96T' --주문상태활동코드  
	,'2000002814' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'10' --요청수량  
	,'20110921' --요청생성일자  
	,'153950' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB02P' --최초등록어플리케이션ID  
) 
/* com.imk.mall.by.om.ordertrackingapp.dao.OrderTrackingCreateDQM.executeOrderTrackingCreate.001 */  
java.sql.SQLException: ORA-20002: 활동코드 無 
ORA-06512: "MPUSR.SP_BYOM_ORDER_TRACKING", 241행 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.22(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:10 --> 야근(포시즌), 세탁물 맡기기(크린스토아: 정장상의, 오바코트) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환요청 POP(BYERB02P) 수정 
1) 반품교환 처리(입고건) TEST 
2. 반품교환관리(BYERM18M) 수정 
1) 품명, 규격 수정  
==============================================================================================================

- 주문클레임ID 채번(Sequence 넘버 대체) 
sequenceId = dqm.getOrdClmId(inputMap); // 주문클레임ID 채번 

public List getOrdClmId (final Map inputMap) {  
	sql.append(" SELECT FC_CM_GET_NEWID('TORTG2230') ord_Clm_Id /* 주문클레임ID */ \n"); 
	sql.append(" FROM DUAL \n");  
} 

- FC_CM_GET_NEWID Fuction 
CREATE OR REPLACE FUNCTION MPUSR.FC_CM_GET_NEWID  
(  
	v_TABLE_ID IN VARCHAR2 , -- 해당ID의 Main테이블  
	v_TABLE_SEQN IN VARCHAR2 DEFAULT '01' -- 혹시나 키가 분기되는 경우가 필요대피  
)  
RETURN VARCHAR2 IS  
v_result VARCHAR2(20);  
BEGIN  

CASE v_TABLE_ID 
WHEN 'CCMTG0700' THEN /* 게시물 ID 채번 */  
SELECT 'BB'  LPAD(SQ_CCMTG0700_01.NEXTVAL,8,'0')  
INTO v_result FROM DUAL;  

WHEN 'TORTG2230' THEN /* 주문클레임 TABLE */  
SELECT 'RA'  SQ_TORTG2230_01.NEXTVAL  
INTO v_result FROM DUAL; 
END CASE; 

RETURN v_result;  

END; 
/ 
==============================================================================================================

- 반품 요청(입고건) 등록 
[/RequestCalcleBiz.java][getSaveRetrun()]==> [반품교환구분코드]A[고객입고여부]Y 
[주문상태분류코드]TR960[주문상태활동코드]TR96O 
CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96O' --주문상태활동코드  
	,'2000002878' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'3' --요청수량  
	,'20110922' --요청생성일자  
	,'101534' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB02P' --최초등록어플리케이션ID  
) 
------------------------------------------------------------------------------------------------------- 

- 반품 취소(입고건) 등록 
[/RequestCalcleBiz.java][requestCalcle()]==> [반품교환구분코드]A[반품교환상태코드]E[고객입고여부]Y 
[주문상태분류코드]TR100[strOrdStuTpCd]TR960[strStuAtvCd]TR96P 
CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96P' --주문상태활동코드  
	,'2000003010' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'3' --요청수량  
	,'20110922' --요청생성일자  
	,'092036' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB04P' --최초등록어플리케이션ID  
) 
==============================================================================================================

- 교환 요청(입고건) 등록 
[/RequestCalcleBiz.java][getSaveRetrun()]==> [반품교환구분코드]B[고객입고여부]Y 
[주문상태분류코드]TR960[주문상태활동코드]TR96A 
CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96A' --주문상태활동코드  
	,'2000003010' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'7' --요청수량  
	,'20110922' --요청생성일자  
	,'103002' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB02P' --최초등록어플리케이션ID  
) 
---------------------------------------------------------------------------------------------------------- 

- 교환 취소(입고건) 등록 
[/RequestCalcleBiz.java][requestCalcle()]==> [반품교환구분코드]B[반품교환상태코드]E[고객입고여부]Y 
[주문상태분류코드]TR100[strOrdStuTpCd]TR960[strStuAtvCd]TR96B 
CALL MPUSR.SP_BYOM_ORDER_TRACKING  
(  
	'TR100' -- 주문상태분류코드  
	,'TR960' --주문상태유형코드  
	,'TR96B' --주문상태활동코드  
	,'2000003010' --주문품목ID  
	,NULL --참조ID : 납품품목ID, 물류창고ID, 입고품목ID  
	,'7' --요청수량  
	,'20110922' --요청생성일자  
	,'103157' --요청생성시간  
	,'Z9999998' --최초등록사용자ID  
	,'127.0.0.1' --최초등록사용자IP  
	,'BYERB04P' --최초등록어플리케이션ID  
) 
==============================================================================================================

- MP 영업 DashBoard(BYTDM03M) URL 링크 처리 
==============================================================================================================

- 카드결제 취소  
1. 카드결제 취소[BY] ==> 이명진(000025) -> 주문관리 > 주문관리 > 주문수정/취소요청관리(BYOMM01M)  
> 주문수정취소 카드취소(BYOMM90P) > 카드취소(BYOMB74P): 카드 취소 처리 

- 카드승인내역 조회 @@@@@@@@ ===> AS-IS 
SELECT FIRST 10, A.*  
FROM TPOAST A, TPOBST T B /* 주문Main TB(TPOAST) A, 카드승인내역 TB(TPOBST) B */ 
WHERE A.PO_NO = B.PO_NO 
--AND A.COMPANY_CODE NOT IN ('1F111') 
AND B.DOC_TYPE = 'IGY' ===> id=SWAWR7FR3P8, 2010978498 
==============================================================================================================

- 디버깅 줄 수 늘이기(eclipse에서) 
1. Eclipse ==> Window --> Preferences(새창) --> Run/Debug --> Console --> Console buffer size(characters) 
: 999000 
2. 창(W) --> 환경설정(P) --> 실행/디버그 --> 콘솔 --> 콘솔 버퍼 크기(문자)(B): 999000 
==============================================================================================================

- Favorites(즐겨찾기) 
01) IT관련 
02) [검색엔진] 
03) [관심분야] 
04) [프로그래밍] 
05) 언론기관 
00. IMK 차세대Pro Dir 
10. 작업 백업 폴더 Dir 
21. UX S(BYDT) Dir 
41. UX log 확인 Dir 
90. 파일서버(.106) Dir(NW) 
91. IMK 단위테스트 Dir(NW) 
99. Back_UP 

==> 91. 네이버. 92. [네이버(C)_09M] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.23(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 --> 중식(아엘포유 김팀장님이 쏨: 직원(15명)들과 식사), 야근(포시즌) 

- IMK 차세대Prj
- 카드결제 취소(반품교환) 개발 
1. 카드결제 취소[BY] ==> 이명진(000025) -> 주문관리 > 주문관리 > 주문수정/취소요청관리(BYOMM01M)  
> 주문수정취소 카드취소(BYOMM90P) > 카드취소(BYOMB74P): 카드 취소 처리 
==============================================================================================================

--주문클레임변경이력 정보 조회 @@@@@ ====> 에러 확인할 것 
SELECT T11.FST_REG_POT, ORD_CLM_ID as 주문클레임ID  
,T11.RTN_EX_STU_CD as 상태등록구분코드 /* 반품교환상태등록구분코드(A:요청, B:접수, C:거부, D:완료, E:요청취소) */ 
,VALI_TO_DT 유효종료일시 --===> INSERT한 데이타를 유효종료일시 UPDATE 후 ===> INSERT를 함 
,VALI_FR_DT 유효시작일시 
FROM TORTH2231 T11 /* 주문클레임변경이력 TB */ --=> 접수, 완료 데이타 안 보임(에러로 판단됨) 
WHERE 1 = 1 
--AND T11.ORD_CLM_ID = 'RA20000232' /* 주문클레임ID */ 
AND T11.RTN_EX_STU_CD IN ('B', 'D') /* 반품교환상태등록구분코드(A:요청, B:접수, C:거부, D:완료, E:요청취소) */ 
ORDER BY T11.FST_REG_POT DESC; 
; 

--주문클레임상태 정보 조회 @@@@@@@@@@@@ 
SELECT T11.FST_REG_POT, T11.* 
FROM TORTH2233 T11 /* 주문클레임상태 TB */  
WHERE 1 = 1  
--AND T11.ORD_CLM_ID = 'RA20000232' /* 주문클레임ID */ 
AND T11.RTN_EX_STU_CD IN ('B', 'D')  
ORDER BY T11.FST_REG_POT DESC; 
; 
==============================================================================================================

- 사용자 조회 팝업 
1. MSCMAA2P(사용자 조회 팝업):hu.cu.userinfoapp.dao.UserinfoDQM.dListUserinfo ==> reqGetUserinfoList 
==============================================================================================================

- 경매 사이트 
1. 스피트옥션(http://www.speedauction.co.kr): 무료 회원 가입 가능(서비스 대부분 유료) 
2. 지지옥션(http://www.ggi.co.kr): 무료 회원 가입 가능(서비스 대부분 유료) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.24(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 조기축구(3:1 승, 1G 1AS), 토요근무 

- IMK 차세대Prj
- 카드결제 취소(반품교환) 개발 
1. 카드반품리스트(BYOMB75P) 생성 
1) 금액 ===> 요청수량(반품,교환) * 판매단가 
-------------------------------------------------------------------------------------------------------- 

1. 카드결제 취소[BY] ==> 이명진(000025) -> 주문관리 > 주문관리 > 주문수정/취소요청관리(BYOMM01M)  
> 주문수정취소 카드취소(BYOMM90P) > 카드취소(BYOMB74P): 카드 취소 처리 
TREAST(반품/교환), 주문Main TB(TPOAST) A, TPOBST(카드승인내역 TB)  
reqGetCardCancelMpList ===> by.om.ordercancelapp.OrderCancelSvcImpl 
reqSaveOrderMpCard ===> by.om.ordercancelapp.OrderCancelSvcImpl 

91. 카드결제 취소[BY] ==> 이명진(000025) -> 주문관리 > 주문관리 > 유형별 주문현황(BYOMM11M)  
--> 상태:운송지시(미입고 처리) > 카드반품리스트(BYOMB75P) > 카드취소(BYOMB74P) 
reqGetClmCardList --> by.er.clmapp.ClmProcessSvcImpl  
==============================================================================================================

- 포스코사거리 ==> 이마트 양재점 
1. 강남07(포스코사거리) ==> 서초08(양재역.말죽거리) ==> 코스트코,하이브랜드 
- 이마트 양재점 ==> 행운동주민센터 
1. 서초20(양재동화물터미널) ==> 461(뱅뱅사거리) ==> 행운동주민센터 
- 신사중학교 ==> 이마트 양재점 
1. 440(신사중학교) ==> 서초08(일동제약) ==> 코스트코,하이브랜드 
==============================================================================================================

- 장보기 
18:10 퇴근 
18:20 포스코사거리(마을버스:강남07) 
19:00 양재역(마을버스:서초08) 
19:20 코스트코 쇼핑(스포츠 양말, 빵 ===> 회원(연회비: 3만 5천원)이 아니라 못 삼) 
20:20 이마트 양재점 쇼핑(라면, 빵 구입) 
21:00 이마트 양재점(마을버스:서초08) 
21:20 뱅뱅사거리(버스:641번) 
22:00 귀가 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.25(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:50 기상 
06:52 예배(광림교회) ==> 설교(김선도 감독: ) 
08:30 종료 
08:40 조기축구(6:4 승) 
10:30 종료 
11:40 귀가 
13:00 중식(라면) 
14:00 취침 
21:30 석식(과자) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.26(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:50 --> 야근(포시즌) 

- IMK 차세대Prj
- 카드결제 취소(반품교환) 개발 
1. 카드반품리스트(BYOMB75P) 수정 
2. 주문수정취소 카드취소(BYOMM90P) 분석 
by.om.ordercancelapp.OrderCancelSvcImpl 
reqGetOrderCancelList: dsOrderCancelList=orderCancelList dsOrderCardInfo=orderCardInfo  
==> orderCancelList(수정 취소 정보 조회), orderCardInfo(카드 결제 금액 및 수정횟수) 
reqCancelOrderCard: dsOrderCancelList=orderCancelList dsOrderCard=orderCard ====> 카드결제 취소  
==============================================================================================================

- 인포믹스 칼럼 조회(Script)(오라클 운영 서버) 
SELECT * FROM informix.TREDST; 

- 인포믹스 칼럼 조회(Script)(인포믹스 DB 서버) 
SELECT A.*, B.TABNAME  
FROM SYSCOLUMNS A, SYSTABLES B 
WHERE A.TABID = B.TABID  
AND B.TABNAME = 'TREAST' 
ORDER BY COLNO; 
==============================================================================================================

- 행거 구매 
1. 왕자뉴2단 대형이동식행거: 39,900원 
http://www.gmarket.co.kr/challenge/neo_my_gd/contract_info.asp?oname=ordercontract&pack_no=1208726161 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.27(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 22:20 --> 야근(포시즌) 

- IMK 차세대Prj
- 카드결제 취소(반품교환) 개발 
1. 카드반품리스트(BYOMB75P) 수정 
2. 주문수정취소 카드취소(BYOMM90P) 분석  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.28(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:20 ~ 21:20 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 복수 Grid 데이타 저장 처리 
/ExchangReturnImpl.java ==> reqExeRetrun --> ExchangReturnSVO=dsSearch rtnExDtlList=dsRtnExDtlList:U 
List<ExchangReturnDVO> exRtnList = exchangReturnSVO.getRtnExDtlListUpdated(); //반품교환 상세 리스트 정보 List 
for (int i = 0; i < exRtnList.size(); i++) { 
	tempMap.put("clmItmId" , exRtnList.get(i).getClmItmId() ); /* 클레임품목id */ 
	exRtnList.get(i).toMap(); /* List --> Map으로 전환 */  
} 

/NotGrListMpSubSvcImpl.java ==> reqExeBulkExcel() 
/ProcGrMpSvcImpl.java ==> reqExeGrModifyProc()  
/QuotSlctAcpBiz.java ==> exeUpdateQuotSlctList() 
==============================================================================================================

- 데이타 백업(하드HD): 최병석 과장 HD(집에 가서 백업) 
1. 2.5인치 노트북용 하드 검색 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.29(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 21:50 --> 야근(포시즌), [전체회의]오픈 일정, 통합테스트 공유(17:00 ~ 17:30): 15층 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. TLOTG2110(납품반송품목계획) TB에 STOK_TP_CD(재고유형코드) 필드 추가(INSERT) 
1) dqm.insertTortg2230(tempMap); //주문클레임 등록(TORTG2230) 
1) TLOTG2110 T11(납품반송품목계획 TB)TB에 STOK_TP_CD(재고유형코드)에서 받아 옴 
==============================================================================================================

- Message와 Exception 처리 가이드 
http://122.1.20.30:8899/projects/DevGuide/wiki/exception%20and%20message 
1. 메세지정의: 기준정보 > 공통관리 > 메세지/용어관리(CMCMM02M) 
throw new IMKRuntimeException("SBYTD0001", "DashBoardSVO IS NULL!!"); 
==============================================================================================================

- System.out.println()문 대체 함수 
import org.apache.commons.logging.Log; 
import org.apache.commons.logging.LogFactory; 

public class DashBoardIfBiz extends AbstractBusiness {  
	protected Log logger = LogFactory.getLog(this.getClass()); 

	public Map<String, BigDecimal> getPoGrMap(DashBoardSVO dashBoardSVO) { 
	logger.debug("\n\n [/DashBoardIfBiz.java][getPoGrMap()][dashBoardSVO]"+ dashBoardSVO ); 
	} 
} 
==============================================================================================================

- Poor Error Handling 
1. finally 블록 내에서 throw 문을 사용하면 try-catch-finally 를 통한 논리 진행이 깨짐 
==============================================================================================================

- 엑셀(Excel) 반올림 
=ROUNDUP(4,362,500, -3) ===> 4,362,500 --> 4,363,000 
1. 프리 과세 기준액(⑤-⑥): 4,362,500  
2. 절사(프리 계약 금액): 4,363,000 
= ROUND(3.14159, 2) ===> 3.14159 --> 3.14 
==> ROUND:반올림, ROUNDUP:올림, ROUNDDOWN:내림  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.09.30(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:50 --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 입고 반품 요청자 처리할 것 
- MP Admin 로그인 후 입고현황[BYERB07R](주문관리 > 입고검수관리)에서 반품교환 요청시 요청인 지정 문제 
1. AS-IS에서 주문자를 요청인으로 지정 
2. TB-BE에서 유형별 주문현황[BYOMM11M](주문관리 > 주문관리) 주문자를 요청인으로 지정  
===> 주문자를 요청인으로 지정하는 것이 맞다고 판단됨 
==============================================================================================================

1. TLOTG2110 T11(납품반송품목계획 TB) ==>  
1) STOK_TP_CD --> 재고유형[ST625](01:MTO(Make To Order)-D, 02:MTO(Make To Order)-TH(Thoroguh),  
03:MTS(Make To Stock), 04:MTO(Make To Order)-VMI(Vender Management Inventory:벤더 관리 재고)) */ 
2) DLVR_SB_PLN_STU_CD --> /* 반송계획상태코드[PS016](110:운송예정등록, 210:운송지시, 220:출하완료,  
230:운송완료, 235:일부입고완료, 910:운송예정등록취소) */ 
3) BYCP_DLVR_SB_PLN_STU_CD --> /* 고객사납품 반송계획상태코드[PS626](110:운송예정등록, 210:운송지시,  
212:미집하, 214:재집하, 216:집하완료, 220:출하완료, 230:운송완료, 235:일부입고완료, 910:운송예정등록취소) */ 
4) TRNS_TP_CD --> /* 운송유형코드[HT056](1:집배송[WMS -> 공급사 -> WMS -> 고객]  
2:VMI[공급사 -> WMS(VMI) -> 고객], 3:배송[공급사 -> WMS -> 고객], 4:직납[공급사 -> 고객] */ 
==============================================================================================================

- 외장하드 구입 내역 
1. 2007.05.09(수): MG25-TERRAN(80G)테란(2007년 신형) --> 가격: 89,000원 
http://itempage.auction.co.kr/detailview.aspx?itemno=A076265592&frm=itempage  
2. 2010.06.23(수): 레토 ICS25SU(640G) 2.5 인치 --> 가격: 85,120원 

- 외장하드 버팔로(1TB, 2,5인치, USB 3.0) --> 가격: 119,000원 
http://item.gmarket.co.kr/detailview/Item.asp?goodscode=218190292&interest_group_no=1 

- 외장하드(엠지텍 2TB, 3,5인치) 
http://item.gmarket.co.kr/detailview/Item.asp?goodscode=190604033 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■