

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.11.01(화) 작업 ■■■■■■■■■■■■■■■
 ---> 07:15 ~ 22:00  --> 야근(포시즌) 

- IMK 차세대Prj
- 다국어 컨텐츠(품명, 고객사명, 공급사명) 관련 SQL 적용 
T. 서버: 주문번호: 2012000918, 품목코드: 1400296900 -> 운송지시번호: 7100000832 
T. 서버(에러): 주문번호: 2012001200, 품목코드: 5301929000 -> 운송지시번호: 7100000982 
==============================================================================================================

- 10월29일자 PMD, Fortify 점검현황 반영 
==============================================================================================================

- 결함(MP3자  테스터: 김태민)(Defect ID: 1629) 
반품교환처리현황(BYERB01M)에서 고객조직명을 복사하여 조회하면 전체 조회가 됨(고객조직시 팝업을 
조회하지 않고 조직명만 넣고 조회를 하면 어떻게 할 것인지 결정이 필요함) 
==> 발주관리 > 납품관리 > 납품대상조회(PUDMM20M)이 표준 
==============================================================================================================

- 톰켓 실행 에러 
1. 에러: org.springframework.beans.factory.BeanCreationException: Error creating bean with name 'simpleUrlMapping' 
defined in file [C:\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp0\wtpwebapps\imk_pjt\ 
WEB-INF\classes\springmvc\imk-application-servlet.xml]: Initialization of bean failed; nested exception is 
java.lang.NoClassDefFoundError: secui/trustnet/app/SecuiSession 
2. 원인: C:\workspace\imk_pjt\webapps\WEB-INF\lib/secui.jar 파일 미 존재 
==============================================================================================================

- 갤럭시탭 
1. 1G(무약정), 월24,167원(2년 약정) 
http://item.gmarket.co.kr/detailview/Item.asp?goodscode=213178783 
- 네비게이션 DMB 
1. ★아이나비 AE+ 4G DMB 네비게이션/1.3G CPU/L센서/자동볼륨조절, 가격: 209,000원 
http://item.gmarket.co.kr/detailview/Item.asp?goodscode=197129785&interest_group_no=1 
2. ★[MyDean i3 4GB]지니맵/후방카메라 지원/800*480/네비게이션/TPEG옵션/900MHz, 가격: 159,000원 
http://item.gmarket.co.kr/detailview/Item.asp?goodscode=206963360&interest_group_no=1 
==============================================================================================================

- 중고폰 
1. 기사(http://www.edaily.co.kr/news/NewsRead.edy?newsid=01098806596418496&SCD=DC13&DCD=A01404) 
2. T 에코폰(http://search.auction.co.kr/search/search.aspx?keyword=t%bf%a1%c4%da%c6%f9&category=07000000) 
3. 올레샵(http://www.olleh.com) 
==============================================================================================================

- TAMA 자산(2011) ==> 2011.10.31  @@@@@@@@@@@@@@@ 
내용     금액   원금   손익  수익률(%) 
KB미래펀드    8,891,021  6,000,000  2,891,021  48.18 
청약저축    1,000,000  
장기주택    2,000,000  
기타      108,446  
KB 총금액       
SC제일은행     29,489,983  
동양펀드    9,160,123  8,156,200  1,003,923  12.31 
프라임저축   0  
저축-삼화    47,172,752  
기타(미래에셋KorChindia) 1,758,655   1,980,199   -221,544  -11.18% 
기타(미래에셋브라질)  1,748,641   1,980,200   -231,559  -11.69% 
기타(삼성펀드)    2,016,602   2,100,000   -83,398  -3.97% 
기타 합계    5,523,898  6,060,399 
1. 총 예금액   103,346,223 
MET종신    5,597,060  
PCA변액    19,200,000  
대생연금    14,600,000  
2. 총 보험금   39,983,060 
남권형 대여금   30,000,000  
3. 전세금    55,000,000  
총 합계    228,329,283  28,156,200  4,858,443 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.02(수) 작업 ■■■■■■■■■■■■■■■■
---> 06:50 ~ 21:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 수량 0으로 하고 체크 후 저장하면 주문품목ID null 에러 발생 
2. 조치: 수량 0으로 하고 체크 후 저장하면 알람 뛰움 
3. 예제) T. 서버(에러:제수석): Z0046525, 주문번호: 2012000562, 품목코드: 1000015600 

T. 서버(에러): 주문번호: 2012001200, 품목코드: 5301929000 -> 운송지시번호: 7100000982 
T. 서버: 주문번호: 2012000918, 품목코드: 1400296900 -> 운송지시번호: 7100000832 
==============================================================================================================

- 반품교환관리(BYERM18M) 수정 
1. Gid에 SAP처리상태, SAP에러내용 추가 
==============================================================================================================

- 다국어 컨텐츠(품명,고객사명,공급사명) 처리 
1. 모두 처리(제조원 제외) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.03(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:10 ~ 22:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품/교환 배송추적조회(BYERB06P) 
1. 운송진행구분을 보여줄 때 교환인 경우는 동일 공통코드에 USE_PS_DEF_CN1을 보여주도록 변경 
==============================================================================================================

- 반품교환관리(BYERM18M 수정 
1. 조회 조건에서 사람명(요청자, 판매담당, 인수자, 요청대행)으로 조회 
==============================================================================================================

- 반품/교환 배송추적조회(BYERB06P) 수정(2중 CASE문) 
 /* 06. 반품/교환 배송추적 조회(ClmDQM.getDeliveryTrList --> reqGetDeliveryTrList() */ 
 SELECT T4.ORD_CLM_ID /* 요청번호 */ 
     ,(SELECT CD_NM 
         FROM CCMTC0100 
        WHERE CD = T4.RTN_EX_TRNS_TP_CD --반품교환운송유형코드(10:10:운송사 대행, 20:공급사 배송) 
          AND LANG_CD = NVL('KO', 'KO') /* 세션언어코드값 */ 
          AND CD_LST_ID = 'ST613' 
         ) AS TRNS_TP_NM /* 물류처리명 */ 
      ,(CASE 
          WHEN T3.STOK_TP_CD = '4' THEN    --물류유형CD가 직납이면 
            '운송사 대행' 
          ELSE 
            CASE 
            WHEN (SELECT CD 
                 FROM CCMTC0100 
                WHERE CD = T3.TRNS_TP_CD --운송유형[HT056] 
                  AND LANG_CD = NVL('KO', 'KO') /* 세션언어코드값 */ 
                  AND CD_LST_ID = 'HT056') = '03' THEN 
                  '공급사 배송' 
             ELSE 
               '운송사 대행' 
             END 
         END) AS TRNS_TP_NM_222 /* 물류처리명  */ 
   FROM TORTG2110 T1 /* 주문품목 TB */ 
       ,TORTG2520 T2 /* 주문품목부가정보 TB */ 
       ,TLOTG2110 T3 /* 납품반송품목계획 TB */ 
       ,TORTG2230 T4 /* 주문클레임 TB */ 
       ,TORTH2233 T5 /* 주문클레임상태 TB */ 
       ,TLOTG3120 T11 /* 운송지시품목 TB */ 
==============================================================================================================

- imk_pjt DB Explorer 설정 
Driver: /imk_pjt/webapps/WEB-INF/lib/ojdbc6.jar 
Driver Class Name: oracle.jdbc.driver.OracleDriver 
URL: jdbc:oracle:thin:@88.1.117.24:1546:DBTMRO --> T서버 
===> jdbc:oracle:thin:@88.1.117.22:1545:DBDMRO --> 개발서버 
User ID: mpusr 
Password: mpusr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.04(금) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:10  --> 야근(팬다) 

- IMK 차세대Prj
- 반품교환처리현황(BYERB01M) 수정 
1. 고객조직명(edt_orgNm)으로도 조회 가능하도록 수정(팝업 필요없이 조회 가능) 
--> 주문 수정/취소(BYOMB21M) 참조 
==============================================================================================================

- globalvars.xml 파일 로그인 설정 
gv_firstname: Z0000000 
gv_lastname: Z0096067_이기동 
gv_dept: Z0046525_고병진 
gv_p_userId: Z0000000 ---> 실제 global 로그인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.05(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:50 ~ 18:00  --> 토요근무,  조기축구(06:50 ~ 08:10): 창세 

- MP 영업 DashBoard(BYTDM03M) 수정 
1. PO, GR 누계 데이터 확인 
1) 누계, 이익율을 계산 후 백만원 단위 반올림 후 절사하여 Grid에 데이타를 보여주기 때문에 혼돈이 발생 
- Jnit 테스트 
1. ImkJcoTest.java 
1) Run As --> ImkJcoTest(클릭) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.06(일) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:00  --> 비 

▦조기축구
05:10 기상 
05:20 조식 
06:40 고속터미널(어머니 바래다 줌(1주일 있다 감)) - 우승고속(30,400원) 7시차탐, 용돈 10만원 드림 
07:20 회사 출근(경비 설정 되어 있어서 되돌아 옴) 
08:40 조기축구(4:3 승) 
10:30 종료 
11:00 중식(문경세재: 오고문님이 쏨) 
12:50 귀가 
13:00 취침 
20:00 석식(김치찌게) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.07(월) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 21:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 수량 수정 
1) 입고 ==>  01. 수량(입고수량(반품수량 제외)) 
2) 수량(입고수량) 표현시 반품수량을 제외한 수량으로 표현(8 --> 15)으로 수정 처리 
3) T. 서버(에러): 주문번호: 2012002287, 품목코드: 1000013700 -> 운송지시번호: 7500000030 
==============================================================================================================

-- 부서 조회 @@@@@@@@@@ 
SELECT DEPT_CODE 
FROM SALEBS.TB_SET41 
START WITH DEPT_CODE LIKE 'TMS123' 
CONNECT BY PRIOR PRE_DEPT_CODE = DEPT_CODE 
--; 

시작점을 찾을 (트리 젤 최초 노드)조건을 START WITH DEPT_CODE(기준 칼럼) = '' 
잡으면 이때 부터 PRIOR뒤의  PRE_DEPT_CODE = DEPT_CODE 
기준칼럼 DEPT_CODE가 속해 있는 PRE_DEPT_CODE를 찾습니다. 
==============================================================================================================

- 비닐(옷거리용[150cm*100cm], 유리창[150cm*140cm]), 집게 
- 카페트[140cm*100cm] 
- 반팔 패딩 조끼 
- 갤럭시노트 
- 수퍼맨(강남구 역삼동 838-6: 뱅뱅사거리 푸르덴셜 생명 뒷편), 1% 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.08(화) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 21:30  --> 야근(포시즌), 조대상씨 복귀(결혼떡 돌림) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. JUnit 재설정 ==> ImkJcoTest.java로 설정 
==============================================================================================================

- 반품교환요청 POP(BYERB02P) 수정 
1. 수량 수정 
1) 주문번호: 2012002153 ==> MTS 미입고 일때 반품/취소수량 다시 차감 못하게 수정 처리함 
==============================================================================================================

- IMK 차세대Proj 연장 계약(아엘포유) 
1. 기간:  2011.09.15(목) ~  2011.11.31(목) ==>  2011.02.29(수) 
2. 내용: 정규직(1,050,000원), 프리랜서(4,363,000원, 2,181,500원) 2가지 계약 체결, 
            4대보험, 퇴직금(1개월 일해도 수급 가능) 
3, 계약 대행: (주)아엘포유 SI 사업부 김성채 팀장(H: 010-2352-0): http://www.il4u.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.09(수) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 21:50  --> 야근(포시즌), 중식(김장독 김치찌게): 현용(내가쏨) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. 조회 안된 건 0으로 표시(주요지표 조회 안된 건은 -으로 표시) 
==============================================================================================================

- 3자리 콤마 처리 함수 
function fn_AddComma(number) { 
   var strResult;  
    var number = '' + number;     
    
    if (number.length > 3) { 
        var mod = number.length % 3;  //3으로 나눈 나머지 
        var output = (mod > 0 ? (number.substring(0,mod)) : '');   //0보자 크지 않으면 '' 처리 
            
        for (i=0 ; i < Math.floor(number.length / 3); i++) { 
            if ((mod == 0) && (i == 0)) 
                output += number.substring(mod+ 3 * i, mod + 3 * i + 3); 
            else 
                output+= ',' + number.substring(mod + 3 * i, mod + 3 * i + 3); 
        }  //end of for 
         
        strResult = output; 
        
    } else { 
        strResult = number; 
    } 
     
  return strResult; 
} 
==============================================================================================================

- 맞선(외5촌 작은이모 소개) 
1. 권희진(*) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.10(목) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:05 ~ 22:00  --> 야근(포시즌) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정
1) 매출액 
 가. 당월 
A. 목표: 매출액_당월_목표(slsAmtTmmTagt) 
B. 실적: 매출액_당월_실적(slsAmtTmmAcrs) 
C. 목표대비(%)(11.) = ((매출액_당월_목표(slsAmtTmmTagt) - 매출액_전년동월_목표(slsAmtLyySmmTagt)) 
   /매출액_전년동월_목표(slsAmtLyySmmTagt))*100 
D. 전년대비(%)(12.) = ((매출액_당월_실적(slsAmtTmmAcrs) - 매출액_전년동월_실적(slsAmtLyySmmAcrs)) 
   /매출액_전년동월_실적(slsAmtLyySmmAcrs))*100 
 가. 연누계 
A. 목표: 매출액_금년_목표(slsAmtCyyTagt) 
B. 실적: 매출액_금년_실적(slsAmtCyyAcrs) 
C. 목표대비(%)(13.) = ((((매출액_금년_목표(slsAmtCyyTagt) - 매출액_전년_목표(slsAmtLyyTagt)) 
   /매출액_전년_목표(slsAmtLyyTagt))*100 
D. 전년대비(%)(14.)  = ((매출액_금년_실적(slsAmtCyyAcrs) - 매출액_전년동월_실적(slsAmtLyySmmAcrs)) 
   / 매출액_전년동월_실적(slsAmtLyySmmAcrs))*100 
==============================================================================================================

- 엑셀 벌크다운 개발 가이드 
http://122.1.20.30:8899/projects/DevGuide/wiki/excel%20bulk%20down%20dev 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.11(금) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:15 ~ 21:50  --> 야근(팬다: 탕수육(최병석 과장이 모니터 주웠다고 쏨)) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. 주요지표 데이터 툴팁타입으로 원단위 보이기 
2. 목표대비(%), 전년대비(%) 계산식 공식 새창 뛰우기 
==============================================================================================================

- 노트북 
1. 삼성전자 센스 NT-RF710-S76, LCD 17.3" LED(1600 x 900)(1920 x 1080이 좋다고 함), 가격: 1,477,880원 
http://shopping.naver.com/detail/detail.nhn?cat_id=01140602&nv_mid=5661007013&frm=nv_model 
2. 삼성전자 센스 P-580 
3. 맥북에어 

- 윈도우 XP(최병석 과장) ==> 윈도우 XP CD-KEY: T7DT4-PYDVX-BWCVV-QYX9F-6VV8J 
- J46 여성용 구스다운 자켓: http://www.kantukan.co.kr/ybbs/shop/product/productDetail.php?p_idx=1118 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.12(토) 작업 ■■■■■■■■■■■■■■■■
 ---> 09:10 ~ 21:00  --> 토요근무,  조기축구(07:000 ~ 08:30): 8:7 패(1G, 1AS) 

- MP 영업 DashBoard(BYTDM03M) 수정 
1. 주요지표 데이터 확인 재구성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.13(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:50 기상 
06:52 예배(광림교회) ==> 설교(김정식 목사: 자랑할 만한 그리스도인) 
08:20 종료 
08:40 조기축구(6:4 승) 
09:30 신사조기회 파카비 나눠줌(개인부담: 7만원) 
10:30 종료 
11:30 중식(유명국해장국: 치근형이 쏨) 
13:00 종료 
14:10 강남역 
14:40 안(수화: 레몬(2S, C, Ki)) 
15:40 취침 
19:00 기상 
19:05 석식(수화: 라면, 밥) 
20:00 귀가 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.14(월) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:10  --> 야근(포시즌) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. 주요지표 데이터 확인 재구성 
==============================================================================================================

- 피부과 예약 
1. CU클린업피부과(삼성점): http://www.upskin.co.kr 
2. 유앤아이피부과(강남점): http://www.uni114.co.kr 
==============================================================================================================

- 신사조기회 파카비 송금 
1. 신한은행(110-318-342822) 구창원(총무), 7만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.15(화) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:00  --> 야근(포시즌), CU피부과(외이도염: 진료, 주사), 강남수약국(먹는약(1주일치), 연고(트라보코트 크림)) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. 목표, 실적 주요지표 데이터 영문 칼럼 생성 
2. 3자리 이상 음수값 처리 함수 수정(-,123,000 --> -123,000) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.16(수) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:50 ~ 21:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 고상진 차장: Z0207951, Z0207931(BY), 염정훈 차장: Z0154358 
RA21000001(주문번호: 2015538409)  ==>  TORTG4120 
RA21000042(주문번호: 2015545096) 
==============================================================================================================

- 반품교환 배송추적조회(BYERB06P) 수정 
1. 공급사 배송은 도착물류센터 없게 처리(TRNS_TP_CD(물류처리구분CD(10:10:운송사 대행, 20:공급사 배송)) 
2. 반품교환 배송추적조회(BYERB06P)화면에서 추적내역 GRID 운송주문구분 필드에 기존에 존재하던 
"반품주문생성" 라인이 보여야 함 ==> 전체 추적 가능하게 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.17(목) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 22:00  --> 야근(포시즌), 정재우 책임 14층으로 복귀(박성진씨 자리) 

- IMK 차세대Prj
- 반품교환처리현황(BYERB01M) 수정 
1. 캘린더 공휴일 처리 
==============================================================================================================

- G-ERP 반품교환관리(GLOMGH0M) 
1. 캘린더 공휴일 처리, GRID 반품, 교환 필드 통합 
- 간소화 반품교환관리(STERD10M) 
1. 캘린더 공휴일 처리, GRID 반품, 교환 필드 통합 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.18(금) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:30  --> 야근(팬다),  병행가동 진행 방안 공유(16층 교육장: 프로젝트팀 전원)(17:20 ~ 17:40) 

- IMK 차세대Prj
- 반품교환요청 POP(BYERB02P) 수정 
1. 희망일(Calendar) 공휴일 선택 alert 처리(DB에서 조회 안하도록 수정) 
2. 희망일(Calendar) + 2일 선택 alert 처리(DB에서 조회 안하도록 수정) 
 1) +2 한 날짜가 공휴일 코드(토:SA, 일:SU, 휴일:HO) 일때 
 2) +2 하기 전 날짜가 28, 29, 30, 31일때 
==============================================================================================================

- 반품교환요청 POP(BYERB02P)이 안보임(주문번호: 2015540760) 
1. 한기원(주문자고객명)에 대한 주문자고객ID가 존재하지 않아서 화면이 안 보임 
SELECT * FROM TORTG2200  /* 주문관계자 TB */ 
WHERE 1= 1 
   AND ORD_ITM_ID = '1011249785'   --주문품목ID 
   AND ORD_PS_ROL_CD = 'B2' 
--; 

UPDATE TORTG2200   /* 주문관계자 TB */ 
SET ORD_REL_PS_CUST_ID = 'Z0821771'    --주문자고객ID 
WHERE 1= 1 
   AND ORD_ITM_ID = '1011249785' 
   AND ORD_PS_ROL_CD = 'B2' 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.19(토) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 18:00  --> 토요근무, 흐림, 중식(낙지촌), 수완(대규) 돌잔치(돌반지 선물) 

- DashBoard ERD 작성 
1. TOBE-ERD_DashBoard 작성 
1) HCUTG1110_고객, HCUTG1170_고객역할, HCUTG1160_고객간관계 
 ===> 고객 역할로 분류 
 The Data Model Resource Book 
 ==============================================================================================================

- 수완(대규) 돌잔치
18:00 퇴근 
18:10 선릉역(61) 
18:40 언더더씨(회현역 1번 출구): 작은아버지, 선희(미연, 나연), 선주(민지, 민석) 누나 
19:00 돌잔치 행사 ==> 돌반지 선물 
20:30 종료 
21:20 귀가 
01:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.20(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦묘사
06:20 기상 
06:40 버스(501번) 
07:10 서울역 
07:30 KTX(111번 열차: 역방향) --> 베낭(묵은 쌀)
09:20 동대구역 도착 
09:30 작은 아버지 만남
09:40 택시(2,200원 ==>  내가 냄) 
09:50 동부정류장(포항행: 6,700원 ==> 작은 아버지가 냄) 
10:50 포항터미널 도착 
10:55 택시(5,200원 ==> 내가 냄)
11:20 풍림 아이원 102동 706호 도착 
11:40 포항집 도착(작은 아버지 차) 
12:20 묘사(5촌 할배, 병일 아제, 중욱(중협) 아제, 종근(준규) 아제, 판섭이 고모, 형섭, 경희) 
14:10 중식 
15:00 종료 
23:00 염색(샤워) 
23:20 포항집 출발(베낭(사과, 떡)) 
24:30 포항고속터미널 ==> 2011.11.21(월) @@@
01:00 포항 출발 
04:55 강남고속버스터미널 
05:05 강남고속버스터미널(143번) 
05:20 무역센터 
05:40 삼성동 빌딩(출근)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.21(월) 작업 ■■■■■■■■■■■■■■■■
 ---> 05:40 ~ 22:00  --> 야근(포시즌), IMK 병행오픈 

- IMK 차세대Prj
- 운영 서버 확인 
1. 주문번호: 2015538784 ==> 교환 요청(반품교환요청 POP(BYERB02P)) -> 희망장소(주소) 없음 
2. 주문번호: 2015540540 ==> 교환 요청(반품교환요청 POP(BYERB02P)) -> 전화번호, 핸드폰, 희망장소(주소) 없음 
==============================================================================================================

- 고객 모델 의문 사항(1.MarketPlace_1.기준정보_01.고객MP.erwin파일 기준) 
1. 고객과 고객간관계에서 2개의 Relationships(주고객ID, 부고객ID)이 존재 하는 이유(보통 Relationships은 1개로 설정) 
2. 고객간관계에서 주고객ID, 부고객ID의 의미하는 것(?) 
==> 고객 ==> 회사(주고객ID) --> 사업장(부고객ID) --> 조직 --> 사용자 

3. 고객 관련 주요 테이블 
==> MCUTG1110(고객 TB), MCUTG1160(고객간관계 TB), MCUTG1170(고객역할 TB) 
==> MCUTG1120(사업자 TB), MCUTG1130(조직 TB), MCUTG1140(고객사부가정보 TB), MCUTG1190(고객주소 TB) 
--------------------------------------------------------------------------------------------------------------------------- 

-- 고객 조회(MCUTG1110 테이블 T2, T3로 2번 작성) 
SELECT T2.CUST_ID, T2.CUST_NM, T3.CUST_ID, T3.CUST_NM, T4.VALI_TO_DT 
  FROM MCUTG1160 T1 /* 고객간관계 TB */ 
      ,MCUTG1110 T2 /* 고객 TB */ 
      ,MCUTG1110 T3 /* 고객 TB */ 
      ,MCUTG1170 T4 /* 고객역할 TB */ 
      ,MCUTG1170 T5 /* 고객역할 TB */ 
 WHERE T1.MACUST_ID = T2.CUST_ID 
   AND T1.MICUST_ID = T3.CUST_ID 
   AND T2.CUST_ID = T4.CUST_ID 
   AND T3.CUST_ID = T5.CUST_ID 
   AND T1.CUST_REL_CD = 'B04'    /* 고객관계코드(B03:회사, B04:사업장) */ 
   AND T1.MACUST_ID = '10000868' /* 주고객ID(10000868(삼성전자(주))) */ 
   AND T4.CUST_ROL_CD = 'B'      /* 고객역할코드[HT003](A:관리자, B:고객사, C:조직, V:공급사) */ 
   AND T4.VALI_TO_DT = '99991231235959' /* 유효종료일시(삭제된 것 제외) */ 
   AND T5.VALI_TO_DT = '99991231235959' /* 유효종료일시(삭제된 것 제외) */ 
; 

-- 고객 조회2 
SELECT T2.CUST_NM AS 회사명 
      ,T1.MICUST_ID AS 부고객ID 
      ,(SELECT CUST_NM FROM MCUTG1110 WHERE CUST_ID = T1.MICUST_ID) 사업장명 
  FROM MCUTG1160 T1 /* 고객간관계 TB */ 
      ,MCUTG1110 T2 /* 고객 TB */ 
      ,MCUTG1170 T4 /* 고객역할 TB */ 
 WHERE 1 = 1 
   AND T2.CUST_ID = T1.MACUST_ID --주고객ID 
   AND T2.CUST_ID = T4.CUST_ID --주고객ID 
   AND T1.MACUST_ID = '10000868' --10000868(삼성전자(주)) 
   AND T1.CUST_REL_CD = 'B04' --고객관계코드(B04:사업장) 
   AND T4.CUST_ROL_CD = 'B' /* 고객역할코드[HT003](A:관리자, B:고객사, C:조직, V:공급사) */ 
   AND T4.VALI_TO_DT = '99991231235959' --유효종료일시(삭제된 것) 
; 
==============================================================================================================

- 2일 후 계산(날짜 계산) 
var strTodayPlus = getDate("20120121", 2);  //2일 후 계산 
trace("[/BYERB02P.xfdl][fn_init_WorkDdInfo()] [strTodayPlus]"+ strTodayPlus ); 
==============================================================================================================

- 주문클레임 조회 @@@@@@@@@ 
SELECT ORD_CLM_ID AS 주문클레임ID 
		  ,T1.STOK_TP_CD AS 물류유형코드 
		  ,T1.FNL_AMD_POT 
		  ,T1.FNL_AMD_APP_ID 
		  ,T1.* 
FROM TORTG2230 T1 
WHERE T1.STOK_TP_CD IS NULL 
	AND ORD_CLM_ID = 'RA40000105' --주문클레임ID 
ORDER BY T1.FNL_AMD_POT DESC 
; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.22(화) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:40  --> 야근(포시즌) 

- IMK 차세대Prj
- [MP, HUB] 회사조회 화면 매출액 표시 억단위 표시로 처리 
1. 매출액(억원) bind: slsAmtE 
2. 회사조회(MSCUM36M), Hub 회사조회(MUCUM61M) 
==============================================================================================================

-  Hub 회사조회(MUCUM61M) 수정 
1. Grid에 추가 필드 추가 
==============================================================================================================

- Comma 설정 
expr:SetComma_2(slsAmtTmmTagt) ===> expr:SetComma(oriValue); 
"expr:expr:(gfn_IsNull(getSum(&quot;grSumAmt&quot;)))?'':'##,###,###,###,###,###'" 
expr:slsAmtTmmTagt==null  slsAmtTmmTagt==""?"-":"SetComma(slsAmtTmmTagt)" 
mask="expr:expr:(gfn_IsNull(getSum(&quot;grSumAmt&quot;)))?'':'##,###,###,###,###,###'" 
var rtn = grd_list.setCellProperty("Body",6,"mask","###,###,###,###.#####"); 
==============================================================================================================

- Sap GUI 설치 
1. SapGuiSetup.exe 설치(Z:\90. WorkPlace\91. 참고자료\00. 프로그램설치화일\05. SAP 설치\GUI 720 
\PRES1\GUI\WINDOWS\WIN32) 
2. ECC 테스트(88.1.117.64,, 00) ==> Client: 411, sds03/1qaz2wsx 
==============================================================================================================

- 도시가스 검침 
1. 전화: *(전화해서 창문틈 열쇠 꺼내서 일처리 하라고 함 ==> 처리 완료) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.23(수) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 22:00  --> 야근(포시즌) 

- IMK 차세대Prj
- [회사조회(MSCUM36M) 수정 
1. 회사조회(MSCUM36M), Hub 회사조회(HUCUM61M) 
reqGetCompanyList ==> ms.cu.customersearchapp.CustomerSearchSvcImpl 
==============================================================================================================

- 날짜 타입 변경(mask 미사용) 
1. null 이면 normal 처리(Grid displaytype에 설정) 
==> expr:tranCnfDt==null  tranCnfDt==""?"normal":"date" 
==============================================================================================================

- MP Hub Dashboard 품목, 공급사에서 엔터 사용 용어 안 보임(용어DB에서 삭제됨 ==> 재등록) 
1. 용어DB에서 삭제됨 ==> 재등록 
==============================================================================================================

- 하드 Disk 명명법 
1. HD_2008_01A[Main](70G), HD_2008_01B(80G) ==> 삼성 센스 노트북 
2. HD_2010_07A[Main](250G), HD_2010_07B(250G) ==> DELL Studio XPS 
51. EXT_HD_2011_10A(1TB)_[버팔로] ==> 외장하드 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.24(목) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:00  --> 야근(포시즌), ToDoList 설치(Task 관리) 

- IMK 차세대Prj
- MP 영업 DashBoard(BYTDM03M) 수정 
1. this.position.bottom 길이가 짧아서 화면 겹쳐 보임 
==============================================================================================================

- BW 연결 수정 요청 
현재 BW(400) --> Q(311) ===> 수정 BW(400) --> P(100) 
==============================================================================================================

- 무선 마우스 
1. 로지텍 M505(http://shopping.naver.com/detail/detail.nhn?cat_id=01010402&nv_mid=5476225206&frm=nv_model) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.25(금) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:00  --> 야근(팬다), 이호성 과장 철수 

- IMK 차세대Prj
- 조직관리(MSCUM31M), Hub 조직관리(MUCUM66M) 수정 
1. 조회조건에서 조직분류 Combo 생성 
조직분류  --> reqGetOrgClsfList ==> ms.cm.customersearchapp.CustomerSearchSvcImpl, CustomerSearchSVO 
사업장 --> reqGetBpList ==> ms.cm.customersearchapp.CustomerSearchSvcImpl, CustomerSearchSVO 
==============================================================================================================

/* 01. 조직분류 조회(CompanyBusinessPlaceSearchDQM.dListOrgClsfList --> reqGetOrgClsfList()) */ 
SELECT T1.BYCP_CUST_ID 
      ,T1.RNK_NUM 
      ,T1.ORG_CLSF_CD AS CD 
      ,T1.RNK_NUM  '. '  (SELECT CD_NM 
                             FROM CCMTC0100 
                            WHERE CD = T1.ORG_CLSF_CD 
                              AND LANG_CD = NVL('KO', 'KO') 
                              AND CD_LST_ID = 'HT075') AS CD_NM 
--,RNK_NUM AS 순위수 
-- ,T1.ORG_CLSF_CD AS 조직분류코드 
  FROM MCUTG1260 T1 /* 조직체계 TB */ 
 WHERE T1.BYCP_CUST_ID = :hrkCd  /* 고객사고객ID */ 
   AND T1.VALI_TO_DT = '99991231235959' 
 ORDER BY RNK_NUM 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.26(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00  --> 토요근무,  조기축구(07:00 ~ 08:30): 4:3 승, 중식(풍림원: 짬뽕밥), 석식(낙지촌) 

- 조직관리(MSCUM31M), Hub 조직관리(MUCUM66M) 수정 
1. 조회조건에서 조직분류 Combo 생성 
조직분류  --> reqGetOrgClsfList ==> ms.cm.customersearchapp.CustomerSearchSvcImpl, CustomerSearchSVO 
사업장 --> reqGetBpList ==> ms.cm.customersearchapp.CustomerSearchSvcImpl, CustomerSearchSVO 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.27(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00  --> 신사조기회 정기총회 

▦조기축구
07:50 기상 
08:50 신구초등학교 
09:20 조기축구(4:3 승)(3팀) 
10:00 정기총회(회장선출: 김영배 회장 당선) 
10:30 조기축구(1:0 패) 
11:40 종료 
12:20 중식(유명국해장국: 김영배 회장이 쏨) 
12:40 귀가 
15:10 이발(이발(봉천동: 리) 
16:10 서울대입구역 
16:40 철산역 1번 출구 
16:50 일마레(철산점: 경기도 광명시 철산동 382 다인빌딩 3층) 
17:05 권희진(*)씨 만남(제철고 -> 이화여대) 
17:20 석식(스파게티: 내가 쏨) 
19:10 커피점(권희진씨가 쏨) 
20:00 종료 
20:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.28(월) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 22:00  --> 야근(포시즌), 한나라 한의원(진료, 침, 부황) 

- IMK 차세대Prj
- MP대시보드 좌측 패널 조회 방법 변경 
==============================================================================================================

- 회사/사업장 조회 팝업 화면에서 비영업용 회사는 조회되지 않도록 변경 
1. MCUTG1140에 CUST_TP_CD가 03이 비영업용회사임 
2. 회사/사업장조회 팝업 프로그램ID : MSCMM15P 
3. 테스트가능 화면 
    MP Admin/ 기준정보 / 고객프로파일관리 / 등록 버튼 클릭하면 회사 사업장 조회 팝업 띄울 수 있음 
==============================================================================================================

- 한의원 
1. 한나라한의원: http://www.hannara-om.co.kr 
- 넷북 
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=223106015&GoodsSale=Y&jaehuid=200002657&service_id=pcdn 
- 휴대폰 
1. http://www.ppomppu.co.kr/zboard/view.php?id=ppomppu2&no=19163 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.29(화) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:10 ~ 22:00  --> 야근(포시즌), 한나라 한의원2(침, 부황) 

- IMK 차세대Prj
- 화면이벤트 정비 및 서비스 등록(권한관리 관련) 
1. 기준정보 ==> 권한관리  ==> 화면관리(D서버) 
1) 회사조회, 사업장조회, 조직조회 포함 
==============================================================================================================

/* 01. 화면[기능] 정보 조회 */ 
SELECT 'R' AS CRUD 
		  ,A.BUS_GB_CD AS 업무구분코드 
		  ,A.PIC_ID AS 화면ID 
		  ,A.PIC_NM AS 화면명 
FROM CUSTG0030 A /* 화면[기능] TB */ 
WHERE 1 = 1 
  --AND A.BUS_GB_CD = 'MS'  --업무구분코드 
	AND A.PIC_ID = 'MSCUM36M' --화면ID 
  --AND UPPER(A.PIC_NM) LIKE '%'  UPPER('회사조회')  '%'   --화면명 
	AND TO_CHAR(SYSDATE, 'YYYYMMDDHH24MISS') BETWEEN A.VALI_FR_DT AND 
   A.VALI_TO_DT 
ORDER BY A.PIC_URL_ADDR 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.11.30(수) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:15 ~ 21:30  --> 야근(포시즌), 한나라 한의원3(침, 부황), 김미영 과장 철수, 장영재 과장 I/F팀으로 이동 

- IMK 차세대Prj
- MP Hub DashBoard 수정 
1. MP Hub DashBoard 수정(12월 배치 년 수정, 폴더명 수정, 쿼리 수정) 
2. 공급사 등록공급사수 수정 
==============================================================================================================

- 회사/사업장 조회 팝업(MSCMM15P) 화면에서 비영업용 회사는 조회되지 않도록 변경 
1. DVS_CD 가 B이면 고객구분을 회사로 default Setting 후 변경불가처리 
2. 원자재 회사만 조회 되도록 처리해야 함 
==============================================================================================================

- 사업장조회(HUCUM63M) 수정 
1. 사업장조회(MSCUM35M)  참조 
==============================================================================================================

- 팝업 파리미터 널 처리 
var gDvsCd ; //최상위품목분류코드(A:일반, B:원자재, C:사은품) 

if(gfn_IsNull(this.getOwnerFrame().dvsCd)) {  //팝업 파리미터가 null 이면 
 gDvsCd = "A"; 
} else { 
 gDvsCd = dvsCd; 
} 
--------------------------------------------------------------------------------------------------------- 

- 널 처리 함수 
function gfn_IsNull(sValue) 
{ 
    if (new String(sValue).valueOf() == "undefined") return true; 
    if (sValue == null) return true; 
    var v_ChkStr = new String(sValue); 

    if (v_ChkStr == null) return true; 

    if (v_ChkStr.toString().length == 0 ) return true; 

    return false; 
} 
==============================================================================================================

- 노트북 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=10585&cate_c4=0&depth=3&prod_c=1374536 
http://blog.danawa.com/prod/?blogSection=2&cate_c1=860&cate_c2=869&cate_c3=10585&cate_c4=0&depth=3&prod_c=1447308 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■