

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2011.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2011.08.01(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50~ 18:00  --> 휴가4 

- 휴가4 
07:30 기상 
08:00 조식 
08:20 집출발 
09:10 포항터미널 도착 
09:30 포항 출발 
13:40 강남터미널 도착 
14:20 귀가 
19:30 이발 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.02(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 현용 만남(삼겹살, 치킨, 포장마차) 

- IMK 차세대Prj
- MP 영업 DashBoard 개발 
1. SAL-SD-Interface Mapping 정의서 작성 
==============================================================================================================

- 날짜 설정 
var objDate = new Date(); 
var StrTodayYY = objDate.getFullYear().toString();  //년 
var StrTodayMM = Right("0" + (objDate.getMonth() + 1), 2); //월 
==============================================================================================================

- MP Hub DashBoard 개발 
1. 품목(일부 쿼리 변경) 
2. 공급사(오늘까지 해준다고 함: 박성원 책임) 
3. 고객사(수요일까지 해준다고 함: 정재우 책임) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.03(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 18:00 

- IMK 차세대Prj
- MP 영업 DashBoard 개발 
1. 검색부 수정 
파트:cbo_partList, 담당자:cbo_userList, 분석사업장코드:edt_bycpBpList 
1) dsSearch 데이타 
<Rows/> 
<ColumnInfo> 
  <Column id="cpCd" type="STRING" size="256" sumtext="회사코드"/> 
  <Column id="respId" type="STRING" size="256" sumtext="담당ID"/> 
  <Column id="teamId" type="STRING" size="256" sumtext="팀ID"/> 
  <Column id="partId" type="STRING" size="256" sumtext="파트ID"/> 
  <Column id="userId" type="STRING" size="256" sumtext="담당자ID"/> 
  <Column id="workCd" type="STRING" size="256" sumtext="분석사업장코드"/> 
  <Column id="dtGb" type="STRING" size="256" sumtext="구분코드"/> 
  <Column id="todayYy" type="STRING" size="256" sumtext="현재년"/> 
  <Column id="todayMm" type="STRING" size="256" sumtext="현재월"/> 
</ColumnInfo> 
==============================================================================================================

- sapcallmp 분석(SAP ==> MP(JCO)) 
1. ImkJcoServerCM.java 
2. ImkJcoServerCallMP.java 
static class FunctionHandler implements JCoServerFunctionHandler { 
 public void handleRequest(JCoServerContext serverCtx, JCoFunction function) {  
  if(function.getName().equals("ZMM_SOURCE_LIST_RECV")) {  // 소스리스트 목록조회 
   ImkJcoServerPU imkCM = new ImkJcoServerPU(); 
   imkCM.zmm_source_list_recv(serverCtx, function); 
  } 
 } 
} 
3. ImkJcoServerPU.java 
public class ImkJcoServerPU { 
 public void zmm_source_list_recv(JCoServerContext serverCtx, JCoFunction function ) { 
  for(int i=0; i<inTable.getNumRows(); i++) { 
   SapCallMPSVO svo = null; 
   // Query를 위한 SVO 생성(품목코드, 고객사, 재고관리여부) 
   svo = new SapCallMPSVO(); 
   svo.setMatnr(inTable.getValue("MATNR").toString()); 

   // Query를 통한 결과값을 받아온다. 
   List<SapCallMPDVO> outList = new ArrayList<SapCallMPDVO>(); 
   outList = biz.getSourceListInfoList(svo); 

   for(int j=0; j<outList.size(); j++) { 
    outTable.appendRow(); 
    outTable.setValue("MATNR" , outList.get(j).getMatnr()); 
    outTable.setValue("KUNNR", outList.get(j).getKunnr()); 
   } 
   inTable.nextRow(); 
  } 
 } 
} 
4. SapCallMPBiz.java 
public class SapCallMPBiz { 
 @SuppressWarnings("unchecked") 
 public List<SapCallMPDVO> getSourceListInfoList(SapCallMPSVO svo) { 
  SapCallMPDQM dqm = new SapCallMPDQM(); 
  List<SapCallMPDVO> retList = new ArrayList<SapCallMPDVO>(); 
  retList = dqm.getSourceList(svo.toMap()); 
  return retList; 
 } 
} 
5. SapCallMPDQM.java 
public List getSourceList (final Map inputMap) { 
 StringBuffer sql = new StringBuffer(); 
 sql.append(" SELECT A.ITM_CD  AS MATNR, \n"); 
 sql.append("  FROM MITTG2110 WHERE  A.ITM_CD = :matnr \n"); 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.04(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50~ 18:00 

- IMK 차세대Prj
- MP 영업 DashBoard 개발 
1. 왼쪽 프레임 수정 
- 왼쪽 프레임 호출(/BYTDM03M.xfdl 파일에서) 
var cnt = application.mainframe.vFrameSet1.hFrameSet1.leftFrame.form.all.length; 
for (var i=0 ; i<cnt ; i++) { 
 trace(application.mainframe.vFrameSet1.hFrameSet1.leftFrame.form.all[i].name); 
} 
application.mainframe.vFrameSet1.hFrameSet1.leftFrame.form.div_LeftView.div_lf.div_workList.fn_Init(StrTodayYY, 
StrTodayMM); //Left MP Admin 호출 처리 
  
- 에러 내용 
uxs (4476): [/COMTRA.xfdl][fn_callback()] ==> [system.navigatorname]XPLATFORM[_callback]undefined[sId] 
getMpDashBoardList[nReason]0 
uxs (4476): e.message : [C:/workspace/imk_mall/lib/COMTRAN.xjs][line:248] undefined'은(는) 선언되지 않은 
식별자입니다. (행: 248) 
==============================================================================================================

--DASHBOARD통계 조회 @@@@@@@@@@@@ 
SELECT  A.IND_CD, A.IND_VAL_NUM, A.* 
FROM HCDTS1110 A 
WHERE A.IND_CD = '1011'  --지표코드 
--; 

--공통코드 조회 @@@@@@@@@@@@ 
SELECT * FROM CCMTC0100  C --HITTS2510 --> HITTG2110 
WHERE C.CD_LST_ID = 'HT098'  --코드목록ID 
--; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.05(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50~ 18:00  --> 주간보고서 작성 

- IMK 차세대Prj
- MP Hub DashBoard 고객사 화면 작성(완료) 
==============================================================================================================

- MP 영업 DashBoard 메인 URL 수정 
1. 이전 위치: /main/mpMainBY.xfdl ===> 수정 위치: /BY/TD/BYTDM03M.xfdl 
- MP Hub DashBoard 메인 URL 수정 
1. 이전 위치: /main/hbMainBlank.xfdl ===> 수정 위치: /HU/IT/HUITM03M.xfdl 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.06(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:30 기상 
06:50 조기축구(0:1 패) 
07:30 종료 
08:00 화정식당(남권이형 쏨): 정홍, 상설이형 
09:00 상설이형집(노트북 때문에 아들과 상설이형 싸움) 
10:30 영희형 가게(컴퓨터 A/S점): 자동차 A/S 사이트에 대해 사업 설명 청취 
11:20 보석 사우나(몸무게: 74.25kg) 
12:20 중식(자장면): 세계태권도연맹 비서실장(전자호구 소송 상담) 
13:30 교대부동산(법률 사무소 사무실 상담: 남권이형, 형수) 
14:30 서초역 근처 빌딩 구경(5층): 서울시 서초구 서초동 1719-3 태흥빌딩 202호 
16:00 종료 
17:00 귀가 
17:30 세탁기 도착(LG T1207W7 통돌이) 및 설치 
19:00 석식 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.07(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00  --> 비옴 

▦조기축구
05:50 기상 
06:40 예배(광림교회) ==> 설교(김정석 목사: 우리는 어찌하여...) 
08:30 종료 
09:20 조기축구(4:1 패) 
10:30 종료 
10:40 중식(류명국 설렁탕: 류명국 형님이 쏨): 상요형이 양복 사준다고 함(40만원 상당) 
        ==> 남권이형한테 신든 축구화 선물 받음 
11:30 종료 
12:00 남권이형집(기흥IC 근처: 용인시 기흥구 고매동 261-11) 
13:20 모란역(호성이형 합류) 
13:40 남한산성 근처 개울(남권이형 성남 자율 방법대 모임) 
15:30 종료 
17:00 할리스 커피점(인덕원역 => 경매 물건 상담: 남권이형, 호성이형) 
19:00 호프집(수원: 남권이형 고객 상담: 호프집 주인 아줌마) 
23:10 종료 
23:30 수원역(7770번 버스) 
24:10 사당역 
24:50 귀가(사당역에서 걸어서 귀가) 
01:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.08(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
==============================================================================================================

-차용증(남권이형) 
11:20 회사 출발(포스코 사거리 근처) 
11:25 국민은행(2천만원 수표로 발행) 
11:50 교대앞부동산(교대역 9번 출구): 남권이형, 형수 
12:00 사무실 구하기 
12:20 중식(남권이형 쏨) 
12:40 차용증 받음(남권이형, 형수 공동 보증: 2천만원 수표 전달) 
12:50 종료 
13:10 귀사 
13:30 천만원 추가 송금(우리은행: 1002-841-629902 예금주: 김미리(*)) 
       - 총 3천만원 대여 ==> 이자 매월(9일): 60만원 
       - 교대역공인중개사사무소(6424-3001) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.09(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 품목 수정 완료(공통 Table 적용) 
==============================================================================================================

- 프라임 예금 해지 처리(총 4천만원) 
1. 이자: 158,746원 
2. 제일은행 두드림통장에 예치(2천) 
3. 프라임 ==> 1회 이체 한도: 천만원, 1일 이체 한도: 2천만원 
4. 국민은행 ==> 1회 이체 한도: 천만원, 1일 이체 한도: 5천만원 
==============================================================================================================

- 사무장(중앙법률 사무교육원): http://www.linklaw.co.kr 
1) 소송실무 과정, 등기실무 과정(3개월 :총 98만원) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.10(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 공급사 수정 완료(공통 Table 적용) 
2. 공급사 Sub 수정 완료(실시간) 
3. 품목 Batch 수정 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.11(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 공급사 Batch 수정 완료 ==> DashBoard(Sub_Gus) 
1) build/com/imk/mall/batch/hu/cu/dashbatch/cfg/DashBoard001_CFG ODATE=20110706 
getSupDashBoardList  공급사 DASHBOARD 조회 
getSupDashBoardSubList 공급사 DASHBOARD Sub 조회 
==============================================================================================================

- 경매 도서 대여 3권(글빛 도서관) 
1. (초보를 프로로 만드는)만화 부동산 경매 
2. (세상에서 가장 쉬운)부동산 경매 
3. (박용석의)부동산 경매 첫걸음 : 개정 법률 반영 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.12(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  --> 주간보고서 작성 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 품목, 공급사 수정 완료 
2. 고객사 수정 
==============================================================================================================

- 현용, 임모 만남 
18:00 퇴근(비옴) 
18:30 삼성역 
18:40 강남역 
19:20 임모, 현용 
19:40 삼겹살집(현용 쏨)  ==> 경매 공부 하지 말라고 함, 현용이가 대구에서 학원 차리자고 함 
21:40 소주집(임모 쏨) 
19:40 맥주집(내가 쏨) 
23:30 종료 
24:10 귀가 
01:00 취침 
==============================================================================================================

- 공인중계사 자격증(경록(http://www.kyungrok.com)) 
1. 대한공경매사협회 T) 888-5704(낙성대역 2번 출구) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.13(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

[글빛 도서관] 

08:30 기상 
08:40 조식 
09:10 글빛 도서관 
09:20 경매 공부 
12:00 경매 도서 대여 
18:00 종료 
18:20 시장(다이소) 
19:00 석식(짬뽕밥) 
19:30 귀가 
24:00 취침 
==============================================================================================================

- 경매 도서 대여 4권(글빛 도서관) 
1. 나는 쇼핑보다 경매투자가 좋다. 
2. (부동산 경매)썩은 사과만 골라내면 큰 돈되는 권리분석 
3. 나는 경매로 월세 2천만 원 받는다 
4. 나는 경매로 연봉만큼 번다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.14(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00  --> 비옴 

▦조기축구
05:50 기상 
06:40 예배(광림교회) ==> 설교(김정석 목사: 다시는 종의 멍에를 메지 말라) 
08:30 종료 
09:20 조기축구(4:3 패) : 숏게임(비와서 많이 안 나옴) 
10:30 종료 
10:40 중식(문경세제: 오세민 고문님이 쏨) 
13:30 종료 
14:20 귀가 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.15(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00  --> 비옴, 광복절 

▦조기축구
06:30 기상 
07:10 조기축구(4:3 승) : 숏게임(1골, 1AS) 
09:30 종료 
10:10 중식(수정식당: 태호형이 쏨) 
11:30 종료 
12:20 귀가 
12:30 낮잠 
15:00 기상 
15:10 경매 무료 동영상 청취 
23:30 기상 
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.16(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 고객사 쿼리 요청 메일 발송 
2. 공급사 Batch 수정 완료(폴더 변경) 
hu/cu/supgusdashapp: MP Hub DashBoard(공급사, 고객사)   
SupGusDashBoardBiz.java, SupGusDashBoardSvc.java, SupGusDashBoardSvcImpl.java, SupGusDashBoardSVO.java 
SupGusDashBoardDQM.java, SupGusDashBoardDVO.java 
==============================================================================================================

- MP 영업 DashBoard 개발 
1.2. DQM 개발하기 
SupGusDashBoardDQM(공급사, 고객사 DASHBOARD) --> getSupGusDashBoardList(DASHBOARD 조회) 
1.3. SVO 생성하기 
SupGusDashBoardSVO(공급사, 고객사 DashBoard SVO) --> dashboardDVO(MP 영업 DashBoard DVO) 
1.4. SVC Interface 개발하기 
Source foler: imk_pjt/src/main/java 
Package: com.imk.mall.by.td.dashboardapp 
Name : SupGusDashBoardSvc 
1.5. SVC Impl 개발하기 
Name : SupGusDashBoardSvcImpl 
Super class: com.sds.anyframe.extension.basic.abstractlayer.AbstractService 
Choose interfaces: SupGusDashBoardSvc(Add(클릭) ==> 새창 뜸) 
1.6. SVC Impl 개발하기-Bean Name 추가하기 
@Service("by.td.dashboardapp.SupGusDashBoardSvcImpl") 
1.7. Biz Class 개발하기 
Name : SupGusDashBoardBiz 
Source foler: imk_pjt/src/main/java 
Package: com.imk.mall.hu.it.itdashapp 
Super class: com.sds.anyframe.extension.basic.abstractlayer.AbstractService 
Choose interfaces: SupGusDashBoardSvc(Add(클릭) ==> 새창 뜸) 
==============================================================================================================

- Batch 서버(control-M) 등록 요청 
1) DashBoard Hub Batch 
 가. 품목: /imk_batch_pjt/src/com/imk/mall/batch/hu/it/itdashbatch/cfg/ItDashBoard001_CFG.xml 
 나. 공급사: /imk_batch_pjt/src/com/imk/mall/batch/hu/cu/cfg/supgusdashbatch/cfg/DashBoard001_CFG.xml 
==============================================================================================================

- 개발,테스트] 서비스별 로그 
1. 88.1.117.21 ==> devuser/devuser 
dmroapp1:/appsys/sw/devuser> cd t_was_log  ====> 테스트 서버(현재 사용) 
dmroapp1:/appsys/sw/devuser> tail -f nohup.tmroapp1_MP1.out  ==> log_IMKTST 

dmroapp1:/appsys/sw/devuser> cd d_was_log  ====> 개발 서버 
dmroapp1:/appsys/sw/devuser> tail -f nohup.dmroapp1_MP1.out  ==> log_IMKDEV 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.17(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- IMK 차세대Prj
- MP Hub DashBoard 개발 
1. 테스트 서버에 적용 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.18(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 

- IMK 차세대Prj
- MP 영업 DashBoard 분석  
1. DashBoard MP 영업 메인 
 가. comMainLeftBy: Left MP Admin 영업 
 나. mpMainBY: DashBoard MP 영업 메인 ==> BYTDM03M(mpMainBlank에서 수정) 
 다. byMainBottom: Dashboard Bottom 
==> comMainLeftMBy.xfdl, mpMainBlank.xfdl 파일 수정, 테스트 서버 등록 요청 
  
2. 분석사업장 추가(cbo_bycpBpList) ==> 분석사업장(edt_bycpBpList) 
reqGetBycpBpList, fn_reqGetBycpBpList, dsBycpBpList 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.19(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 --> 주간보고서 작성 

- IMK 차세대Prj
- MP 영업 DashBoard 분석 
1. 회사 추가, 분석사업장 변경(cbo_bycpBpList) 
1) 고객(HCUTG1110) 
2) 조직체계(HCUTG1260) 
3) 조직(HCUTG1130): SAP_BIZ_ORG_CD(SAP영업조직코드),  SAP_PCH_ORG_CD(SAP구매조직코드) 

[HT075] ==> 01 총괄, 02 본부, 03 사업부, 04 팀, 05 그룹, 06 실, 07 파트 
==============================================================================================================

- JCO 호출 샘플 
com.imk.mall.hu.cu.spcpbaccapp.SpcpBaccIfBiz  --> getBaccValidStatus() 
==============================================================================================================

- 등산 가방(50리터, 17.6인치 이상), 당구, 식당(깍둑고기) 
- 경매: 사이트 링크, 개인 자산 평가 
- 분석, 설계 학원: IT학원 분석 설계, 삼성멀티캠퍼스 
==============================================================================================================

- 한국 경.공매 교육협회 
1. 실전전문가과정(2개월) ==> 목 19:30 ~ 21:30, 수강료: 33만원 
2. T)2675-2580, 주소: 서울 영등포구 문래동1가 96-4 한양빌딩 1층(신도림역 1번 출구) 
==============================================================================================================

- 서울당구아카데미: http://www.sbaschool.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.20(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
08:30 기상 
10:00 토요일만원경매특강1(상황별 명도 대처법: 주철호 감사): http://cafe448.daum.net 
11:50 종료 
12:00 귀가 
12:10 중식 
13:00 중식 
19:00 채팅 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.21(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
06:00 기상 
06:55 예배(광림교회) ==> 설교(김정석 목사: 약속받은 자의 믿음) 
08:30 종료 
08:50 조기축구(6:5 패): 한상봉 감사가 회장단에 한소리해서 분란이 일어남 
10:30 종료 
10:40 중식(문경세제: 세창이형이 쏨) 
12:30 식당(삽겹살: 영민이형이 쏨) 
15:20 귀가 
23:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.22(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 --> 남권이형 사무실 오픈 

- IMK 차세대Prj
- MP 영업 DashBoard 분석 
1. 회사 추가, 분석사업장 변경(cbo_bycpBpList) 
1) 고객(HCUTG1110) 
2) 조직체계(HCUTG1260) 
3) 조직(HCUTG1130): SAP_BIZ_ORG_CD(SAP영업조직코드),  SAP_PCH_ORG_CD(SAP구매조직코드) 
[HT075] ==> 01 총괄, 02 본부, 03 사업부, 04 팀, 05 그룹, 06 실, 07 파트 
--------------------------------------------------------------------------------------------------------- 

- HUCUM20M(공급사 계좌 관리) 
MSCMTEST(reqGetSearchList)  ==> MpCallRulesSvcImpl(swcall.mpcallrules.MpCallRulesSvcImpl) 
==============================================================================================================

- SAP JCO 연결 환경설정(Windows환경기준) 
1. sapjco3.dll, sapjco3.jar 설치 파일 복사   
- 파일서버\90. WorkPlace\00. 개발환경세팅\08. sap call mp\sap jco 서버 프로그램 예제\sapjco3-NTintel-3.0.6에서 
sapjco3.dll, sapjco3.jar을 C:\WORKSPACE\imk_pjt\webapps\WEB-INF\lib\밑으로 복사한다.  
2. 웹로직 설정 파일에 path 추가 
C:\Oracle\Middleware\imk_pjt\domains\mpdomain\bin\stopWebLogic.cmd 파일에서 
set CLASSPATH=%CLASSPATH%;C:\workspace\imk_pjt\webapps\WEB-INF\lib\sapjco3.jar ==> 추가 
3. web.xml SVN으로 내려받음 ==> 사용 안함 
- 현재 리스너가 등록되어 있지 않은 상태로 추후 등록할 예정입니다. 웹로직 서버에 오류가 발생할 소지가 있습니다. 
- 파일서버 \90. WorkPlace\00. 개발환경세팅\08. sap call mp\테스트 소스 \web.xml 을  
C:\workspace\imk_pjt\webapps\WEB-INF에 복사하여 사용합니다 
- 로컬 서버(웹로직)을 다시 시작하면 리스너가 떠 있는 상태로 sap 에서 MP를 호출이 가능 
http://122.1.20.30:8899/projects/DevGuide/wiki/sap_call_mp 
==============================================================================================================

- Weblogic Hot Deploy시 Perm Gen Error 발생 지연 방법(http://122.1.20.30:8899/projects/DevGuide/wiki/autodeploy) 
C:\Oracle\Middleware\imk_pjt\domains\mpdomain\bin\setDomainEnv.cmd 파일 수정 
161 Line: set WLS_MEM_ARGS_32BIT=-Xms512m -Xmx512m  
179 Line: set MEM_PERM_SIZE_32BIT=-XX:PermSize=512m  
189 Line: set MEM_MAX_PERM_SIZE_32BIT=-XX:MaxPermSize=512m  
199 Line: set MEM_DEV_ARGS=-XX:CompileThreshold=8000 -XX:+CMSClassUnloadingEnabled %MEM_PERM_SIZE%  
설명: 
최소 메모리, 최대 메모리 512m로 조정 
Perm Gen 영역 - Class 정보가 로딩되는 영역 - 사이즈 조정 
Perm Gen 영역 클래스 언로딩(GC) 옵션 추가  
==============================================================================================================

- MP 영업 반품, 교환 인수인계 
1. 인계자: 노진우 대리 
==============================================================================================================

- 경매 온라인 동영상 강의 등록 
1. 과정명: 부동산 경공매(온라인)종합반5기, 기간: 08-23 ~10-24(http://www.wowfa.co.kr) 
2. 한국부동산 칼리지 T)582-6673, 주소: 서울시  서초구 서초동 165-803(현우B/D 4F) 
3. 온라인 강의(한국부동산 칼리지): 60,000원(2달: 8.18(화) ~ 10.33) 
4. 경매의 비밀(교재): 9,800원 
- 안출지(20만원): 지수 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.23(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 22:30  --> 자리 옮김, 계약 연장 요청(정재우 책임), 야근(포시즌) 

- IMK 차세대Prj
- MP 영업 DashBoard 개발 
1. JCO 연결 성공(MP <-> SAP) ==> DashBoardIfBiz.java 
==============================================================================================================

- 반품교환 개발 
- AS-IS 시스템 접속정보 
1. MP 테스트 계정 http://88.1.17.136:7099/(Stage 서버 = 품질서버)  
MP: 050028/q1w2e3r4, Buyer: HANWHA/q1w2e3r4, 1N080B/q1w2e3r4, YD001/q1w2e3r4, HANWHA_K/q1w2e3r4 
===> Order관리 > 납품관리 > 반품교환관리 
2. 바이어로 접속: http://88.1.17.136:7099/Login.Servlet?cmd=ByLogin&id=HEQRW9FLED 
Supplier: 1731/q1w2e3r4 (58245824), 3AVE/q1w2e3r4, V13388/q1w2e3r4, V13320/q1w2e3r4 
주문/배송현황 ==> 주문배송현황, 반품교환처리현황 
3. DTI: http://dti.imarketkorea.com ==> 000018/12qwaszx 
4. DDS: http://dti.imarketkorea.com/dds/index.jsp ==> 000018/12qwaszx 
5. e-Basics: http://efirst.imarketkorea.com/supplier_main.jsp    
MP: champ03/q1w2e3, SP: test458/q1w2e3, BY: ONEMORE/58245824 
6. eGlocal:http://global.imarketkorea.com 
MP: 100001/asd869696, 
SP: JISUKE/58245824 
BY: BY100001/asd869696 
5. DB접속정보: 88.1.17.136 1529 ==> mroop/xpdl!89d 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.24(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30  --> 무상급식 주민투표(오세훈 시장 패배), 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. AS-IS 분석 
1) 주문배송현황http://88.1.17.136:7099/ordertracking/byordtrk.jsp  
2) 반품 요청: http://88.1.17.136:7099/returnexchange/by_snrereq_p.jsp?sn_no=5204490156&po_no=2015283937&po_seq=000020 
/returnexchange/servlet/BysnexreqServlet.java  ==> reqCreateGRDoc(GRProcessInfo grpinfo, String gr_reason); //입고 문서 생성 
/logistics/session/LogisticsManagerEJB.java  ==> rreqCreateGRCancelDoc(reqinfo.gr_no, reqinfo.req_qty, "RE",  
reqinfo.req_reason, reqinfo.req_user_id, reqinfo.req_user_name); //반품 입고취소 

- 반품 요청 저장시 등록 TB(AS-IS) 
1. 반품 요청문서 생성(LogisticsManagerEJB) ==> TREAST(반품/교환): I, LREAST(History): I, TDOAST(운송지시 Main): I 
2. 반품 입고취소(LogisticsManagerBean) ==> TGRAST(입고 Main): I, TGRBST(입고 vs 납품 Mapping): I 
- 반품 요청 저장시 등록 TB(TO-BE) 
1. TORTG2230(주문클레임): I, TORTH2231(주문클레임변경이력): I, TORTH2233(주문클레임상태): I 
2. 반품 입고취소 ==> TORTG0320(고객입고): I, TORTH0321(고객입고변경이력): I, TORTG0350(입고BOM구성): I, TORTH0351(입고BOM구성변경이력): I 

- 교환 요청 저장시 등록 TB(AS-IS) 
1. 교환 요청문서 생성(LogisticsManagerEJB) ==> TREAST(반품/교환): I, LREAST(History): I, TDOAST(운송지시 Main): I 
- 교환 요청 저장시 등록 TB(TO-BE) 
1. TORTG2230(주문클레임): I, TORTH2231(주문클레임변경이력): I, TORTH2233(주문클레임상태): I 

- 취소 요청 저장시 등록 TB(AS-IS) 
1. 교환 요청문서 생성(ReturnManagerEJB) ==> TREAST(반품/교환): U, LREAST(History): U, TDOAST(운송지시 Main): U 
- 취소 요청 저장시 등록 TB(TO-BE) 
1. TORTG2230(주문클레임): U, TORTH2231(주문클레임변경이력): U, TORTH2233(주문클레임상태): U 
==============================================================================================================

- 교환반품 분석(TO-BE) 
1. 로그인 
2. 주문배송 > 주문배송현황(BYOMB31M) ==> 윤혜용(Z0232426) 
2. 자재관리 > 입고처리현황(BYMCB01M) ==> 이기동(Z0096067): 입고취소 > 입고취소사유등록(BYMCB05P) 
 > 반품요청 POP(BYERB02P): reqExeRetrun ==> by.er.exchangreturnapp.ExchangReturnImpl 
3. 주문관리 > 주문관리 > 유형별주문현황(BYOMM11M): 상태(운송완료) > 주문배송현황 상세조회: 반품요청 
==============================================================================================================

- Tomcat v7.0 설치 및 서버 추가 
1. HTTP/1.1 Port Number: 7001, Timeout: 300초 
2. 확인(mall 폴더 디버깅 폴더가 자동 생성(by, hu...) 해야 함) 
C:\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp1\wtpwebapps\imk_pjt\WEB-INF\classes\com\imk\mall 
==============================================================================================================

- 노트북 
1. 애플 MacBook Air(13형): http://store.apple.com/kr/configure/MC966KH/A?select=select&product=MC966KH%2FA&mco=MjMzOTUxNDI 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.25(목) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:20 ~ 21:30  --> 감리사시험 발표(불합격: 67), 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품 요청 저장시 등록 TB(AS-IS) 
1. 반품/교환 요청문서 생성(LogisticsManagerEJB) ==> TREAST: 반품/교환, LREAST: History, TDOAST: 운송지시 Main 
2. 반품 입고취소(LogisticsManagerBean) ==> TGRAST: 입고 Main, TGRBST: 입고 vs 납품 Mapping 
------------------------------------------------------------------------------------------------------ 

- 반품 요청 저장시 등록 TB(TO-BE) 
1. TORTG2230: 주문클레임, TORTH2231: 주문클레임변경이력, TORTH2233: 주문클레임상태 
2. 반품 입고취소 ==> TORTG0320: 고객입고, TORTH0321: 고객입고변경이력, 
TORTG0350: 입고BOM구성, TORTH0351: 입고BOM구성변경이력 

공통 ==> TORTG2110: 주문품목, TORTG2520: 주문품목부가정보, TLOTG2110: 납품반송품목계획,  
TLOTG3110: 운송지시, TLOTG3120: 운송지시품목 
==============================================================================================================

- 반품 요청 저장시 등록 TB(TO-BE) 
1. 반품교환처리현황(BYERB01M): reqGetClmList ==> by.er.clmapp.ClmProcessSvcImpl 
==============================================================================================================

- 2011년 정보시스템감리사 필기시험 결과 
1. 감리및사업관리(9), 소프트웨어공학(17), 데이터베이스(16), 시스템구조(916), 보안(9) ==> 67(89점) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.26(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30  --> 주간보고서 작성, 자리이동(에어컨 바로 위), 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환처리현황 조회 수정 
ex) 주문배송현황(BYOMB31M) --> 주문진행현황(BYOMB32P) 
==============================================================================================================

- 서버 설정 변경(default_typedef.xml 파일에서) 
imk_mall: http://localhost:7001/imk_pjt --> http://88.1.117.23/index.html 
==============================================================================================================

- 날짜 세팅 
div_condition.cal_fromOrdClmStuChgRegYmd.value = getDate(getMonthAfter(gfn_Today(), -3, "D"), 1); //날짜1 초기 세팅(과거 2달전 1일) 
div_condition.cal_fromOrdClmStuChgRegYmd.value = getFirstDate(gfn_Today());  //날짜1 초기 세팅 
div_condition.cal_fromOrdClmStuChgRegYmd.value = getLastMonth(gfn_Today())); //지난 달  
==============================================================================================================

- 등록 
1. 메뉴등록 
SELECT * FROM CUSTG0020 WHERE MU_KOR_NM LIKE '반품교환%' 
2. 화면등록 
SELECT * FROM CUSTG0030 WHERE MU_KOR_NM LIKE '반품교환%' 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.27(토) 작업 ■■■■■■■■■■■■■■■■
 ---> 08:40 ~ 21:30  --> 조기축구(2:1 승), 토요근무 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환처리현황 조회 수정 
ex) 주문배송현황(BYOMB31M) --> 주문진행현황(BYOMB32P) 
==============================================================================================================

- 날짜 타입 변경 
var strOrdClmStuChgRegYmd = dsRtnExList.getColumn(0,"ordClmStuChgRegYmd").substr(0,4)  
+"-"+ dsRtnExList.getColumn(0,"ordClmStuChgRegYmd").substr(4,2) +"-"+ dsRtnExList.getColumn(0,"ordClmStuChgRegYmd").substr(6,2); 
/* 반품교환요청일자 */     
==============================================================================================================

--주문관계자 정보  조회 @@@@@@@@@@@@@@ 
SELECT * 
FROM TORTG2200  
WHERE ORD_PS_ROL_CD = 'B2'  
    AND ORD_ITM_ID = '2000000383'   --Z0137425(홍승권 --> 류형선) 
--; 
==============================================================================================================

- 반품교환관리(BYERM18M) 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.28(일) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 

▦조기축구
05:50 기상 
06:40 예배(광림교회) ==> 설교(김선도 감독: 내가 그리는 크리스챤의 자아상) 
08:30 종료 
08:40 조기축구(5:1 승): 헤드트릭 기록 
10:30 종료 
10:40 중식(신의주 순대국: 오세림 고문님이 쏨) 
11:30 종료 
12:20 미니스탑(편의점: 상요형, 승렬이형) 
13:20 BBQ(춘집 고민님이 쏨) 
15:00 종료(택시: 승렬이형이 쏨) 
15:30 귀가 
16:00 글빛도서관(경매책 4권 반납) 
17:30 귀가 
00:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.29(월) 작업 ■■■■■■■■■■■■■■■■
 ---> 07:40 ~ 22:10  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품교환관리(BYERM18M) 수정 
 1) 물류유형(TRNS_TP_CD) 추가 
 2) 품명, 규격 필드 수정 
 3) 날짜정보가 없으면 ___-__-__ 가 보이지 않도록 처리 ==> expr:fn_dateMask(trnsCmplYmd) 
 99) 참고: 사은품 입하요청현황(BYOMM45M) 수정   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.30(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 반품요청 POP(BYERB02P) 수정 
 1) 반품가능수량(rtnPosQty): 미입고수량 - 반품수량 ==> expr:toNumber(grClsQty) - toNumber(rtnQty)  
==============================================================================================================

- 주문관리 > 주문관리 > 유형별주문현황(BYOMM11M): 상태(운송완료) > 주문배송현황 상세조회: 반품요청 
==============================================================================================================

- 리큐뷰 페이지 등록 
122.1.23.153, imk/qwe123, 88.1.117.21/rqreport 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2011.08.31(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30  --> 야근(포시즌) 

- IMK 차세대Prj
- 반품교환 개발 
1. 교환요청 POP(BYERB03P) 수정 
 1) 반품가능수량(rtnPosQty) 
수량 기반품수량 교환가능수량 교환요청수량 
미입고 dlvrQty(운송수량) - byGrQty(운송수량) grBefRtnQty dlvrQty - byGrQty - grBefRtnQty regQty 
입고 byGrQty grBefRtnQty byGrQty - grAftRtnQty regQty1  
---------------------------------------------------------------------------------------------------------- 

2. AS-IS 분석 
1) 반품, 교환 요청 POP 분석 및 통합 방안 
2) 취소 POP(주문/배송현황 > 반품교환처리현황) 
==============================================================================================================

- 구매 반품교환 처리 
1. 반품교환관리(PUDMS90M) ==> 반품교환요청 POP(PUDMM91P), 반품요청 팝업(PUDMMG2P) 
exeRntexMgtPopupList  ==>  pu.dm.rtnexapp.RtnexMgtSvcImpl 
==============================================================================================================

- UX log 확인 Dir 
1. C:\Documents and Settings\TAMA2\Local Settings\Application Data\TOBESOFT\XPLATFORM\9.1\ 
XPLATFORM_fileCworkspaceimk_mallimk_mall_mpxadl.log 
==============================================================================================================

- 삼성SDS E-campus 
1. http://sds.e-campus.co.kr/index.do ==> jaewoo7/ok11okok(정재우 책임) 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■