

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.04.01(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 20:00 

- 쇼핑몰 수정
- 임포트 실행(SQL GATE에서): 나이스 신용카드 크로스 체크 
도구(T) -> 임포트(I) -> 
Import Wizard 에서 
테이블 선택: T_TEMP_NICE_CARD(나이스_신용카드_템프) 선택 클릭 -> Import 시작 ->  
Import data Wizard 에서 
Import From: MS excel 
Source File Name: 2005_02(L&B).xls 선택 
Next(엑셀 포맷이 안 맞으면 안 넘어 감) ->  
Fields: SEQ_NO - A칼럼 선택 
Fields: ORDER_DT - E칼럼 선택 
Fields: ORDER_NO_FULL - J칼럼 선택 
Fields: AMT - G칼럼 선택 
Next -> Base formats 
Next -> Execute -> OK 
==============================================================================================================

-- 나이스_신용카드_템프 조회  @@@@@ 
SELECT * FROM T_TEMP_NICE_CARD; 
------------------------------------------  COMMIT 

-- 나이스_신용카드_템프 삭제  @@@@@ 
DELETE T_TEMP_NICE_CARD; 
------------------------------------------------------------------------------------ 

-- 나이스_신용카드_템프 조회 @@@@@@@@@@@@@ 
SELECT A.ORDER_NO_FULL, B.ORDER_STS, A.AMT AS 금액, 
       B.ORDER_DT, B.ORDER_NO, 
       B.RECEIVER_NM AS 수령자명 
FROM T_TEMP_NICE_CARD A, T_ORDER B 
WHERE A.ORDER_NO_FULL = B.COMPANY_CD  B.MERCHANT_CD  B.ORDER_DT  B.ORDER_NO     --주문번호FULL 
  AND B.ORDER_DT >= '20050101' 
  AND B.ORDER_STS = '00'      --주문상태(00:카드승인오류) 
ORDER BY B.ORDER_DT DESC 
; 
==============================================================================================================

-- 200503 결제 에러 발생 데이타 
-- L&B: 2,351건 
0100012005033100866(samsungcard), 0100012005030900546(samsungcard), 0100012005030700088(HDcard), 0100012005030700745(samsungcard) 
-- R&F: 1,256건 
0100012005033100685(LOTTE_Gucard), 0100012005031000366(YAEWHANcard), 010001 2005030700535(samsungcard) 
-- LG직거래: 1,408건 
010001 2005033100473(LGcard), 01000120050306 00315(LGcard), 0100012005030400012(LGcard) 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- ISP UI 변경 
결제정보("/order/arInputS.jsp)에서 2개 필드 추가  
<input type=hidden name= KVP_OACERT_INF value="NONE"> 
<input type=hidden name= KVP_CARD_PREFIX value="">  
==============================================================================================================

메인 DB ===> 211.233.5.110   SID: IIISHOP IIISHOP/IIISHOP 
TEST DB ===> 211.233.5.110   SID: I3SHOP I3SHOP/I3SHOP  
--211.233.5.110   SID: OraHome92  IIIshop/i3shop  
==============================================================================================================

- 협력업체 팝업 수정 
사업자등록증 변경 안내(popup_20050401.html) 
http://support.i3shop.com 
==============================================================================================================

- [정수기 수정] 
배송일자만.........배송일자..........설치일자 
처리일자 
A/S 주문자 미확인  
배송일자만......설치요청. ..................... 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.02(토) 작업 ■■■■■■■■■■■■■■■■
---> 7:20 ~ 13:00 

- 쇼핑몰 수정
- 비즈메카 로그인 에러 
휘레쉬 에러로 추정 
==============================================================================================================

- SMS전송 에러 
150건 넘으면 전송 실패(통합) 
개인PC에서 전송 가능  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.04(월) 작업 ■■■■■■■■■■■■■■■■
---> 7:20 ~ 20:00 

- 쇼핑몰 수정
- 응급복구 파일 만들기(파일 손상) 
프로그램 - 보조프로그램 - 시스템 도구 - 백업 
A 드라이브 설치 
==============================================================================================================

- 모빌리언스(www.mobilians.co.kr) 최재혁 과장(*@*.*) 
T) 02-2192-2057 H) * 
임영식 주임(*@*.*) T) 02-2192-2163 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.06(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 7:20 ~ 20:00

04.06(수) ~ 07(목): 년차  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.08(금) 작업 ■■■■■■■■■■■■■■■■
---> 8:00 ~ 20:00 

- 쇼핑몰 수정
- 프로그램 설치 
A: 드라이브 추가(응급복구 파일 만들기) 
프로그램 - 보조프로그램 - 시스템 도구 - 백업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.11(월) 작업 ■■■■■■■■■■■■■■■■
---> 8:10 ~ 20:00 

- 쇼핑몰 수정
- Eclipse 설정(통합, 쇼핑몰, 협력업체) 
하드 C(40GB),  D(80GB) 분리 
오라클 설치(C: 드라이브) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.12(화) 작업 ■■■■■■■■■■■■■■■■
---> 7:30 ~ 23:00 

- 쇼핑몰 수정
- Eclipse 설정(통합, 쇼핑몰, 협력업체) 완료 
==============================================================================================================

- 신용카드 결제 오류(승인 데이타 미존재) 
0100012005040900232: LG카드 결제 오류 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.13(수) 작업 ■■■■■■■■■■■■■■■■
---> 7:40 ~ 23:00 

- 쇼핑몰 수정
- 쇼핑몰 팝업 올리기 방법 문서화 
==============================================================================================================

- 게이트웨이 이관(Package 등록, 크론잡 생성) 
==============================================================================================================

- 테스트DB 
211.233.5.110 SID: I3SHOP iiishop/i3shop 
- 실DB 
211.233.5.110 SID: IIISHOP iiishop/iiishop 
==============================================================================================================

- 신용카드용 인증서 발급(무료) 
http://www.yessign.or.kr/card/ 
유효기간(20060412) 
==============================================================================================================
  
640210052309 
번호: 9410 4683 9841 8016 08/07 

팝업창 띄웠습니다. 
B2B > 생활서비스 > 헤어서비스 
수정파일 : display\main\b2b\l_hair.jsp 
==============================================================================================================

- 안심클릭 신용카드 팝업 에러 
정영미 051-305-0868 -> 방금 말씀드린분이에요. 
통화하시고 저한테 메모부탁드려요 
------------------------------------------------------------------------------------ 

- 안심클릭 신용카드 팝업 에러 대처 방법 
원인: 2005년 초에 나이스에서 안심클릭 업데이트를 하면서 창이 띄면서 보안 점검 하는데  
이때 반드시 예(Y) 체크 해야만 안심클릭 창이 띄게 됨 
대처: 
1. OS가 XP Home Editon 이면 
브라이저(IE6.0) -> 도구(T) -> 팝업차단(P) -> 팝업차단 설정 안 함으로 설정 
2. 기타 OS 이면 
주문할 때 안심클릭 체크 후 다음을 누르면 창이 띄면서 보안 점검 체크 여부를 물으면 
반드시 예(Y) 체크를 한다. 
==============================================================================================================

- 공인인증서 오류 
최해임 (lgweb1) ---> 공인 인증을 발급받을려고 하니깐,  이메일 주소가 없다. 
==============================================================================================================

- Eclipse 에러 
가우스 에러 ===> SMS전송 데이타 결과 조회(/BizMgr/SMSMgr/smsResultListP.jsp) 
[DSET-50012]데이타 다운로드 중 오류가 발생 
-------------------------------------------------------------------------------------------------------------------------------

콤보박스 에러 ===> 제한수량 상품 등록/BizMgr/ItemMgr/LimitCount/buyLimitItemP.jsp) 
java.lang.NullPointerException 
at /BizMgr/ItemMgr/LimitCount/selectTimesPopB.jsp._jspService(/BizMgr/ItemMgr/LimitCount/selectTimesPopB.jsp.java:582) (JSP page line 5) 
at com.orionserver[Orion/2.0 (build 11018)].http.OrionHttpJspPage.service(.:68) 
-------------------------------------------------------------------------------------------------------------------------------

for(Iterator it = ((Vector)codeHash.get("data")).iterator(); it.hasNext(); ) {  
Hashtable row = (Hashtable)it.next(); 
} 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2005.04.14(목) 작업 ■■■■■■■■■■■■■■■■
---> 8:20 ~ 19:00 

- 쇼핑몰 수정
- 신용카드 결제 오류(승인 데이타 미존재) 
0100012005041300124: LG카드 결제 오류(L&B) 
==============================================================================================================

- 공인인증서 오류(갱신 오류) 
이선옥(jua33306) *-2231628  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.15(금) 작업 ■■■■■■■■■■■■■■■■
---> 8:30 ~ 23:00 

- 쇼핑몰 수정
- 신용카드 결제 오류(승인 데이타 미존재) 
0100012005041400316: LG카드 결제 오류(L&B) 
0100012005041400286: LG카드 결제 오류(R&F) 
==============================================================================================================

- 통합 수정
- SMS전송(게이트웨이 설치 이벤트) 
엑셀 -> Oracle DB 전환 후 전송(엑셀 전환_VB 프로그램 개발) 
------------------------------------------------------------------------------------ 

- 엑셀 -> Oracle DB 전환 
네이버나 구글에서 sqlldr 이라 쳐도 자료가 많이 나온다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.16(토) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00(격주 휴일) 

- 쇼핑몰 수정
- 장바구니 저장 흐름도 

1. 노블레스 매장(S065) 체크 
2. 수당상품구분(L&B상품, R&F상품) 체크 
==============================================================================================================

- 정수기 이상(A/S주문->필터교환권(교환비용)) 
주문번호: 0100012004020600205 
00142161: 필터교환권(교환비용), 00137113: 52in 산소수기  
==============================================================================================================

-호스팅 업체(daegudiplays.co.kr) 
http://www.netsvill.net/ 
http://www.wafertop.com/infor/silicon.asp 
http://www.adsdyes.com/index.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.18(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 

- 쇼핑몰 수정
- 신용카드 결제 오류(승인 데이타 미존재) 
0100012005041500272: LG카드 결제 오류(L&B) 
==============================================================================================================

* 성명: 전희정 (id:82gaja22 /*주민번호: 640627-20) 
* 카드번호: 4404-4644-6289-1005   시티비자카드 (전희정) 
051-469-1395 
------------------------------------------------------------------------------------------------------------- 

- 이형철    mirzzang26    Management-M 
국민카드가  결재가 안된다고 하심 -- 국민카드 전체가..ㅡㅡ;;  
isp도 등록했다고하시며.. 결재창이 안뜬다고하심  
센터 컴퓨터에 문제가 있는지 아니면.. 우리쪽 서버 문제인지 전산팀 무작정 연결 요청하심   
연락처 :  *  이형철   
==============================================================================================================

http://www.j2eestudy.co.kr/lecture/lecture_read.jsp?table=j2ee&db=lecture0201_1&id=22 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.19(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 21:30 

- 쇼핑몰 수정
- 장바구니 수정 
장바구니 저장 흐름도 작성 
가격, PV, VB 변경(cartSelectDB_P.jsp) 조회에서 JOIN 
==============================================================================================================

- 아이디, 패스워드 찾기(/customer/findPasswdfP.jsp) 
www.i3shop.co.kr 페이지에 "아이디, 패스워드 찾기" 버튼 
index_noble.jsp 에 주석으로 처리해 두었습니다.  
==============================================================================================================

- nicepg.properties 에서 설정(i3shop.war\WEB-INF\classes) 
#################################################### 
## 
## Log_File 경로 설정 
#################################################### 
## 
## LOG_PATH = Logfile directory 
## 
#LOG_PATH = /usr/local/jakarta-tomcat-4.1.12/logs/nicepg 
LOG_PATH =/home/i3shop/nicepg/log 
#\\211.233.5.108\i3shop\nicepg\log 
################################################### 
==============================================================================================================

- SID 삭제 
WINDOWS 서버에서는 ODCA(Oracle Database Administration Assistant)로  
기존 SID 를 삭제 해주세요.. 
그러면 간단히 삭제가 되고 나중에 물리적인 데이터 화일 
 로그 화일 및 INIT(PARAMETER FILE) 을 삭제 해 주시고  
 다시 ODCA 로 재 생성해 보세요.... 그러면 될겁니다  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.20(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 

- 쇼핑몰 수정
- 장바구니 조회 쿼리 수정 
기존 가격 가져 오기(T_CART, T_ITEM 조인) 
- 기준 가격 관리(/BizMgr/SaleMgr/SalePriceMgr/itemSellPriceP.jsp) 
구매가(BUYING_PRICE), 일반판매가(SALE_PRICE), 리셀러가(RESELLER_PRICE), BV, PV 
==============================================================================================================

- 신용카드 로그(NICE) 
/opt/payment/nice/log 
==============================================================================================================

- SMS전송(게이트웨이 설치 이벤트) 
1차 842건 재전송 
2차 223건 전송 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.21(목) 작업 ■■■■■■■■■■■■■■■■
---> 7:20~ 19:30 

- 쇼핑몰 수정
- 장바구니 수정 
1. 판매상태구분(SALE_STS_CL) ==> (03:INACTIVE,  05:DELETE) 
2. 한정판매여부Y 이고 한정판매수량 0 
3. 카테고리 사용여부(Y),  
4. 적용일자 완료일자  
==============================================================================================================

메인 DB ===> 211.233.5.110   SID: IIISHOP IIISHOP/IIISHOP 
TEST DB ===> 211.233.5.110   SID: I3SHOP I3SHOP/I3SHOP  
TEST DB ===> 211.233.5.110   SID: I3SHOP IIIshop/i3shop     ---> 사용 자제  
--211.233.5.110   SID: OraHome92  IIIshop/i3shop 
==============================================================================================================

-  팝업 
/popup/popup_20050421.html 
위치: L&B매장 "출산/유아/아동" 매장에서만 뜨도록 해주세요!  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.22(금) 작업 ■■■■■■■■■■■■■■■■
---> 7:40~ 20:30 

- 통합 수정
- SMS 전송 오류 수정 
WAS에서 배송 시작 SMS 922건 전송 
SMS 전송(/BizMgr/SMSMgr//smsSend.jsp) 

Thread.sleep(1000); // 1초 쉰후 프로세스 진행(1~2초가 적당) 
------------------------------------------------------------------------------------------------------------ 

Remote Method 호출 에러입니다. 
java.rmi.ServerException: RemoteException occurred in server thread; nested exception is:  
[에러코드] : 71E 
[에러메세지] : 시스템 에러입니다. 
관리자에게 문의하십시요. 
------------------------------------------------------------------------------------------------------------ 

- 이용통계 페이지 
https://mcash.mobilians.co.kr/smsgw/ i3shop/757913 

- 모빌리언스(www.mobilians.co.kr) 최재혁 과장(*@*.*) 
T) 02-2192-2057 H) * 
임영식 주임(*@*.*) T) 02-2192-2163 -2053 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.25(월) 작업 ■■■■■■■■■■■■■■■■
---> 7:40~ 19:00 

- 쇼핑몰 수정
- 신입사원교육 자료(쇼핑몰) 
==============================================================================================================

- 신용카드 로그(NICE) 
이중거래(0204): 주문번호(0100012005041500551) 
고객이 결제 승인을 누른 후 속도가 기타 이유로 해서 2번 결제 확인을 클릭 했을 때 발생 
1번째 인증서 값은 정상적으로 승인되고 2번째 인증서 값은 이중거래로 승인 오류가 됨 
==============================================================================================================

- [전산실 회식]
- 19:00 식당(배대리, 여직원)  
- 24:00 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.26(화) 작업 ■■■■■■■■■■■■■■■■
---> 7:40~ 21:30 

- 통합 수정
- SMS전송(게이트웨이 설치 이벤트) 
3차 185건 전송  
==============================================================================================================

- SMS에서 
McashSmsgwEA 에서 socket 응답을 받기 전에 루프를 돌면서 데이타가 쌓이는 것으로 판단  
에러 내용:  
[05-04-26   9:27:55:929 KST] 36c39c4d HttpTransport X server socket accept failure: 열린 파일이 너무 많음 
대책: Thread 생성 
------------------------------------------------------------------------------------------------------------- 

AckParam ap = mm.McashSmsgwEA(  ID, PWD, Title, 
     Key_no, SendPhoneNo, RecvPhoneNo, 
     SmsMsg, Remark, ResultCd 
  ); 
   
Thread.sleep(2000);	// 2초 쉰후 프로세스 진행(2초가 적당) 
==============================================================================================================

- 쇼핑몰 수정
- 반신욕기 수정(/order/orderPutP_1.jsp) 
==============================================================================================================

- (K)쿠쿠 고급형 압력밥솥(10인용) CRP-C1090FI 
145,000원(킬러앱 가격), 168,000 원(쿠구 본사 가격) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.27(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 통합 수정
- 정수기 필터 이관 자료 출력 
==============================================================================================================

- DB_CALENAR 테이블  
2005년 04월 01일 까지 ==> 총 2,542건 
==============================================================================================================

- 자이언트 (3인용) 소파(i3shop)  ==> 351,000원 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T04090102&p_item_cd=00149087&p_display_cd=01 

- [코시트]아이모스 고품격 인조가죽 소파(3인용)(삼성몰)  ==> 287,200원 
http://www.samsungmall.co.kr/catalog/general/detail.jsp?disp_class_cd=0902&goods_cd=410306160005&urlpath=0@0902@A01@C01@C01@F01 
==============================================================================================================

- 맥 조기회 모임
- 19:00 남대구 우체국(교대역 2번 출구) 
- 19:30 횟집(밤고개) 
- 22:00 곱창집 
- 24:00 귀가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.28(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 22:00 

- 통합 수정
- 정수기 필터 이관 자료 출력 
1. 산소수기 주문자료(반품 제외) 20030901 ~ 20040831   
주문: 4,422건, 반품:452건  ===> 3,970건(MS-SQL) 
-- 주문: 3,859건, 반품: 446건  ===> 3,423건(Oralce) 
0100012004020700795 입금일자: 20041208 
0100012004021200577 입금일자: 20040924 
--------------------------------------------------------------------------------------------------------    

2. 필터 주문자료(반품 제외) 20030901 ~ 20050430 
주문: 1,872 건, 반품: 8 건 ===> 1,859 건 

00142158: 세디멘트필터(1차)+프리카본필터(2차) ---->  925 건 
00142159: 항균/UF중공사막필터(3차) ---->  359 건 
00142160: 포스트카본필터(4차)+ 항균카트리지 ---->  505 건   ====> 1,789 건 
--------------------------------------------------------------------------------------------------------
 - 기타(제외) 
00155473: sediment 필터 (1차), 00155474: precarbon 필터 (2차), 
00155475: UF 공중사막 필터 (3차), 00155476: postcarbon 필터 (4차) 
==============================================================================================================

- 쇼핑몰 수정
- 5월 가정의 달 기획전(/display/event/W18010000/categoryP.jsp)  
/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W18010000&p_display_cd=51 
(/display/event/com/mainP.jsp 에서 분기) 

- 탑 메뉴 조절(/main_tpl/top.jsp 에서 조절) ==> S001: L&B, S013: R&F, S019: I3MART, S063: 기획매장 
--------------------------------------------------------------------------------------------------------
<% 
String categorycd = ""; 
if(!p_category_cd.equals("")){ 
categorycd = p_category_cd.substring(0,3); 
} 

if(p_store_cd.equals("S063")&&(  categorycd.equals("U79")  categorycd.equals("U70")  categorycd.equals("U95")  
 categorycd.equals("V41")  categorycd.equals("V21")  categorycd.equals("V23")  categorycd.equals("V70")  
 categorycd.equals("V76")  categorycd.equals("V88")  categorycd.equals("W18"))){ 
%> 
<%  System.out.println("[/top.jsp]:i3Mart]  ===============>"); %> 
<jsp:include page="/main_tpl/topmenui3MartP.jsp" flush="true" /> 
<% 
}else{ 
%> 
<%  System.out.println("[/top.jsp]:[L&B]  ===============>"); %> 
<jsp:include page="/main_tpl/topmenuLnbP.jsp" flush="true" /> 
<% 
} 
%>  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.29(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 21:00 

- 쇼핑몰 수정
- 기획전 메뉴얼(기획전 사용법) 
- 5월 가정의 달 기획전(/display/event/W18010000/categoryP.jsp)  
/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W18010000&p_display_cd=51 
(==> /display/event/com/mainP.jsp 에서 분기) 

- 5월 가정의 달 기획전 상품목록(/display/prdlist/tpl/type51/itemListP.jsp) 
/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W18010100&p_display_cd=51 

- 5월 가정의 달 기획전 상품목록(R&F)(/display/event/W18010300/categoryP.jsp) 
/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W18010300&p_display_cd=51  

- 5월 가정의 달 기획전 상품상세 보기(/display/prd/tpl/type51/catalogP.jsp p) 
/display/prd/prd.jsp?p_store_cd=S063&p_category_cd=W18010101&p_display_cd=51&p_item_cd=00155233 
==============================================================================================================

- R&F 매장- 웰빙라이프-리빙케어(/display/prdlist/prdlist.jsp  
--> /display/prdlist/tpl/type11/itemListP.jsp --> /display/prdlist/tpl/type11/itemsListByListP.jsp) 
/display/sml/smlctg.jsp?p_store_cd=S013&p_category_cd=T03010100&p_display_cd=11 
- 52in산소수기 필터관련 안내 페이지 
/etc/52infilter/rnf52infilterP.jsp?p_store_cd=S013 
==============================================================================================================

- CVS 테스트 서버  
1. 기타(O) --> CVS저장소 탐색 --> 신규(N) -->  
위치 
호스트(H): 210.123.133.218 
저장소 경로(R): i3shop 
인증 
사용자(U): tamario 
암호(P): tamario 
----------------------------------------------------- 

2. HEAD 에서  
CCDOM 폴더 오른쪽 클릭 --> 다음으로 체크 아웃(A) 클릭 
3. Orion 설정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.04.30(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 21:30 

- 쇼핑몰 수정
- R&F 매장 수정(/display/prdlist/tpl/type11/itemListP.jsp) 
http://test.mart.cc/display/sml/smlctg.jsp?p_store_cd=S013&p_category_cd=T03010100&p_display_cd=11 
==============================================================================================================

 %%   박홍석   ks1128   Member 
위분 매출 하시는데  \ 5,124,200 결재하니 에러가 나면서 시티은행으로 확인하니 금액이 너무 크다고 가맹점에서  
연락을 줘야 결재 가능하다고했다함 ㅡㅡ;; 
[시티은행  5485 9601 3253 8008  황덕춘]  - 시티은행으로 전화해달라시며~ 
확인후 전화 요망  *   황덕춘   
전 - 김수진    ksj777    Gold-M 
==============================================================================================================

- 신용카드 결제 오류(승인 데이타 미존재) ==> 20050425 ~ 20050430 
0100012005042900150: LG카드 결제 오류(R&F) 
0100012005042900083: LG카드 결제 오류(L&B) 
0100012005042600397: LG카드 결제 오류(R&F) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■