

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.10.01(토) 작업 ■■■■■■■■■■■■■■■■■
---> 07:50 ~ 13:00 

- 쇼핑몰 수정
- 미네랄 스토리 작업(/mineral/link.jsp) 
1. 이벤트 & 공지사항 
2. 관련보도자료 
3. 자가 진단 프로그램 
4. 미네랄 이야기(사용 후기)  
5. FAQ 
-------------------------------------------------------------------------------------------------------

http://test.mart.cc/mineral/notice.jsp?p_bbs_no=1 
T_BBS_EVENT: 이벤트 게시판 정보 
게시판번호(p_bbs_no): (1:미네랄 이벤트 & 공지사항, 2:미네랄 관련보도자료, 3:미네랄 이야기, 4:미네랄 FAQ) ==> BBS_NO 
게시물번호(p_board_no):  ==> BOARD_NO 
==============================================================================================================

- KSNET 결제 확인(신용카드) 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  메인 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999)) 
KSNET_안심3C 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 신한, 외환(안심) 
신한 - 조흥((구)강원카드), 제주,수협,광주,전북 
-------------------------------------------------------------------------------------------------------
- 김명석 과장(3420-5916, *)  ===> 사업부 
02)3420-5951  박영준 대리(*) 5994 
-------------------------------------------------------------------------------------------------------
국민카드(대구카드 지원반): 김철우 과장 053)251-6237, * 
==============================================================================================================

http://www.ebs.co.kr/Contents/VodList1.asp?progcd=0003176&category=A01B01C00D00E00&pcode=A,1#none 

http://www.ebs.co.kr/Player/multiple/CVodPlayer.asp?speed=H&progcd=0003176&vseq=452118&categoryA01B01C00D
00E00&homepageyn=Y&div=ppv&sPROGNM=지식채널 e 

function CPVODPlayer1(type, speed, progcd, seq,category, homepageyn, sPROGNM) 
{ 

<a href="#none" onclick="javascript:CPVODPlayer1('V','H','0003176','452118','A01B01C00D00E00','Y','지식채널 e ');">나는 2억5천만 원입니다.</a> 
/Player/multiple/CVodPlayer.asp?speed=" + speed + "&progcd=" + progcd + "&vseq=" + seq + "&category=" + category 
+ "&homepageyn=" + homepageyn + "&div=ppv&sPROGNM=" + sPROGNM; 
==============================================================================================================

- 빨래 건조대, 슬리퍼, 휴지통(200리터용) 
==============================================================================================================

- 원룸 이사
14:00 강금순 주임 결혼(알리앙스 예식장) 
15:00 점심 
16:00 전세 잔금 2,300만원 지불 --> 주인 아저씨(*) 
18:30 이사(일남 차로 3번 옮김) 
19:30 저녁(일남, 진협 삼겹살집) 
21:00 이마트(진협) 
23:00 짐 정리 
02:30 종료 
03:00 취침 
==============================================================================================================

세대주: 이정화(대구은행 029-08-349774-002)  --> * 
대구시 동구 신천4동 322-20 상운빌라트 B동 201호 
관리비: 월 2만원(도시가스비, 전기세 제외) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.02(일) 작업 ■■■■■■■■■■■■■■■■
---> 14:00 ~ 19:00 

- 쇼핑몰 수정
- 미네랄 스토리 작업(/mineral/link.jsp) 
1. 이벤트 & 공지사항 
2. 관련보도자료 
3. 자가 진단 프로그램 
4. 미네랄 이야기(사용 후기)  
5. FAQ  
==============================================================================================================

- 도시가스 설치 
설치비 17,000원 
자동이체(매월 말일) 
전화 053)751-1114~5 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.03(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 미네랄 스토리 작업(/mineral/link.jsp) 
1. 이벤트 & 공지사항 
2. 관련보도자료 
3. 자가 진단 프로그램 
4. 미네랄 이야기(사용 후기)  
5. FAQ
//게시판번호(1:미네랄 이벤트 & 공지사항, 2:미네랄 관련보도자료, 3:미네랄 이야기, 4:미네랄 FAQ) 
==============================================================================================================

- 미네랄 자가 진단 프로그램 
- 미네랄 자가 진단 이벤트 응모 
==============================================================================================================

- 노블 패키지1  휴대폰 남은수량 수동 설정(/display/prd/tpl/type11/nbPkgDetailP.jsp) 
남은수량 17로 설정(DB와 상관없이 수동 설정) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 

- 쇼핑몰 수정
- 미네랄 스토리 실서버 적용(/mineral/link.jsp) 
1. 이벤트 & 공지사항 
2. 관련보도자료 
3. 자가 진단 프로그램 
4. 미네랄 이야기(사용 후기)  
5. FAQ   
//게시판번호(1:미네랄 이벤트 & 공지사항, 2:미네랄 관련보도자료, 3:미네랄 이야기, 4:미네랄 FAQ) 
==============================================================================================================

- 정수기 연결 에러 
후레쉬워터..전산이 아직도 안된다고 하거든요~ 
후레쉬워터 이상영씨(031-763-1431) 으로 전화하셔서 확인좀 부탁드릴께요 
--> 방화벽으로 인해 외부에서 정수기 업다운 프로그램 연결 불가 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 미네랄 스토리 작업(/mineral/link.jsp)  
4. 미네랄 이야기(사용 후기)  
답변글 쓰기 
==============================================================================================================

- BC, LG, 국민카드 무이자 행사 실서버 적용  @@@@@@@@ 
팝업공지 기간: 2005.10.05(수) ~ 12.31 
행사내용: 5만원 이상 구매 회원 6개월 무이자 할부 
행사상품: R&F매장 제외 
==============================================================================================================

- 동호회 게시판 수정(/entertain/club/clubBoardListP.jsp) 
에러 내용: Undefined variable: filedistlog 
  new FileDist(filedistlog, fullpathfile, remotePath).start(); 
--------------------------------------------------------------------------------------------------- - 
해결책: /entertain/club/clubBoardWrite.jsp 파일에 
<jsp:useBean id="filedistlog" class="com.daco.util.FileDistLog" scope="application" /> 추가 

동호회 파일 등록(111번) 서버 경로: /home/i3shop/upfile/img/club/upload 
==============================================================================================================

- 휴대폰 남은수량 설정(/BizMgr/SaleMgr/WebOrderMgr/NoblePK1_HP_Qty/popNoblePK1_HP_QtyP.jsp) 
회원정보관리(/MlmMgr/memberMgr/resellerListMainP.jsp) 

남은수량 17로 설정(DB와 상관없이 수동 설정) 
http://www.i3shop.co.kr/display/prd/tpl/type11/nbPkgDetailP.jsp 
남은 수량: 194 개 
==============================================================================================================

- 보험가입(회사에서 무료로 가입) 
무배당 삼성 명품 애니라이프 상해보험(개인형-누구나 만족형) 
증권번호: 50556817110000 
계약자명: (주)아이쓰리샵 
보험금: 월 119,000원  
보험기간: 2005/09/15 ~2012/09/15(7년) 
납입기간: 5년 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 

- 쇼핑몰 수정
- 미네랄 스토리 실서버 적용(/mineral/link.jsp)  
4. 미네랄 이야기(사용 후기)  
답변글 쓰기 
window.open('/mineral/self_01.jsp','01','height=550,width=750,scrollbars=0');window.stop(); 
==============================================================================================================

- BC, LG, 국민카드 무이자 행사 실서버 적용  @@@@@@@@ 
팝업공지 기간: 2005.10.05(수) ~ 12.31 
행사내용: 5만원 이상 구매 회원 6개월 무이자 할부 
행사상품: R&F매장 제외 
==============================================================================================================

- 비즈메카매장 수정 실서버 적용(/display/prdlist/tpl/type51/itemListP.jsp)  @@@@@@@@ 
PV 추가 
STORE_CD  ---> 매장코드(S065: 노블레스 매장) 
CATEGORY1_CD= 'U01'  ---> 카테고리 코드(U01010000: 비즈메카 매장) 
--------------------------------------------------------------------------------------------------------- 

-- 대 카테고리관리 정보 조회 @@@@@@@@@@@@@   
SELECT COMPANY_CD, STORE_CD, CATEGORY_CD, CATEGORY1_CD, CATEGORY1_NM, USE_YN, DISPLAY_CD 
-- SELECT * 
FROM T_CATEGORY 
WHERE COMPANY_CD = '01' 
  AND STORE_CD = 'S065'  
==============================================================================================================

나의 미네랄이야기 >에서 로그인하면 회원 누구나 글쓰기 권한 있어야 
되는데 글쓰기 권한 없음! 
자가진단 한번 응모한사람 ->다시 응모하기 누르면 이미 응모 
되었다는 문구 떠야 되는데 주소입력창이 뜨고 주소입력시 오류남! 
--------------------------------------------------------------------------------------------------------- 

나의 미네랄 이야기에 글을 새로 올리면 최근글이 올라와야 되는데  
새글이 안 올라오고 원래 있던 글이 그대로 보여집니다~ 
저말고 박인영대리나 노승철과장님게도 관리자 권한 줘야 되는데 
(수정,삭제)이건은  급한건 아니니 차후에 다시 해주시면 될것 같구요, 
일단 나의미네랄이야기에서 새로 글올리면 최근 글이 기본 값으로  
보여지게끔 수정 부탁드립니다~ 
==============================================================================================================

http://www.kobul.co.kr/soo/bbs/list.asp?number=1 
- 고불교우회 홈피 @@@@@@@@@@@@@ 
www.kobul.co.kr 김남국/1540731 
FTP주소: ftp.kobul.co.kr kobul_co_kr/dusghkwp(연화제) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 휴대폰 남은수량 설정(/BizMgr/SaleMgr/WebOrderMgr/NoblePK1_HP_Qty/popNoblePK1_HP_QtyP.jsp) 
회원정보관리(/MlmMgr/memberMgr/resellerListMainP.jsp) 
http://www.i3shop.co.kr/display/prd/tpl/type11/nbPkgDetailP.jsp 

- 2005년 10월 4일(화) 휴대폰 증감 
설정 희망 수량: 200 
당시 휴대폰 주문,반품 수량: -488 
설정수량과 구매반품수량 차: 688 
--------------------------------------------------------------------------------------------------------- 

- T_NOBLE_PK_ORDER_PRICE 테이블 인텍스 추가 
CREATE INDEX XIF_T_NOBLE_PK_ORDER_PRICE ON T_NOBLE_PK_ORDER_PRICE 
(COMPANY_CD, MERCHANT_CD, ORDER_DT, ORDER_NO, ITEM_CD,  
PHONE_TYPE) 
LOGGING 
TABLESPACE IIISHOPX 
PCTFREE    10 
INITRANS   2 
MAXTRANS   255 
STORAGE    ( 
            INITIAL          64K 
            MINEXTENTS       1 
            MAXEXTENTS       2147483645 
            PCTINCREASE      0 
            FREELISTS        1 
            FREELIST GROUPS  1 
            BUFFER_POOL      DEFAULT 
           ) 
--------------------------------------------------------------------------------------------------------- 

CREATE INDEX XIF2_T_NOBLE_PK_ORDER_PRICE ON T_NOBLE_PK_ORDER_PRICE 
(PHONE_TYPE) 
LOGGING 
TABLESPACE IIISHOPX 
PCTFREE    10 
INITRANS   2 
MAXTRANS   255 
STORAGE    ( 
            INITIAL          64K 
            MINEXTENTS       1 
            MAXEXTENTS       2147483645 
            PCTINCREASE      0 
            FREELISTS        1 
            FREELIST GROUPS  1 
            BUFFER_POOL      DEFAULT 
           ) 
==============================================================================================================

- asp 디버깅 표준 
Reg_sName = Mid(ListRs("sName"), 1, 6) &"**"   '작성자   
'response.write("[/list.asp]:[Enter_ssid]"+ Enter_ssid) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 21:00 

- 통합 수정
- 제한수량 구매 List 정보 수정(/BizMgr/ItemMgr/LimitCount/LimitCountBuyedList/popLimitCountBuyedEditP.jsp)  
수정, 삭제시 창 띄기 않게 수정 
ssy65 638463 손설영 00157715 (K)황금뜸부기 20kg-햅쌀 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 킬러앱 되돌아올 URL 수정 
/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U02010100&p_display_cd=51 
- 에러 URL 
/display/prdlist/prdlist.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51 
==============================================================================================================

- PV수정(2005년 10월 6일자 PV 미존재 데이타) 
--주문 정보 수정 @@@@@@@@ 
-- UPDATE T_ORDER_DTL M 
SET (M.PV, M.REAL_PV) = (SELECT A.PV, A.PV   --회원ID, 직급, 핸드폰번호 
FROM T_ITEM A 
WHERE M.ITEM_CD = A.ITEM_CD 
) 
WHERE EXISTS 
	  (SELECT 'x' 
	  FROM T_ITEM A 
	  WHERE M.ITEM_CD = A.ITEM_CD 
	  )  
		AND M.ORDER_DT ='20051006'    
		AND M.ORDER_NO ='00251'     --주문번호(00296, 00295, 00288, 00279, 00284)   
		AND M.ITEM_CD = '00158426'  --상품코드 
--;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.12(수) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 넷텔 선불 충천 결제 수정(신용카드 결제, 휴대폰 결제)
* 이정이   wonga11  Silver-M    ( 전 - 곽한수  hs11  Gold-M ) 
넷텔선불충전 결제가 안된다고함. 
휴대폰결제, 신용카드 결제 다 안된다고함. 
담당자 확인후 연락드리기로함   * / 곽한수GM 
==============================================================================================================

-- 휴대폰 결제 정보 조회 @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ 
SELECT ORDER_DT, ORDER_NO, MEM_ID AS 회원ID, MEM_NM AS 회원명, MEM_SSN AS 주민번호, 
   BILL_AMT AS 결제금액, M_NO AS 휴대폰번호, M_MOBILID AS 모빌리언스_거래번호 
-- SELECT * 
FROM T_NETTEL_ORDER 
WHERE COMPANY_CD = '01'  
AND MERCHANT_CD = '0001' 
AND ORDER_DT >= '20050813' 
AND ORDER_DT <= '20051013'  
AND ORDER_STS >= '02' --주문상태(01:주문접수, 02:입금확인) 
AND BILL_METHOD = '03' --결제방법(01:현금, 02:카드, 03:휴대폰 소액 결제) 
--; 
==============================================================================================================

- 넷텔일별매출조회(/NettelMgr/NettelDaySellingP.jsp)  --> 통합 넷텔관리 
==============================================================================================================

- 이용통계 페이지 
- SMS 전송 관리자 페이지 
https://mcash.mobilians.co.kr/smsgw/ ID/PWD(i3shop/757913) 
SMS 결제 담당자:  임영식 주임(*@*.*)  T) 02-2192-2163 
-------------------------------------------------------------------------------------------------------- 

- 모빌리언스 휴대폰 결제 관리자 페이지 
https://mcash.mobilians.co.kr/bill/payment/index.php3 ID/PWD(05011701/05011701) 
휴대폰 결제 담당자: 오경수 주임 T) (02)2192-2165 
-------------------------------------------------------------------------------------------------------- 

에러 메세지: Mcash결제 요청오류(재시도요망)입니다. 
ap.getResultcd()ode --> 225 
원인: LogFile 경로 폴더를 안 만들어 줘서 에러 
# 웹서버가 linux,Unix계열일때 
LogFile=/opt/payment/mcash/  ===> 휴대폰 소액 결제 로그 경로 

[root@i3shop_ccdom4 i3shop]# cd / 
[root@i3shop_ccdom4 opt]# mkdir payment --> 폴더 생성 
[root@i3shop_ccdom4 payment]# mkdir mcash --> 폴더 생성 
[root@i3shop_ccdom4 /]# pwd 
-------------------------------------------------------------------------------------------------------- 

- 테스트 서버로 접속하여 결제 
--> 테스트 서버: 61.33.43.142, 실 서버: 211.106.159.177 
==============================================================================================================

- 신용카드 결제 로그 
\\211.233.5.116\i3shop\ksnet1\log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 넷텔 선불 충천 결제 수정(신용카드 결제, 휴대폰 결제) 
신용카드 결제 에러: 
Message1=[승인전문오류    ] 
Message2=[ISP인증오류     ] 
원인: /Nettel/Precalling_pay_2.jsp 에서 ISP에 해당하는 파라미터를 제대로 가지고 가지 못 함 
==============================================================================================================

%%    김태연   ce0004    Member   
비씨카드 -> 9425-2000-1400-8613  김태연 - isp등록한거 - 161,030원 주문하고있다고함  
"미등록 상점"이라고 오류가 난다고하심. 카드사로 문의하니 아이쓰리샵으로 문의하라고한다함 
확인후 전화 *   
-------------------------------------------------------------------------------------------------------- 
에러내용: 거래번호: HSrv32953626 APPROVAL_MSG: 미등록상점      Tel:1544-6030 
원인: 저희쪽에서 KS NET으로 보내는 신용카드 전문이 길면 이런 에러가 뜬다고 하네요. 
상품명이 50Byte를 넘어서 에러가 나는 것으로  추정  --> 원인 아님 
원인: 할부 개월수 문제 
-------------------------------------------------------------------------------------------------------- 

- /CardPayForISP.java 에서 @@@@@ 
public Hashtable approvalKSNET_ISP( 
ipg.CreditDataMessage 
("I000", InterestType, TrackII, Installment, total, "", "", KVP_CURRENCY,  
 BatchUseType, CardSendType, VisaAuthYn, Domain, IpAddr, BusinessNumber, Filler, AuthType,  
 MPIPositionType, MPIReUseType, EncData); 
) 

 ---> String EncData            // MPI, ISP 데이터 
-------------------------------------------------------------------------------------------------------- 

- /CartBean.java 에서 @@@@@ 
// 주문을 넣는다. 
retHash = (Hashtable)cart.makeNetelInputHash(request); // 4=주문을 넣자   

makeNetelInputHash( 
	// 마스타 정보 분리 
	orderHash = makeNettelOrderMasterValue(req); 

	// 시제정보 분리 
	arVec = makeNettelArValue(req,orderHash);  
) 
==============================================================================================================

- L&B 매장 활성화 데이타 출력(상품개발팀 노승철 과장 요청) 
1. 최근 6개월간 구매 회원 
2. 가입일자가 2005년 4월 1일 이후 인 비구매 회원 출력 
==============================================================================================================

- 안심클릭 카드 
삼성올앳카드(9420902101937600): 진태만   --> 우리은행(96075366418964) 
국민카드(9410468398418016) 진태만 
국민 체크카드(9436457695390101) 진태만--> 1105/***52** CVC: 060  
외환카드(9410004760649621) 진태만 --> 1010/***52** CVC: 386  
LG카드(9410803255269007): kijin00/tama3** 큰 매형 
200902/9597 CVC: 891 640712 - 1703812 
==============================================================================================================

>> 14:15:43 : [203110002005101314154320021002980100012005101300193                               김태연                                          
1100                                                           0아이쓰리샵 상품                                   K1000-000-00001                                  
I0002                                        03000161030            0017                                        221.140.68.6                                                                                                                                                         
IKN00828A00290204BABUYoomoa7kib%2Fq0mMcBcpevXnes0jK%2FMzFuqld6f%2BOa5VbUUeKKxz%2F99oTy%2B8e%0D%0Ar
vwYHxkmyFMeExcOwf%2BL0m3pNEwPq7HCr7j5nIw9DJ0ItX4QTILFoVwgkMQoOnQY%0D%0AyI7gguPcWWVdXJzH95TWeEGZF
czaivIZA7AB5PX9Gyw%3D%0D%0A0589Version%3D1.0%26KeyFlag%3D1%26KeyNum%3D1%26EncryptAlgorithm%3DSEED-CB
C%26SignAlgorithm%3DSHA1%26Data%3DYgyR1%252bgdHIEvJBOcZFsI0Rf8NjePjwd4un3zLLxFJ9ksrVbwmpTVSUhK7381PzwS
%250a1AsFVNc6Dt4OHlrT7arFk5R3%2FEulA6cu%252bcSFJaJclo0zTe%2Fvg%2FJpp3pguPnxIoTw%250a5wOfhZhYw6YpYUvTLs0uG
F5W6dZJHsi95yvmD%252bzC4ktqijYtJpK8ydO%2FGOZ3sQ2h%250aPBcDQd0KlWt%2FNk8K%2FZNWM2OBsE7wGJipM0KcQxseF0v
xt%252b%252byj74FxUsB%252bi%2FixcAV%250ao2UquXSnDo29dfw%2FZ9aWo0dP%252b1ukC3W1VSf%252bXqnR7SQLBlRHyH8Ad
5%2Ff7TOWSBIM%250aBZH2bCOwAXk7bLAQsOjUNhx%252bLhK7O%2FlgS9ZjCrQmxEx0VaCodk352ZSJuRcYRZXy%250a%26Pub
Cert%3DNOT15000100202405691     ] 

>> 14:15:44 : [203110002005101314154320021002980100012005101300193                               김태연                                           
1100                                                           0아이쓰리샵 상품                                   K1000-000-00001                                  
I001HSrv32953626X20051013141747                        미등록상점      Tel:1544-6030                                                                                                                                                                                                 
IKN00828A00290204BABUYoomoa7kib%2Fq0mMcBcpevXnes0jK%2FMzFuqld6f%2BOa5VbUUeKKxz%2F99oTy%2B8e%0D%0Ar
vwYHxkmyFMeExcOwf%2BL0m3pNEwPq7HCr7j5nIw9DJ0ItX4QTILFoVwgkMQoOnQY%0D%0AyI7gguPcWWVdXJzH95TWeEGZF
czaivIZA7AB5PX9Gyw%3D%0D%0A0589Version%3D1.0%26KeyFlag%3D1%26KeyNum%3D1%26EncryptAlgorithm%3DSEED-CBC
%26SignAlgorithm%3DSHA1%26Data%3DYgyR1%252bgdHIEvJBOcZFsI0Rf8NjePjwd4un3zLLxFJ9ksrVbwmpTVSUhK7381PzwS
%250a1AsFVNc6Dt4OHlrT7arFk5R3%2FEulA6cu%252bcSFJaJclo0zTe%2Fvg%2FJpp3pguPnxIoTw%250a5wOfhZhYw6YpYUvTLs0u
GF5W6dZJHsi95yvmD%252bzC4ktqijYtJpK8ydO%2FGOZ3sQ2h%250aPBcDQd0KlWt%2FNk8K%2FZNWM2OBsE7wGJipM0KcQxseF
0vxt%252b%252byj74FxUsB%252bi%2FixcAV%250ao2UquXSnDo29dfw%2FZ9aWo0dP%252b1ukC3W1VSf%252bXqnR7SQLBlRHy
H8Ad5%2Ff7TOWSBIM%250aBZH2bCOwAXk7bLAQsOjUNhx%252bLhK7O%2FlgS9ZjCrQmxEx0VaCodk352ZSJuRcYRZXy%250a%2
6PubCert%3DNOT] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 넷텔 선불 충천 결제 수정(신용카드 결제, 휴대폰 결제) 
==============================================================================================================

- telnet 로 연결 불가능 할 때 
]# ssh root@211.233.5.111 
]# env 
]# export DISPLAY=210.123.133.101:0.0      ----> 새 서버 
]# ./adminclient.sh 
==============================================================================================================

- C2C결제 에러 
%%   이경아   lkazone  무료회원 
* 롯데카드 : 4670 0804 0874 5001  / * 날짜: 10/13  10/14/ 금액 : 11.900원 

롯데카드로 어제 주문서 작성했고 휴대전화로 승인문자 받았다고 하심!  
오늘 카드사로 전화하니 승인되었다고 확인했다심!  
-> 아이쓰리샵에는 주문내역없음! 
-승인취소요청중=======  
==============================================================================================================

- 엑셀 VLOOKUP 사용법 
1. 엑셀 빈 셀에 = 를 친다. 
2. 함수 마법사에서 VLOOKUP 찾음(모두) 
3. VLOOKUP 설정 
Lookup Value = B:B ==> 배열의 첫째 열에서 찾을 값입니다.  
Lookup_value는 숫자, 참조 영역 또는 문자열을 지정할 수 있습니다. 
Table Value = A:A ==> 데이터를 찾을 정보 표입니다. 데이터베이스나 목록과 같은 범위의 참조 영역 또는 범위  
이름을 사용합니다. (F4:절대 주소값) 
Col_index_numy =  2 ==> 비교값과 같은 행에 있는 값을 표시할 table_array의 열 번호입니다 
Range_lookup =  false ==> (false 정확하게 일치값 조회) 
==============================================================================================================

111, 112, 115, 116  --> OK 
113, 114, 117 --> NO 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.15(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:40 ~ 15:00 ==> 격주 휴무 

- 쇼핑몰 수정
- 경품 이벤트 분석 
T_EVNET_PREMINUM: 경품 이벤트 
p_event_premium_amt: 경품 이벤트 금액 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.17(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 19:00 

- 쇼핑몰 수정
- 경품 이벤트 분석 
T_EVNET_PREMINUM: 경품 이벤트  
p_event_premium_amt: 경품 이벤트 금액 

- 상품코드 자르기 
String p_event_item_cd_day = p_event_item_cd.substring(7,8); 

- 주방가전 냉장고(/display/prdlist/prdlist.jsp?p_store_cd=S001&p_category_cd=T01070102&p_display_cd=01) 
==============================================================================================================
  
1. 미네랄스토리 
BIZ_mineralP 
/BizMgr/EventMgr/MineralListP.jsp 
2. 경품이벤트 
BIZ_premiumP 
/BizMgr/EventMgr/PremiumListP.jsp 
통합 ===>  본부영업관리 --> EVENT관리 --> 미네랄스토리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 경품 이벤트 분석 
T_EVNET_PREMINUM: 경품 이벤트  
p_event_premium_amt: 경품 이벤트 금액 
==============================================================================================================

// 기간지정을 위해 현재 연월일을 구한다. 
int cday = 0; 
Calendar cal = Calendar.getInstance(); 
//cyear  = cal.get(Calendar.YEAR); 
//cmonth = cal.get(Calendar.MONTH)+1; //   >.<  +1을 해야 현재월이네.. 
cday = cal.get(Calendar.DATE); //현재 일 
String p_str_day = ""+ cday; 
p_str_day = p_str_day.substring(1,2); 
-------------------------------------------------------------------------------------------- 

- jsp에서 문자를 숫자로 변경 
String strMoonja =""; 
int rprice = util.parseInt(strMoonja); 
p_event_premium_amt = p_sale_price_tot.substring(0, p_sale_price_tot.length()-4); 

SMS 발송 문구: "현금쿠폰 10,000원이 공짜, 지금 즉시 사이트에서 확인하세요" 
==============================================================================================================

- 코넷 DNS 도메인 문의 전화 
상담 센타(TEL 국번 없이 100번) 
http://www.kornet.net/dns/dnscontact.php 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.19(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 메일링 업체 조사 
아이피등록제(네이버, 다음) 
--------------------------------------------------------------------------------------------

- 메일링 리스트 패키지 사이트 
http://www.enage.com/index.asp 
http://www.ozmailer.com/index.html 
http://www.gmsmail.co.kr/webmail.asp 
www.icancrm.co.kr 
http://www.tabslab.com/kr 

- 스팸 메일관련 준수 사항 
http://www.spamcop.or.kr/asGuidelines/infotran.jsp 
  
- JavaMail 강좌 
http://okjsp.pe.kr/lecture/lec02/iissmtp01.htm 
==============================================================================================================

- anypack 하드 A/S 맡김  
경기도 성남시 상대원동 크란츠테크노빌딩 1503호  ㈜ 유에스비넷 
Tel : 031-745-0203 ---> 2 
Tel : 031-745-2345 ---> 2 
Website : www.usbnet.co.kr, www.anypak.net 
기술 지원 문의 : *@*.* 
A/S접수 번호: 0510190001  --> 바코드번호: 00G000000019481 
==============================================================================================================

- 냉장고 도착 
LG 싱싱냉장고(237L) R-B241GB: 28만원 
==============================================================================================================

java 디자인패턴 입문(쓰래드편) 출판사: (영진.com)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:40 

- 쇼핑몰 수정
- 메일링 업체 조사 
아이피등록제(네이버, 다음) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 메일링 업체 조사  
- 메일링 리스트 패키지 사이트 
http://www.enage.com/index.asp 
http://www.ozmailer.com/index.html 
http://www.gmsmail.co.kr/webmail.asp 
www.icancrm.co.kr 
==============================================================================================================

- 메일러 익스프레스 
http://www.tabslab.com/kr  
==============================================================================================================

- 카드 결제 에러 
카드번호: 5421588158535009 yun70 
에러 내용: 할부한도초과  
--> 저희쪽 LG카드 R&F 상품 정상 할부 결제 되고 있어요. 이 카드에 문제가 있는 것 같아요. 
카드 소유자 본인이 직접 LG카드에 문의를 해야 될 것 같네요. 
==============================================================================================================

- 카드 결제 에러 
%%   최은숙   eun1006   Silver-M   
국민카드  200만원가량 결재하려는데 거래불가 가맹점이라고 나온다고 문의  
9410-4797-9017-1012(no631) --> (국민카드) 
에러내용: 거래불가가맹점  카드사 전화요망  --> KSNET_RnF 
원인: 카드 소유자의 신용도가 낮아서 하루 30만원 미만 2번 가능. 
        정확한 것을 알고 싶으면 카드 소유자 본인이 직접국민카드 문의를 해야 될 것 같네요.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.22(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 16:00 

- 쇼핑몰 수정
- 장바구니 수정  
찜리스트 분석 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정  
장바구니 todo 리스트 작성 
==============================================================================================================

- 오즈 레포트 에러 
주문번호 : 0100012005102200230 
수령인 : 김외숙(무료회원) bebe1004ks 
주문시 도메인 : dada2460.i31004.cc 
김외숙씨가 회사에 영수증을 제출해야 되는데 주문시 도메인에 접속하여 
구매내역을 확인하니 없어서 영수증 출력이 안됩니다.^^ 
==============================================================================================================

부팅 도중 윈도우 화면 프로세스 화살표 다 지나가고 
계정(아이디/비번)부분에서 화면에 아무것도 안나오고 그냥 
까만 화면 상태로 진행됩니다. 
안전모드로 들어가지 확인 --> 들어가지면 그래픽카드문제 
문제는 VGA카드가 맛이 간것 같습니다 
-------------------------------------------------------------------------------------------------------- 

unexpecter error(805269696) occured at ling 562 F:\nt1\private/ntos/root/setup/arcdisp.c 
--> 이 문제는 RAM(random access memory) 모듈이나 RAM 슬롯이 손상되었기 때문에 발생된 문제입니다. 
이 문제를 해결하려면 필요한 경우 다음 방법 중 한 가지 이상을 사용하십시오.  
1. Windows XP 설치에 필요한 최소량의 RAM만 남겨 두고 컴퓨터에서 RAM 모듈을 하나 이상 제거합니다.  
이렇게 하여 문제가 해결되면 설치 프로그램이 완료된 후 이러한 모듈을 다시 삽입하거나 새 RAM 모듈로 교체합니다. 

참고: 이전 RAM 모듈을 다시 삽입할 때 컴퓨터의 성능이 영향을 받지 않는지 확인하십시오. 
2. 또는 RAM 모듈을 컴퓨터의 다른(사용하지 않는) RAM 슬롯에 설치합니다. 
3. 또는 설치 이전이나 이후에도 계속 문제가 발생하면 컴퓨터의 모든 RAM 모듈을 새로운 RAM 모듈로 교체합니다.  
램 확인해 보세요! 
-------------------------------------------------------------------------------------------------------- 

ACPI BIOS in this system is not fully compliant with the ACPI specifiacation. 
updated BIOS www.hardware-upate.com 
--> ACPI기능을 Disable 하십시오 CMOS 
==============================================================================================================

- 시스템: Win2000 Standard Server. ServicePack3 
서비스: AD,DHCP,DNS,FTP 
pcanywhere로 원격관리를 하려는 도중. 갑자기 서버가 멈춰버렸습니다. 
후딱 뛰어가 보니 완전 정지상태여서 ShutDwon을 한뒤 재 부팅을 했습니다. 

1. Starting Windows... ▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷▷ (성공) 
2. 윈도우로고 - 프로그래스바 (성공) 
3. 시동중... (정지) 
4. 로그온화면 (구경못함) 

블루스크린이 그리워질때가 있네요. T.T 이 경우는 말없이 그냥 멈추니 대책이 없습니다.  
이상한 점은 안전모드로 로그인이 가능한데 복구콘솔로 로그인하면 패스워드가 잘못 되었다고 합니다.  
시스템 백업은 한달전에 해 놓은게 있는데.AD땜시 안되는 것 같구. 어찌할 바를 모르겠습니다.  
마지막 구성으로 부팅해도 똑같은 현상입니다. 
-------------------------------------------------------------------------------------------------------- 

--> 해결했습니다. 문제는 VGA카드가 맛이 간것 같습니다. 드라이버를 내리니 정상 부팅이 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.25(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정  
장바구니 todo 리스트 작성 
==============================================================================================================

- 판매(소비)보고(/admin/rnfsalemgr/ordItemSaleRegP.jsp) 
상품주문 청약철회 기간  --> 회원구입 : 공급일(청약일)로부터 3개월 이내  
판매(소비)보고한 상품의 경우 청약철회 기일은 재고보고한 날로부터 14일이 경과하면 반품이 불가합니다 

- 리셀러인경우는 판매용(판매 보고 후 14일 반품 불가),  소비용(PV가 0) 
무료회원 이면 소비용 
-------------------------------------------------------------------------------------------------------

-- 주문상세 정보 수정(판매 보고) 
-- UPDATE T_ORDER_DTL   
SET RESELLER_SALE_DT = TO_CHAR(SYSDATE,'YYYYMMDD'),    --리셀러소비일자 
BONUS_APPLY_DT = TO_CHAR(SYSDATE,'YYYYMMDD'),    --수당적용일자 
RESELLER_SALE_YN = 'Y', --리셀러 소비여부   
UP_ID = ?,   
UP_IP = ?,   
UP_DT = SYSDATE   
WHERE COMPANY_CD = ?   
AND MERCHANT_CD = ?   
AND ORDER_NO = ?    
AND SEQ_NO = ?   
AND ORDER_DT = ?   
AND RESELLER_ORD_CL = '02'  --리셀러주문구분(01:소비용, 02:판매용) 
AND RESELLER_SALE_YN = 'N'  --리셀러소비여부 
--; 
-------------------------------------------------------------------------------------------------------

0100012005100600279, 0100012005100600288, 0100012005100600295 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.26(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- SMS 문자 전송 
최근 6개월 내 가입자 중 비구매 회원 6,620건 전송 ==> 12:00 ~ 15:00(3시간 소요)  ---> 현금쿠폰발행(53)  
SMS 발송 문구: "현금쿠폰 10,000원이 공짜, 지금 즉시 사이트에서 확인하세요 [아이쓰리샵]1688-1313" 
==============================================================================================================

- 휴대폰 남은수량 설정(/BizMgr/SaleMgr/WebOrderMgr/NoblePK1_HP_Qty/popNoblePK1_HP_QtyP.jsp) 
PT-L1100 (1번 폰) 남은 수량 설정 추가 
PT-L1100 -419(설정수량과_구매반품수량_차) + 519(판매수량) = 100 --> 남은 수량 설정(100개) 
PT-L1100 -419(설정수량과_구매반품수량_차) + 527(판매수량) = 108 
108 - 100 = 8 (남은 수량 - 설정할 수량) = 실제 판매된 수량 
100 - 8 = 92 (설정할 수량 - 실제 판매된 수량) = 실제 남은 수량  
-------------------------------------------------------------------------------------------------------

PH-L3500C  -1064(설정수량과_구매반품수량_차) + 1264(판매수량) = 200 --> 남은 수량 설정(200개) 
PH-L3500C  -1064(설정수량과_구매반품수량_차) + 1267(판매수량) = 203 
203 - 200 = 3 (남은 수량 - 설정할 수량) = 실제 판매된 수량 
200 - 3 = 197(설정할 수량 - 실제 판매된 수량) = 실제 남은 수량 
==============================================================================================================

- 포항집 주소 
경북 포항시 북구 두호동 우광맨션 나동 102호 
TEL)054-424-8823 
==============================================================================================================

- 스케줄 설정 
스케쥴을 잡아놓고 실행을하거나 어떤 시간 단위로 실행하는 프로그램을 만들때 Timer 클래스를 쓰세요.  
TimerTask로 작업 정의하고 Timer로 시간을 넣어주면 간단히 구현됩니다. 저는 이런걸 이용해서 경매나  
공구 같은걸 구현하는데 넘 쉽고 또 확장도 잘되서 강추!! 
(API보면 아주 큰 프로그램도 문제없이 스케쥴러가 잘 처리한다네요..) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 22:00 

- 쇼핑몰 수정
- 카드 결제 오류 
LG카드 L&B 가맹점월한도초과 
LG카드쪽에서 협의 없이 가맹점 한도 1억씩 하양 조정(2005.10.04) 했다고 하네요. 
연체율이 높아서 엘지본사에서 임위로 한도를 낮춤 
==============================================================================================================

- 메일 서비스 업체 아이피 실명제 등록 현황 조사
www.yahoo.co.kr ( @yahoo.com ) 
야후의 서비스약관을 위배하지만 않으면 됩니다.  
www.msn.co.kr ( @hotmail.com , @msn.com ) 
사용자에 의해 차단 수준을 지정되어 있습니다.  

ipregister.daum.net/reg_who.jsp(@hanmail.net): 아이피 실명제 등록해야 함 

www.hanmir.com ( kornet.net , hitel.net ) 
IP등록신청을 해야 합니다. 바로가기  
www.dreamwiz.com 
2003.12.29 현재 준비중입니다.  
www.nate.com ( @lycos.co.kr(@kebi.com) , @netsgo.com ) 
IP실명제 바로가기  
www.korea.com  
스팸방지정책에 의해서 차단하고 있습니다.  
www.freechal.com  
IP차단여부를 확인하고, 대량메일발송IP를 등록할 수 있습니다. 바로가기  
www.naver.com  
IP실명제 바로가기  
www.netian.com  
별다른 정책은 없으며, 받은편지함에 대해서도 메일이 삭제됨. 수신/발신 지연현상 보임.  
www.chol.com ( @chollian.net , @simmani.com ) 
대량메일발송 IP 사전등록(500통이상)  
www.empal.com  
광고메일차단 시스템과 스팸방지정책에 따릅니다.  
www.orgio.net  
별다른 조치가 보이지 않습니다.  
www.unitel.co.kr ( @weppy.com ) 
스팸메일차단설정을 이용  
www.hanafos.com ( @hananet.net , @dreamx.net ) 
별다른 조치 없음.  
www.nownuri.net ( 프리미엄회원만 메일사용가능 )  
www.magicn.com ( 스팸필터링기능있음 )  
www.sayclub.com  
특별한조치없으나, 메일수신여부가 의심됨.  
www.hosanna.net  
www.i5425.com (메일서비스제공안함. ) 

http://blog.naver.com/dhbhrl.do?Redirect=Log&logNo=80018032663 
==============================================================================================================

다음            : 1544-0580 
네이버         : 1588-5896 
야후            : 1544-2500 (다른곳에는 없고 개인정보보호정책 페이지에서 찾았음) 
엠파스         : 02-598-2374 
네이트         : 1588-7983 
파란            : 1588-5668 
핫메일         : 못찾겠음 
코리아닷컴   : 02-3488-8500 
드림위즈      : 못찾겠음 
천리안         : 1544-1420 
프리챌         : 1588-9974 
네티앙         : 2194-5500 
==============================================================================================================

- 아이캔 소프트(www.icancrm.co.kr)  
대표 박정수(053-816-9977) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 22:00 

- 쇼핑몰 수정
- 메일 서비스 업체 조사 및 IP 실명제 등록 
고객 아이디 (ID): i3shop/i3shop9133 
법인명: 주식회사아이쓰리샵 
대표자: 안중현 
사업자등록번호: 504-81-32871 
법인등록번호: 170111-0168147(170111 0168147) 
운영사이트주소: http://www.i3shop.com 
법인/개인 주소: (701-824) 대구 동구 신천3동 74-1 (주)아이쓰리샵 
담당자명: 진태만  
담당자 이메일 주소: *@*.* 
담당자 연락처: 053-757-9133 
업태: 도소매 서비스 
업종: 인터넷 쇼핑몰 외 
메일발송 IP: 211.233.5.102, 210.123.133.31 
i3shop 메일 IP: 211.233.5.102 
엠파스 메일로 발송되는 메일 도메인: i3shop.com 
--------------------------------------------------------------------------------------------------------------------------- 
  
- TAMA 개인 메일  @@@@@@@@ 
*@*.* 
*@*.* 
*@*.*  
*@*.* taemario/tama3**  
*@*.* 
*@*.* 
*@*.* 
---------------------------------------------------------------------------------------------------------------------------

인증을 위하여 대량메일 발송등록 담당자에게 사업자 등록증, 대표자 및 담당자 신분증 사본을 팩스 (064-741-1560)로 
보내주시기 바랍니다. 
==============================================================================================================

- 카드 결제 에러  
할부개월입력오류할부개월수정요망 
--> 개인 카드 문제로 판단, 본인이 직접 전화 카드사로 전화 요망 
이종관 PM * 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 13:00 

- 쇼핑몰 수정
- 메일 서비스 업체 조사 및 IP 실명제 등록 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.10.31(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- JavaMail 설치(Window용) 
설치방법(http://okjsp.pe.kr/lecture/lec02/mail01.htm) 
CLASSPATH=C:\j2sdk1.4.2_08\lib\tools.jar;C:\j2sdk1.4.2_08\lib\mail.jar;C:\j2sdk1.4.2_08\lib\activation.jar 
--------------------------------------------------------------------------------------------------------------------------- 

- 메일 전송(/MainMgr/Maill/javamail.htm): 통합 
- 메일링 리스트(/MainMgr/Maillinglist/maillistP.jsp) 
---------------------------------------------------------------------------------------------------------------------------

- Nmail 분석(Window용) 
http://www.passkorea.net  --> i3shop 메일 IP: 211.233.5.102 에 설치되어 있음 
==============================================================================================================

- G.W 무료설치 회원 주소변경 
10월29일 신청한 건이구요~ 주문자명-> 박석수 아이디-> pk102  
서울 용산구 용산동1 가로 되어있는데요.--> 대구 달서구 용산동 으로 
==============================================================================================================

- 반품 이관 에러(이관 안 됨: ORACLE -> MS-SQL) 
곽경희 0100012004090600476 
민은기 0100012003120900846 
==============================================================================================================

- 광용이형 돕기 
10만원 송금(홍상환: 나눔 90 동기 계 계좌) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■