

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.03) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.03.01(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 09:20 ~ 23:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp)
www.infosms.co.kr (foxhus/2475273)
==============================================================================================================

- 거래일자 오류 
joopg / 0100012005030100293 
오늘 카드 주문건인테 카드취소가 안됩니다. 
카드정보가 안뜬는데 확인 좀 부탁드립니다. 
-------------------------------------------------------------------------------------------------------------------------

- 0100012005030100293 
주문자명: 주평근 거래기간: 20050228으로 하니깐 조회가 되네요. 
거래일자가 하루 늦게 나오네요. 거래일자 문제 인것 같은데요. 
내일 아침에 나이스에 문의 해보겠습니다. 
==============================================================================================================

- 시스템 날짜 오류(2월 28일 발생) 
soonho 배숙희 0100012005022801081 -> 반품건 
이분 오늘 주문인데 카드승인은 3.1일 날자로 되어있는데요. 
확인좀 부탁드립니다. 
-------------------------------------------------------------------------------------------------------------------------

- 서버 세팅시 시스템 날짜 잘못 세팅해서 그런 걸로 추정 됩니다. 
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- 메모리 카드 구매 @@@@@@@@@@ 
올림푸스 뮤-30   DIGITAL 
http://www.olympus.co.kr/product/product_detail.php?category=0103&page=2&seq=63# 
http://www.hacker.co.kr/goods/goods_cont.asp?Cnum=7&Snum=181&LiType=0&SltValue=올림푸스&Gnum=10302 

- 메모리 카드 [올림푸스] xD 픽처 256MB -->  50,500 원(구매가) ===> 구입해서 누나에게 줌 
http://www.hyoksung.com/item.php?it_id=1300 

- 메모리 카드 [올림푸스] xD 픽처 256MB -->  53,500 원 
http://www.hacker.co.kr/goods/goods_cont.asp?Cnum=7&Snum=183&LiType=0&SltValue=올림푸스&Gnum=5498 

- 메모리 카드 [올림푸스] xD 픽처 512MB -->  86,500 원 
http://www.hacker.co.kr/goods/goods_cont.asp?Cnum=7&Snum=183&LiType=0&SltValue=올림푸스&Gnum=8543 
==============================================================================================================

- 경북 포항시 안강읍 옥산리 591-5 한동 유성APT 705동 309호 진기숙 
054)762-9392 * 
==============================================================================================================

- 한의원 진료 
10:30 ~ 11:40 침 맞기, 피 빼기, 찜질  
4천원(의료보험증 지참) 
==============================================================================================================

- 축구공 기증 
재영이 계좌번호(150051-51-044901) 10만원 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.02(수) 작업 ■■■■■■■■■■■■■■■■
---> 8:40 ~ 24:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
메일 모듈 설치(로컬, 108번 서버)  
www.infosms.co.kr (foxhus/2475273) 
-------------------------------------------------------------------------------------------------------------------------

- 클래스 파일 등록(외부 파일이고 java 파일이 없을 때)   
java빌더 경로에서 
기본 출력 폴더(T): i3shop_BizMgr/WEB_ROOT/WEB-INF/classes 

i3shop_BizMgr/common_mis 
출력 폴더: i3shop_BizMgr/common_mis 
i3shop_BizMgr/common/src 
출력 폴더: i3shop_BizMgr/common/src 
-------------------------------------------------------------------------------------------------------------------------

- 디버깅은 자원(네비게이터)에서
common/src/com/daco, i3shop 
common_mis/src/com/daco, i3shop 
com 폴더를 복사하여  
/i3shop_BizMgr/WEB_ROOT/WEB-INF/classes/com 에 붙여 넣음  
mobilians 폴더 파일을 수동을 복사하여 집어 넣으면 안 없어짐 
==============================================================================================================

- 입고일자 변경 
업체명                     발주번호                 입고번호 
(주)델리플러스     0100012005022800002      00002 
(주)셰프라인        0100012005022800018      00003 --> 쿡 세트 
(주)카이온테크     0100012005022800019      00004 ---> 엔진오일 
-------------------------------------------------------------------------------------------------------------------------

- 입고일자 수정(/BizMgr/BuyingMgr/PlacingOrderMgr/poStatP.jsp) 
T_PO 테이블 ==> 발주번호: 0190012005020100002 
T_STOREIN 테이블 ==> 입고번호: 0190012005020100002 --> 
입고번호 검색(변경 희망일: 20050228): 입고번호가 MAX 00013로 조회됨 
0190012005022800014(새로 변경된 입고번호) 
-------------------------------------------------------------------------------------------------------------------------

-- 입고정보 입고번호가 MAX값 조회  @@@@@@@@@@@@@@@@@@@@@@@ 
SELECT STOREIN_DT, STOREIN_NO 
FROM T_STOREIN 
WHERE MERCHANT_CD = '9001'      --점명 
  AND STOREIN_DT = '20050228'   --입고일자 
ORDER BY STOREIN_NO DESC 
; 

--입고  내역 수정 @@@@@@@@@@@@ 
-- UPDATE T_STOREIN 
SET STOREIN_DT = '20050228',      --입고일자 
    STOREIN_NO = '00014'          --입고번호 
    --PO_DT = '20050228',          --발주일자(발주)  010001 20050228 00002 
    --PO_NO = '00002'              --발주번호(발주) 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '9001'      --점명 
AND COMPANY_CD  MERCHANT_CD  STOREIN_DT  STOREIN_NO = '0190012005030200004'   --입고번호   
----------------------------------------------------------------  COMMIT    ROLLBACK 

--입고 상세 내역 수정 @@@@@@@@@@@@ 
-- UPDATE T_STOREIN_DTL 
SET STOREIN_DT = '20050228',      --입고일자 
    STOREIN_NO = '00014'          --입고번호 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '9001'      --점명 
  AND COMPANY_CD  MERCHANT_CD  STOREIN_DT  STOREIN_NO = '0190012005030200004'   --입고번호 
; 
==============================================================================================================

- 공인인증 오류 
 이메일 주소를 입력을 안해서 오류가 난다고 하십니다. 
 김명희 (회원번호 17226) 
==============================================================================================================

- 수불장 2월 
L&B 상품, 2월달 수불장 부탁드릴께요. 
상품코드: 00152258 
==============================================================================================================

김성숙    woochan26 
카드번호 : 4579-0549-9472-2023 국민카드 
결재금액 : 180여만원 
결재에러코드 [9999]라고 뜬다고 하세요~ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.03(목) 작업 ■■■■■■■■■■■■■■■■
---> 8:40 ~ 23:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
메일 전송 테스트 
----------------------------------------------------------------------------------------------------------------------

- 글자 대체 함수 
<%!  
    public static String replace(String line, String oldString, String newString)  
    {  
        for(int index = 0; (index = line.indexOf(oldString, index)) >= 0; index += newString.length())  
              line = line.substring(0, index) + newString + line.substring(index + oldString.length());  
        return line;  
    }  
%> 

SmsMsg = replace(SmsMsg, "홍길동", MEM_NM); 
==============================================================================================================

- 모빌리언스(www.mobilians.co.kr) 최재혁 과장(*@*.*) 
T) 02-2192-2057 H) * 
임영식 주임(*@*.*) T) 02-2192-2163 
==============================================================================================================

- 바이트 배열 0x0d0x0a 
byte = { bcrlf[0x0d, 0xda]}; 
----------------------------------------------------------------------------------------------------------------------

public static String getReplaceBr(String str){ 
try{ 
   char[] ch=str.trim().toCharArray(); 
   if (ch.length > 0){  
       StringBuffer sb = new StringBuffer(str.trim()); 
       int index = 0; 
       for (int i = 0; i < ch.length; i ++){ 
   switch (ch[i]){  
       case  '\n' : sb.insert(i+index," ");  
       index+=4;  
   } 
       } 
   return sb.toString(); 
   }  

}catch(Exception e){} 
return "";  
}  
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- 시스템 날짜 오류(3월 3일 발생) 
eve5173 배은주 01000120050303 00075 -> 반품건 
이분 오늘 주문인데 카드승인은 3.2일 날자로 되어있는데요.  
----------------------------------------------------------------------------------------------------------------------
서버 세팅시 시스템 날짜 잘못 세팅해서 그런 걸로 추정 됩니다. 
----------------------------------------------------------------------------------------------------------------------

- 211.233.5.113 서버 시스템 날짜 에러 
010001-2005030300251 실 거래일자 20050303 11:27:34 --> 나이스 거래일자 20050302 21:27:19(-14 시간) 
010001-2005030300414    실 거래일자 20050303 14:45:33 --> 나이스 거래일자 20050303 00:45:18(-14 시간) 
==============================================================================================================

010001-2005030300251 실 거래일자 20050303 11:27:34 --> 나이스 거래일자 20050302 21:27:19(-14 시간) 
[05-03-02   21:27:19:525 EST] 5a735667 SystemOut     U [시각:20050302212719] 
[메시지:[NICE APP]:터미널번호[3597],카드번호[000204040010001],주문번호[0100012005030300251],주문시각[20050303112730]]  
==============================================================================================================

010001-2005030300414    실 거래일자 20050303 14:45:33 --> 나이스 거래일자 20050303 00:45:18(-14 시간)  
[05-03-03   0:45:18:074 EST] 3e23d672 SystemOut     U [시각:20050303004518] 
[메시지:[NICE APP]:터미널번호[3597],카드번호[000204040010001],주문번호[0100012005030300414],주문시각[20050303144528]] 
==============================================================================================================

.111 번 서버 
[05-03-03   18:09:04:381 KST] 7175fbe9 SystemOut  ======> KST : Korea Standard Time(시간대) 
.113 번 서버 
[05-03-03   0:45:18:074 EST] 3e23d672 SystemOut  ======> EST : Eastern Standard Time(시간대)  
==============================================================================================================

- 신용카드 결제 로그 보기 
[root@iiishop_int /]# cd /opt/payment/nice/log 
[root@iiishop_int log]# vi 20050303.log  
==============================================================================================================

- 정경근    gg701 
삼성카드결재시 안심클릭창이 뜨지않는다하세요. 다른 사이트에서는 결재된다하시구요..  
확인부탁드립니다.. 
삼성카드 : 5310-7239-8897-5000 
==============================================================================================================

- R&F 직배송 상품 조회 
151194 KT GPS 네트로 KT-4000   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.04(금) 작업 ■■■■■■■■■■■■■■■■
---> 8:30 ~ 24:00 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
==============================================================================================================

- SMS 메세지 저장 
신규, 수정, 삭제 
==============================================================================================================

- R&F 직배송 상품 출력 
151194 KT GPS 네트로 KT-4000   
==============================================================================================================

- 보류 
대백유통 383-6880-2 -> CJ택배  481-528-1785 ->3/4 배송출발상태 
수령자 : 홍승현(동일한분)으로 3건  
김현도    kim75   --> 0100012005030200852  -> 취소                         
0100012005030201838  -> 정상주문 
김현진    kim73   --> 0100012005030201303  -> 취소  
위건처럼 처리해야 되나.. 해당 대백유통 그냥 대충.. 2개 배송막고. 
한개만 배송하면서 아무 주문번호에나 송장번호를 입력해버림  
-> 실제 배송나간건   
주문번호 : 0100012005030201838   이거이며..  
송장번호는  0100012005030201303   여기에 기재되어잇음~  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.05(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 13:00 ==> 맑은 후 눈 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
-------------------------------------------------------------------------------------------------------------------------------- 

- 올림함수 @@@@@ 
<%!  
int getTotalAddition(int TotalValue,   int in_per)   /*   올림함수 */ 
{  
   int p =TotalValue% in_per ; 
   int m = TotalValue / in_per ; 
   int TotalAddValue = 0 ; 

   if ( p > 0 )   
   {  
       TotalAddValue = m + 1; 
   }  
   else   
   {  
       TotalAddValue = m; 
   }                  
   return TotalAddValue; 
}  
%> 
-------------------------------------------------------------------------------------------------------------------------------- 

cntHalfSize = getTotalAddition(mdNewItemSize, 2);	// 2째 이미지 진열수  
==============================================================================================================

 - Math.round(a);  
 Math.round(a*100)/100.0; 
==============================================================================================================

0100012005030200692 -->주문번호 
이건 정수기 프로그램에서 조회안되네요~ 
모든 자리에서 다~~~ 
-------------------------------------------------------------------------------------------------------------------------------- 

0100012004021202033 -->이건은 하얀색으로 조회됨... 
배송만 받은건.... 
신규설치 -->이관데이타 UP할려고 하는데,  
하얀색이라 아예 이관데이타 UP 할수 없도록 나오네요~~ 
하얀색도 이관데이타 할수 있도록 해주셔야 될것 같아요~ 
두건 처리후 쪽지 부탁드립니다~~^^ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.06(일) 작업 ■■■■■■■■■■■■■■■■
---> 09:40 ~ 18:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp)  
메세지 수정, 글자 스크립트 수정 
--------------------------------------------------------------------------------------------------------------------- 

- 출고일자별내역조회(/BizMgr/DeliveryMgr/StoreOut/storeoutStsByEndDtP.jsp) 
배송 검수 데이타 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.07(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
---------------------------------------------------------------------------------------------------------------------

 -- SMS전송 정보TB 칼럼 수정  --------- 
ALTER TABLE T_CART MODIFY (  
   T_SMS_SEND_INFO  VARCHAR2(19)   /*  해당일자(수당일, 직급승급일, 생일, 주문일자)  */     
 ); 
==============================================================================================================
  
- 카테고리 연결상품에서 없는 상품 
http://100mart.mart.cc/display/prd/prd.jsp?p_store_cd=S064&p_category_cd=T01010103&p_display_cd=41&p_item_cd=00136895 
카테고리 연결상품정보에는없지만.. 
상품기본정보, 점별 상품정보에 상품코드 00136895 가 존재하거든 .. 
그리고 한정판매수량: 27,판매상태: ACTIVE 
이기 때문에 상품이 진열된 것 같아요... 
==============================================================================================================

- 한의원 진료 
10:30 ~ 11:40 침 맞기, 피 빼기, 찜질  
4천원(의료보험증 지참) 
==============================================================================================================

- 디카 얻음(큰 누나) @@@@@@@@@@ 
삼성 KENOX U-CA 3  
1.5"LCD, 32MB기본, 광학3배줌, 동영상+녹음지원, 아바타기능, MSDuo/MSProDuo지원 
가격 : 236,000원(2005년 3월 현재) 
---------------------------------------------------------------------------------------------------------------------

- 메모리 카드(메모리스틱 (M/S)) 
SanDisk 메모리스틱 프로 듀오 256MB  -->  43,000원(구매가)===> 46,500원(배송비 포함) 
http://www.hyoksung.com/item.php?it_id=4101 
---------------------------------------------------------------------------------------------------------------------
ㆍ제품사양 
 - CCD(총화소수) : 1/2.7인치(총 화소수 330만 화소) CCD 
 - 유효화소수 : 320만 화소 
 - 기록화소수  
   정지화상 : 2,048(2,048 x 1,536) / 2,048P(2,048 x 1,360) /  
                  1,600(1,600 x 1,200) / 1,024(1,024 x 768) /  
                  640(640 x 480)  
   동화상 : 320 x 240 / 160 x 120 
 - 기록모드  
    정지화상 : JPEG(Exif Ver. 2.1) / DCF, DPOF 대응 
    동화상 : MOV(MPEG-4)  
    음성 : WAV 
 - 렌즈 : SHD 렌즈 f = 5.8 ~ 17.4mm  
          (35mm 필름 카메라 환산시 : 38~114mm) 
 - 렌즈밝기 : F2.8 ~ F4.8 
 - 줌 : 광학 3 배, 디지탈 3배(재생모드시 약 5배) 
 - 셔터스피드 
    자동 : 2 ∼ 1/2,000초 / 야경모드 : 16 ~ 1/2,000초 
 - 촬영범위  
   표준 : 약 80cm ∼ 무한대  
   매크로 : 약 5cm ~ 80cm(광각) / 50cm ~ 80cm(망원) 
   메뉴얼 포커스시 6cm(광각) / 20cm(망원) ∼ 무한대 
 - 노출제어 : 프로그램 AE 
   수동노출 : 야경모드시 롱타임 셔터기능 
 - 화이트 밸런스 : 자동 / 태양광 / 흐림 / 백열등 / 형광등 /  
                         커스텀 모드 
 - 감도 : ISO 100 / 200 / 400 
 - 플래시 : 오토 / 적목감소 / 슬로우 싱크로 / 강제발광 / 
               발광금지 
   플래쉬 연동범위 : 광각 : 0.2 ~ 3.0m / 망원 : 0.2 ~ 2.0m  
   플래쉬 충전시간 : 약 6초 
 - 동영상 : 음성포함(메모리가 가득찰 때까지)  
               320 x 240 / 160 x 120(프레임수 : 20fps, 15fps) 
 - 뷰파인더 : 광학 실상식 뷰 파인더 
 - 액정모니터 : 1.5인치 컬러 TFT 액정 
 - 저장매체 : 메모리 스틱 듀오 / 메모리 스틱 프로 듀오 
 - 인터페이스 : USB, 비디오 출력(NTSC / PAL) 
                     전원입력단자 
 - 전원 : 리튬이온 충전지 SLB-1037  
            리튬전지 CP1 / AC 아답타 
 - 크기 : 102 × 53.8 × 31.6mm 
 - 무게 :  약 119g(배터리, 메모리 제외) 

ㆍ제품특징 
 - MPEG-4 기능 탑재로 동영상 촬영시간이 최대 4배까지  
   연장 
 - 세계최초 3D 아바타 기능으로 나만의 디카 표현가능 
 - 7가지 색상의 작동 램프로 더욱 화려하고 아름다운 디자인  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.08(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:50 ~ 22:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
==============================================================================================================
  
0100012005030200692 -->주문번호임 
확인하면 2개가 나와요~2개중 하나 삭제 부탁드리구요...^^ 
참..그리고 입금날짜가 3/2일자인데,아직 후레쉬쪽에서 이관 안된걸로 
확인되거든요?? 
일단 이건은 입금날짜를 오늘로 바꾸고 이관데이타 up하면 되겠죠? 
==============================================================================================================
  
- 삼성카드 오류 
결제 전 창을 띄워서 월한도 체크 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2005.03.09(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 00:20 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
==============================================================================================================

- 삼성카드 오류 
결제 전 창을 띄워서 월한도 체크(popupOrderPut_SS_CARD.jsp) 
==============================================================================================================

- JAVA 언어의 형 @@@@@@@@@@@@@@  ===> 형전환 주의 
1. 정수형: 정수를 넣는 변수  
byte형: -128 이상 127 이하,   부호 없는 16비트 
short형: -32768 이상 32768 이하,   부호 붙은 8비트 
int형: -2147483648 이상 2147483648 이하,   부호 붙은 16비트 
long형: -922372036854775808 이상 922372036854775808 이하,   부호 붙은 32비트 
2. 실수형: 소수점 이하를 갖는 숫자를 넣는 변수 
float형: 단정도 부동 소수점형 
double형: 배정도 부동 소수점형 
3. 문자형: 문자를 넣는 변수  
char형: 문자형(0 이상 65535 이하)   부호 없는 16비트(Unicode) 
4. 논리형: true 또는 false 
5. void: 공백을 나타내는 형 
---------------------------------------------------------------------------------------------------------------------------

- 형전환  
parseInt, parseLong, parseFloat, parseDouble 
---------------------------------------------------------------------------------------------------------------------------

var total_ansimss_amt = parseFloat(frm.p_ar_amt_cd.value) + parseFloat(frm.p_sscard_amt.value);  
//총 삼성카드 사용액(결제 희망액 + 누적 사용액) 
total_ansimss_amt = util.parseDouble(p_hope_amt) + util.parseDouble(util.getData("SS_AMT", resultHash2));/ 
//총 삼성카드 사용액(결제 희망액 + 총사용_금액) 
==============================================================================================================

- int형을 String형으로 형전환 
int a = 1; 
String b = a + ""; 
==============================================================================================================

- PDA 1대 회수 
검품1 PDA A/S 되서 돌아옴 
==============================================================================================================

- 피검사 결과 
간이 안 좋음: 간 수치 낮추어 주는 한 달치 약 구매(3만 7천 3백원) 
혈압 정상: 130/90 
==============================================================================================================

- BC카드 오류 알림(메인) 
/popup/popup_20050309.html 
가로: 400   세로: 288 
==============================================================================================================

- 삼성카드_한도초과 출력 
주문번호별 소개, 주문자별 소개 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.10(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
- SMS전송 데이타 조회, 저장 수정 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
==============================================================================================================

- B2B 팝업(렌터카(AVIS) 서비스 시행) 
b2b_20050310.html 400*539 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.11(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:40 ~ 23:00 ==> 비 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

- SMS전송 데이타 수정, 삭제 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.12(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 09:50 ~ 19:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

- SMS전송 보낼 데이타 조회, 저장 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01  
==============================================================================================================

- Golden32 설치(DB 프로그램) 
CD-KEY: SAVAGEPHROZEN19748 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.14(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 ==> 맑음

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

- SMS전송 보낼 데이타 조회, 저장(월수당 지급, 직급 승급) 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
================================================================================================================

손해경    withme1 
국민카드결재를 하는데 비할부가맹점이라고 나온다하세요. 
카드번호 : 9436-4559-2355-4100   결재시도한 개월수 : 10개월  
================================================================================================================

- B2B 팝업(/display/main/b2b/mainP.jsp) =====> 헤어 서비스 시행 
/b2b_20050314.html 400*490  
================================================================================================================

- 로그인 후에 뜨도록 해주세요 
/popup/popup_20050314_i3nettel.html 
지금 뜨는 BC카드랑 겹치지 않게 해주세요 
================================================================================================================

0100012005030700471 --> 이건 입금확인완료된건인데.. DEPEND 전산에 보이지가 않네요~~  등록부탁드릴게요~~^^ 
----------------------------------------------- ----------------------------------------------- 

0100012005030200519 --> 이건 조회하니까, 2개 뜨네요~  
하나 삭제 부탁드립니다~ 
================================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2005.03.15(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 ==> 비 후 갬 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 

- SMS전송 보낼 데이타 조회, 저장 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 

- SMS전송 보낼 데이타 조회, 저장(배송 시작) 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListDeliveryP.jsp?p_sms_gb=04 
================================================================================================================

- [i3shop]주문번호:0100012005031500123 홍길동님 주문하신 상품이 배송출발 되었습니다 
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.16(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 19:00 ==> 흐림 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
  
- SMS전송 보낼 데이타 조회, 저장 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01  
================================================================================================================

- 정신혜(삼성카드) 4009135507275003 
================================================================================================================

1. 주문번호별 소계 
-- 200411: 3건   200412: 0건 
-- 200501: 6건  200502: 3건  200503: 5건 
================================================================================================================

2. T_CARD_SS DB 기준 
-- 200411: 3건   200412: 14건 
-- 200501: 29건  200502: 44건  200503: 36건 
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.17(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 20:00 ==> 비 후 갬 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
  
- SMS전송 보낼 데이타 조회, 저장 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 

- SMS전송결과관리(/BizMgr/SMSMgr/smsResultListP.jsp) 
==> BIZ_smsResultP 
================================================================================================================

0100012005030700225 -->반품 접수번호 
0100012003102700814 -->주문번호 
이건 반품 등록되었는데, depend에 확인안되네요 
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.18(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
www.infosms.co.kr (foxhus/2475273) 
  
- SMS전송 보낼 데이타 조회, 저장 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01    --> 27,775,000 
================================================================================================================

주문번호: 0100012005031400357 
이건 정수기 프로그램에서 조회안됨~ 
오늘 날짜로 등록 부탁드립니다~~ 
================================================================================================================

- 김종진   jin7626   Management-M 
운영자 소개글 사진 등록하는데 본인 파일이  1111.jpg파일인데 
~ jpg나 gif파일만 사용 가능하다고 나온다고함~  
용량 : 200k바이트고~ 크기도 150*150 이라고하심  
확인후 전화  *  
================================================================================================================

- ADSPider 프로그램(다잡아) 
http://www.ad-spider.com/down.asp 
에러 내용: 새창을 띄울 때-> 서버 이름이나 주소를 확인할 수 없습니다. 
================================================================================================================

- R&F 프로모션 창 띄우기(무료회원 제외 요청- 문의 많이 옴): 
--> R&F 메인(/display/big/bigctg.jsp) 
--> R&F 카테고리 메인(/display/prdlist/prdlist.jsp) 
영주형 *  
================================================================================================================

[/smsSend_Module.jsp]:[ap.getResultcd()]23[Common.RTN_OK]00 
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.21(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 ==> 구름 

- 통합 수정
- SMS 최종 테스트 
================================================================================================================

0100012005022801676(삼성카드) 
제가 보기엔 
20050228 이날 마감일이라 서버 부하가 많고 결제랑도 많아서 나이스 정보 통신, 카드사로 통해서 
결제가 갔다오는 과정에서 부하가 많아서 결제 승인 후 에러가 난 것 같습니다. 
과도한 부하가 원인이고 이런 에러를 없앨려고 한다면 
카드사와 직가맹하고 우리 서버도 마감일에 부하가 없도록 업그레이드 하는 방법이 있습니다. 
-------------------------------------------------------------------------------------------------------------------------
그리고 우리 결제 시스템은 카드사 결제를 가기 전에 카드승인 오류를 저장하고 결제가 완전히 끝나면 
결제완료로 변합니다. 
==============================================================================================================

- 배스 룸(출조: 방철배 이사-> (주)인스케어) ==> www.anglershouse.co.kr 
FTP: anglershouse/1111 
ADMIN: majes22/222223 
첫째: 포토 불러오면 사진이 계속 쌓이면서 보여 
둘째: 글 수정 안 됨  
-------------------------------------------------------------------------------------------------------------------------

사진올리기가 없고 
글지우기도 안되고 
2페게시판 2페이지 넘어가면 안보이고 
사진도 6장만보이면 되는데 
-------------------------------------------------------------------------------------------------------------------------
DB 연결(MS-SQL): 211.174.62.48 
anglershouse anglershouse/11111 
-------------------------------------------------------------------------------------------------------------------------

Microsoft VBScript 런타임 오류 오류 '800a0046'  
사용 권한이 없습니다.  사이트갤럭시 에러. 
Photo_Gallery에 쓰기, 수정 권한을 주어야 합니다. 
기존 파일 경로가 변경 되었습니다. 
d:\storage_k8\k8\anglershouse.co.kr\Photo_Gallery\photo\ 
================================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2005.03.22(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 비 후 갬 

- 쇼핑몰 수정
- 카드사 결제 후 저장 주문 에러 
-------------------------------------------------------------------------------------------------------------------------

0100012005022801676(삼성카드) 
0100012005030201307 
0100012005031300039 
0100012005020100503 
==============================================================================================================

이영혜: win6226 
삼성카드로 결제 하는데 미등록 가맹점 이라고 나온다 하세요. 
삼성카드: 4009-1329-1107-5020 
-------------------------------------------------------------------------------------------------------------------------

삼성카드 결제 거부: 2005-03-22 09:00  
==============================================================================================================

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- 비즈메카 매장 수정 건 
http://tamario.i3shop.cc/display/event/com/mainP.jsp?p_store_cd=S065&p_category_cd=U01000000&p_display_cd=51 
직판수당: 안 보여 줄 것 

http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U01010101&p_display_cd=51&p_item_cd=00152416  majes22/222223 
직판수당: 안 보여 줄 것 

임의의 로그인 창을 만들어서 로그인을 다시 하면 리셀러의 한에서 직판수당 보여 줄 것 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.23(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 ==> 구름 

- 쇼핑몰 수정
- 카드사 결제 후 저장 주문 에러 
-------------------------------------------------------------------------------------------------------------------------

0100012005022801676(삼성카드) 
0100012005030201307 
0100012005031300039 
0100012005020100503 
-------------------------------------------------------------------------------------------------------------------------

- 임포트 실행(SQL GATE에서): 나이스 신용카드 크로스 체크 
도구(T) -> 임포트(I) -> 
Import Wizard 에서 
테이블 선택: T_TEMP_NICE_CARD(나이스_신용카드_템) 선택 클릭 -> Import 시작 ->  
Import data Wizard 에서 
Import From: MS excel 
Source File Name: 2005_02(L&B).xls 선택 
Next(엑셀 포맷이 안 맞으면 안 넘어 감) ->  
Fields: SEQ_NO - A칼럼 선택 
Fields: ORDER_DT - E칼럼 선택 
Fields: ORDER_NO_FULL - J칼럼 선택 
Fields: AMT - G칼럼 선택 
Next -> Base formats 
Next -> Execute -> OK 
==============================================================================================================

- [통합 추가 수정 사항]
고객관리 : 053-757-9050 (생일자 포함) 
정수기 필터 : 053-757-9090 (미리 만드세요..사용은 나중에 할께염.) 
배송시작 : 053-856-8600 
수당지급 : 053-757-9040 
직급승급 : 053-757-9040 
기타 : 전화번호 없음 
전화번호는 수정가능해야 함~ 
==============================================================================================================

- 접수일자별내역조회(/BizMgr/DeliveryMgr/StoreOut/storeoutStsP.jsp)  
해당 일자별 출고완료 확인 가능 
-출고일자별내역조회(/BizMgr/DeliveryMgr/StoreOut/storeoutStsByEndDtP.jsp) 
==============================================================================================================

- 노은주 주임 프린터  
\\210.123.133.185(노은주/9035) 
==============================================================================================================

아버지 선린병원에 입원 시키고 지금 왔어.... 
일반 X-r 에선 척추뼈 1개가 내려앉앗다구하더라  
낼 정밀검사 받구 뼈주사 맞아서 회복시키자구 담당의사가 카더라...... 
입원실은 5층이구 호실은 생각이 안난다... 
톨날 함 오너라..... 
119불러서 갓다..... 
2005/03/23  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.24(목) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 20:00 ==> 비온 후 맑음 

- 쇼핑몰 수정
- 직판수당조회 설정 
리셀러라도 직판수당 조회 로그인 해야만 직판수당 조회 가능 
==============================================================================================================

- 카드사 결제 후 저장 주문 에러 원인 분석 협조전 작성(고객지원팀) 
- 모니터링 업무 문서 작성 
==============================================================================================================

방금 문의드린건으로 처리부탁드립니다~~ 
* 안정순 sun13  * 회원코드 :  A-9007478 

-인증서 다운로드할려면  개인정보 이메일주소 미입력하여  
다운로드안된다는 문구가뜬다는 오류건입니다~ 
* 이메일주소 :*@*.*  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.25(금) 작업 ■■■■■■■■■■■■■■■■ 

25(금): 년차 
26(토): 월차 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.28(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp)  
SMS전송 데이타 조회 쿼리 수정 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 
==============================================================================================================
  
- 롯데백화점 카드: 9410-6001-0495-8063 신경학 
백화점내 가맹점에서만 사용가능 
창원센타(055-262-4111) 
---------------------------------------------------------------------------------------------------- 

- 조흥비자 카드: 4689-1400-5671-5406 468914005671 5406   
창원센타(055-262-4111) 백정민 
==============================================================================================================

- 모빌리언스 
강병철(02-2192-2162)  *@*.* 
---------------------------------------------------------------------------------------------------- 
모빌리언스(www.mobilians.co.kr) 최재혁 과장(*@*.*) 
T) 02-2192-2057 H) * 
임영식 주임(*@*.*) T) 02-2192-2163 
==============================================================================================================
  
/popup/b2b_20050328.html 
가로: 400   세로: 455 
B2B 매장에 들어갔을때..."렌터카 서비스 시행" 팝업이 내려가고... 
지금 보내 드리는 팝업이 올라가면 됩니당."   
==============================================================================================================
  
0100012003093000622 이은연  
0100012004042700839 안정순 
0100012003110700813 장태덕 
설치날짜 전산오류건!! 
==============================================================================================================

- 창맥 동기 회비 
국민은행: 669102-01-076830 허순란(만원)  30일 이체 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2005.03.29(화) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:20 ~ 23:00 ==> 맑음 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp)  
SMS전송 데이타 조회 쿼리 수정 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListP.jsp?p_sms_gb=01 

- SMS전송 보낼 데이타 조회, 저장(배송 시작) 
http://210.123.133.31/BizMgr/SMSMgr/popSmsListDeliveryP.jsp?p_sms_gb=04 

- 추출 데이타 삭제(T_SMS_SEND_PREV) 
- 모달창에서는 페이지 이동이 안되기 때문에 별도의 프레임을 나누어야 한다  
SMS전송 데이타 조회 (/BizMgr/SMSMgr/popSmsListFrame.jsp) 
==============================================================================================================

- i3shop멤버쉽카드, 가맹점 사업 회의 
비즈포탈 박윤수 차장(14:00 ~ 17:00) 
==============================================================================================================
  
- PDA 1대 A/S 완료 
검품2 PDA 물류센타 반환 
==============================================================================================================

- 쌀 구매(이마트) 
상미쌀5kg  \15,800 
-쌀 구매(i3shop 킬러앱 매장) 
(K)골드 부안 갯마을쌀 20kg  \39,800 
농협 703-01-343801 진태만(쌀) 
주문번호: 010001-2005032900210  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.30(수) 작업 ■■■■■■■■■■■■■■■■ \
---> 07:20 ~ 22:00 ==> 맑음 

- 통합 수정
- 리두 파일 삭제 되었을 때 
EXP-00056: ORACLE 오류 1033가 발생했습니다 
ORA-01033: ORACLE initialization or shutdown in progress 
----------------------------------------------------------------------------------------------------------- 
C:\oracle\admin\TAMAORA\bdump 
tamaoraALRT.LOG, tamaoraLGWR.TRC 로그 체크 
----------------------------------------------------------------------------------------------------------- 

Thu Mar 31 07:43:43 2005 
Errors in file C:\oracle\admin\TAMAORA\bdump\tamaoraLGWR.TRC: 
ORA-00313: open failed for members of log group 2 of thread 1 
ORA-00312: online log 2 thread 1: 'C:\ORACLE\ORADATA\TAMAORA\REDO02.LOG' 
ORA-27041: unable to open file 
OSD-04002: 파일을 열 수 없습니다 
O/S-Error: (OS 2) 지정된 파일을 찾을 수 없습니다. 
==============================================================================================================

- 해결책: redo03.log 파일을 copy 해서 redo01과 redo02를 같은 위치에 만들어라.(redo01과 redo02 파일 지워짐) 
==============================================================================================================
  
1. 시작/종료 확인 
c:\> svrmgrl 
SVRMGR> connect internal/oracle 
접속되었습니다. 
SVRMGR> connect internal/oracle 
접속되었습니다. 
SVRMGR> shutdown abort 
SVRMGR> startup mount 

2. 로그 파일 확인 
SVRMGR> select * from v$logfile;     --로그 파일 확인 
GROUP#     STATUS  MEMBER 
---------- ------- -------------------------------------------------------------------------------- 
         1 STALE   C:\ORACLE\ORADATA\TAMAORA\REDO03.LOG 
         2 STALE   C:\ORACLE\ORADATA\TAMAORA\REDO02.LOG 
         3 STALE   C:\ORACLE\ORADATA\TAMAORA\REDO01.LOG 
3 행이 선택되었습니다. 

SVRMGR> alter database clear logfile 'C:\ORACLE\ORADATA\TAMAORA\REDO01.LOG'; 
명령문이 처리되었습니다. 
SVRMGR> alter database clear logfile 'C:\ORACLE\ORADATA\TAMAORA\REDO02.LOG'; 
명령문이 처리되었습니다. 
SVRMGR> alter database open; 
명령문이 처리되었습니다. 

SVRMGR> select * from v$logfile;     --로그 파일 확인 
GROUP#     STATUS  MEMBER 
---------- ------- -------------------------------------------------------------------------------- 
         1 STALE   C:\ORACLE\ORADATA\TAMAORA\REDO03.LOG 
         2         C:\ORACLE\ORADATA\TAMAORA\REDO02.LOG 
         3         C:\ORACLE\ORADATA\TAMAORA\REDO01.LOG 
3 행이 선택되었습니다. 

SVRMGR> shutdown abort 
SVRMGR> startup mount 
SVRMGR> select * from v$logfile;     --로그 파일 확인 
SVRMGR> alter database open; 
명령문이 처리되었습니다. 
==============================================================================================================

- 민방위 비상소집(07:00 ~ 08:00) 
4년차(비상소집, 하반기 교육 4시간) 
-----------------------------------------------------------------------------------------
3, 4년차(비상소집 1시간, 하반기 교육 4시간) 
5년차 이상(비상소집 1시간, 만 45세까지) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.03.31(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 ==> 맑음 

- 통합 수정
- 삼성카드 결제 재개(07:00) 
-----------------------------------------------------------------------------------------

* 이현주Member / ju73 
롯데카드사용~ 카드결재가 안된다함. 
오류 메세지 : 주문입력실패. 카드사로 확인요망. 8373 
카드번호 : 376270035382006 
확인후 연락드리겠다 안내함.  
==============================================================================================================

* 김길영 Active-Master / kkyi301 
산소수기 필터를 구매를 할려고 한다함...카드결재가 안된다고함  
외환카드  : 4599004817326300    -> 안심클릭등록되있다고함 
* 안심클릭 비번을 입력후....  
 결재처리중입니다. 잠시만 기다려주세요.  
==============================================================================================================

김순애      ksy58 
삼성카드 번호 : 5310-8239-4643-4007 --> 0100012005030900662 
5310-8239-4643-4007 이 카드로 송희면 회원님이  20050309일 
1,299,000원 결제를 이미 했습니다.  
그래서 이번달은 삼성카드 사용할 수 없습니다. 
-----------------------------------------------------------------------------------------
나이스 데이타에 확인 결과 접수취소로 잡혀 있어서 
한도 관련 데이타 삭제 했어요.......... 
이제 창을 닫고 다시 로그인해서 결제하면 정상적으로 될 것 입니다 
==============================================================================================================

주문번호 : 0100012005033100001  
국민카드 취소 안 됨 
응답 메시지 : 통신장애, 재시도 요망  
==============================================================================================================

- 공인인증서 오류 
홍영임(hye2166) *-2951716 
공인인증 받을때, 전화번호 미기재 오류 나시는 분입니다. 
 조치후, 저희쪽으로 연락 부탁드립니다.. 
==============================================================================================================

- i3 넷텔 서비스 점검 안내 팝업 
"로그인 전에" 팝업내용이 보이게 해주세요 
popup_20050331.html 
==============================================================================================================

- ISP UI 변경  
주문입력에 실패 했습니다. 
원거래찾기 오류, 거래내용 확인 요망[9898]  -->  kvp_cardcode=, kvp_quota=, 
  
[시각:20050331195001] 
 [메시지:[NICE APP]:터미널번호[3597],카드번호[],주문번호[0100012005033101503],주문시각[20050331194900]] 
/* ========================================================================= */ 
/* ========================================================================= */ 
[시각:20050331195001] 
 [메시지:[NICE APP]:주문금액[22800],할부기간[], 주문자명[아이쓰리샵]] 
/* ========================================================================= */ 
/* ========================================================================= */ 
[시각:20050331195022] 
 [메시지:[NICE APP RESULT]:RespCode[9898],RespMessage[원거래 찾기 오류, 거래내용 확인 요망    ]] 
/* ========================================================================= */ 
/* ========================================================================= */ 
[시각:20050331195022] 
 [메시지:[NICE APP RESULT]:고객명[아이쓰리샵],고객ID[test01],카드사코드[   ],카드번호[                ], 
 승인번호[                    ],거래번호[            ]]  
==============================================================================================================

- 정수기 수정 
05-03-25.xls에서 
0100012003110700813 
0100012005030800225 
0100012005031800297 
0100012005031800327 
0100012003093000622 
05-03-28.xls에서 
0100012005032100462 
0100012004031000771 
-----------------------------------------------------------------------------------------

배송상태,설치상태가 04이면 배송일자, 설치일자가 있어야 하는데 
빈공란을 넣어서 에러가 나는 겁니다. 
==============================================================================================================

- 인덱스 
A. 인덱스 정의 
데이터 조회의 속도를 높이기 위해 개발된 데이타 베이스 메커니즘 
인덱스 세그먼트라는 독립된 저장영역(테이블스페이스)을 가지는 
하나의 독립된 데이터베이스 객체 

B. 인덱스 종류 
유일(Unique) 인덱스 
비유일(Non-Unique) 인덱스 
복합(Concatenated) 인덱스 
비트맵(Bitmap) 인덱스 

C. 인덱스 생성 
인덱스 생성 조건 
1. 컬럼이 WHERE절 또는 JOIN 조건식에 빈번하게 사용될 때 
2. 컬럼 값에 일정한 규칙이 없이 넓게 분포되어 있을 때 
3. 컬럽 값에 NULL 값이 많이 포함되어 있을 때 
4. 테이블 데이터의 총 크기가 큰데 반해, 실제 질의(Query)하는 데이터의 량이 
총 데이터의 10% 이하일 때 
-----------------------------------------------------------------------------------------

-- 인덱스 생성 
CREATE UNIQUE INDEX XPKT2_STOREOUT ON  
"IIISHOP".T_STOREOUT(STOREOUT_END_DT,STOREOUT_DT, STOREOUT_NO,COMPANY_CD,MERCHANT_CD) 
TABLESPACE IIISHOPX PCTFREE 10 STORAGE(INITIAL 64K); 
==============================================================================================================

C. 인덱스 생성 
ALTER INDEX XPKT2_STOREOUT 
ALLOCATE EXTENT (SIZE 1M  DATAFILE 'E:\OHome\IDX1.dbs'); 

D. 인덱스 삭제 
DROP INDEX XPKT2_STOREOUT; 
==============================================================================================================

- 출고완료 일자 
20050330: 355 건(STOREOUT_END_DT), 355 건(STOREOUT_DT) 
20050331: 659 건(STOREOUT_END_DT), 328 건(STOREOUT_DT) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■