

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.02) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.02.01(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 통합 수정
- 입고일자 수정(/BizMgr/BuyingMgr/PlacingOrderMgr/poStatP.jsp) 
T_PO 테이블 ==> 발주번호: 0100012005013100012 
T_STOREIN 테이블 ==> 입고번호: 0190012005020100002 --> 
입고번호 검색(변경 희망일: 20050131): 00018 주문번호가 MAX(00019 생성) 
0190012005013100019(새로 변경된 입고번호) 
---------------------------------------------------------------------------------------------------------------- 

-- 입고정보 수정 @@@@@@@@@ 
-- UPDATE T_STOREIN 
SET  STOREIN_DT = '20050131',    --입고일자 
STOREIN_NO = '00019'  --입고번호 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '9001'     --점명 
  AND STOREIN_DT = '20050201' --입고일자 
  AND STOREIN_NO = '00002' --입고번호 
; 

-- 입고상세정보 수정 @@@@@@@@@ 
-- UPDATE T_STOREIN_DTL 
SET  STOREIN_DT = '20050131',    --입고일자 
STOREIN_NO = '00019' --입고번호 
WHERE COMPANY_CD = '01' 
  AND MERCHANT_CD = '9001'     --점명 
  AND STOREIN_DT = '20050201' --입고일자 
  AND STOREIN_NO = '00002' --입고번호 
;  
========================================================================================================= 

- 대용량 데이터 타입 
BLOB = Binary Large OBject 
CLOB = Character Large OBject 
오라클 최근 버젼에선 BLOB 형을 추천, 저장공간 사용문제라던가 검색문제 
오라클에서 대용량 데이터 타입 (LOB 군 CLOB, BLOB) 을 
이용하여 테이블을 생성할때에 CLOB를 관리하기위해 
자동적으로 생성되는 index 입니다. 
생성시 SYS_%$$ 형태로 생성되어집니다. 
이 인덱스는 수동으로 analyze 되지 않으며  
rebuild 되지 않습니다.  
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.02(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 06:30 ~ 24:00 

- 쇼핑몰 수정
- 장바구니 수정 
장바구니 테이블 생성(T_CART) 
---------------------------------------------------------------------------------------------------------------- 

- 장바구니 담기(/cartPut.jsp) @@@@@@@@@@ 
//장바구니에 넣을 입력 Hash 추출 (makeinputHash : request값을 itemHash(itemTypeVector포함)을 만들어 리턴 
inputHash = cart.makeInputHash(request,2); //2=상품정보+유형정보를 분리 
---------------------------------------------------------------------------------------------------------------- 


//분리된 정보를 카드에 담기 
try { 
//카트담기. PV가 있는 상품여부는 이곳에서 체크한다. 
resultHash = cart.addItemOnCart(inputHash); 
} 

<!-- //장바구니 데이타 T_CART 테이블 저장   //--> 
<%@ include file="/cart/cartSaveDB_S.jsp" %>  
========================================================================================================= 

결제하기(/order/orderPutP_1.jsp) --> 결제하기(/order/orderPutP_1.jsp) --> 결제하기(/order/orderPutP_1.jsp) 
 --> 결제하기(/order/orderPutP_1.jsp) 
==============================================================================================================

\\211.233.5.105(분배기 서버) administrator/i3shop1050321 
- 사용된 세션 수 조회 
> virt 1 

\\211.233.5.114 (쇼핑몰4 서버) i3shop/i3shop1140506 
\\211.233.5.115 (쇼핑몰5 서버) i3shop/i3shop1159121 
========================================================================================================= 

- 비밀번호 분실 
방갑순(b-sn26) T) * PWD: 460311 
========================================================================================================= 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
========================================================================================================= 

- [연말정산 결과]  
2004년 연말정산 결과(2004.1.2 ~ 12.31) 
급여: 25,532,240 
상여: 1,125,750 
계: 26,657,990(연봉) 
---------------------------------------------------------------------------------------------------------------- 

결정세액: 645,871 기납부세액: 579,440 
차감 징수세액: 66,420 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.03(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
장바구니TB 저장(신규, 수정) 
---------------------------------------------------------------------------------------------------------------- 

-- 장바구니TB 칼럼 수정  --------- 
ALTER TABLE T_CART MODIFY (  
   CART_DT CHAR(8)   NOT NULL /*  장바구니 일자  */     
 ); 
---------------------------------------------------------------------------------------------------------------- 

-- 장바구니TB 칼럼 추가  --------- 
ALTER TABLE T_CART ADD (  
CART_GB CHAR(2) NOT NULL, /* 장바구니 구분(01:장바구니, 02:찜기능) * 
UP_ID VARCHAR2(20)    , /* 수정자ID */ 
UP_IP VARCHAR2(20)    , /* 수정자IP */ 
UP_DT DATE      /* 수정일 */ 
 );    
========================================================================================================= 

-- 형전환(String -> int) 
String supply1="23"; 
Integer.parseInt(supply1); 
========================================================================================================= 

- 안심 공인인증서 에러 
안심 공인인증서 업그레이드 하는 과정에서 약간 시스템이 불안정 해졌음 
---------------------------------------------------------------------------------------------------------------- 
0808mdk 민덕기  *  
12개 상품 주문 
롯데 애니타임3000 2005-02-03   ---> 협력업체에서 자사배송 변경 요망 
---------------------------------------------------------------------------------------------------------------- 
* 백남숙 Active-Master   /  baek10 * 
카드결재가 되지 않고 계속적으로 보안 경고창이뜨고 
결재처리중입니다라는 메세지가 뜨면서 넘어가지않는다하심.  
안심클릭 등록다했고, 기존에도 주문을 하던 카드라고함. 

사용카드 : 신한카드  
카드번호 : 4658870067598725 
========================================================================================================= 

- R&F 상품주문 에러 
조경수(1004.mart.cc) 
========================================================================================================= 

- 제목: 안심 공인인증서 업그레이드 공지( /order/orderPutP_1.jsp) 
안심클릭 신용카드를 체크 후 다음을 클릭 하시면 
아래와 같이 주문서 작성 페이지 화면에 보안경고가 나오는데  
예(Y)를 꼭 클릭 하셔야 공인인증서 결제가 창이 뜹니다. 
주의: 안심클릭 창이 띄지 않으면 브라이저를 닫고 다시 주문을 하세요. 
========================================================================================================= 

- 사용한도 초과 에러(삼성카드) 
강복순(kbs55) 5310801000995709 / kkk450313 
========================================================================================================= 

- 공인인증 전화 번호 오류 난다고 하십니다. 
*-2932412 김영랑(rang52) 
조치후, TM연락 부탁 드리겠습니다. 
========================================================================================================= 
  
■■■■■■■■■■■■■■■■■■ 2005.02.04(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 00:30 

- 통합 수정
- 대금정산 매입가 오류 
PKG_MEIP_MAGAM 패키지  NO. 1 (MAGAM_GUBUN= 01:정상, MEIP_GUBUN= 01:쇼핑몰) 에서  @@@@@@@@@@ 
B.BUYING_PRICE AS MEIP_DANGA,  -->  
D.BUYING_PRICE AS MEIP_DANGA,  -- 매입단가(구매가) 
----------------------------------------------------------------------------------------------------- 

정상 0100012004112400301 
매입가: 925,000(--> 940,000) 판매가: 920,000 
T_ORDER_DTL 현금주문 =========> 2004년 11월 24일 주문 
BUYING_PRICE(매입가): 940,000 
T_ORDER_DTL 입금 확인 =========> 2004년 11월 25일 주문 
BUYING_PRICE(매입가): 925,000 
========================================================================================================= 

010001 20041124 00291  
010001 20050123 00169 
010001 20050116 00082 
========================================================================================================= 

019001 20050118 00007   
00007366  남양스템 그래누률 생 1단게 550g(백일부터 6개월까지)     
매입단가: 11,993원 --> 11,793원 
========================================================================================================= 

- 대경전기(31010) 
0190012005012600002 
========================================================================================================= 

- N건을 리턴하는 row를 찾는 방법은...  
select a.pk컬럼들 
         ,count(*) 
from tab1 a , tab2 b 
where a.col1 = b.col1 
group by a.pk컬럼들 
having count(*) > 1 
========================================================================================================= 

김미경    ant96322 0140-4514-6670 
국민카드 결재도중에 계속 결재에 실패했습니다라고 나온다하세요...  
isp등록도했고 결재선택할때 isp신용카드에 선택한것도 맞다 하시는데요.. 확인부탁드려요~ 

카드번호 : 5409-4700-0845-9027 국민 
========================================================================================================= 

- RAM 구매 
DDR SDRAM 512MB (PC3200/400MHz) 현금가: 79,000원 현금가: 83,000원 
http://www.hacker.co.kr/goods/goods_cont.asp?Cnum=2&Snum=113&LiType=0&SltValue=삼성전자&Gnum=5007 

- (주)이노시스템 
053-290-2253 대구광역시 중구 동문동 1-2(보조주소입력경동빌딩(하나로)) 
========================================================================================================= 

 ■■■■■■■■■■■■■■■■■■ 2005.02.05(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 

- 정수기 수정
* 권기선 Active-Master    /   kwon926 
삼성카드 사용 
카드번호 : 9410911245992900 
카드결재가 되지 않는다고함.  안심클릭 등록했다고 하심. 
결재처리중이라고 확인되다, 페이지 오류가 난다고함.  
확인후 연락드리기로함.   
------------------------------------------------------------------------------------------------------ 

* 권기선 Active-Master    /   kwon926 
로그 기록이 없고 전화 해보니 컴이 없는 환경이나 나중에 
해보고 전화 준다고 합니다. 
아마, 안심 공인인증서 보안 클릭을 제대로 안 해서 그런 걸로 추정 됨 
========================================================================================================= 

원주문번호: 0100012004032900604 
반품접수번호: 0100012005012600100 
0100012003111002526 --> 0100012003111002526 
대리님 이 주문번호가 잘못 이관되어 노란색으로 표시되어 있는데, 
이건 배송만 완료된건으로 주황색으로 바꿔주실수 있으신가요? 
==============================================================================================================

UPDATE T_BUYCOUNT M 
SET (M.RESELLER_AMT_T) = 
                    (SELECT B.RESELLER_AMT 
FROM T_BUYLIMITCOUNT B 
WHERE M.TIMES_CD = B.TIMES_CD --회차 
AND M.ITEM_CD = B.ITEM_CD 
AND M.TIMES_CD ='000001'  --회차 
) 
WHERE EXISTS 
  (SELECT 'x' 
  FROM T_BUYLIMITCOUNT B 
  WHERE M.TIMES_CD = B.TIMES_CD --회차 
    AND M.ITEM_CD = B.ITEM_CD 
    AND M.TIMES_CD ='000001'  --회차 
  ) 
; 
========================================================================================================= 
  
SELECT B.BILL_CHECK_YN, B.BILL_CHECK_DT 
FROM T_MAGAM_MEIP@IIISHOP_MAIN  B 
WHERE B.MAGAM_DATE >= '20050101' 
  AND B.MAGAM_DATE <= '20050203' 
  AND B.BILL_CHECK_DT IS NOT NULL 
; 
------------------------------------------------------------------------------------------------------ 

SELECT B.BILL_CHECK_YN, B.BILL_CHECK_DT 
FROM T_MAGAM_MEIP B 
WHERE B.MAGAM_DATE >= '20050101' 
  AND B.MAGAM_DATE <= '20050203' 
  AND B.BILL_CHECK_DT IS NOT NULL 
; 
------------------------------------------------------------------------------------------------------ 

SELECT B.BILL_CHECK_YN, B.BILL_CHECK_DT 
FROM T_MAGAM_MEIP B 
WHERE M.MERCHANT_CD = B.MERCHANT_CD 
AND M.MAGAM_GUBUN = B.MAGAM_GUBUN 
AND M.MEIP_GUBUN = B.MEIP_GUBUN 
AND M.MEIP_NO = B.MEIP_NO 
AND M.SEQ_NO = B.SEQ_NO 
AND B.MAGAM_DATE >= '20050101' 
AND B.MAGAM_DATE <= '20050203' 
AND B.BILL_CHECK_DT IS NOT NULL 
; 
------------------------------------------------------------------------------------------------------ 

 UPDATE T_MAGAM_MEIP@IIISHOP_MAIN M 
SET (M.BILL_CHECK_YN, M.BILL_CHECK_DT) = 
              (SELECT B.BILL_CHECK_YN, B.BILL_CHECK_DT 
FROM T_MAGAM_MEIP B 
WHERE M.MERCHANT_CD = B.MERCHANT_CD 
AND M.MAGAM_GUBUN = B.MAGAM_GUBUN 
AND M.MEIP_GUBUN = B.MEIP_GUBUN 
AND M.MEIP_NO = B.MEIP_NO 
AND M.SEQ_NO = B.SEQ_NO 
AND B.MAGAM_DATE >= '20050101' 
AND B.MAGAM_DATE <= '20050203' 
AND B.BILL_CHECK_DT IS NOT NULL 
) 
WHERE EXISTS 
  (SELECT 'x' 
   FROM T_MAGAM_MEIP B 
   WHERE M.MERCHANT_CD = B.MERCHANT_CD 
AND M.MAGAM_GUBUN = B.MAGAM_GUBUN 
AND M.MEIP_GUBUN = B.MEIP_GUBUN 
AND M.MEIP_NO = B.MEIP_NO 
AND M.SEQ_NO = B.SEQ_NO 
AND B.MAGAM_DATE >= '20050101' 
AND B.MAGAM_DATE <= '20050203' 
AND B.BILL_CHECK_DT IS NOT NULL 
  ) 
; 
========================================================================================================= 


SELECT   I3SHOP_ORDER_NO, ORDER_DT, ORDER_NO, ENTR_NO, ORDER_NM,  
                ORDER_TYPE, ORDER_STS, INSTALL_STS, DELIVER_STS, I3SHOP_ITEM_NM,  
                CASH_DT, REG_DT, USED_PARTS, USED_PARTS_QTY, PROC_DT, MOD_ID,  
                RETURN_DT 
FROM      T_ORDER 
WHERE   (RETURN_DT IS NOT NULL) 
ORDER BY REG_DT DESC 
; 
------------------------------------------------------------------------------------------------------ 

-- 오라클 DB 조회  @@@@@@ 
-- 정수기 주문 정보 TB 칼럼 추가  --------- 
ALTER TABLE T_DEPEND_ORDER ADD (  
RETRURN_DT CHAR(8) NULL /*  반품일자  */     
 );   
========================================================================================================= 

- 주문번호: 0100012003120900905 --> 반품주문번호: 0100012005020300142 
c.f) 주문번호: 0100012005020300142 --> 반품주문번호: 0100012003120900905 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.07(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 19:50 

- 정수기 수정
- 휘레쉬 미이관(03) 처리(기존 Excel로 보내는 걸 전산으로 처리) 
배송일자만 찍힌 것 --> 설치만 해야 될 건 
0100012003091601397   
배송일자: 20040918(변경 불가) 설치일자: 20041231 

배송일자, 설치일자 모두 안 찍힌 것 
0100012004080200438 
배송일자: 20040918 설치일자: 20041231 
------------------------------------------------------------------------------------------------------ 

 Sql = Sql + "   DELI_INSTALL_STS" = '02', "  '배송설치상태(02:설치만 해야 될 건) 
========================================================================================================= 

- 상품코드(00137113:52in 산소수기, 00142161:필터교환권(교환비용)) : I3SHOP_ITEM_CD 
========================================================================================================= 
 
■■■■■■■■■■■■■■■■■■ 2005.02.11(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 24:00 

- 쇼핑몰 수정
- 장바구니 담기(/cartPut.jsp)  @@@@@@@@@@ 
//장바구니에 넣을 입력 Hash 추출 (makeinputHash : request값을 itemHash(itemTypeVector포함)을 만들어 리턴 
inputHash = cart.makeInputHash(request,2);	 // 2=상품정보+유형정보를 분리 
---------------------------------------------------------------------------------------------------------- 

// 분리된 정보를 카드에 담기 
try {  
	<!-- //장바구니 데이타 T_CART 테이블 저장   //--> 
	<%@ include file="/cart/cartSaveDB_S.jsp" %>  

	//T_CART 테이블을 카트에 담기  
	resultHash = cart.addItemOnCart(inputHash); 
} 
----------------------------------------------------------------------------------------------------------

- 장바구니 리스트(/cart/cartGetP.jsp?p_cartshow=Y)  @@@@@@@@@@ 
수량 UP/DOWN(/cart/cartUpQty.jsp)  @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 

//카트에 담기 
 resultHash = cart.upQty(inputHash); 
----------------------------------------------------------------------------------------------------------

장바구니 삭제(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
String itemNo = (String)request.getParameter("itemNo"); 

//카트에서 삭제 
resultHash = cart.delItemOnCart(itemNo); 
========================================================================================================= 

수정된 부분 ========================= 
-- 휘레쉬 미이관(03) 처리(기존 Excel로 수동으로 보내는 걸 전산으로 처리) 
배송일자만 찍힌 것 --> 설치만 해야 될 건 
배송일자: 20040918(변경 불가) 
설치일자: 20041231   ===========> 후레쉬 워터에서 추가해야 할 날짜 
========================================================================================================= 
  
* 김유주Member    /   akki19 
사이버머니를 전혀 사용하지 않았는데  
사이버머니가 0원으로 표시되어있다고함... 
확인하니 사용내역도 없고.... 사이버머니 보유금액이 0원으로 
되어있음.. 확인후 연락드리기로함 
----------------------------------------------------------------------------------------------------------

* 김유주Member    /   akki19 
2004년 9월 이존 기존 사업자: Master --> 300백만 CMONEY 지급 
2004년 9월 신규 사업자: 노블CD 구매 회원 또는 Master --> 300백만 CMONEY 지급 
----------------------------------------------------------------------------------------------------------

주문을 2건을 주문했는데 사이버머니가 없는  
상품들을 구매해서 사이버머니가 0원으로 표시 됩니다. 
0100012003121200158 
0100012003122200160 
----------------------------------------------------------------------------------------------------------

-- 획득포인트 정보 조회 @@@@@@@@@@@@@ 
SELECT B.MNO, 
       B.ORDER_DT AS 주문일자, 
       B.ORDER_NO AS 주문번호, 
       B.CMONEY AS 사이버머니, 
       B.DIRECT_CMONEY AS 획득한_사이버머니, 
       B.SPEND_CMONEY AS 사용한_사이버머니 
-- SELECT * 
FROM T_MEMPOINT B 
WHERE B.MNO = '571607'   --회원번호(571607) 
; 
----------------------------------------------------------------------------------------------------------

--주문상세 정보 조회 @@@@@@@@@@@@@ 
SELECT ORDER_DT, ORDER_NO, 
       CMONEY AS 사이버머니, 
       ITEM_CD AS 상품코드, 
       ITEM_NM AS 상품명, 
       DIRECT_CMONEY AS 획득한_사이버머니, 
       SPEND_CMONEY AS 사용한_사이버머니 
-- SELECT * 
FROM T_ORDER_DTL 
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT = '20031212'     --주문일자--> 010001 20040827 00123 
AND ORDER_NO ='00160'   
ORDER BY ORDER_DT ASC 
--AND ITEM_CD ='00147906'  --상품코드 
;  
==============================================================================================================

- 반품 주문번호: 0100012004082700123(0100012004082700123) 
원주문번호: 0100012004072300545 
ORDER_STS ='29'  --주문상태(29:환불완료) 
SHIP_STS ='22'  --배송상태(22:물품회수완료) 
========================================================================================================= 

- 1월달...L&B수불장 다시조회해주세요... 
내일 아침에 부탁드릴께요. 
========================================================================================================= 

- 위스퍼 소프트클린 울트라 날개 중형 40(00150667) 
72 413856 
72 436,392(정확)    6,061 
-------------------------------- 

TRUNC((NVL(72,0) * NVL( 6,061,0)/1.1), 0) 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.12(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 19:00 

- 쇼핑몰 수정
- 장바구니 담기(/cartPut.jsp)  @@@@@@@@@@ 
//장바구니에 넣을 입력 Hash 추출 (makeinputHash : request값을 itemHash(itemTypeVector포함)을 만들어 리턴 
inputHash = cart.makeInputHash(request,2); //2=상품정보+유형정보를 분리 
----------------------------------------------------------------------------------------------------------

// 분리된 정보를 카드에 담기 
try {  
	<!-- //장바구니 데이타 T_CART 테이블 저장   //--> 
	<%@ include file="/cart/cartSaveDB_S.jsp" %>   

	<!-- //장바구니 데이타 T_CART 테이블 조회(DB 데이타 -> 세션)  //--> 
	<%@ include file="/cart/cartSelectDB_P.jsp" %> 

	//T_CART 테이블을 카트에 담기  
	resultHash = cart.addItemOnCart(inputHash);   
} 
----------------------------------------------------------------------------------------------------------

- 장바구니 리스트(/cart/cartGetP.jsp?p_cartshow=Y)  @@@@@@@@@@ 
수량 UP/DOWN(/cart/cartUpQty.jsp)  @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 

//카트에 담기(수량 수정) 
 resultHash = cart.upQty(inputHash); 
----------------------------------------------------------------------------------------------------------

- 장바구니 삭제(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
String itemNo = (String)request.getParameter("itemNo"); 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 

//카트에서 삭제 
resultHash = cart.delItemOnCart(itemNo, inputHash); 
==============================================================================================================

- 통합 수정
- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
if( editForm.p_repay_bank.value == "" ) { 
alert("환불계좌은행 필수 선택 사항입니다."); 
return false; 
} 
----------------------------------------------------------------------------------------------------------

환불계좌은행 미 선택 - 행랑발송예정  
이라고 하니 나중에 환불 계좌 은행 반듯이 표기 할 것 
----------------------------------------------------------------------------------------------------------
주문자 : 이성걸 
아이디 : egaon 
주문번호 : 0100012005020200749 

상담 내용 저장되지 않음.  
========================================================================================================= 

- 김진혁 대리 프린터 
\\210.123.133.148 (진태만/tama12) 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.14(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 20:00 

- 쇼핑몰 수정
- 장바구니 담기(/cartPut.jsp)  @@@@@@@@@@ 
// 장바구니에 넣을 입력 Hash 추출 (makeinputHash : request값을 itemHash(itemTypeVector포함)을 만들어 리턴 
inputHash = cart.makeInputHash(request,2); //2=상품정보+유형정보를 분리 
----------------------------------------------------------------------------------------------------------

// 분리된 정보를 카드에 담기 
try {  
<!-- //장바구니 데이타 T_CART 테이블 저장   //--> 
<%@ include file="/cart/cartSaveDB_S.jsp" %> 

Hashtable outHash_2 = new Hashtable(); 

if (outVec!=null && outVec.size()>0) { 
for (int i=0; i<outVec.size(); ++i) { 
outHash_2 = (Hashtable)outVec.elementAt(i); 

//분리된 정보를 카드에 담기 
try { 
//카트담기. PV가 있는 상품여부는 이곳에서 체크한다. 
resultHash = cart.addItemOnCart(outHash_2); 
} 
} 
} 
} 
========================================================================================================= 

- 장바구니 리스트(/cart/cartGetP.jsp?p_cartshow=Y)  @@@@@@@@@@ 
수량 UP/DOWN(/cart/cartUpQty.jsp)  @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 

// 카트에 담기(수량 수정) 
 resultHash = cart.upQty(inputHash); 
----------------------------------------------------------------------------------------------------------

- 장바구니 삭제(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
String itemNo = (String)request.getParameter("itemNo"); 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 

// 카트에서 삭제 
resultHash = cart.delItemOnCart(itemNo, inputHash); 
==============================================================================================================

-- 장바구니TB 칼럼 추가  --------- 
ALTER TABLE T_CART ADD (  
	OLD_QTY NUMBER, /*  기존 수량  */ 
	BONUS_ITEM_CL CHAR(2) /* 수당상품구분 */ 
);  
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.15(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 담기(/cartPut.jsp)  @@@@@@@@@@   
========================================================================================================= 

- SMS 관련 내부회의 
일시: 2.15(화) 10시 
모빌리언스(www.mobilians.co.kr) 최재혁 과장(*@*.*) 
T) 02-2192-2057 H) * 
임영식 주임(*@*.*) T) 02-2192-2163 
-------------------------------------------------------------------------------- ---------------------------------------- 

www.infosms.co.kr (foxhus/2475273)  
프로그램에 기존 G.W 모듈을 추가해서 모빌리언스 사이트로 SMS 문자 전송 
========================================================================================================= 

- 일시품절또는 판매종료된 상품입니다..  
너무 길면.. 일시품절 -inactive 상태 (온라인점) 
                판매종료 -delete 상태(온라인점) 
                판매종료 -전시상태에서 기간이 종료된것 
이렇게 3개지 타입으로 아이콘 또는 이미지 처리하시면 좋을듯 
하네요.. 
==============================================================================================================

- 통합 수정
기획매장 대카테고리 등록(/BizMgr/ItemWebMgr/categoryP.jsp) 
신규 하위카테고리 등록(/BizMgr/ItemWebMgr/categoryEditP.jsp?mode=new) 
대카테고리코드 V가 다 차서(V99) W01를 추가 
-------------------------------------------------------------------------------- ---------------------------------------- 

private String getFindByMaxCategoryCd(Hashtable inputHash, String maxCol) throws Err { 
if( categoryCd_2.equals("W")) { 
//상위 카테고리 일때만 적용  
int categoryCd = Integer.parseInt( maxCategoryCd.substring(1) ) + 1;   
retCategoryCd = "W" + formatToCategoryCd( 2, String.valueOf( categoryCd));   
} else if(maxCategoryCd.equals("V99")) { 
int categoryCd = 0; 
retCategoryCd = "W01"; 
} 
} 
========================================================================================================= 

- 김윤미   yoonmi01 
국민카드결재도중 에러 났다하시구요... (isp인증 받은카드임) 
카드번호 : 5585-2611-5393-0102  국민  
에러코드 : A12 /AA1 
========================================================================================================= 

- 배송일자, 설치일자 없애기 
0100012004082200250 
========================================================================================================= 

- /popup/popup_20050215.html 
가로:400, 세로:283 이구요~ 
팝업 공지 위치는 "쇼핑몰 메인"입니다. 
========================================================================================================= 
   
■■■■■■■■■■■■■■■■■■ 2005.02.16(수) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 
  
 - 통합 수정
- 출고 데이타 이중 찍힘 
0100012005021600408 
아참 대리님 아까 제가 드린 주문번호요. 
출고번호 157/158 중에 157을 삭제 부탁드려요. 
158로 방금 검수 햇습니다. 
-------------------------------------------------------------------------------- ---------------------------------------- 

MatchMoney 2005-02-16 14:18:06 
매치머니 프로그램상의 오류로 인해 출고 데이타 2번 직힌 것으로 판단됨  
출고번호: 20050216 00157 삭제 
========================================================================================================= 

- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp)  --> returnItemOrderEditP.jsp 
System.out.println("[/MemberSvcBean.java]:[searchMyPasswd]:[SQL]===> \n"+ SQL); 

- 상담내용 하구요.....환불계좌 내용하구요. 
반품사유요. 
========================================================================================================= 
  
- 115번 서버 날짜 세팅 에러 
2005년 2월 17일로 세팅 되어 있음(15시 30분 기준으로 18일로 변경 됨) 
2005년 2월 16일 17시에 날짜 수정(2005년 2월 17일 --> 2005년 2월 16일) 
2005년 2월 16일 승인 취소시 
원거래 번호를 찾을 수 없습니다.(666) 
나오면 나이스 정보 통신에 연락 할 것(02)2187-2778 윤정호 대리) 

2005년 2월 16일 건수 
3596(R&F): 3건 3597(L&B): 25 건 
------------------------------ 
- 카드 취소 
L&B 주문번호: 0100012005021600560 
========================================================================================================= 

- 정수기 수정
0100012004101900164 
13120, 14971 삭제 
CASH_DT: 20041019 --> 20041026 
---------------------------------------- 

- 주문자 미확인 상품코드 강제 설정 
I3SHOP_ITEM_CD = '00137113', I3SHOP_ITEM_NM = '52in 산소수기' 
이순나/임민택 2/15일자 접수건  
이건 분명 주문자 미확인건으로 a/s 접수된건인데~ 
후레쉬에서는 필터교환권 발주에, as가 접수된것처럼 보인다고 하세요~ 
========================================================================================================= 

- 자인방문 
10:00 회사 출발(효원씨 차) 
11:00 자인 도착 
11:10 오라클 클라이언트 설치, VNC 설치 
11:50 Happy 자인 프로그램 설치(실패) 
12:30 점심 
14:00 자인 출발 
15:00 귀사 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.17(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:30 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 담기(/cartPut.jsp)  @@@@@@@@@@ 
<!-- //장바구니 데이타 T_CART 테이블 저장   //--> 
<%@ include file="/cart/cartSaveDB_S.jsp" %>  
-------------------------------------------------------------------------------- 

1. 노블레스 몰에 대한 장바구니 혼동 여부 체크 및 셋팅 
장바구니에 담기고자 하는 상품이 노블레스 상품 이라면 다른 것과 같이 안 담겨야 한다. 
사업권 매장과 킬러앱 매장도 서로 같이 담기면 안된다. 
2. 수당상품구분(L&B상품, R&F상품) 

- 장바구니 List(/cartGetP.jsp)  @@@@@@@@@ 
<!-- //장바구니 데이타 T_CART 테이블 조회   //--> 
<%@ include file="/cart/cartSelectDB_P.jsp" %> 
-------------------------------------------------------------------------------- 

- include: 별개의 파일로 인식 
<!-- //장바구니 데이타 T_CART 테이블 조회   //--> 
<jsp:include page="/cart/cartSelectDB_P.jsp" flush="true" />   
-------------------------------------------------------------------------------- 

- include: 하나의 파일로 인식 
<!-- //장바구니 데이타 T_CART 테이블 조회   //--> 
<%@ include file="/cart/cartSelectDB_P.jsp" %>  
-------------------------------------------------------------------------------- 

-- 장바구니TB 칼럼 추가  --------- 
ALTER TABLE T_CART ADD (   
DISPLAY_CD CHAR(2) /* 전시유형(01,02,03: L&B, 11:R&F, 31:I3MART, 41:공동할인매장, 51,52,5354:기획매장)  */  
); 
========================================================================================================= 

- SMS 모빌리언스 테스트 계약서 보냄(메일)  
모빌리언스(www.mobilians.co.kr) 최재혁 과장 
T) 02-2192-2057 H) * 
신청 아이디: i3shop/757913 
========================================================================================================= 

- PDA 1대 고장 
검품2 PDA(정영진: 정우 하이테크(*)) A/S 맡김 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.18(금) 작업 ■■■■■■■■■■■■■■■■ ---> 08:40 ~ 24:00 

- 쇼핑몰 수정
- 유형정보 에러 
장바구니 수정(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));   //회원번호 
  
//카트에 담기(수량 수정) 
resultHash = cart.upQty(inputHash); 
========================================================================================================= 

- Hash ->Vector로 형전환 
<%@page import="java.io.*,java.util.*,java.rmi.RemoteException,com.daco.util.*,com.daco.exception.*,com.
gauce.*,com.gauce.io.*,com.gauce.log.*,com.gauce.common.*" %> 
<%@ page import="com.i3shop.ejb.BizStore.BoardSvc.*" %> 

Vector p_itemTypeVec = (Vector)cartOutHash.get("p_itemTypeVec"); //Hash속에 포한된 Vector Vector로 전환 

if (p_itemTypeVec!=null && p_itemTypeVec.size()>0) { 
for (j=0; j<p_itemTypeVec.size(); ++j) { 
tmpTpHash = (Hashtable)p_itemTypeVec.elementAt(j); 
p_tp_no = util.getData("p_tp_no", tmpTpHash);  //유형번호 
p_tp_nm = util.getData("p_tp_nm", tmpTpHash);  //유형명 
p_tp_dtl_no = util.getData("p_tp_dtl_no", tmpTpHash);  //유형상세번호 
p_tp_dtl_nm = util.getData("p_tp_dtl_nm", tmpTpHash);  //유형상세명 
} 
} 
========================================================================================================= 
  
[/cartSaveDB_S.jsp]:[inputHash] ############## ========== > 
{p_company_cd=01, p_point=0, p_store_cd=S001, p_use_cmoney=0, p_bv=590, p_cmoney_useyn=N, p_direct_cmoney=0, p_gift_yn=N, 
p_reseller_price=116500, p_merchant_cd=0001, p_category_cd=T01070902, p_direct_money=0, p_ship_cl_cd=03, p_bonus_item_cl=01, 
p_itemTypeVec=[{p_item_cd=00021510, p_tp_no=3, p_tp_dtl_no=2, p_tp_nm=칼라, p_tp_dtl_nm=라이트 옐로우}],  
p_gift_no=0, p_gift_nm=0, p_cyberpv=0, p_sale_price=117000, p_item_nm=쿠쿠 전기 압력 밥솥 CRP-B1060S/SY,  
p_limit_sale_yn=N, p_c_saleprice=0, p_old_qty=0, p_sale_max_qty=0, p_qty=1, p_cyberbv=0, p_gift_seq_no=0,  
p_bank_pv=0, p_consumer_price=0, p_pv=590, p_ar_way_cd=03, p_display_cd=01, p_sale_min_qty=1,  
p_item_cd=00021510, p_limit_sale_qty=0} 
========================================================================================================= 

inTpDtlNo = (String)getReqData("p_type_" + tmpTpNo, req, 4); //4=null 
System.out.println("[/CarBean.java]:[req]"+ req); 
System.out.println("[/CarBean.java]:[tmpTpDtlNo]"+ tmpTpDtlNo);   
System.out.println("[/CarBean.java]:[inTpDtlNo_새로 생성]"+ inTpDtlNo); 

[/CarBean.java]:[tmpHash]{ITEM_CD=00021496, TP_DTL_NO=1, TP_NO=3, TP_NM=칼라, TP_DTL_NM=레드, MEMO_DESC=} 
[/CarBean.java]:[req]com.evermind.server.http.EvermindHttpServletRequest@15731d6 
[/CarBean.java]:[tmpTpDtlNo]1 
[/CarBean.java]:[inTpDtlNo_새로 생성]1  
-------------------------------------------------------- 

[/CarBean.java]:[tmpHash]{ITEM_CD=00021496, TP_DTL_NO=2, TP_NO=3, TP_NM=칼라, TP_DTL_NM=라이트 그레이, MEMO_DESC=} 
[/CarBean.java]:[req]com.evermind.server.http.EvermindHttpServletRequest@15731d6 
[/CarBean.java]:[tmpTpDtlNo]2 
[/CarBean.java]:[inTpDtlNo_새로 생성]1 
========================================================================================================= 


[/CarBean.java]:[tmpHash]{ITEM_CD=00021496, TP_DTL_NO=1, TP_NO=3, TP_NM=칼라, TP_DTL_NM=레드, MEMO_DESC=} 
[/CarBean.java]:[req]com.evermind.server.http.EvermindHttpServletRequest@15731d6 
[/CarBean.java]:[tmpTpDtlNo]1 
[/CarBean.java]:[inTpDtlNo_새로 생성]null 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.19(토) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 20:30 

- 쇼핑몰 수정
- 유형정보 에러 
장바구니 수정(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 
  
//카트에 담기(수량 수정) 
resultHash = cart.upQty(inputHash); 
========================================================================================================= 

[/CarBean.java]:[tmpHash]{ITEM_CD=00021496, TP_DTL_NO=1, TP_NO=3, TP_NM=칼라, TP_DTL_NM=레드, MEMO_DE90SC=} 
[/CarBean.java]:[tmpTpDtlNo]1 
[/CarBean.java]:[inTpDtlNo_새로 생성]null 
[/CarBean.java]:[tmpHash]{ITEM_CD=00021496, TP_DTL_NO=2, TP_NO=3, TP_NM=칼라, TP_DTL_NM=라이트 그레이, MEMO_DESC=} 
[/CarBean.java]:[tmpTpDtlNo]2 
[/CarBean.java]:[inTpDtlNo_새로 생성]null 

[/CarBean.java]:[tmpHash_결과]{ITEM_CD=00021496, TP_DTL_NO=2, TP_NO=3, TP_NM=칼라, TP_DTL_NM=라이트 그레이, MEMO_DESC=} 
[/CarBean.java]:[itemTypeVec.size()]0[itemTypeVec][] 
/* =============================================================================== */ 

dlog("[/CartBean.java]::[getSaleTotalQtyArr()]::[SQL]===>\n"+ SQL);  

if (retStr.equals("ok")) { 
	//같은 상품에 유형들도 모두 같고 해당 유형들의 값도 모두 같으므로 수정할 주문을 찾은것임 
	//찾은 내용의 갯수를 inputHash의 갯수로 바꿔준다. 
} 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.21(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 유형정보 에러 
장바구니 수정(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));    //회원번호 
  
//카트에 담기(수량 수정) 
resultHash = cart.upQty(inputHash); 
========================================================================================================= 

- 수도 검침 
수용가 번호: 100-1950 
동명: 신천4동 461-4 
담당자 HP)016-414-1637  Tel)951-0091  953-0091 
------------------------------------------------- 
2004년 12월 2247 
2005년 01월 2252 
2005년 02월 2249 
========================================================================================================= 

- 0100012005022100020 
(K)하기스골드3단계 남아용 76개입×3 증정 18팩기저귀(00029937)   
========================================================================================================= 

- i3넷텟 회원 가입(전화료 3천원)  
tamario26 / tama12  
========================================================================================================= 

- 대구 회사(중견 기업) 
삼립, 평화산업, 화신, 경창 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.22(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 24:00 

- 쇼핑몰 수정
- 유형정보 에러 
장바구니 수정(/cart/cartDel.jsp) @@@@@ 
//입력정보 분리 
inputHash = cart.makeInputHash(request,3); //심플상품정보+유형정보를 분리 
inputHash.put("p_mno", (String)util.getSesValue("MNO", request));   //회원번호 

//카트에 담기(수량 수정) 
resultHash = cart.upQty(inputHash); 
========================================================================================================= 
  
- 신용카드 에러(안심결제 새창 안뜸) 
삼성카드 결재중 마지막 단계에서 페이지 오류난다고하세요. 
김성순    bigmall26 
삼성카드번호: 4047-2820-0988-0007 
------------------------------------------------------------------------------------------ 

마지막 안심결재 비밀번호 입력후 결재하기 버튼 누르면 페이지가 오류난다고 나오구요..  
그컴텨에서 다른쇼핑몰 다 결재된다하시는데... 우리만 안된다고...  
특정상품은 없는거 같아요..  
R&F / L&B / 마트 여러가지 시도하셨다하세요.  
김성순   * 
========================================================================================================= 

- 외환카드 재발급 신청 
현혜진(콜 담당) 
========================================================================================================= 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
월수당 지급 내역(MM이상 직급자) 
------------------------------------------------------------------------------------------ 

- 월수당 명세서(/admin/allowance/allowancemonthP.jsp) 
- 일수당 명세서(/admin/allowance/allowanceMasterP.jsp)  
========================================================================================================= 

- 환불금 확정 전으로 되돌리기(현금 -> 카드로 변경) 
0100012005020400384  --> 010001 20050221 0036 
회원명: 이혜선 32,100 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.23(수) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 24:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
월수당 지급 내역(MM이상 직급자) 
최낙문(e-i3sho2) * 
------------------------------------------------------------------------------------------ 

- SMS전송 정보 TB 생성, SMS전송 메세지 정보 TB 생성 
------------------------------------------------------------------------------------------ 

진태만님의 2004년 12월 월수당 지급 내역은 3,000,00원 입니다.  
-From i3shop 
========================================================================================================= 

권석현PM * 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.24(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
월수당 지급 내역(MM이상 직급자) 
최낙문(e-i3sho2) *  
========================================================================================================= 
   
오순열 0100012005022300378  
신한 및 엘지(해외) 일부 제휴 카드의 경우 실시간 승인취소 불가 
강미숙(02)2187-2746) 전화 통화 요망  
------------------------------------------------------------------------------------------ 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
==============================================================================================================

- 정수기 수정 확인 
양정미/양의용 gogo2126 0100012003121000713 
========================================================================================================= 

- 국민수퍼정기예금(617415-20-17549) 3천만원 해지 
해지: 2005년 2월 24일 
이자: 22만원 
------------------------------------------------------------------------------------------ 

- 은행 신탁 예금 
대신 STAR-ELS 채권투자신탁 3호(통장번호: 617455-90-006984, 계좌번호: 617455-04-007573) 
펀드유형: 채권형 생계형저축 
신화자: 3천 만원(대신증권: 2% 이자 보장)--> 2005년 9월 5일 
기준지수: 2005년3월7일 한국증권거래소가 발표하는 Kospi200 종가지수 
만기지수: 2005년9월1일 한국증권거래소가 발표하는 Kospi200 종가지수 
KOSPI200 127.81(2005년2월24일) KOSPI 987.1(2005년2월24일) 
기준지수: 2005년3월7일===> KOSPI200 
만기지수: 2005년9월1일===> KOSPI200  
------------------------------------------------------------------------------------------ 

kospi200은 증권거래소에 상장된 종목 중 200개 대표종목을 따로 뽑아서 
지수를 산정한 것입니다. 
신문이나 TV뉴스에서 보통 사용하는 지표는 증권거래소 전체 종목을 이용한 
종합주가지수이지만 신문 증권란의 위쪽을 보시면 각종 지표가 쓰여 있는데 
여기에 kospi200 지수도 항상 같이 쓰여 있습니다. 
kospi200은 선물거래의 기본이 되기 때문에 매우 중요한 지수입니다. 
따라서 모든 증권관련 정보에서는 이 지수를 제공하고 인터넷 증권 사이트들도  
당연히 이 지수가 같이 나옵니다. 
------------------------------------------------------------------------------------------ 

- 미래에셋 3억만들기 인디펜던스 주식형 K-1호(통장번호: 617455-90-007006, 계좌번호: 617455-04-007599) 
펀드유형: 주식형 일반 
자동이체 월 10만원 
3개월 지나면 수수료 면제 
저축기간: 60개월 
========================================================================================================= 

- 양복 구매 
크리스찬 오자르 정장 25만원 
========================================================================================================= 

■■■■■■■■■■■■■■■■■■ 2005.02.25(금) 작업 ■■■■■■■■■■■■■■■■
---> 08:20 ~ 23:30 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
월수당 지급 내역(MM이상 직급자) 
최낙문(e-i3sho2) *  
가입자 ID/PWD(i3shop/757913) 
------------------------------------------------------------------------------------------ 

- 문자 잘라내기(substring) 
String p_search_dt_from = request.getParameter("p_search_dt_from");  
String p_sudang_dt = p_search_dt_from.substring(0, 6); //수당년월 
========================================================================================================= 

- 쇼핑몰 수정
- 내려진 상품 구매한 건 
원주문번호: 0100012005022400528  반품주문번호: 0100012005022500211 
00025270 위스퍼 그린 울트라슬림 중형(날개형)40P 6,690원 ---> 내려진 상품 
00009887 위스퍼 울트라 후레쉬 소형(날개형) 32P ---> 내려진 상품 
00150672 위스퍼 뉴 그린 울트라 날개 중형 40개입 7,050원  

- 예상 URL 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T02020401&p_item_cd=00025270&p_display_cd=31 
  
-  위스퍼 뉴 그린 울트라 날개 중형 40개입 URL 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08020102&p_item_cd=00150672&p_display_cd=01  
=================================================================================================== 

- 주문자: 김선녀  (id:  tjssutmdgks ) 반품번호:00211 --> * 
상위직급자: 심규봉(iesinna02) 
20050224, 김선녀, 0100012005022400528, 20050224 
-마트건 전체 반품하는걸로 해서 카드취소해야되는데 
마트 정순씨가 부분 반품접수 잡은건으로  현재 물품회수완료 
상태인데요, 반품접수상태나 신청상태로 돌려주시면 다시 
전체 반품으로 잡아야된다시네요~ 

- 위스퍼 그린 울트라슬림 중형(날개형)40P URL 
http://iesinna.i3nara.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T02020401&p_item_cd=00025270&p_display_cd=31 
=================================================================================================== 

- 노블레스CD 구매 
주문취소 후 다시 주문할 때 
7849 김성미 
CD회원_구분( 02:CD미구입 신규회원) 
CD구매여부(00:미신청) 으로 처리 
=================================================================================================== 

- 주문입력 실패 
카드승인 실패: CAVV데이타 오류(8900) 
=================================================================================================== 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석 
02)2187-2773 김재영 과장: 현금영수증 담당 
=================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2005.02.26(토) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 13:00 

- 쇼핑몰 수정]  
- 내려진 상품 구매한 건 
*주문자: 김선녀  (id: tjssutmdgks) 
김선녀씨와 통화를 해본 결과 I3MART 비식품 사이트에서  
위스퍼 그린 울트라슬림 중형(날개형)40P 상품이 보여서 주문을 했다고 합니다. 
이런 경우 담당 바이어가 실수로 상품을 다시 올렸을 가능성 높습니다.  
우리 사이트에서 과거 URL로 주문을 하면 절대 주문이 불가능 합니다. 
-------------------------------------------------------------------------------------------------------- 

- 위스퍼 그린 울트라슬림 중형(날개형)40P URL(과거 내려진 상품) 
http://iesinna.i3nara.cc/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T02020401&p_item_cd=00025270&p_display_cd=31 
==============================================================================================================

- 신용카드 오류 
하나비자카드 결재도중 승인실패라고 나온데요..  
400여만원 결재시도하셨구요.. 공인인증 안심클릭신청 다~ 한카드라하시네요. 
임승식     real0104    
카드번호 : 4570-7813-3400-1108 
-------------------------------------------------------------------------------------------------------- 

- 8883 허가된 거래가 아님 2005-02-25 18:27:20 
카드사에 본인이 직접 전화 해서 문의 해야 됩니다. 
========================================================================================================= 

아이디 : kky74 
전화 :* 
사유 : 주문후 카드 결재하면-> 카드승인 실패 라고 나온답니다. 
오류번호 : 0071 
확인 부탁드립니다 
-------------------------------------------------------------------------------------------------------- 

0071 전화요망(080-520-4288)-비씨 kky74 
*로 통화를 해서 결과를 통보 했습니다. 
========================================================================================================= 

최연숙   71gold 
카드번호: 9410-0658-7875-9123  
카드승인에 실패했습니다. 아래사항을 확인해주세요. 오류번호가 0071이라 하세요..  
========================================================================================================= 

- 비씨 카드 결제 장애 안내 
새로운 시스템 도입으로 인한 오류로 현재  
비씨카드 결제가 지연되고 있습니다.  
조치를 통해 빠른 정상화가 될수 있도록 노력하겠습니다.  
-------------------------------------------------------------------------------------------------------- 

- 비씨 카드 결제 장애 안내 팝업창 띄우기 
popup_20050226.html 가로: 400,  세로: 233 
========================================================================================================= 

- 신용카드 결제 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리, 이재용 ---> 02)2187-2740 박정근 대리(i3shop담당): * ---> 526-8328 안창석  
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2) 
-------------------------------------------------------------------------------------------------------- 

- 비씨 카드 02)520-4724  시스템 사업팀) 이종철 
========================================================================================================= 

\\211.233.5.114(쇼핑몰4 서버) i3shop/i3shop1140506 
\\211.233.5.115(쇼핑몰5 서버) i3shop/i3shop1159121 
\\211.233.5.116(쇼핑몰6 서버) i3shop/i3shop1160506  
========================================================================================================= 
  
■■■■■■■■■■■■■■■■■■ 2005.02.28(월) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:40 ~ 23:00 

- 통합 수정
- SMS 전송관리(/BizMgr/SMSMgr/smsListP.jsp) 
========================================================================================================= 

- 상품마스타관리(구버젼) (/BizMgr/ItemMgr/itemP.jsp) 
상품유형(/BizMgr/ItemWebMgr/itemTypeEditP.jsp) 
카시오 전자사전(00151773)  
항목값: 패딩케이스+카시오노트+KT웹하드쿠폰 

-- 상품 유형 정보TB 칼럼 수정(늘이기)  --------- 
ALTER TABLE T_ITEM_TYPE MODIFY (  
   TP_DTL_NM VARCHAR2(200) /*  항목값  */ 
 ); 
==============================================================================================================

* 김지현Active-Master / jinjoo22 
외환카드결재 안된다고함. 
카드번호 : 9410005259297103 2005-02-28 
-> 안심클릭정상적으로 등록을했다고함.  
 오전부터 지금까지 계속 결재가 안되고 있다고함. 
 안심클릭 비밀번호 입력하는 창이 나오긴한데... 
 비밀번호를 입력하기전에 창이 사라져 버린다고함. 
 확인후 연락드리기로함.    * 
========================================================================================================= 

- 방금 문의드린 카드결제시 처리중이라고만 계속뜨고 페이지 
오류난다는건입니다,바쁘시겠지만 확인부탁드립니다~~ 
*성명: 오현정   *아이디;  pig26   *비번 : 991226 
* 카드정보:  엘지카드 *소유주 : 이승환 
* 카드번호: 4009- 0517- 1804-6010   
========================================================================================================= 

- 직불카드 결제 가능 
나이스 정보통신에 문의한 결과  
직불카드도 결제가 가능 
========================================================================================================= 

- 시스템 날짜 오류 
soonho 배숙희 0100012005022801081 -> 반품건 
이분 오늘 주문인데 카드승인은 3.1일 날자로 되어있는데요. 
확인좀 부탁드립니다. 
-------------------------------------------------------------------------------------------------------- 
서버 세팅시 시스템 날짜 잘못 세팅해서 그런 걸로 추정 됩니다. 
==============================================================================================================

- 외환카드 수령(안심클릭 등록) 
9410-0047-6064-9621 
2010/10 (***9) 
tama5201 
========================================================================================================= 

- 한의원 진료 
14:00 ~ 15:00 침 맞기, 피 빼기, 찜질  
4천원(의료보험증 지참) 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
