

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2005.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2005.08.01(월) 작업 ■■■■■■■■■■■■■■■■■
---> 06:00 ~ 02:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>가맹점 코드(KSNET R&F: 2002100297/32871, KSNET L&B: 2002100298/32871)  
------------------------------------------------------------------------------------------------------ 
- 김명석 과장(3420-5916, *)  ===> 사업부 
3420-5951  박영준 대리 5994 
==============================================================================================================

- 나이스 결제 확인 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02)2187-2745 박재준(마케팅 팀장) 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

BC카드(강금순 주임) 
ISP: hope0404 
94103170XXXX7627 
------------------------------------------------------------------------------------------------------ 
- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama3**  
==============================================================================================================

권영남       k-mh01 
카드번호 : 9410-4897-4436-8010 국민 
김기윤 (gold69)국민카드라고하는데 BC카드에대한내용이 뜬다고 이상하다고하세요. 
==============================================================================================================

9420 9020 5261 6300  --> 9420902052616300 
9420 9020 4848 7300 --> 9420902048487300 
==============================================================================================================

9420 9020 4848 7300  --> 이카드번호는 
노주임님께 확인하니 승인거절로 나온다고 하시네요., 
일단 카드사로 다시 확인해봐야될것같구요., 
i3훼미리 카드인경우 나이스페이 라고 하시네요~~ 
==============================================================================================================

이주은           joo68           Silver-M 
비씨카드 결제가 되지 않는다며 문의? ( R&F매장에서 결제, 기존 80만원 결제한거 있어서 220만원선 안에서 결제하는데, 
자꾸 한도 초과되었다고 나온다심 -> 그 카드 자체는 한도가 700만원 정도라고 하심) 
카드번호: 4553-2126-0351-8543  비씨카드 
==============================================================================================================

박경희           park601          Member 
카드번호: 4553-2126-0351-8543  비씨카드  
-> 아까 전달해 드린 아이디 말고, 이분건에 대한 한도거든요... 
잘못 전달해드렸네요....다시 확인부탁드립니다... 
번거롭게 해드려 죄송...ㅜ.ㅜ; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.02(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 01:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- BC카드 한도 초과(ISP결제상의 문제) 
suk4269 이명숙 
==============================================================================================================

%%    김성숙   woochan26  Gold-M  
국민카드 결재하는데 거래불가승인이 난다고하시며 문의?  
isp등록되었으며 공인인증 발행받은상태 
카드번호: 5409-8851-0947-6010   
==============================================================================================================

- 게이트웨이 무료설치 기능이 사라졌어요  --> 반품 
ksi21 주문번호: 0100012005072200202  
==============================================================================================================

- Oracle DB 부하 관리 
http://210.123.133.7/worm/index.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.03(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- world56 
0100012005080100029 --> 0100012005080100029 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.04(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
기타 신용카드(시티/축협/농협) 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- BC카드(강금순 주임) 
ISP: hope0404 
94103170XXXX7627 
------------------------------------------------------------------------------------------------------------------  
- LG카드(큰 매형)  =============> 
9410 8032 5526 9007(9410803255269007) kijin00/tama3**  
==============================================================================================================

진태만 대리님 KS넷에서 PG대행 아이디 부여해 준 겁니다. 
오늘중으로 테스트 해보시고, 연락주세요. 
그리고 엘지카드 가맹점 코드는 오후쯤 알려드릴테니 그때 테스트 해주세요. 
Ksnet 온라인 인증(안심클릭)결제용 상점id 전달해 드립니다. 
상호: ㈜ 아이쓰리샵 
상점id: 2001100849 
패쓰워드: 000034 
테스트 가능 카드: 외환,롯데,신한(3개 카드만), 삼성카드는 제외 
해당 카드 승인테스트 후 반드시 취소처리 해주시기 바랍니다. 
==============================================================================================================

상품판매관리서 소비한 상품을 소비등록을 하려는 데 주소지 쓰는 부분에서 계속 페이지 오류가 
나서 소비등록을 할 수가 없네여 빠른 조치 바랍니다... 
*@*.* -->  4d2.i3city.cc 
리셀러어드민에서 판매용구매한후 소비등록하는것 말하는것 같은데요 
==============================================================================================================

- KSNET 결제 확인 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>가맹점 코드(KSNET R&F: 2002100297/32871, KSNET L&B: 2002100298/32871)  
------------------------------------------------------------------------------------------------------------------  
- 김명석 과장(3420-5916, *)  ===> 사업부 
02)3420-5951  박영준 대리  ===> 전산 
==============================================================================================================

- 나이스 결제 확인 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
02)2187-2778 윤정호 대리(*@*.*) ---> 02)2187-2740 박정근 대리(i3shop담당): * 
02)2187-2745 박재준(마케팅 팀장) 
02-2187-2822 임희영(*@*.*): 고객지원팀 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

이정미    ilguk01 
BC카드결재 도중에 A1E라는 에러코드확인된다고하세요...  
확인부탁드립니다..  
카드번호 : 9430-2540-0428-2905 BC 
==============================================================================================================

- [IT 개발팀 공지] 
안녕하십니까. 
저희 회사 신용카드 PG사 변경 관계로 급하게 해당 카드를 구하고 있습니다. 
결제 후 바로 취소해 드립니다.  
기타 신용카드(시티/축협/농협) 
그럼 오늘 하루도 수고하십시오 ( _ _) 
==============================================================================================================

- 안심클릭 카드 
신한카드(4518420072490912):hw0681lee 이혜원 ---> 미등록PG 업체 
롯데카드(377994746862001):ho0634 김중호 ---> OK 
외환카드(4599005262385600): 임미옥 ---> OK 
LG카드(9410803255269007): kijin00/tama3** 큰 매형 
삼성카드(4009131101338271): l480617 이정애  
==============================================================================================================

ks넷 담당자 연락처 가르쳐 드릴께요 
신재혁 대리 : 02-3420-5862 
테스트 하다가, 안되면 문의하라고 했으니 전화해 보세요 
==============================================================================================================

- KSNET 결제 확인 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  메인 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999))  
KSNET_안심3C 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 신한, 외환(안심) 
------------------------------------------------------------------------------------------------------------------
LG카드 직가맹점 코드(R&F:233429911, L&B:38080248)  ---> 메인 상점ID로 사용 
==============================================================================================================

- 외환, 롯데, LG  ---> OK 
신한  ---> 미등록PG 업체 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.05(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
기타 신용카드(시티/축협/농협) 
축협/농협 --> N-일반인증승인, 시티 --> 안심클릭 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

수고많으십니다.. 카드결재하는데 페이지 오류가 뜬다고합니다. 확인부탁드립니다.. 
송미경     smg1200 *  
9420-9020-8550-7600  삼성올앳카드  
==============================================================================================================

1. 직가맹 거래 (BC, 국민, LG) ===> KS넷 Van망 이용 
  R&F 상점ID : 2002100297 / 32871 
  L&B 상점ID : 2002100298 /32871 
2. PG대행 거래 (롯데, 신한, 외환, 기타 카드) 
   ==> 현재 나이스 Van망 이용중이나 8/8일경 KS넷 Van망으로 변경 예정.  
3개사 상점ID : 2001100849 / 000034 (현재 R&F, L&B모두) 
 --> 상점 ID 1개 더 부여 받아 R&F, L&B 구분 예정 
* BC카드는 상시 2개월 무이자 입니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.06(토) 작업 ■■■■■■■■■■■■■■■■
---> 06:40 ~ 20:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
기타 신용카드(시티/축협/농협) 
축협/농협 --> N-일반인증승인, 시티 --> 안심클릭
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- 정수기 수정 
0100012005072500471 정수기 7/26 결제완료 
주문자 피재하 
==============================================================================================================

- 프린트 출력 에러(cc_cExcelPrint.dll 파일 문제) 
ADO 참조를 사용하셨다면 "프로젝트->참조"에서 ActiveX Data Object 항목의 버전을 확인 
--------------------------------------------------------------------------------------------------------------- 
1. GoldStore 프로그램 
GoldStore 에서 --> ActiveX Data Object 2.5 Library(msado25.tlb) 
MDAC_TYP.EXE 버전(ActiveX Data Object 2.0) 
msado25.tlb 파일을 Package에 추가하여 만듬 
--------------------------------------------------------------------------------------------------------------- 
2. 정수기_VB 프로그램 
DEPEND 에서 --> ActiveX Data Object 2.0 Library(msado20.tlb) 
MDAC_TYP.EXE 버전(ActiveX Data Object 2.0) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.08(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
안심클릭, 기타 카드(N-일반인증승인) 
기타 신용카드(시티/축협/농협) 
축협/농협 --> N-일반인증승인, 시티 --> 안심클릭 
==============================================================================================================

- 공인인증서 수정(신용카드) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
==============================================================================================================

- 인라인뷰 
내 생각엔 이 부분을...  
from 절에서 inline view 로 해결해서..  
select 절에는 결과값만 불러오도록 고치는 것 이 좋을것  
==============================================================================================================

- 협력업체(비즈포탈: 박윤수 차장) 
드리미(pyunsu/2530249) 
==============================================================================================================

- i3shop 모바일(일수당 내역) 수정 ==> http://coca.1004.cc/mobile/wagelistDay.jsp 
- 일수당 명세서 리스트 =====> 현재월에서 가장 최근 매출 마감일, 기지급 분 수당만 보여 주기 
http://test.mart.cc/mobile/wagelistDay.jsp?from=0&count=10&date1=20050601&date2=20050831 

<wagelistDay> 
	<from><%=from%></from> 
	<to><%=p_to_int%></to> 
	<total><%=totcnt%></total><% 
	if (dataVec.size() > 0 ) { 
	for(int i=0; i < dataVec.size(); i++) 
	{ 
	rowHash = (Hashtable)dataVec.elementAt(i); 
	%> 
	<item> <!--수당 지급 내역 리스트 --> 
	<index><%=util.getData("ROWNUM",rowHash)%></index> <!--인덱스--> 
	<takedate><%=util.getData("TAKE_DT",rowHash)%></takedate> <!--매출일 (yyyymmdd)-->  
	<date><%=util.getData("PAY_DT",rowHash)%></date>  <!--지급일 (yyyymmdd)-->  
	<name><%=util.getData("TOT_REAL_PAY",rowHash)%></name> <!--실지급액--> 
	</item><% //out.println("<br>"); 
	} 
	} 
	%> 
</wagelistDay> 
===================================================================================================================

- 오미진 SM 
===================================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.09(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:00 

- 쇼핑몰 수정
- KSNET 결제 수정 
LG카드 KSNET 이관 완료 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
==> 메인 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999))  
KSNET_안심3C 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 신한, 외환(안심) 
==============================================================================================================

* 김미경 / kim877a     [ 주민번호 : 740207 - 20 ] 
 질문 : 어릴적 별명은?    답: 맞짱이 
==============================================================================================================

- 정수기 수정 
오류데이터 수정(66건) 
주문구분(00:접수취소) 추가 
0100012005041800207 --> 17086 
==============================================================================================================

- 큰 누나 프린터 주문 도착 
(K)롯데캐논 잉크젯 프린터 IP1000 Plus 52,000 원(i3 킬러앱 매장) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.10(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- KSNET 이관 완료(삼성카드 제외) 
- 공인인증서 이관 완료(삼성카드 제외) 
http://test.mart.cc/admin/kica/raadmin_pay1.jsp 
http://euijae.mart.cc/admin/kica/T_raadmin_pay1.jsp   --> TEST 모듈 
==============================================================================================================

* 박양희Active-Master / park730 
카드결재가안된다고함... 
오류메세지 : 카드승인실패.키인한도 초과? 거래방법 수정요망 
카드번호 : 9430217673285913 / 조흥비씨  
           ( 법인/공용지정 -> isp등록했다함. ) 
확인후 연락드리기로함.   확인부탁드립니다. 수고하세요.. 
--------------------------------------------------------------------------------------------------------------- 

- KEY-IN한도초과  거래방법수정요망  ===> BC카드 한도 초과 
==============================================================================================================

- KSNET 결제 확인 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  메인 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999))  
KSNET_안심3C 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 신한, 외환(안심) 
---------------------------------------------------------------------------------------------------------------
LG카드 직가맹점 코드(R&F:233429911, L&B:38080248)  ---> 메인 상점ID로 사용 
직가맹점 --> 국민카드, BC카드, LG카드 
==============================================================================================================

- 나이스 결제 확인 
나이스 http://www.nicepay.co.kr/nicepay/login.htm 
L&B ==> ith3597/3597(가맹점 코드: 3597, 상점코드:주식회사 아이쓰리샵), LG직거래: its2023/its2023 
R&F ==> LG직거래: its2023/its2023(가맹점 코드: 2023, 상점코드:주식회사 아이쓰리샵3) 
     LG이외 모든 카드: itp3596/3596(가맹점 코드: 3596, 상점코드:주식회사 아이쓰리샵2)  
==============================================================================================================

- 안심클릭 카드 
신한카드(4518420072490912):hw0681lee 이혜원 
롯데카드(377994746862001):ho0634 김중호 
외환카드(4599005262385600):  임미옥 
삼성카드(4009131101338271): l480617 이정애 
삼성올앳카드(9420902101937600):  진태만   --> 우리은행(96075366418964) 
국민카드(9410468398418016) 진태만 
외환카드(9410004760649621) 진태만 --> 1010/ CVC: 386  
LG카드(9410803255269007): kijin00/tama3** 큰 매형 
200902/9597 CVC: 891 640712 - 1703812 
==============================================================================================================

- tama9091 
- 김숙경RM 
0303-4713-1472,  02-2231-1317 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.11(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 신용카드 모니터링 
==============================================================================================================

송명섭       bestcost 
BC카드 top포인트로 10만얼마정도를 결재하는데,, 결재처리중입니다라고 계속 안된다하세요. 
카드번호 : 9420-2130-2420-3434  BC 
본인카드는 아무이상없다고하는데요. 확인부탁드립니다. 
*  입니다. 
==============================================================================================================

- 민병춘(반품 처리) ===> 반품 기준(물품회수완료:영업, 반품접수:수당) 
주문번호: 0100012005072800482, 0100012005072800549, 0100012005072800552 
반품번호: 0100012005080500036, 0100012005080500037, 0100012005080500038 
==============================================================================================================

- 포인트 조회(통합)  @@@@@@@@@@@2 
SELECT A.MNO,A.POINT_NO,A.TAKEREASON_CD,A.BONUS_ITEM_CL,A.TAKE_DT, 
 A.COMPANY_CD,A.MERCHANT_CD,A.ORDER_DT,A.ORDER_NO,    
 A.SHIP_LOCATION_CD,A.SALE_AMT, 
 A.PV,A.BV,A.EMONEY,A.CMONEY,A.MARGIN,A.TAKEREASON_DESC,    
 B.CODE_NM TAKEREASON_NM,C.CODE_NM BONUS_ITEM_CL_NM 
FROM    
(SELECT MNO,POINT_NO,TAKEREASON_CD,BONUS_ITEM_CL,TAKE_DT, 
COMPANY_CD,MERCHANT_CD,ORDER_DT,ORDER_NO,    
SHIP_LOCATION_CD,PV,BV,    
EMONEY,CMONEY,MARGIN,SALE_AMT,TAKEREASON_DESC    
FROM T_MEMPOINT    
WHERE MNO = 699105) A,    
(SELECT CODE,CODE_NM    
FROM T_BASECODE WHERE GROUP_ID = 'G330') B,    
(SELECT CODE,CODE_NM   
FROM T_BASECODE WHERE GROUP_ID = 'G137') C    
WHERE A.TAKEREASON_CD = B.CODE    
AND A.BONUS_ITEM_CL = C.CODE(+) 
ORDER BY A.POINT_NO DESC 
==============================================================================================================

- 크론잡 점검(PKG_ORDER_HAPPY 날짜 에러)  
1. PKG_ORDER_HAPPY 패키지 점검 
2. CALL PKG_ORDER_HAPPY.DAY_ORDER_HAPPY_INSERT(''); --자동 크론잡 확인 
3. PKG_ORDER_HAPPY 패키지에 로그 파일 만들기 
dbms_output.put_line('[T_ORDER_HAPPY_PHONE] ========>'  '1111111'); 
4. 오류 수정 후 zterm(터미널)에서 211.233.5.110(실서버 DB) IIISHOP 연결(oracle/i3shop1105974)  
$ cd cron_job 
$  /user1/oracle/cron_job/order_happy_cron.sh     ---> 절대경로  ==> 에러 로그를 살펴 본다 
==============================================================================================================

-- 해피콜 조회 @@@@@@@@@@@@@@@ 
SELECT SELLING_DT AS 마감일자,ORDER_DT, ORDER_NO, ITEM_CD, ITEM_NM, 
    MEM_ID AS 주문자ID, MEM_NM AS 주문자명, 
  INSTALLREQ_YN,     /* 설치요청 여부(무료설치) */  
  GUBUN AS 구분   --구분(01:노블레스CD구매건, 02:정상주문건, 03:승급프로모션지급건, 04:비즈센터지급건)  
-- SELECT *  
FROM T_ORDER_HAPPY    --- T_ORDER_HAPPY_PHONE  
WHERE SELLING_DT >= '20050810' 
  AND SELLING_DT <= '20050810'  
  -- AND ORDER_DT = '20050713' AND ORDER_NO ='00185'   --주문번호 
ORDER BY REG_DT DESC 
; 
==============================================================================================================

* 강미숙Active-Master / misook72 
20050811, 강미숙, 0100012005081100209, 20050811  - I3MART  
위주문건이구요~ 고객이 반품신청한건인데... 
위 주문번호로 반품신청이 2번이 중복 되어있네요. 
---> 1개 삭제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.12(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 신용카드 모니터링 
==============================================================================================================

- 온라인 신용카드 결제를 위한 공인인증서 발급방법  
가.범용, 신용카드용 공인인증서를 가지고 있는 고객 : 추가 발급없이 온라인 카드결제가 가능합니다. 
나.뱅킹용 공인인증서를 가지고 있는 고객 
   금융결제원 전자인증센터(http://www.yessign.or.kr)로 접속하여 메인의 "바로 서비스" 신용카드용 인증서 클릭→발급 클릭 
   →뱅킹용 인증서가 담겨있는 디스켓을 컴퓨터 A드라이브에 삽입→주민등록번호 입력 후 인증서발급 클릭→공인인증서를  
   디스켓에 순차적으로 다운 받으면 됩니다. 
다.뱅킹용 공인인증서를 가지고 있지 않은 고객(온라인 뱅킹신청을 하지 않은 고객) 
   거래은행 방문→인터넷 뱅킹 신청→거래은행 사이트에서 뱅킹용 공인인증서를 디스켓에 순차적으로 다운로드→나머지  
   절차는 "나"항과 동일함  
==============================================================================================================

- 2005년 설 매장(메인) 데이타 출력 
개인별 주문 금액(20050101  ~ 20050228) 
기획매장: 82,526,980,  
카테고리코드(V92000000:2005년 을유년 신년맞이 선물대전): 45,405,010 
==============================================================================================================

- 냉장고 주문 
LG 싱싱냉장고(237L) R-B241GB: 304,000원 
안강읍 양월5리 1241-27 
기병로  ===> 기병호(*), 진기숙(*) 
==============================================================================================================

sadelynn 이혜경 
==============================================================================================================

김병주            aaa6688                Active-Master 
이건입니다...^^(게이트웨이 팝업창 뜨지 않음.._) 
0100012005063001068 
==============================================================================================================

- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
노블레스 패키지 반품 플로우 수정 
반품금액을 공제금액을 뺀 금액으로 보여 줄 것 
오민경(원주문번호:0100012005080400421  ---> 반품주문번호:0100012005081200011) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.22(월) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00 

- 통합 수정
- 반품 신청 관리(/BizMgr/SaleMgr/WebOrderMgr/returnItemOrderP.jsp) 
노블레스 패키지 반품 플로우 수정 
반품금액을 공제금액을 뺀 금액으로 보여 줄 것 
이옥순(원주문번호:0100012005080700080  ---> 반품주문번호:0100012005082200374) 

송재영(원주문번호:01000120050819200257  ---> 반품주문번호:0100012005082200150) 
==============================================================================================================

- 정수기 수정 
1.정수기 접수취소건 처리가 안되고 있습니다. 
후레쉬 이상영씨랑 통화했었습니다. 
2.정수기 파일중 오류건 수정요청했는데 30% 정도가 잘못처리 
되었습니다. 
3.노블 패키지 주문현황에서 반품건수가 한번씩 안맞습니다. 
혹시 반품건 회수완료일 기준, 처리완료일 기준의 기준일이  
다르게 되어있나요? 
-----------------------------------------------------------------------------------------------------------------------
업로드 수정 
주문번호: 17478,  17499  
-----------------------------------------------------------------------------------------------------------------------
7434: 배송만 된 것 
UPDATE T_ORDER 
SET ORDER_STS = '03', --발주상태(01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료)   
INSTALL_STS = '01', INSTALL_DT = '', --배송상태(01:배송만 해야 될 건, 02:설치만 해야 될 건) 
PROC_DT = '' --처리일자 
WHERE RETURN_DT IS NULL 
   AND ORDER_NO  IN( '7434') 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.23(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 쇼핑몰 수정
노블PK관리 반품건수 또 차이 납니다. 
통합 매출관리의 패키지1 반품 41인데 PK관리 반품은 37...4건 차이 
패키지2 반품 34인데 PK관리 반품은 33...1건 차이 
본부영업관리-영업분석관리-매출일보조회-상품별 매출/반품  
==============================================================================================================

-- 최근 3개월간 구매일어난 무료 회원 정보 조회 @@@@@@@@@@@   ==> 1,673건(회원 폰 번호 없는 59건 제외) 
SELECT A.MEM_ID AS 주문자ID, A.MEM_NM AS 주문자명, 
   B.HPHONE AS 회원_핸드폰 
-- SELECT SUM(*) 
FROM T_ORDER A, T_MEMBER B 
WHERE A.MNO = B.MNO 
AND A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001' 
AND A.ORDER_DT >= '20050523'     --주문일자 
AND A.ORDER_DT <= TO_CHAR(TO_DATE(SYSDATE),'YYYYMMDD')   --주문일자(오늘) 
AND A.ORDER_TP = '01' 
AND A.ORDER_STS IN ('03', '04', '09')   --주문상태(03:결재완료, 04:배송중, 09:배송완료) 
AND B.GRADE_CD NOT IN ('08', '09')     --직급코드(08:PM, 09:RM, 99:무료회원) 
AND B.HPHONE IS NOT NULL 
GROUP BY A.MEM_ID, A.MEM_NM, B.HPHONE 
ORDER BY A.MEM_NM ASC 
--; 
==============================================================================================================

- 노블PK관리 수정(/BizMgr/SaleMgr/NBPackage/nbPackageP.jsp) 
수당기준일자 추가  
==============================================================================================================

- 조경수GM * 신창헌(sch8858) 
==============================================================================================================

- PC방 프랜차이즈 업체 
존앤존(http://www.firstant.co.kr/) 
사이버파크(http://www.icyberpark.co.kr) 
==============================================================================================================

- BC카드 한도 증설(총 5억) 
R&F: 3억 6천 --> 4억 4천 
L&B: 2천 --> 6천 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.24(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 2005년추석 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28000000&p_display_cd=51 
--> /display/event/W28000000/categoryP.jsp 
- 카테고리별(첫번째 메뉴인 정육/갈비 보이기) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010101&p_display_cd=55 
--> /display/event/W28010101/categoryP.jsp 
- 가격별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/event/W28010301/categoryP.jsp 
- 상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/prdlist/tpl/type56/itemListP.jsp 
==============================================================================================================

- 안심클릭 카드  
삼성올앳카드(9420902101937600):  진태만   --> 우리은행(96075366418964) 
국민카드(9410468398418016) 진태만 
외환카드(9410004760649621) 진태만 --> 1010/ CVC: 386  
LG카드(9410803255269007): kijin00/tama3** 큰 매형 
200902/9597 CVC: 891 640712 - 1703812 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.25(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 추석매장 네이게이션 바 설정 
메인, 노블레스, R&F,  L&B 매장 
- 상세화면 수정 
추석 상품에 즉시할인 적용상품 표시 
==============================================================================================================

- 2005년추석 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28000000&p_display_cd=51 
--> /display/event/W28000000/categoryP.jsp 
- 카테고리별(첫번째 메뉴인 정육/갈비 보이기) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010101&p_display_cd=55 
--> /display/event/W28010101/categoryP.jsp 
- 가격별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/event/W28010301/categoryP.jsp 
- 상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/prdlist/tpl/type56/itemListP.jsp 
==============================================================================================================

강순영        941240go          무료회원 
카드 결제시 오류멘트 뜬다고 하시며 문의? -> 미등록 가맹점 7979라고 뜬다고 하심!  
카드번호: 4518-4200-7668-4452  신한카드  
==============================================================================================================

신천4동 윤정혜 *  --> 주인(*) 
대구시 동구 신천4동 322-20  상운빌라트 B동 201호 
세대주: 이정화(대구은행 029-08-349774-002)  --> * 
http://house.findall.co.kr/Sell/Sellinfo_detail.asp?good_id=109522849&goodCat2_code=2300&goodRegType_code=8 
신천1,2동 백석호 * 
==============================================================================================================

- 마티즈2 
판매가격: 480 만원 ==> http://www.yalge.com/i3shop/buy/BuySrhDet02.asp?car_number=C050804036C 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.26(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 쇼핑몰 수정
- 2005년추석 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28000000&p_display_cd=51 
--> /display/event/W28000000/categoryP.jsp 
- 카테고리별(첫번째 메뉴인 정육/갈비 보이기) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010101&p_display_cd=55 
--> /display/event/W28010101/categoryP.jsp 
- 가격별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/event/W28010301/categoryP.jsp 
- 상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/prdlist/tpl/type56/itemListP.jsp 
==============================================================================================================

- 주문.배송내역 조회(inquiry/orderMasterP.jsp?p_page=1&p_order_dt=20050824&p_order_no=00349) 
==============================================================================================================

- 3개월 RM, PM 제외 모든 회원 출력 
==============================================================================================================

- 제주카드 결제 불가 
신한( 조흥, 제주,수협,광주,전북) 
*  강춘자 제주 비자 문의 자입니다. 
==============================================================================================================

- KSNET 결제 확인  
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>가맹점 코드(KSNET R&F: 2002100297/32871, KSNET L&B: 2002100298/32871)  
------------------------------------------------------------------------------------------------------ 
- 김명석 과장(3420-5916, *)  ===> 사업부 
3420-5951  박영준 대리 5994 
==============================================================================================================

- KSNET 결제 확인 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  메인 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999)) 
KSNET_안심3C 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 신한, 외환(안심) 
신한 - 조흥((구)강원카드), 제주,수협,광주,전북 
==============================================================================================================

- 주문한 상품 재고 없음 
카드 취소 후 한도 재생 문제 
--> 하루가 지나도 가맹점에서 취소하고 본인이 카드사에 전화하면 한도 재생 가능 
진혜숙 PM * 0100012005082500389 
==============================================================================================================

- KSNET 한도초과 에러 
상점월한도초과  Tel:1544-6030 YAEWHANcard 
원인: KS NET에서 자체적으로 걸어논 한도(1억) 
박숙경RM * 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.27(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 

- 쇼핑몰 수정
- 2005년추석 매장(메인) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28000000&p_display_cd=51 
--> /display/event/W28000000/categoryP.jsp 
- 카테고리별(첫번째 메뉴인 정육/갈비 보이기) 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010101&p_display_cd=55 
--> /display/event/W28010101/categoryP.jsp 
- 가격별 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/event/W28010301/categoryP.jsp 
- 상세 
http://euijae.mart.cc/display/event/com/mainP.jsp?p_store_cd=S063&p_category_cd=W28010301&p_display_cd=55 
--> /display/prdlist/tpl/type56/itemListP.jsp 
==============================================================================================================

- Mail 세팅 
이메일 생성 페이지 
http://old.i3shop.com/admin.html 
i3shop/0506 
==============================================================================================================

- 등산화 주문 도착 
[트렉스타 정품] 등산화 매시브 58,000 원 
==============================================================================================================

- 원룸 계약  
전세 2,400만원(계약금 백만원 지불) --> 10월 2일(일) 입주 예정 
세대주: 이정화(대구은행 029-08-349774-002)  --> * 
대구시 동구 신천4동 322-20  상운빌라트 B동 201호 
관리비: 월 2만원(도시가스비, 전기세 제외) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.29(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 2005년추석 매장(메인)  
실서버 적용(매장 오픈) 
==============================================================================================================

- SMS전송(추석매장 홍보) 
- SMS전송 미리보기 정보 수정  @@@@@@@@@@@ 
UPDATE T_SMS_SEND_PREV M 
SET (M.MEM_ID, M.GRADE_CD, M.HPHONE) = (SELECT A.MEM_ID, A.GRADE_CD, A.HPHONE   --회원ID, 직급, 핸드폰번호 
FROM T_MEMBER A 
WHERE M.MNO = A.MNO    
  AND M.SMS_GB = '91' 
) 
WHERE EXISTS 
  (SELECT 'x' 
  FROM T_MEMBER A 
  WHERE M.MNO = A.MNO    
   AND M.SMS_GB = '91' 
  ) 
; 
==============================================================================================================

- 정수기 백업 DB(MS-SQL) 
210.123.133.39(sa/ckrladl) 
==============================================================================================================

%%   조희원    click77701     Management-M  
비씨카드 300만 이하 하는데도 계속 결재 T-in(?)에러 난다고함  - 8623 오류번호라시는데 정확한건 아니라고하심 
-> 본인 총 한도는 370만원이고.. 결재하시는 금액은 250만원 정도라고하심 
카드번호 : 9420 3210 1531 1155  김남진  
확인후 전화요망   - 조희원    click77701     Management-M   * 
------------------------------------------------------------------------------------------------------------ 

비씨카드 KSNET_RnF  가맹점 한도 초과 입니다. 
==============================================================================================================

- 카드 가맹점 한도 초과 
KBcard KSNET_RnF 
==============================================================================================================

강민정         desire25            Master 
클로렐라 그린(핵산함유) (200mg*600정) , 클로렐라 그린플러스(핵산함유) (360mg *30캅셀) 
-> 카드로만 주문가능하다고 되어 있는데, 이경우 체크카드 결제 안되는지 문의?  
(결제 하니까, 오류메세지 뜨면서 아이쓰리샵으로 전화하라고 메세지 뜬다고 하심...) 
* 카드번호: 9440-1140-6650-9009  농협 체크 카드(BC카드) 
------------------------------------------------------------------------------------------------------------
이 카드가 BC카드 여서 ISP로 결제 안해서 에러가 뜬 것으로 추정 됩니다. 
강민정 회원과 직접 통화해서 처리했습니다. 
==============================================================================================================

- 노블 패키지1  
남은수량 17로 설정(DB와 상관없이 수동 설정) 
==============================================================================================================

- 개인업무관리 조회(그룹웨어)  @@@@@@@ 
SELECT B_SUBJECT,   
	 (CASE WHEN B_STATE = '01' THEN '예정' 
		    WHEN B_STATE= '02' THEN '진행중'  
		       WHEN B_STATE= '03' THEN '완료'  
		    WHEN B_STATE= '04' THEN '지연'  
		       WHEN B_STATE= '05' THEN '보류' 
		       WHEN B_STATE= '06' THEN '중단'  
		       WHEN B_STATE= '07' THEN '업무이관'  
		    ELSE B_STATE END) AS 진행단계,  
	B_END_DT AS 완료기한, B_TXTDETAIL AS 업무내용 
	FROM T_business_diary 
WHERE USER_NM = '진태만' 
	AND REG_DT >= '2005-08-22' 
	AND REG_DT <= '2005-08-27' 
	-- AND POST_CD = 'C204' 
	-- AND B_STATE IN ('01', '03')    --상태(01:완료,  03:예정) 
ORDER BY POST_CD, REG_DT DESC 
==============================================================================================================

- 노블패키지 반품 정보 에러(T_NOBLE_PK_RETURN) 
ITEM_CD 반품수량 반품수량2(T_NOBLE_PK_RETURN) 
00156770 52 3 
00156771 39 58 
==============================================================================================================

- 연금저축 
대한하이드림 연금보험  
10년납 55세연금형(10년 납입 후 그만 넣을 수 있음)  
55세 이후 월 292 만원 받음 
소득공제: 년 44만원  
월: 20만원 납입(시작일: 2005.08.30) 
2005.08.30 CMS출금 대한생명 200,000   277,670  두호동  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.30(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- SMS전송(추석매장 홍보)  
7월 수당 회원: 971건 전송 
무료회원,멤버,마스터 회원: 3,545건 전송 예정  
==============================================================================================================

- SMS전송 미리보기 정보 수정  @@@@@@@@@@@ 
UPDATE T_SMS_SEND_PREV M 
SET (M.MEM_ID, M.GRADE_CD, M.HPHONE) = (SELECT A.MEM_ID, A.GRADE_CD, A.HPHONE   --회원ID, 직급, 핸드폰번호 
FROM T_MEMBER A 
WHERE M.MNO = A.MNO    
  AND M.SMS_GB = '91' 
) 
WHERE EXISTS 
  (SELECT 'x' 
  FROM T_MEMBER A 
  WHERE M.MNO = A.MNO    
   AND M.SMS_GB = '91' 
  ) 
; 
==============================================================================================================

-- SMS전송 미리보기 정보 조회 @@@@@@@@@@@@@   ----> 핸드폰이 존재하지 않은 회원 
SELECT  A.SMS_GB, A.SMS_CAUSE_DT, 
        '' AS ORDER_NO_FULL, 
   '' AS SEND_OK_YN, 
   '' AS SEND_SUC_YN, 
A.MNO, A.MEM_ID, A.MEM_NM, A.GRADE_CD, 
(SELECT GRADE_NM FROM T_GRADE WHERE GRADE_CD = A.GRADE_CD) AS 직급,  
A.HPHONE 
-- SELECT  COUNT(*) 
FROM T_SMS_SEND_PREV A 
WHERE A.SMS_GB = '91'       --SMS전송 구분(01:월수당 지급, 02:직급 승급, 03:고객관리, 04:배송 시작, 51:G.W 이벤트, 52:추석매장 홍보) 
AND NOT (A.HPHONE LIKE '010%' OR A.HPHONE LIKE '011%' OR A.HPHONE LIKE '016%'  
OR A.HPHONE LIKE '017%'  OR A.HPHONE LIKE '018%' OR A.HPHONE LIKE '019%') 
OR A.HPHONE = ''  OR A.HPHONE IS NULL 
ORDER BY A.HPHONE,  A.MEM_NM DESC 
--;  
------------------------------------------------------------------------------------------------------------------------ 

-- SMS전송 미리보기 정보 삭제 @@@@@@@@@@@@@ 
-- DELETE T_SMS_SEND_PREV A 
WHERE A.SMS_GB = '91'       --SMS전송 구분(01:월수당 지급, 02:직급 승급, 03:고객관리, 04:배송 시작, 51:G.W 이벤트, 52:추석매장 홍보) 
AND NOT (A.HPHONE LIKE '010%' OR A.HPHONE LIKE '011%' OR A.HPHONE LIKE '016%'  
OR A.HPHONE LIKE '017%'  OR A.HPHONE LIKE '018%' OR A.HPHONE LIKE '019%') 
OR A.HPHONE = ''  OR A.HPHONE IS NULL 
--;  
==============================================================================================================

- TEST 시퀀스 삭제, 생성 
DROP SEQUENCE IIISHOP.TEST_SEQ; 

CREATE SEQUENCE IIISHOP.TEST_SEQ 
  START WITH 1 
  MAXVALUE 999999999999999 
  MINVALUE 0 
  NOCYCLE 
  NOCACHE 
  NOORDER; 
------------------------------------------------------------------------------------------------------------------------ 

-- SMS전송 미리보기 정보 저장 @@@@@@@@@@@@@  
-- INSERT  INTO T_SMS_SEND_PREV   
(SEQ_NO, SMS_GB, MNO, MEM_ID,  MEM_NM,    
 HPHONE, SMS_CAUSE_DT, REG_ID, GRADE_CD, ORDER_NO_FULL,    
 REG_IP,  REG_DT)   
SELECT  TEST_SEQ.nextval,     
A.MEM_ID, A.SMS_GB, B.MNO,  A.MEM_NM, 
A.HPHONE, A.SMS_CAUSE_DT, A.REG_ID, B.GRADE_CD, '' AS ORDER_NO_FULL,   
'', sysdate 
-- SELECT  COUNT(*) 
FROM T_SMS_SEND_PREV_CHU_TEST A, T_MEMBER B 
WHERE A.MEM_ID = B.MEM_ID 
  AND A.HPHONE = B.HPHONE 
  AND A.SMS_GB = '52'       --SMS전송 구분(01:월수당 지급, 02:직급 승급, 03:고객관리, 04:배송 시작, 51:G.W 이벤트, 52:추석매장 홍보) 
--; 
==============================================================================================================

- 노트북 
도시바 M50 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2005.08.31(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 23:00 

- 쇼핑몰 수정
- 노블패키지 반품 정보 에러(T_NOBLE_PK_RETURN)  ===> 주문일자 기준 
ITEM_CD 반품수량 반품수량(22:주문접수 포함) 반품수량2(T_NOBLE_PK_RETURN) 
00156770 55   64 63 
00156771 41(96)   47(111)  61(124) 
------------------------------------------------------------------------------------------------------------------------ 

00156770 00156771 00156770 00156771(T_NOBLE_PK_RETURN) 
20050830      2     2     0     3 
20050829      5     2     0     2 
20050828      1     0     0     0 
20050827      1     0     0     0 
20050826      3     0     0     0 
20050825      1     1     0     1 
20050824      2     1     0     1 
20050823      1     1     0     1 
20050822      2     3     0     3 
==============================================================================================================

SELECT  A.ORDER_STS, A.MERCHANT_CD, A.ORDER_DT, A.ORDER_NO, 
       B.ENTR_NO,   --거래처 번호(거래처 번호 수 만큼 T_STOREOUT 이 나오면 정상) 
       B.ITEM_CD, B.ITEM_NM, B.REAL_SALE_PRICE 
-- SELECT * 
FROM T_ORDER A, T_ORDER_DTL B 
WHERE A.COMPANY_CD = B.COMPANY_CD 
AND A.MERCHANT_CD = B.MERCHANT_CD 
AND A.ORDER_DT = B.ORDER_DT 
AND A.ORDER_NO = B.ORDER_NO 
AND A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001' 
AND A.ORDER_DT = '20050830' 
AND A.ORDER_TP ='03'             --주문유형(01:정상주문, 03:반품주문) 
AND A.ORDER_STS IN ('22', '23', '24', '29')     --주문상태(22:반품접수, 23:물품회수완료)      
AND B.ITEM_CD IN ('00156770', '00156771')   --상품코드(00156770:노블패키지1(노블CD+휴대폰), 00156771:노블패키지2(노블CD+G/W+전화기))   
ORDER BY B.ITEM_CD, A.ORDER_DT,  A.ORDER_NO, B.ENTR_NO DESC 
--; 
--=================================================================================================== 

--노블레스PK 반품시 정보 저장 ==========> @@@@@@@@@ 
INSERT INTO T_NOBLE_PK_RETURN 
       (COMPANY_CD, MERCHANT_CD, ORDER_DT, ORDER_NO, ITEM_CD, 
NOBLE_PK_RETURN_CD, NOBLE_PK_RETURN_NM, GETBACK_DEDUCT, REAL_SALE_PRICE,  
REG_ID, REG_IP,REG_DT 
) 
	SELECT  C.COMPANY_CD, C.MERCHANT_CD, C.ORDER_DT, C.ORDER_NO, D.ITEM_CD,  
			0, '노블CD 미설치 + 핸드폰 미개통', 0, 1290000, 
			'admin', '210.123.133.31', sysdate 
	FROM T_ORDER C, T_ORDER_DTL D 
	WHERE C.COMPANY_CD = D.COMPANY_CD            
		AND C.MERCHANT_CD = D.MERCHANT_CD            
		AND C.ORDER_DT = D.ORDER_DT            
		AND C.ORDER_NO = D.ORDER_NO   
		AND C.COMPANY_CD = '01'                 
		AND C.ORDER_TP = '03'                   
		AND C.ORDER_STS IN ('23', '24', '29')               
		AND C.MERCHANT_CD ='0001'             
		AND C.ORDER_DT = '20050830'                    
		--AND C.ORDER_DT <= '20050714'                  
		AND D.QTY < 0                                       
		AND D.ITEM_CD = '00156770'     
--; 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■