

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.01.02(월) 작업 ■■■■■■■■■■■■■■■■■
---> 07:40 ~ 01:00 

- 쇼핑몰 수정
 - 신용카드 안내 오류 
http://tamario.i3shop.cc/main_tpl/card_auth.jsp 에서 
안심클릭 등록(http://www.ansimclick.com/ansim_event_main.htm)  
-->  해당 사이트에 문제 있는 것 같음(http://www.ansimclick.com/ansim_event_main.htm) 

BC 안전결제 등록(http://www.bccard.com/isp/preview/isp_simulation.jsp) 
BC카드 안전결제 등록 방법  --> BC카드 안전결제 등록하기 이미지 밑에  
BC카드 홈페이지(http://www.bccard.com) --> 로그인(BC카드 홈페이지 우측 맨 위) 클릭 --> ISP로그인 
-->  ISP신청 --> 안전결제(ISP)서비스(새창이 뜸) 
==============================================================================================================

- KSNET 결제 확인(신용카드)    @@@@@@@@@@@@@@@@@@@ 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  직가맹, 기타 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999)) 
--> 직가맹: 국민, BC, LG 
마이너 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 외환, 
신한(조흥((구)강원카드):ISP, 제주,수협,광주,전북, 현대) 
----------------------------------------------------------------------------------------------------------------------------- 
- 강종철 과장  *   ===> 사업부(영업) 
02)3420-5951  박영준 대리(*) 
==============================================================================================================

- 모빌리언스 휴대폰 결제 관리자 페이지   @@@@@@@@ 
https://mcash.mobilians.co.kr/bill/payment/index.php3 ID/PWD(05011701/05011701)  
휴대폰 결제 담당자: 오경수 주임 T) (02)2192-2165 
==============================================================================================================

- SMS 전송 관리자 페이지    @@@@@@@@ 
https://mcash.mobilians.co.kr/smsgw/ ID/PWD(i3shop/757913) 
SMS 결제 담당자:  임영식 주임(*@*.*)  T) 02-2192-2163 
==============================================================================================================

- 오즈 출력 오류(영수증 출력 오류)   @@@@@@@@@@@@@@@@@@@ 
- 오즈 레포트 출력 에러(Windows XP용 일 경우) 
1. Windows XP용 JVM 를 다운 받아서 설치 하시고 재부팅 해보세요. 
(http://www.i3shop.com/board/data_view.asp?i_id=169) 
2. 레포트(영수증 출력등) 출력창 오류 시 조치방법(1번을 설치 했는데도 안되면) 
(http://www.i3shop.com/board/data_view.asp?i_id=189) 
 가. appletregistry.zip (621K) 을 내려 받고 appletregistry.zip를 압축을 푼다. 
 나. 압축을 푼 appletregistry 폴더에서 ozappletviewer_xp.reg를 더블 클릭 
 다. 레지스터리 등록 여부를 물으면 "예"를 클릭 
 라. 레지스터리 등록 성공 
 마. 재부팅 후 출력이 가능해짐 
==============================================================================================================

- JVM 설치 여부 확인   @@@@@@@@@@@@@@@@@@@ 
1. 설치 안됨 
C:\Documents and Settings\Administrator> jview 
'jveiw'은(는) 내부 또는 외부 명령, 실행할 수 있는 프로그램, 또는 
배치 파일이 아닙니다. 

2. 정상 설치 
C:\Documents and Settings\Administrator> jview 
Microsoft (R) Command-line Loader for Java Version 5.00.3810 
Copyright (C) Microsoft Corp 1996-2000. All rights reserved. 
사용법: JView [옵션] <클래스 이름> [인수] 
옵션: 
    /?                 사용 명령어를 보여 줍니다. 
    /cp <클래스 경로>  클래스 경로를 지정합니다. 
    /cp:p <경로>       클래스 경로를 유지합니다. 
    /cp:a <경로>       클래스 경로를 추가합니다. 
    /n <이름 입력 공간>실행할 이름 입력 공간 
    /p                 오류 발생시 마치기 전에 잠깐 멈춥니다. 
    /v                 모든 클래스를 확인합니다. 
    /d:<이름>=<값>     시스템 속성을 정의합니다. 
    /a                 AppletViewer를 실행합니다. 

클래스 이름: 
    실행할 .CLASS 파일 
인수: 
    클래스 파일에 적용되는 명령줄 인수 
==============================================================================================================

오즈 애플릿이 동작이 되지 않는다면, 
1. 오즈 뷰어의 경로를 확인하시고, 
2. sun에서 나온 JVM이 설치되어있을 때에는 인터넷 옵션->고급에서 sun JVM의 체크를 빼고 사용해 주시기 바랍니다. 
3. 그리고 사용자 보안설정으로 확인하셔서, 보안설정을 낮음으로 해주시면 됩니다. (일단 보통에서도 동작은 되지만  
특정컴퓨터의 세팅에 따라 낮음으로 해야되는 경우가 있습니다.) 
4. 인터넷옵션->고급->자바콘솔사용을 체크 하신후, 보기->자바콘솔을 띄우셔서 
오즈호출 할때 에러가 나오는 지도 체크해 주시면 됩니다. 
==============================================================================================================

- 오즈 출력 에러(오즈 콜센타) 
연락처: *@*.*  02)828-1488, 1499(정지현) 
리모트콜  알소프트 
==============================================================================================================

- 신용카드 오류 
20051230, 강명희, 0100012005123000821, 20051230 
승인일자: 20051230 235357  
취소일자: 20051231 133126 
==============================================================================================================

- 시티카드 
시티카드 한미카드 랑 통합 관계로 1주일 정도 결제 안 될 수 있음 
==============================================================================================================

-- 수불장 조회 @@@@@@@@@@@@@@@@@@@@22 
-- 입고원가(VAT) UPDATE 
UPDATE T_DAY_SUBUL U 
SET U.IPGO_WONGA_VAT = U.IPGO_WONGA_VAT + 1  --입고원가(VAT) 
WHERE EXISTS 
  (SELECT 'x' 
   FROM  T_STOREIN_DTL B   
  WHERE B.COMPANY_CD = U.COMPANY_CD 
AND B.MERCHANT_CD = U.MERCHANT_CD 
AND B.STOREIN_DT = U.SUBUL_DATE 
AND B.ITEM_CD = U.ITEM_CD 
AND B.COMPANY_CD = '01' 
AND B.MERCHANT_CD = '9001' 
AND B.STOREIN_DT = '20051223' --입고일자   
AND B.TAX_YN = 'Y'   --과세여부 
--AND MOD(U.IPGO_WONGA, 10) <> 0 --입고원가(VAT) 
  ) 
==============================================================================================================

-- 재고조정 등록(/BizMgr/ItemStockMgr/stockInquiryStatDeclinP.jsp)  ===> 재고실사 후 
T_STOCK_ADJUST --재고조정정보 저장 
T_STOCK_ADJUST_DTL --재고조정상세정보 저장 

재고실사정보 수정  
T_STOCK_INQUIRY --->  INQUIRY_STS   --실사상태(90: 재고조정신청, 91:재고실사 완료) 
==============================================================================================================
   
--  T_SMS_SEND_PREV 시퀀스 생성   
 CREATE SEQUENCE IIISHOP.T_STOCK_ADJUST_SEQ 
  START WITH 1 --시작값 
  MAXVALUE 9999999999999999999999999999 --최대값 
  MINVALUE 1 --최소값 
  NOCYCLE 
  NOCACHE --캐쉬: Oracle Server가 미리 지정하고 메모리에 유지할 값의 수 
  NOORDER;  
==============================================================================================================

-  수불장 수정(1원 차이 수정) 
START: (15:30 ~ 18:00)  --> 2시간 30분 
-----------------------------------------------------------------------------------------------------------------------------

- 수불 마감 
시작시각: Elapsed: 00:01:59.19 
종료시각: Production on Mon Jan 2 02:01:00 2006 
==============================================================================================================

- [05년 12월 마감]
---> 8:00 ~ 01:00 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.03(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 

- 통합 수정
- 재고조정 등록(/stockInquiryStatDeclinS.jsp) 
- 재고 조정 2차승인(/BizMgr/ItemStockMgr/stockAdjustApp2P.jsp) 
==============================================================================================================

-  1원 수정(입고원가 VAT수정) 
NVL(TRUNC( 
      SUM(  
   ( 
     CASE 
       WHEN B.TAX_YN = 'Y' THEN 
 TRUNC(NVL(B.STOREIN_QTY,0)* NVL(B.BUYING_PRICE,0),0) - TRUNC((NVL(B.STOREIN_QTY,0)* NVL(B.BUYING_PRICE,0)/1.1),0)  
      WHEN B.TAX_YN = 'N' THEN 0 END 
) 
 ) 
 ), 0) AS IPGO_WONGA_VAT,    --입고원가(VAT)   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.04(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 통합 수정
- 수불장 수정 
상품코드: 00012101 수불일자:20031117 --> 점간이동입고수량 
재고수량 0로 만듬 
==============================================================================================================

-정수기 수정 
0100012004083111384 
기타누수 --> 기타 부속 빠짐  --> 전체단수 
------------------------------------------------------------------------------------------------------------- 
- 자리수(VB) 
StrlistItem = Left("0" + Trim(CStr(Rs(0) - 1)), 2)   --> 02, 28, 
==============================================================================================================

이민우       minwoo65       Member  
비씨카드 결제가 안된다고 하시며 문의? - isp결제이후, 공인인증서 결제이후, 승인거절이라고 뜬다심. 
* 카드번호: 4902-2090-0176-3158 비씨카드  
혹, 공인인증서 발급 대상자와 카드 소유자분이 서로 다른거 아니냐 여쭈니, "이태우"님으로 동일하다고 하심!  
그리고 결제할 금액도 \2,906,000원 정도이고, 이번달에 그 카드로 더이상의 결제내용은 없었다고 하심., 
==============================================================================================================

- 신용카드 에러 
0100012005122900618 asi0422(안상임)  --> 126,000 원 결제 --> 직,기_LnB 
0100012005122900636   asi0422(안상임)  --> 111,500 원 결제 --> 직,기_LnB 
0100012005122900643  asi0422(안상임)  --> 111,500 원 결제 --> 직,기_LnB 

0100012005122600626 chan63(박찬이)  --> 117,100 원 결제 --> 직,기_LnB 
0100012005122600689   chan63(박찬이)  --> 116,100 원 결제 --> 직,기_LnB 
  
0100012005121000008 nklee6000(최기준)  --> 83,650 원 결제 --> 직,기_LnB 
0100012005121000013   nklee6000(최기준)  --> 85,230 원 결제 --> 직,기_LnB 

0100012005122900364 vip5917(이영동)   --> 112,000 원 결제 --> 직,기_LnB 
0100012005122900367   vip5917(이영동)   --> 112,000 원 결제 --> 직,기_LnB 
0100012005122900381   vip5917(이영동)   --> 112,000 원 결제 --> 직,기_LnB 

0100012005122900399 vip3816(정해욱)   --> 112,000 원 결제 --> 직,기_LnB 
0100012005122900404   vip3816(정해욱)   --> 112,000 원 결제 --> 직,기_LnB 
0100012005122900407   vip3816(정해욱)   --> 112,000 원 결제 --> 직,기_LnB 

0100012006010201495 hjk8887(이춘분)   --> 123,800 원 결제 --> 직,기_LnB 
0100012006010201513 hjk8887(이춘분)   --> 112,000 원 결제 --> 직,기_LnB --> lgcard 

0100012006010201511 khj76(김현정)    --> 148,580 원 결제 --> 직,기_LnB 
0100012006010201565 khj76(김현정)    --> 148,580 원 결제 --> 직,기_LnB 
--------------------------------------------------------------------------------------------------------------

- BC카드 테스트 후 취소  
0100012006010400531, 0100012006010400534 
==============================================================================================================

- KSNET 결제 확인(신용카드) 
http://nims.ksnet.co.kr:7001/pg_infoc/src/login.jsp 
===>  직가맹, 기타 상점ID(KSNET R&F:2002100297/32871, KSNET L&B:2002100298/32871, 테스트:2999199999)) 
--> 직가맹: 국민, BC, LG 
마이너 상점ID(R&F:2001100849/000034, KSNET L&B:2001102813/32871) --> 롯데, 외환, 
신한(조흥((구)강원카드):ISP, 제주,수협,광주,전북) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.05(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:00 

- 통합 수정
- 정수기 수정 
유무료 표시(해피콜) 
--------------------------------------------------------------------------------------------------------------- 

- 정수기 수정 
오류데이터 수정요청건 보냈습니다. 
배송, 설치 관련 건중 
설치일자가 null인 건 중 색상이 파란색으로 처리된 건이 있는 것 같습니다. 
이런 건들은 일괄 색상을 변경 해야 할듯 합니다. 

기준 : 입금일자가 20040901 보다 큰값은 흰색 
          입금일자가 20040831 보다 작은값은 주황색 
==============================================================================================================

- 신용카드 에러 
강명녀        i3saja2 
LG카드 : 5404-8667-9938-4008  
오류가 발생했습니다라고 뜨고 결제가 되지않는다하세요.. 
--------------------------------------------------------------------------------------------------------------- 

---> 116번 KS NET 카드 데몬이 안 띄워져서 에러가 남 
- KS넷 모듈 재 등록(UNIX계열 서버) 확인  ==============>  
[root@i3shop_ccdom1 root]# cd /  
[root@iiishop_ccdom1 /]# cd home/i3shop/ksnet1  
[root@iiishop_ccdom1 /]# ps -ef  grep ipgClient ---> 데몬이 살아 있는 지 확인 
[root@i3shop_ccdom1 ksnet1]# ps -ef  grep ipgClient 
root     14089     1  0 16:01 ?        00:00:00 ./ipgClient 29991 210.181.28.137    <----- 떠 있음 
root     14117 13784  0 16:03 pts/1    00:00:00 grep ipgClient 
[root@iiishop_ccdom1 /]# ./sc ---> 데몬이 띄우기 
==============================================================================================================

- BC카드(강금순 주임)  --> i3shop1234 
9410 3170 1934 7627(9410317019347627) *@*.* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.06(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 23:00 

- 통합 수정
- 재고조사 결과 요약 보고서 만들기 
stockInquiryStatB_printReport.jsp 

- 보고서 출력 
2,389,431,663 
==============================================================================================================
  
- 편차 TOP 5 상품 정렬 조회 
SELECT * FROM ( 
SELECT * FROM(SELECT * FROM table order by 정렬할컬럼명 [desc : 역정렬] 
) 
WHERE ROWNUM < 6 --매장별 편차 TOP 5 상품 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.07(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 

- 통합 수정
- 재고조사 결과 요약 보고서 만들기(stockInquiryStatB_printReport.jsp)  
==============================================================================================================
  
- 편차 TOP 5 상품 정렬 조회 
SELECT * FROM ( 
	SELECT * FROM(SELECT * FROM table order by 정렬할컬럼명 [desc : 역정렬] 
) 
WHERE ROWNUM < 6 --매장별 편차 TOP 5 상품 
==============================================================================================================

- KT회선 점검(인터넷이 안 될 때) 
KT 동대구 센터(053-939-1602) 
박찬호 050-2580-0222 
==============================================================================================================

- 재조조정 수정 요청 
아이라이트비타민a(판촉용)(00157742) --> 2005년 12월 31일로 재고조정일자 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.09(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 통합 수정
- 재고조사 결과 요약 보고서 만들기(stockInquiryStatB_printReport.jsp)  
==============================================================================================================

- 신용카드 오류(안심결제- 이정애씨가 쿠폰 하다가 오류 냄) 
김현정  hesang23  Active-Master 
LG카드 :4009 0528 4226 5021 
------------------------------------------------------------------------------------------------ 
김인환       kyb26    
LG카드 4009 0555 3589 9048 
오늘 카드결제하려고 하는데, 결제중입니다만 확인되고  
==============================================================================================================

- 정수기 서버 이관(MS-SQL) 
1. 데이타 Export 
2. 이관된 데이타 T_CALL 테이블 CALL_NO, T_ORDER 테이블 ORDER_NO idenfity increment 1 로 설정 
3. 트리거 생성  
트리거 조회(MS-SQL) 
SELECT * FROM sysobjects WHERE  type = 'TR' 
------------------------------------------------------------------------------------------------ 
- T_CALL 테이블 에서 --> Design Table --> Triggers 클릭(도움말(H) 밑에 있음) 
--> Triggers Properties에서 CPPY_TO_ORDER 보임(이미 생성된 것)  

- 정수기 DB서버 변경 
210.123.133.39 sa/ckrladl --> 포트: 1443 
==============================================================================================================

주문번호 18940 유상으로 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.10(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- SMS 전송 오류 
모빌리언스측에서 아이디, 패스워드를 잘못 받았다고 함 
String ID = "i3shop"; //신청 아이디 
String PWD = "757913"; //신청 PWD 
------------------------------------------------------------ 

- 06년 설매장 홍보 전송 
최근 3개월 내 L&B 구매 회원 4000건 전송  ==> 14:50 ~14:40 (4분 소요)  ---> 06년 설매장 홍보(58) 
SMS 발송 문구:  "i3shop병술년 만사형통선물대전 오픈~ 세뱃돈 쿠폰이 펑펑~많은이용바랍니다1688-1313" 
==============================================================================================================

- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
장바구니 저장 수정 
SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.11(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
------------------------------------------------------------------------ 

SHIP_CL_CD: 배송구분코드(p_ship_cl_cd) 
CMONEY_USEYN: 사이버머니 사용여부 
------------------------------------------------------------------------ 

211.233.5.111 test.i3city.cc # 쇼핑몰 Test서버(test02/unit02) 
==============================================================================================================

- 카드결제 오류 
오순자      ohsunja 
카드번호 : 9440-1140-7249-0210  농협체크 
인증결제오류    카드사전화요망 
==============================================================================================================

- 정수기 수정 
개인정보, 제품일련번호 수정 가능 
0100012003100800541  --> 7778 
txt_OrderNo_real 
==============================================================================================================

- 그룹웨어 회의 
더존, 인에이지(ent.gware.co.kr) --> (admin/991111) 
이수영 대리(*) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.12(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
------------------------------------------------------------------------ 

MNO: 회원번호 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송) 
-- STORE_CD: 매장코드 
-- ITEM_CD: 상품코드 
-- USE_CMONEY: 사용가능 사이버머니 

CMONEY_USEYN: 사이버머니 사용여부  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.13(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
------------------------------------------------------------------------ 

MNO: 회원번호 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송) 
-- STORE_CD: 매장코드 
-- ITEM_CD: 상품코드 
-- USE_CMONEY: 사용가능 사이버머니 

CMONEY_USEYN: 사이버머니 사용여부 

/display/prd/prd.jsp?p_store_cd=S001&p_category_cd=T03150206&p_item_cd=00136212&p_display_cd=01 
------------------------------------------------------------------------ 

- 장바구니 상품 유형 담기(상세화면에서 장바구니 담기 클릭) 
tpVec = getItemType(inputHash); 

if (tpVec!=null && tpVec.size()>0) { //상품 유형 
for (int i=0; i<tpVec.size(); i++) { 
//해당상품의 유형전체를 훑으면서 입력된 값과 일치하는것을 Vector에 담는다. 
tmpHash = (Hashtable)tpVec.elementAt(i); 

tmpTpNo = (String)getData("tp_no",tmpHash); 
tmpTpNm = (String)getData("tp_nm",tmpHash); 
tmpTpDtlNo = (String)getData("tp_dtl_no",tmpHash); 
tmpTpDtlNm = (String)getData("tp_dtl_nm",tmpHash); 
  
inTpDtlNo = (String)getReqData("p_type_" + tmpTpNo, req, 4); //4=null    
if (inTpDtlNo!=null && inTpDtlNo.equals(tmpTpDtlNo)) { //넘어온 유형번호와 이미 존재하는 유형번호가 같으면 
//일치하는 유형과 값을 찾음. 
//찾은 유형정보를 유형 Vector에 담음 
tmpHash = new Hashtable(); 
tmpHash.put("p_item_cd",inItemCd); 
tmpHash.put("p_tp_no",tmpTpNo); //유형번호 
tmpHash.put("p_tp_nm",tmpTpNm); 
tmpHash.put("p_tp_dtl_no",tmpTpDtlNo); //항목번호 
tmpHash.put("p_tp_dtl_nm",tmpTpDtlNm); 
  
itemTypeVec.add(tmpHash); 
} 
} //end for 
} 
==============================================================================================================

- 카드 결제 오류 
서유경(sy0408) 
0100012006011300023   --> 정상 결제   --> 데이타 저장 안됨 
0100012006011300024   --> 정상 결제, 취소  --> 데이타 저장 
0100012006011300034   --> 정상 결제 
-------------------------------------------------------------------------------------------------- 

차원식(520729cha) 
0100012006011100243   --> 정상 결제   --> 데이타 저장 안됨 
0100012006011100245   --> 정상 결제, 취소  --> 데이타 저장 
김향숙(ksi21) 
0100012006011300020  --> 정상 결제   --> 데이타 저장 안됨 
0100012006011300021  --> 정상 결제, 취소  --> 데이타 저장 
김연심(kys63) 
0100012006011300033  --> 정상 결제   --> 데이타 저장 안됨 
0100012006011300035  --> 정상 결제, 취소  --> 데이타 저장 
권수경(ss81) 
0100012006011100198  --> 정상 결제   --> 데이타 저장 안됨 
0100012006011100200  --> 정상 결제, 취소  --> 데이타 저장 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.16(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:30 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
------------------------------------------------------------------------ 

MNO: 회원번호 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송) 
-- STORE_CD: 매장코드 
-- ITEM_CD: 상품코드 
-- USE_CMONEY: 사용가능 사이버머니 

CMONEY_USEYN: 사이버머니 사용여부  
------------------------------------------------------------------------ 

- 사은품정보 
[NOWBIZ] 스트라이프 세미클래식 정장+사은품  ==> 00158487 
CJ 압착 올리브유 1L + 퓨어 올리브유 500ml   ==> 00155870 
(/display/prd/prd.jsp?p_store_cd=S019&p_category_cd=T08010301&p_item_cd=00155870&p_display_cd=01) 
==============================================================================================================

- 신용카드 오류 
[ 이상희  64hee Member  ]  ->이분의 아이디로  카드결제하려고 하니 한도가 남아있음에도  
계속 한도초과라는 에러메세지 확인된다고 하심! 
*카드 : 씨티비자 4743 6164 0102 5538 
카드사처리불가  카드사전화요망 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.17(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
------------------------------------------------------------------------ 

- Linked Servers 사용법 
Security --> Linked Servers --> New Linked Servers(마우스 오른쪽 버튼)  --> 새창 
General 에서 
Linked Server: IIISHOP 
Product Name: MS OLE DB Privder for Oracle 
Linked Server: IIISHOP 
Data source: IIISHOP 
Provider string: IIISHOP 
Securiy 에서 
Be made using this security context:  
Remote login: IIISHOP 
with password: IIISHOP 
================================================================================= 

- sp_addlinkedserver의 사용법(사용 안 됨) 
> 다른 sql 서버의 이름 : mjkkkj 
> 다른 sql 서버내의 sql db 이름 : aps_db 
> 다른 sql 서버내의 sql db 내의 table명 : planOut 
sp_addlinkedserver 'mjkkkj' 'sql server' 
로 서버를 연결해줍니다.(mssql일 경우) 
그다음 select * from mjkkj.aps_db.dbo.planout 
쿼리하시면 됩니다. 
아~ 로긴을 추가하시고요. 
-------------------------------------------------------- 
addlinkedserver 'IIISHOP' 'ORACLE' 
select * from IIISHOP.IIISHOP.dbo.T_DEPEND_ORDER 
==============================================================================================================

- 공인인증서(명의 변경 수정) 
김은경(i2244) 
주민번호: 651115-20 
도메인 : fully.i3shop.cc  
접수번호 K6494 2005년11월 21일 
----------------------------------------------- 
- RA 사이트 
IVY/인천 ra.i3shop.com  i3119/5814   
==============================================================================================================

- 신용카드 오류 
고초혜       hea962000 
카드번호 : 5377-3210-0128-3302  
15만원가량 주문할려고 시도를 했는데 계속 적으로 결제가 안된다고하세요.. 
오류난 내역있는지 확인부탁드립니다.  
==============================================================================================================

- 06년 설매장 홍보 SMS 전송 
최근 3개월 내 L&B 구매 회원 4000건 전송  ==> 11:26 11:30 (4분 소요)  ---> 06년 설매장 홍보(58) 
SMS 발송 문구:  "i3shop 만사형통 선물대전~ 다양한 이벤트가 가득히...설날 감사의 마음을 전하세요^^" 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.18(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:10 ~ 23:50 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
==============================================================================================================

<body onload="go();" onblur="exit();"> 
이렇게 했는데 onload 만 작동하구 
onblur onunload는 작동 안하네요 
==============================================================================================================

- 신용카드 오류 
BC카드 수정(ID당 300만원 한도 체크 후 결제 하는 것으로 수정) 
김봉숙 sky59 0100012006010400735 0100012006010400736   --> BC카드 
이은숙 been01 0100012006010600428 0100012006010600431   --> BC카드 
이미행 6799green  0100012006010700094 0100012006010700093 
김갑재 angel777 0100012006010900309 0100012006010900313   --> 국민카드(정상) 
허영태 smile5026   0100012006011300022   0100012006011300026 
고철규 park2101 0100012006011700461 0100012006011700470 
김영자 topnet01 0100012006011800022 0100012006011800023  
------------------------------------------------------------------------ 
김관용        pooos1 
BC카드 결제를 하는데 isp 인증을 받았음에도 불구하고 화면이 넘어가질 않는다하세요.  
카드번호 : 9410-2131-9459-9209 BC 
==============================================================================================================

- 킬러앱 오류 
킬러앱 상품이 아닌 것 파라미터와 대조하여 걸러냄(기존 킬러앱 상품이 존재하는 것만 대조하여 걸러냄) 
/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U02010102&p_item_cd=00159520&p_display_cd=01 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.19(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니, 업체배송용 장바구니 
------------------------------------------------------------------------ 

MNO: 회원번호 
SHIP_CL_CD: 배송구분코드(01:마트배송, 02;R&F, 03:업체배송)  ---> p_ship_cl_cd 
-- STORE_CD: 매장코드 
-- ITEM_CD: 상품코드 
-- USE_CMONEY: 사용가능 사이버머니 

CMONEY_USEYN: 사이버머니 사용여부  
==============================================================================================================

- 정수기 수정 
후레쉬 이관 프로그램 유, 무상 여부 추가 
배송 메세지 수정 가능(주문상태가 설치완료(04) 인 것 포함) 
<18807>--> 접수취소 
==============================================================================================================

- OLEDB 연결 
관련 사이트(http://www.taeyo.pe.kr/lecture/9_Board2001/Board2001_02.htm) 

Dim strConnect, adoCn 
Set adoCn = Server.CreateObject("ADODB.Connection")  

'strConnect = "Provider=SQLOLEDB;Data Source=(local);Initial Catalog=pubs;user ID=xx;password= xx;" 
strConnect = "Provider=SQLOLEDB;Data Source=210.123.133.39,1443;Initial Catalog=Depend;user ID=sa;password=ckrladl;" 
adoCn.Open strConnect 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.20(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니, 업체배송용 장바구니 
------------------------------------------------------------------------ 

//카트담기(PV가 있는 상품여부는 이곳에서 체크한다.) 
resultHash = cart.addItemOnCart(outHash_2); //장바구니 담기  =======>  

addOnCart() 

//장바구니에 하나의 상품을 Append 
cartVec.add(inputHash); 
------------------------------------------------------------------------ 

private Vector cartVec; //장바구니 리스트 
private Vector cartVec_Ja; //장바구니 리스트 Vector(자사배송) 
private Vector cartVec_Up; //장바구니 리스트 Vector(업체배송) 
==============================================================================================================

- 신용카드 오류 
BC카드 수정(ID당 300만원 한도 체크 후 결제 하는 것으로 수정) 
BCcard_Hando.jsp 생성하여 BC카드 기존 사용 금액(p_BCcard_amt_payed)을 이미 받아 와서 
javascript에서 총 결제 한도 체크 
최금주  birde  01000120060118 00600  0100012006011800604  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.21(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 20:00 

- 쇼핑몰 수정
- 장바구니 수정  
- 부원 마무리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.23(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니, 업체배송용 장바구니 
------------------------------------------------------------------------ 

<%-- 장바구니 리스트 보이기 --%> 
<jsp:include page="/order/cartListDispS.jsp" flush="true" /> 
==============================================================================================================

- 정수기 수정 
필터교환권(교환비용) 조회에서 제외 
배송일자(txt_DELIVER_DT), 설치일자(txt_INSTALL_DT) 위치 추가 
==============================================================================================================

- 공인인증서(명의변경 수정) 
김미애(gmtex)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.24(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:30 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니, 업체배송용 장바구니 
ORDER_CRT_DTL_TP = ""; //주문발생상세유형코드 클리어 
------------------------------------------------------------------------ 

배송구분코드 셋팅(ORDER_CRT_DTL_TP  01=일반, 02=RnF) 

//주문발생상세유형코드(일반(01) 혹은 R&F(02)) 
String p_order_dtl_tp_cd = (String)inputHash.get("p_order_dtl_tp_cd"); 
------------------------------------------------------------------------ 

<!-- // 장바구니 벡터 생성  //--> 
<%@ include file="/cart/mk_cartVec.jsp" %> 
==============================================================================================================

- 정수기 수정 
주문번호->18971 접수취소 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.25(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니(01:마트배송, 02;R&F), 업체배송용 장바구니(03:업체배송) 
p_ship_cl_cd //배송구분코드 반환(01:마트배송, 02;R&F, 03:업체배송)  
==============================================================================================================

- 정수기 수정 
해피콜에 민원 접수자 추가 
------------------------------------------------ 
주문상태 변경 
이전 주문유형에 접수취소(00) --> 주문상태에 접수취소(00) 
- 주문유형(01:주문, 02: A/S, 03:이전설치, 04:반품, 06:신품교체) 
- 주문상태(00:접수취소, 01:처리보류, 02:휘레쉬 이관 완료, 03:휘레쉬 미이관, 04:설치완료) 
------------------------------------------------------------------------------------------------ 

- 정수기 Time out(MS-SQL) 에러 
1. 클라이언트 쪽에 MDAC 2.6 이상을 설치한 후 재부팅 연결 
==============================================================================================================

- 신용카드 오류 
최금주  birde  0100012006011800600  0100012006011800604  국민 
방미경 y200   0100012006012400281  0100012006012400295 비씨  
김순이  suni777   0100012006012300321  0100012006012300330  비씨 
이중주문건 주문번호입니다   
- 신용카드 결제 처리 중 문구 
신용카드 결제 처리가 네트워크 상황에 따라 시간이 오래 걸릴 수도 있으니 
결제 버튼을 누르시고 결과 페이지가 나타날 때까지 기다려 주십시요. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.26(목) 작업 ■■■■■■■■■■■■■■■■
---> 08:10 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니(01:마트배송, 02;R&F), 업체배송용 장바구니(03:업체배송) 
p_ship_cl_cd //배송구분코드 반환(01:마트배송, 02;R&F, 03:업체배송)  
==============================================================================================================

- 정수기 수정 
해피콜에 민원 접수자 추가 
-------------------------------------------------------------------------------------------------------
주문번호--><18737>   접수취소 
==============================================================================================================

이상영 주임  031-763-1431 직통 입니다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.27(금) 작업 ■■■■■■■■■■■■■■■■ 
---> 08:10 ~ 19:00  --> 설 연휴 전 날: 13:00까지 정상 근무 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니(01:마트배송, 02;R&F), 업체배송용 장바구니(03:업체배송) 
p_ship_cl_cd //배송구분코드 반환(01:마트배송, 02;R&F, 03:업체배송)  
==============================================================================================================

- 빌라 관리비 송금 
김윤임(*) 
농협(150017-52-377791)  주소: 동구 신천4동 322-20 상운빌라트 B동 201호 
------------------------------------------------------------------------------------------------------- 
- SMS 확인 문자 
상운B동 201호..06년 1월 관리비 2만원 농협으로 송금했습니다. 감사합니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.30(월) 작업 ■■■■■■■■■■■■■■■■
---> 16:00 ~ 22:00  --> 설 연휴 당직 

- 쇼핑몰 수정
- 신용카드 한도 초과(BCcard, HANAcard) 
KEY-IN한도초과  거래방법수정요망 
2006-01-28 오후 4:00:11 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.01.31(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 쇼핑몰 수정
- 장바구니 수정 
T_CART(장바구니 정보), T_CART_TYPE(장바구니 상품 유형 정보) 
자사배송용 장바구니(01:마트배송, 02;R&F), 업체배송용 장바구니(03:업체배송) 
p_ship_cl_cd //배송구분코드 반환(01:마트배송, 02;R&F, 03:업체배송)  
==============================================================================================================

- 정수기 수정  
now_today = Mid(Date, 1, 4) + Mid(Date, 6, 2) + Mid(Date, 9, 2)     '오늘 날짜(VB) 
ODBC SQL Server 문을 준비할 수 없다 ---> UPDATE문에 ORDER_STS 2번 써서 에러가 남 
==============================================================================================================

- 신용카드 오류(이중 결제) 
권영준  52toma  0100012006012500377,0100012006012500384 (비씨) 
김숙희  p15007 0100012006012500400  0100012006012500418 (비씨) 
문영신    com3421  0100012006012600281  0100012006012600284  0100012006012600287 (국민) 
박미숙 happy68  0100012006013100326  0100012006013100329 (국민) 
주문번호 보내드려요.. (*->자료는 취합되는대로 계속 보내드릴께요) 
==============================================================================================================

- 현재 마이크로소프크의 보안 패치로 인하여 
보안 패치를 받으신 분들은 레포트 를 출력해 보실수 없습니다. 

사용하시기 위해서는  
제이판 >> 프로그램 추가 삭제 (Sp2 사용자는 상단 업데이트 표시 체크) 
에서 window 핫픽스 - KB896727 번을 삭제 하신후 재부팅하여 사용 하시면 됩니다. 

이에 관련 하여 마이크로소프트와 Contact 중이오니 양해 부탁 드립니다. 
감사 합니다. 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
