

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2006.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2006.04.01(토) 작업 ■■■■■■■■■■■■■■■■■
---> 07:20 ~ 13:00 

- 쇼핑몰 수정
- 세금계산서 수정 
세금계산서 출력(taxBill.xml), 계산서 출력(taxBill_noTax.xml): OZ 리포트 완성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.03(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 04:30 ==> 3월 마감 

- 쇼핑몰 수정
- 세금계산서 수정 
TAXCHECK_CNT   세금계산서발행수량 
---------------------------------------------------------------------------------- 
- 절대값 조회 
SELECT ABS(1-2) FROM DUAL 
==============================================================================================================

- 신용카드 에러 
%%   김순옥    tnshl7    Silver-M    
신한은행 결재시 시스템 장애라고 나온다심 
명순주(김숙옥님 남편)님 가족 카드이며 카드 소유주 이름은 김순옥님으로 결재시 안심클릭+공인인증 다 김순옥님으로  
받았다고하심  - 카드사에서는 아무런 이상이 없다고하심   
안심클 104400  공인인증서  
[신한은행  4518-4201-0492-9283  김순옥]  
확인후 전화 * 
==============================================================================================================

- 공인인증서(휴대폰 결제) 점검 
2006-04-01 14:23 399862594 9809 197416325 
공인인증서결제 승인 결제 2,200  --> 결제 취소 요망 
==============================================================================================================

- 수불장 점검  
20051230 부터수불장 입고원가에 0원이 찍힘 
원인:  
UPDATE T_DAY_SUBUL  
SET IPGO_WONGA = 0, --입고반품원가 ===> IPGORET_WONGA로 수정 
IPGORET_WONGA_VAT = 0 --입고반품원가(VAT) 
WHERE SUBUL_DATE = VAR_SUBUL_DATE 
AND IPGORET_QTY = 0 --입고반품수량이 0 이면 
;  
---------------------------------------------------------------------------------- 

조치: 20051230 ~ 20060403 ---> 01:34 ~ 08:00 
==============================================================================================================

http://textilemart.co.kr/ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.04(화) 작업 ■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:00 

- 통합 수정
- 세금계산서관리 
세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) --> 3181   ===> 완성 
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182 
==============================================================================================================

- 신용카드 에러 
최선예       hodo69        Active-Master 
공인인증서 만료기간도 2006년 12월이고, isp도 등록했는데 결제할려니 isp인증오류라고 해서 결제가 안된다고 하시며 문의 
카드 소유주와 공인인증서 발급 대상자 동일하다고 하심.  
* 카드번호: 4579-9389-4824-1017 국민카드  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.05(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
- 세금계산서관리 
세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) --> 3181   ===> 완성 
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182 
==============================================================================================================

- 킬러앱 제한 수량 수정 
주문정보 입력 3단계(/orderPut_3.jsp) 
구매제한 수량 상품 정보 저장(/KillerApp_jaehanS.jsp) 수정 
원인: T_BUYLIMITCOUNT 테이블 카테고리코드(CATEGORY_CD: U02010101)와 장바구니 카테고리코드(U02010101)3가 다름 
조치: 카테고리를 3자리(U02)에서 비교 
p_category_cd_3 = util.getData("p_category_cd",irowHash).substring(0,3);  --> U02 
p_category_cd_DB_3 = util.getData("CATEGORY_CD",irowHashDB).substring(0,3);  --> U02 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.06(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:00 --> 이문준 실장님 생일(카스파리: 뉴영남 호텔 건물) -> 볼링 

- 통합 수정
- 세금계산서관리 
세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) --> 3181 
세금계산서합계표관리(/BizMgr/TaxBill/TaxBillHapListP.jsp) --> 3120 
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182  

- 연락처, 휴대폰 추가 
- 발급요청 기간 
요청하신 주문건은 세금계산서 요청을 하실 수 없는 상태 입니다. 
세금계산서 발급요청가능기한은 분기마감후 10일 이내 입니다. 
==============================================================================================================

- 매입장 수정 
0100012006032900474 
통합에 매출은 3월달로 잡혔구요~~ 
매입이 업체에서 배송완료를 오늘날짜로 눌러서 4월 매입으로 잡힙 
마감일자(MAGAM_DATE) 20060405 --> 20060331 
세금계산서취합일자, 송금일자도 20060331로 처리 
==============================================================================================================

- i3shop개인 컴 램 추가 
삼성 1GM 램(양면) 추가 --> 1.5GM(256M 2개 반납) 
기존 256M 4개(1GM) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.07(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 통합 수정
- 세금계산서관리 
세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) --> 3181 
세금계산서합계표관리(/BizMgr/TaxBill/TaxBillHapListP.jsp) --> 3120 
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.08(토) 작업 ■■■■■■■■■■■■■■■■
---> 09:00 ~ 14:30   --> 격주 휴무 

- 통합 수정
- 세금계산서관리
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.10(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 --> 영어회화 첫날 

- 통합 수정
- 세금계산서관리
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) --> 3182 
과세: 6,113 비과세: 2,242  --> 8,355 
==============================================================================================================

- 조흥(CHB)카드 결제 변경 
ISP → 안심클릭 
--------------------------------------------------------------------- 

      @@@@@@@@ 신한카드와의 통합에 따른 결제 방식 변경 안내  @@@@@@@@  
1. 귀사의 무궁한 번창을 기원합니다.  
2. 신한카드와의 통합으로 인해 2006.4.3일부로 조흥(CHB)카드가 신한카드로 전환될 예정인 바,  
다음과 같이 조흥(CHB)카드의 인터넷결제 승인방식이 변경되오니 귀사의 쇼핑몰을 이용하시는  
고객께서 결제하시는데 착오가 없도록 공지 안내하여 주시기 바랍니다.  
                  -   아          래   - 
1. 대상 카드: 조흥(CHB)카드  
2. 대상 서비스: 신용카드 결제 
3. 대상 업체 : 모든 직/대행 가맹점 
4. 작업 목적: 조흥(CHB)카드에 대한 신한카드 전환 결정(비씨 제외) 
5. 시행 일자: 2006년 4월 3일(월) 00:00 ~ 02:00  
6. 변경 내용 : 인터넷 안전결제(ISP) → 안심클릭으로 승인방식 변경.  끝. 
==============================================================================================================

- 신용카드 에러(이중 결제) 
0100012006031600558 카드 번호 9415-2024-6579-1129  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.11(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00    ---> 증조 할배 제사(포항집: 종근이 아제, 할매) 

- 통합 수정
- 세금계산서관리 
  
세금계산서월발행관리(/BizMgr/TaxBill/TaxBillMonthListP.jsp) 
과세: 6,113 비과세: 2,242  --> 8,355 
----------------------------------------------------------------------------------------------------- 

T_TAX_BILL 저장  --> T_TAX_BILL_DTL 저장  --> T_TAX_BILL_DTL 수정(PUBLIC_NO UP) 
--> T_ORDER_DTL 수정(TAXCHECK_CNT UP)  
----------------------------------------------------------------------------------------------------- 

- 금계산서 상세 정보 UPDATE(2개 테이블에서 수정) 
-- 3. 세금계산서 상세 정보 수정 @@@@@@@@  
-- UPDATE T_TAX_BILL_DTL U 
SET U.PUBLIC_NO = (SELECT A.PUBLIC_NO 
   FROM T_TAX_BILL A 
   WHERE A.MNO = U.MNO    
   AND U.PUBLIC_NO = '1'     
)  
WHERE EXISTS 
   (SELECT 'x' 
    FROM T_TAX_BILL A 
WHERE A.MNO = U.MNO 
  AND U.PUBLIC_NO = '1' 
  ) 
--; 
==============================================================================================================

- 어린이날 행사 SMS 전송(4/11) 
최근 3개월 내 MART매장 최다고객 2,500명  --> 어린이날행사(65)  ==> 12:22 ~26(6분 소요) --> 2,919 건 
SMS 발송 문구: "[i3shop 공지]어린이날행사!리틀북(보드북전33권)국내최저가세일+사은품 증정 3만2천원" 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.12(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:20 ~ 23:30 

- 통합 수정
- 세금계산서관리
세금계산서합계표관리(/BizMgr/TaxBill/TaxBillHapListP.jsp) 완성 
과세: 5,928 비과세: 2,229  --> 8,157 
==============================================================================================================

- 킬러앱 주문 에러 
%%   조대섭   dannycho   무료회원 
20060412, 조대섭, 0100012006041200024,  
1 - 노블레스매장 - (K)LG Super Slim TV(29인치) - 29FS2R - 349000 - 1  
leshop.mart.cc(리설러: 송인호(leshop1)) 
조대섭(dannycho/*) 
http://leshop.mart.cc/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51&p_item_cd=00160185 

원인: 상위 도메인 회원이 로그인 여러번 하면 로그인 세션(상단 메뉴가 휘레쉬로 되어 있어 refresh 정확하게 안 됨)이 남아 있어서  
로그아웃 후 하위 무료회원이 로그인 해도 킬러앱 구매가능 
해결: 장바구니 담기할 때 무료회원이 킬러앱 구매 못 하도록 로직 수정 
----------------------------------------------------------------------------------------------------------- 
tamario.i3shop.cc(리설러: 진태만(tamario26))   ====> TEST 
이후남(withhoo/leeahn) 
http://tamario.i3shop.cc/display/prd/prd.jsp?p_store_cd=S065&p_category_cd=U02010101&p_display_cd=51&p_item_cd=00160185 

if (p_store_cd.equals("S065") && p_category_cd_3.equals("U02")) { //킬러앱 상품이면 
if (strMemgbn.equals("01")) { //회원구분이 일반회원 이면 
go_cart_put ="0"; 
%> 
<script language="javascript"> 
alert("킬러앱 상품은 [리셀러] 회원 분만 구매가 가능 합니다."); 
history.go(-1);   
</script> 
<% 
} 
} //end of if --> //킬러앱 상품이면 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.13(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:40 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서관리  
발급요청 기간 설정: 분기마감후 10일 이내만 신청, 출력 가능 
==============================================================================================================

- 날짜 설정(JSP) 
//오늘날짜(systemdate)  
Calendar calendar = Calendar.getInstance(); 
String TODAY = "", tmpYY = "", tmpMM = "", tmpDD = "";  
tmpYY = String.valueOf( calendar.get(Calendar.YEAR) );  
tmpMM = String.valueOf( calendar.get(Calendar.MONTH) + 1 ); 
tmpDD = String.valueOf( calendar.get(Calendar.DAY_OF_MONTH) ); 

if( tmpMM.length() < 2 )  
tmpMM = "0" + tmpMM;  
if( tmpDD.length() < 2 )  
tmpDD = "0" + tmpDD; 

TODAY = tmpYY + tmpMM + tmpDD; 
------------------------------------------------------------------------------------------------------- 

- 한달 전 날짜 세팅(1년 전) 
SELECT SYSDATE,  add_months(SYSDATE, -12) FROM DUAL; 
==============================================================================================================

- 킬러앱 제한수량 처리 
이연화/ra80 
20060413, 이종숙, 0100012006041300016,  
1 - 노블레스매장 - (K)박스)하기스골드 4단계 남아 60*3팩() - 2005년 10월 출시 - 58000 - 1 
>>>> 이거 한개 더 구매 할수 있도록 풀어주세요~ ^ ^ 
==============================================================================================================

- 공인인증서 점검 
ISP결제시 이동식 디스크 공인증서 안 보임  --> 김성애(song7735) 
처리: ISP결제도 같이 A드라이브에 넣고 공인인증서 결제를 해야 함. 
30만원 이상이면 ISP결제 인증 후 공인인증서 결제 인증을 해야 함. 
(A드라이브로 2개다 하려면 ISP결제 인증 창이 띄면  
밑에 나오는 ISP 관리 신청/재신청 클릭 --> 저장위치(A:) 선택 후 ISP 인증서 복사 클릭 --> A:로 보임) 
---------------------------------------------------------------------------------------------- 
공인인증서 확인 방법 
http://www.signgate.com/individual/indi05.htm 
4. 인증서 보기 
컴퓨터나 기타 저장매체에 인증서가 있는지 확인하고 선택한 인증서의 세부 내용 확인 
창이 띄면 A드라이브 인지 C드라이브인지 볼 수 있음 

신관길 대리 --> 02)871-6622   내선:122 
http://www.virtualcard.co.kr 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.14(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 23:00 ==> i3shop 바닥 공사(2층, 3층, 4층....15시 부터 짐꾸리기) 

- 쇼핑몰 수정
- 세금계산서관리  
반품 세금계산서 취합(inquiry/TEST/taxCheckReqP.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.15(토) 작업 ■■■■■■■■■■■■■■■■
---> 10:00 ~ 20:00 ==> i3shop 바닥 공사(16시 종료) ==> 대규 할매 제사(대규 본가: 선주 누나 방문) 

- 쇼핑몰 수정
- 세금계산서관리  
반품 세금계산서 취합(inquiry/TEST/taxCheckReqP.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.17(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:45 ~ 20:30 --> 현노집(양산 이사) 

- 쇼핑몰 수정
- 세금계산서관리  
- 환불처리(현금) (/System/AclMgr/Refund/refundForCashMainP.jsp) 
환불금계산완료(24)  ---> 환불완료(29)  
-------------------------------------------------------------------------------- 
회계기준 반품: 환불완료(29)   
==============================================================================================================

SELECT A.PUBLIC_NO, (A.COMPANY_CD  A.MERCHANT_CD  A.ORDER_DT  A.ORDER_NO) AS ORDER_NO_FULL,  
   A.SEQ_NO, A.ITEM_CD, A.ITEM_NM, A.REAL_QTY, A.REAL_SALE_PRICE 
FROM T_TAX_BILL_DTL A, T_TAX_BILL B  
WHERE TRIM(A.PUBLIC_NO) = TRIM(B.PUBLIC_NO)  
AND A.COMPANY_CD = '01' 
AND A.MERCHANT_CD = '0001' 
AND A.ORDER_DT = '20060417'   --주문일자 
AND A.ORDER_NO = '00131'   
AND A.REAL_QTY > 0 
AND B.TAX_YN = 'Y' 
==============================================================================================================

UPDATE T_ORDER 
SET ORDER_STS = '02'     
WHERE COMPANY_CD = '01' 
AND MERCHANT_CD = '0001' 
AND ORDER_DT = '20060417' 
AND ORDER_NO = '00212' -- 00131(02 -->03),  00212(28 -->24) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.18(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:30 --> 세금계산서 2차 PT 

- 쇼핑몰 수정
- 세금계산서관리  
- 환불처리(현금) (/System/AclMgr/Refund/refundForCashMainP.jsp) 
환불금계산완료(24)  ---> 환불완료(29)  
- 환불처리(카드) (/System/AclMgr/Refund/refundForCardMainP.jsp)  
==============================================================================================================

- SMS 문자 전송 
종가집김치 사은전 전송(4/18) 
최근 2개월 내 Dept 130, 160 구매자 3,500명 --> 종가집김치 사은전(66)  ==> 09:43 ~26(6분 소요) --> 434 건 
SMS 발송 문구: "(i3shop 공지)종가집 포기 5kg + 남도포기 3kg 최저가 39,800원 + 사은품 추가 증정" 
==============================================================================================================

- 신용카드 결제 확인 
주문번호 : 2006041700340 
주문자 : 박희오(bho72) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.19(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:55 ~ 21:00 --> 화공과 축구부 회의(유니폼 제작) 

- 쇼핑몰 수정
- 세금계산서관리  
- 세금계산서합계표관리(/BizMgr/TaxBill/TaxBillHapListP.jsp) 수정 
- 세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) 수정 
발행취소(TAX_BILL_STS: 03 --> 05), 신청취소(TAX_BILL_STS: 01 --> 05) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.20(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서관리  
- 세금계산서합계표관리(/BizMgr/TaxBill/TaxBillHapListP.jsp) 수정 
- 세금계산서발행관리(/BizMgr/TaxBill/TaxBillListP.jsp) 수정 
발행취소(TAX_BILL_STS: 03 --> 05), 신청취소(TAX_BILL_STS: 01 --> 05) 
==============================================================================================================

- 문자열을 구분자로 나누기 
일반적인 방법은 INSTR로 위치를 찾아서 SUBSTR로 자릅니다. 
INSTR('0303-242-8823', '-') ----> '-' 위치를 알아냄(5번째) 
SUBSTR(RTRIM('03036-242-8823'), 0, INSTR('03036-242-8823', '-')-1) AS TEST1_R ----> SUBSTR로 자름(0303) 
INSTR(PHONE, '-') AS 첫번째_위치확인, INSTR(PHONE, '-', INSTR(PHONE, '-')+1) AS 두번째_위치확인, 
String dd = "20001207"; // 이렇게 받아오면 말이죠.  
dd = dd.substring(0,4)+"-"+dd.substring(4,6)+"-"+dd.substring(6,8); 
==============================================================================================================

- SMS 문자 전송 
세금계산서관리 발행(990) 
월 상품 구매 고객 --> 세금계산서관리 발행(990) 
SMS 발송 문구: "[i3shop 공지]개인 쇼핑몰에 2006년 4월 세금계산서가 발행 되어 있습니다.출력가능함" 
==============================================================================================================

Fatal Error: Unable to write to the transaction log (/D:/orion_ccdom3/persistence/transaction.state),  
possible reasons for this are that Orion lacks permission to write to the file,  
or that another instance of the server is already running with this configuration (most common):  
Unable to alter transaction log 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.21(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:00 

- 쇼핑몰 수정
- 컴퓨터 포맷 후 재설치 
필수 프로그램 설치 
==============================================================================================================

- 월드컵 경품추첨 이벤트 테이블 생성 
T_WC_ENTRY_ORDER: WC 응모 주문 정보 
T_WC_ENTRY_LOGIN: WC 응모 로그인 정보 
T_WC_ENTRY_JOIN: WC 응모 가입 정보 
T_WC_ENTRY_TRY: WC 응모 시도 정보 
---------------------------------------------------------------------------------------------------------------------

- 서울지사 오픈기념! 행운의 경품 대축제!! 
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
\\211.233.5.116\WebSphere\installedApps\BizStore.ear\BizStore.war\display\event\event_20060503\MainP.jsp 
==============================================================================================================

- toad 로그인 에러 
toad를 오라클에 붙이려는데요, 초기화 오류가 나네요. 
Initialization error Could not locate OCI dll 
---------------------------------------------------------------------------------------------------------------------
해결책: TOAD 로그인시 SQL * Net Compatible Net8 체크 후 로그인 할 것 
==============================================================================================================

- 반품 상품 확인 
0100012006041700212 상품코드: 00157715 
금호미곡종합처리장 ---> B0000632/2545  
---------------------------------------------------------------------------------------------------------------------
반품완료: 0100012006041800420 
==============================================================================================================

- 정수기 후레쉬워터 자료업로드시 변경 사항 
주문상태, 완료상태, 배송일자, 설치일자, 처리일자, 처리내용  
사용부품, 사용부품 수량, 수령자명, 수령자전화번호, 수령자핸드폰, 수령지주소  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.22(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:55 ~ 20:00 

- 쇼핑몰 수정
- 월드컵 경품추첨 이벤트 수정 
로그인(/customer/loginfP.jsp) 
- 로그인시 응모기회 1회 부여 
- 회원 가입시 응모기회 5회 부여 
- 상품 구매시 응모기회 부여 : 3만원 단위로 응모기회 부여 
킬러앱, R&F제외, BC카드 2배 부여 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.24(월) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:00 

- 쇼핑몰 수정
- 월드컵 경품추첨 이벤트 수정 
무료회원가입(/customer/freememRegistfP.jsp): 완료 
리셀러회원가입(/customer/resellerRegistfP.jsp): 완료 
- 회원 가입시 응모기회 5회 부여 
  
- 서울지사 오픈기념! 행운의 경품 대축제!! 메인 수정): 완료 
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
==============================================================================================================

- Eclipse 에러(javaw.exe 비정상 종료) 
Fatal Error: Unable to write to the transaction log (/D:/orion_ccdom3/persistence/transaction.state),  
possible reasons for this are that Orion lacks permission to write to the file, 
or that another instance of the server is already running with this configuration (most common):  
Unable to alter transaction log  
해결: 작업관리자(T) --> 프로세스 --> javaw.exe 가 보이면   
프로세스 끝내기(E)를 클릭하여 모두 삭제할 것 
==============================================================================================================

- SMS 문자 전송 
어린이날 행사2(67) - 1회 (4월 24일 발송) 
월 상품 구매 고객 -->최근 3개월 내 MART매장 최다고객 리셀러 2,500명(매출순) 
SMS 발송 문구: "[i3shop 공지] 어린이날 행사! 로보사피엔V2 최대 40% 가격할인!!최저 15,800원부터~" 
==============================================================================================================

인터넷을 하다보면... 
Microsoft Internet Explorer에 문제가 있어서 프로그램을 종료해야 합니다. 불편을 끼쳐드려서 죄송합니다. 
뜨면서 오류보고 보내기가 뜨면서 인터넷이 죽습니다... 
원인이 어떤문제인지 답변부탁드림니다....^^  
==============================================================================================================

- javaw.exe 
 Access Violation 0xc0000005 오류코드는  
윈도우에서 각종 DLL 로드 할때, 발생하는 에러를 총괄적으로 표현할 때 
사용합니다. (주로 네트워크 관련 dll 들 ) 
  
대부분 보안 패치나, 윈도우 업데이트 후 사라지기도 합니다.  
입클립스의 경우에는 java 로 native 하게 dll을 호출하기 때문에, dll 오류라고 하기 보다는 입클립스의 버그 일 가능성도  
있습니다.  
jini 말씀데로 버그 질라 검색 해 보세요 .  
다른 pc에서는 정상적으로 동작한다면, 윈도우 dll이 이상하거나 환경이 이상할  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.25(화) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 21:00 

- 쇼핑몰 수정
- 월드컵 경품추첨 이벤트 수정 
주문 정보 저장(/order/orderPut_3.jsp) 
<!-- //월드컵 이벤트 경품응모 저장(상품 주문시) //--> 
<%@ include file="/display/event/event_20060503/WCEvent_OrderS.jsp" %>   
------------------------------------------------------------------------------------------------------------------------------ 
- 서울지사 오픈기념! 행운의 경품 대축제!! 메인 수정 
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
http://euijae.mart.cc/display/event/event_20060503/MainP_TEST.jsp 
==============================================================================================================

- 사업자번호 체크 
http://cafe.naver.com/firstgroup.cafe?iframe_url=/ArticleRead.nhn%3Farticleid=664  

// 사업자 등록번호 검사 (형식 : xxx , xx , xxxxx) 
function isBusinessNo(strCk1,strCk2,strCk3) { 
 arrCkValue = new Array(10); 
 if ( (isLength(strCk1)==3) && (isLength(strCk2)==2) && (isLength(strCk3)==5) ) { 
  if ( (strCk1="111") && (strCk2="11") && (strCk3="11111") ) return true; 
  if ( (isInteger(strCk1,"")) && (isInteger(strCk2,"")) && (isInteger(strCk3,"")) ) { 
   arrCkValue[0] = ( parseFloat(strCk1.substring(0 ,1))  * 1 ) % 10; 
   arrCkValue[1] = ( parseFloat(strCk1.substring(1 ,2))  * 3 ) % 10; 
   arrCkValue[2] = ( parseFloat(strCk1.substring(2 ,3))  * 7 ) % 10; 
   arrCkValue[3] = ( parseFloat(strCk2.substring(0 ,1))  * 1 ) % 10; 
   arrCkValue[4] = ( parseFloat(strCk2.substring(1 ,2))  * 3 ) % 10; 
   arrCkValue[5] = ( parseFloat(strCk3.substring(0 ,1))  * 7 ) % 10; 
   arrCkValue[6] = ( parseFloat(strCk3.substring(1 ,2))  * 1 ) % 10; 
   arrCkValue[7] = ( parseFloat(strCk3.substring(2 ,3))  * 3 ) % 10; 
   intCkTemp     = parseFloat(strCk3.substring(3 ,4))  * 5  + "0"; 
   arrCkValue[8] = parseFloat(intCkTemp.substring(0,1)) + parseFloat(intCkTemp.substring(1,2)); 
   arrCkValue[9] = parseFloat(strCk3.substring(4,5)); 
   intCkLastid = ( 10 - ( ( arrCkValue[0]+arrCkValue[1]+arrCkValue[2]+arrCkValue[3]+arrCkValue[4]+arrCkValue[5]+arrCkValue[6]+arrCkValue[7]+arrCkValue[8] ) % 10 ) ) % 10; 
   if (arrCkValue[9] != intCkLastid) { 
    alert ("잘못된 사업자등록번호입니다. 다시 확인해 주십시오"); 
    return false; 
   } else { 
    return true; 
   } 
  } else { 
   alert("사업자등록번호는 숫자이어야 합니다."); 
   return false; 
  } 
 } else { 
  alert("사업자등록번호의 자릿수가 잘못 입력되었습니다."); 
  return false; 
 } 
} 
==============================================================================================================

- 랜덤 추첨 
소스는 아래와 같습니다.  
랜덤하게 숫자는 뽑아지는데 중복되는 것도 나오네요  
어떻게 처리해야 할지 알려주시면 감사드리겠습니다.  

int val=10; 
int k=0; 
int no=1000; 

for(int i=0;i<val;i++){//추첨할 명수 만큼 for문을 돌린다.  
  k=1+Math.abs(rd.nextInt())%no; //총인원수  
  out.println(k);  
} 
==============================================================================================================

- 치과 치료 
스켈링, 이 땜질 1개: 점심시간 12:00 ~14:00 
김경예치과(신청 4동): 053)743-8102 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.26(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:00 

- 쇼핑몰 수정
- 세금계산서 수정 
사업자 등록번호 검사 함수 수정 
==============================================================================================================

- 월드컵 경품추첨 이벤트 수정 
- 입금확인(/BizMgr/SaleMgr/WebOrderMgr/standByReceiptsP.jsp) 수정 
==============================================================================================================

- 사업자등록번호의 의미(i3shop 예: 504-81-32871) 
1. 첫 3자리: 청,서코드 (흔히 관할 세무서코드라고도 합니다) 
순수한 신규개업자(폐업 후 재개업이 아닌 자)에게만 사업자등록번호 최초 부여관서의 청, 서코드를 부여하며 
관서간 세적이전, 관할구역 변경의 경우에는 청,서코드 변경을 하지 아니한다. 
 - 사업장이 이전을 하여도 사업자번호를 변경하지 아니한다는 뜻 입니다. 
2. 가운데 2자리: 개인사업자,법인사업자 구분코드 
   가. 개인구분 코드 
     1.개인과세사업자: 특정동 구별 없이 01부터 79까지를 순차적으로 부여 
     2.개인면세사업자: 산업구분없이 90부터 99까지를 순차적으로 부여 
     3.소득세법 제1조 제3항에 해당하는 법인이 아닌 종교 단체 - 89 
     4.소득세법 제1조 제3항에 해당하는 자로서 ""그 이외의 자(아파트관리사무소 등)  
        및 영 제7조 제6항의 규정에 의하여 등록한 다단계 판매업자 - 80 
   나. 법인성격코드：법인에 대하여는 성격별 코드를 구분하여 사용한다. 
     1. 영리법인의 본점 - 81.86 
     2. 비영리법인의 본점 및 지점 
         (법인격 없는 사단,재단,기타 단체 중 법인으로 보는 단체를 포함)- 82 
     3. 국가, 지방자치단체, 지방자치단체조합 - 83 
     4. 외국법인의 본,지점 및 연락사무소 - 84 
     5. 영리법인의 지점 - 85 
3. 마지막 5자리중 앞의 4자리: 일련번호코드 과세사업자(일반/간이/특례),면세사업자,  
법인사업자별로 등록 또는 지정일자순으로 사용 가능한 번호를 0001~9999로 부여한다.  
 다만, 비영리법인의 본,지점은 등록 또는 지정일자순으로 0001~5999로 부여하고,  
 국세기본법 제13조 제2항의 규정에 의하여 법인으로 보는 단체는 6000~9999로 부여한다. 
4. 검증번호(마지막 5자리 중 끝의 1자리) 전산시스템에 의하여 사업자등록번호의 오류여부 
를 검증하기 위하여 부여된 특정숫자(Check Bit)이다.  
==============================================================================================================

- 정수기 수정 
0100012004083111331 /주문번호 19770 
산소발생기 소음-> 물냄새/맛이상 으로 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.27(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 23:00 --> 세금계산서 3차 PT 

- 쇼핑몰 수정
- 세금계산서 수정 
과세, 비과세 취합 수정 
==============================================================================================================

- 월드컵 경품추첨 이벤트 수정 
- 서울지사 오픈기념! 행운의 경품 대축제!! 메인 수정 
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
==============================================================================================================

- 정수기 수정 
0100012004052100354 
김연호 신품교체로 접수했는데~ 기타로 수정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.28(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:25 ~ 18:30 --> 강주임 생일(와인 생삽겹 식당) 

- 쇼핑몰 수정
- 월드컵 경품추첨 이벤트 수정 
- 서울지사 오픈기념! 행운의 경품 대축제!! 메인 수정 
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
==============================================================================================================

- 매트라이프 생명(www.metlife.co.kr) 
이윤심  *@*.* HP: * 
053)421-8353 FAX: 053)428-1772 
==============================================================================================================

- 주문 시제 이상  
0100012006032100578(20060321 00578) 
반품주문번호: 20060322 00074 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2006.04.29(토) 작업 ■■■■■■■■■■■■■■■■
---> 07:50 ~ 19:00 

- 쇼핑몰 수정
- 월드컵 경품추첨 이벤트 수정  
http://euijae.mart.cc/display/event/event_20060503/MainP.jsp 
- 응모수 증감 체크, 저장 script 수정 
- 현금입금 완료 수정 
==============================================================================================================

- 치과 치료 
왼쪽 사랑닛 뺌 : 점심시간 14:00 ~16:00 
김경예치과(신청 4동): 053)743-8102 
==============================================================================================================

- 정택이 아제 칠순 
17:30 상드리제(선미, 선주, 선희 누나, 대규, 판섭) 
18:00 고희연 시작 
18:30 연회 
21:30 종료 
21:50 귀가 
------------------------------------------------------------------------------- 

일시: 2006년 4월 29일(토) 19시 
장소: 상드리제 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■