

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------// Memo(2017.12) //--------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.12.01(금) 작업 ■■■■■■■■■■■■■■■■
---> 07:30 ~ 19:00  ==> 본 이행(13시 ~ 18시), 석식(보쌈집, 식당 구부장, 이부장, 강명수 차장, 정현수 차장 ==> 구부장이 쏨)
								, 장현수 차장 철수(18시) 

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 본 이행 
1. 기 간 : 12/1(금) 09:30 ~ 18:30 
2. 주요 일정 
------------------------------------------------------------------------
작업 단계 								수행시간 				TASK담당자 
------------------------------------------------------------------------
시스템 전환 						09:30 ~ 12:50 				최우영, 박우석, 김태우l김기호, 박미리 
응용점검(수행사)   				13:00 ~ 16:00 				응용점검 담당자 
응용점검(고객)  
	- 권한점검 					13:00 ~13:30 				김은주
	- 응용점검						13:10 ~17:00 				안준영, 황진숙  
오픈의사결정회의 				17:30~18:00 				시간별도 협의 ==> 오픈하기로 결정함(19:20) 
응용점검 후속 작업 
	- 데이터클린징 				18:00 ~ 18:30 				김태우
	- 초기데이터입력 			18:00 ~ 18:30 				김은주
	- 인증계정 Enable 			18:30  
	- 방화벽오픈 													조운일 
==============================================================================================================

- 2017.12.01(금) 본이행 운영 TEST ID 공지 
C000646, / cns@1201, 	==> 대리점 아이디(사용) 
(000648, /cns@1201, 
9501197, / cns@1201, 		==> 장기채널영업팀: 이성화(9501197) (사용) 
9501109, / cns@1201, 		 
==============================================================================================================

- 상품소개동의/가입설계동의 주번 
1. 780708-10* 정현호 / 1860617-1* 박준용 
==============================================================================================================

- 수익자등록[B111_Pop] (/CBSC070P.xml, ssr_pln::B111_Pop.xml) [M20170005012, 8001021234563] ==> 완료 @@@ 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab(/CBSC044S.xml, ssr_pln::CBSC044S.xml) 
==> Grid에서 사망외수익자 필드: 팝업 
 1) 저장 후 수익자코드 Display 처리 안됨(AS-IS와 같음) 
==============================================================================================================

- 보험료 요약[B050_Pop] (/CBSC057P.xml, ssr_pln::B050_Pop.xml) 단위테스트[M20170003122] ==> 완료 @@@ 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 보험료산출Tab(/CBSC043S, ssr_pln::CBSC043S.xml) 
 1) 계약사항 Grid에서 선택 체크박스 변경 처리 에러 
if(grd_InsurPerson.getColumnID(collIndex) == "sel") {  	// Grid에서 칼럼 '선택'의 첫번째 열의 체크박스값이 1일 경우 
	// 현재 선택된 체크박스를 제외한 체크박스는 값을 0으로 바꾼다. 
	for (var i = 0; i < Ds_InsurPerson.getRowCount(); i++) ( 
		// console.log("[/CBSC057P.xml] [lfnJnsurPerson_OnColumnChanged()] ==> [Ds_InsurPerson 변경 이벤트]  
		[TEST_41] [ 체크박스는 값을 0으로 바꿈] [i_번째]"+ i +"[Ds_InsurPerson.sel]"+ Ds_InsurPerson.getCellData(i, "sel") 
		+"[piboCheckFlag]"+ piboCheckFlag );  
		
		if(i != nRow && Ds_InsurPerson.getCellData(i, "sel") == "1" && !piboCheckFlag) { 
			piboCheckFlag = true; 
			Ds_InsurPerson.setCellData(i, "sel", "0"); 
			// console.log("[/CBSC057P.xml] [lfnJnsurPerson_ OnColumnChanged01 ==> [Ds_InsurPerson 변경 이벤트] 
			[TEST32] [ 체크박스는 값을 0으로 바꿈] [i_번째]"+ i ); 
			break;
		}
	}
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.02(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 
 
- 주말  
09:00 기상
09:20 TV시청
12:00 중식 ==> 루옌, 수종 다오집에 놀러감
13:00 TV시청 
18:00 루옌, 수종 귀가
19:00 석식 ==> 황금올리브치킨(반반): BBQ대림점 배달
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.03(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
06:00 기상 
06:20 주민등록 등본 출력(초기축구 운동장 예약용) 
06:30 자전거(문영APT -> 대림운동장)  ==> 비 많이 옴(가족 천하 주차장에 자전거 주차)
06:40 창고 ==> 선이형 차로 짐 싣기)
07:10 영신초교 도착
08:20 숏게임 ==> 대훈이 놀러옴
09:00 게임(신길1동 초기회, 3쿼터 뜀): 컨디션 보통
12:00 종료
12:30 중식(동태탕: 해오름 식당): 회에서 쏨
13:20 종료
13:30 선이형 가게 --> 수춘이형이해남에서 김장을 해서 보쌈 가지고 옴(태우, 대훈)
		==> 보쌈 대(45,000원) 주문
16:30 종료
16:50 귀가
15:00 낮잠
19:00 기상
19:20 석식
24:00 취침
=========================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.12.04(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 수종 증명서 사진 구입(EZ Passport Maker, 퍼블로그, 30장 총: 2,698원): 집에서 사진 찍고 편집, 구입 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml) 
1. 단체관리 번호조회(/CBSC037M.xml, ssr_pln::B150.xml) 
==============================================================================================================

- console 로그 제거 요청 
XHR finished loading: GET ''http://localhost:8080/cm/js/wconvJs?postfix=15121145975592805.642305758742". 
==> 크롬에서 Log XMLHttpRequests 체크박스 해제할 것 
==============================================================================================================

- 개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) 수정 
1. 인수심사결재 팝업 처리 ==> 청약심사대상조회(/CBSC111M.xml, ssr_sst::B160.xml) 기준 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml) 수정 요청 
1. Grid에 있는 계약자코드, 피보험자코드를 고객키 변경 요청(안준영 차장이 요청) 
==============================================================================================================

- 보험료 요약[B050_Pop] (/CBSC0S7P.xml, ssr_pln::B050_Pop.xml) [M20170003122] ==> 수정 완료 @@@ 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 보험료산출Tab)(/CBSC043S, ssr_pln::CBSC043S.xml) 
 1) 계약사항 Grid에서 선택 체크박스 변경 처리 에러 
wconv.filter(Ds_LTIDA02, " wconv.pos(sScrnlndcYn, 'Y') >= 0 "); // filter 처리(화면출력특약 여부) ==> 추가
wconv.filter(Ds_LTIDA02Group, " wconv.pos(sScrnlndcYn, 'Y') >= 0"); 	// filter 처리(화면출력특약 여부) 추가
==> * @example wconv.pos("abcdeaa", 'γ); 			// return -1 
==> * @example wconv.pos("abcdeaa", "a", 3); 	// return 5 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.05(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 중식(짜장면, 당구: PM, 구부장, 이부장(꼴찌)], [정근욱씨, 나(1등]) ==> 근욱씨 꼴찌 (당구비)) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml)
1. 단체관리 번호조회(/CBSC037M.xml, acc_loan::B150.xml) 
2. 단체수납대상목록(/CBSC038P.xml, acc_loan::7806_Pop.xml) 
==============================================================================================================

- promise 설정(Child 생성)
//---------------------------------------------------------------
// 수납확정을 위한 전처리 작업을 한다. 
// 차액이 없으면 바로 수납확정 함수를 호졸하고, 차액이 있으면 차액처리 팝업장 오푼 함수를 호출한다 
//---------------------------------------------------------------
scwin.doCollect = function() { 
	// console.log("[/CBSC090M.xml] [doCollect()] ==> [수납확정을 위한 전처리 작업] [TEST]" ); 
	
	var pro = Promise.resolve(); 	// Promise 설정 
	
	pro = pro.then(function(rv) { 
		return checkcolllectDate(scwin.getMaxFundDate(), scwin.getMinFromDate()); 	// 소급계약 처리여부 확인 
	}); 	// end of promise() 
	
	pro = pro.then(function(rv) { 
		// console.log("[/CBSC090M.xml] [doCollect()] ==> [소급계약 처리여부 확인] [promise_결과값]"+ rv); 
	
		if(!rv) { 
			// console.log("[/CBSC090M.xml] [doCollect()] ==> [소급계약 처리여부 확인 실패] [TEST]" ); 
			return; 
		}
	// console.log("[/CBSC090M.xml] [doCollect()] ==> [수납확정을 위한 전처리 작업] [TEST_02]" ); 
	   
	//차액이 없으면 바로 수납확정 처리한다 
	if(wconv.toNumber(Mak_nDiffAmt.getVale()) == 0) { 
		scwin.doCoIiSettle(0, "1");		// 차액없음
	} else { 
		var sDiffAmt = util.appendComma(Mak_nDiffAmt.getValue()); 	// 차액(3자리  콤마) 
	 
		// 가상계좌만 차액에 따른 분할정산 가능, 그외 금종은 불가능
		if(wconv.toNumber(Mak_nDiffAmt.getValue()) != 0) { 
			if(sVirtualCnt == 0 || sEtcCnt > 0) { 
				wprom.alert("차액01 "+ sDiffAmt + "원 발생했습니다￦n수납이 불가합니다."); 
				return; 
			} else { 
				var pro_02 = Promise.resolve(); 		// Promise 설정 
		
				pro_02 = pro_02.then(function(rtnVal) { 
					return wprom.confirm("계상계좌 분할정산 수납확정을 하시겠습니까?"); 
				}); 	// end of promise() 
				
				pro_02 = pro_02.then(function(rst) { 
					if(rst == true) { 	// confirm이 났으면 
						// console.log("[l/CBSC090M.xml] [doCollect()] ==> [pro_02.then] [01. confirm이 났으면]"+ rst ); 
						
						scwin.doCoIiSettle(0, "2"); 	//차 액없음(가상계좌분할정산)  ===> 사실상 여기서 멈춤 @@@ 
					} else {  	// confirm이 안 났으면
						console.log (" [l/CBSC090M .xml] [doCollect()] ==> [pro_02.then] [00. confirm이 안 났으면] "+ rst ); 
					}
				}); 	// end of promise() 
			}
		}
	}
});  
==============================================================================================================

- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_pln::B200_Pop.xml) [청약번호: M20170218144] 
1. 재물청약설계(/CBSC094M.xml, 청약메인(ssr_pln::B030.xml)) > 보험료산출(/CBSC095S.xml, ssr_pln::B030_Div1.xml) 
==> 4. 예상환급금(이미지): 팝업 
2. 현상 납입보험료, 예상환급금 잘못 나옴 
납입보험료 부분이 잘못나오고 환급금 계산도 잘못되고있습니다 ==> 1회보험료가 한번 더 합산되요 
==> 강차장쪽에서 청약 복사 버튼 누르면서 에러가 남
==============================================================================================================

- Grid Ds row 복사 처리 
// 2. 청약내역 세팅 
wconv.clear(Ds_ACCBA01_3); 	// Ds Clear 

for (var k = 0; k < Ds_ACCBA01.getRowCount() ; k++ ) { 		// 청약내역 Ds(Ds_ACCBA01) 
	// console.log("[/CBSC090M.xml] [setcolllectionManual()] ==> [2. 청약내역 세팅] [TEST_18_1][k_번째]"+ k + 
	"[nACCBA01Row]"+ nACCBA01Row +"[보험료]"+ Ds_ACCBA01.getCellData(k, "nExptPrem") 
	+//[계약자명]"+ Ds_ACCBA01.getCellData(k, "sPoIH01derName") + "[sGubun]" + Ds_ACCBA01.getCellData(k, "sGubun") 
	+"[체크_ACCBA01]"+ Ds_ACCBA01.getCellData(k, "ACCBA01") ); 

	if( Ds_ACCBA01.getCellData(k, "ACCBA01") == "1") {  // 체크박스가 선택되었으면 
		//Ds_ACCBA01_3.CopyRow(nACCBA01Row, "DsWs_ACCBA01 ", k);  // ===>  AS-IS(Miplatform 에서) 
		Ds_ACCBA01_3.insertRow(nACCBA01Row); 	// row 추가 
		//wconv.mi_copyRow(Ds_ACCBA01, nACCBA01Row, Ds_ACCBA01_3.getIDQ, k);  // row 복사 처리 
		
		wconv.mi_copyRow(Ds_ACCBA01, k, Ds_ACCBA01_3.getID0, nACCBA01Row);
		// row 복사 처리[복사할 Ds(대상), 붙여넣을 Ds의 Row, 복사할 Ds(Clear 후 처리), 붙여넣을 Ds의 Row] 
		// Ds_ACCBA01_3.setRowJ SON (nACCBA01Row, Ds_ACCBA01.getRowJ SON(i)); 
		// row 복사 처리 ==> JSON Data를 set 또는 append 한다 ==> mi_copyRow 함수 사용할 것 
		nACCBA01Row++; 
	}
}  // end of for()
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.06(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 주간보고, 석식(삼겹살, 맥주, 구부장, 이부장, 송금준 부장 ==> 구부장이 쏨
 
- 더케이손해보험 영업지원S 구축 Prj[★]
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml)
1. 단체관리 번호조회(/CBSC037M.xml, acc_loan::B150.xml) 
2. 단체수납대상목록(/CBSC038P.xml, acc_loan::7806_Pop.xml) 
==============================================================================================================

- 탭 복제(notepad++ 에서) 
1. 보기(V) > 현재 문서 이동 / 복사 > 분할 창으로 복제 
==============================================================================================================

- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_pln::B200_Pop.xml) [청약번호: M20170218144] 
1. 재물청약설계1(/CBSC094M.xml, 청약메인(ssr_pln::B030.xml)) > 보험료산출(/CBSC09SS.xml, ssr_pln::B030_Div1.xml) 
==> 4. 예상환급금(이미지): 팝업 
2. 현상: 납입보험료, 예상환급금 잘못 나옴 
납입보험료 부분이 잘못나오고 환급금 계산도 잘못되고있습니다 ==> 1회보험료가 한번 더 합산되요 
3.	원인: 복사 후 새로운 청약번호에서 영업보험료를 추가해서 예상환급금을 계산함 
4.	조치: 강차장에게 복사 후 새로운 청약번호에서 영업보험료를 제외하고 예상환급금을 계산하라고 통보 
==> select ★ from longterm..LTIDA16 where sPlanNo = 'M20170193723' 
==============================================================================================================

- 사원목록[7010](/CBSO033P.xml, accpopup::7010.xml) 
1. 사원코드에서 숫자만 들어 갑니다   ==> 정상
==============================================================================================================

- Ds 데이타 수동 생성 
//---------------------------------------------------------------
// function 명 : setDataset_03() 
// 내용 	Ds 데이타 생성 처리 
//---------------------------------------------------------------
scwin.setDataset_03 = function() ( 
	console.log("[/CBSC131P.xml] [setDataset_03()1 ==> [Ds 데이타 생성] [TEST_01]" ); 
	
	var iRow = 0; 
	wconv.c1ear(Ds_LTIDA00); 	// Ds Clear 
	iRow = Ds_LTIDA00.insertRow();  	// 기본 정보 Ds 데이타 생성 
	iRow = 0; 

	Ds_LTIDA00.setCellData( iRow , "gUserID", "2110013"); 
	Ds_LTIDA00.setCeIiData( iRow , "gUserIP", "10.1.9.138"); 
	Ds_LTIDA00.setCeIiData( iRow , "nAccuPrem", "19015"); 
	Ds_LTIDA00.setCeIiData( iRow , "nAddPaymPrem", "0"); 
	Ds_LTIDA00.setCeIiData( iRow , "nAnntPymCt", "0"); 
	Ds_LTIDA00.setCeIiData( iRow , "nAppIPrem", "29700"); 
	Ds_LTIDA00.setCeIiData( iRow , "nAuthID", "22040"); 
	Ds_LTIDA00.setCeIiData( iRow , "nBussPrem", "30000"); 
	Ds_LTIDA00.setCellData( iRow , "nCrChngNo", "0"); 
	Ds_LTIDA00.setCeIiData( iRow , "nCrStatCarrSeqno", "1"); 
	Ds_LTIDA00.setCeIiData( iRow , "nDcPrem", "300"); 
	Ds_LTIDA00.setCeIiData( iRow , "nDefrYct", "0"); 
	Ds_LTIDA00.setCeIiData( iRow , "nEndAge", "50''); 
	Ds_LTIDA00.setCellData( iRow , "nEndRtnAmtCaIElmntl", "0.6914930131851944"); 
	Ds_LTIDA00.setCeIiData( iRow , "nEndRtnAmtCaIElmnt2", "0.85"); 
	Ds_LTIDA00.setCeIiData( iRow , "nEndRtnAmtCaIElmnt21", "258.55494054781764"); 
	Ds_LTIDA00.setCeIiData( iRow , "nEndRtnAmtCaIElmnt22", "1.3394657090908932"); 
	Ds_LTIDA00.setCeIiData( iRow , "nEndRtnAmtCaIElmnt3", ''10.082244297059868 "); 
	Ds_LTIDA00.setCellData( iRow , "nEndRtnAmtCaIElmnt4", "14.954364863599633"); 
	// console.log("[/CBSC131P.xml] [setDataset_03()] ==> [Ds_LTIDAO0, Ds_LTIDA00.getRowCount() 
	+"[Ds_LTIDA00]"+ WebSquare.xml.serialize(Ds_LTIDA00.getAllXML()) ); 
};
 
//---------------------------------------------------------------
// function 명 : Ifn_Search 
// 내용 	: 해지환급금 조회 
//--------------------------------------- 
scwin.lfn_Search = function() { 
	console.log("[/CBSC131P.xml] [lfn_Search()] ==> [해지환급금 조회] [TEST_01]" ); 
	
	scwin.setDataset_3();  	// Ds 데이타 생성 처리 ==> TEST @@@ ===> 
	console.log("[/CBSC131P.xml] [lfn_SearchO] ==> [Ds_LTIDAO0, 갯수_01]"+  Ds_LTIDA00.getRowCount()
	+"[Ds_LTIDA00]"+ WebSq ua re.xml,seria I ize(Ds_LTIDA00.g etAllXML()) ); 
	
	var MethodObj= new caIiService("com.inswave.longterm.ssr.ssttask.DBB200Task", "getExptRtnAmt"); 		// 해지환급금 조회 Obj 
   
	MethodObj.setI ("getExptRtnAmt"); 	// ID 셋팅 
	MethodObj.setU rI ("I contract/CBSC 131 PContr011 er.d 0");  	// 서버단 호출 URL 
	MethodObj.addSingleData("LTIDA00", "LTIDA00", "Ds_LTIDA00:A"); 	// Param 셋팅(계약기본 사항 정보 Ds): 
	MethodObj.setXPath(""//*/AXR961"); 		// XPath(Ds_LTIDA00) 
	MethodO미addXPath("//* /WARNING"); 	// XPath(DsWs_ Warning) 
	MethodObj setHashTable(); 	// 전문 앞이 hashtable로 보낼 때 
	MethodObj.sync(); 				// 동기 처리[기본(async 비동기)1 
	MethodObj.setXPath Ds(); 		// XPath 전체 경로 사용할 경우 
	MethodObj.send(); 				// 최종 전송 
	console.log("[/CBSC131P.xmll [lfn_SearchData01 ==> [01. 해지환급금 조회. 전송 완료1 [TEST _91]"); 
};
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.l2.07(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~18:30  ==> 이발(7시, 이례 이발관), 프로젝트 회식(19시, 황금정(소갈비: 맛 좋음):1차, 호프집 2차) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml)  
1. 단체관리 번호조회(/CBSC037M.xml, acc_loan::B150.xml) 
2. 단체수납대상목록(/CBSC038P.xml, acc_loan::7806_Pop.xml) 
==> 검증계에서 단체수납 1건 완료[수납번호 20171206- 5000014- RR00002]
==============================================================================================================

- 서버 URL 변경(Miplatform에서) [개발계 ==> 검증계] 1. Miplatform에서 > Global > Variables에서 
ID ==> gWsdlAccounting 
Value ==> https://dcommon.thekins.co.kr ==> https://mcommon.thekins.co.kr  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.l2.08(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 구종식 부장 휴가, 루엔 LG U+ 핸드폰 요금 변경(무제한[3개월] ==> 월 67,000원으로 변경) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml)  
1. 단체관리 번호조회(/CBSC037M.xml, acc_loan::B150.xml) 
 - 단체수납확정조회(/CBSC040M.xml, acc_loan::7807.xml) 
 - 단체수납대상목록(/CBSC038P.xml, acc_loan::7806_Pop.xml) 
==============================================================================================================
 
- 피보힘자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) [M20170193678] 
1. Pop up 일때 gds.gDs_LinkArg.setJSON(oDsJson)으로 변경할 것 
	var oDsJson=[{"Prigld":"/CBSC128P" 
		, "sCrNo": sCrNo 
		, "sScrnld": "B010" 
	}]; 	// 필드 Json에 담기(gDs_LinkArg 함수 사용) 
// window.top.utiIJSonDsCreate(oDsJson, "gDs_LinkArg");  	// 주석 처리 수정(팝업 에서 OpenLinkPage 사용시 
사용하면 안됨): 2017.12.12, by 진태만 
gds.gDs_LinkArg.setJSON(oDsJson); 	// 수정(팝업 일때): 2017.12.12, by 진태만 

gfn_Open LinkPage("/CBSC028M "); 		// 계약사항상세 내 역(/CBSC028M.xml, ID020.xm) 
==============================================================================================================

- 탐색창 보이기 설정(MS WORD(MS 워드) 
1. 보기 > 탐색창(체크) ==> 왼쪽 화면에 탐색창 보여짐 
--------------------------------------------------------------------------------------------

- 배경색 설정(MS WORD(MS 워드) 
1. 디자인 > 페이지 배경 > 페이지 색 > 다른색(M) > 사용자 지정: 색 모델(D): HSL --> 76, 78, 194 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.09(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 
 
- 주말  
09:00 기상
09:20 TV시청
10:50 집출발(수종: 자전거)
11:10 SC은행 만원 출금: 잔고 170원(체크카드 보관할 것)
11:30 서울평강교회(대림2동): 대림3동 조괴회 이진호 형님 아들 결혼
		==> 부주 5만원(업범이 형님, 호섭이 형님 수종에게 만원씩 줌)
		==> 회장님, 총무, 형님들 많이 참석
12:10 중식(썬 부페)
14:00 종료
14:30 구로리 공원(수종)
16:00 종료
16:30 귀가
17:00 낮잠
19:00 기상(진호 형님이 결혼식 참석 고맙다고 전화 옴)
19:00 석식(라면)
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.10(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 눈 옴

▦ 초기축구
05:30 기상 --> 눈이 와서 선이형에게 문자 보냄(온수 럭비 구장 사용 못 한다고 문자 옴)
06:40 집출발
06:50 자전거(문영APT -> 대림운동장)  ==> 운동장길에 눈이 많이 와서 선이형, 수춘이형, 대운이
		휘연이, 명규가 나와서 눈 쓸고 있음
07:40 박기우 형님 매제가 운동하는 성남FC와 경기하기로 함(인천 만수동 남동 초교로 출발, 기우 형님 차)
08:30 남동 초교도착(비 오고 있음)
09:00 게임(남동 초교, 4쿼터 뜀): 비 맞고 함(컵라면, 초코파이 얻어 먹음)
12:00 종료
12:30 중식(뼈해장국: 만수동 근처 식당): 성남FC에서 쏨
13:20 종료
13:30 기우 형님 차
13:50 대림운동장 도착 
14:10 귀가(루옌 언니집에 놀러감)
15:00 낮잠
17:00 기상(루옌 귀가)
17:10 염색(루옌이 해줌)
19:20 석식
24:00 취침
=========================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.11(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 18:00  ==> 휴가(유치원 등록) 
 
 - 휴가 
07:00 기상
07:50 집출발(자전거)
08:10 최선형 사무실
08:20 최선형 차(벤츠)
08:40 영등포구청 도착
	==>  1. 추첨 장소: 영등포구청 5층 문화체육과(최선형 차)
		2. 5개로 추첨(최선 총무 주도, 박본서 전회장, 김형근 형님, 수춘이 형님, 이상길 형님, 휘연)
		3. 조식(특 설렁탕(만원): 푸주옥 식당 ==> 회에서 쏨) 
09:20 종료
10:20 통장 개설(관악 농협): 신규 통장 천원 입금, 달력 얻어옴
10:50 종료
11:00 귀가
11:10 집출발(자전거)
11:20 영림초병설유치원 도착 ==> 교무실(서류 접수), 추후 작성 서류 수령
12:40 종료
13:00 귀가
14:00 Memo(2017.09) 파일 스캔, OCR 문서 편집 작업 ==> Memo(2017.09)_OCR_26P
	  ==> 대동초병설유치원에서 종일반 추가 모집 지원하라고 전화 옴
16:40 종료
16:50 집출발(자전거)
17:00 대림3동 어린이집(수종 데리고 옴) ==> 추워서 놀이터 갔다가 돌아옴
17:30 귀가
19:00 석식
22:20 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.12.12(화) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 20:00  ==> Memo(2017.10).doc(28P), Memo(2017.11).doc(52P) 출력, 유치원 서류 출력 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml) [170153: 교남학교] 
1. 단체수납확정조회(/CBSC040M.xml, acc_loan::7807.xml) 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) [M20110019021, L23010000022] 
1. 운전자고지사항[B230_Div1_Pop] (/CBSC166S.xml, ssr_pln::B230_Div1_Pop.xmll) ==> 수정 완료 @@@
 1) cmb_A0203_2_2_0 ==> cmb_B0203_2_2_0로 수정 
cmb_B0203_2_2_0.setNodeSet("", "", ""); 		// 발생시기1 ==> // 수정(cmb_B0203_2_2_0 변경): 2017.12.12, by 진태만 
edt_B0303_2_2_0.setNodeSet('''',  "", "");		// 발생시기2 ==> // 수정(edt_B0303_2_2_0  변경): 2017.12.12, by 진태만 
 ==============================================================================================================

- 운영서버 반영 요청 
1. 반영요청 목록-오픈후_201712012_진태만_2.xls 작성서 작성 
 1) 수정한 2개 파일(/CBSC128P.xml, /CBSC166S.xml) eclilpse에서 커밋
 2) D:￦00. TAMA_Data￦02. TAMA_Pr이ect￦01. 더케이 영업지원시스템 구축 Prj￦0300.프로젝트 착수￦3000.프로 젝트실행&통제 
￦3900.C_OI행관리￦os.오픈후W20171212_2차 폴더에 넣기
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.13(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~18:00  ==>주간보고, 석식(짜장면, 당구장, 이부장, 구부장) --> 짜장면만 먹고 옴 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) [M20110019021, L23010000022] ==> 수정 완료, 운영 반영 @@@ 
1. 운전자고지사항[B230_Div1_Pop] (/CBSC166S.xml, ssr_sst::B230_Div1_Pop.xmll) ==> 수정 완료 @@@ 
 1) 현상: 타사보험 가입사항(rad_B0500_1_1_0)에서  건수, 월보험료 활성화 되고 월보험료(medt_B0503_2_3_0)가 NaN으로 보여짐 
 2) 원인: 월보험료(medt_B0503_2_3_0)가 실손비례 보상안내(rad_B0600_2_1_0) 데이타와 섞여서 출력되면서 월보험료(medt_B0503_2_3_0)에 
 답변문자값01 "Y"로 셋팅됨 
if(Ds_LTIDA07.getCellData(i, nsRepIType") == "3") { 	// 답변유형이숫자이 면 ==> 답변유형(1:여부, 2:문자열, 4코드, 3:숫자3일 경우만 답변 숫자값에 넘김)  
	obj.Ojb.setValue(Ds_LTIDA07.getCellData(i, "nReplnumValue")); 		// obj에 Ds 칼럼 담기(nReplNumValue: 답변숫자값) 
	console.log("[/CBSC129P.xml] [lfn_Search()] ==> [조회 처리] [TEST_20_2] [obj에 Ds 칼럼 담기 (nRepINumValue: 답변숫자값) 
	칼럼 담기] [i_번째]"+ i +"[Ojb ID]"+ Ojb.id +"[Ojb 값]"+ obj.Ojb.getVale() + "[obj.Obj.getVale01" + obj.Ojb.getVale() ); 
	
} else { 	// 답변유형이 숫자가 아니면 
	obj.Ojb.setValue(Ds_LTIDA07.getCellData(i, '"sRepIChrVaue")); 		// obj에 Ds 칼럼 담기(nReplNumValue: 답변숫자값) 
	console.log("[/CBSC129P.xml] [lfn_Search()] ==> [조회 처리] [TEST_30_1] [obj에 Ds 칼럼 담기 (nRepINumValue: 답변숫자값) 
	칼럼 담기] [i_번째]"+ i +"[Ojb ID]"+ Ojb.id +"[Ojb 값]"+ obj.Ojb.getVale() + "[obj.Obj.getVale01" + obj.Ojb.getVale() ); 
}
3) 조치: 보험료(medt_B0503_2_3_0)에서 답변숫자값("0") 만 쩍히게 수정 
if(Ds_LTIDA07.getCellData(i, "sRepIType") == "3") { 	// 답변유형이 숫자이 면 ==> 
} else { // 답변유형이 숫자가 아니면 
	if(Ds_LTIDA07.getCellData(i, "sRqstCd") == "B0600" && Ojb.id == "medt_B0503_2_3_0") { 
	// 6.실손비례 보상안내이고 월보험료 이면(답변문자값 칼럼에 담기 제외)  // 수정: 2017.12.13, by 진태만 
	continue; 
} else { 
	obj.Ojb.setValue( Ds_LTIDA07.getCellData(i, "sRepIChrVauee"));		 // obj에 Ds 칼럼 담기(nRepINumValue: 답변문자값)  
	console.log("[/CBSC129P.xml] [lfn_Search()] ==> [조회 처리] [TEST_30_1] [obj에 Ds 칼럼 담기 (nRepINumValue: 답변숫자값) 
	칼럼 담기] [i_번째]"+ i +"[Ojb ID]"+ Ojb.id +"[Ojb 값]"+ obj.Ojb.getVale() + "[obj.Obj.getVale01" + obj.Ojb.getVale() ); 
}
4) 기타 
5. 타사보험 가입사항(rad_B0500_1_1_0) 
medt_B0502_2_3_0(건수), medt_B0503_2_3_0(월보험료) 
6. 실손비례 보상안내(rad_B0600_2_1_0)
==============================================================================================================

- 단체수납확정 엑셀다운로드 수정 요청 
1.	/7806Excel.jsp ==> 전문(task, action)으로 변환 
2.	시스템개발팀 여경수 대리 ===> 문의 옴 
==============================================================================================================

- 대동조병설유치원 종일반 신정 전화 ==> 2017.12.15(금) 19시까지 유치원에 서류 제줄하기로 함 
- 영림조병설유치원 종일반 신정 전화 ==> 등록 쥐소 요청: 처음학교로 사이트에서 취소하기로 함 ==> 처리 완료 @@@ 
- 재직증명서 요청 ==> (주)지아이데이타 이동은(경리)에게 내일 회식때 재직증명서 갔다 달라고 요청 ==> 완료 @@@ 
- 루엔 소득금액증명원 출력 ==> 22시 전에 국세정 홈에서 출력할 것 ==> 개명을 해서 인터넷 출력 안됨 
==> 루엔이 다니는 회사에서 고용임금확인서 떼 옴 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.14(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~18:30  ==> (주)지아이데이타 송년회(20 ~ 22: 보노보노 삼성점(27명 참석 ==> 재직증명서 받아 옴) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 01. thek 전환 Prj 파일 정리 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.15(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~17:00  ==> 중식(찜뽕, 당구: [PM, 구부장, 이부장(꼴찌)], [정근욱씨, 나(10)] ==> 나 꼴찌(당구비: 7천 7백원))
								, 대동초병설유치원 종일반 서류 접수(18시)

- 더케이손해보험 영업지원S 구축 Prj[★]
- 01. thek 전환 Prj 파일 정리 
==============================================================================================================

- 대동초병설유치원 입학등록 서류 제출(19시)
1. 18:20 수종이랑 자전거 차고 대동초병설유치원 교무실 방문 ==> 종일반 신청
 1) 아름반(10시 ~ 13시 30분) ==> 7시에 등교 가능
 2) 행복반(140시 ~ 20시) ==> 보통 19시에 하교
2. 예비 소집: 2018년 2월 7일(수) 19시
--------------------------------------------------------------------------------------------------------

- 제출 서류
1. 등본 1통
2. 농협중앙회 계좌사본 1통
3. 증명사진 2매

- 종일반 서류
1. 부모 재직증명서 1통
2. 직장건강보험 자격득실확인서[태만- 건강보험공단]
 또는 고용-임금확인서[아현- 회사]
 또는 소득금액증명원 중 1부
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.16(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 
 
- 주말  
09:00 기상
09:20 TV시청
12:00 중식
13:00 집출발: 자전거(수종) ==> 추움(영하 6도)
13:30 대림 조명사 ==> 백열등(80W, 문영A 보일러실): 800원
14:00 버스(대림역 -> 영등포역): 04 마을버스
14:30 영등포 로타리
14:40 계피부과의원
15:40 진료(얼굴, 다리): 계피부과의원 ==> 약(토피솔 밀크로션) 구입
16:00 종료
16:10 버스(대림역 <-> 영등포역): 04 마을버스
16:40 빵: 파리바게뜨대림역점
17:00 귀가
19:00 석식
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.17(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
07:00 기상 
07:10 자전거(문영APT -> 대림운동장) ==> 영하 10도(귀 따갑고 발 시러움) 
07:30 숏 게임
08:30 게임: 4쿼터 뜀 ==> 컨디션 안 좋아서 겨우 뜀(윙으로 뜀)
11:50 종료
12:10 정기 총회(35명 참석): 다솜식당
12:20 회장 선거: 1. 이상길 회장 선출(26표, 연임)
						2. 김대중 후보(6표)
						3. 이창호 후보(2표)
12:50 감사 선거: 1. 정지경 선출(18표)  ==> 수석 감사
						2. 이인석 후보(1표)
						3. 김양수 후보(2표)		
						4. 박본서 후보(10표) ==> 감사						
12:20 중식(삼겹살: 다솜식당): 회에서 쏨
16:00 종료
16:30 장어구이(갯고을 식당): 병준, 승중이 형님(형수님) ==> 최선형이쏨
18:00 종료
18:50 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.18(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

- The K 손해보험 영업지원시스템 구축 Prj[★]  
- 01. thek 전환 Prj 파일 정리(01. thek 전환 Prj.doc) ==> 79P ==> 완료 @@@
- 02. Websquare 분석 파일 정리(02. Websquare 분석.doc) ==> 19P  ==> 완료 @@@
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.12.19(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~19:00  ==> 루엔 회사 야근(수종 돌보기) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- .js 정리 
1. /wconv.js[완료], /wprom.js, /util.js, /main.js, /commonJs, /val_lib.Js 
==============================================================================================================

- 청약심사대상조회(/CBSC111M xml) 수정 ==> 수정 완료, 운영 반영 @@@
1. 현상: 취급자코드(2110013: 안준영) 조회하면 사용인에 윤지영 나옴 
2 조치: value="윤지영" ==> value=""로 수정 
<w2:Column dataType="text" 
	id = "sDoerUserName" inputType= "text" readOnly= "true" customFormatter= "scwin.lfn_getColumnValue" textAlign = "center" 
userData1="7" userData3= "1" value= "" width= "64" style= "height20px;"/> 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml) [M20170221873] ==> 수정 완료, 운영 반영 @@@ 
1. 인보험 고지의무가 장이 됩니다==> [M20170005153(D 172S)], [M20170221821(172S), M20170221820(172S)] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.20(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~19:00  ==> 주간보고, 루엔 회사 야근2(수종 돌보기) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 제도 개선 수정 
0. 수정 내용 ==> 2.운전여부에서 운전 용도 용도가 자가용, 영업용(활성화)을 선택 수 있도록 수정 
1. 객정보 저장 후 기본값을 자가용으로 세팅 
 1) 차종운전여부 Ds(Ds_Yn_2)에서 자가용[1], 영업용[2] 설정할 것 
 2) radio0, radio1, radio2, radio3 제거 
B230_Div2_Pop.xml ==> /CBSC167S.xml 	==> 적용 완료 
B230_Div4_Pop.xml ==> /CBSC169S.xml [M20170215288(Test 169S)] [M20170005157(Dev: 169S)] ==> 적용 완료 
B230_Div5_Pop.xml ==> /CBSC170S.xml ==> 적용 완료[이미 적용되어 있응] 
B230_Div6_Pop.xml ==> /CBSC171S.xml ==> [M20170218137(Test 171S)] 적용 완료[이미 적용되어 있음] 
B230_Div7_Pop.xml ==> /CBSC172S.xml [M20170221882(Test 172S)] [M20170005153(Dev: 172S)] 
==> 적용 안함(/CBSC166S, /CBSC168S, /CBSC172S 미적용) [이미 적용되어 있음] 
B230_Div8_Pop.xml ==> /CBSC173S.xml ==> 적용 완료 [이미 적용되어 있음] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.21(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00  ==> 중식(피자, 스파게티, 이탈리아 청년[종로 익선점]: 구부장, 이부장, 근욱씨) ==> 구부장 이쏨 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 제도 개선 수정 ==> 완료 
0. 수정 내용 ==> 2.운전여부에서 운전 용도가 자가용, 영업용을 선택 수 있도록 수정 
1. 고객정보 저장 후 기본값을 자가용으로 세팅 
 1) 차종운전여부 Ds(Ds_Yn_2)에서 자가용[1]. 영업용[2] 설정할 것 
 2) radio0, radio1, radio2, radio3 제거 
==============================================================================================================

- 청약심사대상조회 [/CBSC111M.xml) 
1. 조회시 sync(동기)에서 async(비동기) 처리로 수정 
==============================================================================================================

- async 방식 
//---------------------------------------------------------------
// function 명 : Ifn_Search 
// 내용 	조회버튼 클릭시 처리 
//---------------------------------------------------------------
scwin.btn_search_onclick = function() ( 
	console.log("[/CBSC111M.xml] [btn_search_onclick01 ==> [조회버튼 클릭시 처리] [TEST_01]" ); 
	
	scwin.Search(l);  	// 조회버튼 클릭시 처리(처음 조회시) 
	
	// 전체 건수 얻어오기(Paging 처리) 
	// gfn_MakePagingData(Ds_Page, Ds_SqrtListCnt.getCellData(0, "nCount"), pageSize, pageCount); 
	// 수정(주석 처리: async는 nCount 못 읽어 옴): 2017.12.21, by 진태만 ==> sync 일 경우[주석 해제] 
	
	//Cmb_Page.setValue(''1"); //-------End  		// 수정(주석 처리: async로 수정): 2017.12.21, by 진태만 
	==> sync 일 경우[주석 해제] 
};

//---------------------------------------------------------------
// function 명 : Search 
// 내용 
//---------------------------------------------------------------
scwin.Search = function(pageNo) ( 
	// console.log("[/CBSC111M.xml] [SearchOJ ==> [TEST_01] [pageNo]"+ pageNo); 
	
	nPageNo = pageNo; // 페이지수 => 	// 추가(async로 수정 페이지수 받아오기): 2017.12.21, by 진태만 
	
	MethodObj.setUrl("I/contract/CBSC111MController.do"); 		// 서버단 호출 URL 
	MethodObj.MsgShow(); 				//  PROGRASSBAR 표시  
	MethodObj.setMsg("조회 중"); 		// 동기, 비동기시 PROGRASSBAR 에 표시할 메시지 셋팅 
	MethodObjsetXPath("//*/LTIDA00"); 			// XPath 
	MethodObj.addXPath("//*/LTIDA00CNT"); 	// XPath 
	MethodObjaddXPath("//* /WARNING"); 		 // XPath // XPath 
	MethodObj.callBack("scwin.subCAllBackfunction"); 	// Callback 처리 
	==> 추가(비동기 호출: callBack 처리): 2017.12.21, by 진태만(sync 일 경우: 사용 안함) 
	//MethodObj.sync(); 		// 동기 처리[기본(async:비동기)] ==> sync 일 경우[주석	해제] 
	MethodObj.send();  		// 최종 전송 
	
	//if(Ds_Warning.getRowCount() != 0){ 		// sync 일 경우[주석 해제] 
		// wprom.alert(Ds_Warning.getCellData(0, "msg")); 
		// return; 
	//}
	
	//if(Ds_SqrtList.getRowCount() < 1) { 
		//wprom.alert("청약심의 대상건이 없습니다."); 
	//}
 };
 
//---------------------------------------------------------------
// function 명 : subCaliBackfunction 
// 내용 	: Callback 처리 ==> async 방식 경우(sync 일 경우: 사용 안함) 
//---------------------------------------------------------------
scwin.subCallBackfunction = function(e) { 
	Ds_Sq rtList.setJSON(_tranSync.getDsJson("LTI DA00")); 				// 조회 DS 셋팅(조회 결과) 
	Ds_SqrtListCnt.setJSON(_tranSync.getDsJson(" LTIDA00C NT")); 		// 조회 전체 건수 DS 셋팅(조회 결과) 
	Ds_Wa rning.setJSON(_tranSync.getDsJson(("WARNING ")); 			// Warning DS 셋 팅(조회 결과)  
	// console.log("[/CBSC111M.xml] [subCaliBackfunction()] ==> [I/F 조회 완료] [Ds_SqrtListCnt, 총갯수]"+ Ds_Sq rtListCnt.get TotalRow() ); 
	
	if(Ds_Warning.getRowCount() ! = 0) { 
		wprom.a lert(Ds_Warning.getCelllData(0, "msg")); 
		return; 
	}
	
	if(Ds_SqrtList.getRowCount() < 1) { 
		wprom.alert("청약심의대상건이 없습니다"); 
	}
	
	if(nPageNo == 1) { 		// Page No가 1 이면 ==> // 추가(async로 수정: Page NO가 1 이면): 2017.12.21, by 진 태 만
  
		// 전체 건수 얻어오기(Paging 처리) 
		gfn_MakePagingData(Ds_Page, Ds_SqrtListCnt.getCellData(0, "nCount"), pageSize, pageCount);  
	 
		// 추가(async로 수정: Grid 전체 조회수(nCount) 받아옴): 2017.12.21, by 진태만 
		Cmb_Page.setValue("l''); 	//------End 	// 추가(async로 수정 2017.12.21, by 진 태 만 
	}
};
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.12.22(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 19:30  ==> 이부장 휴가 

- 더케이손해보험 영업지원S 구축 Prj[★]
1. Fusion Chart 컴포넌트 
1. /main.xml 파일에서 
<script> < ![CDATA[ 
scwin.subCallBackfunction = function(e) { 
	switch(e.subID){ 
	case "selectNwcrPrreList"  	// 초기화 fusion chart(신계약정보) 검색 
	//Set Fusion Chart Option 
	var options = { caption: '''',
			subCaption : 
			yAxisName : '''', 
			formatnumberscale: "0", 
			yAxisVal ueDeci mals:"O", 
			yAxisMinValue:"O", 		// 차트의 Y축의 최대값 
			yAxisMaxValue:"10",  		// 차트의 Y축의 최소값  
			xAxisName : "", 
			numberP εfix:"" }; 
	mfct_seIectNwcrPrreList.setChartAttribute(options); 
	break; 
 }
]] > </script> 

<xf:group class= "graph" id = '''' style= "position:absolute;left:21px;top:64px;right:260px;" > 
	<w2:fusionchart 	seriesType= "simple" 	axisnamelnsert= "false" 
	runflashAt = "IE6, IE7,1EB, IE9, IE10, IE11, Chrome" 
	id = "mfct_selectNwcrPrreList" chartType= "Column2D" 
	formatnumberscale= "0" yAxisValueDecimals= "0" yAxisMinValue= "0" yAxisMaxValue= "100" 
	style= “ position: relative;height:200px;width:100%;margin-top: -20px;“ 
	drawType=''java script" accessibility= "false" ref= "data:DsWs_List" 
	seriesColumns= "nGurntCt" label Node= "sDeptName" > 
	</w2:fusionchart>
</xf:group> 
==============================================================================================================
 
- 소스 정리 
1.	TheK 전 환 Prj.doc(BOP) ==> [2011.12.15(금) 완료] 
2.	Websquare 분석.doc(40P) ==> [2011.12.15(금) 완료] 
 
- js 정리 
1.	weanιdoc(131P) ==> [2011.12.19(화) 완료] 
2.	wprom.doc(46P) 	==> [2011.12.21(목) 완료] 
3.	util.doc(B9P) 	==> [2011.12.21(목) 완료] 
4.	main.doc(16P) 	==> [2011.12.21(목) 완료] 
5.	common.doc(61P) 	==> [2011.12.21(목) 완료] 
6.	vaUib.doc(15P) ==> [2011.12.21(목) 완료]  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.12.23(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 
 
- 주말  
09:00 기상
09:20 TV시청
10:00 집출발 
10:30 진료(수종 감기): 서울가정의학과의원
11:30 삼성전자 서비스 센터(구로점) ==> 갤럭시 노트 5 S Pen 고장 A/S 요청
		==> 갤럭시 노트 5 내부 S Pen 인식 센서가 고장남(수리비 2만 4천 원): 수리 포기
12:00 귀가
12:30 중식
14:00 집출발
14:30 구로리 공원: 수종  
16:30 종료
17:00 귀가
19:00 석식
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.24(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
06:00 기상
06:30 자전거(문영APT -> 대림운동장) ==> 비 많이 옴(문 잠겨 있어서 관리실에 가서 문 열어 달라고 함)
07:20 최선형 택시 타고 옴
08:00 게임: 2쿼터 뜀(비 맞으며 축구함) ==> 도신 초기회, 선우FC: 3파전 함
11:20 종료 
11:40 중식(김치찌개: 해오름) ==> 도신 초기회, 선우FC
		==> 축구복 젖어 있고 식당 추웠음
13:20 종료
14:00 귀가 ==> 수종, 루옌 어린이날 행사 갔다 옴(안양)
14:30 낮잠
17:00 기상
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.25(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 18:00  ==> 성탄절
 
- 성탄절 
09:00 기상 
12:00 석식
13:50 집출발 
14:10 대림역 정류장(6511번 버스)
14:50 봉원중학교 정류장
15:50 어린왕장 키즈 카페(휴무)
16:10 글빛도서관(휴무)
16:30 서울대입구역 지하철
17:00 구로디지털지역 3번 출구
17:30 이미트 구로점(케익 구입) 
18:00 귀가
19:00 석식
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.26(화) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 출력, 이상길 회장한테 전화와서 부총무 1년 더 할 것을 요청: 거부(금 19시 오징어집 약속)
									, 루옌 야근

- The K 손해보험 영업지원시스템 구축 Prj[★]  
- 파일 업로드, 다운로드 분석 
1. 공지사항등록(/CBSO006P.xml) 
==============================================================================================================

- 인수제한사유조회대OBO_Pop] (/CBSC085P.xml, /BOBO_Pop.xml) [M201102152BB(Test)] ==> 수정 완료 @@@  
1. 피보험자누적한도 조회 버튼 추가 ==> 피보험자 누적[B290_Pop] (/CBSC128P.xml) 
 1) MP 개발 완료: 2018.01.05(금) 한상욱 차장 
 2) 소스 적 용: 2018.01.08(월) 
 3) 개발 완료 2018.01.09(화) 
==============================================================================================================

- 루옌(강아현) 핸드폰 요금 조회
http://www.uplus.co.kr ==> vnluyen@naver.com/ tamalulu339@
==============================================================================================================

1. 핸드폰 요금 정산
일자					금액		내용
2017년 10월	137,010 	SK 핸드폰 사용료 포함
2017년 11월	85,130 	
2017년 12월	86,140 	
합계				308,280 	==> 루옌에게 송금할 것
==============================================================================================================

- 위메프 회원 가입
http://wemakeprice.com ==> vnluyen@naver.com/ tamalulu339@
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.12.27(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 20:00  ==> 출력2, 주간보고, 중식(짜장면, 당구: [PM, 구부장, 이부장(꼴찌)], 구경만 함), 우리카드 해지 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 일정계획표(/CBSB027M.xml) 분석 
1. 고객방문관리(/CBSB003P.xml) ==> 달력 
==============================================================================================================

- 우리카드 해지
1. 우리카드 가지고 우리은행(재동지점) 방문 ==> 288,442원 납부
 1) 문영A 관리비(11월): 152,390원
 2) 갤럭시 노트5 할부금/36개월용: 136,052원(36만원에서 27개월 사용 후 나머지 할부금)
==============================================================================================================

- 롯데카드에서 아파트 관리비 납부 신청(앱에서도 신청 가능)
1. https://www.lottecard.co.kr/app/html/mycard/IHMCDGK_V100.jsp --> 신청가능시간: 오전 8시 ~ 오후 10시
==============================================================================================================

- 아파트 관리비
https://www.apti.co.kr ==> tamario / h*수*16*1@
==============================================================================================================

- 롯데카드에서 서울 도시가스요금 자동납부 서비스 신청(앱에서도 신청 가능)
1. https://www.lottecard.co.kr/app/IHSVCFB_V200.top  ==> 납부자번호: 60043-64703(문영A 1806호)
-------------------------------------------------------------------------------

- 서울 도시가스 요금 확인
1. https://www.seoulgas.co.kr/front/paymcnt/useCostLogin.do
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.28(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:30  ==> 중식(쌀국수, 종로 커바: 구부장, 이부장, 김주수 차장, 권차장, 정차장, 강차장, 근욱씨) ==> 구부장이 쏨
								, 석식(묶음밥, 당구장: 이부장, 구부장) --> 짜장면만 먹고 옴 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 일정계획표(/CBSB027M.xml) 분석 
1. 고객방문관리(/CBSB003P.xml) ==> 달력 
==============================================================================================================

- 제도 개선 운영 반영 
0. 수정 내용 ==> 2.운전여부에서 운전 용도 용도가 자가용, 영업용(활성화)을 선택 수 있도록 수정 
1. 객정보 저장 후 기본값을 자가용으로 세팅 
 1) 차종운전여부 Ds(Ds_Yn_2)에서 자가용[1], 영업용[2] 설정할 것 
 2) radio0, radio1, radio2, radio3 제거 
B230_Div2_Pop.xml ==> /CBSC167S.xml 	==> 적용 완료 
B230_Div4_Pop.xml ==> /CBSC169S.xml [M20170215288(Test 169S)] [M20170005157(Dev: 169S)] ==> 적용 완료 
B230_Div5_Pop.xml ==> /CBSC170S.xml ==> 적용 완료[이미 적용되어 있응] 
B230_Div6_Pop.xml ==> /CBSC171S.xml ==> [M20170218137(Test 171S)] 적용 완료[이미 적용되어 있음] 
B230_Div7_Pop.xml ==> /CBSC172S.xml [M20170221882(Test 172S)] [M20170005153(Dev: 172S)] 
==> 적용 안함(/CBSC166S, /CBSC168S, /CBSC172S 미적용) [이미 적용되어 있음] 
B230_Div8_Pop.xml ==> /CBSC173S.xml ==> 적용 완료 [이미 적용되어 있음] 
==============================================================================================================

- 롯데카드로 자동이체 설정 
1. 아파트 관리비(문영A 1806호) 
2. 아파트 도시가스(문영A 1806호) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.29(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~19:00  ==> 권민정 지장 철수(13시), 대림3동 초기회 임원 회식(19시) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 일정계획표(/CBSB027M.xml) 분석 
1 고객방문관리(/CBSB003P.xml) ==> 달력 
 1) 6주차 추가, 달력 날짜 클릭시 해당 월로 이동 ==> 완료 
 2) 달력 주차별 요일, 날짜, 글 내용 컴포넌트 추가 ==> 추후 개발 예정 
 3) 현재 DB 조회를 월일로 조회됨(에러) ==> 년월일로 조회되어야 합(DB query 수정 되어야 함) 
==============================================================================================================

- 보험료 요약[B050_Pop] (/CBSC0S7P.xml, ssr_pln::B050_Pop.xml) ==> 수정 완료, 운영 반영 @@@ 
[De이단체): M2017000S341], [단체: M201702218S2] 
1. getPremSummaryList 		// 특약사항 조회 오류(LTIDAO0, Ds_LTIDA02, DsJTIDA02Group 주석 처리) 
==============================================================================================================

- 보험료 요약[BOSl_Pop] (/CBSC058P.xml, ssr_pln::BOSl_Pop.xml) ==> 수정 완료, 운영 반영 @@@ 
[Dev(재물): M20170003282], [재물: M2017021S288] 
1. getPremSummaryList 	// 특약사항 조회 오류(다!DAO0, Ds_LTIDA02, DsJTIDA02Group 주석 처리) 
==============================================================================================================

- 개인 청약설계(/CBSC0llSM.xml, 청약메인(ssr_pln::B010.xml)) [M20170221889] 분석 
==============================================================================================================

- 초기축구 임원 모임(19시, 오징어집)
18:00 퇴근
19:00 오징어집(철의형 가게)
		==> 이상길 회장, 철의형(내년 총무), 박기우 형, 김동주 형, 병준 참석
19:20 석식
 1) 차기 총무: 이철의 형, 차기 감독: 전태수 고문
 2) 내년에도 부총무하라고 하길래 못 한다고 함
==> 철의형이바빠서 총무 역할 제대로 못 하니 사실상 총무 역할 하라고 함
==> 사실상 10년 동안 총무 하라고 함: 탈퇴 결심함(초기회 회원 휴대폰 차단) 
21:00 종료
21:20 귀가
23:50 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.12.30(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 
 
- 주말  
09:00 기상
09:20 대림3동 초기회 회원 통화 차단 ==> 탈퇴 결심
12:00 중식 
12:20 대림역(6511번 버스, 수종)
13:20 서울대 정류장 도착 
13:40 관악도서관(1층, 수종)
16:00 종료
16:30 서울대 정류장 도착 
17:20 대림역(6511번 버스, 수종)
17:40 다이소 대림2호점(스케치북, 테이프, 풀)
18:00 귀가
19:00 석식
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.12.31(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

- 일요일  
09:00 기상 
12:00 중식
13:30 집출발
13:50 찜질방(유토피아: 찜질복 포함): 수종
14:00 찜질방 놀이터(음료수: 2천원, 계란: 2천원)
18:00 종료
18:10 목욕(수종은 안 함) ==> 체중: 71.5kg
18:40 종료
19:00 귀가
19:30 석식
23:50 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------// End //--------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

