

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2017.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.11.01(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 22:40 ==> 주간보고

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 갱신형 특약 경과기간별 보험료 조회[B012_Pop] (/CBSC023P.xml, ssr_pln::B012_Pop.xml) 단위테스트[계약번호: M20170003284] 
==============================================================================================================
 
- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_pln::B051_Pop.xml) 단위테스트[청약번호M20170003122] ==> 완료 @@@ 
1. 청약메인(/CBSC0llsM.xml, 청약메인(ssr_pln::B010.xml)) > 보험료산출Tab(/CBSC016S, ssr_pln::B010_div1.xml)
==============================================================================================================

- 보험료 요약[B050_Pop] (/CBSC0s7P.xml, ssr_pln::B050_Pop.xml) 단위테스트[청약번호: M20170003006] ==> 완료 @@@ 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 보험료산출Tab Tab(/CBSC043S.xml, ssr_pln::/CBSC043S.xml) 
==============================================================================================================

- 수익자등록[B110_Pop] (/CBSC069P.xml, ssr_pln::BllO_Pop.xml) 단위테스트[청약번호: M20170004128, 8001021234563] 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
==============================================================================================================

- 수익자등록[B111_Pop] (/CBSC070P.xml, ssr_pln::B111_Pop.xml) 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab Tab(/CBSC044S.xml, ssr_pln::/CBSC043S.xml) 
==============================================================================================================

- 세금우대한도조회(/CBSC068M.xml, /G430.xl11) 수정 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml, ssr_pln::B160.xml) [단위테스트: M20170003006] 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.02(목) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 석식(부대찌개, 익선 정육식당: 구부장, 이부장, 정차장, 김민수 차장 ==> 구부장이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln.:B290_Pop.xml) 단위테스트[M20170004128] ==> 완료 @@@   
==============================================================================================================

- 타보험 가입 사항[B220_Pop] (/CBSC114P.xml, ssr_pln::B220_Pop.xml) 단위테스트[M20170004128, M20170003323]  
==============================================================================================================

- 특정부위.질병 부담보[B210_Pop] (/CBSC126P.xml, ssr_pln::B210_Pop.xml) 단위테스트[M20170003323] ==> 완료 @@@ 
==============================================================================================================

- 자금세탁방지 의심거래보고(STR) 조회 및 선택[B160_Pop] (/CBSC088P.xml, ssr_pln::B160_Pop.xml) 단위테스트[M20170003284] 
1. 계약상세내역조회(/CBSC028M.xml, psv_ens::D020.xml) > ==> 8. 의심거래보고(이미지): 팝업 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln.:B230_Pop.xml) 테스트 
1. 단체 청약설계(/CBSC042M.xml, 청약 메인(ssr_pln::B330.xml)) > 청약사항입력Tab(/CBSC044S.xml, ssr_pln::B330_Div2.xml) 
==> M20170004192, M20170178340 ==> 테스트할 것(정해인 차장) 
==============================================================================================================

- Pop up 후 부모창 함수 호출 
// idx = parent.lfn_GetChkldx(); 
idx = wprom.getOpener().scwin.lfn_GetChkldx();	// 피보험자 리스트의 체크된 인텍스 취득(부모창에서) 
console.log("[/CBSC055P.xml] [init01 ==> [폼 로딩] [idx]"+ idx ); 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.03(금) 작업■■■■■■■■■■■■■■■■■■
 ---> 07:00 ~ 21:00  ==> 
 
- 더케이손해보험 영업지원S 구축 Prj[★] 
- 예상해약환급금처리(/CBSC080S.xml, ssr_pln::B200_Div01.xml) 단위테스트[M20170003006] ==> 완료 @@@ 
1. 개인청약설계_입금안내(/CBSC0l9S.xml)에서Div_B200(/CBSC080S.xml) ==> 저장(이미지): 클릭(TO_BE)
2. 입금안내(fNO.xml, dpt_rec::F040.xml)) > 입금안내(/N0, dpt_rec::F040_Div1.xml): Div_B200(ssr_pln::B200_Div01.xml) 
==> 해지환급금조회(/CBSCl32P.xml, /B200_Pop.xml) 기능과 같음 
 1) 입금안내(fF040_Div1.xml) 파일에서 저장(이미지): 클릭 
==============================================================================================================

- 보상한도조회[B070_Pop] (/CBSC055P.xml, ssr_pln::B070_Pop.xml) 단위테스트[7111031038019, M20170003284] ==> 완료 @@@ 
1. 계약상세내역조회(/CBSC028M.xml, psv_ens::D020.xml) > ==> 보상한도(이미지) 팝업 
==============================================================================================================

- 조직찾기(/CBS0020P.xml) 단위테스트[청약번호: 20170003006] ==> 완료 @@@
1. Grid에서 높이 수정(height:221px; --> height:286px;) 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) 테스트 수정 완료 @@@
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab(/CBSC044S.xml, ssr_pln::B330 _Div2.xml) 
==> M20170004192, M20170004237,  52~58 조건부 승인일 경우 --> 화면 비활성화 
==> scwin.lfn_ComponentEnable(div1, "btn_close", false); 	// 계약상태별 화면 비활성 처리 수정 
==> 테스트할 것(정해인 차장) -->  // 00: 완료, 90: 수납대기
==============================================================================================================

- 증명서발급(/CBSC101P.xml, ssr_out::B410_Pop.xml) 단위테스트[M20170004237, M20170004192] 
1. 재물청약설계(/CBSC094M.xml, 청약메인(ssr_pln::B030.xml)) > 보험료산출Tab(/CBSC09sS.xml, ssr_pln::B030 _div1.xml) 
==> 증명서발급 팝업(/CBSC101P_.xml) 생성  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.04(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 19:30 ==> 주말근무, 중식(부대찌개, 익선 정육식당: 구부장, 이부장 ==> 구부장이 쏨)  
 
- 주말 
06:00 기상
06:11 집출발(150번 버스:영림초교 -> 종로3가)
07:11 출근
07:11 업무 ==> 재물 팝업 수정
11:00 구부장 출근 
11:40 중식(김치찌개, 제육볶음: 정육 식당):구부장, 이부장(독감 예방주사 맞고 옴)
12:11 종료
13:00 업무 ==> Controller 일괄 수정(/Controller.java)
19:30 퇴근
20:00 석식(오징어덮밥, 치즈 김밥): 청구할 것
20:30 종료
20:40 150번 버스(영림초교 -> 종로3가)
21:30 귀가
23:50 취침
==============================================================================================================

- 더케이손해보험 영업지원S 구축 Prj[★] 
1. 특약상세입력[B630_Pop] (/CBSC116P.xml, ssr_pln::B630_Pop.xml) [M20170004192] ==> 완료 @@@ 
건물구조(이미지): 팝업 ==> 건물구조급수대[640_Pop] (/CBSC024P.xml, ssr_pln::B640_Pop.xml) 
평형계산(이미지): 팝업 ==> 평형계산[B660_Pop] (/CBSC127P.xml, ssr_pln::B660_Pop.xml) 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml, ssr_pln::B160.xml) > 인수심사결재(/CBSC084P.xml, ssr_pln:/0210_Pop1.xml) 
==> Grid에서 심의상태 내용(승인) 필드를 클릭[M20170004178, M20170003290]  
--> 인수심의결재_재물보험(/CBSC159S.xml, uwt_uwm::O210_Div2.xml) 
==============================================================================================================

- 특약상세 입력[B632_Pop] (/CBSC118P.xml, ssr_pln::B650_Pop.xml) ==> 완료 @@@ 
1. /CBS0049P: 시설소유자배상업종코드조회[B650_Pop] 화면 수정 
==============================================================================================================

- 특약상세입력[B634_Pop] (/CBSC120P.xml, ssr_pln::B634_Pop.xml) ==> 완료 @@@ 
1. /CBSCl27P: 평형계산[B660_Pop] 화면 수정 
==============================================================================================================

- Controller 수정 
/CBSC056PController.java, /CBSC090PController.java 
==============================================================================================================

- Websquare 로그 보기 단축키 
1.	Ctrl + Atl + i: 개발 도구 띄우기 
2.	Ctrl + i: xml 데이타 정렬
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.05(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
07:00 기상 
07:20 자전거(문영APT -> 대림운동장)  
0430 대림운동장(선이형 트럭: 창고에서 짐 싣기, 천막 싣기)
07:30 도신초교(사람들 많이 안나와서 11명도 겨우 맞춤)
08:30 게임(도신): 4쿼터 뜀 ==> 컨디션 안 좋아서 겨우 뜀
12:05 종료
12:30 중식(두루찌기: 무진장): 회에서 쏨
13:00 종료
13:30 귀가  ==> 루옌, 수종이랑 커피 놀이터 감
14:00 낮잠
17:00 기상
18:00 루옌, 수종귀가
19:00 석식(짜장면, 짬봉, 우동): 안동장 배달  --> 만다린 시킨다는 게 잘못 주문함  
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.06(월) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 통합테스트 준비, 석식(짜장면, 당구장) --> 짜장면 만 먹고 옴 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) 테스트 ==> 수정 완료 @@@ 
==============================================================================================================

- 보상한도조회[B070_Pop] (/CBSC055P.xml, ssr_pln::B070_Pop.xml) 단위테스트[7111031038019, M20170003284] ==> 완료 @@@ 
1.	개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) 청약번호: M20170003284
	계약상세내역조회(/CBSC028M.xml, psv_ens::D020.xml) ==> 보상한도(이미지) 팝업  ==> 계약번호: L21190000030
==============================================================================================================

- 통합테스트 교육 
1.	통테 1차 : 수행사(11/6~ 11/8) 통테 2차 : 고객(11/9 ~ 11/10) 통테 3차 고객(11/15~11/16) 
==============================================================================================================

- DB 연결 요청 
1. IT정보통신부 김영근 주임에게 요청 
==============================================================================================================

- /CBSC159S.xml 반영 요청 쪽지 보내기 
==============================================================================================================

- 개인 청약사항조회 (/CBSC014M.xml) 수정 
1. 현상:
개인청약사항조회 화면에서 피보험자명 ”김은” 으로 조회 --> 조회데이터없음 메시지 출력 
--> 메시지 박스를 닫고 그 상태에서 다시 조회 버튼을 클릭하면 
--> 서버 오류 라는 메시지박스가 여러차례 출력 후 다시 조회데이터없음 메시지 출력 
아울러 피보험자명을 콤보에서 선택하면 입력창이 디폴트로 한글이 되도록 수정 요청드립니다. ==> 강민수 PM이 요청
2. 원인: /CBSC014MController.java 파일이 안 올라감 
==============================================================================================================

- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_sst::B200_Pop.xml) [M20170004268] ==> 완료 @@@  
==============================================================================================================

- IE에서 팝업 에러 남 
1. /CBSC120P ---> 팝업 후 닫기에서 데이타 못 가져옴 
1) 특약상세입력[B630_Pop] (/CBSC116P.xml, ssr_pln::B630_Pop.xml) --> 화재손해(건물) 특약상세입력 
/CBSC116P에서 /CBSC024P 건물구조급수[B640_Pop] 
5) 특약상세 입력[B634_Pop] (/CBSC120P.xml, ssr_pln::B634_Pop.xml) --> 주차장배상책임 특약상세 입력 
==============================================================================================================

- console 로그 변경 내용 반영 안됨 
1. F12(개발자 도구) > Network에서 Disable cache 체크 해야 됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.07(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 통합테스트 시작 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 통합테스트 시작 
TKI-CBT-C-02(통합테스트케이스 및 결과서-응용-영업지원) 최종.xlsx 파일에서 S-CBT-12(장기수납확정) 테스트 
1. 장기수납확정(/CBSC090M.xml) 화면에서는 예금만 처리 가능 
2. 기간계시스텀[백승절, 과장(시스템개발팀: 2140026, / baek12qw@)] 
==> https://dlong01.thekins.co.kr:1610/menu/ AdminSystemLoader.html > 재무 > 자금 > 예금내역입력 화면 
 1) 계좌번호[청약 입금안내Tab에 있는 계좌번호와 일치] > 등록 
==============================================================================================================

- 개인 청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) 
1. 개발계에서 피보험자명은 '김은*"으로 조회 해야 합 
==============================================================================================================

- 자금세탁방지 의심거래보고(STR) 조회 및 선택[B160_Pop] (/CBSC088P.xml, ssr_pln::B160_Pop.xml) [M20170003284] ==> 수정완료 @@@ 
1.	청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 계약요약 Tab(/CBSC018S, ssr_pln::B010_Div3.xml) 
==============================================================================================================

- CR반영 @@@ 
- 장기수납확정(/CBSC090M.xml, acc_loan::7802.xml)  ==> 수정 완료 @@@ 
D:￦the_k￦workspace￦webapps￦theK￦svcxml￦longtermWaccounting￦loan￦7802.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)￦webapps￦theK￦svcxml￦accountingWloan￦7802.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦accounting￦loan￦7802지1115 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml, ssr_sst::B160.xml) 	==> 수정 완료 @@@ 
D:￦the_k￦workspace￦webapps￦theK￦svcxml￦longtermWssrWsst￦B160.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)￦webapps￦theKWsvcxml￦longtermWssrWsst￦B160.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B160.xml 
==============================================================================================================

- 개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml) 	==> 수정 완료 @@@ 
D:￦the_k￦workspace￦webapps￦theK￦svcxml￦longterm￦ssr￦plnWB120.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)￦webapps￦theK￦svcxml￦longtermWssr￦pin￦B120.xml 
D:￦00. Back up￦2017.07Wworkspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦pin￦B120.xml 
==============================================================================================================

- 보험 계약정보조회 [B250_Pop] (/CBSC056P.xml, ssr_pln::B250_Pop.xml) [사전 조회: M20170003189, M20170003182] ==> 수정 완료 @@@ 
[02. 정액담보조회: M20170004357] 
D:￦the_k￦workspaceWweba p psWtheK￦svcxml￦longtermWssrWpln￦B250_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)￦webapps￦theK￦svcxml￦longtermWssr￦plnWB250_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longtermWssrWpln￦B250_Pop.xml 
==============================================================================================================

- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) ==>보류(변경이 너무 많이 되었음) 
D:￦the_k￦workspace￦webapps￦theK￦svcxml뻐。ngterm￦ssr￦sst￦B290_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B290_Pop.xml 
D'￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B290_Pop.xml 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) 저장 확인[M20170004353]
1. 위 청약번호(M20170004353)로 청약사항 입력 탭에서 피보험자들에 대해 /CBSC129P 팝업하여 고지사항 저장 처리 후 
팝업화면에서 고지사항 입력 완료로 리턴주었으나 실제로는 마지막 피보험자의 고지사항 정보가 저장되지 않움,
재조회시 마지막 피보험자에 대해 미입력으로 나타남 ==> 정상 
==============================================================================================================

- 타보험 가입 사항[B220_Pop] (/CBSC11l4P.xml, ssr_pln::B220_Pop.xml) ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.08(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 22:00  ==> 주간보고 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 통합테스트 시작 
TKI-CBT-C-02(통합테스트케이스 및 결과서-응용 영업지원L최종.xlsx 파일에서 S-CBT-12(장기수납확정) 테스트 
1. 장기수납확정(/CBSC090M.xml) 화면에서는 예금만 처리 가능 
2. 기간계시스템[백승절, 과장(시스템개발팀: 2140026, / baek12qw@)] = 
==> https://dlong01.thekins.co.kr:1610/menu/ AdminSystemLoader.html > 재무 > 자금 > 예금내역입력 화면 
 1) 계좌번호[청약 입금안내Tab에 있는 계좌번호와 일치] > 등록 
==============================================================================================================

- 의심거래 보고(M20160003490) ==> 수정 완료 @@@ 
보상한도조회 : 계약번호 L23100000053 
==============================================================================================================

- SVN 싱크 에러(2번째) 
1. 현상 
Synchronize operation failed 
svn: E200030: There are unfinished transactions detected in 'C:￦TheKStudio￦workspaceW/CBS' 
svn: E155004: Commit failed (details f01low): 
svn: E155004: There are unfinished work items in 'C:WTheKStudioWworkspace￦/CBS'run 'svn cleanup' first 
2. 조치(SVN 싱크 에러 조치) 
 1) eclipse에서 /cbs 폴더 삭제 
 2) C:￦TheKStudio￦workspaceW/cbs 폴더 이름 변경 /cbs_2017.11.0B
 3) svn repository에서 Check Out 받기 
 4) eclipse> Websquare에서 처리 
  가. /cbs: 마우스 우 클릭 Properites > Properites for cbs(새창) ==> Websquare > Context Root(새창) 
==> Context Root: /cbs -->  /로 변경, Deploy Source: /src/main/webapp로 설정
 (C:￦TheKStudio￦workspace￦/cbsWsrc￦main￦webapp) ==> Apply: OK
==============================================================================================================

- eclipse 서버 실행 에러 
1. 현상: HTTP Status 404 - /websquare/websquare.do 
2. 조치: eclipse> tomcat 서버에서 
tomcat > Modules 
Web Modules 
Documcnt base: /cbs 
Path: / 
==============================================================================================================

- /CBSC023P 갱신형 특약 경과기간별 보험료 수정 요청[정해인 차장] ==> 수정 완료 @@@ 
AS_IS : 피보험자가 2명이상인 경우 피보험자가 combo 로 구성되어 피보험자별 조회가 가능합니다. 
TO_BE: 피보험자가 disabled되어 있어 다른 피보험자 조회가 불가합니다. 
Pobj에 Ds_Pibo 추가해서 넘겨드리니 (/CBSC016S)… AS_IS와 동일하게 수정부탁드립니다. 
==> Ds_Pibo(피보험자 정보 Ds 추가) ==> sInrpsName: 피보험자명 
==============================================================================================================

- 갱신형 특약 경과기간별 보험료 조회[B012_Pop] (/CBSC023P.xml, ssr_pln::B0l2_Pop.xml) [M20170003122] 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 보험료산출Tab(/CBSC016S, ssr_pln::B010_Div1.xml) 
2119 - 무배당 The-K 가족사랑 건강보험(1701) 상품인 경우 	==> M20170193170 
고지사항의 필수입력 체크가 AS_IS와 다르게 처리되고 있습니다. 확인된 항목은 월소득(만원) 입니다,
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) 테스트 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab(/CBSC044S.xml, ssr_pln::B330_Div2.xml)
 ==> M20170004192, M20170178340 ==> 테스트할 것(정해인 차장) 
2. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010 _Div2.xml) 
1. 운전자고지사항[B230_Div1_Pop] (/CBSC166S.xml, ssr_pln::B230_Div1_Pop.xmll) [M20170003189] 
2. 상해고지사항[B230_Div2_Pop] (/CBSC167S.xml, ssr_pln::B230_Div2_Pop.xmll) [M20170003189 ] 
3.	운전자고지사항[B230_Div3_Pop] (/CBSC168S.xml, ssr_pln::B230_Div3_Pop.xml) [M20170003189]  --> 저장[TEST] 
4. 운전자고지사항[B230_Div4_Pop] (/CBSC169S.xml, ssr_sst::B230_Div4_Pop.xml) [M20170003189] 	--> 저장[R] 
5. 질병고지사항[B230_Div5_Pop] (/CBSC170S.xml, ssr_pln::B230_Div5_Pop.xml) [M20170003393] --> TEST 데이타 없음 
6 질병2(하얀미소) 고지사항[B230_Div6_Pop] (/CBSC171S.xml, ssr_pln::B230_Div6_Pop.xml) [M20170003393, ] --> 저장[TEST] 
7 질병2(가족사랑)[B230_Div7_Pop] (/CBSC172S.xml, ssr_pln::B230_Div7_Pop.xml) [M20170003393, ]--> 저장[R] @@@ 
8 질병고지사항(11대 질병)[B230_Div8_Pop] (/CBSC173S.xml, ssr_sst::B230_Div8_Pop.xml)  [M20170003393] --> 저장[TEST] 
==============================================================================================================

- /CBSC058P 보험료 요약[B051_Pop] [재물청약: M20170003282] ==> 수정 완료 @@@ 
1. 재물보험에 정보가 AS_IS와 달리 보이고 있습니다. 확인부탁드립니다. 
==============================================================================================================

- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_pln::B051_Pop.xml) [재물청약:M20170003282] 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 보험료산출 ssr_pln::B010_Div1.xml) 
==> 체크박스 잘 안 먹음 ==> 이승경 연구원에게 문의할 것(자체 해결) 
==============================================================================================================

- 세금우대한도조회(/CBSC068M.xml, pay_ptm::/G430.xml)  ==> 수정 완료 @@@ 
==============================================================================================================

- 통합테스트 시나리로
1. (상담사) 고객의 청약 사항을 등록한다 
2. (고객) 무통장 입금을 한다.(입금형태: 예금, 가상계좌) 3 (상담사) 입금된 금액과 청약 정보를 확인 후 장기수납확정 처리한다. 
3. (상담사) 장기수납확정 조회 화면에서 처리 여부를 확인한다
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.09(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 22:00  ==> 석식(황태해장국, 병천순대: 구부장, 이부장, 강차장, 정근욱씨 ==> 구부장이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★]  
- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_pln::B200_Pop.xml) [M20170004357] ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 보험료산출Tab(/CBSC016S, ssr_pln::B010_div1.xml) 
==> 4. 예상환급금(이미지): 팝업 ==> Grid Head 수정  
==============================================================================================================

- 인수제한사유조회[B080_Pop] (/CBSC085P.xml, ssr_pln::B080_Pop.xml) [M20170003284] ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
==> /CBSC085P 그리드의 tooltip 반영 
<w2:gridView autoFit="aIiColumn" autoFitMinWidth="100" class="sty_Grid" dataList="Ds_LTIDA15" 
	focusMode="row" id="grd_LTIDA15" inputType="text" readOnly="true" 	tooltipDisplay="true"  tooltipShowAlways= "true" 
	tooltipPositionY="-10" tooltipPositionX="20"  tooltipFormatter=''”'scwin.ftn_tooItip" 
	style= "position:absolute; UseDBuff:true; InputPanel:FALSE; EndLinecollor:default; border:Flat; height:330px; left:0px; right:801px; 
	top:93px; width:802px;" tablndex="12" > 
//---------------------------------------------------------------
// function 명 : scwin.ftn_tooltip 
//  내용 : 그리드 tooltip Text 
//---------------------------------------------------------------
scwin.ftn_tooltip = function( rowlndex, collIndex, label){ 
	// console.log("[/CBSC085P.xml] [ftn_tooltip()] ==> [TEST_01] [rowlndex]나 rowlndex +"[collIndex]"+ collIndex); 
	var sRslt = ""; 
	
	if (collIndex == 3 && grd_LTIDA15.getCellData(rowlndex, collIndex) != null) {  	// 심사내용 필드 이면 
		sRslt = Ds_LTIDA15.getCellData( rowlndex , "sJugmCont"); 		// 심사내용 필드 
	}
	return sRslt;
};	 
==============================================================================================================

- 특약상세입력[B630_Pop] (/CBSC116P.xml) 수정[M20170004434] ==> 수정 완료 @@@ 
1)	특약상세입력[B630_Pop] (/CBSC116P.xml, ssr_pl"::B630_Pop.xml) --> 화재손해(건물) 특약상세입력 
2)	재물청약설계(/CBSC094M.xml, ssr_pln::B030.xml) > 보험료산출Tab(/CBSC095S.xml, ssr_pln::B030_Div1.xml) 
==> 특약사항 Grid에서 특약상세 이미지 필드: 팝업 
Ds_Prprt.rowposition = Ds_Prprt_Appl.rowposition;	// Dataset에서 현재 선택된 Record의 Index를 얻어오는 Property 
==> parent_Ds_Prprt.setRowPosition(Ds_Prprt_Appl.getRowPosition());		// Row 위치 Ds_Prprt_Appl.getRowPosition() 번째로 지 정 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml, ssr_pln::B160.xml) 	==> 수정 완료 @@@ 
1. 긴급심사 ==> Grid 배경색 변경 
scwinJfn_Bgcollor_Chg = function(data, formatted Data, rowIndex, collIndex) { 
	if (Ds_LTIEA00.getCellData(rowIndex, "sInsurFlag") == "자동차") {
		grd_LTIEA00.setCellBackgroundcollor( rowIndex , collIndex , "Iightblue" ); 
	} else if (Ds_LTIEA00.getCellData(rowIndex, "sInsurFlag") == "일반") {
		grd_LTIEA00.setCellBackgroundcollor( rowIndex , collIndex , "#F3E5E5" ); 
	} else { 
		grd_LTIEA00.setCellBackgroundcollor( rowIndex , collIndex , "wheat" ); 
	}
	
	if (grd_LTIEA00.getColumnID(Collndex) == "sCrNo") { 
		grd_LTIEA00.setCellStyle(rowIndex, collIndex, "text-decoration", "underline"); 
		grd_LTIEA00.setCellStyle(rowIndex, collIndex, “font-weight", "b01d"); 
	}
	return formatted Data; 
};	 
==============================================================================================================

- 해지환급금 조회 [B201_Pop] (/CBSC132P.xml, ssr_pln::B201_Pop.xml) 이경일 부장 꺼 ==> 수정 완료 @@@ 
1. 연금청약설계(/CBSC075M.xml, ssr_pln::collO.xml) > 보험료산출Tab{/CBSC076S, ssr_pln::C010_Div1.xml) 
==> 2. 개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) 취급자코드: 5170077[M20170004340] 
> 연금청약설계(/CBSC075M.xml)  
==============================================================================================================

- 영업지원 빌드 절차 및 시각 변경 공지 
# 절차 
- 기존 절차 : 개발서버 빌드 자동화 -> 개발서버 테스트 완료 후 운영서버 통합테스트 기간별 수동 빌드 
- 신규 절차 : 개발서버 빌드 자동화 -> 운영서버 통합테스트 빌드 자동화 
# 빌드 시각 
- 개발서 버 : 8:40, 12:00, 16:00 
- 운영서버 : 8:55, 12:15, 16:15 
==> 운영서버는 가장 최근에 성공한 개발 빌드의 리소스가 반영 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.10(금) 작업■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 22:00  ==> 인스웨이브 이승경 연구원 지원 나옴(15시 ~ 20시) 정윤경 연구원과 같이 옴 ==> 속도 문제 컨설팅

- 더케이손해보험 영업지원S 구축 Prj[★]
- CR반영 
- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) ==> 보류(변경이 너무 많이 되었음)@@@ 
D:￦the_k￦workspaceWweba p psWtheK￦svcxml￦longterm￦ssrWsstWB290_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기보험(AS_IS)_MP)￦webapps￦theK￦svcxml￦longtermWssr￦sst￦B290_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정WtheK￦svcxml￦longterm￦ssrWsst￦B290_Pop.xml
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) [M20170003189, M20170003278] 
- 2. 상해고지사항[B230_Div2_Pop] (/CBSC167S.xml, ssr_pln::B230_Div2_Pop.xmll) ==> 완료 
D:￦the_k￦workspace￦webapps￦theKWsvcxml￦longterm￦ssr￦sst￦B230_Div2_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기보험(AS_IS)_MP)￦webapps￦theKWsvcxml￦Ion gtermWssrWsstWB 230_div 2_Pop .xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longtermWssrWsst￦B230_Div2_Pop.xml 
- 5 질병고지사항[B230_Div5_Pop] (/CBSC170S.xml, ssr_sst::B230_Div5_Pop.xml) [M20140004067, ] ==> 완료 
D:￦the_k￦workspace￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div5_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div5_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기보험(AS_IS)_MP)_CR수정써theK￦svcxml￦longtermWssr￦sst￦B230_Div5_Pop.xml 
- 6. 질병2(하얀미소) 고지사항[B230_Div6_Pop] (/CBSC171S.xml, ssr_pln::B230_Div6_Pop.xml) [M20170004324] ==> 완료  
D:￦the_k￦workspace￦webappsWtheK￦svcxmlWlongtermWssrWsstWB230_Div6_Pop .xml 
D:￦100. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theKWs, !cxml￦longterm￦ssrWsst￦B230_Div6_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theKWsvcxml뻐。ngterm￦ssrWsst￦B230_Div6_Pop.xml 
- 7. 질병2(가족사람)[B230_Div7_Pop] (/CBSC172S.xml, ssr_sst::B230_Div7_Pop.xml) ==> 완료 
D:￦the k￦workspace￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div7_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theK￦svcxml￦longterm￦ssrWsst￦B230_Div7_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div7_Pop.xml 
- 8. 질병고지사항(11대질병)[B230_Div8_Pop] (/CBSC173S.xml, ssr_pln::B230_Div8_Pop.xml) ==> 완료 
D:￦the_k￦workspace￦webappsWtheK￦svcxml뻐。ngterm￦ssr￦sst￦B230_Div8_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기보험(AS_ISLM P)Wwebapps￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div8_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B230_Div8_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정WtheK￦svcxml￦longterm￦ssrWsst￦B290_Pop.xml 
----------------------------------------------------------------------------------------------------------

- 피보험자고지사항3: B230_Div3_Pop[M20120100552], B230_Div4_Pop[M20170003995], 
B230_Div5_Pop[M20140004067], B230_Div6_Pop[M20160003375]  
==============================================================================================================

- 2. 운전여부 라디오 버튼 체크 @@@ 
1. 자가용, 영업용 여부 Ds(Ds_Yn_2) ==> 영업용도 선택할 수 있도록 수정 처리
 < !--// 운전여부가 자가용, 영업용 여부 Ds(Ds_Yn_2) //--> 
<w2:dataList baseNode="list" id="Ds_Yn_2" repeatNode="map">
	 <w2:Columnlnfo> 
		<w2:Column dataType="text" id="CODE" name="CODE"> </w2:Column> 
		<w2:Column dataType="text" id="TEXTl" name="TEXTl"> </w2:Column> 
	</w2:Columnlnfo> 
	<w2:data use= "true" > 
	<w2:row> 
		<CODE> <![CDATA[l]] > </CODE> 
		<TEXTl> < ![CDATA[자가용]]><πEXTl> </w2:row> 
	<w2:row> 
		<CODE> < ![CDATA[2]] > </CODE> 
		<TEXTl> <![CDATA[영업용]]></TEXTl> </w2:row> 
	</w2:data> 
< /w2:dataList >
----------------------------------------------------------------------------------- 

- 승용차
rad_A0401_2_2_2_01: 자가용 	==> Ds_Yn_2 
Radio3: 영업용 ==> 	<!--// 영업용[1. 승용차]	 //--> 제거 @@ 
----------------------------------------------------------------------------------- 

- 화물차 
rad_A0401_2_2_2_02: 자가용 ==> Ds_Yn_2 
Radio0: 영업용 	==> <!--// 영업용[2 화물차1	//--> 제거 @@ 
----------------------------------------------------------------------------------- 

- 승합차 
rad_A0401_2_2_2_03: 자가용 ==> Ds_Yn_2 
Radio1: 영업용 	==> <!--// 영업용[3. 승합차]	//--> 제거 @@ 
----------------------------------------------------------------------------------- 

- 오토바이 
rad_A0401_2_2_2_04: 자가용 ==> Ds_Yn_2 
Radio2: 영업용 	==> <!--// 영업용[4. 오토바이1	 //--> 제거 @@  
==============================================================================================================

- sPlanProgRankCd: 설계진행단계코드 
10:계약기본 
20:보험료산출(인)/30 보험료산출(물)/40 보험료산출Tab 50:청약사항입력(고지사항) 
51:심사대상/52:인수요청/53:진 단심 사중/54:실사심 사중/55 인수심 사중/56:인수승인/57:인 수불 인/5S:조건부불 인/59: 조건부승인 
60:계약요약 
70 입금안내/80:배서확정안내 
90:수납대기/91:지급대기/92 정구중 
00:완료 
==============================================================================================================

- 청약심사대상조회(/CBSC111M.xml, ssr_pln::B160.xml) ==> 수정 완료 @@@ 
1. 단체 배경색 수정 
2. 권한 조회 후 sAuthByflag = 1 이면 개인정보 모두 보여줌 
sAuthByflag = nfn_checkAuthByID(SOBJ_LOAD, DOBJ_LOAD, "ds_code", gUserID , "5000014"); 
// 2014.03.06 N1403-00033(장기보험 화면 개인정보 처리 요청) 
==============================================================================================================

- Ds_SqrtList 
1. sDoerUser(사용인코드), sDoerUserName (사용인명) 
==============================================================================================================

- 개인청약사항조회(/CBSC0I4M.xml, 청약사항조회(ssr_pln::BI20.xml)) ==> 수정 완료 @@@ 
1. Grid에서 스캔상태 칼럼 팝업 처리 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
var sOnlySrarch  = "";		//12015.06.02(N 1506-00025) 조회전용구분값 --> 인수심사요청 팝업화면(B170_Pop]에서 
==============================================================================================================

- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_pln::B200_Pop.xml) [M20170004340] ==> 수정 완료 @@@  
1. switch_div sw_div0 보이기[해지환급금 Gridl:의료비 빚 질병위험률] ==> 수정: 2017.11.05, by 진태만 
2. switch_div sw_div1 보이기[해지환급금 Grid2: 표준이율*1.2] ==> 수정: 2017.11.10, by 진태만 
3. switch_div sw_Div2 보이기[평균공시이율] ==> 수정: 2017.11.11, by 진태만 [M20170004340]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.11(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==>  
 
- 주말 
06:00 기상
06:10 TV 시청
07:10 집출발(150번 버스:영림초교 -> 종로3가)
08:30 출근
08:40 업무 ==> 보험료 요약 수정(체크박스 수정)
10:00 구부장 출근 
11:40 중식(황태해장국): 병천황토방순대 --> 구부장이 법인카드 줘서 혼자 먹고 옴
12:11 종료
13:00 업무 ==> 보상한도(131, 131(연금)) 수정
19:30 퇴근
19:40 지하철(안국역 -> 대림역)
20:30 석식(치즈돈가스, 셀러드 김밥: 김밥천국 대림점): 청구할 것
21:00 종료
21:20 빼빼로 구입
21:40 귀가  ==> 루옌 빼빼로 받고 기뻐함(수종 빼빼로 혼자 먹을려고 울었음)
23:50 취침
==============================================================================================================

- 더케이손해보험 영업지원S 구축 Prj[★] 
- CR반영 
- 피보험자 누적 [B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) ==> [M20170004510, M20170003284] @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
D:￦the_kWworkspace￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B290_Pop.xml
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B290ι_Pop.xml 
D:￦00. Back up￦2017.07~에workspace(장기보험(AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B290_Pop.xml 
==============================================================================================================

- 특약상세 입력 [B631_Pop] (/CBSC117P.xml, ssr_pln::B631_Pop.xml) [5170058, M20170004390] ==> 수정 완료 @@@ 
상품명: 2808(보금자리 화재저죽보험) > 풍수재손해(특수) > 계약상세입력[B631_Pop] (/CBSC117P.xml)
1. 특수건물유형: cmb_SpclBuldgTypeCd 
==============================================================================================================

- 해지환급금 조회[B200_Pop] (/CBSC131P.xml, ssr_pln::B200_Pop.xml) [재물 5170058, M20170004390] ==> 수정 완료 @@@ 
1) 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 보험료산출Tab(/CBSC0I6S, ssr_pln::B010_Div1.xml) 
1.	switch_div sw_div0 보이기[해지환급금 Gridl: 의료비 및 질병위험률][10열] ==> 수정: 2017.11.05, by 진태만 
2.	switch_div sw_div1 보이기[해지환급금 Grid2: 표준이율*1.2][8열] ==> 수정: 2017.11.10, by 진태만 
3.	switch_div sw_Div2 보이기[해지환급금 Grid2: 평균공시이율][8열] ==> 수정: 2017.11.11, by 진태만 
==============================================================================================================

- 해지환급금 조회[B201_Pop] (/CBSC132P.xml, ssr_pln::B201_Pop.xml) [연금청약 M20170004340] ==> 수정 완료 @@@ 
1) 연금청약설계(/CBSC075M.xml, ssr_pln::C010.xml) > 보험료산출Tab(/CBSC076S, ssr_pln::C010_Div1.xml) 
==> 2) 개인청약사항조회(/CBSC0I4M.xml, 청약사항조회(ssr_pln::BI20.xml)) 취급자코드: 
5170077[M20170004340] > 연금청약설계(/CBSC075M.xml) 
1.	switch_div sw_div0 보이기[해지환급금 Gridl: 표준이율★1.2][8열] ==> 수정: 2017.11.05, by 진태만 
2.	switch_div sw_div1 보이기[해지환급금 Grid2: 적용이율][6열] ==> 수정 2017.11.10, by 진태만 
3. switch_div sw_Div2 보이기[해지환급금 Grid2: 평균공시이율][8열] ==> 수정 2017.11.11, by 진태만 [M20170004340] 
==============================================================================================================

- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_pln::B051_Pop.xml) [AH물: 5170058, M20170004390] ==> 수중 중 
1.	청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 계약요약 Tab(/CBSC0I8S, ssr_pln::B010_Div3.xml) 
2.	재물청약설계(/CBSC094M.xml, 청약메인(ssr_pln::B030.xml)) > 보험료산출Tab(/CBSC095S.xml, ssr_pln::B030_Div1.xml) [보험료요약] 
 1. 목적물 2개 이상인 경우 건물 두개 이상 체크될(하나만) 
 2. 선택된 목적물 or 피보험자에 해당하는 특약이 하단에 보여져야 함 ==> 현재 고정되어 있음 
==============================================================================================================

- 보험료 요약[B050_Pop] (/CBSC057P.xml, ssr_pln::B050_Pop.xml) 단위테스트[단체M20170004549] ==> 수정 완료 @@@ 
1) 단체청약설계 (/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 보험료산출Tab(/CBSC043S, ssr_pln::/CBSC043S.xml)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.12(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
06:30 기상 
06:40 자전거(문영APT -> 대림운동장)  
06:50 짐 나르기(선이형 강화도로 놀러감)
07:20 숏게임
08:00 자체 게임(3게임 뜀)
10:00 종료
10:30 중식(동태탕: 김미자 동태탕): 회에서 쏨(회장님이 계산함)
	==> 동주형 어제 결혼식 참석 많이 안 해서 기분 안 좋은 것 같음
13:00 종료
13:30 큐맨 당구장 ==> 철희형 한 손 100: 기석이형 150  ==> 2판 모두 철희형이이김(10만 원 내기)
	--> 철희형, 기우형 <--> 기석이형 , 지경이형[지경이형 편이 이김]
14:00 종료
14:20 진참치 ==> 기석이형이쏨[17만원 나옴] 
16:00 귀가 ==> 루옌 15시까지 집에 올라고 했는데 수종 데리고 모임에 감
17:00 낮잠
20:00 루옌, 수종 귀가 
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.13(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==>  

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_p' , .. B051_Pop.xml) [재물: 5170058, M20170004390] ==> 수정 완료 @@@ 
1. 재물청약설계(/CBSC094M.xml, 청약메인(ssr_pln::B030.xml)) > 보험료산출Tab(/CBSC095S.xml, ssr_pln::B030_Div1.xml)
==> 목적물 Grid> 추가(+): 
가입업종 주택 > 단독주택 추가 
요율업종 주택 > 단독주택 추가 
가입업종 주택 > 아파트 추가 요율업종: 주택 > 아파트 추가 
[보험료요약] 
1 목적물 2개 이상인 경우 건물 두개 이상 체크됨(하나만) 
2 선택된 목적물 or 피보험자에 해당하는 특약이 하단에 보여져야 함 : 현재 고정되어 있음 
==> 목적물  정보 Ds(Ds_Prprt), 피보험자 정보 Ds(DsJnsurPerson) 2개의 Ds에서 선택 클릭시oncelldatachange 수행  
 
- 증명서발급(/CBSClO1P.xml, ssr_out::B410_Pop.xml) [청약번호: 20170003006] ==> 수정 완료 @@@ 
1. 검증계 설계번호 : M-2017-0193312 
AS-IS는 청약서, 질문서가 활성화가 안됨 
TO-BE는 활성화가 되어 청약서 발행시 업무흐름의 진행에 제어가 생겁니다. 
AS-IS와 동일하게 출력가능한 문서 제어 해주세요(/CBSC043S 최신버전 다운로드 후 테스트해주세요) 
==============================================================================================================

- 세금우대한도조회(/CBSC068M.xml, pay_ptm::G430.xml)  ==> 수정 완료 @@@ 
1. 세금우대한도조회_1(/CBSCl47S.xml, pay_ptm::G430_Div0.xml) 
2. 세금우대한도조회_2[연금저축] (/CBSCl48S.xml, pay_ptm::G430_Div1.xml) 	==> 
Ds_SendTax.setCellData(0, "nTaxMonTamt", nTaxMonTamt); 	// 연금 월납 가능 금액 
var nTaxPrfrlnsTamt4 = Math.floor(nTaxPrfrlnsTamt3); ==> // 716666 --> wconv.truncate(7166.66, 1); ==> // 7166.6 *100 ~> 716660 
var nTaxPrfrlnsTamt5 = wconv.truncate((nTaxPrfrlnsTamt4 * 0.01), 1) *100; 	// 일의 자리 0으로 처리 ==> 소수점 1째자리 버림 처리(truncate) 
// ==> // 716660 
console.log("[/CBSCl48S.xml] [body2_onpageload()] ==> [TEST_91] [Ds_SendTax.nTaxPrfrlnsTamt]"+ 
Ds_SendTax.getCellData(0, "nTaxPrfrlnsTamt") +"[연금 월납 가능 금액]" + nTaxPrfrlnsTamt5 + "[nTaxPrfrlnsTamt4]" + nTaxPrfrlnsTamt4 );  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.14(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 퍼블 작업 심정보 차장(디자이너/퍼블러셔) 재투입(1주일) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 특약상세 입력 [B631_Pop] (/CBSC117P.xml, ssr_pln::B631_Pop.xml) [5170058, M20170004390] ==> 수정 완료@@@ 
1.	재물청약설계(/CBSC094M.xml, ssr_pln::B030.xml) > 보험료산출Tab(/CBSC095S.xml, ssr_pln::B030_Div1.xml)   
상품명 2808(보금자리 화재저죽보험) > 풍수재손해(특수) > 계약상세입력[B631_Pop] (/CBSC117P.xml) 
1. 특수건물유형: cmb_SpclBuldgTypeCd ==> 풍수재담보 특약상세입력 화면에서 특수건물유형 선택 후 적용 처리 안됨  
==============================================================================================================

- 특약상세 입력 [B630_Pop] (/CBSC116P.xml, ssr_pln::B630_Pop.xml) --> 확인 
1.	dUBuldgStrt.setValue(DsWs_P01e TypeCd.getCellData(n P01e TypeCdldx, "sH nglCd Name")
+ " / " + DsWs_ExtrnWITypeCd.getCellData(nExtrnWITypeCdldx, "sHngICdName") 
+ " / " + DsWs_RoofTypeCd.getCellData(nRoofTypeCdldx, "sHnglCdName“)); 	//신체손해배상책임, 풍수재손해 
console.log("[/CBSC095S.xml] [Ifn_ Trty_OnCeIiClick01 ==> [Grid 클릭 이벤트] [특약상세입력_팝업_후_9_0)
+ "[DsWs_P01e TypeCd. 기둥형태]"+ DsWs_P01eTypeCd.getCellData(nP01eTypeCdldx, "sHngICdName") 
+ "[DsWs_ExtrnWITypeCd.기둥형태]" + DsWs_ExtrnWITypeCd.getCellData(nP01eTypeCdldx, "sHngICdName")
+ "[DsWs_RoofTypeCd 지붕형태]"+ DsWs_RoofTypeCd.getCellData(nP01eTypeCdldx, "sHngICdName") );  
==============================================================================================================

- 통합계약조회(/CBSC115M.xml, psv _ens:D170.xml) ==> 콤보 팝업 수정 완료 @@@ 
1)	특약상세 입력 [B630_Pop] (/CBSC116P.xml, ssr_pln::B630_Pop.xml) --> 화재손해(건물) 특약상세 입력 
2)	특약상세입력[B631_Pop] (/CBSC117P.xml, ssr_pln::B631_Pop.xml) --> 신체손해배상책임, 풍수재손해 특약상세 입력  
3)	특약상세입력[B632_Pop] (/CBSC118P.xml, ssr_pln::B632_Pop.xml) --> 시설소유(관리)자 특약상세입력 
4)	특약상세입력[B633_Pop] (/CBSC119P.xml, ssr_pln::B633_Pop.xml) --> 학교경영자배상책임 특약상세입력 
5)	특약상세입력[B634_Pop] (/CBSC120P.xml, ssr_pln::B634_Pop.xml) --> 주차장배상책임 특약상세입력 
6)	특약상세입력[B635_Pop] (/CBSC121P.xml, ssr_pln::B635_Pop.xml) --> 음식물배상책임 특약상세입력 
7)	특약상세 입력[B636_Pop] (/CBSC122P.xml, ssr_pln::B636_Pop.xml) --> 가스사고배상잭 임 특약상세 입력 
8)	특약상세입력[B637_Pop] (/CBSC123P.xml, ssr_pln::B637_Pop.xml) --> 점포휴업손해 특약상세입력  
==============================================================================================================

- 개인청약에서 청약번호 생성
0. 개인청약설계 [/CBSC015M] 화면에서 
1. 취급자 강명수(5170094)로 변경 
2. 피보험자 Grid에서 주민번호 필드에 '80010-1*' 기입 
3. 주민번호(이미지) 클릭 
4. 상품명: 2118 
5. 보험료계산 
6 .다음: 클릭 ==> 청약번호 생성(M20170004636) 
5. 사전조회  
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) 	[M20170004633] ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml)  
==> 질병2(가족사랑)[B230_Div7_Pop] (/CBSC172S.xml, ssr_pln::B230_Div7_Pop.xml) [M20170003393, ] --> 저장[R]@@@ 
==> medt_A1600_2_3_0: 월소득 수정(널이면 alert 처리) 
if (wconv.length(medt_A1600_2_3_0.getValue()) == 0 && medt_A1600_2_3_0.getDisabledO == false) {}  // 월소득이 null 이거나 활성화이면 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.15(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 22:00  ==> 주간보고, 통합테스트(고객), 포항 흥해읍에 규모 5.4 지진 발생(수능 1주일 연기) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- CR반영 
- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) ==> [M20170004S10, M20170003284] @@@ 
1. 청약메인(/CBSC015M.xml), 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
D:￦the_k￦workspace￦webapps￦theK￦svcxml￦longterm￦ssr￦sst￦B290_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험(AS_IS)_MP)￦webapps￦theK￦svcxml뻐ongterm￦ssr￦sst￦B290_Pop.xml 
D:￦00. Back up￦2017.07￦workspace(장기 보험 (AS_IS)_MP)_CR수정￦theK￦svcxml￦longterm￦ssr￦sst￦B290ι_Pop.xml 
switch_div.setSelectedID("sw_div0"); 	// switch_div sw_div0 보이기[해지환급금 Grid1] ==> 수정: 2017.11.10, by 진태만 
==============================================================================================================

expression ==> wconv.toNumber("nrDead")/10000;		// --> 안먹 음(displayFormatter 처리) 
expression ==> sum("nIrSeqIObst")/10000;
//---------------------------------------------------------------
//  Ifn_getColumnValue: 칼럼 displayFormatter 처리 함수 
//---------------------------------------------------------------
scwin.lfn_dsp_formatter = function(data) {  
	var nRslt = util.appendComma(wconv.toNumber(data)/10000); 		// 10000자리 나눔, 숫자에 3자리 수마다 Comma를 적용 
	// console.log("(/CBSC128P.xml] [lfn_dsp_formatter()] ==> [TEST_91] [nRslt]"+ nRslt +"[data]"+ data ); 
	return nRslt;
}; 
==============================================================================================================

- Objects 처리(오브젝트) 
//--------------------------------------------------------------- 
// Ifn_getColumnValue: 칼럼 expression 처리 함수 
//---------------------------------------------------------------
scwin.lfn_getColumnValue = function(data, formatted Data, rowlndex, collIndex) { 
	// console.log("(/CBSC128P.xml] [lfn_getColumnValue()] ==> [TEST_01] [rowlndex]" + rowlndex ); 
	
	var nRslt = 0; 
	var Objects = WebSquare.util.getComponentByld(this.id);		// WebSquare 타입 Objects
	console.Iog(" (/CBSC128P.xml] [lfn_getColumnValue()] ==>[TEST_02] [collIndex]"+ collIndex +"[this.id]"+ this.id +"[Objects]"+ Objects ); 
 
	if(Objects.getColumnID(collIndex) == "nlnjrSeqIObst") {	// Grid 칼럼이 '3'(상해후유장해)  이면 
		nRslt = wconv.toNumber(Ds_LTIEA18.getCellData(rowlndex, "nlnjrSeqIObst"))/10000; 
	}
};	 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.16(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 20:00  ==> 석식(부대찌개, 양마니 식당: 구부장, 이부장, 강차장 정근욱씨, 유대리 ==> 구부장이 쏨) 
				, 삼겹살(오사장, 구부장, 이부장), 호프집(오사장, 구부장, 이부장 김차장, 강민수PM) ==> 은행연합회 문제 복잡 

- 더케이손해보험 영업지원S 구축 Prj[★]
- CR반영 
- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_sst::B290_Pop.xml) ==> [M20170004510, M20170004721] ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
==> Grid에서 id가 충돌하면 데이타가 마지막 id 데이타로 보여짐 ==> id값 유니크하게 설정할 것  
==============================================================================================================

- 장기수납확정(/CBSC090M.xml, acc_loan::7802.xml) 확인 ==> 수정 완료 @@@ 
1. typeError.swin.getCollTargetList ==> [예금] 에러가 발생
scwin.getCoIlTargetList(); 	// 조회 
==============================================================================================================

- 개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) ==> 수정 완료 @@@ 
1. 엑셀 출력 
// Ds_PlanListExl2.Append Dataset(" Ds_PianListExl"); 
Ds_PlanListExl2.setJ SON(Ds_PlanListExl.getAllJSON(), true);  // JSON Data를 set 또는 append 처리(true: 추가) 
==> 재가공 해야하는 데이타는 for 돌면서 Ds_PlanListExl2.setCellData를 해줘야 다운로드된 엑셀에서 데이타 보임 
//---------------------------------------------------------------
// function 명 : Ifn_excel 
// 내용 : 엑셀
//---------------------------------------------------------------
scwin.cm_btnExDown = function() { 
	for (var i = 0; i < Ds_PlanListExI2.getRowCount(); i++) { 
		var sSsrtDate = Ds_PlanListExI2.getCellData(i, "sSsrtDate"); 
		
		if(!util.isNull(sSsrtDate)) {		// Grid에서 칼럼이 '청약일/발행일'(5번째 칼럼) 이면 
			sRslt = wconv.substr(sSsrtDate, 0, 4) +"-"+ wconvsubstr(sSsrtDate, 4, 2) +"-"+ wconv.substr(sSsrtDate, 6, 2) 
			+"-"+ wconv.substr(sApplyPrtDate, 0, 4) +"-"+ wconv.substr(sApplyPrtDate, 4, 2) +"-"+ wconv.substr(sApplyPrtDate, 6, 2); 		
			// 청약일/발행일 
			Ds_PlanListExI2.setCellData(i, "sSsrtDate", sRslt); 
			// console.log("[/CBSC014M.xml] [cm_btnExDown()] ==> [Grid에서 칼럼이 '청약일/발행일' 이면] [sRslt]" + sRslt ); 
		}
	}	// end of for()
	common.downLoadExcel("grd_PlanListExl", option, infoArr); 
	wprom.alert(“엑셀저장이 완료되었습니다."); 
}; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.17(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 20:30  ==> 피자 파티(15시, LG CNS 강민수 PM이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst.:B230_Pop.xml) [M20170004633] ==> 수정 완료 @@@  
==============================================================================================================

- indexOf: 문자열에서 주어진 부분 문자열의 위치를 찾는 Basic API 
1. 예시) nRstCnt = indexOf("abc", "b"); 		// return 예시) 1		--> 1번째 위치 @@@ 
2. Websquare에서 예시) if(sCompRequest.indexOf("group") > -1) { }	// group 존재하면(제외 시킴)  return 예시)   
group이 아무 위치나 존재하면 @@@   
==============================================================================================================

- 특약상세 입력 [B631_Pop] (/CBSC117P.xml, ssr_pln::B631_Pop.xml) ==> 수정 완료 @@@ 
--> 상품명: 2808(보금자리 화재저축보험) > 풍수재손해(특수) > 계약상세입력[B631_Pop] (/CBSC117P.xml) 
1. 특수건물소재지 별 조회(/CBSC179P.xml) 팝업 띄우기  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.18(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 날씨 많이 추움
 
- 주말 
06:30 기상 
07:10 집출발(축구하러 자전거타고 나갔다가 너무 추워서 돌아옴)
07:20 귀가
07:40 TV 시청
12:20 집출발(수종)
12:35 신대방 성원 쌍떼빌 정류장
13:50 종로5가 효제 초교 정류장
13:55 엘가모아(정현이 만남)  ==> 축의금 5만원 함
14:20 중식(5층 식당) ==> 선희형, 기우형님, 형근이형, 재식, 현용, 병준
	 --> 수종 음식 많이 안 먹고 아이스크림만 많이 먹음 
15:00 종료
15:20 버스(종료4가 정류장)
17:20 귀가
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.19(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

- 묘사
05:30 기상 
05:50 505번 버스(영림초교 정류장)
06:30 광명역
07:01 광명역 출발(KTX) ==> 갤럭시 탭으로 영화 '조작된 도시' 시청
09:08 포항역 도착
09:20 107번 버스(포항역)
09:40 유성여고 정류장
10:00 포항집 도착
10:20 묘사 조문 준비
11:20 묘사 준비 
12:30 묘사 ==> 시사 조문 읽음
	작은 아버지(숙모, 대규, 선희, 선주 누나), 종욱이 아제, 병일이 아제(숙모),  
	동욱이 고모부 --> 45만원(집 당 6만원) 모아서 회비로 사용
	==> 병일이 아제가 고성에 월 만원씩 내서 땅 사서 묘사 지내자고 하길래 고성은 너무 멀어서 안된다고 의견냄
15:00 종료
16:00 큰누나, 매형 방문
17:10 대규차(선희 누나)
17:30 포항역
18:00 포항 출발  ==> 갤럭시 탭으로 영화 '옥자' 시청
20:20 광명역 도착
20:30 5633번 버스(광명역 정류장) ==> 시간 너무 많이 걸림
21:30 구로디지털단지역
21:50 귀가
24:00 취침
===================================================================================================================  

■■■■■■■■■■■■■■■■■■ 2017.11.20(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==>  

- 더케이손해보험 영업지원S 구축 Prj[★] 
- Async Promise 일괄반영 
==============================================================================================================

- 보험 계약정보조회[B250_Pop]  (/CBSC056P.xml, ssr_pln::B250_Pop.xml) [사전조회: M20170003189]  
==============================================================================================================

- 타보험 가입 사항[B220_Pop] (/CBSC114P.xml, ssr_pln::B220_Pop.xml) [M20170004128] ==> 수정 완료 @@@ 
1. 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S,ssr_pln::B010_Div2.xml) 
2. loading bar 추가 
 가. 현상 
VM1998:68 Uncaught (in promise) TypeError: Cannot read property 'getCeliData' of undefined  
at eval (eval at WebSquare.BootLoader.globaIEval (javascript.wq?q=/bootloader:10), <anonymous>:68:38) at <anonymous> 
 나. 원인 
var pObj = wprom.getParamObjectQ; 
parenCDs_LTIDA00 = pObj Ds_LTIDAO(); 	// 부모창 피보험자 정보 Ds Set  ==> 실제 데이타를 못 받아 옴 
 다. 조치: Ds_LTIDA00 추가 
case "OthrlnsurCntName": 	// 타보험 
	var pObj = { // 수정(추가): 2017.끄.20, by 진태만 
		"Ds_LTIDA00" : parent.Ds_LTIDA00 		// 보험 기본사항 정보 Ds 
	}	// 자식으로 보낼 부모 Ds OBJECT 리스트 
  
	pro = pro.then(function(rv) { 
		var poplnfo = { 
			"width" : 795,
			"height" : 415, 
			"indata" : indata, 
			"parentObject" : pObj,	// 자식으로 보낼 부모 Ds OBJECT 리스트 	// (추가): 2017.11.20, by 진 태 만 
			"title“ 	"타보헝 가입 사항” 
		}	 
	return wprom.PopuPopen("/ui/CBSC/CBSC114P.xml", poplnfo); 
==============================================================================================================

- 수익자등록[B111_Pop] (/CBSC070P.xml, ssr_pln::B111_Pop.xml) [M20170003006] 
1. 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab(/CBSC044S.xml, ssr_pln::CBSC044S.xml) 
==============================================================================================================

- 특정부위.질병 부담보[B210_Pop] (/CBSC126P.xml) 
1. 단체피보험자명세[B180_Pop] (/CBSC046P.xml, ssr_pln::B180_Pop.xml) [M20170003006] ==> 수정 완료 @@@ 
 1) 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 보험료산출Tab(/CBSC043S, ssr_pln::/CBSC043S.xml)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.21(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 

- 더케이손해보험 영업지원S 구축 Prj[★]  
- 장기수납확정조회(/CBSC092M.xml, acc_loan::7830.xml) ==> 수정 완료 @@@  
==============================================================================================================

- 정산과목 조회[3217] (/CBSC150P.xml, Popup::3217.xml) ==> 샘플 데이타 없음 
1. 장기보상 > 보상금지급 > 보상금지급(인) (/CBSR004M.xml, Icla_sad::CIC16441100s.xml) 
2. 장기보상 > 보상금지급 > 보험금지급(재물/배잭)(/NO.xml, Icla_sad::CIC16441200s.xml)  
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst:B230_Pop.xml) [M20170004745] ==> 수정 완료 @@@ 
1) 청약메인(/CBSC015M.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml) 
==> Gr버에서 고지사항 필드: 팝업  
==============================================================================================================

- 보상한도조회[B070_Pop] (/CBSC055P.xml, ssr_pln::B070_Pop.xml) [청약번호: M20170003284] ==> 수정 완료 @@@ 
1) 피보험자I 주민번호 처리 ==> 
Ds_LTIDA00.setCell Data(0, "sInrpsName", gfn_ changeMask(Ds_L TIDAOO.getCellData(0, "sInrpsName"), "4")); 
// 피보험자; 마스크 처리[4. 성명:2째자리 부터 2자리 * 처리] 
Ds_LTIDA00.setCeil Data(0, "sInrpsCd", gfn_ cha ngeMask(Ds_LTIDA00.getCeil Data(0, "sInrpsCd "), " 1 ")); 
// 주민번호: 마스크 처리[1. 주민번호: 뒷번호 6자리]  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 20l7.11.22(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:40  ==> 새벽에 비옴(맞고 옴), 주간보고 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 장기수납확정조회(/CBSC092M.xml, acc_loan::7830.xml) ==> 수정 완료 @@@ 
1. 취급자 팝업, 코드 조회 처리: agf_Pop 함수 더 분석할 것 
==> var argArry = agf_Pop("사원목록", Edt_sAgnt.getValue(), Edt_sAgntName.getValue(), '''', sPopParm);  
==============================================================================================================

- 장기수납확정조회(/CBSC092M.xml, acc_loan::7830.xml) ==> 수정 완료 @@@ 
1. scwin.lfn_getColumnValue() 함수 수정  
==============================================================================================================

- 보험료 요약[BOSl_Pop] (/CBSC058P.xml, ssr_pln::BOSl_Pop.xml) ==> 수정 완료 @@@ 
1. 합계 수정  
==============================================================================================================

- 수익자등록[B110_Pop] (/CBSC069P.xml, ssr_pln::B110_Pop.xml) [M20170004617] ==> 수정 완료 @@@ 
1. scwin.lfn_ComponentEnable(B110_Pop, "btn_close", false); 		// 계약상태 별 화면 비활성 처리  
==============================================================================================================

- 수익자등록[B1I1_Pop] (/CBSC070P.xml, ssr_pln::B1I1_Pop.xml) [M20170004617] ==> 수정 완료 @@@ 
1. scwin.lfn_ComponentEnable(B110_Pop, "btn_close", false); 		// 계약상태별 화면 비활성 처리  
==============================================================================================================

- 타보험가입사항[B220_Pop] (/CBSC114P.xml, ssr_pln::B220_Pop.xml) [M20170004617] ==> 수정 완료 @@@ 
1. scwin.lfn_ComponentEnable(B110_Pop, "btn_close", false); 		// 계계약상태별 화면 비활성 처리  
==============================================================================================================

- 특정부위.질병 부담보[B210_Pop] (/CBSC126P.xml, ssr_pln::B210_Pop.xml) [M20170004617] ==> 수정 완료 @@@ 
1. scwin.lfn_ComponentEnable(B110_Pop, "btn_close", false);  		// 계약상태별 화면 비활성 처리  
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) [M20170004617] ==> 수정 완료 @@@ 
1. scwin.lfn_ComponentEnable(B110_Pop, "btn_close", false); 		// 계약상태별 화면 비활성 처리 
1) 청약메인(/CBSC0llSM.xml, 청약메인(ssr_pln::B010.xml)) > 청약사항입력Tab(/CBSC017S, ssr_pln::B010_Div2.xml)  
==> Grid에서 '계약번호' 필드 팝업 
2) 개인 청약사항조회(/CBSC014M, ssr_pln::B120.xml] > 계약상세내역조회(/CBSC028M.xml, psv _ens::D020.xml) ==> Grid에서 고지사항 필드: 팝업 
3) 진단심사대상조회(/CBSCl06M.xml, ssr_pln::B240.xml) --> 고지의무(이미지): 팝업: [M20170004443{/CBSCl72S, M20170004617(/CBSCl67S)]  
4) 청약심사대상조회(/CBSCl11M.xml, ssr_pln::B240.xml) > 인수심사결재(/CBSC084P.xml, I0210_Pop1.xml) 
(팝업) > 인보험심사 Grid> '고지의무' 필드 클릭 [M201700047S3 계약상태별 화면 비활성 처리] 
S) 단체청약설계(/CBSC042M.xml, 청약메인(ssr_pln::B330.xml)) > 청약사항입력Tab{/CBSC044S.xml, ssr_pin::B330_Div2.xml) 
==> Grid에서 '고지사항' 필드 팝업  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.1l.23(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 2018년도 수학능력시험(렁경이 응시), 구종식 부장 아들 수능 응시(11시 출근)  
				, 인스웨이브 이승경 연구원 지원 나옴(I5시 ~ 18시) ==> 속도 문제(일부 해결: insert Column 패치) 
				, 퍼블 작업 심정보 차장 철수(19시), 석식(황태해장국, 병천순대: 구부장, 이부장, 강차장, 유대리, 정 대리 ==> 구부장이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 인수제한사유조회[B080_Pop] (/CBSC085P.xml, ssr_pln::B080_Pop.xml) [M20170004713] ==> 수정 완료 @@@ 
1. 사업방법서분류코드(2 운전자, 4:재물): 버튼 활성화 
if(Ds_LTIDA00.getCellData(0, "sBunsMetdDoc(/clsfCd") == "4" 
// Ds_LTIDA00.getCellData(0, "sBunsMetdDoc(/clsfCd") == "2") { 	// 사업방법서분류코드(2:운전자, 4:재물) 이면 
	btn_S tnd Poet.setDisabled(false);  	// 담보계산결과 버튼 활성화 
} else { 
	btn_Stnd Poct.setDisabled(true);  	// 담보계산결과 버튼 비활성화
}  
==============================================================================================================

- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_pln::B051_Pop.xml) ==> 수정 완료 @@@ 
1. 재물간편설계 [/CBSC093M] >보험료 요약(이미지) 팝업 [M20170004713] 
 1) 보험기간이 널 일 때 포커스 처리 ==> Ds_LTIDA00.getCellData(0, "sInsurStrtdate") 
edt_sInsurStrtEnddate.setValue(scwin.lfn_SetDateFormat(Ds_LTIDA00.getCellData(0, "sInsurStrtdate"), "- ") 
	+ " ~ " + scwin.lfn_SetDateFormat(Ds_LTIDA00.getCellData(0, "sInsurEndDate"), "-")); 
// 보험기간(보험시작일자, 보험종료일자) 
//---------------------------------------------------------------
// function 명 : Ifn_SetDateFormat 
// 내용 	: 날짜 포뱃 
//---------------------------------------------------------------
scwin.lfn_SetDateFormat = function(str, strType) {  
	// console.log("[/CBSC058P.xml] [lfn_SetDateFormat()] ==> [날짜 포맷] [TEST_01] [str]"+ str +"[strType]"+ strType ); 
	
	var len = str.length;
	
	if (len == 0) { 
		wprom.alert("치환할 8자리 날짜를 입력하세요!"); 	// obj.focus(); 
		util.focus(str); 	// 포커스 설정 
		return false; 
	}
	var strEx = str.substr(0, 4) + strType + str.substr(4, 2) + strType + str.substr(6, 2); 
	
	return strEx;  
}; 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) [M20170004617] ==> 수정 완료 @@@
4.운전자고지사항[B230_Div4_Pop] (/CBSCl69S.xml, ssr_pln::B230_Div4_Pop.xml) [M20170003189, ] 
 1) rad_B0700_1_1_0( 6. 10질병 질의) 라디오 버튼 안 눌러짐 ==> 퍼블 작성 에러(group10 위치 조절 ) 
==> group10 마우스 우 클릭 > 잘라내기 > 뒤에 붙여 넣기 후 위치 조절 
2 ) 단체청약조회 [/CBSC041M] > 5170095(취급자), [M20170004846] 
2. 상해고지사항[B230_Div2_Pop] (/CBSCl67S.xml, ssr_pln::B230_Div2_Pop.xmll) 
 1) 단체 청약조회 [/CBSC041M] > 5170095(쥐 급자), [M20170004617, ] 
 2)  진단심사대상조회 	[/CBSCl06M] 	= > 고지의무(이미지): 팝업 --> [M20170004443, M20170004617(/CBSCl67S)] 
==> Ifn_YearMonthSelect 함수 사용하면 Explorer에서 너무 느림 수정 요망 --> 속도 개선됨(근본적으로 DB에서 데이타 가져와야 함) 
//---------------------------------------------------------------
// function 명 : lfn_YearMonthSelect 
//내용 	:년월세팅 
//---------------------------------------------------------------
scwin.lfn_YearMonthSelect = function() { 
	// console.log("[/CBSCl66S.xml] [lfn_YearMonthSelect()] ==> [년월 세팅] [TEST_01]" ); 
}; 
==============================================================================================================

- 인스웨이브 이승경 연구원에게 문의 
1. 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_sst::B290_Pop.xml) [M20170003122] 
1) 합계 Grid 최상단에 위치 하도록 수정[M20170004617 --> jquery 함수 사용: 

Tap_UdrtkJugm.setSelectedTabIndex(0); 	// 0 번째 Tab 설정 
//$(" .grid Header Ta bleDefau It.g rid Header TableDefau It") 
.after($("#Tap_UdrtkJugm_Tab_step1_grd_List_0_gridFooterTDDefault_tbody")); 		// 01. 사망/후유장해 Tab Grid 합계 죄상단에 배치 
==> .gridHeaderTableDefault는 css id로 잦아가는 방법(TabOI 있으면 중복 에러 남) ==> table id로 찾아야 함 
$ (" #Tap_UdrtkJugm_Tab_stepl_grd_List_0_head_tabIe").after( $("#Tap_UdrtkJu9m_Tab_stepl_grd_LisC0_gridFooterTDDefaulubody")); 
// 01. 사망/후유장해 Tab Grid 합계 죄상단에 배치 
// (합계 10 [#Tap_UdrtkJugm_Tab_step1_grd_List_O_gridFooterTDDefaulUbody]을 테 이블 헤드 10명 [#Tap_UdrtkJugm_
Tab_step1_grd_List_0_head_table]로 옮김) 
$("#Tap_UdrtkJugm_Tab_step1_grd_List_0_data Layer").css("bottom ", "0px");	 // 기존에 bottom 있든 합계 Clear 처리   
==============================================================================================================

- input OnCharChanged 바로 변경됨 ==> Websquare에서는 같은 함수 없음 
1. onviewchange 사용하기로 함: 키보드 조작을 통해 input의 값을 변경한 후, 포커스가 빠져나가자 마자 발생 
==> 장기수납확정조회(/CBSC092M.xml)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.24(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 01행(13시 ~ 18시), 석식(뒷고기, 한미옥 식당: 구부장, 정현수 차장 ==> 구부장이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml) 
1) 단체관리 번호조회(/CBSC037M.xml, ssr_pln::B150.xml)  
==============================================================================================================

- 특약상세입력[B631_Pop] (/CBSC117P.xml, ssr_pln::B631_Pop.xml) ==> 수정 완료 @@@ 
1. load bar에서 var pro = Promise.resolve(); 에러   
==============================================================================================================

- 보험료 요약[B051_Pop] (/CBSC058P.xml, ssr_pln::B051_Pop.xml) [M20170003122] ==> 수정 완료 @@@ 
1. 체크 버튼 변경 ==> 
if (Div1_grd_Prprt.getCellDataID(collindex) == "sel1") --> if (Div1_grd_Prprt.getColumnID(collindex) == "sel1")  
==============================================================================================================

- DB 권한 
Driver - Sybase Adaptive Server cnterprise 
URL - jdbc:sybase:Tds:10.11.1.17:41001< DBNAME> 
비번은 " Pwf사번" 입니다.  
==============================================================================================================

- 이행(운영 로그인) ==> https:llsales.thek-portal.com 
0. 안준영C(2110013, I vkfks.1215, )
1. 9501127(박준용), / 힘 내 라7!, (대리점번호: A000405) 
2. C000S61(김은주), / 힘내라7!, glasofk7!,  
==============================================================================================================

- /resourcesJocal.properties 파일에서 
##### 로컬 환경 서 버 properties ##### 
#기간계 인터페이스 설정값(로컬 서버) 
legacy.interface.url = https://dcommon.thekins.co.kr/ws/Policy
legacy. interface.name =PolicyService
legacy.interface.type = Policy 

#기간계 인터페이스 설정값 - 로컬환경에서 운영 테스트를 할 때 사용 --> 2017.11.24(금): 수정 
legacy.interface.u rl = https://auto.thekins.co.kηws/Policy 
legacy. interface.name =PolicyService
legacy.interface.type = Policy  
==============================================================================================================

- /config.xml 파일에서 
<debug value= "true" remoteconsole= "false" console= "false"/>		 <!-- 전체 로그 안 보이기: console= "false" --> 
==============================================================================================================

- 개인청약사항조회(/CBSC014M.xml, 청약사항조회(ssr_pln::B120.xml)) ==> 수정 완료 @@@ 
1. SOBJ_LOAD 제거 
1) 현상 
if (nfn_checkAuthByID(SOBJ_LOAD, DOBJ_LOAD, Ds_code", gUserID , "21013")) { 	
// 대리점 관리자 MethodObjsetParam("sKeyDoer", gDoer); 
2) 조치  
if (nfn_checkAuthByID("ds_code", gUserID , "21013")) { 
// 대리점 관리자 MethodObj.setPa ram("sKeyDoer“, gDoer);  
==============================================================================================================

- 보험계약정보조회(/CBSC056P.xml, ssr_pln::B250_Pop.xml) ==> 수정 완료 @@@ 
1. sAgreDocuRecpYn: 단체보혐의 단체협약서여부(1:협약서접수, 0:협약서미접수)  
==============================================================================================================

- 보험 계약정보조회(/CBSC056P.xml, ssr_pln::B250_Pop.xml) ==> 수정 완료 @@@ 
if (!util.isNull(inJSON.sAgreDocuRecpYn)) sAgreDocuRecpYn = inJSON.sAgreDocuRecpYn; 	  
// 가입설계 동의 여부 조회: 추가(2017.11.24)  
==============================================================================================================

- 세금우대한도조회(/CBSC068M.xml, pay_ptm::G430.xml) ==> 수정 완료 @@@ 
1. 보험기간 수정   
==============================================================================================================

22 해지환급금 조회 [B201_Pop] (/CBSC132P.xml, ssr_sst::B201_Pop.xml) ==> 수정 완료 @@@ 
*message : pro is not defined  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.25(토) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 비 많이 옴(천둥 번개)
 
- 주말  
09:00 기상
09:20 TV시청
12:00 조식
13:00 집출발(수종, 비 많이 옴)
13:20 대림역 9번 출구 정류장
13:30 영등포 4번 마을버스 탑승
14:20 계피부과 도착(접수) ==> 토요일 16시까지 진료
15:00 2층 3번방(김초록 의사)
      ==> 먹는 약, 바르는 약(피부 괴사 연고, 트라보고트 크림), 얼굴 바르는 약
15:30 종료
15:50 지하철(영등포시장역 -> 대림역) 
16:30 귀가
19:00 석식
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.26(일) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==> 

▦ 초기축구
06:00 기상 
06:10 주민등록 등본 출력(초기축구 운동장 예약용) 
06:30 자전거(문영APT -> 대림운동장)  
07:00 짐 나르기(선이형 늦게옴)
07:20 숏게임
08:00 자체 게임(2쿼터 뜀): 컨디션 안 좋음
10:00 종료
10:30 중식(두루치기: 해오름 식당): 정현이 결혼식 답례(황홍기 형님이 20만원 찬조) 
12:00 종료
12:30 선이형 가게 --> 카드(커피 타주고 만원 얻음, 담배 심부름 5천원 얻음)
		--> 붕어빵(5천원 사옴)
14:00 종료
14:20 귀가
15:00 낮잠
19:00 기상
19:20 석식
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.27(월) 작업 ■■■■■■■■■■■■■■■■
----> 07:00 ~ 21:00  ==>  

- 더케이손해보험 영업지원S 구축 Prj[★] 
- 단체수납확정(/CBSC039M.xml, aeeJoan::7806.xml) 
1) 단체관리 번호조회(/CBSC037M.xml, ssr_pln::B150.xml)  
==============================================================================================================

- 수납확정 저장 에러
1. 현상 
[/CBSC040MContr이lerjava] [/CBSC040MController_ TEST01 ==> [######################### [단체수납확정조회 처리 TEST Start] 
#########################] 
[/CBSC040MContr01ierjava] [/CBSC040MController_ TESTOJ [INPUT 값(02-1. Map을 XML으로 변환)_Input 값 TEST] 
  
[/CBSC040MContr01ierjava] [/CBSC040MContr01ier _ TESTO] [OUTPUT 	값(02-2. 	WsClicnt에서 	변환한 
값)]<WARNING> 
<msg type='java.lang.String' value=해당 Task (AccountingCoIiTask)를 load하는 도중 ExceptionOI 발 
생하였습니다'/> 
<level type='int' value='l' /> 
<detail type='java.lang.String' value='AccountingcolllTask' /> 
<timestamp type='java.sqI.Timestamp' value='1511739555731' /> </WARNING> 
2017 -11-27 08:39:16, 424 DEBUG [com.thek./CBS.inswave.util.InterfaceUtil] / /* /vector/data/ ACCBA01 
2017-11-27 08:39:16, 433 DEBUG [com.thek./CBS.inswave.util.InterfaceUtil] Y 	[//*/vector/data/ACCBA01, 
//*/vector] 
2017-11-27 08:39:16, 434 DEBUG [com.thek./CBS.inswave.util.InterfaceUtil] //* /vector 
2017 -11-27 08:39:16, 437 DEBUG [com.thek./CBS.inswave.util.InterfaceUtil] Y 	[/ /* /vector /data/ ACCBA01, 
//*/vector] 
2.	원인: MethodObj.setHashTable(); 를 사용해서 나는 현상 
3.	조치: / /MethodObj.setHash Table(); 	// 전문의 앞이 hashtable로 보낼 때 ==> 주석 처리  
==============================================================================================================

- 보험계약정보조회(/CBSC056P.xml, ssr_pln::B250_Pop.xml) ==> 수정 완료 @@@ 
1. 단체청약설계[/CBSC042M]에서 사전조회(이미지): 팝업하면 에러 발생  
scwin.init = function() ( 
	if (wconv.length(sPlanNo) < 1) ( 	// 청약번호 누락여부 체크 
		wprom.alert("청약번호가 누락되었습니다. 확인하세요"); 
		return; 
	}
}; 
==============================================================================================================

- 피보험자 누적[B290_Pop] (/CBSC128P.xml, ssr_pln::B290_Pop.xml) ==> 수정 완료 @@@ 
1. 단체청약설계[/CBSC042M] 화면 팝업에서 피보험자코드, 피보험자명 안 보임  
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) [M2017000495) 
4. 운전자고지사항[B230_Div4_Pop] (/CBSC169S.xml, ssr_pln::B230_Div4_Pop.xml) [M2017000495, ] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.28(화) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_sst::B230_Pop.xml) ==>수정 완료 @@@ 
4. 운전자고지사항[B230_Div4_Pop] (/CBSC169S.xml, ssr_pln::B230_Div4_Pop.xml) [M20170004951, ) 
1) 통합계약조회 [/CBSC115M): 계약번호: L-250000003569(01경) > 계약사항상세내역[/CBSC028M] 
==> 피보험자 Grid에서 '선택' 칼럼 체크 > 질의서(이미지): 팝업 
==============================================================================================================

- 병력 리스트 B0704 
1, 고혈압: 병원치료, 대림성모병원 
2. 당뇨병 통근치료, 강남삼성병원
3. 폐암: 개인치료, 서울대병원 
==============================================================================================================

- edt_B0704_2_2_2_02: 치료기간(Input) ==> 운전자고지사항[B230_Div4_Pop] (/CBSC169S.xml)에 만 존재 
==> cal_B0704_2_2_2_07, caLB0704_2_2_2_08, --> 치료기간(inputCalendar) 
==> Component 담기 처리에서 Component가 너무 많으면 안 보임 ==> eclipse에서 사용하는 Component들 
을 앞으로 배치 시킬 것(static은 뒤로 배치할 것) 
---------------------------------------------------------------------------------------------
 
7 질병2(가족사랑)[B230_Div7_Pop] (/CBSC172S.xml, ssr_sst::B230_Div7_Pop.xml) [M20170003393, ] 
1) 고지사항 등록 화면에서 남자의 경우 10번 질문(임신관련) 항목 비활성화 되야합 
if(sDrveType == "_A" && scwin.lfn_getSex(sInrpsCdPop) == "1") { 	//건강보험이고 남자일경우 항목 11, 12번 비활성화 
	if(sNotcGdFlagPop != "05") {	// 05 경우가 아닌 경무만 
		div1.getWindow(. rad_A1100_1_1_0.setDisabled(true);	// 10 여성임신 질의 radio 비활성화 
		div1.getWindow().edt_A1101_2_3_0.setDisabled(true);	// 10 여성임신 임신주 input box 비활성화 
	}
}
==============================================================================================================

- 개인청약사항조회 [/CBSC014M] ==> 수정 완료 @@@ 
1. 엑셀 다운로드 에러 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.29(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 주간보고, 11월 야근 식대 정리(117,000원, 유대리 편으로 지아이데이타 경리에게 우편으로 보냄)
				, 석식(메이차이나 정식, 메이차이나: 이부장 --> 구부장이 쏨) 

- 더케이손해보험 영업지원S 구축 Prj[★]
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml) 
1. 단체관리 번호조회(/CBSC037M.xml, ssr_pln::B1S0.xml) 
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) ==> 수정 완료 @@@ 
6. 질병2(하얀미소) 고지사항[B230_Div6_Pop] (/CBSC171S.xml, ssr_pln::B230_Div6_Pop.xml) [M20170004737] 
1) 현상: 치료기간(inputCalendar)은 비활성화 처리(Disabled) 처리가 안됨 
2) 원인: cal_B0704_2_2_2_07, cal_B0704_2_2_2_08 --> 치료기간(inputCalendar)은 setReadOnly 처리를 해야 Disable 처리가 정확히 됨 
3) 조치: 
caLB0704_2_2_2_07.setDisabled(true); 		// 비활성화 처리(Disabled)  
cal_B0704_2_2_2_ 07 .setReadOnly(true);	// 비활성화 처리(ReadOnly) ==> 최신(inputCalendar에 필수로 사용할 것) 
==============================================================================================================

- 영업지원 주요일정 
일정 		내용 							대상  
12/01 	오 픈」 						후선 28명 
12/08 	2차물량 반영 완료 	
			[사용대상 확대] 	
12/18 	전속 대리점 				190명 	
											전주, 광주지점: 32명 
12/20 	부산/대구지점 			18명 	
12/21 	대전/천안지점 			17명 	
12/22 	서울/원주지점 			14명 	
			[GA 전체오픈] 	
12/28 	상품개정 반영 		
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.11.30(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 21:00  ==> 월간보고회, 중식(메이차이나 정식, 메이차이나: 구부장이 쏨), 유승규씨 철수(14시)
				, 더케이손해보험 창립 기념일(12.01) ==> 피자 파티(16시, 얻어 먹음)

- 더케이손해보험 영업지원S 구축 Prj[★]
- 단체수납확정(/CBSC039M.xml, acc_loan::7806.xml) 
1) 단체관리 번호조회(/CBSC037M.xml, ssr_pln::B1S0.xml)  
==============================================================================================================

- 장기수납확정(/CBSC090M.xml, acc_loan::7802.xml) ==> 수정 완료 @@@
1. 초기화 안됨(취급자, 날짜 자동 셋팅) 
==============================================================================================================

- 해지환급금 조회[B201_Pop] (/CBSC132P.xml, ssr_pln::B201_Pop.xml) [M201700193607, ] ==> 수정 완료 @@@ 
1 switch_div sw_div0 보0171[해지환급금 Grid1 표준이율*1.2][8열] ==> 수정: 2017.11.05, by 진태만 
2 switch_div sw_div1 보이기[해지환급금 Grid2: 적용이율][6열] ==> 수정: 2017.11.10, by 진태만 
3 switch_div sw_Div2 보이기[해지환급금 Grid2: 평균공시이율][8열] ==> 수정 2017.11.11, by 진태만 
[M20170004340]
==============================================================================================================

- 피보험자고지사항[B230_Pop] (/CBSC129P.xml, ssr_pln::B230_Pop.xml) ==> 수정 완료 @@@ 
7. 질병 2(가족사랑)[B230_Div7_Pop] (/CBSC172Sxml, ssr_pln::B230_Div7_Pop.xml) ==> 완료 
if (Ds_LTIDA07.getCellData(i, "sRqstCd") == "A1S01" || Ds_LTIDA07.getCellData(i, "sRqstCd") == "A1S02" ) { 
	//3 위험지역출국(rad_A1S00_1_1_0) 기 간 1, 2 이면  
	if (Ds_LTIDA07.getCellData(i, "nRepINumValue") ! = "0") ( 	// 13.위험지역 출국(rad_AI500_1_1_0) radio 기간 1, 2가  0이 아니면 
		obj.Obj.setValue(DεLTIDA07.getCellData(i, "nRepINumValue"));	 // obj에 Ds 칼럼 담기(nReplNumValue: 답변숫자값) 
	} else ( 
		obj.Obj.setValue(Ds_LTIDA07.getCellData(i, "nRepINumValue")); 	// obj에 Ds 칼럼 담기(nReplNumValue: 답변숫자값) 
	}
}
==============================================================================================================

- 특정부위질병 부담보[B210_Pop] (/CBSC126P.xml, ssr_pln::B210_Pop.xml) [L24010001232] ==> 수정 완료 @@@ 
1. 계약사항상세내역 [/CBSC028M] > 특정부위(숫자) : 클릭Grid에서 특정부위(1 .숫자) 팝업 
1) Ds_LTIDA09(담보 정보 Ds) ==> 데이타 안 가지고 옴(전립선 칼럼 체크 안 되어 있고 전기간으로 안되어 있음)
 
- 조회 값 @@@ 
"sPlanNo"(설계 번호): "M20170127304" 
"sCrNo"(계약변호): "'L24010001232" 
"nlnrpsSeqno"(계약일 련 번호): "1" 
var MethodObj = new caIiService("com.inswave.longterm.ssr.ssttask.DBB210Task", "getSpclPartSbcvrList"); 
// 특정부위 부담보 조회 Obj
 
- 결과값 @@@ 
//저장된 부담보가 있을시 체크박스에 세팅한다 
if (Ds_LTIDA09.getRowCount() > 0) { // 부담보 정보 Ds 
	for (var i = 0; i < Ds_SbcvrCvrgePartCdl.getRowCount(); i++) { 	// 상품속성 정보 Ds 
		for (var j = 0; j < Ds_LTIDA09.getRowCount(); j++) { 
			if(Ds_LTIDA09.getCellData(j, "sSbcvrCvrgePartCd") == Ds_SbcvrCvrgePartCdl.getCellData(i, "sCd")) (  	// 부담보코드가 같은 row에 체크박스체크 
				Ds_SbcvrCvrgePartCdL.setCeIiData(i, "fFlag", "1"); 
				Ds_SbcvrCvrgePartCdL.setCell Data(i, "sSu bCvrgeTermCd", Ds_L TIDA09.getCell Data(j, "sSubC vrge TermCd ")); 	// 부담보기간 
			}
		}
	}
	
	for (var i = 0; i < Ds_SbcvrCvrgePartCdRgetRowCount(); i++) { 	// 심사 정보 Ds 
		for (var j = 0; j < Ds_LTIDA09.getRowCount(); j++) { 
			if(Ds_LTIDA09.getCellData(j, "sSbcvrCvrgePartCd") == Ds_SbcvrCvrgePartCdR.getCellData(i, "sCd")) { 		// 부담보코드가 같은 row에 체크박스체크  
				Ds_SbcvrC vrgePartCd R.setCell Data(i, "sSubC vrge TermCd",  Ds_LTIDA09.getCell Data(j, "sSubC vrge TermCd")); 	// 부담보기간 
			}
		}
	}
}	
==============================================================================================================

- 서버 URL 변경(Miplatform에서) [개발계 ==> 검증계] 
1. Miplatform에서 > Global > Variables에서 
ID ==> gWsdlAccounting 
Value ==> https://dcommon.thekins.co.kr ==> https://mcommon.thekins.co.kr 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
