    

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.06) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.06.01(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:20  ==> 중식(칼국수, 파전: 유영선 이사(정팀장), 오상민 수석): 유 이사가 쏨, 주간보고(14시)

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리   
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
  ==> B/L 분할(TI::TI10302_PopupSplt.xfdl) ==> 1차 테스트: 완료 @@@
  ==> 통관요청(TI::TI10302.xfdl) ==>  1차 테스트: 완료 @@@
==============================================================================================================

1. 수입통관현황조회
 1) 잠정통관 현황 조회(TI::TI10405.xfdl)
 2) 확정통관 현황 조회(TI::TI10406.xfdl)
==============================================================================================================

- B/L 분할 1차 테스트 에러 @@@
1. 에러 내용: B/L수량이 품목수량을 초과합니다.
2. 원인: SAP ERP B/L수량이 실제 1개이 아니라 0.8개 이여서 나는 에러
-----------------------------------------------------------------

- B/L 등록 TEST 데이타 @@@ ===>    
1. BLNO: 100000315,  --> 총 B/L수량: 3
2. 품명: LIGHT GASOIL PA/CRUDE EXC(B10-1345/95
3. B/L번호: 00-17681
 1) 수정 B/L번호: 00-17681_01 --> 1
 2) 수정 B/L번호: 00-17681_02 --> 2 
==============================================================================================================

- B/L 등록 에러
1. 에러 내용: 1 번째 품목에 4700001655을(를) 입력하지 않았습니다.
2. 해당 구매문서번호(4700001655을)에 대해서는 등록되지 않음.
==> 최초 B/L 등록(iinsert)는 구매문서번호에 따라서 등록되지 않는 경우가 많음
-----------------------------------------------------------------------------------

- 구매문서번 업체명(B/L 등록 테스트)
4700006500 SINOPEC (HONG KONG) FUEL OIL COMPAN --> Y 
4700005405,      Saudi Aramco  --> NO
4700005744,      CHEVRON U.S.A. INC -> Y 
4700006259, SINOPEC (HONG KONG) FUEL OIL COMPAN  ==>
4700007329 Saudi Aramco --> NO
4700006279, Saudi Aramco
4700005248 QATAR PETROLEUM
4700005334 Saudi Aramco
4700005233  MACQUARIE BANK LIMI
==============================================================================================================

1. 수입 B/L 관리   
 1) B/L B/L등록(팝업)(TI::TI10301_Popup.xfdl)
  ==> 파일 업로드 ==>  com::commUploadExt.xfdl
==============================================================================================================

- 메시지리스트 정리
1. 메시지리스트.xlsx
2. this.gfn_showMsgBox("0008", "", "");  // alert msg ==> 0008: 등록일은 하나만 입력할 수 없습니다.  
this.gfn_showMsgBox("0013", "", "");  // alert msg ==> 0013: 총 B/L수량이 Grid에서 B/L수량 합 보다 적을 수 없습니다.
 1) alert("총 B/L수량이 Grid에서 B/L수량 합 보다 적을 수 없습니다.");   // gfn_showMsgBox로 변경할 것 @@@ ===>  
3. 파일 위치: \\172.18.61.60\수출입통관시스템구축\Portal(WEB)\50.구축\메시지리스트.xlsx
==============================================================================================================

- 로그 보기 @@@@ 
trace("[/TI10302.xfdl] [btn_sel_OnClick()] ==> [TEST]" ); 
trace("[/TI10302.xfdl] [btn_sel_OnClick()] ==> [url]"+ url +"[url_02]"+ url ); 
trace("[/TI10302.xfdl] [btnSave_onclick()] ==> [dsCS_ZTITBLK_조회수]"+ this.dsCS_ZTITBLK.getRowCount() +"[dsCS_ZTITBLK.saveXML()] \n"+
this.dsCS_ZTITBLK.saveXML() );  

1. 조회  ### 
trace("[/TI10302.xfdl] [btnSave_onclick()] ==> [INPUT_조회수]"+ this.dsIT_LIST.getRowCount() +"[dsIT_LIST.saveXML()] \n"+ this.dsIT_LIST.saveXML() ); 
trace("[/TI10302.xfdl] [btnSave_onclick()] ==> [strSvcUrl]"+ strSvcUrl +"[inData]"+ inData +"[strArg]"+ strArg );  // gfn_transaction 처리 

2. 콜백 ###
trace("[/TI10302.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]"+ sTrId +"[nErrorCode]"+ nErrorCode +"[sErrorMsg]"+ sErrorMsg );
trace("[/TI10302.xfdl] [fn_callback()] ==> [조회_리턴값 수]"+ this.dsEXT_ZTITBLP.getRowCount() +"[dsEXT_ZTITBLP.saveXML()] \n"+
this.dsEXT_ZTITBLP.saveXML() ); 
trace("[/TI10302.xfdl] [fn_callback()] ==> [저장_리턴값] dsET_RETURN.saveXML()] \n"+ this.dsET_RETURN.saveXML() );   

3. 자바 ###
System.out.println("[/ti10300Controller.java] [selectTiBlSave()] ==> [TEST]" ); 
System.out.println("[/ti10300Controller.java] [selectTiBlStatusList()] ==> [jCoFunction]"+ jCoFunction ); 
==============================================================================================================

- 크롬 브라우저 캐시삭제 방법
1. 크롬을 실행시킨 후 ctrl+alt+del 을 동시에 눌러주세요!  ==> 00. 크롬 설정(캐시): chrome://settings
2, 그다음 다음 이미지와 같이 설정한 다음에 '인터넷정보 삭제' 하시면 언라이트가 정상적으로 접속 되실거에요.
-----------------------------------------------------------------------------------------------------

- 자바스크립트 크롬 브라우저로 디버깅 하는 방법
http://mainia.tistory.com/2801 
==============================================================================================================

- MSI 서비스 센타
1. supportkr@msi.com
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.02(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:20  ==> 중식(부대찌개, 제육, 8천원, 삼길포항 식당)

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입통관현황조회
 1) 잠정통관 현황 조회(TI::TI10405.xfdl)
 2) 확정통관 현황 조회(TI::TI10406.xfdl)
==============================================================================================================

1. 수입통관현황조회
 1) 수출 B/L 등록대상조회(TE::TE20102.xfdl)
==> Z_TE_BL_STATUS_RFC_LIST(수출 B/L 현황 리스트)
==============================================================================================================

- 서울행
17:30 퇴근(현대오일뱅크 수출입 통관 개발 Prj(대산 공장) :오수석 차)
17:40 출발
18:20 행담 휴게소(오수석 차 가스 충전)
18:25 다시 출발(차 많이 막힘)
19:30 범계역(4호선) 도착
19:40 범계역 -> 대림역
20:21 대림역 도착
20:40 귀가
22:00 석식
22:30 월 결산(05월)
01:00 공인인증서 갱신
02:00 trim 문자 소스 분석
03:30 종료
03:50 취침(큰 방): 루옌
==============================================================================================================

- 삼성 Smart Switch PC
1. Galaxy Note5 연결 ==> 에러가 남
==============================================================================================================

- 월 결산(05월)
1. 자산 검증(2017.05) ==> 급여 정리
2. 파견 경비 결산 
==============================================================================================================

- 공인인증서 갱신
1. 완료 => 2018.06.01로 재발급 받을 것
==============================================================================================================

- trim 문자
1. 문자열 양 끝의 공백문자 또는 지정된 문자를 제거하는 메소드입니다.
var strRtn = inDadsEX_LEST +" "+ inDadsEX_LEST2 +" "+ inDadsEX_LEST3;
trace("[/NOTI_POINT.xfdl] [fn_onload()] ==> [TEST_51] [strRtn]"+ strRtn );

var strRtn2 = strRtn.trim();
-----------------------------------------------------------------------------------
var str = "  abcd  ";
var strTrim = nexacro.trim(str);             // strTrim = abcd
var strTrim = nexacro.trim(str, "a");             // strTrim =  bcd
==============================================================================================================

- Nexacro 환경 설정
1. titletext명 표시
 1) UXSTUDIO의 Tools메뉴 > Options: 클릭 > Environment > Project Explorer 항목: 선택  
FDL Parsing(project open) : All 선택
Show Title : at Project Explorer 선택 
-----------------------------------------------------------------------------------------------

- Script 폰트 변경
1. Tools > Options > Environment > Font and COlor > Script: 글자 크기 변경
 1) 화면 글자 줌 인, 줌 아웃: Ctrl + 마우스 휠
-----------------------------------------------------------------------------------------------

- Script 소스 수정시 선택한 블럭을 일괄적으로 주석 처리 방법
1. 주석 처리: 블럭 지정 후 / 처리
2. 주석 해제: 블럭 선택 후 Alt + / 처리
-----------------------------------------------------------------------------------------------

- 소스에 점선 추가
1. Tools > Options > Environment > Font and COlor > Source(클릭): 
View Indentation Guide(체크), Auto Indent(체크) ==> OK(확인) --> Message, Script, CSS에 모두 체크 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.03(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
09:00 기상 
10:00 조식(떡)
12:00 중식
12:30 집출발
12:40 대림역(6511번 버스) 승차
13:20 서울대학교 도착 
13:50 관악문화도서관(1층: 어린이도서관): 수종에게 책 읽어 줌
14:50 관악문화도서관(3층) 도서 대여 --> 징기스칸 : 하늘의 명을 받고 태어난 "푸른이리-테무진",  칭기즈칸. 1
15:00 종료
15:10 서울대학교 승차
15:50 대림역 도착 
16:00 귀가
19:30 석식(닭도리탕)
22:00 취침
==============================================================================================================

- 명언
모든 일은 가능하다고 생각하는 사람만이 해낼 수 있다. 아산 장주영 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.05(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:25 대림운동장 
07:10 숏게임
08:00 게임 ==> 3게임함
10:30 종료 
10:50 중식(삼겹살: 서울식당): 개인당 5천원 냄(창호 꺼 대신 내줌 ==> 총 만원 냄) 
12:30 종료
13:00 낙지집(연포탕) ==> 정지경 형이 쏨 
14:30 종료
14:40 귀가 ==> 루옌 같이 공장에서 일하는 언니들(6명) 방문
15:10 창호, 경훈이 방문 ==> 창호가 결혼 안한 아가씨 2명이 마음에 안 들어 함
16:30 루옌 베트남 언니들 돌아감 
18:00 창호, 경훈이 돌아감 
20:10 집출발
20:20 대림역
21:40 구성역
21:50 구성역 3번 출구 ==> 오상민 수석 차에 승차(대산행)
23:40 숙소(코지 하우스, 대산고 근처) 도착
00:00 취침 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.06.05(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:30  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)  --> 완료(오상민 수석) @@@
 ==> B/L 등록(TI::TI10301_Popup.xfdl)
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)    --> 수정 중  @@@
 ==> B/L 수정(TI::TI10302_Popup.xfdl)
 ==> 수정에러 --> [/TE20102_Popup.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]TE20102_PopupRfcSave
  [nErrorCode]-99[sErrorMsg]Did not define type of process. [ T-Code : ZTERI02 ]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.06(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:50 ~ 20:00  ==> 현충일(근무), 오후에 비

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)  --> 완료(오상민 수석) @@@
 ==> B/L 등록(TI::TI10301_Popup.xfdl)
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)    --> 완료  @@@
 ==> B/L 수정(TI::TI10302_Popup.xfdl)
 ==> B/L 삭제(TI::TI10302_Popup.xfdl)
==============================================================================================================

 - B/L 수정(TI::TI10302_Popup.xfdl) 저장 시 에러
1. 현상: [/TE20102_Popup.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]TE20102_PopupRfcSave[nErrorCode]-99[sErrorMsg]D
id not define type of process. [ T-Code : ZTERI02 ]
2. 원인: dsI_USERINFO가 없어서 나는 에러
3. 조치: inData에 dsI_USERINFO 추가
/****************************************************************************************
 * Components : Button 
 * Description :  버튼 클릭 이벤트(B/L 저장)
 ****************************************************************************************/    
this.btnSave_onclick = function(obj:Button,  e:nexacro.ClickEventInfo)
{   
	 trace("[/TE20102_Popup.xfdl] [btnSave_onclick()] ==> [TEST]" );
	  
	 var strSvcId = "TE20102_PopupRfcSave";
	 var strSvcUrl = "/TE/regBLSave.do";   // strSvcUrl: Z_TE_BL_SAVE_DOCUMENT(수출 B/L등록목록 저장) 
	 var inData = "dsCS_ZTETBLK=dsEX_ZTETBLK dsIE_ZTETBLP=dsET_ZTETBLP dsI_USERINFO=application.GDS_USER_INFO";   // inData  
	 var outData = "dsET_RETURN=dsET_RETURN"; // outData:
	 var strArg = "I_EDIT_MODE=M";      // IP_MODE(저장: 'C', 변경: 'M', 삭제: 'D')
	 var callBackFnc = "fn_callback";
	 var svcType = "S";
	 var isAsync = true;
	 var bWait = true;

	 this.gfn_transaction(strSvcId, strSvcUrl, inData, outData, strArg, callBackFnc, svcType, isAsync, bWait);
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.07(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:30  ==> 석식(안 먹음): 저녁에 집에서 가져온 닭도리탕 숙소에서 먹으려고 했는데 오수석이 반대해서 못 먹음

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입통관현황조회
 1) 잠정통관 현황 조회(TI::TI10405.xfdl)   --> 완료  @@@
 ==> 03-3 Mapping spec_수입통관현황조회 IF.xls  --> Z_TI_CR_STATUS_RFC_LIST([수입] 수입통관현황조회)  
 2) 확정통관 현황 조회(TI::TI10406.xfdl)   --> 완료  @@@
  ==> 03-3 Mapping spec_확정통관현황조회 IF.xls --> Z_TI_CC_STATUS_RFC_LIST([수입] 확정통관현황조회)
==============================================================================================================

- 파일첨부 목록 조회
1. Z_TS_DMS_RFC_LIST(파일첨부 목록 조회)
2. /commDownloadExt.xfdl(파일 다운로드)
==============================================================================================================

- 2개의 상하 Grid 겹치는 문제
1. Grid2(하위 Grid)에서 마우스 우 클릭하여 Positionb Editor에서 ㄱ자 모양의 직선을 체크 해제
==============================================================================================================

- [Java] 자바 디버깅 방법, 이클립스를 이용해서 자바 디버깅 하기
http://mainia.tistory.com/2259
0. 왼손을 키보드의 단축키 위에 올리기 약 손가락(F6키) + 집게 손가락(F8키)에 놓고 디버깅할 것
1) Skip All Breakpoints : 모든 브레이크 포인트 건너뜀
2) Resume(F8키) : 다음 브레이크포인트까지 진행함
3) Suspend : 쓰레드를 일시 정지하며 현재 수행문에 지정한 것과 같음
4) Terminate : 쓰레드 종료
6) Step Into(F5키) : 한단계 진행하는데 다음 라인이 함수 안이면 함수 안으로 들어감.
7) Step Over(F6키) : 함수 호출을 지나치고 현재 위치에서 한 단계 진행
8) Step Return(F7키) : 현재 함수 끝까지 바로 가서 리턴한 후 함수 호출부로 되돌아 감
9) Drop to Frame : 선택한 스택 프레임의 첫 행으로 이동. 처음부터 다시 하고자 할 때
10) Use Step Filters(Shift+F5) : 스텝 필터링 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.06.08(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00  ==> 회식(19시: 소고기, 우루루, 6명): 오수석이 쏨, 맥주(22시): (주)에이에스이지 윤부장이 쏨

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
 ==> B/L 삭제(TI::TI10302_Popup.xfdl) --> 완료  @@@ 
==============================================================================================================

- XPlatformMapDTO 분석
1. XPlatformMapDTO.java
==============================================================================================================

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수출통관관리  
 2) 수출통관대기목록(TE:TE20201.xfdl): 수출신고필증등록화면  --> 개발 중  @@@ 
 ==> Z_TE_CC_RFC_DUE_LIST_BY_CR(수출신고필증 등록 대상 조회)
 ==> 수출신고필증 등록(TE::TE20201_Popup.xfdl)
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.06.09(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:40 ~ 22:00  ==> 성질나서 오수석에게 짜증냄

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수출통관관리
 2) 수출통관대기목록(TE:TE20201.xfdl): 수출신고필증등록화면 --> 완료  @@@
 ==> Z_TE_CC_RFC_DUE_LIST_BY_CR(수출신고필증 등록 대상 조회)
1. 에러: 조회 시 I_SDTXT(품명) 조회시 전체 조회가 됨 @@@@ ==> @@@@@@@
2. 에러:조회 결과 DS(dsET_HEADER)에서 등록일(CDAT),생성자(CNAM)가  없음  @@@@ ==> @@@@@@@
 1) 등록일(CDAT) Display 안됨, 조회 조건으로 생성자(CNAM) 조회가 안됨
 ==> 수출신고필증 등록(TE::TE20201_Popup.xfdl)
==============================================================================================================

- 수출신고필증 등록(TE::TE20201_Popup.xfdl) 
01. Z_TE_CC_RFC_CREATE(수출신고필증 조회)  
IMT_ZTES_PKEY
EXS_ZTETCCK  --> CCINO
EXS_ZTETCPK  --> CCHCG, CRQDT
EXT_ZTETCCP
수출신고필증(CCINO)  ==> ExpoRprtCrtf
수출신고수리일(CRQDT) ==> ExpoRprtReprDt
관세사수수료(CCHCG) ==> CsagSrcg 
----------------------------------------------------------------------------------------------

02. Z_TE_CC_SAVE_DOCUMEN(수출신고필증 저장)
I_EDIT_MODE=P ==> I_EDIT_MODE('C', 변경: 'U', 삭제: 'D')
CS_ZTETCPK_4G
CS_ZTETCCK --> CCINO, CRQDT
CS_ZTETCPK --> CCHCG
==============================================================================================================

-  상세화면 조회/TI10301_Popup.xfdl): 목록 조회 에러
1. 현상: [/TI10301_Popup.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]TI10301_PopupRfc[nErrorCode]-99[sErrorMsg]조회 실패했습니다.
2. 원인: Jco 에러(/XPlatformMapDTO.java 파일에서  jCoParameterList이 null이면 에러 발생)
public void setRFCImportParameter(JCoFunction jCoFunction) { 
	 System.out.println("[/XPlatformMapDTO.java] [setRFCImportParameter()] ==> [01-1. import param] [jCoFunction]"+ jCoFunction ); 
		 
	 JCoParameterList jCoParameterList = jCoFunction.getImportParameterList();    
		
	 if(jCoParameterList == null) return;  // jCoParameterList이 null이면 종료 처리 @@@ ====>
}
==============================================================================================================

- 2017년 여름 청평 워크샵 안내[(주)지아이데이타]
1. 일시: 2017년 6월 16일 금요일 오후 ~ 17일 토요일 (1박 2일)
2. 장소: 청평 켄싱턴 리조트(경기도 가평군 상면 청군로 430)
 1) 청평 켄싱턴 리조트 ==> http://www.kensingtonresort.co.kr/resort/room_cheongpyeong.asp 
==============================================================================================================

- SAP Jco Connector를 이용한 Java 에서 SAP 함수 호출하기 
1. http://iheedol.tistory.com/entry/SAP-Jco-Connector%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%9C-Java
-%EC%97%90%EC%84%9C-SAP-%ED%95%A8%EC%88%98-%ED%98%B8%EC%B6%9C%ED%95%98%EA%B8%B0
2. sapjco3.dll 파일을 System32 폴더에 저장 ==> /sapjco3.dll
==============================================================================================================

- 서울행
17:30 석식(지하 식당)
17:40 수출 B/L 등록 수정 ==> RFC 문제(SAP에 문의할 것)
22:00 출발
22:40 행담 휴게소(오수석 차 가스 충전
22:50 다시 출발
23:24 상현역(신분당선) 도착
23:27 상현역 -> 대림역
00:31 대림역 도착
00:40 귀가
01:00 취침
==============================================================================================================

- 삼성 SSD 구입
1. (FINE) 삼성 SSD PM851 mSATA 시리즈 256G 벌크, 가격: 129,770원
http://item.gmarket.co.kr/detailview/item.asp?goodscode=668984630
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.10(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
10:00 기상 
11:00 중식
11:30 집출발
11:40 구로리 공원(수종)
13:00 수종 물놀이 하다가 옷이 젖어서 일찍 귀가
13:10 귀가
14:00 낮잠
17:00 귀가
17:00 MSI GE60_2OE  노트북 작업
 1. 삼성 SSD PM851 mSATA 시리즈 128G(2개) 제거(중고로 판매할 예정)
 2. 삼성 SSD PM871 mSATA 시리즈 256G 1개를 C 드라이브에 설치 ==> 실수로 D 드라이브 데이타 삭제)
 ==> OS 재설치(MSI GE60_2OE 랜 드라이버 못 구해서 SW 설치 못함)
19:30 석식
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.11(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(최선형과 티볼리에 짐 옮겨다 실음) 
06:50 대림운동장
07:10 대림운동장 츨발
07:30 영신초교 도착 
08:00 게임(신길1동 조기회) ==> 4게임함 
12:00 종료
12:20 중식(두루치기: 횡성 생고기[옛: 화통삼]): 회에서 쏨
13:30 종료
13:40 최선형 사무실 ==> MSI GE60_2OE 랜 드라이버 인터넷에서 찾아서 USB 3.0에 복사)
15:00 종료
15:30 귀가
15:50 MSI GE60_2OE  노트북 작업
 1. MSI GE60_2OE 랜 드라이버 설치, SW 설치 ==> 외장하드, USB 숙소에서 가져올 것
18:00 루옌 귀가
19:00 석식 
20:10 집출발
20:20 대림역
21:40 구성역
21:50 구성역 3번 출구 ==> 오상민 수석 차에 승차(대산행)
23:40 숙소(코지 하우스, 대산고 근처) 도착
00:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.12(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 22:20  ==>

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리   
 1) B/L 등록(팝업)(TI::TI10301_Popup.xfdl) 수정 --> 완료 @@@ 
 ==> dsE_RETURN DS에서 에러(E) 받음
 가. 현상: <Col id="TYPE">E</Col> <Col id="MESSAGE">서비스 업체 을(를) 입력하십시오</Col>
 나. 조치: 로그인 정보 변경(22223333, 12345678)
 2) B/L 상세화면(팝업)(TI::TI10302_Popup.xfdl) 수정 --> 완료  @@@ 
  ==> 1. 현상:   [/TE20102_Popup.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]TE20102_PopupRfcSave[nErrorCode]-99
   [sErrorMsg]저장 실패했습니다.
       2. 원인: 서버에서의 DS명이 안 맞아서 나는 에러
       3. 조치: dsET_RETURN --> dsE_RETURN 으로 변경 
==============================================================================================================

1. 수출통관관리  
 2) 수출통관대기목록(TE:TE20201.xfdl): 수출신고필증등록화면 
 가. 수출신고필증 등록(TE::TE20201_Popup.xfdl)  --> 완료  @@@ 
 ==> 1. 현상:  dsE_RETURN DS에서 에러(E) 받음 ==> Customs doc. No [-00] is not exist.</Col>
       2. 원인: var strArg = "I_EDIT_MODE=P";   // strArg: I_EDIT_MODE(C: 생성, D:삭제, P:변경)  
       3. 조치: var strArg = "I_EDIT_MODE=C";

this.fn_callback = function(sTrId, nErrorCode, sErrorMsg)
{  
	 trace("[/TE20201_Popup.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]"+ sTrId +"[nErrorCode]"+ nErrorCode +"[sErrorMsg]"+ sErrorMsg );

	 if ( nErrorCode < 0 ) return;

	 switch(sTrId)
	 { 
		  case "TE20201_PopupRfcSave": 
		   trace("[/TE20201_Popup.xfdl] [fn_callback()] ==> [저장_리턴값] [dsE_RETURN.saveXML()] \n"+ this.dsE_RETURN.saveXML() );  
		   trace("[/TE20201_Popup.xfdl] [fn_callback()] ==> [E_CURNO]"+ application.E_CURNO +"[E_ICCSQ]"+ application.E_ICCSQ );  ]
		   // 생성, 변경 및 삭제한 문서 번호, 변경 차수를 Return

		   if(this.dsE_RETURN.getRowCount() > 0)
		   {   
			for (var i=0; i < this.dsE_RETURN.getRowCount(); i++) 
			{
				 if(this.dsE_RETURN.getColumn(i, "TYPE") == "E")   // 저장 실패 이면 ==> 메시지 유형: S 성공, E 오류, W 경고, I 정보, A 중단  
				 {   
					  var strMessage = this.dsE_RETURN.getColumn(i, "MESSAGE");   // 메시지
					  this.alert(strMessage); 
					  return;
				 } 
			}
	   }
	   
	   //첨부파일
	   if(!this.gfn_isNull(application.E_CURNO))  // SAP에서 Return한 값(E_CURNO)이 존재하면
	   {  
			// 파일 업로드 변수 셋팅
			this.divAttFile.I_BUKRS = application.gv_BUKRS;  // 회사코드
			this.divAttFile.I_DOCTY = "CC";     // 문서종류(BL: 선하증권, CR: 수입신고의뢰, CC: 수입필증(수출통관의뢰)) 
			this.divAttFile.I_REFNO = application.E_CURNO;  // 참조문서번호(생성, 변경 및 삭제한 문서 번호)
			this.divAttFile.I_IMEXI = "E";      // Import/Export classification(E: 수출, I:수입)
			this.divAttFile.I_ROWTYPE = "C";     // 첨부서류 종류(1H: 잠정, 2A: 정정, 3C: 확정)

			this.divAttFile.btn_upload_onclick();
	   }
	   application.E_BILNO = "";
	   this.gfn_closePopup(true); 
	   break;
		
	  default:
	   break;
	}
} 
==============================================================================================================

- 저장시 INPUT 값
[/XPlatformMapDTO.java] [setRFCImportParameter()] ==> [01-1. import param] [jCoFunction]Name: Z_TE_CC_RFC_WEBIF_SAVE
Input:
-------------------------------------------------------------------------------------------------------
 PARAMETERS 'INPUT'
-------------------------------------------------------------------------------------------------------
IS_ZTETCCKIS_ZTETCPKIII_OK_CODE                                                             II_USERINFO
-------------------------------------------------------------------------------------------------------
                    0123456789012345678901234567890123456789012345678901234567890123456789012          
-------------------------------------------------------------------------------------------------------
IS_ZTETCCKIS_ZTETCPKX                                                                        I_USERINFO
-------------------------------------------------------------------------------------------------------

Output:
--------------------
 PARAMETERS 'OUTPUT'
--------------------
E_CURNO   E_E_RETURN
--------------------
012345678901        
--------------------
          00E_RETURN
--------------------

Tables:
---------
 PARAMETERS 'TABLES'
---------
IMT_TRDNO
---------
         
---------
IMT_TRDNO
---------
--------------------------------------------------------------------------------------------------------

[/XPlatformMapDTO.java] [setRFCImportParameter()] ==> [01-1. import param] [Structure명]true[Table명]false
[/XPlatformMapDTO.java] [setRFCImportStructure()] ==> [INPUT_파라미터 Structure명]IS_ZTETCCK
[/XPlatformMapDTO.java] [setRFCExportTable()] ==> [ds.getRowCount()번째]1
[/XPlatformMapDTO.java] [setRFCExportTable()] ==> [i_번째] [field.getName()]MANDT
[/XPlatformMapDTO.java] [setRFCExportTable()] ==> [i_번째] [field.getName()]CURNO
==============================================================================================================

- 검색결과 수정(TI::TI10301.xfdl에서)
1. stcSrchRslt  ==> stcSrchRsltTotCnt(검색결과 ?수)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.13(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 21:00  ==> 1차 개발 완료

- 현대오일뱅크 수출입 통관 개발 Prj
1. 통관수수료
 2) 관세사 수수료(TE::TE20302.xfdl) --> 완료 @@@ 
 3) 수수료등록현황리스트(TE::TE20303.xfdl) --> 완료 @@@  
 3) 항만수수료등록현황(TE::TE20304.xfdl) --> 완료 @@@ 
==============================================================================================================

- Gri에서 날짜 처리
1. dsiplaytpe ==> expr:(CDATA =="0000-00-00") ? "none" : "normal"   --> 0000-00-00 이면 널처리 @@@
==============================================================================================================

- GDS_DOCTYPE(문서타입 DS)
IMEXI DOCTY VOCTY
E BL 선하증권 BL 선하증권
E BL 선하증권 CE 검증서
E BL 선하증권 OT 기타
E BL 선하증권 PB 납부고지서
E CC 수입필증 FU 확정단가(통관)
E CC 수입필증 PQ 잠정수량(통관)
E CC 수입필증 PU 잠정단가(통관)
E SD 선적서류 FU 확정단가(통관)
E SD 선적서류 PQ 잠정수량(통관)
E SD 선적서류 PU 잠정단가(통관) 
/****************************************************************************************
 * Description     : 파일 다운로드/업로드 변수 셋팅 
 ****************************************************************************************/ 
this.ufn_getFileList = function()
{   
	 trace("[/TE20302.xfdl] [ufn_getFileList()] ==> [v_Curno]"+ this.v_Curno ); 

	 // 파일 다운로드 변수 셋팅
	 this.divAttFile.I_BUKRS = application.gv_BUKRS;  // 회사코드 
	 this.divAttFile.I_REFNO = this.v_Curno;      // 첨부문서 REFNO(통관관리번호): SAP에서 넘겨준 관리번호 Key값
	 this.divAttFile.I_AMDSQ = "";      // Amend 차수: SAP에서 넘겨준 관리번호 차수 Key값
	 this.divAttFile.I_IMEXI = "E";        // 수입/수출 구분자(E: 수출, I:수입)
	 this.divAttFile.I_DOCTY = "BL";       // 문서종류(BL: 선하증권, CC: 수입필증(수출통관의뢰)), CR: 수입신고의뢰, SD: 선적서류)
	 this.divAttFile.I_VOCTY = "";      // 첨부서류 종류  --> 저장 시 세팅 

	 // 파일 업로드 변수 셋팅
	 this.divAttFile.U_BUKRS = application.gv_BUKRS;  // 회사코드 
	 this.divAttFile.U_REFNO = this.v_Curno;     // 첨부문서 REFNO(통관관리번호): SAP에서 넘겨준 관리번호 Key값
	 this.divAttFile.U_AMDSQ = "";     // Amend 차수: SAP에서 넘겨준 관리번호 차수 Key값
	 this.divAttFile.U_IMEXI = "E";        // 수입/수출 구분자(E: 수출, I:수입)
	 this.divAttFile.U_DOCTY = "BL";       // 문서종류(BL: 선하증권, CC: 수입필증(수출통관의뢰)), CR: 수입신고의뢰, SD: 선적서류)
	 this.divAttFile.U_VOCTY = "";     // 첨부서류 종류  --> 저장 시 세팅 
	  
	 // 첨부파일 리스트 조회
	 this.divAttFile.fn_getFileList(); 
}

/****************************************************************************************
 * Components : Button 
 * Description : 파일 업로드 첨부파일 추가
 ****************************************************************************************/   
this.btn_addFile_onclick = function(obj:Button,  e:nexacro.ClickEventInfo)
{  
	 this.divAttFile.U_BUKRS = application.gv_BUKRS;  // 회사코드 
	 this.divAttFile.U_REFNO = this.v_Curno;     // 첨부문서 REFNO(통관관리번호): SAP에서 넘겨준 관리번호 Key값
	 this.divAttFile.U_AMDSQ = "";     // Amend 차수: SAP에서 넘겨준 관리번호 차수 Key값
	 this.divAttFile.U_IMEXI = "E";        // 수입/수출 구분자(E: 수출, I:수입)
	 this.divAttFile.U_DOCTY = "CC";       // 문서종류(BL: 선하증권, CC: 수입필증(수출통관의뢰)), CR: 수입신고의뢰, SD: 선적서류)
	 this.divAttFile.U_VOCTY = "";     // 첨부서류 종류  --> 저장 시 세팅 
	  
	 this.divAttFile.ufn_callUploadPop(); // 파일 업로드 팝업 실행
}
==============================================================================================================

- 삼성 SSD PM851 mSATA 시리즈 128G 2개 중고 카페에 판매할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.14(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:20  ==>

- 현대오일뱅크 수출입 통관 개발 Prj
1. 수출통관관리
 1) 수출통관대기목록(TE:TE20201.xfdl): 수출신고필증등록화면
 2) 수출통관신청현황조회(TE::TE20202.xfdl)  --> 완료  @@@
 ==> Z_TE_CC_RFC_LIST_BY_CP_LEV(수출통관신청현황) ==> 수출신고필증 등록현황.pptx 
==============================================================================================================

- dsE_RETURN 없는 화면
1. 항만수수료등록(TE::TE20301.xfdl) -->   Z_TE_CS_RFC_BL_CHARGE_LIST(항만수수료)  ==> 수정 확인 @@@
2. 관세사 수수료(TE::TE20302.xfdl) -->   Z_TE_CS_RFC_CC_CHARGE_LIST(관세사 수수료) ==> 수정 확인 @@@

3. 잠정통관 현황 조회(TI::TI10401.xfdl) -->  Z_TI_CR_STATUS_RFC_LIST(수입통관현황조회)     
4. 확정통관 현황 조회(TI::TI10402.xfdl) --> Z_TI_CC_STATUS_RFC_LIST([수입] 확정통관현황조회)
5. 수입 통관수수료처리(TI::TI10501.xfdl) --> Z_TI_CC_EXP_RFC_LIS([수입] 관세사 수수료 등록 대상 목록)
==============================================================================================================

- Grid에서 물량 칼럼별 수량 Mask 처리(Comma 설정)  ==> B/L 분할(TI::TI10302_PopupSplt.xfdl)에서
0. Grid > properites에서 autoenter: select ==> Tab으로 이동하게 설정 
1. Grid Contents Editor > 'B/L수량' 칼럼 > 
 1) displaytype: number 
 2) edittype: masknumber
 3) mask: ###,##0.00'    --> 'B/L수량' 칼럼이 최초에 0.,00으로 보임(소수점 2자리 처리)
 4) GridEdit > editautoslect: true  --> 'B/L수량' 칼럼이 한번에 선택됨 
 5) GridEdit > editdisplay: display  --> edit가 보임 @@@

2. Grid Contents Editor > '수정 B/L번호' 칼럼 > 
 1) displaytype: normal
 2) edittype: normal
 3) GridEdit > editautoslect: true  --> '수정 B/L번호' 칼럼이 한번에 선택됨 
 5) GridEdit > editdisplay: display  --> edit가 보임 @@@
 5) GridEdit > editmode: alpha,full  --> 입력란에 영어 포함 모든 문자 기입 가능 @@@ 
==============================================================================================================

- 'windows7 빌드 7601 이 windows는 정품이 아닙니다.' 에러 처리
Windows은 정품이 아닙니다.
http://blog.naver.com/potoi/220565448093
C:\Windows\system32> SLMGR -REARM
==============================================================================================================

- Themes 이미지(테마) 확인
1. Ux-studio에서 theme를 더블클릭하여 이미지와 css가 들어있는 창을 띄우기 
 1) 해당 창이 떳을 경우에 아래 경로로 가시면 사용하는 theme의 이미지를 확인 할 수 있습니다. 
2. 로컬 경로 확인(이미지와 css 창을 떴을 경우에만 가능)
 1) C:\Program Files (x86)\TOBESOFT\XPLATFORM\9.2.1\TEMPORARY\HS_ERP.xtheme0  
 폴더 안에 가시면 theme라는 폴더가 있습니다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.15(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:30  ==> 중식(장원각: 항아리 짜장, 짬뽕, 탕수육): 현대 오일뱅크 허세욱 과장이 쏨, 커피: 손이사님이 쏨 

- 현대오일뱅크 수출입 통관 개발 Prj
1. dsET_RETURN 일괄 반영
- 저장 성공 alert
//this.gfn_showMsgBox("0014", "fn_msgCallback", "");  // alert msg ==> 0014: 저장이 완료되었습니다.   
this.alert(sErrorMsg);

this.gfn_showMsgBox("SAP", "fn_msgCallback", "로그인 정보를 확인 할 수 없습니다.","","",""); 
==============================================================================================================

1. 관세사 정보(TOPS) ==> 3168504456, / 123456,
2. 로그인 정보 ==> 22223333,/ 12345678, 
==============================================================================================================

- dsET_RETURN 에러 ==> 수출 B/L 등록대상조회(/TE20101.xfdl)
1. 현상: 
dsET_RETURN.getColumn(0,"TYPE") == "E") 
<Col id="TYPE">E</Col>
<Col id="ID">ZMTI00</Col>
<Col id="MESSAGE">로그인 정보를 확인할 수 없습니다.</Col>
2. 원인: dsI_USERINFO 추가할 것 
var inData = "dsIMT_CARTXS=dsIMT_CARTXS dsI_USERINFO=dsI_USERINFO"; 
---------------------------------------------------------------------------------------

- dsET_RETURN 에러  ==> 수출 B/L 등록화면(팝업)(/TE20101_Popup.xfdl)
1. 현상: 
dsET_RETURN.getColumn(0,"TYPE") == "E")  
<Col id="TYPE">E</Col>
<Col id="ID" />
<Col id="NUMBER">000</Col>
<Col id="MESSAGE">공급업체 정보를 확인할 수 없습니다</Col>  
---------------------------------------------------------------------------------------

- dsET_RETURN 에러  ==> 분할 저장(/TI10301_Popup.xfdl) ==> 수입 B/L 저장 (수정) 
1. 현상: 
dsET_RETURN.getColumn(0,"TYPE") == "E") 
<Col id="TYPE">E</Col>
<Col id="ID">ZMTI00</Col>
<Col id="NUMBER">915</Col>
<Col id="MESSAGE" />
<Col id="MESSAGE_V1">코스트 센터</Col>
2. 원인: SAP 자체에서 나는 에러라고 함
==============================================================================================================

- 노트북 사용 신청서 재작성
1. 사용기간: 2017.06.15 ~ 07.14
2. 6월말 철수시 제출할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.16(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj
1. 수입 B/L 관리   
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
  ==> B/L 분할(TI::TI10302_PopupSplt.xftdl) ==> 파일 업로드, 다운로드 처리 @@@ 
==============================================================================================================

- 단위 테스트 @@@
1. 수출입통관시스템_단위테스트(진태만)V1.0.xlsx 작성
==============================================================================================================

- 로그인 정보
No. Data Object Value / Code   Description
1 회사코드  1000 현대오일뱅크
2 회사코드  B000 현대코스모
3 회사코드  C000 연대쉘베이스오일
4 회사코드  D000 현대케미칼
5 내부사용자  199390 / 201704apr@  ==> 허세욱과장
6 외부사용자  22223333 / 12345678
7 Admin  199390 / 201704apr@
8. 관세사 정보(TOPS): 199390 / 201704apr@,
==============================================================================================================

- Decimal 사용
//=======================================================================================
// Transaction CallBack
//---------------------------------------------------------------------------------------
this.fn_callback = function(sTrId, nErrorCode, sErrorMsg)
{      
	 trace("[/TI10302_PopupSplt.xfdl] [fn_callback()] ==> [콜백_S] [sTrId]"+ sTrId +"[nErrorCode]"+ nErrorCode +"[sErrorMsg]"+ sErrorMsg );
	   
	 var nBlmngTot = new nexacro.Decimal;
	 var nBlmngTotEdit = new nexacro.Decimal;
	   
	 switch(sTrId)
	 { 
		  case "TI10302_PopupSpltRfc":    
		    if(this.dsET_LIST.getRowCount() > 0)
		   {    
			    for (var i=0; i < this.dsET_LIST.getRowCount(); i++) 
			    { 
				     this.dsET_LIST.setColumn(i, "TXZ01", this.v_txz01); // 품명  
				     nBlmngTot = nBlmngTot + this.dsET_LIST.getColumn(i, "BLMNG_S");   // B/L수량(Grid) ==> Decimal 사용 @@@
				     trace("[/TI10302_PopupSplt.xfdl] [fn_callback()] ==> [i_번째]"+ i +"[nBlmngTot]"+ nBlmngTot ); 
			    }
			    this.edtTotBlmng.set_value(nBlmngTot);   // 총 B/L수량
			    trace("[/TI10302_PopupSplt.xfdl] [fn_callback()] ==> [콜백_S] [총 B/L수량(Grid)]"+ nBlmngTot );
		   }
		   else
		   {   
			    var nBlmngTotEdit = new nexacro.Decimal;
			    nBlmngTotEdit = this.pDs.getColumn(0, "BLMNG");  // 총 B/L수량(parent Grid에서 받아온 B/L수량)  
			    trace("[/TI10302_PopupSplt.xfdl] [fn_callback()] ==> [콜백_S] [총 B/L수량(Edit)]"+ nBlmngTotEdit );

			    this.edtTotBlmng.set_value(this.pDs.getColumn(0, "BLMNG"));   // 총 B/L수량 
		}
		break;  
	}
}
------------------------------------------------------------------------------------------------

- dsET_LIST DataSet @@@@
<ColumnInfo>
	 <Column id="CHK" type="STRING" size="256" description="Check box"/>
	 <Column id="BUKRS" type="STRING" size="32" description="회사 코드"/>
	 <Column id="IBLNO" type="string" size="32" description="B/L관리번호"/> 
	 <Column id="BLNUM" type="string" size="32" description="B/L번호(원 B/L 번호)"/>
	 <Column id="BLNUM_S" type="STRING" size="32" description="분할B/L번호(수정 B/L 번호)"/> 
	 <Column id="BLDST_S" type="STRING" size="32" description="선적서류 상태"/>
	 <Column id="BLMNG_S" type="BIGDECIMAL" size="32" description="분할B/L물량(수정 B/L 수량)"/>
	 <Column id="MEINS" type="STRING" size="32" description="단위"/> 
</ColumnInfo>
==============================================================================================================
  
- 오늘날짜, 해당 날짜 셋팅
this.ufn_initComp = function()
{    
 var today = this.gfn_today();    // 오늘 날짜 this.gfn_today() 
 var firstday = this.gfn_firstDate(today);  // 해당월 시작일

 this.div_search.calFrom.set_value(firstday); // 오늘 날짜
 this.div_search.calTo.set_value(today);  // 해당월 시작일 
} 
==============================================================================================================

- 서울행
18:30 퇴근(현대오일뱅크 수출입 통관 개발 Prj(대산 공장) :오수석 차): 오수석 정팀장 만나러 양재에 간다고 함
18:40 출발
18:20 화성 휴게소(음료수, 과자: 내가 쏨, 치킨: 오수석이 쏨, 오수석 차 가스 충전)
19:25 다시 출발(차 많이 막힘)
21:00 양재지민의 숲 도착
21:10 양재2동 주민센터, 양재꽃 시장 정류장(440번 버스 탑승)
21:30 강남역 도착
21:50 대림역 도착
22:00 귀가
22:20 석식(라면) 
00:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.17(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
09:00 기상 
10:00 조식
11:00 중식
11:30 집출발
11:40 대림역(6511번 버스) 승차
12:20 서울대학교 도착 
12:50 관악문화도서관(1층: 어린이도서관): 수종에게 책 읽어 줌  ==> 수종 3층에 책 대여하러 간 사이 아빠 없다고 울음
13:50 관악문화도서관(3층) 도서 대여 --> 칭기즈칸. 2,  칭기즈칸. 3 대여
14:00 종료
14:10 서울대학교 승차
14:50 대림역 도착
15:00 귀가
16:00 집출발(자전거)
16:20 성원동도서관 도착
16:30 토지 1권 1부 대여 ==> 상호대차
16:50 로토 구입(10장): CU 편의점
17:20 이마트 구로점(아이스크림 12개, 치약 6개)
17:50 귀가
18:00 아파트 놀이터(수종)
19:40 귀가
19:30 석식(닭도리탕)
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.18(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(최선형과 트럭에 짐 옮겨다 실음) 
06:50 대림운동장
07:00 대림운동장 츨발
07:30 1공수여단(신월동, 신분증 필요없음, 비행기 소음 큼) 
08:00 게임(신화 조기회) ==> 2게임함 
 --> 강서구 연합회가 천연 잔디를 선점해서 맨땅에서 경기함(날씨가 많이 더움)
 --> 상배형이 에어컨  설치 해준다고 함: 사양 확인(7월초에 설치 검토)
12:00 종료
12:20 중식(북어국: 우리 감자탕): 박기우 형님이 장인상 답례로 쏨
14:30 종료  
15:00 귀가
16:00 낮잠
16:00 기상
19:00 석식 
20:15 집출발
20:23 대림역 ==> 20:32 강남행 지하철 탈 것
22:00 구성역
22:10 구성역 3번 출구 ==> 오상민 수석 차에 승차(대산행)
23:50 숙소(코지 하우스, 대산고 근처) 도착
00:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.19(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
- 단위 테스트 내용 수정 @@@
1. 수출입통관시스템_단위테스트V1.1_윤수호20170616.xls
==============================================================================================================

- 수출신고필증 등록(TE::TE20201_Popup.xfdl)
dsEXS_ZTETCCK: CCINO(수출신고필증)  ==>dsEXS_ZTETCPK: CCINO(수출신고필증) 
==============================================================================================================

- 통관계획조회(/TI10101.xfdl) 수정
/****************************************************************************************
 * Description     : Grid에서 기준일, 접안일에 따라 통관 칼럼별 이미지 변경 
 ****************************************************************************************/
this.ufn_setImgColor = function(strAtbdt, strNo) 
{  
	 var strReutrn = "";
	 var strStdDt = this.div_search.calStdDt.value;  
	 var strAtbdtChg = this.gfn_replace(strAtbdt, "-", "");   // 접안일
	 var dDiff = this.gfn_getDayDiff(strStdDt+"000000", strAtbdtChg+"000000");  // 날짜 차이 처리
	 trace("[/TI10101.xfdl] [ufn_setImgColor()] ==> [dDiff]"+ dDiff +"[기준일(strStdDt)]"+ strStdDt +"[접안일(strAtbdtChg)]"+ strAtbdtChg );

	 if(dDiff <= -3)   // 기준일과 접안일과 비교하여 -3DAY 부터 경고 표시: 3일이 지난 접안일은 경고(빨간색) 처리
	 {
		strReutrn = "theme://images/img_MF_Gr04.png";   // 빨간색
	 } 
	 else  // 그 외
	 {
		strReutrn = "theme://images/img_MF_Gr02.png"; // 연두색
	 }

	 return strReutrn;
}
==============================================================================================================

- 수입통관진행관리(/TI10201.xfdl) 수정
==> Grid: dsET_LIST_H 
1. Head 품목: TXZ01 ==> BELP(구매문서 품목 번호)
2. Detail 품목: TXZ01 ==> SAP RFC에서 못 받아옴
==============================================================================================================

- 사용자교육 자료 만들기
1. 06-1. 사용자 매뉴얼_수입_V1.0.pptx
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.20(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00  ==> 수출입 통관 개발 웹 통합 테스트

- 현대오일뱅크 수출입 통관 개발 Prj
- 출입 통관 개발 웹 통합 테스트(10시 ~ 16시, 행정동 2층 검소실[회의실])
1. 허세욱 과장(현대 오일뱅크 경영정보팀), 박서원 대리(수입),  서관호 사원(수출 담당, 경주 출신), 허문일 사원(웹 담당)
----------------------------------------------------------------------------------------------------------

- 수출통관신청현황조회(TE::TE20202.xfdl)
1. 업로드한 파일 조회 안됨
----------------------------------------------------------------------------------------------------------

- 항만수수료등록현황(TE::TE20304.xfdl)
1. 납부기한 추가
----------------------------------------------------------------------------------------------------------

- 관세사수수료(TE::TE20302.xfdl)
1. 증빙일자: 제거
2. 상태: 초록색 --> 빨간색: 변경
----------------------------------------------------------------------------------------------------------

- 파일 첨부
1. 종류: BL ==> 디폴트 설정
==============================================================================================================

- dsI_USERINFO 일괄 반영
1. 조회, 저장 포함
==============================================================================================================

- Nexacro 실행 에러
1. 현상:
(5392): Error: 지정한 파일을 찾을 수 없습니다. (C:\Program Files (x86)\nexacro\14\nexacro14lib\component\NexacroLoad.json)
(5392): Error: 지정한 파일을 찾을 수 없습니다. (C:\Program Files (x86)\nexacro\14\nexacro14lib\component\HoilLibrary.json)
(5392): Error: 지정한 파일을 찾을 수 없습니다. (C:\Program Files (x86)\nexacro\14\nexacro14lib\component\NexacroLoad.json)
(5392): Error: 지정한 파일을 찾을 수 없습니다. (C:\Program Files (x86)\nexacro\14\nexacro14lib\component\HoilLibrary.json)
2. 원인: Base Lib Path가 틀려서 나는 형상 
3. 조치:  Base Lib Pa변경
 1) Tools > Options > Environment > Build 
  ==> Base Lib Path: C:\Program Files (x86)\nexacro\14\nexacro14lib 
 --> C:\hicts_workspace\hicts_xui\xui\nexacro14lib 로 변경해야 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.21(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  ==> 회식(치킨(라면), 호프, 호프집): 세무팀, SAP팀: 손이사님이 쏨

- 현대오일뱅크 수출입 통관 개발 Prj
- 출입 통관 개발 웹 통합 테스트 수정
----------------------------------------------------------------------------------------------------------

- 관세사수수료(TE::TE20302.xfdl)
1. 납부기한 추가
==============================================================================================================

- Calendar 수정
1. 현상: dsEX_ZTITBLK에서 BLDAT이'2015-06-25'로 들어옴
2. 조치: BLDAT이'20150625'로 변경 ==> replace() 처리
 1) Calendar Properties
dataformat: yyyy-MM-dd
editformat: yyyy-MM-dd
this.divDetail.calBLDat.set_value(this.dsEX_ZTITBLK.getColumn(0, "BLDAT"));    // B/L발행일 
 var str_BLDat_2 = this.divDetail.calBLDat.value;    // B/L발행일 2  ===> TEST @@@ ===> 

 this.divDetail.calBLDat.set_value(this.dsEX_ZTITBLK.getColumn(0, "BLDAT").replace(/[-]/g, ""));    // B/L발행일(replace() 처리) 
 trace("[/TI10302_Popup.xfdl] [ufn_getBLData()] ==> [B/L발행일(BLDAT)]"+ this.dsEX_ZTITBLK.getColumn(0, "BLDAT") +"[str_BLDat_2]"+ str_BLDat_2 );
}
==============================================================================================================

- 날짜 null 처리
1. 현상: 도착일이'0000-00-00'로 들어옴
2. 조치: 도착일이'0000-00-00'이면 널 처리  --> 이렇게 해야 Grid에서 도착일 칼럼 정렬할 때 정렬이 됨
<Formats>
	<Format id="default">
		  <Columns>
			    <Column size="80" />
			    <Column size="80" /> 
		  </Columns>
		  <Rows>
		    <Row size="30" band="head" />
		    <Row size="26" />
		  </Rows>
		  <Band id="head">
		    <Cell text="통관"/> 
		    <Cell col="51" text="도착일"/> 
		  </Band>
		  <Band id="body"> 
		    <Cell col="1" displaytype="expr:(ARRDT==&quot;0000-00-00&quot;)&#32;?&#32;&quot;none&quot;&#32;:&#32;&quot;normal&quot;" text="bind:ARRDT"/>  
		  </Band>
	</Format>
</Formats> 
==============================================================================================================

- 확정통관 현황조회(TI::TI10402.xfdl) 수정
1. 현상: <확정탭>을 선택하고 조회 했을때 결과가 없는데 loding을 계속하면서 화면이 멈춤(5.17~6.17)
2. 조치: <확정탭>을 선택하고 잠정수입신고일(2017.05.17 ~ 2017.06.21)로 조회 했을때 결과가 조회됨. 
잠정수입신고일(2011.05.17 ~ 2017.06.21) 조건을 너무 크게 잡으면 loding을 계속하면서 화면이 멈춤(SAP에서도 같다고 함)
==============================================================================================================

- 스크립터 디버깅
A. IE 디버깅 @@@
0. Cach 삭제: IE11 > InPrivate 브라우징 시작: 클릭(실행) 
1. F12 개발자 도구를 사용하여 JavaScript 오류 디버그
==> https://msdn.microsoft.com/ko-kr/library/gg699336(v=vs.85).aspx
2. window.console.log("The file opened successfully");

1) Internet Explorer 9에서 예제를 로드합니다.
 2) F12 키를 눌러 F12 도구를 열고 스크립트 탭을 클릭합니다.
3) 왼쪽 창에서 첫 번째 함수로 스크롤하여 "var a = 5;" 줄을 마우스 오른쪽 단추로 클릭한 다음 중단점 삽입을 클릭합니다.
HTML 소스
function firstParam() {
    //set breakpoint here 
    var a = 5;
    secondParam(a);
} 

4) 디버깅 시작을 클릭한 다음 브라우저의 웹 페이지에서 실행 단추를 클릭합니다.
5) F12 도구의 오른쪽에 있는 조사식 탭을 클릭하고 "a, b, c 및 d"변수를 추가합니다.
6) F11 키를 누르거나 한 단계씩 코드 실행 단추를 클릭하여 코드를 단계별로 실행하고 조사식 탭에서 변수를 봅니다.
==============================================================================================================

- 크롬 디버깅
B. 크롬 디버깅 @@@
0. Cach 삭제: 90. 크롬(캐시D) ==> chrome://settings/clearBrowserData
==============================================================================================================

- Internet Explorer에서 스크립트 디버깅 사용 및 시작
https://msdn.microsoft.com/ko-kr/library/z959x58c.aspx

- 디버거를 사용하여 실행 중인 JavaScript 검사
https://msdn.microsoft.com/ko-kr/library/dn255007(v=vs.85).aspx

- Javascript 디버거 사용하기 (IE, Firefox)
https://blog.outsider.ne.kr/153

"모든 스크립트 오류에 관련된 알림 표시"를 체크
 "스크립트 디버깅 사용 안함"을 둘다 체크 해제해 준다. 당연히 우리는 스크립트 디버깅을 할 목적이]

- [자바스크립트,javascript] 디버깅(debugging) 방법
http://h5bak.tistory.com/83
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.22(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==> 주간보고(14시)

- 현대오일뱅크 수출입 통관 개발 Prj
- 수출신고필증 등록현황(TE20202.xfdl) 수정
1. 수출신고필증 클릭시 새창 띄우기
==> Z_TE_CC_READ(수출신고필증 상세 조회)
==============================================================================================================

- Grid 특정 Row Color 혹은 Font 를 변경 
for(var i=0; i<this.tab.tabpage2.grd_List2.getCellCount("Body"); i++) 
{  
	if(this.tab.tabpage2.grd_List2.getCellProperty("body", i, "text") == "bind:ATBDT")  // 칼럼이 접안일(ATBDT) 이면
	{   
		  this.tab.tabpage2.grd_List2.setCellProperty("Body", i, "color", 'red');  // 접안일 칼럼 글자 빨간색 처리
		  this.tab.tabpage2.grd_List2.setCellProperty("Body", i, "color2", 'red');  
		 //  this.tab.tabpage2.grd_List2.setCellProperty("Body", i, "color", 'EXPR(currow==2?"red":"")');  // 2번? 줄 글자 빨간색 처리
		 //  this.tab.tabpage2.grd_List2.setCellProperty("Body", i, "color2", 'EXPR(currow==2?"red":"")'); 
		 //  this.tab.tabpage2.grd_List2.setCellProperty("Body", i,"font", 'EXPR(currow==7?"10 궁서체":"")'); 
	 }
}  
==============================================================================================================

- 관세차이 글자 음수이면 빨간색 처리(/TI10201.xfdl)
==> expr:(DUTX_DIFF < 0) ? "red" : ""
for(var i=0; i<this.Tab00.tabpage2.grdDetail.getCellCount("Body"); i++) 
{  
	 if(this.Tab00.tabpage2.grdDetail.getCellProperty("body", i, "text") == "bind:CDUTX_DIFF" )  // 칼럼이 관세차이 이면 
	 //if(this.Tab00.tabpage2.grdDetail.getCellProperty("body", i, "text") == "bind:CDUTX_DIF<0?'red':''") // 칼럼이 관세차이 이면 
	 //if(obj.getCellProperty("body",e.cell,"text")=="expr:etcmtYn=='Y'?1:0") // usrBtn 셀 클릭시에 사용자 팝업 호출
	 {    
		var dsET_DETAIL_C_CDUTX_DIFF_value;

		for (var j=0; j < this.dsET_DETAIL_C.getRowCount(); j++) 
		{  
		   dsET_DETAIL_C_CDUTX_DIFF_value = this.dsET_DETAIL_C.getColumn(j, "CDUTX_DIFF");
		   
		   if(dsET_DETAIL_C_CDUTX_DIFF_value < 0)      {
			this.Tab00.tabpage2.grdDetail.setCellProperty("Body", i, "color", 'red');  // 관세차이 칼럼 글자 빨간색 처리
			this.Tab00.tabpage2.grdDetail.setCellProperty("Body", i, "color2", 'red');   
		}   // end of for()
	  } 
	}
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.23(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==> 서울행

- 현대오일뱅크 수출입 통관 개발 Prj
- 수입통관진행관리(/TI10201.xfdl) 수정 
06월 21일 허문일 WEB 수입진행현항 "*수입의뢰일자가 검색결과에 추가
*검색조건에 ""수입자재종류""를 추가 (원유/제품/자재/반제품)"  ==> 완료 @@@
==============================================================================================================

- 수출 B/L 등록화면(팝업)(/TE20101_Popup.xfdl) 수정
06월 21일 서관호 WEB "수출B/L 목록
→ BL등록" *등록시 물량의 기본값 "KL" 기본 표시 ==> 완료 @@@
==============================================================================================================

- 수출 B/L 현황 리스트(/TE::TE20102.xfdl) 수정
06월 21일 서관호 WEB "수출B/L 수정/현황
→목록조회" "*물량표시에 천단위 "","" 
*목록에서 선적항/도착항 존재치 않음. 상세(팝업)조회시 선적항/도착항 존재"  ==> 완료 @@@
var strSHPTX = "" ;
var strALPTX = "" ;

if(this.dsEXT_ZTETBLK.getRowCount() > 0)
{   
	 for (var i=0; i < this.dsEXT_ZTETBLK.getRowCount(); i++) 
	 {     
		  strSHPTX =  this.dsEXT_ZTETBLK.getColumn(i, "SHPTX");   // 선적항
		  strALPTX =  this.dsEXT_ZTETBLK.getColumn(i, "ALPTX");   // 도착항 
	 }
} 
==============================================================================================================

- 항만수수료등록(/TE::TE20301.xfdl) 수정
06월 20일 2차통합테스트 WEB 항만수수료등록 "* 선박 두 개 이상 엮어 수수료 생성한 경우 오류 -> 이후 창 CLEAR가 안됨
* 납부기한(PAYLDT, ) 입력칸 추가
* ETD -> 출항일자  로 이름 변경"
==============================================================================================================

- 항만수수료등록현황(/TE::TE20304.xfdl) 수정 
06월 20일 2차통합테스트 WEB 항만수수료등록현황 "* 금액단위가 항만수수료 등록 시 70만원 넣었는데 등록현황 오면 7천원 으로
* 납부기한을 리스트 상 항만수수료-통화 다음 칸에
* ETD -> 출항일자  로 이름 변경
* ETA는 리스트 상 삭제
* 조회칸에도 납부기한 추가" 
==============================================================================================================

- 수출통관수수료처리(/TE::TE20302.xfdl) 수정
06월 20일 2차통합테스트 WEB 관세사수수료 "* 수출통관관리 에서 입력한 관세사수수료 리스트에 뜨지 않음
* SAP 상 과네사수수료 요율.. 단위?  270만원? 2.7만원?
* 증빙일자 -> 삭제
* 금액 수정하여 요청 누르면 저장이 안됨?
* 관세사수수료 여러 건 클릭한 뒤 총액이 보여야(공급가액, 세액, 과세표준 의 합)"
==============================================================================================================

- 서울행
17:20 퇴근(현대오일뱅크 수출입 통관 개발 Prj(대산 공장) :오수석 차) ==> 오수석 치과 간다고 일찍 출근
17:30 출발
18:00 행담 휴게소(오수석 차 가스 충전)
18:05 다시 출발(차 많이 막힘)
19:43 구성역(3호선) 도착
19:46 구성역 -> 대림역
21:05 대림역 도착
21:15 귀가
21:30 석식
21:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.24(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
09:00 기상 
10:00 조식
12:00 중식
12:30 집출발
12:40 대림역(6511번 버스) 승차
13:20 서울대학교 도착 
14:30 관악문화도서관(1층: 어린이도서관): 수종에게 책 읽어 줌
13:50 관악문화도서관(3층) 도서 대여 --> (만화) 토지. 1 ~ 4, 제1부
15:30 종료
15:50 서울대학교 승차(비 조금 옴)
17:50 대림역 도착
17:00 귀가
18:00 집출발(자전거)
18:20 뚜레쭈르 대림우성점 ==> 딸기 케이크, 빵 구입 
19:00 귀가
19:30 석식
20:00 내 생일 파티
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06..25(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(자전거로 2번 실어서 나름, 나머지는 최선형 차로 나름) 
07:50 숏게임 
08:30 게임(신길 7동 조기회) ==> 3게임함(치선 총무가 시작 전에 페어 플레이 하자고 먼저 이야기 함)
 ==> 수박 3통(플러스 마트): 신길 7동 조기회에서 쏨 
11:35 종료 
12:00 중식(물냉면, 만두, 전주 콩나물국밥) ==> 회에서 쏨 
13:30 종료(비 많이 옴)
13:50 강고문님댁 지하 ==> 개고기 시켜 먹음(단장님이 시킴)
15:00 종료
15:20 귀가
16:00 낮잠
18:00 기상 
18:30 석식(루옌 핸드폰 회사 알바 감)
19:50 루옌 귀가
20:15 집출발
20:23 대림역 ==> 20:32 강남행 지하철 탈 것
22:00 구성역
22:10 구성역 3번 출구 ==> 오상민 수석 차에 승차(대산행)
23:50 숙소(코지 하우스, 대산고 근처) 도착
00:00 취침
==============================================================================================================

- 대산 Prj에서 할 것
1. 현대오일뱅크 수출입 통관 개발 Prj --> .7z로 압축할 것
2. hicts_OffLine 개발 완료 후 --> 7z로 압축할 것
==============================================================================================================

- 전자레인지 A/S 요청 전화할 것..
1) 동양 매직 GRA-C2100R(N), 가격: 339,000원(이마트 가격: 구입), 가격: 284,990원(G마켓 가격)
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=616944241&GoodsSale=Y&jaehuid=200002673
==============================================================================================================

- 에어컨 설치 준비할 것
1. LG 휘센 에어컨 2in 1(F-Q165DMPWQW). F-Q165DMPWQW.엘지휘센.기본설치무료. 손연재 스페셜.초절전 슈퍼인버터 1등급.화이트
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=370347964&trTypeCd=21
&trCtgrNo=585021&lCtgrNo=1001438&mCtgrNo=1002758
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.26(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
- 수정 사항 수정 @@@
1. 시스템 수정요청 및 진행상황 (통합).xlsx
==============================================================================================================

- 확정통관 현황 조회(/TI::TI10402.xfdl) 수정
06월 23일	박세원	SAP+WEB	"SAP : 확정과세검증
WEB : 확정통관현황"	"SAP : 확정신고 진행시 관세사가 부가세 과세과표 입력란을 추가하여 ""잠정신고의 과표 - 입력값"" 을 근거로 
        부가세 과세과표로 입력함
WEB : 관세사가 부가세 과세과표 입력란을 추가 생성"   ==> 과세과표 입력란을 추가 처리 @@@
----------------------------------------------------------------------------------------------------------

박세원	WEB	확정통관 현황조회	확정신고서 과세금액 입력시 오류 발생 (TEST : 신고번호 : 4130100201889)
==> 1. 에러 내용: 확정과세검증 기초 데이터가 없습니다.
1. 원인 및 조치: SAP에서 메일 보내기 액션을 취한 후 웹에서 저장 처리를 하면 정상 등록됨
==============================================================================================================

- 수입 B/L 등록(팝업)(TI::TI10301_Popup.xfdl) 수정(등록시 에러)
- 수입 B/L 상세(팝업)(TI::TI10302_Popup.xfdl) 수정(수정시 에러) 
==============================================================================================================

- 태용이 오늘 서울 무역 회사 첫 출근
1. (주)팜스빌 영업2부 부장으로 출근(삼성역 근처, 숙소: 신림역 근처)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.06.27(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  ==> 웹 사용자 교육(10시)

- 현대오일뱅크 수출입 통관 개발 Prj 
- 수정 사항 수정 @@@
1. 시스템 수정요청 및 진행상황 (통합).xlsx
==============================================================================================================
  
- 입항화물료 수수료처리(TI::TI10502.xfdl) 수정
1. IVSLN(선기명): PROSPERITY --> 보이게 처리
2. Z_TI_BL_EXP_RFC_LIST(입항화물료 수수료처) ==> 03-3 Mapping spec_화물입항료등록대상조회 IF_김원기.xls
==============================================================================================================
 
- 수입 B/L 등록목록조회(TI::TI10302.xfdl) 수정
1. 번호(분할) ==> 000000 안 보이기 처리
2. B/L번호(분할)  => 수정 B/L번호(B/L분할 새창)
3. 수량(분할) => B/L수량(B/L분할 새창)
==============================================================================================================

수입 통관수수료처리회(TI::TI10501.xfdl) 수정
1. 수입신고번호: CDCNO  --> CHAR	20 
==============================================================================================================

- eclipse 실행 에러
1. 현상:
 An internal error occurred during: "Building workspace".
Java heap space
2. 조치: 이클립스 자바 heap size 늘리기(/eclipse.ini 파일에서) 
-XX:MaxPermSize=1024m	 ==>	-XX:MaxPermSize=2048m
-Xms512m
-Xmx1024m    ==> -Xmx2048m
--> http://isnetis.tistory.com/222
------------------------------------------------------------------------------------------------

1. 현상:
An internal error occurred during: "Building workspace".
GC overhead limit exceeded 
2. 원인: 메모리 한계 초과
3. 해결: -Xmx 옵션으로 메모리를 더 할당. 
 1) 메모리가 부족하여 가비지 컬렉션이 이루어 졌으나, 새로 확보된 메모리가 전체 메모리의 2% 미만이어서 생기는 오류.
한 마디로 더 이상 가비지 컬렉션을 할 수 없을 정도로 메모리를 사용한다는 것임.
기존) java -Xms1g -Xmx1g -jar Project.jar
해결) java -Xms4g -Xmx4g -jar Project.jar
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.06.28(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 17:40  ==> 중간보고회(16시, 서울) : 오수석 01시에 귀가

- 현대오일뱅크 수출입 통관 개발 Prj 
- 수정 사항 수정 @@@
1. 시스템 수정요청 및 진행상황 (통합).xlsx
==============================================================================================================
 
- 수입 입항화물료 수수료처리(TI::TI10502.xfdl) 수정
1. 납부기한(IP_PAYLDT), IP_BLHCH_SUM(입항수수료 합)추가  --> BLHCH: 입항수수료
==> Z_TI_BL_EXP_REQ([수입] 화물입항료 청구)  --> CHCIC: 입항료 청구 여부
==============================================================================================================

- 메인(frmMain.xfdl) 수정
1. 03-3 Mapping spec_통관업무 상황 조회(Web Main)RFC.xls
IP_DATE			일자 	
IP_BUKRS			회사 코드	
==> Z_TI_CUSTOMS_PROGRESS_RFC([수입] 통관업무 상황 조회 RFC)
==============================================================================================================

- 인텨넷 연결 에러
1. 현상: 프록시 서버가 응답하지 않습니다.
2. 조치: http://h5bak.tistory.com/284
 1) 인터넷 익스플로러 우측 톱니바퀴: 클릭 > 인터넷 옵션: 클릭 
 2) 연결 탭으로 이동 후 LAN 설정 버튼: 클릭
 3) 아래의 화면처럼 자동으로 설정 검색: 체크
 ==> 사용자 LAN에 프록시 서버 사용(이 설정은 전화 연결이나 VPN 연결에는 적용되지 않음)에 체크 해제
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.29(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 17:30  ==> 회식(회(삼길포항, 대현 횟집): 세무팀[박정서 차장]에서 쏨, 호프: ASEG 손정수 이사님이 쏨

- 현대오일뱅크 수출입 통관 개발 Prj 
- 수정 사항 수정 @@@
1. 시스템 수정요청 및 진행상황 (통합).xlsx
==============================================================================================================
 
- 수출 통관업무 상황조회(/TE20010.xfdl) 수정
1. 03-3 Mapping spec_통관업무 상황 조회(Web Main)RFC.xls
IP_DATE			일자 	
IP_BUKRS			회사 코드	 

2. Z_TS_EXP_CC_STATUS([수출] 통관업무 상황 조회 RFC)
통관건수: medtEtryCnt ==>[PLN_CNT]
통관물량: medtEtryGdsQty ==>[PLN_QTY]
- 당월실적 
신고수리: medtThsMmRprtReprCnt ==>[TM_QTY]
신고금액: medtThsMmRprtReprAmt ==>[TM_AMT]
- 전월실적
신고수리: medtBfeMnthRprtReprCnt ==>[LM_QTY]
신고금액: medtBfeMnthRprtReprAmt ==>[LM_AMT]
==============================================================================================================

- Themes 이미지(테마) 확인
C:\hicts_workspace\hicts_xui\xui\hoil.xtheme 파일에서 sta_MF_RBoxData 찾기
Static.sta_MF_RBoxData, Static.sta_MF_RBoxData:mouseover
{
	align				: right middle;
	background			: ;
	border				: 0 none;
	color				: #0752a5;
	font				: bold antialias 16 Malgun Gothic, Dotum, Tahoma, Arial;
	padding				: 0 0 6 0;
}
==============================================================================================================

- Nexacro 이미지 위치
1. 이미지 파일 위치 ==> C:\Program Files (x86)\nexacro\14\TEMPORARY\hoil.xtheme0\images  
2. nexacrostudio14에서 theme를 더블 클릭하여 이미지와 css가 들어있는 창을 띄우기 
==============================================================================================================

if(!this.ufn_setSaveDs()) return;
/****************************************************************************************
 * Description    	: 저장 전 Save Ds 처리
 * Argument			: 
 * return			: 
 ****************************************************************************************/   
this.ufn_setSaveDs = function()
{
	var nCheckRowCnt = 0; 
	this.dsEXS_ZTETBLK.clearData();
	
	if(this.dsET_ITEM.getRowCount() > 0)
	{     
		var nRow = this.dsIT_BLCHARGE.addRow();
		
		this.dsEXS_ZTETBLK.setColumn(nRow, "HBLNO",	this.divDetail.edtIBLNum.value.trim() );  		// B/L번호 
		this.dsEXS_ZTETBLK.setColumn(nRow, "BILNO",	this.divDetail.calBLDat.value.trim()) ;  		// B/L 발행일 
		this.dsEXS_ZTETBLK.setColumn(nRow, "CCINO",	this.divDetail.edtCCINO.value.trim()) ; 		// 수출신고필증		
		this.dsEXS_ZTETBLK.setColumn(nRow, "LODIMG", this.divDetail.medtLODIMG.value.trim() );    	// 물량
		this.dsEXS_ZTETBLK.setColumn(nRow, "VRKME",	this.divDetail.edtVRKME.value.trim() ); 		// 단위		
		this.dsEXS_ZTETBLK.setColumn(nRow, "ETDDT",	this.divDetail.calBLEtd.value.trim() );  		// ETD
		this.dsEXS_ZTETBLK.setColumn(nRow, "ETADT",	this.divDetail.calBLEta.value.trim() );  		// ETA		
		this.dsEXS_ZTETBLK.setColumn(nRow, "SHPTX", this.divDetail.edtSHPTX.value.trim() );    	// 선적항
		this.dsEXS_ZTETBLK.setColumn(nRow, "ALPTX",	this.divDetail.edtALPTX.value.trim() ); 		// 도착항  
	}
 
	return true;
}
==============================================================================================================

- 토와 씨아버지 사망
1. 포항 어머니 조문(오씨): 포항시민 장례식장(부의금 5만원)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.06.30(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 17:00  ==> 중식(쌈밥, 대현 숯불 갈비): 손이사님이 쏨, 철수(18시에 ASEG 김종일 과장 차로 오산역까지 이동)

- 현대오일뱅크 수출입 통관 개발 Prj 
- 수정 사항 수정 @@@
1. 시스템 수정요청 및 진행상황 (통합).xlsx
==============================================================================================================

- X-PLATFORM에는 toFormatString이라는 메소드가 있는데 Nexacro에서 사용 못함
1. 조치: 아래와 같이 함수 만들어서 사용
var calculatedDt = new Date();   	// 현재 날짜 시각
var strToday = this.fromTimetoFormatString(calculatedDt, "Y-m-d"); 	// 년, 월, 일
var strTodayTime = this.fromTimetoFormatString(calculatedDt, "H:i:s"); 		// 시,  분, 초

/*****************************************************************************************
* Function명 : getCurTime
* 설명       : 현재 시간으로 반환하는 함수 
* Params     :    1. dt : Fri Jun 30 2017 10:36:32 GMT+0900 (대한민국 표준시)
			2. fmt :  "Y-m-d"(년, 월, 일),  "H:i:s"(시,  분, 초) ==> 변경하고 싶은 날짜 타입
			==> 예) var strTodayTime = this.fromTimetoFormatString("Fri Jun 30 2017 10:36:32 GMT+0900", "H:i:s"); 	// 시,  분, 초
* Return     :
* 작  성 자 : 진태만
* 작  성 일 : 2017.06,.30
*****************************************************************************************/  
LIB_DATE.fromTimetoFormatString = function(dt, fmt) 
{ 
	return fmt.replace(/(Y|y|m|d|h|H|i|s|am|pm)/gi, 
	
	function($1){ 
		switch ($1)
		{ 
			case 'Y': return dt.getFullYear();   	// 년
			case 'y': return dt.getFullYear().toString().substr(2); 	
			case 'm': return dt.getMonth() + 1; 	 // 월
			case 'd': return dt.getDate(); 			 // 일년
			case 'h': return (h = dt.getHours() % 12) ? h : 12;  // 시
			case 'H': return dt.getHours(); 
			case 'i': return dt.getMinutes(); 	 // 분
			case 's': return dt.getSeconds(); 	 // 초
			case 'am': return dt.getHours() < 12 ? 'am' : 'pm'; 
			case 'pm': return dt.getHours() < 12 ? 'am' : 'pm'; 
			} 
		} 
	); 
} 
==============================================================================================================

- grid sort 처리
1. application.GDS_QNALIST_ALL.set_keystring("S:-CDAT, S:-CTME");		// DS 정렬(-:오름차순 (Ascending))
2. bindDs.set_keystring(("S:-" + BodyColId[1]));
http://support.tobesoft.co.kr/Next_JSP/nexacroHome/index.html#
==============================================================================================================

- 01. Back_up_SW [☎  즐겨찾기 ☎] 
[바로 가기(.lnk)] 2015.06.25_한섬ERP  ==> C:\00. TAMA Home\03. TAMA Project Source\2015.06.25_한섬ERP
[바로 가기(.lnk)] Hansol_nexacro  ==> C:\00. TAMA Home\04. TAMA Program\71. Nexacro\Hansol\hsp_nexacro
==============================================================================================================

- 노트북 포맷(15시)
1. 노트북 들고 컴퓨터 관리실에 가서 요청
==============================================================================================================

- 서울행
18:00 종료
18:10 출발(김종일 과장 차 얻어 탐: 식권 한 장 줌)
19:40 오산역
19:53 오산역 -> 대림역
21:00 대림역 도착
21:10 귀가
21:30 중식  ==> 처가 쿠쿠 밥솥 선물(토와 씨아버지 사망 부의금, 자두값 10만원 포항 부모님께 송금)
01:00 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
