

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------// Memo(2017.07) //--------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.07.01(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장
07:50 숏게임 
08:20 게임(영을 조기회) ==> 3게임함(젊은 팀과 많이 뛰어서 피곤함)
09:55 종료 
10:10 중식(북어국: 우리 감자탕): 홍근성 형이 쏨
11:30 종료 
11:50 귀가 ==> 다리에 쥐가 나서 수종이랑 도서관 못 감
15:00 낮잠 
17:00 기상
17:20 집출발(자전거, 루옌, 수종: 비 조금 옴)
17:40 이마트 구로점 ==> 3층 식당 폐엄함
18:30 석식(크림 치츠 피자. 지하 1층에서 루옌, 수종이 먹음) 
20:00 종료 
20:10 귀가
23:40 취침 
==============================================================================================================
 
- 한컴 자동 업데이트 끄기 방법
1. 키보드 [윈도우 키 + R]
2. msconfig 입력
3. 시작프로그램에서 한글 선택 후 사용 안 함
==============================================================================================================

- 스펠(spell) 2.7 2.8 설치
1. 펌 가능 프로그램  ==> http://rityn.tistory.com/33
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.02(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(최선형과 같이 창고 가서 짐 나름)
07:50 숏게임 
08:20 게임 ==> 3게임함(어제 무리하게 축구해서 피곤함, 비 엄청 많이 옴, 맥주 내기해서 이김)
09:55 종료
10:10 중식(북어국: 우리 감자탕): 회에서 쏨
11:30 종료
11:50 귀가(다른 형들은 최선형 사무실에 감 ==> 노량진에 가서 민어 사와서 먹는다고 함)
14:00 이발, 염색 ==> 루옌이 해줌 
15:00 낮잠
17:00 기상
17:10 TV 시청
20:00 석식 
22:00 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2017.07.03(월) 작업■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00  ==> 

- 본사 대기[★] 
- The K 손해보험 Prj에 대해 설명 들음(10시, 이석부 사장님)
-------------------------------------------------------------------------------------------------------

- The K 손해보험 Prj 투입(9시, 종로)
1. MiPlatform  --> Websquare 전환  프로젝트
2. 프로젝트 시작: 2017,07.10(월) ~ 2018년 01월
3. 구종식 부장이 투입되기 전까지 PL 역할 ==> 우리 회사에서 턴키로 수주함
4. 개발 화면
 1) 신규 화면 분석 설계(4 ~50본): LG CNS 정해인 차장
 2) 전환, 개발(110본)
 3) UI 공통 ==> 내 역할
 4) UX / UI 디자이너
==============================================================================================================

- 김준수씨가 OS 설치 해줌
1. Windows 7 부팅 Disk을 수정해서 Windows 7 설치 해줌(부팅 디스켓 2개 만듬)
==============================================================================================================

- OS 설치 후 조치 @@@@
B. MSI GE60_2OE 드라이버 설치
 --> MSI GE60_2OE ==> http://www.msi.com/support/nb/GE60-2OE.html#down-driver&Win7 64
 1. 일반 Windows 7 부팅 Disk으로는 CUP가 6세대, 7세대에서 Windows 7 설치하면 USB 인식 못함
   --> 내 노트북: Intel(R) Core(TM) i5-6200U CPU @ 2.30GHz
  1) 조치: 김준수씨가 Windows 7 부팅 Disk을 수정해서 Windows 7 설치 후 기타둥둥 폴더 안에 있는 랜카드를 설치
  (/기타둥둥\EasyDriver_랜드라이버\x64\Network\[Network]WanDrv6.exe 클릭)
 2. 다른 드라이버 설치: 인터넷 연결 후 3DP Chip 다운 받아서 설치할 것
  1) 그래픽은 외장 그래픽만 설치할 것: AMD Radeon (TM) R7 M340(외장 그래픽 카드)
   가. 04. vga_radeon(외장 그래픽 카드): non-whql-win7-64bit-radeon-software-crimson-relive-17.6.2-june13.exe 설치
==============================================================================================================
 
- 로지텍 MK240 마우스, 키보드 콤보 밧데리 수명 만료[구입: 2016.11.24(목)]
1. 밧데리 수명(키보드: 2명, 마우스: 1년,  2개), 가격: 27,280원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B239830970&frm3=V2 
2017.04.20(목): 1차 교체(6개월 사용[에너자이저 AA 알카라인 밧데리]) 
2017.07.03(월): 2차 교체(3개월 사용[GIDAMAX AA 알카라인 밧데리]) 
==============================================================================================================
 
- 지출 결의서(지아이데이타)
1. 현대오일뱅크 수출입 통관 Prj) 지출 결의서 제출
 1) 첫날 택시비, 야근 식대 청구 ==> 184,400원 청구(6월말에 개인 통장으로 지급된다고 함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07..04(화) 작업■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00  ==> 

- 본사 대기[★]
- Miplatform 분석
1. MiPlatform Ver3.2 교육동영상, miplatform 강좌(유투브) 
-----------------------------------------------------------------------------------------------------

- Miplatform PID V3.3.0 Unicode 설치
1. MiPlatform V3.3를 설치 후 아래 License Key 를 사용해서 License 등록(1Year : 2016.10 .01~2017.12.31)
USER:admin
COMPANY:admin 
KEY : Z1CH9-Z9Q5H-E6E3T-HEHNG-CVA4E (1Year : 2016.10 .01~2017.12.31) 
==============================================================================================================

- 구글 크롬 북마크(즐겨찾기) 동기화 하기
1. http://juncheol.tistory.com/140
==============================================================================================================

- 장인, 장모 체류 기간 연장 서류 준비 ==> 하이코리아에서 사전 방문예약
1. 여권원본
2. 외국인등록증
3. 수수료 6만원
4. 가족관계증명서(상세)		 ==> 완료 @@@
5. 혼인관계증명서(상세)		 ==> 완료 @@@
6. 주민등록등본				 ==> 완료 @@@
7. 자녀명의 가족관계증명서(상세) ==> 완료 @@@	
8. 출입국 연장 통보서(편지)	 ==> 아직 못 받음 @@@
9. 우편물(수도 또는 가스)		 ==> 완료(전세 계약서, 국민연금 영수증 지참) @@@
10. 통합신청서				==> 완료 @@@
11. 신원보증서				==> 완료 @@@
12. 결핵검사(X) - 작년에 제출	 ==> 완료 @@@ 
==> 출입국에서 별도로 보여달라고 한건 와이프 신분증이 있었습니다.
----------------------------------------------------------------------------------------------------------

- 자녀명의 가족관계증명서(상세) 발급
1. 신청대상자란의 본인과의 관계를 "자녀"로 선택하시어 자녀의 성명과 주민등록번호 또는 성명과 등록기준지를 
입력하시어 발급받고자 하는 증명서 종류를 선택하여 발급받으시기 바랍니다.   
 ==> http://efamily.scourt.go.kr/pt/PtFrrpTrgtInfo.do#_
==============================================================================================================

- 삼성 SSD 중고 판매 게시글 올리기
http://cafe.naver.com/joonggonara/392285140\
1.  제목: 삼성 SSD mSATA PM851 128G(2개) 판매  ==> 2개 10만원에 판매 시도
2. 내용: 노트북에서 메인용과 단순 자료 저장용으로 사용했었습니다.
개당 5만원에 판매합니다.
가능하면 서울에서는 직거래 원합니다.(18시 이전 선릉역 근처, 18시 이후 대림역 근처)
문자(010-3073-0898)나 쪽지 주세요.
==============================================================================================================

- SKT 통신사 명의 변경 
1. 가족간명의 변경 = 두 분 신분증 + 가족관계증명서 또는 등본
 1) 이 두가지 중 한가지로 맞는거에 맞춰 가면되고요 서류는 필시 양수인, 양도인 신분증 원본 필요합니다. 
==> 서류 지참후 SK 공식인증대리점 가서 하시면 됩니다.(누가가든 서류는 똑같습니다.)
==============================================================================================================

- 크롬 IE Tab Seamless 확장프로그램 설치 방법
1. E를 사용하지 않고도 액티브X를 설치 할 수 있기 때문에 더 이상 익스플로러가 필수가 아니게 됨.
 ==> http://oasisdream.tistory.com/151
==============================================================================================================

- 문영A 에어컨 설치 준비(21시, 집)
1. 상배형이 직접 방문해서 상태 알아 보고 감 ==> 설치비 총 25만원 예상
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.05(수) 작업■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00  ==> 

- 본사 대기[★]
- Miplatform 분석
1. MiPlatform Ver3.2 교육동영상, MiPlatform 강좌(유투브) 
==============================================================================================================

- 2017.05.15_HDO_OffLine 수정 사항 
1. 엑셀에 넣고 빼기 추가
2. 문의
 1) Runtime에서 Grid 클릭시 새창 2번 뜸
 3) Grid 포커스가 된 체크 박스가 체크 안됨
 2) IE, Chrome 실행시 날짜 크기 달라짐 
==============================================================================================================

- 노튼 고스트(OS 최적화 툴 사용법
1. https://www.youtube.com/watch?v=A6tNabqdgNc
==============================================================================================================

- Win10 USB 부팅 디스크 만들기
1. 윈도우10 ISO 받기(/Win10_1703_Korean_x64.iso)  ==> 
Windows 10 다운로드(https://www.microsoft.com/ko-kr/software-download/windows10)에서 받기
 1) iso 받는 방법: 네이버에서 '윈도우10 다운로드' 조회  > '마이크로소프트에서 PC로 윈도우10 ISO 받기' 클릭
 > AMD 비쉐라 라이젠 사용자 모임 글 참조: http://cafe.naver.com/fx8300/71949
2. Rufus(rufus-2.15p.exe) 다운로드(Portable)  ==> https://www.techspot.com/downloads/6062-rufus.html
 1) rufus-2.15p.exe 실행 > rufus 2.15.1117(Portable) [새창]
  가. 먼저 USB 포터에 USB를 넣을 것
  나. 포맷 옵션: 부팅 가능한 디스크 만들기(ISO 이미지) 클릭 --> /Win10_1703_Korean_x64.iso 선택
  다. 파일 시스템: NTFS
  라. 새 볼률 레이블: 윈도우10 프로K
---------------------------------------------------------------------------------------------------------

- Win10 USB 부팅 디스크 다운로드 방법
1. https://www.youtube.com/watch?v=GdsB9mdAqwc
2. https://www.youtube.com/watch?v=zZfxcI5q27Y
3. 마이크로소프트에서 PC로 윈도우10 ISO 받기==> https://www.youtube.com/watch?v=7ttRWUlKkk0  
---------------------------------------------------------------------------------------------------------

- 윈도우10 정품인증
1. http://fatc.club/2017/03/01/173
1. http://charlesdepost.tistory.com/13
==============================================================================================================

- PC 구입 검토
01. MSI GE72VR-7RF Cobra Pro [+SSD 256G], 가격: 1,749,000원 ==> http://www.enuri.com/detail.jsp?modelno=15449706&cate=&IsDeliverySum=N
02. MSI CX62-i5 6QD SSD 240G+H1TB, 총16G(램8Gx2ea)(기존램회수) 가격: 855,900원 ==> http://www.enuri.com/detail.jsp?modelno=13081472&cate=&IsDeliverySum=N
11 삼성 DM700A4K-KN55 [SSD 500G(교체)] 일체형 PC, 가격: 618,500원원 ==> http://www.enuri.com/detail.jsp?modelno=12842718&condiDelivery=N
12. 삼성 올인원7 DM700A4L-L58S 일체형 PC, 가격: 1,198,000원 ==> http://www.enuri.com/detail.jsp?modelno=15465552&cate=0420&IsDeliverySum=N 
==============================================================================================================

- MSI GE60_2OE 사양(집에서 사용하는 노트북)에 메모리 추가 구입 검토
1. 현 상태: 하이닉스 DDR3 PC3L 8GB  메모리(슬롯 2개)
2. 구입 추천 상품: 하이닉스 DDR3 PC3L 8GB  메모리(슬롯 2개)
 1) 삼성 DDR3,12800 [8G], 가격: 71,160원 ==> http://www.enuri.com/detail.jsp?modelno=7835094&condiDelivery=N
 2) SK하이닉스 DDR3,12800, 노트북[8G], 가격: 82,300원 ==> http://www.enuri.com/detail.jsp?modelno=8879640&condiDelivery=N
==============================================================================================================

- 캐논 코리아 지원
1. 오태범 대표와 캐논 코리아(삼성역 8번 출구) 방문(차 얻어 탐): 14시
2. 캐논 코리아 회의
 1) 행자부 보안 점검에서 문제점 개선 지시 받음
 2) 지점/파트너(asp) 사이트: 로그인, 메인 화면
 3) 주문웹(java) 사이트: 로그인, 메인 화면 추가 ==> java로 개발(MS-SQL DB 사용)
  가. pwd 암호화(되어 있음)
  나. pwd 규칙(임계값, 자리수, 회수 제한)
  다. 투 팩트 인증: 휴대폰 인증 추가
  라. 세션 확인( 4시간 --> 1시간)
 ==> 1주일 지원하기로 함[07.06(목) ~ 12(수)] ==> 내일부터 출근
==============================================================================================================

- 회사 홈페이지(http://gidata.co.kr)
1. 관리자 화면 로그인 ==> http://gidata.co.kr/page/target.php?theme=login  ==> admin / adm1472
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.07.06(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:00  ==> 캐논 지원(삼성역), 첫 출근

- 캐논 행자부 감사 지원[★]
- 주문웹 개발 환경 설치
1. eclipse 셋팅
==============================================================================================================

- java 설치
1. jdk1.7.0_75  ==> 
JAVA_HOME ==> D:\workspace_canon\jdk1.7.0_75
path ==> D:\workspace_canon\jdk1.7.0_75\bin;
---------------------------------------------------------------------------------------------------------

- apache-tomcat  설치
1. apache-tomcat-7.0.75
==============================================================================================================

- 캐논 요구 사항 정리
1. 지점 / 파트너(asp) 로그인 화면  ==> 주문웹(java) 로그인 화면 
 ==> https://partner.canon-bs.co.kr/Agency/login.aspx   --> 대전1 / 대전센터1
2. 지점 / 파트너(asp) 메인 화면  ==> 주문웹(java) 메인 화면
3. 주문웹(java) 로그인시 투팩터 인증(휴대폰 인증)
https://cas.canon-bs.co.kr/jsp/front/main/mainpage.cn 
==============================================================================================================

- MS SQL Server 다운로드
1. SQL Server 2016 Expres Edition(/SQLServer2016-SSEI-Expr.exe) 설치(32비트 설치)
==> https://www.microsoft.com/ko-kr/sql-server/sql-server-2016 
2. SQL Server 2015 Express (32-bit) Edition(/SQLServer2016-SSEI-Expr.exe) 설치
==> http://download.cnet.com/Microsoft-SQL-Server-Management-Studio-Express-32-bit/3001-10254_4-75452284.html 
---------------------------------------------------------------------------------------------------------

- 주문웹 MS SQL Server 연결
Server name: 10.1.2.86
Login: dwebdev,
Pwd: dwebdev7$$2,
----------------------------------------------------------------------------

- 지점 / 파트너 MS SQL Server 연결
Server name: 10.1.2.142 
Login: canon_web,
Pwd: hooDcRuckworT54,
==============================================================================================================

- DB 세이퍼 Agent 연결
1. agency_dev, / agencydev1@3$,
==============================================================================================================

- 주문웹(java)
1. 기존 로그인 ==> localhost:8080/?xID=testid  --> /login/login.cn
 1) /canon_web/src/com/canon/login/LoginController.java   --> /login/login.cn
2. 수정 로그인 ==> http://localhost:8080/ --> /login/loginnNew.cn
2. 판촉정보조회(주문웹 메인) ==> /jsp/front/main/mainpage.cn --> /jsp/front/mainpage.jsp
==============================================================================================================

- 첫 화면 수정(/web.xml 파일에서)
1. AS-IS
  <welcome-file-list>
    <welcome-file>/login/login.cn</welcome-file>
  </welcome-file-list>

2. TO-BE
  <welcome-file-list>
    <welcome-file>/jsp/login.jsp</welcome-file>
  </welcome-file-list>
==============================================================================================================

- Websquare 분석(22시, 집)
1. 공통
D:\01. TAMA_DATA\02. TAMA Project\2016.05(휠라 코리아 차세대 통합ERP Proj)\FilaKoreaERP(2016.10.14)
\FilaKoreaERP\workspace\FilaKoreaERP\FilaKoreaERP.web-resources\src\main\webapp\wqui\cm/MDI.xml
==============================================================================================================
 
- 럭키부동산에서 전화
1. 문영아파트(1806호) 주인이 집 판다고 연락이 옴
 1) 매매가: 4억 5백 ==> 이사 못 간다고 통보함.
==============================================================================================================

- 퇴근 후 태용 만남
1. 석식(20시, 라면, 비빕밥): 청구할 것
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.07(금) 작업■■■■■■■■■■■■■■■■■■
---> 10:30 ~ 20:00  ==> 처가 체류연장 신청(9시), 캐논 코리아 출근(10:30)

- 캐논 행자부 감사 지원[★]
- 주문웹 로그인 개발
1. 메인(/main.jsp) 개발
2. 로그인(/login.jsp) 수정
 1) 인증 체크  ==> /main_i.aspx, /main_i.aspx.cs
==============================================================================================================

- 문자 보내기 SP
1. StoredProcedure [dbo].[SP_SMS_ORDER]
==============================================================================================================

- 로그 기록 테이블
1. [new_web].[dbo].[LOG_HISTORY](주문웹) --> Login_History(지점 / 파트너(asp))
==============================================================================================================

- 휴대폰 인증 추가
http://loveyu.co.kr/182
==============================================================================================================

- 통합 멀티 무료 SQL Editor DB 관리 프로그램 DBeaver
1. http://mastmanban.tistory.com/953
==============================================================================================================

- 처가 체류연장 신청(9시)
1. 체류기간(2016.08.09 ~2017.08.07)  ==> 이번이 마지막 연장(10개월만 연장 가능): 2017.08.08 ~2018.05.28
2. 방문일자(서울남부출입국관리사무소)  ==> 2017.07.07 09:00 ~ 09:10
---------------------------------------------------------------------------------------------------------

- 처가 체류연장 신청 @@@
06:00 기상
07:10 조식(라면)
07:50 집출발(장모, 장인, 루옌, 수종)
08:10 수종 어린이집 데려다 줌(루옌 회사 감)
08:15 대림역 정류장(654번 버스 탑승)
08:30 서울납부법원 정류장: 소나기 옴(우산 하나 밖에 없어서 장모님 비 많이 맞음)
08:45 서울출입국관리사무소(3층, 영등포구청 관할은 서울남부라고 함, 예약하고 감, 2명이면 2번 예약하라고 함)
	==> 장인, 장모 체류 연장 신청 서류 제출(수입인지 구입(2층): 12만원(처가에서 냄) 
	==> 주소지 확인서 작성(전세 계약서 사본 출력)
	--> 신청인은 장인, 장모명 기입, 사인할 것, 신청일자를 기입할 것
	==> 거주/ 숙소 제공 확인서 작성, 국내 체류 중 비취업 서약서 작성, 출국 서약서 장성(마지막 체류 연장 신청)
09:30 종료
09:40 택시(서울출입국관리사무소 -> 대림역): 6,500원
09:45 대림역 -> 삼성역
10:30 출근(캐논 코리아 본사: 삼성역 8번 출국)
12:40 중식(GS25)
13:00 업무
20:00 퇴근
20:40 석식(칼국수, 공주칼국수[대림역]): 청구할 것
21:00 귀가
23:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.08(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말
04:00 기상 
04:20 인터넷 서핑
08:10 조식(라면)
12:00 중식
12:30 집출발
12:40 대림역(6511번 버스) 승차
13:20 서울대학교 도착(수종 다른 도서관 가자고 해서 떼어 놓고 옴: 수종 울고 난리남)
14:30 관악문화도서관(1층: 어린이도서관): 수종에게 책 읽어 줌(읽었든 책 다시 가지고 옴)
15:00 만화 영화 상영(마이팻의 이중생활: 관악문화원(2층)
16:20 종료
16:50 서울대학교 승차
17:50 대림역 도착
18:00 귀가
19:30 석식
23:00 취침
==============================================================================================================

- 01. 홍상환이 스토리지(DSvideo, 영화): FTP 서버
1. 호스트(H): leftshutter.synology.me, 포트(P): 22
2. 프로토콜(T): FTP
2. 사용자(U): guest90, / 1234,
3. 기본 로컬 디렉토리(L): D:\91. So on\00. 외장메모리 Data\51. 영화
4. 기본 리모트 디렉토리(L): /storage/emulated/0/DSvideo
==============================================================================================================

- DBeaver 사용법
1. http://blog.naver.com/gmkjh74/220708432873 
2. http://lifeones.tistory.com/129
==============================================================================================================

- 투 팩트 인증
1. 정의: 인터넷망과 통신망 등 2개의 인증 채널을 함께 이용해 사용자 인증 절차를 밟는 것을 ‘2채널(또는 2팩터) 
인증’이라고 한다. 인터넷 뱅킹 시 공인인증서로 본인 확인을 하고 SMS나 ARS 등 통신망을 이용해 추가로 본인 
인증을 하는 방식이 대표적이다. 
http://ligilo.tistory.com/142
-------------------------------------------------------------------------------------------------------

- 휴대폰 인증 추가
http://loveyu.co.kr/182
1. 뿌리오 회원가입: 문자(sms) 인증 ==>  https://www.ppurio.com/mgr/DFUserJoin.qri?act=step3#
2. 회원가입 문자(sms) 인증 ==> http://m.blog.naver.com/exitno/80200139826 
3. 올크래딧 ==> www.allcredit.co.kr
4. 중랑구청 홈페이지 휴대폰인증을 통한 회원가입 동영상  ==> https://www.youtube.com/watch?v=xDC7CQv4eGg
5. 넷마블_아이디 찾기_휴대폰 인증 ==> https://www.youtube.com/watch?v=d2vgM_l_Ktk
==> 캐논 코리아  김지호(010-8011-6237, jhkim10@canon-bs.co.kr)에게 메일 보냄
==============================================================================================================

- ibatis 샘플 소스
1. 01. 로그인 조회(2016.05(휠라 코리아 차세대 통합ERP Proj))
==============================================================================================================

- 로또 5등 당첨
1. 번호 3개 맞음(5등 5천원: 5장 바꿈)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.09(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)
06:30 대림운동장(최선형과 같이 창고 가서 짐 나름, 최선형 감기 걸러서 일찍 귀가함, 법인카드 받음)
07:50 숏게임 
08:20 게임 ==> 3게임함
09:55 종료
10:00 S리그(30대, 대림3 0:6 철각천하): 후반 래프트 윙으로 출전
10:50 종료
11:20 중식(북어국: 우리 감자탕): 회에서 쏨[식대 26만원 나옴, 법인카드로 계산]
12:30 종료
13:10 강고문님댁 지하(강고문님에게 법인카드 전달< 식대영수증, LG25 음료수(3개) 영수증]
13:30 종료
13:40 귀가(소나기 맞으며 자전고 타고옴)
14:10 대림3동 조기회 서상배형 방문
14:20 에어컨 설치 시작
   - 1. 에어컨 본체 뜯기 
	- 2. 배관 연결
	- 3. 에어컨 배관 실외기 연결
	 1) 관 연결(저압관(굵은관) 배관 연결,고압관(얇은관) 배관 연결
	 2) 전선 연결
	 ==> 배수관 검정 테이프로 연결해서 물이 샐수 있다고 함(많이 새면 연락하라고함)
	 ==> 실외기 철사 구입해서 다시 한번 고정하라고 함
16:20 에어컨 설치 종료(설치비 25만원 써니뱅크 앱으로 송금해줌)
17:00 루옌 장모님 고속터미널까지 배웅하고 귀가
17:30 TV 시청
18:00 낮잠
20:00 기상
20:10 석식
22:00 취침
============================================================================================================== 

- 에어컨분리 설치방법
1. http://blog.daum.net/hl4ccq/24
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2017.07.10(월) 작업■■■■■■■■■■■■■■■■■■
---> 11:40 ~ 22:00  ==> 

- The K 손해보험 Prj 면담[★](08:30 ~10:30, 안국역)
1. 8시 30분: 스타벅스 안국점에서 LG CNS 직원(6명 만남)
 1) 강민수 부장(010-8619-8793, PM) 주제로 면담
 2) UI 컨설턴트(외주) 같이 옴
 3) 이번주 출근(7월 12월(목)) ==> 수행계획서 작업, WBS 작업
 4) 착수보고회: 다음주 월요일
 5) 프로젝트 1차 오픈: 12월 1일
 6) 10시: 프로젝트 사무실(삼환빌딩 6층) 방문, 고객 인사(The K 손해보험 전산팀) ==> 이사 첫날이라 어수선함
 7) G CNS 직원들은 내일부터 출근 ==> 나는 목요일부터 출근 예정
==============================================================================================================

- 캐논 행자부 감사 지원[★]
- 주문웹(OrdWeb) 로그인 개발
1. 로그인(/login.jsp) 수정
 1) 로그인 검사 조회(2017.07.07, by JTM)]  ==> LoginDao.getLogInChk
 2) 로그 기록 저장  ==> loginDao.login_history_save(loginVo);
==============================================================================================================

- ibatis openquery 에러(/LoginDao.getLogInChk)
1. 현상:
FROM AGENT A
WHERE LTRIM(RTRIM(A.id)) = #xID#    -- 아이디
AND A.passwd = (
			SELECT *
			FROM openquery([JIJUM_PARTNER], 'select [damo].dbo.[hash_str_data](''#pwd_enc#'')') 
			-- FROM openquery([JIJUM_PARTNER], 'select [damo].dbo.[hash_str_data](''eowjsrhror1'')')
			)   -- 비밀번호 
2. 현상2:
심각: Servlet.service() for servlet [Spring MVC Dispatcher Servlet] in context with path [] threw exception
[Request processing failed; nested exception is org.springframework.jdbc.BadSqlGrammarException: 
SqlMapClient operation; bad SQL grammar []; nested exception is com.ibatis.common.jdbc.exception.NestedSQLException:   
--- The error occurred in com/canon/login/login_SQL.xml.  
--- The error occurred while applying a parameter map.  
--- Check the LoginDao.getLogInChk-InlineParameterMap.  
--- Check the statement (query failed).  
--- Cause: com.microsoft.sqlserver.jdbc.SQLServerException: '@P1' 근처의 구문이 잘못되었습니다.] with root cause
com.microsoft.sqlserver.jdbc.SQLServerException: '@P1' 근처의 구문이 잘못되었습니다. 
2. 원인: openquery([JIJUM_PARTNER], 'select [damo].dbo.[hash_str_data](''#pwd_enc#'')')  ==> 때문에 나는 현상
3. 조치: openquery([JIJUM_PARTNER], 'select [damo].dbo.[hash_str_data](''#pwd_enc#'')') ===> 부분을 프로시져로 생성
---------------------------------------------------------------------------------------------------------

- ibatis에서 MSSQL OPENQUERY이용하기  ==> http://labj.tistory.com/84
0. ORACEL 접속을 링크드서버 쿼리문
SELECT TREEID, TREENM FROM
OPENQUERY(CICHUB, 'SELECT CRSNM as treeId,CRSCD as treeNm FROM ECD_HRD_CRSMAS WHERE CRSCD = ''G2Z20020254'' ')
 
SELECT *
FROM openquery([JIJUM_PARTNER], 'select [damo].dbo.[hash_str_data](''eowjsrhror1'')')

1. mssql 프로시저 생성
create proc sp_user3
@age varchar(50) 
as 
begin 
declare @str varchar(500)
set @str=
'SELECT TREEID, TREENM FROM '+
'OPENQUERY(CICHUB, ''SELECT CRSNM as treeId,CRSCD as treeNm FROM ECD_HRD_CRSMAS WHERE CRSCD = '''''+@age+''''''')'
exec(@str)
end

create proc sp_pwd_enc
@pwd_enc varchar(50) 
as 
begin 
declare @str varchar(500)
set @str=
'SELECT pwd_enc FROM '+
'OPENQUERY([JIJUM_PARTNER], ''SELECT [damo].dbo.[hash_str_data]('''''+@pwd_enc+''''')'')'
exec(@str)
end
;
==> EXEC [sp_pwd_enc] '1245'
==> jCRLNwdHwZMKTglnJUd43btp9qQJ5ivuvl+SGRoJo6E=

2. ibatis xml 변경
select id="breakFiller.test"  resultClass="breakFiller" parameterClass="java.lang.String"
  sp_user3 #seqNo#
 
3. DAO 단 소스
public List test()throws Exception {  
	 String seqNo = "G2Z20020254";  
	 return getSqlMapClientTemplate().queryForList("breakFiller.test",seqNo);
}

4. 쿼리결과 (DB data에 따라서 다를 수 있습니다.)
Result: [초급 영어회화-여행편, G2Z20020254]
==============================================================================================================

- 휴대폰 인증(/HpCert) 추가
1. 휴대폰 인증 여부 확인 
----------------------------------------------------------------------

- 전화번호 수정(/UsrMngm_sqlmap.xml 파일에서)
 <update id="updateUsrMngmInfo" parameterType="HashMap">
UPDATE /* kr.co.fila.cm.dao.UsrMngmDAO.updateUsrMngmInfo - 사용자관리 수정(/UsrMngm_sqlmap.xml) */  
CM_USR
SET 	USR_NM = #{usrNm}      		-- 사용자명 
		, USR_KD = #{usrKd} 	 		--사용자구분 
		, EML_ADDR_DIV1_1 = substr(#{emailAddr1}, 0, INSTR(#{emailAddr1}, '@')-1)	 		--이메일주소-1-id 
		, EML_ADDR_DIV2_1 = substr(#{emailAddr1}, INSTR(#{emailAddr1}, '@')+ 1, LENGTH(RTRIM(#{emailAddr1})))		--이메일주소-1-도메인주소
		, EML_ADDR_DIV1_2 = substr(#{emailAddr2}, 0, INSTR(#{emailAddr2}, '@')-1)	 		--이메일주소-2-id
		, EML_ADDR_DIV2_2 = substr(#{emailAddr2}, INSTR(#{emailAddr2}, '@')+ 1, LENGTH(RTRIM(#{emailAddr2})))		--이메일주소-2-도메인주소
		 
		, TEL_NO_DIV1_1 = substr(#{hpNo} ,0, instr(#{hpNo} ,'-',1,1)-1)								--전화번호-1-지역번호(휴대폰)
		, TEL_NO_DIV2_1 = substr(#{hpNo}, instr(#{hpNo},'-',1,1)+1, instr(#{hpNo},'-',1,2)-instr(#{hpNo},'-',1,1)-1)	 	--전화번호-1-국번
		, TEL_NO_DIV3_1 = substr(#{hpNo}, instr(#{hpNo},'-',1,2)+1,15)								--전화번호-1-번호 

		, TEL_NO_DIV1_2 = substr(#{telNo} ,0, instr(#{telNo} ,'-',1,1)-1)								--전화번호-2-지역번호(내선)
		, TEL_NO_DIV2_2 = substr(#{telNo}, instr(#{telNo},'-',1,1)+1, instr(#{telNo},'-',1,2)-instr(#{telNo},'-',1,1)-1)	 	--전화번호-2-국번
		, TEL_NO_DIV3_2 = substr(#{telNo}, instr(#{telNo},'-',1,2)+1,15)								--전화번호-2-번호 

		, UPDT_PG_ID = #{GV_PROGRAM_ID} 	 --수정프로그램ID  
		, UPDT_ID = #{GV_USR_ID}  				--수정자 
		, UPDT_DTTM = SYSDATE  					--수정일시 
WHERE 1=1
	AND USR_ID = #{usrId}    -- 사용자ID
 </update>  
==============================================================================================================

- MSSQL 주석달기  ==> http://tennesseewaltz.tistory.com/249
1. 주석추가 (add)
--테이블
EXEC   sp_addextendedproperty 'MS_Description', '테이블설명', 'user', dbo, 'table', 테이블명
--컬럼들
EXEC   sp_addextendedproperty 'MS_Description', '컬럼설명', 'user', dbo, 'table', 테이블명, 'column', 컬럼명

 2. 주석수정 (update)
--테이블
EXEC   sp_updateextendedproperty 'MS_Description', '테이블설명', 'user', dbo, 'table',테이블명
--컬럼들
EXEC   sp_updateextendedproperty 'MS_Description', '컬럼설명', 'user', dbo, 'table', 테이블명, 'column', 컬럼명
==============================================================================================================
 
- 자바 랜덤함수(Java Random)
1. http://library1008.tistory.com/44

- Java/자바] 특정 범위의 숫자(정수) 랜덤 출력: Random Range Min Max  ==> 5자리 난수 발생 소스
1. http://mwultong.blogspot.com/2007/02/java-random-range-min-max.html
public class Example {
  public static void main(String[] args) {
    // 3에서 12까지 범위의 정수를 랜덤하게 20개 출력
    for (int i = 1; i <= 20; i++)
      System.out.println(randomRange(3, 12)); 
  }
}

- 자바 랜덤함수 중복제거 ==> https://www.google.co.kr/#q=%EC%9E%90%EB%B0%94+%EB%9E%9C%EB%8D%A4%ED
%95%A8%EC%88%98+%EC%A4%91%EB%B3%B5%EC%A0%9C%EA%B1%B0
https://okky.kr/article/221479
http://mainia.tistory.com/630
http://computersj.tistory.com/entry/JAVA-random-%EB%9E%9C%EB%8D%A4-%ED%95%A8%EC%88%98
==============================================================================================================

- java 타이머(3분)
1. http://rebellion21.tistory.com/21
2. 타이머 만들기  ==> http://junemoon.tistory.com/107
<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.8.0/jquery.min.js"></script>

<script language="javascript"> 
	$(document).ready(function(){
		//초기값
		var hour = 1;
		var minute = 0;
		var second = 2;
		
		// 초기화
		$(".countTimeHour").html(hour);
		$(".countTimeMinute").html(minute);
		$(".countTimeSecond").html(second);
		
		var timer = setInterval(function () {
			// 설정
			$(".countTimeHour").html(hour);
			$(".countTimeMinute").html(minute);
			$(".countTimeSecond").html(second);
			
			if(second == 0 && minute == 0 && hour == 0){
				alert('타이머 종료.');
				clearInterval(timer); /* 타이머 종료 */
			}else{
				second--;
				
				// 분처리
				if(second < 0){
					minute--;
					second = 59;
				}
				
				//시간처리
				if(minute < 0){
					if(hour > 0){
						hour--;
						minute = 59;
					} 
				}
			}
		}, 1000); /* millisecond 단위의 인터벌 */
	});  
</script>

</head>
<body>
	<div>
		<strong>시간 카운트</strong>
		<span class="countTimeHour">60</span>시
		<span class="countTimeMinute">60</span>분
		<span class="countTimeSecond">60</span>초
	</div>
</body>
</html> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.11(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 22:00  ==> 

- 캐논 행자부 감사 지원[★]
- 주문웹(OrdWeb) 로그인 개발
1. 휴대폰 인증 개발
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.12(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 22:00  ==> 철수

- 캐논 행자부 감사 지원[★]
- 주문웹(OrdWeb) 로그인 개발
1. 휴대폰 인증 개발 ==> 완료 @@@
2. 자원이행(2017.07.12).xls 파일  작성 ==> 소스 이관 
==============================================================================================================

- 주문웹(OrdWeb) 추후 개발 분량
1. 회원가입(/membershipRegist.jsp)
2. 비밀번호 5번 실패 후 메일 보내기
3. 비밀번호 변경일(3달)이 경과 팝업
==============================================================================================================

- 캐논 메인 정보
1. 지점 / 파트너(asp) 로그인 화면  ==> 주문웹(java) 로그인 화면 
 ==> https://partner.canon-bs.co.kr/Agency/login.aspx   --> eowjs1, / eowjstpsxj1, 대전1 / 대전센터1
--> 대전1 / eowjs고객1
1. agency_dev, / agencydev1@3$,
2. DR: jhkim10 / iop1357642, 
--> 20110182, jhryu[대리점_11]
--> 000442[직원_41]
2. 지점 / 파트너(asp) 메인 화면  ==> 주문웹(java) 메인 화면
3. 주문웹(java) 로그인시 투백트 인증(휴대폰 인증)  
===> 지점 / 파트너(asp) 담당자: 최민영 대리(마케팅)
==============================================================================================================

- target 정의
target : 해당 처리가 보내어져 처리될 위치.(쉽게 말해 현재페이지인지, 팝업인지, iframe인지)
action : 현재 폼의 정보를 어떤 페이지에서 처리하게 할건지(a_proc.jsp 인지 b_proc.jsp 인지)
--------------------------------------------------------------------------------------------

a.target="_self" : (default) 현재창에 표시
area.target="_blank" : 새로운 창에 표시
base.target="_parent" : 부모창에 표시
form.target="_top" : 윈도우 최상위에 표시
link.target="_search" : 브라우저의 검색창에 표시
==============================================================================================================

- 비밀번호 변경일(3달)이 경과 팝업
1. agent 테이블에서 확인 ==> Pass_Reg_Date
2. 1달을 3달로 변경할 것 
 1) /main_i.aspx파일에서
if ("<%=pwdChange%>" == "OFF") {
	mainForm.action = "<%=System.Configuration.ConfigurationManager.AppSettings["ckbsHTTPS"].ToString()%>/AGENCY
	/password_edit.aspx";
	mainForm.target = "_parent";
	mainForm.submit(); 
} 
==============================================================================================================

- 2개 팝업 호출(/hpCert.jsp 파일에서)
<script type="text/javascript">   
<!--  
	var rtnMsg = '${rtnMsg}';
 
	if(rtnMsg != "")  // 로그인 에러 체크
	{
		if(rtnMsg == "0" || rtnMsg == "1" || rtnMsg == "2") 	// 휴대폰 인증 화면 팝업 처리 이면
		{ 
			pop_hpCertPop();
		}  
		else if(rtnMsg == "9") 	// 휴대폰 인증 통과 이면(메인 화면으로 이동)
		{    
			alert("휴대폰 인증에 성공했습니다.");
			
			window.close(); 	// 현재창 닫기 
			opener.location.href = "/login/loginMain.cn";   // 메인 화면으로 이동(팝업창에서 부모창으로 이동)
		} 
		else
		{
			alert(rtnMsg);
		}
	}
  
	//팝업 호출 함수
	function pop_hpCertPop()
	{ 
		var width = 380;
		var height = 360;
		var sw=screen.availWidth;                           
		var sh=screen.availHeight;  
		var px=(sw-width)/2;
		var py=(sh-height)/2;
		var popUpUrl = "";		
		var set='top='+py+',left='+px;
		set+=',width='+width+',height='+height+
		',toobar=0,resizable=0,status=0, scrollbars=0';
		
		if(rtnMsg == "0") 	// 휴대폰 인증 실패 이면
		{   
			alert("입력한 본인인증번호와 전송된 인증 문자와 다릅니다.\다시 한 번 확인 하세요.");  
 
			location.href = "/jsp/common/hpCertPop_2.jsp"; 	// 로그인 화면으로 이동
		} 
		else if(rtnMsg == "1") 	// 휴대폰 인증 화면 팝업 처리 이면
		{ 
			popUpUrl = "/jsp/common/hpCertPop.jsp";  
			window.open(popUpUrl,'', set);   // 새창 팝업(처음에만 열 것)
		}
		else if(rtnMsg == "2") 	// 휴대폰 인증2 화면 팝업 처리 이면
		{   
			location.href = "/jsp/common/hpCertPop_2.jsp"; 	// 로그인 화면으로 이동
		} 
	} 
	//--> 
</script>

<script type="text/javascript">	
<!--  
	mainForm2.rand_padding.focus();   // 인증번호에 포커스 주기
//--> 	
</script>
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.13(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==> 첫 출근

- The K 손해보험 영업지원시스템 구축 Prj[★]
1. 
==============================================================================================================

- The K 손해보험 입사 정보 등록
1. 지문 등록 완료
2. 소속: 에코시스템(응용PL 임명[8월에 구부장 올 때까지])...진태만 사번: 517006
 1) 메신저 로그인: 5170065 / tama339@  --> 메신저 내일부터 로그인 가능(암호화 파일 안 열림)
 2) 파일서버 로그인: f5170065 / tama339@
3. DB 사용: Sybase
 1) 신규: 디비 쿼리
 2) 기존: RFC 호출
==============================================================================================================
 
- 크롬 stand alone 다운로드
1. http://gent.tistory.com/50
2. https://www.google.com/chrome/browser/desktop/index.html?standalone=1
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.14(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:30  ==> 중식(한방삼계탕(2만원), 한정식집): 오태범 사장이 쏨

- The K 손해보험 영업지원시스템 구축 Prj[★]
1. 수행계획서 작성(오태범 사장이 도와줌)
2. WBS 작성(오태범 사장이 도와줌)
3. 이력서 작성
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.15(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 22:00  ==> 캐논 코리아 토요근무 지원, DB 연결 안됨(15시 ~ 17시): 캐논 공장에서 작업 한다고 함

- 회원가입(/membershipRegist.jsp)
==> 회원수정(/mycanoninfo.jsp) 
/AgentController.java
@RequestMapping(value = "/admin/agent_infoUpdate2.cn")  
==============================================================================================================

- 패스워드 변경주기 설정
1. /LoginController.java  --> hpCertRslt()
chk_rslt =  loginDao.getRand_padding_Chk(loginVo); 	// 휴대폰 문자 난수 체크 검사
System.out.println("[/LoginController.java] [hpCertRslt()] [chk_rslt]"+ chk_rslt );

if(chk_rslt != null)   // 로그인 검사 정보 조회 결과가 존재하면(휴대폰 인증 통과)
{   
	System.out.println("[/LoginController.java] [hpCertRslt()] [01. 휴대폰 인증 통과] --> [chk_rslt]"+ chk_rslt );
	
	loginDao.rand_padding_up(loginVo); 		// 인증 여부 저장
	 
	chk_result =  loginDao.getLogInChk(loginVo); 	// 로그인 검사

	if(chk_result != null)   // 로그인 검사 정보 조회 결과가 존재하면
	{   
		db_pwdChange = chk_result.getPwdChange();	// 비밀번호 변경일 경과 여부(추가: 2017.07.07, by JTM)  
		pwdChange = db_pwdChange;

		if(chk_result != null)   // 비밀번호 변경일 경과 여부 d

		model.addAttribute("rtnMsg",  "8");  	// 메인 화면으로 이동( ==>  비밀번호 변경일 창 팝업 처리)
	}
	else
	{
		model.addAttribute("rtnMsg",  "9");  	// 메인 화면으로 이동( ==> 휴대폰 인증3 화면 팝업 처리)
	}
	
	rtnUrl = "/jsp/hpCert.jsp"; 		// 메인 화면으로 이동     
} 
==============================================================================================================
 
- 테스트 중간 점검
NO	테스트 항목	결과	비고
1	핸드폰 인증을 통한 로그인	√	창 크기 확인 필요
2	패스워드 암호화 알고리즘 적용(SHA256)	√	로그인시 이상 없음. 회원가입시 SHA256 적용해서 비밀번호 저장 필요
3	패스워드 변경주기	X(기존 사이트 소스 존재)	agent 테이블의 pass_reg_date를 한 달전으로 수정하고 로그인 했으나 팝업 창 안뜸.
4	패스워드 임계값(5회)	X	5회 초과시 비밀번호 찾기 기능 유도 필요
5	이전 패스워드 사용불가	X	비밀 번호 변경 시 이전 패스워드 사용 불가 알림
---------------------------------------------------------------------------------------------------------------

- 회원가입 시 수정되어야 할 사항			
NO	항목	의견	
1	회원에 대해 승인 절차 필요	"기존 파트너 사이트 : 회원가입 된 대리점에 대해 승인을 넣어줘야 로그인이 가능.
승인을 넣어줘야하는 기능과 agent에 승인구분값 필드 필요.
대리점정보 수정화면 활용 가능."	
2	회원 가입 화면 변경	"사장과 사원으로 화면이 구분되어 있는데 사원화면은 필요없음.
회원가입시 셀렉트박스로 해서 사장과 사원만 구분해주면 됨(AGENT의 CEOID_Y 구분값 : Y(사장) N(사원) )"	
3	패스워드 규칙(2종 10자리)	기존 회원가입 소스 존재	
4	비밀번호 찾기 기능		
==============================================================================================================
 
- 비밀번호 변경일(3달)(/password_edit.jsp)이 경과 팝업
LoginVO chk_pwd = new LoginVO();
chk_pwd =  loginDao.getPwdChk(loginVo); 	// 비밀번호 암호화 
 
if(chk_pwd != null && chk_pwd.getPwd_enc("OFF") )   //  비밀번호 변경일 경과 여부가 OFF 이면
{ 
	loginVo.setPwd_enc(chk_pwd.getPwd_enc());			// 비밀번호 암호화 loginVo에 적용
	System.out.println("[/LoginController.java] [loginOrdWeb()] [암호화된 비밀번호] ===> [getPwd_enc())]"+ 
		chk_pwd.getPwd_enc() +"[getPwd_enc()_31]"+ loginVo.getPwd_enc() );   
} 
---------------------------------------------------------------------------

if(chk_rslt != null)   // 로그인 검사 정보 조회 결과가 존재하면(휴대폰 인증 통과)
{   
	System.out.println("[/LoginController.java] [hpCertRslt()] [01. 휴대폰 인증 통과] --> [chk_rslt]"+ chk_rslt );

	loginDao.rand_padding_up(loginVo); 		// 인증 여부 저장

	model.addAttribute("rtnMsg",  "9");  	// 메인 화면으로 이동( ==> 휴대폰 인증3 화면 팝업 처리)
	rtnUrl = "/jsp/hpCert.jsp"; 		// 메인 화면으로 이동     
}
==============================================================================================================

-- 01. 휴대폰 인증 정보 TB 추가 @@@@@
ALTER TABLE dbo.AGENT
ADD  MngrAprvYn CHAR(1)  DEFAULT 'N'    NOT NULL ,  
;
--------------------------------------------------------------

-- 61. 휴대폰 인증 정보 수정 @@@   
UPDATE dbo.AGENT
SET 
WHERE MngrAprvYn = 'Y'   -- 관리자 인증여부
;  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.16(일) 작업■■■■■■■■■■■■■■■■■■
---> 13:20 ~ 22:00  ==> 캐논 코리아 토요근무 지원, 석식(18시): 캐논 김지호씨가 사줌

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장): 비 조금 옴
06:30 대림운동장(최선형과 같이 창고 가서 짐 나름)
07:50 숏게임 
08:20 게임 ==> 3게임함
09:50 종료
10:20 대림3동 조기회 임시 총회(회원 부상 지원, 공익 사고 지원, 운동장 신청간 회원 조식 지원)
10:20 중식(삼계탕(2 그릇):  다솜 식당): 회에서 쏨
12:00 종료
12:10 귀가
12:30 집출발
12:40 대림역
13:20 캐논 코리아 도착
13:20 캐논 프로그램 개발 
18:00 석식(치즈 돈가스): 캐논 김지호씨가 사줌
22:10 종료 
22:20 퇴근
23:00 CU 편의점(도시락, 빵): 회사에 청구할 것
23:10 귀가
00:00 취침
============================================================================================================== 

- 캐논 행자부 감사 지원[★]
- 아이디/비밀번호 찾기
1. 아이디/비밀번호 찾기(대리점 회원)(/pop_pwd_findAgent.jsp) 
2. 아이디/비밀번호 찾기(임직원회원 회원)(/pop_pwd_findEmp.jsp)  
==============================================================================================================
 
- 회원가입/membershipRegist.jsp)
1. ID 중복 체크(/pop_id_check.jsp)
==============================================================================================================
 
- 패스워드 변경 주기
1. 패스워드 변경(/password_edit.jsp)  
2. 1달 후 비밀번호변경일(pass_reg_date)을 체크하여 30일이 자났으면  패스워드 변경(/password_edit.jsp) 화면에서
패스워드를 변경하게 처리
==============================================================================================================

- 로그인 시도 횟수(5회) 제한 
1. -로그인 시도시 마다 1씩 증가 시켜, 시도 횟수가 5보다 큰 경우 일정 시간(30초) 동안 로그인 기능이 잠금 상태가
되도록 한다.
==============================================================================================================
 
- 회원정보 수정(/member_edit.jsp)
1. 비밀번호 변경
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.17(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30  ==> 

- The K 손해보험 영업지원시스템 구축 Prj[★]
- WBS 검토 및 재작성
1. 요구사항 정의 제외
==============================================================================================================

- 영입지원시스템 요구사항 회의(14시, 회의실)
1.
==============================================================================================================

- LG CNS 파트너 사이트 회원가입 
1. partnerplus.lgcns.com , DEV109094, / hptnwhd1212@  --> 회사명:에코소프트
==============================================================================================================

- 비밀번호 조합
https://partnerplus.lgcns.com/lgcns/pp/common/dev_login/portalIndex.dev
1. 캐논 코리아 김지호씨에게 메일로 보냄

- /portalIndex2.html 파일에서(01. 비밀번호 변경기간 경과\01. 비밀번호 변경기간 경과_files)
<script type="text/javascript">    
    if (frm.password.value.length == 0) 
    {
	alert("신규 비밀번호를 입력해주시기 바랍니다.");
	frm.password.focus();
	return false;
	}

    if(!frm.password.value.match(/^.*(?=^.{8,12}$)(?=.*\d)(?=.*[a-zA-Z])(?=.*[!,@,#,$,%,^,&,*]).*$/))
    {
        alert("신규 비밀번호는 문자,숫자,특수문자(!@#$%^&*) 세가지 조합으로 8자리 이상 12자리 이하로 만드십시오.");
        frm.password.value = '';
        frm.confirmPassword.value = '';
        frm.password.focus();
        return false;
        }
</script>
==============================================================================================================

- 지아이데이타 홈페이지 로그인
1. http://gidata.co.kr/page/target.php?theme=login  ==> admin, / adm1472
==============================================================================================================
  
- T멤버쉽 로그인
1. http://www.tworld.co.kr,   ==> admin, / hp수*17*1@
==============================================================================================================
 
- Load Library에 실패하였습니다. dll 에러 문의(Miplatform)
1. 현상: -2085617663:Load Library에 실패하였습니다. 해당 dll이 존재하는지 확인하십시요. [CyPrintAPI] 이런
메세지가 뜨는데요. 게시판에 나온 dll 파일 복사나 레지스트리경로 변경 등을 해봐도 해결이안됩니다. 
다른 해결방안이 있나요? 원인이 뭔지도 알려주세요
1. 조치:
아래 경로에 제공받으신 dll 파일을 위치시켜주시고
[PID 설치경로]
AppData\Local\TOBESOFT\MiPlatform320U\Component 
PID 개발툴에서 Global 탭의 EXTAPIS 상에서 첨부드린 캡처처럼 추가해보시기 바랍니다.
==> C:\Users\Administrator\AppData\Local\TOBESOFT\MiPlatform330U\Component
(AppData 폴더 안 보이면 폴더 속성에서 숨김 파일, 폴더 표시 체크할 것)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.18(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30  ==> 회식

- The K 손해보험 영업지원시스템 구축 Prj[★]
- UI공통(송성구 차장), 디자이너(심정보 차장) 투입
1. 내일 웹스퀘어 서버 셋팅
==============================================================================================================

- 영입지원시스템 요구사항 회의(13:30, 6층 회의실) 
==============================================================================================================

- 형상관리(Harvest) 매뉴얼 요청
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.19(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 야근

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 장기보험 시스템 서버(AIS-IS, MP) 셋팅
- 영입지원시스템 시스템 서버(AIS-IS, 웹스퀘어) 셋팅 
==============================================================================================================

 - 영입지원시스템 요구사항 회의(13:30, 6층 회의실)
==============================================================================================================

- 90. 크롬(캐시D)
1.chrome://settings/clearBrowserData
==============================================================================================================

- 현장대리인 역량 강화 (자율학습) 동영상 청취
1. http://partnercampus.lgcns.com 접속 > log-in > 현장대리인 교육 수강 ==> DEV109094 / hpxoaks1708!@ 
2. LG CNS ‘한섬 ERP 재구축’에 참여하게 된 협력회사 ‘(주)투비소프트’의 현장대리인으로 선임 
==============================================================================================================

- 파일 전환 프로그램
http://www.nchsoftware.com/software/ko/converters.html
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.20(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 주간보고(10시)

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 영입지원시스템 시스템 서버(AIS-IS, 웹스퀘어) 셋팅 
==============================================================================================================

- 장기보험 시스템 서버(AIS-IS, MP) 셋팅
1. 톱캣 서버 설치, Sybase DB 연결[현재 서버 환겨: WebToB(웹서버), JEUS(WAS 서버), Sybase(DB 서버)
2. 로컬 서버 셋팅은 정보시스템부에 요청함(예전 인스웨이브 출신 현업[장장환 과장)이 서버 환경 셋팅 하기로 함
 1) 1주일 정도 걸린다고 함  ==> 개발 서버 Frameowrk(Pro-works)가 서버용이라 로컬 서버에 설치된다는 보장이 
없다고 함
 2) 개발서버에 터미널로 직접 연결하여 로그 파악하며 작업하는 것으로 잠정 결정함
==============================================================================================================

- 주간보고 회의(10시, 회의실)
1. 개발 서버 작업 지원 요청
==============================================================================================================

- 영입지원시스템 요구사항 회의(13:30, 6층 회의실)
==============================================================================================================

- WS5_SAMPLE 셋팅
1. 인스웬이브 교육 샘플 자료(송성구 차장이 셋팅, 교육까지 해줌)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.21(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00 4

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- WS5_SAMPLE 분석
1. Websuare 소스 분석
==============================================================================================================
  
- 영입지원시스템 요구사항 회의(13:30, 6층 회의실)
1. 이문선 부장 휴가라 불참
==============================================================================================================
 
- 기간계 개발 환경 설치 방법 자료 작성
1. 01. 기간계 개발 환경 설치 방법[2017,07.21 기준).SQL
==============================================================================================================
 
- 기간계시스템 접속을 위한 접속
1. OTP 사용
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.22(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말
06:00 기상 
06:20 WS5_SAMPLE 분석
08:10 조식
11:00 진료(서울가정의학과의원): 수종 열남
11:10 조제(래미안 나나 약국): 수종 열남
11:20 중식(햄버거: 롯데리아: 루옌이 쏨) 
11:30 구로리 놀이터(수종)
12:30 귀가
14:20 낮잠
17:00 기상 
18:00 (주)이마트구로점(피자) 
19:00 귀가
19:30 석식
23:00 취침
==============================================================================================================

- MariaDB 테이블 수정 명령어(ALTER)
http://knoow.tistory.com/m/90
==============================================================================================================

- 파일 폴더 이름 한꺼번에 일괄변경 DarkNamer 프로그램
http://prolite.tistory.com/771
==============================================================================================================

- LG CNS 보안 서약서 작성: 완료 @@@
http://securityplus.lgcns.com/index.html
==============================================================================================================

- SQL 문법
1. Oracle SQL
select * from tabA, tabB
where tabA.colA = tabB.colB(+)
;
------------------------------------------------------------------

 2. Ansi SQL
select * from tabA left outer join tabB
on tabA.colA = tabB.colB
;
==============================================================================================================

- 에어컨 전기세 줄이는 방법
https://www.youtube.com/watch?v=DfGL0hp0vB8
1. 처음엔 18도로 설정하여 10분 정도 틀어놓음
2. 10분 후 26도 설정
------------------------------------------------------------------

- 에어컨 전기세 절약하는 방법
https://www.youtube.com/watch?v=XBB2916aoxs
==============================================================================================================
 
- 수종 건강검진 사전 검사지 작성: 완료 @@@
1. 수종 건강검진(9시, 명소아과) --> 예약하고 감(문진표 작성, 발달선별검사지 작성[인터넷으로 미리 작성]) 
2. 검강N 사이트 ==> http://hi.nhis.or.kr 
 1) 문진표/ 발달선별 검사지 작성
==============================================================================================================

- WS5_SAMPLE 소스 분석(6시, 집)
1. 코드관리(BM001M01.xml) 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.23(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
04:00 기상
04:10 S5_SAMPLE 소스 분석
06:00 집출발(도보) 
06:20 대림운동장(창고 갔다가 짐 차에 실음)
06:30 대림운동장 출발(동주형 차)
07:40 화성 송추운동장 도착 
08:20 게임(만남FC[77번, 25번, 8번], 도신FC) ==> 2게임함(만남FC에 농락 당함)
12:30 종료 
12:40 중식(칼국수: 중앙 회센타 식당): 회에서 쏨
13:40 종료
13:40 화성 출?(최선형 차)
15:10 강고문님댁 지하(구리선 얻어 옴, 경기부 구청장배 협의]
		==> 9월 3일(일)구청장배 대회 예정
17:30 종료
17:50 귀가  
19:00 석식(오뚜기 콩국수라면)
21:00 취침
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2017.07.23(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==>  

- The K 손해보험 영업지원시스템 구축 Prj[★]  
- WS5_SAMPLE 소스 분석
1. websquare 소스 분석
==============================================================================================================

- [요청] 장기보험시스템(AS-IS) 산출물 자료 요청
1. 장기보험시스템(AS-IS) 산출물 중 화면정의서, 화면설계서, 사용자메뉴얼 자료 요청 ==> 제대로 못 받음
==============================================================================================================
 
- 장기보험 시스템 서버(AIS-IS, MP) 셋팅
1. 로켈 서버 셋팅은 정보시스템부에 요청함(예전 인스웨이브 출신 현업(장창환 과장)이 서버 환경 셋팅 하리고 함)
2. 8월 말 와뇰 예정이고 서버용 복잡한 모듈이 많아서 개발서버에 설치된다는 보자이 없다고 함
3. MiPlatform에서 소스 수정 마음데로 할 수있고 JAVA 파일 수정시 개발서버에 STGClient를 사용하여 올리면 됨
==============================================================================================================

- 개발서버 로그
jeus@scm_dev:/home/tmax> log_common       ===> 로그 보기 @@@
jeus@scm_dev:/home/tmax> restart_common       ===> 서버 재시작 @@@

jeus@scm_dev:/home/tmax> alias
jeus@scm_dev:/home/tmax> tail -f /home/tmax/jeus/logs/scm_dev/scm_dev_long01/scm_dev_long01_20170725.log  ===> 로그 보기 @@@ 
==============================================================================================================
 
- 산출물 관련 회의(16시)
1. 오태범 사장이 내부인터페이스정의서 작성하라고 함
2. 원래 WBS Task에는 없는 내용이고 개발에 영향을 미친다고 분명히 이야기 했는데도 작성하라고 지시함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.25(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==>  

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 내부인터페이스정의서 작성
1. 총: 11건 완료
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.26(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 중식(돈까스, 메이 차이나 식당, 심차장, 송차장, 최차장): 오태범 사장이 쏨

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 내부인터페이스정의서 작성
1. 총: 40건 완료
==============================================================================================================

- 주간보고 회의(14시, 회의실)
1. 내부인터페이스정의서 우리 롤이라고 함 ==> 오사장에게 전화해서 업무가 너무 과중해서 내부인터페이스정의서를
작성하라고 하면 철수한다고 화를 냄
==============================================================================================================
 
- 전환 툴(w-crart) 인력 투입
1. 인스웨이브 김원홍 부장 투입
2. 기보험 시스템 서버(AIS-IS, MP) 공통함수는 별도로 만들어야 한다고 함
==============================================================================================================
 
- Websquare에서 로그 설정
1. /config.xml 파일에서 console을 true에서 false로 바꾸면 브라우저에서 console.log만 사용해야 함(log 줄어듬)
<debug value="true" remoteConsole="false" console="false"/>   //===> console="true" --> console="false"
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.27(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 착수보고회(10:30, 7층 대회의실), 회식(18:20 ~ 21:30, 마산 아구찜)

- The K 손해보험 영업지원시스템 구축 Prj[★] 
- 기간계 선반영 후 변혼 항목 일정 요구
1. 8월말까지 기간계에서 개발 완료 요청 메일 샘플 PM에게 보냄
 1) PM이 컨펌 메일 보내면 고객에게 메일 보낼 것
==============================================================================================================
 
- 오태범 면담(12시, 커피?)
1. 내부인터페이스정의서 작성은 안해도 된다고 함 
2. PL 역할 오사장이 직접 한다고 함(매주 수요일 오전까지 주간보고서만 작성할 것)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.28(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 

- The K 손해보험 영업지원시스템 구축 Prj[★]  
- WS5_SAMPLE 소스 분석
1. websquare 소스 분석
==============================================================================================================

- 관리 화면(TO-BE) 문제점 논의
1. 권한 조회, 사원 및  메뉴 권한조회 ==> 메뉴 등록 화면이 없음, 기타 관리자 화면이 없음 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.07.29(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말
04:00 기상
04:20 TamaERP 작업(websquare 기반)
09:10 미장 잡부 일 요청(승중이형 부탁, 보라매역 4번 출구) 
09:40 집출발 
09:50 택시 
10:10 보라매역 4번 출구 도착(영등포구 신길6동 621, 3층)
10:20 미장 잡부 일 시작(시멘트 40kg짜리 10개 나르기, 구멍난 곳 시멘으로 매우기)  --> 너무 힘듬
11:00 김밥(2줄)
12:00 중식(제육볶음): 형수님이 쏨
13:00 3층 옥상 페인트 벗기기
18:40 종료(형수님이 수고 했다고 일당 11마원 줌)
18:55 보라매역 5번 출구(654번 버스)
19:20 대림역 도착
19:20 귀가(머리에 시멘트가 굳어서 씻어냄)
20:00 석식(오뚜기 콩국수 라면)
21:00 취침
==============================================================================================================

- MariaDB 날짜 함수
http://blog.iotinfra.net/?p=1262
==============================================================================================================

- Sybase 기본 문법
http://crosstheline.tistory.com/m/55
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.30(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구
06:00 기상(너무 피곤해서 누워 있음)
07:20 자전거(문영APT -> 대림운동장)
07:30 대림운동장 
08:20 게임(문일 조기회) ==> 2게임함(공격수랑 부딪쳐서 오른쪽 무플 부상)
		--> 마지막 게임 왼쪽 윙으로 뜀
11:50 종료 
12:10 중식(국밥: 서울식당): 회에서 쏨
13:30 종료 
13:30 종료
13:40 귀가(루엔 친구랑 놀러감)
14:00 TV 시청 
18:00 빵(15개), KT멤버쉽 카드 30% 할인(정가: 23,800원 --> 16,660원)
20:00 석식(냉면)
22:00 취침
============================================================================================================== 
 
- CJ ONE 카드 재발급
http://www.cjone.com, tamario/hp수*16*1@
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.07.31(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 21:00  ==> 

- The K 손해보험 영업지원시스템 구축 Prj[★]  
- TamaERP 분석
1. 기존 websquare 소스 분석
==============================================================================================================
 
- 전환 툴(w-crart) 인력 추가 투입
1. 인스웨이브 김원홍 부장이 전환 툴(w-crart) 전환 작업 성공적이였다고 자평함
 1) 오사장이 TO-BE 전환 툴 보다 성능이 못하다고 함
 2) 인번주에 1차 전환을 마무리 한다고 함
==============================================================================================================

- 로그인 화면 화면정읫 작성
1. 오사장과 협의하여 만듬 ===> TKI-CBS-A-07(화면정의서-CBS001M.로그인)-V.1.0.xlsx
==============================================================================================================

- FILA KOREA workspace 에러(eclipse에서)
1. 현상: An error has occurred when activating this view java.lang.NuuPointerException
2.  조치: eclipse에서
File > Switch workspace > other: 클릭
workspace: D:\FilaKoreaERP\workspace  --> OK: 클릭
==============================================================================================================

- FILA KOREA workspace 에러(eclipse에서)
1. 현상: An error has occurred when activating this view java.lang.NuuPointerException
2.  조치: eclipse에서
File > Switch workspace > other: 클릭
workspace: D:\FilaKoreaERP\workspace  --> OK: 클릭
==============================================================================================================

- linkedDataList 함수 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
