

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.05) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2017.05.01(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==> 노동절(공휴일: 루옌 출근) 

- 휴일 
08:00 기상 
09:00 조식(라면) 
10:00 집출발(수종, 자전거) 
10:30 대림역(김밥, 떡) 
11:00 신당역  
11:30 승진완구 ==> 장남감 구입(롱토미카121 히노프로 피아 팅크로리, 수종 어린이날 선물)  
12:30 종료 
13:00 신당역 
13:50 대림역: 자전거  
14:00 귀가 
14:20 중식(떡) 
15:30 구로리 공원 
18:20 귀가 
19:00 루옌 귀가 ==> 일 갔다옴 
20:00 석식 
20:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.02(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>  

- 휴일2 
08:00 기상 
09:00 조식 
09:10 TV시청 
12:00 중식 
13:50 자산 검증, 우리카드 결산 
14:50 장인 병원 예약(16시, 병원) 
20:00 석식 
22:00 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.03(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 석가탄신일 

▦ 조기축구 
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:25 대림운동장 
06:30 창고(기석이형이 축구 물품 자기 차에 실음, 최선형 안나옴) 
08:10 숏게임(축구화 안가지고 와서 집에 갔다 옴) 
08:00 게임 ==> 3게임함(최선형 늦게 나옴) 
10:00 종료(식사는 회비가 없으니 각자 집에 가서 하라고 함) 
10:20 귀가 
11:30 중식 
19:30 석식 
22:00 취침 
==============================================================================================================
 

■■■■■■■■■■■■■■■■■■ 2017.05.04(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:40 ~ 18:10 ==>  

- 휴일3 
08:00 기상 
09:00 조식((루옌 출근 안함) 
09:10 루옌 공장 지인들이랑 생일 파티하러 나감 
12:30 중식 
15:30 집출발(장인) 
15:40 대림3동어린이집(수종 데리고 옴) 
15:50 명지성모 병원(정형외과 2층, X-Ray 촬영, 노동근 과장 진료 
==> 장인은 수술한 다리가 아프다고 함 
==> 의사는 정상적으로 수술 잘 되었다고 함 --> 다리가 아프면 약 2~3일 먹고 그래도 아프면 병원 오라고 함 
==> 3개월 후 다시 오라고 함 
16:50 종료 
17:00 19대 대통령 선거 사전 투표(대림2동 주민센터 2층): 루옌 처음 투표(3번 안철수 찍음), 나는 1번 문재인 찍음 
17:10 종료 
18:00 귀가 
20:00 석식 
20:30 액정필름 붙이기  
22:00 취침 
==============================================================================================================

- 액정필름 도착 및 붙이기 
1. 핸드폰 케이스/액정필름모음, 가격: 990원 
http://www.ticketmonster.co.kr/deal/488074086?opt_deal_srl=488717970&is_adult=N&adult_type=N&keyword=%ED%95%84%EB%A6%84#buy 
2. 뒷면 밖에 없어서 약간 혼란 스러웠지만 잘 붙임(화장실에서 붙임) ==> 만족 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05(금) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 18:00 ==> 어린이날 

- 휴일3 
08:00 기상 
08:30 조식  
10:10 이마트(그늘막 텐트 구입) 
11:10 귀가  
11:40 중식 
12:30 이마트(그늘막 텐트 반품 후 다시 구입) 
13:00 종료 
13:30 보라매 공원(루옌, 수종) 
14:00 그날막 텐트 설치 
16:00 프헝 가족 만남(수종 놀이터에서 잘 놈) 
18:00 종료 
19:00 귀가 
20:00 석식  
22:00 취침 
==============================================================================================================

- BBQ 치킨 주문 
https://www.bbq.co.kr/member/pop_login.asp, tamario / hpt수*16*1@ 
1. 소이갈릭스 치킨, 가격: 18,900원  ==> 루옌이 쏨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.06(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
08:00 기상 
09:00 조식 
09:10 TV시청 
12:00 중식 
20:00 석식 
22:00 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.07(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구 
07:00 기상 
07:20 자전거(문영APT -> 도신초교) 
07:30 도신초교   
07:40 숏게임 
08:00 게임(도신 조기회) ==> 4게임함 
12:00 종료(식사는 회비가 없으니 각자 집에 가서 하라고 함) 
12:20 귀가 
12:30 중식(루옌 외출) 
14:00 낮잠 
18:30 석식 
20:20 루옌 귀가 
20:40 어비님 통화(어버이날 용돈 20만원 송금함) 
22:00 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.08(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 어버이날 

- 본사 대기 
1. Nexacro 분석 
 1) Nexacro 설치, Hansol 소스 다운로드 받음 
==============================================================================================================

- LotteWorldTower Prj 박준형 사원 퇴사 
1. 4월 30일에 LotteWorldTower Prj 홀 예약 파트 문제로 메인 업체 사장한테 항의 전화 왔다고 함 
 1) 박준형씨가 개발한 프로그램 하나도 못 쓴다고 전화 왔다고 함 
 2) 사장 면담 후 나한테 바나나 우유 사주고 퇴사함 
==============================================================================================================

- 태용 만남(15시, 선릉역 근처 이데아) 
1. 잠실 유통업체에서 2번째 면접 보고 왔다고 함(연봉 6천, 업체에서 연봉 4천에 인센티브 제안: 본인이 거부했다고 함) 
 1) 커피(2잔, 이디야역삼상록점, 내가 쏨) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.09(화) 작업■■■■■■■■■■■■■■■■■■  
---> 07:40 ~ 18:10 ==> 19대 대통령 선거(대림2동 주민센터): 이미 사전 선거 했음 

- 주말  
08:00 기상 
09:00 조식(루옌 출근) 
09:10 자전거(수종) 
09:30 뚜레쭈르 대림우성점 ==> 고구마 케이크 13시 이후에 온다고 함 
09:30 로또 구입(만원, 루옌 선물) 
10:00 대동초교 앞 놀이터 
11:30 귀가 
13:30 중식(라면)  
14:00 낮잠 
17:00 기상 
17:40 집출발(수종, 장인) ==> 비 조금 내림 
17:50 대림역(루옌 만남) --> 서울대입구역 
18:20 착한돼지(고기 부페): 루옌 생일(수종, 장인) 
20:00 종료 
20:10 봉천중(6511번 버스: 수종) 
20:40 대동초교 앞 내림 
20:50 뚜레쭈르 대림우성점 ==> 고구마 케이크, 빵 구입 
21:10 귀가 
21:20 루옌 생일 파티 
22:00 취침 
==============================================================================================================

- 외장하드 정리 
1. 버팔로 외장 HD_2011_10A(1TB)  ==> Main 
2. 레토 외장 HD 2.5(640G) ==> 고장남(버릴 것) 
3. 엠지텍 외장 HD 2.5(80G)  ==> 사용 안함 
==============================================================================================================

- USB 정리 
1. USB_T1(16G)  ==> 부팅 디스킹 
 1) 00. WIN7 설치 파일(USB 2.0 16GB) [★★★] 
2. USB_T2(16G)  ==> 부팅 디스킹2 
 1) 00. WIN7 설치 파일(USB 2.0 16GB) [★★★] 
3. USB_T3(32G)  ==> 부팅 디스킹(USB 3.0), (주)지아이데이타에서 선물 받음) 
 1) 00. WIN7 설치 파일(USB 3.0 32G) [★★★] 
4. USB_T4(16G)  ==>  
 1) 00. 기타 DATA(USB 2.0 16GB) [★★★] 
5. USB_T5(64G)  ==>   
 1) 00. 기타 DATA(USB 3.0 64G) [★★★] 
6. USB_T6(128G)  ==>   
 1) 00. 기타 DATA(USB 3.0 128G) [★★★]  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.10(수) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00  ==> 19대 대통령 더불어 민주당 민재인 당선, 최선형이 전화와서 한바탕 함 

- 본사 대기 
1. Nexacro 분석 
 1) Nexacro 설치 
==============================================================================================================

- (주)지아이데이타에서 새로 지급받은 HP 노트북 정보[2017.05.10(수)] 
1. 모델명: HP ProBook 450 G3 
2. S/N: 5CD6151V26 
3. Product: L6L11AV 
==> http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=744151604&GoodsSale=Y&jaehuid=200001169&NaPm=ct
%3Dj2i6v76g%7Cci%3D2a5a26314f0b08de8e34652e014317d4dc0988b5%7Ctr%3Dslc%7Csn%3D24%7Chk%3De79c9234f6464ca6632acbb64853fab06e23a030 
==============================================================================================================

- HP ProBook 450 G3 노트북 OS 재설치 후 문제점 
1. USB 인식 못 함(CD-ROM으로 무선 드라이버 잡음) 
2. 오디오 드라이버 인식 못 함  ==> OS 설치시에 메인보드 드라이버가 제대로 설치 안되는 것으로 추정됨 
3. 그래픽 카드 드라이버 인식 못 함  ==> 인식함(해결) 
-------------------------------------------------------------------------------------------------------- 
  
- HP ProBook 450 G3 노트북 OS 재설치 후 USB 인식 못 함 
1. 조치(무선 드라이버 잡기) 
 1) CD-ROM에 있는 3DP_Net_v1703.exe 더블 클릭(NetWork 드라이버 설치) 
 2) 랜카드(Broadcom BCM430N) 설치  ==> 무선 드라이버 생성됨  ==> 무선 드라이버 잡기 
 3) C:\3DP\Net 폴더 생성됨  
2. 조치2(3DP_Chip 사용하여 드라이버 다운로드: USB3.0 Controller 드라이버 설치) 
 1) 3DP_Chip_Lite_v1704.exe 더블 클릭(NetWork 드라이버 설치) 
 2) 3DP_Chip_Lite_v1704(새창) > 기타 기기 > USB3.0 Controller 설치 > 재시작 
 3) USB 2.0 끼우면 인식함 
-------------------------------------------------------------------------------------------------------- 

- 3DP Chip 사용 목적 
1. 3DP Chip를 설치 후 실행을 하면 HP ProBook 450 G3 노트북에 맞는 드라이버를 자동으로 찾아서 URL을 연결해줌 
-------------------------------------------------------------------------------------------------------- 

- HP ProBook 450 G3 드라이버  
https://support.hp.com/kr-ko/drivers/selfservice/hp-probook-450-g3-notebook-pc/7834555 
01. Broadcom 무선 LAN 드라이버 
02. Realtek 이더넷 컨트롤러 드라이버 

- HP ProBook 450 G3 사양   
https://support.hp.com/kr-ko/document/c04814968 
-------------------------------------------------------------------------------------------------------- 

- HP 서비스 센터 
1. T) 1588-3003  --> T) 540-6119 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.11(목) 작업■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00  ==> 

- 본사 대기 
1. Nexacro 분석  
==============================================================================================================

- HP ProBook 450 G3 노트북 OS 재설치 방법 
1. 무조건 CD-ROM에서 CD 넣은 후 설치할 것(Operating System DVD Windows 7 Professional CD) 
2. OS 설치 후 CD-ROM에서 드라버 전용 CD 넣은후 드라이버 잡을 것(최초에 USB 사용 못함 ==>  
03. Intel(R)_USB_3.0_eXtensible_Host_Controller_Driver_4.0.0.36  --> Setup.exe 실행 후 사용 가능 
3. HP ProBook 450 G3 노트북의 windows 7용 오디오 드라이버 잡는 방법 
https://h30491.www3.hp.com/t5/noteubug/probook-450-g3ui-windows-7yong-odio-deuliabeoleul-mos-chajgessseubnida/td-p/48736 
4. HP ProBook 450 G3 노트북의 windows 7용(64비트) 오디오 드라이버 잡는 방법 문의 
https://h30491.www3.hp.com/t5/noteubug/HP-ProBook-450-G3-noteubugui-windows-7yong-64biteu-odio-deulaibeo-jabneun-bangbeob-munui/td-p/70144 
==============================================================================================================

- HP 지식 커뮤니티 가입 
1. https://h30491.www3.hp.com/t5/custom/page/page-id/HPPUserSignonPage?referer=https%3A%2F%2Fh30491.www3.hp.com%2F 
--> tamario@naver.com / hp수*16*1@ 

- HP Support Assistant 
http://h20386.www2.hp.com/KoreaStore/Merch/Offer.aspx?p=hpsa 
==============================================================================================================
  
- OS 최적화 툴 
1. 노튼 고스트  ==> http://the3.tistory.com/13 
==============================================================================================================

- 회사 소개서 변경 
http://gidata.co.kr/gidata_introduce.pdf 
---------------------------------------------------------------------- 

- gidata 웹 호스팅 정보 호스팅 정보 
1. 도메인: gidata.co.kr, 2) FTP ID: gidataftp, 3) FTP 패스워드: gidata1472  
==============================================================================================================
  
- 야유회 준비 모임(19시, 오징어 식당) 
1. 도신 조기회와 같이 5월 21일(일) 야유회 준비관련 회의 
==> 음식, 이벤트 관련 논의: 수석 부회장(김대중), 최선 총무, 도신 임원 
==============================================================================================================

- HP 서비스 센터 강남 청담점 방문 
1. HP ProBook 450 G3 노트북 오디오, 그래픽 카드 드라이버 안 잡힘 문의 ==> 3DP_Chip을 설치해서 그렇다고 변명하 
면서 드라이버 안 잡아줌 
2. 드라이버 잡아주는데 비용 발생한다고 함 ==> 내가 OS 설치한 후 USB 2.0도 안 잡힌다고 화를 냄 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.12(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> (주)지아이데이타 전략 회의(19:30, 회사) 

- 본사 대기 
1. Nexacro 분석 
==============================================================================================================

- Adobe Acrobat Reader 설치 정보 
1. https://acrobat.adobe.com/kr/ko/acrobat/pdf-reader.html 
2. 지금 설치 ==> https://get.adobe.com/kr/reader/?promoid=KSWLH 
==============================================================================================================
  
- HP ProBook 450 G3 노트북 OS 재설치 후 오디오 드라이버 설치 오류 
1. 원인: BIOS  설정을 체크 해제가 안되어 있어서 일어나는 현상 
2. 조치:  
 1. 노트북 전원을 켜자마자 F10키를 2초 간격으로 누릅니다. 
 2. [ADVANCED]-[BUILT IN DEVICE]항목으로 진입 합니다. 
 3. INTEL SMART SOUND라는 항목이 체크 되어 있는지 확인 합니다. 
체크 되어 있으면 체크를 해제 합니다. 
 4. F10키를 누르고[YES]를 선택하시고 BIOS를 종료 합니다. 
 5. 다시 오디오 드라이버를 설치 시도 합니다. 
------------------------------------------------------------------------------------------------ 

3. HP ProBook 450 G3 노트북의 windows 7용 오디오 드라이버 잡는 방법 
https://h30491.www3.hp.com/t5/noteubug/probook-450-g3ui-windows-7yong-odio-deuliabeoleul-mos-chajgessseubnida/td-p/48736 
4. HP ProBook 450 G3 노트북의 windows 7용(64비트) 오디오 드라이버 잡는 방법 문의(HP 지식 커뮤니티에 글 올림) 
https://h30491.www3.hp.com/t5/noteubug/HP-ProBook-450-G3-noteubugui-windows-7yong-64biteu-odio-deulaibeo-jabneun-bangbeob-munui/td-p/70144 
------------------------------------------------------------------------------------------------ 

- 오디오 장치가 설치되어 있지 않습니다. 
실제 오디오 출력 장치가 설치되어 있지 않거나 장치 드라이버가 설치되지 않을 수 있습니다. 
아래 링크를 참고하여 점검하시기 바랍니다.  
https://h30491.www3.hp.com/t5/noteubug/odio-chullyeogjangchiga-seolchidoeeo-issji-anhseubnida-haegyeolhaejuseyo/m-p/43157 
==============================================================================================================

- Conexant High-Definition (HD) Audio Driver 설치 에러 
10.0.931.89 Rev.Q  ==> sp79420.exe  
10.0.877.61 Rev.Q  ==> sp74946.exe  --> 재설치 
10.1.684.45 Rev.Q  ==> sp74370.exe 
10.0.877.63 Rev.Q  ==> sp75202.exe 
10.0.580.38 Rev.Q  ==> sp72909.exe 
==============================================================================================================

- HP ProBook 450 G3 노트북 OS 재설치 후 그래픽 카드 드라이버 설치 오류 
1. sp79527.exe: AMD 비디오 드라이버 및 제어판  ==> 재설치 함 
-------------------------------------------------------------------------------------------------------- 

- 그래픽 카드  Driver 설치 에러 
sp79527.exe: AMD 비디오 드라이버 및 제어판  ==> 재설치 
sp75708.exe: AMD 하이브리드 그래픽(HG) 비디오 드라이버  ==> 이전 설치(버전 안 맞음: 삭제 처리) 
sp78116.exe: 인텔 비디오 드라이버 및 제어 
==============================================================================================================

- Oralce SQL Developer 4.2 다운로드 
http://www.oracle.com/technetwork/developer-tools/sql-developer/downloads/index.html 
==============================================================================================================
  
- JAVA 설치 및 Oralce SQL Developer 4.2 설치 
01. JAVA 설치(E:\51. TAMA SW\02. 개발용 프로그램\01. JAVA\JDK\JDK 1.8\jdk-8u31-windows-x64.exe)   
 1) 무료 Java 다운로드 ==> https://java.com/ko/download  --> jdk-8u31-windows-x64.exe(더블 클릭 => 실행)   
Microsoft Windows [Version 6.1.7600] 
Copyright (c) 2009 Microsoft Corporation. All rights reserved. 

C:\Users\GIDATA_TAMA> java -version 
java version "1.8.0_31" 
Java(TM) SE Runtime Environment (build 1.8.0_31-b13) 
Java HotSpot(TM) 64-Bit Server VM (build 25.31-b07, mixed mode) 
------------------------------------------------------------------------------------------------------- 

02. Oralce SQL Developer 4.2 설치(E:\51. TAMA SW\02. 개발용 프로그램\02. DB\41. DB관리 툴\00. Oralce SQL Developer) 
 1) JDK home: C:\Program Files\Java\jdk1.8.0_31 
==============================================================================================================
  
- 현대O X-Up Prj 준비 
1. 현대오일뱅크 대산 본사(충청남도 서산시 대산읍 평신2로 182) 
2. 프로젝트 투입 예상일: 2017.05.15(월) 
3. UI 공통 오상민 수석[010-3008-3261]과 통화 ==> 2017.05.15(월) 10시에 현대오일뱅크 대산 본사 앞에서 보기로 함 
 1) 서산공용버스터미널 하차 후, 현대오일뱅크 대산 본사 앞까지 택시(약 2만 5천원)로 이동 
3. SAP ERP --> JCO(RFC) --> X-Up(RFC 함수를 Nexacro로 연결해주는 매개체: eclipse에서 구현) --> Nexacro 
 1) RFC: SAP과 타시스템 간에 인터페이스를 돕는 역할이 SAP PO이고, 그 안의 함수를 RFC(Remote Function Call) 
- SAP과 SAP RFC와 SAP JCO의 관계  ==> http://derveljunit.tistory.com/102 
==> JCO는 자바로 SAP ERP 시스템과 통신하기 위해 SAP에서 제공하는 Middle Ware이다.  
==============================================================================================================

- 음료수(김준호 사원[010-9957-5130], 수습, 체육 교육학과) 
1. 일 도와줘서 음료수 사줌 
==============================================================================================================

- 단돈 50만 원으로 집안에 영화관 만들기 
http://v.media.daum.net/v/20170512101204142 
1. 미니 빔 프로젝트 
==============================================================================================================

- (주)지아이데이타 전략 회의(19:30, 회사) 
1. 사장님, 경리(도은씨), 정현수 차장(새로 입사), 김찬영 부장 참석 
2. 1차 고기집(오겹살)  --> 2차 맥주집 --> 3차 술집  --> 종료(23:20) --> 버스타고 퇴근(술 많이 먹음) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.13(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
09:00 기상 
09:10 조식(라면) 
10:50 집출발 
11:20 대림역 
11:50 서울대입구역  
12:30 키즈카페 어린왕자(서울대입구점): 수종 ==> 2시간 7천원, 아메리카노 커피: 4천원(총 만 천원) 
14:00 종료 
14:20 봉천중앙시장(6511번 버스)  
14:50 대림역: 자전거 
15:00 귀가 
16:00 낮잠(소나기) 
19:00 기상  
20:00 석식 
22:00 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.14(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구 
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(창고: 상희형): 앞으로 최선형이 다마스로 짐 옮긴다고 함 
08:10 숏게임 
08:20 게임(신화 조기회) ==> 3게임함 
11:55 종료 
12:10 중식(북어국: 우리 감자탕): 회에서 쏨  
13:30 종료 
14:50 귀가 
15:00 이발, 염색 ==> 루옌이 해줌 
16:00 낮잠 
17:00 기상(투비소프트 유영선 그룹장한테 전화옴) 
18:30 남구로 시장(다이소 물건 구입, 전사T-FREE-FREE(티 셔츠 2벌): 님구로시장, 
족발 구입(중, 만 8천원) 
20:00 석식 
22:00 취침 
23:40 취침 
==============================================================================================================
  
- 프로젝트 지방 출장시 준비물 
A. 숙소에서 필요한 물품 
1. 옷 
 1) Y셔츠 2벌, 체육복(상하), 반팔 T-셔츠, 양발 4벌, 수건 2개 
2. 새면 도구 
 1) 칫솔, 치약, 떼타올, 면도기, 비누, 빛, 남성 크림, 과도(칼), 컵 
3. 기타 
 1) 침낭, 베게, 우산, 샌들, 옷걸이(4개), 핸드폰 충전기 
B. 개발 사무실에서 필요한 물품 
1. 노트북 장비 
 1) 노트북, USB 키보드 세트, 마우스(예비), 키보드, 부팅CD, USB 
2. 기타 
 1) 핸드폰 충전기, USB 선풍기, 슬리퍼, 칫솔, 치약, 우산 
==============================================================================================================

- USB 선풍기 구입 
1. 이츠라이프 6인치 메탈 USB 미니 선풍기, [6인치]메탈선풍기_블루, 가격: 6,400원 
http://www.g9.co.kr/Display/VIP/Index/823901306 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.15(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 현대오일뱅크 수출입 통관 개발 Prj 투입(10시, 대산), 첫 출근 

- 현대오일뱅크 수출입 통관 개발 Prj(X-Up 개발) 
1. 현대오일뱅크 대산 본사(충청남도 서산시 대산읍 평신2로 182) 
2. 프로젝트 기간: 2017.05.10 ~ 09.01  ==> 2017.05.15(월) ~ 06.30(금) 
3. UI 공통 오상민 수석[010-3008-3261]과 통화 ==> 2017.05.15(월) 10시에 현대오일뱅크 대산 본사 앞에서 보기로 함 
 1) 서산공용버스터미널 하차 후, 현대오일뱅크 대산 본사 앞까지 택시(약 3만 5천원)로 이동 
3. SAP ERP --> JCO(RFC) --> Nexacro 
 1) RFC: SAP과 타시스템 간에 인터페이스를 돕는 역할이 SAP PO이고, 그 안의 함수를 RFC(Remote Function Call) 
- SAP과 SAP RFC와 SAP JCO의 관계  ==> http://derveljunit.tistory.com/102 
==> JCO는 자바로 SAP ERP 시스템과 통신하기 위해 SAP에서 제공하는 Middle Ware이다.  
4. X-Up으로 개발 게획 했으나 고개의 거부로 사용 안함(JCO 사용) 
==============================================================================================================

- 현대오일뱅크 수출입 통관 개발 Prj 첫 출근 
05:00 기상 
05:20 집출발 
05:40 구로디지털단지역 환승센터 도착 
05:45 5627번 버스 승차 
06:30 광명터미널(간식: 옥수수) 
06:45 당진행(13번): 시외버스에 모바일 인식기 없어서 터미널 안내데스크에서 핸드폰 번호 알려주고 겨우 발권 
08:15 당진터미널(1시간 30분 걸림: 서해안 고속도로 부분 정체) 
08:20 택시 승차  
08:40 현대오일뱅크 대산 본사 앞 도착(택시비: 37,600원 나옴) 
09:10 오상민 수석(UI 공통), 정 팀장(공통 기술 지원) 만남 
09:20 현대오일뱅크 안내데스크에서 노트북 확인서 작성, 일일 출입증 받음(주민증 맡김) 
09:50 현대오일뱅크 건물 3층 도착 ==> 프로젝트 관리자 인사 
10:20 노트북 와이파이 설정 ==> 컴퓨터 관리실에 가서 요청 
11:50 중식(돌솥정식, 천정도, 오리전문집): 오수석 차타고 외부에 나가감  ==> 오수석이 쏨(법인카드로 계산)  
13:00 귀사 
18:50 퇴근 
19:40 대산읍내 
20:00 석식(볶음밥, 오수석, 정윤필 팀장): 오수석이 쏨 
21:00 커피: 내가 쏨 
21:30 숙소(코지 하우스, 대산고 근처) 귀가 ==> 충남 서산시 대산읍 대산리 132-32 
==> 정윤필 팀장이랑 3명이서 잠 
23:00 취침 
==============================================================================================================

- 숙소(코지 하우스) 비밀번호 
1. 중앙 현관: #9999# 
2. 301호 현관: 2580* 
==============================================================================================================

- 프로젝트 담당자 
1. 현업 
 1) 허문일 사원(현대 오일뱅크 세무팀) 
 2) 허세욱 과장(현대 오일뱅크) ==>고객 PM 
2. 개발팀 
 1) 윤수호 부장(PM,  010-3797-9074, (주)에이에스이지) 
 2) 김종일 과장(SAP Interface 담당자, 010-8381-4444, (주)에이에스이지) 
3. UI 
 1) 오상민 수석[010-3008-3261) ==> UI 공통 
 2) 정윤필 팀장) ==> UI 기술 지원(2주 지원) 
==============================================================================================================

- HP ProBook 450 G3 노트북 MAC Address(맥 주소) 
C:\Users\GIDATA_TAMA> ipconfig/all 
1. 이더넷 어댑터 로컬 영역 연결:  
   설명. . . . . . . . . . . . : Realtek PCIe GBE Family Controller 
   물리적 주소 . . . . . . . . : 70-5A-0F-2C-0B-A6 

2. 무선 LAN 어댑터 무선 네트워크 연결:  
   설명. . . . . . . . . . . . : Broadcom BCM943228Z 802.11abgn 2x2 M.2 Wi-Fi Ad  
   물리적 주소 . . . . . . . . : 74-DF-BF-0B-08-24 
----------------------------------------------------------------------------------------------------- 

- HP ProBook 450 G3 노트북 MAC Address2(맥 주소2) 
C:\Users\GIDATA_TAMA>getmac 

물리적 주소         전송 이름 
=================== ========================================================== 
74-DF-BF-0B-08-24   \Device\Tcpip_{A7343662-8068-490B-9FEE-4611481F3EFE}   ==> 무선 네트워크 @@@ 
70-5A-0F-2C-0B-A6   미디어 연결 끊김 ==> 유선 네트워크 @@@ 
==============================================================================================================

- 노트북 와이파이 설정 
1. 노트북 들고 컴퓨터 관리실에 가서 요청 ==> 서울 본사에서 포트를 열어줘야 완전하게 사용 가능(기다려라고 함) 
==============================================================================================================

- 프로젝트에서 집에 가져갈 것 
1. 마우스 패드, 수첩, 핸드폰 거치대, 펜 
==============================================================================================================

- 로그 보기 
1. trace("[/form_paging.xfdl] [btn_sel_OnClick()] ==> [url]"+ url ); 
trace("[/left_frame.xfdl] [fn_CallBack()] ==> [gds_menu DS] \n " + this.gds_menu.saveXML() ); // DS 로그 추적 
==============================================================================================================

- Nexacro와 Xplatform 차이 
1. scope(범위) 
2. 함수 만드는 방법 
3. this 사용 
==============================================================================================================

- 현대오일뱅크 이메일 
https://mail.oilbank.co.kr --> rc022, / trasys01!, 

- 현대오일뱅크 파일 서버  
\\172.18.61.60(\\file3.oilbank.co.kr) --> rc022@oilbank.co.kr, / trasys01!, 
\\172.18.61.60\수출입통관시스템구축
\\172.18.61.60\수출입통관시스템구축\Portal(WEB)
==============================================================================================================

- 프로그램 소스 받기 
1. Nexacro 소스 받기(파일 서버) ==> hicts 
2. eciipse 소스 받기 ==> hicts 
==============================================================================================================

- SAP RFC 설정 
1. sapjco3.dll 파일을 복사하여 C:\Windows\System32폴더에 붙여넣기 
==============================================================================================================

- Tomcat 서버 시작 에러 
1. 현상:  
5월 15, 2017 5:59:37 오후 org.apache.catalina.core.StandardContext listenerStart 
심각: Exception sending context initialized event to listener instance of class org.springframework.web.context.ContextLoaderListener 
org.springframework.beans.factory.BeanInitializationException: Could not load properties;  
nested exception is java.io.FileNotFoundException: class path resource [egovframework/egovProps/globals_.properties]  
cannot be opened because it does not exist 
2, 원인: VM W -Dserver.type="local"로 설정 
 1)  이클립스에서 서버 더블클릭 (Tomcat v6.0 Server at localhost  
 2) Open launch configuration 클릭  
 3) VM arguments쪽에 맨 마지막쪽에 아래와 같이 입력 
   ==> VM W -Dserver.type="local" 
==============================================================================================================

- eclipse JDBC Connection 연결 에러 
1 현상: rg.springframework.transaction.CannotCreateTransactionException: Could not open JDBC Connection for  
transaction; nested exception is java.sql.SQLException: Cannot create JDBC driver of class '' for connect URL 'null' 
2. 원인; Tomcat v8.0 Server at localhost 삭제하고 다시 설정하면 
Servers/Tomcat v8.0 Server at localhost-config/context.xml 파일 편집 @@ 
 <Resource 
        name="jdbc/hictsdb" 
        auth="Container" 
        type="javax.sql.DataSource" 
        driverClassName="oracle.jdbc.driver.OracleDriver" 
        url="jdbc:oracle:thin:@172.18.1.195:1521:R52B" 
        username="rdbmx_momos" 
        password="rdbmx_momos" 
        initialSize="1" 
        maxActive="5" 
        maxIdle="3" 
        maxWait="10000" 
        testOnBorrow="true" 
        validationInterval="5000" 
        validationQuery="SELECT 1 FROM DUAL" 
        defaultAutoCommit="true" 
        removeAbandoned="true" 
        removeAbandonedTimeout="5" 
        logAbandoned="true" 
 /> 
==============================================================================================================

- 이클립스 아파치 톰캣서버 연동 
1. 이클립스 Window - Preferences 메뉴에서 Server - Runtime Environment를 선택합니다. 처음 톰캣을 설치하고 설정하는  
것이라면 서버 목록에 아무것도 나타나지 않습니다. 톰캣 서버를 추가를 하기 위해서 Add버튼을 누릅니다.   
Tomcat installatin directory: C:\hicts_workspace\apache-tomcat-8.0.43  --> Tomcat 폴더 지정 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.16(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:50  ==> 

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 통관계획조회(icsp)  
 1) 통관계획조회(icsp_10101)   ==> Z_TI_PC_RFC_LIST 
 2) 원유통관재고조회(icsp_10102) 
 3) 원유하역계획(icsp_10103) 
==============================================================================================================
   
- gfn_today() 함수 호출 실패 
LIB_DATE.gfn_today = function () 
uxs (5204): UD 19:8:5:628   서버에서 현재 날짜를 가져와야 함 
uxs (5204): SE 19:8:5:644   TypeError: Cannot call method 'getColumn' of undefined 
at line 275, in function: gfn_today in file://C:/hicts_workspace/hicts/src/main/webapp/xui/nexacro14lib/component/HoilLibrary/HoilDate.js 
==============================================================================================================

- HP 노트북 백팩 구입 
1. HP 노트북 백팩_H5M90AA, 가격: 32,690원 
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B326684997&frm3=V2 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.17(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:30  ==> 

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 통관계획조회(icsp)  
 1) 원유통관재고조회(icsp_10102)  
==============================================================================================================

- 그리드 칼럼 EXPR 사용 
1. scope 문제(XPR) ==> Nexacro에서 적용이 안됩니다. ufn_setColor() 함수를 인식하지 못 합니다.   
2. 해결: XPR(ufn_setColor(NOTE1,1)) ==> XPR(comp.parent.parent.parent.ufn_setColor(NOTE1,1)) 
 1) comp(grid List) => Tab00.tabpage1.grd_List 
3. Grid Contents Editor > Style > color, color2에서 
color: XPR(comp.parent.parent.parent.ufn_setColor(NOTE1,1)) 
color2: XPR(comp.parent.parent.parent.ufn_setColor(NOTE1,1)) 

/**************************************************************************************** 
 * Description     : Grid에서 비교 칼럽별 글자색 변경 
 * Argument : strBigo, strNo 
 * return : strReutrn  
 ****************************************************************************************/ 
this.ufn_setColor = function(strBigo, strNo)  
{  
var strReutrn = "";   
//trace("[/TI10101.xfdl] [ufn_setColor()] ==> [TEST] [strBigo]"+ strBigo +"[strNo]"+ strNo ); 
   
if(strBigo == "입항전 신고") 
{ 
strReutrn = "blue"; 
} 
else if(strBigo == "FTA 세율 적용"  strBigo == "할당 세율 적용 (납사)"  strBigo == "할당 세율 적용 (LPG)") 
{ 
strReutrn = "red"; 
} 
else if(strBigo == "KNOC PIPE 이송") 
{ 
strReutrn = "brown";  // 갈색 
}  
else  // 반입후신고, 그 외 
{ 
strReutrn = "black"; 
}   
trace("[/TI10101.xfdl] [ufn_setColor()] ==> [strBigo]"+ strBigo +"[strNo]"+ strNo +" --> [결과값] [strReutrn]"+ strReutrn ); 

return strReutrn; 
} 
==============================================================================================================

1. scope 문제(XPR) 
comp.parent.ds_a.getColumn(currow, 'abc') == comp.parent.ds_b.getColumn(currow, 'abc') ? 'red' : 'blue'   
앞에 comp.parent. 을 붙여 넣으시기 바랍니다.   
만약 div안에 있는 grid라면 comp.parent.parent. 을 붙여넣어주셔야 합니다.  
==============================================================================================================
    
- Grid에 이미지 넣기(조회 이미지) 
1. expand 
theme://images/ico_expand.png 
30 
==============================================================================================================
    
- saveXML 에러 
1. 현상: 
uxs (6892): SE 11:41:24:256 TypeError: Cannot call method 'saveXML' of undefined 
at line 476, in function: ufn_searchTab in file://C:/hicts_workspace/hicts/src/main/webapp/xui/TI/TI10101.xfdl.js 
2. 원인: dsIMT_WRKDT_2를 임의로 삭제해서 나는 현상 
==============================================================================================================

- 원유하역계획 RFC 호출 에러 
1. 현상: 
uxs (2008): UD 16:34:52:187 [/TI10101.xfdl] [fn_callback()] ==> sTrId: rfcTab2 nErrorCode: -99 sErrorMsg: 조회 실패했습니다. 
2, 원인:[/XPlatformMapDTO.java 파일에서 null값 에러 발생 
3. 조치: try{} catch {}로 변경 

public void setRFCImport(JCoFunction jCoFunction) {      
	System.out.println("[/XPlatformMapDTO.java] [setRFCImport()] ==> [TEST]" ); 

	//if(!jCoFunction.getImportParameterList().equals(null)){  // ===> 이전 소스 @@@ 
	//setRFCImportParameter(jCoFunction); 
	//}  

	try{      // ===> 변경 소스 @@@ 
		setRFCImportParameter(jCoFunction); 
		System.out.println("[/XPlatformMapDTO.java] [setRFCImport()] ==> [jCoFunction]"+ jCoFunction ); 
	 } catch (Exception e) { } 

	setRFCImportTableParameter(jCoFunction); 
} 

/**************************************************************************************** 
 * Description     : 원유하역계획 RFC 호출 
 * Argument   
 * return : strReutrn  
 ****************************************************************************************/ 
this.ufn_searchTab2 = function()  
{    
	var strSvcId = "TI10101RfcTab2"; 
	var strSvcUrl = "/TI/selectTiUlListA.do";  // 원유하역계획(icsp_10103) ==> Z_TI_UL_RFC_LIST 
	var inData = "dsIMT_WRKDT=dsIMT_WRKDT"; // inData: dsIMT_WRKDT(조회 조건 DS) --> IP_WRKDT: 작업일   
	var outData = "dsET_LIST2=dsET_LIST";    // outData: dsET_LIST2(원유하역계획 DS)  
	var strArg = ""; //  ==> dsET_LIST2=dsET_LIST(불변: 자바에서 ET_LIST로 받음) @@@@ 
	var callBackFnc = "fn_callback"; 
	var svcType = "R"; 
	var isAsync = true; 
	var bWait = true;  
	trace("[/TI10101.xfdl] [ufn_searchTab2()] ==> [dsET_LIST2.saveXML()]"+ this.dsET_LIST2.saveXML() ); 
	trace("[/TI10101.xfdl] [ufn_searchTab2()] ==> [strSvcUrl]"+ strSvcUrl +"[inData]"+ inData +"[strArg]"+ strArg ); 

	this.gfn_transaction(strSvcId, strSvcUrl, inData, outData, strArg, callBackFnc, svcType, isAsync, bWait); 
}  
==============================================================================================================

 - 다음날로 이동, 이전날로 이동 
/**************************************************************************************** 
 * Components : Button  
 * Description :  버튼 클릭 이벤트(다음달로 이동) 
 ****************************************************************************************/    
this.div_search_btnNextMonth_onclick = function(obj:Button,  e:nexacro.ClickEventInfo) 
{  
	var objDate = this.div_search.cal_reg_sdate.value;    
	var strDate = objDate.toString();   
	var yyyymm = strDate.substr(0, 6);   
	var add_date = this.gfn_addMonth(yyyymm+"01", 1);   
	//trace("[/TI10101.xfdl] [div_search_btnNextMonth_onclick()] ==> [달력 날짜] strDate_END]"+ strDate +"[yyyymm]"+ yyyymm +"[add_date_END]"+ add_date ); 

	this.div_search.cal_reg_sdate.set_value(add_date);  
} 

/**************************************************************************************** 
 * Components : Button  
 * Description :  버튼 클릭 이벤트(다음날로 이동) 
 ****************************************************************************************/    
this.div_search_btnNextDay_onclick = function(obj:Button,  e:nexacro.ClickEventInfo) 
{   
	var objDate = this.div_search.cal_reg_sdate.value;    
	var strDate = objDate.toString();    
	var add_date = this.gfn_addDate(strDate, 1);  

	this.div_search.cal_reg_sdate.set_value(add_date);  
} 

/****************************************************************************************  
 * Description :  버튼 클릭 이벤트(현재 이동) 
 ****************************************************************************************/  
this.div_search_btnToDay_onclick = function(obj:Button,  e:nexacro.ClickEventInfo) 
{  
	this.ufn_initDataset(); // Init Dataset   
} 

this.ufn_initDataset = function() 
{  
	var today = this.gfn_today();  // 오늘 날짜 this.gfn_today() 
	this.div_search.cal_reg_sdate.set_value(today);  
} 

/***************************************************************************************** 
 * 함  수  명 : gfn_addDate 
 * 입      력 : 1. strDate : 'yyyyMMdd' 형태로 표현된 날짜. 
2. nOffset : nOffset 
 * 반      환 : 요일에 따른 숫자(0 = 일요일 ~ 6 = 토요일. 오류가 발생할 경우 -1 Return) 
 * 기      능 : 입력된 날짜에 nOffset 으로 지정된 만큼의 일을 증감 후 리턴하는 함수 
 *****************************************************************************************/    
LIB_DATE.gfn_addDate = function (sDate, nOffset) 
{ 
	sDate = String(sDate); 
	if( this.gfn_isNull(sDate)  this.gfn_isNull(nOffset) ) return ""; 

	var nYear = parseInt(sDate.substr(0, 4)); 
	var nMonth = parseInt(sDate.substr(4, 2)); 
	var nDate = parseInt(sDate.substr(6, 2)) + nOffset; 

	return this.gfn_makeDate(nYear, nMonth, nDate); 

} 

/***************************************************************************************** 
 * 함  수  명 : gfn_addMonth 
 * 입      력 : 1. strDate : 'yyyyMMdd' 형태로 표현된 날짜. 
2. nOffset : nOffset 
 * 반      환 : 요일에 따른 숫자(0 = 일요일 ~ 6 = 토요일. 오류가 발생할 경우 -1 Return) 
 * 기      능 : 입력된 날짜에 nOffset 으로 지정된 만큼의 월을 증감 후 리턴하는 함수 
 *****************************************************************************************/    
LIB_DATE.gfn_addMonth = function(sDate, nOffset) 
{ 
	sDate = String(sDate); 
	if( this.gfn_isNull(sDate)  this.gfn_isNull(nOffset) ) return ""; 

	var nYear = parseInt(sDate.substr(0, 4)); 
	var nMonth = parseInt(sDate.substr(4, 2))+nOffset; 
	var nDate = parseInt(sDate.substr(6, 2)); 
	var nLastDate, sRet; 

	sRet = this.gfn_makeDate(nYear, nMonth, 1);  

	nLastDate = this.gfn_getLastDay(sRet); 
	sRet = sRet.substr(0,6); 
	
	if( nDate > nLastDate ) {  
		sRet += this.gfn_right("0"+nLastDate.toString(),2); 
	} else {  
		sRet += this.gfn_right("0"+nDate.toString(),2); 
	} 

	return sRet; 
}; 

/***************************************************************************************** 
 * 함  수  명 : gfn_getLastDay 
 * 입      력 : 1. strDate : 6자리의 숫자로 된 날짜(YYYYMM) 
 * 반      환 : String 해당월의 마지막날(DD) 
 * 기      능 : 년월(YYYYMM)을 입력받아 마지막 일를 반환하는 함수 
 *****************************************************************************************/    
LIB_DATE.gfn_getLastDay = function(strDate) 
{  
	var s = ""; 
	if (strDate == null) { 
		var date = (new Date()).addMonth(1); 
	} 
	else { 
		var date = new Date(parseInt(strDate.substr(0,4)),parseInt(strDate.substr(4,2)),1); 
	} 

	date = (new Date(date)).addDate((new Date(date)).getDate()*-1); 

	s = (new Date(date)).getFullYear() 
	  + (((new Date(date)).getMonth() + 1) + "").padLeft(2, '0') 
	  + ((new Date(date)).getDate() + "").padLeft(2, '0'); 
	//trace("[/THoilDate.js] [gfn_getLastDay()] ==> [s]"+ s );  
	 
	return (s); 
}; 
==============================================================================================================

- Grid에서 2자리 Comma 설정)  ==> 강추 @!@@@ 
1. 그리드 해당 셀의 displaytype이 number 인 경우 콤마가 자동으로 나오게 됩니다.  
데이터셋의 컬럼타입에 따라 number형으로 보여지게 됩니다.  
컬럼의 타입이 숫자형인 경우 콤마가 표현 됩니다.   
 ==> edittype: none, mask:  
2. 참고(굳이 이렇게 안 해도 됨) @!@@@ 
  1) mask="EXPR:(gfn_IsNull(getSum(&quot;grSumAmt&quot;)))?'':'##,###,###,###,###,###'"  
  2) comp.parent.ds_a.getColumn(currow, 'abc') == comp.parent.ds_b.getColumn(currow, 'abc') ? 'red' : 'blue'  
3. expr 사용 
 1) expr:ARRDT=='0000-00-00' ? '' : ARRDT  ==> 접안일(ARRDT)이 '0000-00-00'이면 NULL 처리  
==============================================================================================================

- Grid에서 물량 칼럼별 수량 Mask 처리(Comma 설정)  ==> 굳이 이렇게 안 해도 됨(시스템 속도 느려짐) @!@@@ 
1. Grid Contents Editor > 물량 칼럼 >  
displaytype: number, edittype: mask mask로 설정  
mask: EXPR(comp.parent.parent.parent.ufn_setMaskQty(MENGE,1)) 

mask= EXPR(this.gfn_IsNul(lMENGE) ?'':'###,###,###,###,###,###')   
mask="expr:expr:(gfn_IsNull(getSum(&quot;grSumAmt&quot;)))?'':'##,###,###,###,###,###'"  
var rtn = grd_list.setCellProperty("Body",6,"mask","###,###,###,###.#####");  

/**************************************************************************************** 
 * Description     : Grid에서 물량 칼럼별 수량 Mask 처리 
 * Argument : strBigo, strNo 
 * return : strReutrn  
 ****************************************************************************************/ 
this.ufn_setMaskQty = function(strQty, strNo)  
{  
	var strReutrn = "";   
		
	if(this.gfn_isNull(strQty)) 
	{ 
		strReutrn = ""; 
	}  
	else 
	{  
		var iQty = parseInt(strQty); 
		strReutrn = "###,###,###,###,###,###";   // Mask 처리(15자리)  
	}  
	trace("[/TI10101.xfdl] [ufn_setMaskQty()] ==> [strQty]"+ strQty +" --> [결과값] [strReutrn]"+ strReutrn ); 

	return strReutrn; 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.18(목) 작업■■■■■■■■■■■■■■■■■■
---> 09:10 ~ 20:00  ==> 주간회의(14시), 개발 소스 반영 

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 통관계획조회(icsp)  
 1) 원유통관재고조회(icsp_10102)  ==> 완료 
==============================================================================================================

- java에서 받은 DataSet 데이타 타비을 Grid에서 데이타 타입 변경하는 방법 
1. dsET_LIST: 클릭 > Properties > userclientlayout: ture 설정 
2. dsET_LIST(DataSet)에서 string을 INT로 변경  ==> 이렇게 설정하면 java에서 string으로 가져와도 자동 변경이 됨 
 <ColumnInfo>  
  <Column id="MENGE" type="INT" size="32" description="통관 수량"/>  
</ColumnInfo> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.19(금) 작업■■■■■■■■■■■■■■■■■■
---> 09:10 ~ 20:00  ==> 서울행(20시, 오상민 수석 차), 정윤필 팀장(18시) 

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl) 
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl) 
==> B/L 등록상태 리스트 및 통관의뢰 
==============================================================================================================

- Script 소스 수정시 선택한 블럭을 일괄적으로 주석 처리 방법 
1. 주석 처리: 블럭 지정 후 / 처리 
2. 주석 해제: 블럭 선택 후 Alt + / 처리 
==============================================================================================================

- Radeon Settings 에러 
1. 드래픽 카드 드라이버 에러 발생 
 1) 장치 관리자에서 아래 드라이버 노란 경고 이미지 발생 
 ==> 장치상태: Windows에서 필요한 드라이버를 로드할 수 없기 때문에 해당 장치가 올바르게 작동하지 않습니다. (코드 31) 
AMD Radeon R7 M340 
Intel(R) HD Graphics 520  
==============================================================================================================

- [넥센] 교육훈련관리 시스템 개발관련 개인 의견 작성 
1. (주)이젠고 유영선 이사님에게 메일(ezngo.you@gmail.com) 보냄 ==> 이전 (주)투비소프트 그룹장 
==============================================================================================================

- 서울행
17:30 퇴근(현대오일뱅크 수출입 통관 개발 Prj(대산 공장) :오수석 차)
19:00 석식(대산 읍내, 소고기, 오수석, 정팀장): 오수석이 쏨
19:50 종료
20:00 커피(아메리카노, 안나 커피숍: 오수석, 정팀장): 내가 쏨 
20:40 종료
20:50 숙소(빨래갑 챙기기)
21:00 숙소 출발(정팀장 철수함): 오수석 차
22:30 구성역 도착
22:30 구성역 출발
23:50 대림역 도착
24:00 귀가
22:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.20(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   

- 주말  
08:00 기상 
09:00 조식(옥수수)  
09:30 루옌, 수종, 장인 한강 나들이 감
09:40 노트북 작업(소스 정리하여 USB에 복사)
12:30 중식
13:50 집출발
14:00 최선형 사무실
14:30 봉고차로 창고에 가서 짐 싣기, 강고문님댁에 가서 짐 싣기
16:00 종료
16:30 최선형 사무실에서 맥주
19:30 종료
20:00 귀가
22:00 대림3동 조기회 회비 납부내역 정리(월별로 회비 납부자수, 실제 납부 금액 정리)
24:30 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.05.21(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구 
05:00 기상 
05:20 자전거(문영APT -> 다솜식당) 
05:30 최선형 사무실 -> 다마스 차(노끈 가지고 옴)   
60:10 다솜식당 출발(최선형 봉고차: 5명 타고 감, 수춘이형이 운전함) 
08:00 게임(도신 조기회) ==> 4게임함 
12:00 종료
12:20 귀가 
12:30 중식(루옌 외출) 
14:00 낮잠 
18:30 석식 
20:20 루옌 귀가 
20:40  
22:00 취침 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.05.22(월) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl) --> 완료 @@@
 ==> B/L 등록(TI::TI10301_Popup.xfdl)
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)  
==============================================================================================================

- XPLATFORM_Client_License 
1. Customer : TOBESOFT  
2. Tool (UX-Studio) : UE3DR-CN3TG-KWWV3-2YRPK-25AKN-XCSWC-1R2 
==============================================================================================================

- 개발서버 URL셋팅 변경(Nexacro, ecipse에서 변경
1, svcURL= http://localhost:8001 ==> svcURL= http://localhost:8080
==============================================================================================================

- static에서 총 조회 건수 보이기
this.fn_callback = function(sTrId, nErrorCode, sErrorMsg)
{    
	 switch(sTrId)
	 {
	  case "TI10301Rfc":
	   if(this.dsET_LIST.getRowCount() > 0)
	   { 
			trace("[/TI10301.xfdl] [fn_callback()] ==>  [dsET_LIST.saveXML()]"+ this.dsET_LIST.saveXML() );
	   }  
			this.stcSearchCount.set_text("[총  <fc v='#216eb2'><fs v='8'><b v='true'>" + this.dsET_LIST.getRowCount() + "</b></fs></fc>건]"); 
			// 조회 건수 @@@
			stcRegTime.text = "<fc v=#f26c4t'>"+ gfn_right('0'+ ds_corP.getColumn(i,"APPL_CNT") +"</fc>";   // 아님 @@@
			trace("[/TI10301.xfdl] [fn_callback()] ==> [this.stcSearchCount.text]"+ this.stcSearchCount.text );
			break;  
	 }
} 
==============================================================================================================

- URL 링크
1. 
/****************************************************************************************
 * Components : Button 
 *    : 02.e  : ClickEventInfo
 * Description :  버튼 클릭 이벤트(B/L 등록 화면으로 URL 이동)
 ****************************************************************************************/    
this.btnBLReg_onclick = function(obj:Button,  e:nexacro.ClickEventInfo)
{ 
	 var strMenuCd, strMenuNm, strPgUrl, strMenuType, argMenuParam, arg;
	  
	 strPgUrl = "TI::TI10302.xfdl";
	 strMenuCd = "10302";
	 strMenuNm = "수입 B/L 등록목록조회";
	 strMenuType = "";
	 argMenuParam = "";
	 trace("[/frmLeft.xfdl] [btnBLReg_onclick()] ==> [strPgUrl]"+ strPgUrl +"[MENU_CD]"+ strMenuCd +"[strMenuNm]"+ strMenuNm 
	 +"[strMenuType]"+ strMenuType +"[argMenuParam]"+ argMenuParam );

	 this.gfn_openMenu(strMenuCd, strMenuNm, strPgUrl, arg); //  URL 이동 @@@
}
-----------------------------------------------------------------------------------------------------

- URL 링크(왼쪽 메뉴에서 DS 사용 URL 이동
1. 
/****************************************************************************************
 * Components : Grid
 * Event   : oncellclick
 * Argument  : 01.obj : Event generated Object
 *    : 02.e  : Event Object
 * Description : menu Expand or Collapse
 ****************************************************************************************/
this.div_left_grd_menu_oncellclick = function(obj:Grid, e:nexacro.GridClickEventInfo)
{  
	this.ufn_setTreeState(obj, e); 
	var bRet = obj.isTreeLeafRow(e.row);

	if(bRet){
		var objDs = this.objects[obj.binddataset];
		var strMenuCd, strMenuNm, strPgUrl, strMenuType, argMenuParam

		strPgUrl = objDs.getColumn(e.row, "PGM_PATH");
		strMenuCd = objDs.getColumn(e.row, "MENU_CD");
		strMenuNm = objDs.getColumn(e.row, "MENU_NM");
		strMenuType = objDs.getColumn(e.row, "MENU_TYPE");
		argMenuParam = objDs.getColumn(e.row, "MENU_PARAM");
		trace("[/frmLeft.xfdl] [div_left_grd_menu_oncellclick()] ==> [MENU_CD]"+ strMenuCd +"[MENU_NM]"+ strMenuNm +"[strPgUrl]"+ strPgUrl );

		var arg = "";
		this.gfn_openMenu(strMenuCd, strMenuNm, strPgUrl, arg); //  URL 이동 @@@
	}
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.23(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 23:50  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)
 ==> B/L 등록(TI::TI10301_Popup.xfdl) --> 완료 @@@
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl) 
==============================================================================================================

- B/L등록목록상세조회 에러
1. 현상:
[/TI10301_Popup.xfdl] [fn_callback()] ==> [TEST] [
sTrId]TI10301_PopupRfc[nErrorCode]-99[sErrorMsg]추가할 수입의뢰의 공급업체[2000003]와 B/L상의 공급업
체[2000052]가 서로 상이합니다
2. 원인: 거래업체가 다르면 같이 B/L 등록이 안됨(체크 못하게 설정할 것) 
sErrorMsg]서로 다른 선적항 가(이) 존재합니다. 해당 기능을 수행할 수 없습니다
==============================================================================================================

- 창닫기 에러
/****************************************************************************************
 * Components : Form 
 * Description :  Form 클릭 이벤트(창닫기)
 ****************************************************************************************/    
this.fn_onclose = function(obj:Form, e:nexacro.CloseEventInfo)
{ 
	trace("[/TI10301_Popup.xfdl] [fn_onclose()] ==> [TEST]" );
	  
	 var params =
	 {
		  "RECV_ID":this.P_RECV_ID,
		  "RECV_NM":this.P_RECV_NM,
		  "RECV_DS":this.RECV_DS
	 };
	trace("[/TI10301_Popup.xfdl] [fn_onclose()] ==> [params]"+ params );

	this.gfn_closePopup(params);
	trace("[/TI10301_Popup.xfdl] [fn_onclose()] ==> [TEST_end]" ); 
 
	/nexacro14lib/framework/SystemBase.js 파일에서
	nexacro._registerClass = function (_jsContext) {
	 var registerclass = nexacro._getLocalStorage("_registerclass", []);
	 var len = registerclass.length;

		 for (var i = 0; i < len; i++) {
			var item = registerclass[i];
			if (item) {
				if (!_jsContext[item.id]) {
				_jsContext[item.id] = _jsContext.eval(item.classname);
			}
		}   // end of for()
	}
};

1. 에러 내용: TypeError: Cannot read property 'handler' of undefined
2. 원인 
==============================================================================================================

- 창닫기 에러  
/****************************************************************************************
 * Components : Button 
 *    : 02.e  : ClickEventInfo
 * Description :  버튼 클릭 이벤트(B/L 등록 화면으로 URL 이동)
 ****************************************************************************************/    
this.btnBLReg_onclick = function(obj:Button,  e:nexacro.ClickEventInfo)
{ 
	 trace("[/TI10301.xfdl] [btnBLReg_onclick()] ==> [TEST]" ); 

	 var nRowCnt; 
	 this.dsET_LIST.filter("chk == '1'"); // B/L등록대상목록 DS 필터링 
	 this.dsET_LIST_CHECHED.clear; 
	 this.dsET_LIST.clear;

	 nRowCnt = this.dsET_LIST_CHECHED.copyData(this.dsET_LIST, true);  // B/L등록대상목록 DS 복사(필터링된 값만 복사)  
	 trace("[/TI10301.xfdl] [btnBLReg_onclick()] ==> [nRowCnt_조회수]"+ nRowCnt +"[dsET_LIST_CHECHED.getRowCount_조회수_02]"
	 + this.dsET_LIST_CHECHED.getRowCount() +"[this.dsET_LIST_CHECHED.saveXML()]"+ this.dsET_LIST_CHECHED.saveXML() );

	 this.dsET_LIST.filter("");  // B/L등록대상목록 DS  필터링 해제

	 var params =
	 {
	  "RECV_ID":"modal_popup",
	  "RECV_NM":"Modal 화면에서 데이터 받음.",
	  "RECV_DS":this.dsET_LIST_CHECHED   // Modal 화면에서 DataSet 받음
	 };  // 파라미터
	  
	 var sOption = "popupType=modal,resizable=true";
	 trace("[/TI10301.xfdl] [btnPopUp_onclick()] ==> [params]"+ params +"[sOption]"+ sOption);

	 this.gfn_openPopup("modal_popup", "TI::TI10301_Popup.xfdl", params, sOption, "fn_openpopCallback");   
}
1. 에러 내용:  TypeError: Cannot read property 'length' of null
at line 7606, in function: _clearAll in file://C:/hicts_workspace/hicts/src/main/webapp/xui/nexacro14lib/component/CompBase/Data.js

_pDataset._clearAll = function () {
	 this.colinfos = null;

	 var cnt = this.rowcount;
	 this.colinfos = new nexacro.DSColumnInfoList();
	 this._constVars = new nexacro.VariableList();

	 this._rawRecords.splice(0, this._rawRecords.length);   // 에러 발생 @@@
}

2. 원인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.24(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:30  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)
 ==> B/L 등록(TI::TI10301_Popup.xfdl) --> 완료 @@@
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl) 
==============================================================================================================

- Grid 순번(번호)
1. text="expr:currow + 1"

-- grd_List 에서 
<Formats>
<Format id="default">
  <Columns>
    <Column size="72" />
    <Column size="116" />
    <Column size="161" />
    <Column size="116" />
    <Column size="116" />
    <Column size="116" />
  </Columns>
  <Rows>
    <Row size="30" band="head" />
    <Row size="26" />
  </Rows>
  <Band id="head">
    <Cell text="순번"/>
    <Cell col="1" text="구매문서번호"/>
    <Cell col="2" style="background2:&#32;;" text="품명"/>
    <Cell col="3" text="B/L수량"/>
    <Cell col="4" text="단위"/>
    <Cell col="5" text="API"/>
  </Band>
  <Band id="body">
    <Cell edittype="readonly"  text="expr:currow + 1" />   @@@@@@@@@@@@
    <Cell col="1" edittype="readonly" style="background:gray;background2:gray;color2:&#32;;" text="bind:EBELN"/>
    <Cell col="2" edittype="readonly" style="background:gray;background2:gray;" text="bind:TXZ01"/>
    <Cell col="3" displaytype="number" edittype="text" text="bind:BLMNG"/>
    <Cell col="4" edittype="text" text="bind:MEINS"/>
    <Cell col="5" text="bind:APINO"/>
  </Band>
</Format>
</Formats>   
==============================================================================================================

- 상태바 안보임 해결(/HoilForm.js 파일에서)
newChild.set_showtitlebar(bShowTitle);  // status: 상태바 보이도록 수정 처리(title이 false 이면 안 보임)
//newChild.set_showtitlebar(false); // 이전 소스(주석 처리함)
==============================================================================================================

- 공통 메세지 알람 설정
if(this.gfn_isEmpty(this.div_search.calFrom.value) ){
	if(this.gfn_isEmpty(this.div_search.calTo.value) == false ){ 
		this.gfn_showMsgBox("0008", "", "");   // 0008: P/O등록일은 하나만 입력할 수 없습니다. 
		this.div_search.calFrom.setFocus();
		return false;
		}
} 
--------------------------------------------------------------------------------------------------------

- GDS_MESSAGE 에서(/globalvars.xml)
 <Dataset id="GDS_MESSAGE">
    <ColumnInfo>
      <Column id="MSG_CD" type="STRING" size="256"/>
      <Column id="MSG_TYPE_CD" type="STRING" size="256"/>
      <Column id="MSG_TITLE" type="STRING" size="256"/>
      <Column id="MSG_TITLE_EN" type="STRING" size="256"/>
      <Column id="MSG_CLASS" type="STRING" size="256"/>
      <Column id="MSG" type="STRING" size="256"/>
      <Column id="MSG_ENG" type="STRING" size="256"/>
      <Column id="MSG_BTN" type="STRING" size="256"/>
      <Column id="MSG_DEFAULT" type="STRING" size="256"/>
      <Column id="USE_YN" type="STRING" size="256"/>
    </ColumnInfo>
    <Rows>
      <Row>
        <Col id="MSG_CD">0001</Col>
        <Col id="MSG_TYPE_CD">I</Col>
        <Col id="MSG_TITLE">알림</Col>
        <Col id="MSG_TITLE_EN">Information</Col>
        <Col id="MSG_CLASS">S</Col>
        <Col id="MSG">{}은(는) 필수입력항목입니다.</Col>
        <Col id="MSG_ENG"/>
        <Col id="MSG_BTN">OK</Col>
        <Col id="MSG_DEFAULT">1</Col>
        <Col id="USE_YN">1</Col>
      </Row>
      <Row>
        <Col id="MSG_CD">0002</Col>
        <Col id="MSG_TYPE_CD">I</Col>
        <Col id="MSG_TITLE">알림</Col>
        <Col id="MSG_TITLE_EN">Information</Col>
        <Col id="MSG_CLASS">S</Col>
        <Col id="MSG">{}은(는) {}글자 이상으로 입력하셔야 합니다.</Col>
        <Col id="MSG_ENG"/>
        <Col id="MSG_BTN">OK</Col>
        <Col id="MSG_DEFAULT">1</Col>
        <Col id="USE_YN">1</Col>
      </Row> 
       <Row>
        <Col id="MSG_CD">0008</Col>
        <Col id="MSG_TYPE_CD">I</Col>
        <Col id="MSG_TITLE">알림</Col>
        <Col id="MSG_TITLE_EN">Information</Col>
        <Col id="MSG_CLASS">B</Col>
        <Col id="MSG">P/O등록일은 하나만 입력할 수 없습니다.</Col>
        <Col id="MSG_ENG"/>
        <Col id="MSG_BTN">OK</Col>
        <Col id="MSG_DEFAULT">1</Col>
        <Col id="USE_YN">1</Col>
      </Row>
    </Rows>
  </Dataset> 
==============================================================================================================

- transaction 처리시 저장 타입 처리 
1,  inData = "dsCS_ZTITBLK=dsCS_ZTITBLK:U";   // inData
// 송신 Dataset(복수일 경우 " "으로 구분) --> A:ALL, U: 갱신된 정보만 전송, N: 현재 삭제한 데이터를 제외한 정보를 Normal 상태로 전송 
 /****************************************************************************************
 * Components : Button 
 * Description :  버튼 클릭 이벤트(B/L 수정)
 ****************************************************************************************/   
this.btnEdit_onclick = function(obj:Button,  e:nexacro.ClickEventInfo)
{   
	 var strSvcId = "TI10301_PopupRfEdit"; 
	 var strSvcUrl = "/TI/selectTiBlSaveA.do";  // strSvcUrl: Z_TI_BL_SAVE_DOCUMENT(B/L등록목록 저장) 
	 var inData =  "dsCS_ZTITBLK=dsCS_ZTITBLK:U";  // inData:
	 var outData = "dsET_RETURN=dsET_RETURN"; // outData:
	 var strArg ="IP_MODE=M";     // IP_MODE(저장: 'C', 변경: 'M', 삭제: 'D')
	 var callBackFnc = "fn_callback";
	 var svcType = "S";
	 var isAsync = true;
	 var bWait = true;
	  
	 this.gfn_transaction(strSvcId, strSvcUrl, inData, outData, strArg, callBackFnc, svcType, isAsync, bWait);
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.25(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)
 ==> B/L 등록(TI::TI10301_Popup.xfdl) 
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
==============================================================================================================

- Nexacro load 실패
1. 현상
(5960): Error: URL (file://) 을 로딩하는데 다음과같은 http 또는  socket 에러코드 -1로 실패하였습니다.
(5960): Error: 부적합한 ResponseItem(id=file://,hr=ffffffff)
[Error] Fail to load GlobalVariables : "file://"
[Error] Fail to open project : "C:\hicts_workspace\hicts_xui\xui\xui.xprj"
2. 원인: globalvars.xml 파일에서 FILE 파일이 추가되어 있어서 나는 에러 ==> file 폴더가 생성되어 있어야 함
<GlobalVariables>
  <Dataset id="GDS_MENU">
    <ColumnInfo>
      <Column id="MENU_CD" type="STRING" size="8"/>
      <Column id="UP_MENU_CD" type="STRING" size="8"/>
      <Column id="MENU_NM" type="STRING" size="50"/>
      <Column id="MENU_LVL" type="INT" size="22"/>
      <Column id="PGM_PATH" type="STRING" size="200"/>
      <Column id="PGM_ID" type="STRING" size="200"/>
      <Column id="SYS_ID" type="STRING" size="22"/>
    </ColumnInfo>
    <Rows> SYS_ID">10000</Col>
      </Row>
  <Row>
        <Col id="MENU_CD">10507</Col>
        <Col id="UP_MENU_CD">10500</Col>
        <Col id="MENU_NM">FILE</Col>
        <Col id="MENU_LVL">2</Col>
        <Col id="PGM_PATH">smp::smpFile.xfdl</Col>
        <Col id="SYS_ID">10000</Col>
      </Row>
          </Rows>
  </Dataset>
<Variable id="gv_topMenu"/>
==============================================================================================================

- 그래픽 카드 드라이버 설치 ==> https://h30491.www3.hp.com/t5/user/viewprofilepage/user-id/26517
A. INTEL 그래픽 카드 드라이버 설치  
1. 20.19.15.444 REV.A 다운로드  ==> sp75984.exe(성공)
B. INTEL 그래픽 카드 드라이버 설치 후 재시작
1.  Windows에서 필요한 드라이버를 로드할 수 없기 때문에 해당 장치가 올바르게 작동하지 않습니다. (코드 31)
-----------------------------------------------------------

B. AMD 그래픽 카드 드라이버 설치
1. 15.201.1101.1005 다운로드 ==> sp74524.exe(실패)
2. 15.201.1701.1005 다운로드 ==> sp74141.exe(실패)
3. 15.20 Rev.A 다운로드 ==> sp72689.exe(실패) 
-----------------------------------------------------------
  
- 장치 관리자에서 아래 드라이버 노란 경고 이미지 발생  
 1. AMD Radeon R7 M340(디스플레이 어댑터)
==> 장치상태:Windows에서 필요한 드라이버를 로드할 수 없기 때문에 해당 장치가 올바르게 작동하지 않습니다. (코드 31)
 2. Intel(R) HD Graphics 520(디스플레이 어댑터)
==> 장치상태: 이 장치에서 문제가 보고되었기 때문에 장치를 중지했습니다. (코드 43) 
==============================================================================================================

- 그래픽 카드 드라이버 설치(해결) 
1. 장치 관리자에서 AMD Radeon R7 M340(디스플레이 어댑터) 삭제 후. OS 재 시작
2. INTEL 그래픽 카드 드라이버 설치(/> sp75984.exe) 후 OS 재 시작
3. AMD Radeon R7 M340가 설치되었다고 알람 뜸
4. 장치 관리자에서 AMD Radeon R7 M340, Intel(R) HD Graphics 520가 정상적으로 보임
==============================================================================================================
  
- PC 비밀번호 설정(윈도우7 사용자계정 변경하는 방법)
1. 설정 ==> 제어판\사용자 계정 및 가족 보호\사용자 계정 > 암호 만들기 ==> as**  --> 변경 처리됨 @@@  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.26(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:20 ~ 21:00  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리 
 1) 수입 B/L 등록대상조회(TI::TI10301.xfdl)
 ==> B/L 등록(TI::TI10301_Popup.xfdl)   --> 완료 @@@
 --> Function Name: Z_TI_BL_SAVE_DOCUMENT  @@@@  ==> 등록(TI::TI10301_Popup.xfdl) 
==============================================================================================================

- getRowCount 에러
1. 보통 DS이 없으면 나는 에러 ==> DS 생성할 것
uxs (2740): SE 10:57:50:660 TypeError: Cannot call method 'getRowCount' of undefined
==============================================================================================================

- 서울행
18:30 퇴근(현대오일뱅크 수출입 통관 개발 Prj(대산 공장) :오수석 차)
19:00 출발
21:30 상현역(신분당선) 도착
21:40 상현역 출발
21:45 대림역 도착
22:00 귀가
22:10 석식
22:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.27(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 18:10 ==>   
- 주말  
09:00 기상 
11:00 중식 
12:00 집출발
12:10 신당역
12:30 승진완구 ==> 장난감 구입(버스/빨강 SK3734(나비타, 31,500원, 수종 선물): 승진토이궁전
13:00 종료
13:30 성동공고 승차(421번 버스)
14:30 고속터미널 도착
15:00 고속터미널 승차(6411번 버스) 
16:00 대림역: 자전거  
16:30 귀가 
17:00 낮잠
20:00 기상
20:10 석식 
24:00 취침
==============================================================================================================

- 축구화 끈 구입
1. 다샵 에어컨커버 구입, 가격: 19,900원
http://www.wemakeprice.com/deal/adeal/1399721
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.28(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 

▦ 조기축구 
06:00 기상 
06:20 자전거(문영APT -> 대림운동장) 
06:30 대림운동장(최선형이 다마스로 짐 옮겨다 놓음)
08:10 숏게임 
08:30 게임(신오 조기회) ==> 4게임함 
11:55 종료 
12:10 대림3동 조기회 1분기 회계 감사 ==> 회를 위해 일하다 사고나면 보상 해주는 방안 추후 회의에서 논의하기로 함
12:30 중식(두루치기: 우리 감자탕): 회에서 쏨  
13:30 종료 
14:50 귀가
15:00 낮잠
17:00 기상
18:00 석식(우동2, 짜장면):  배달, 만다린 
18:30 메모 정리
20:10 집출발
20:20 대림역
21:40 구성역
21:50 구성역 1번 출구 ==> 오상민 수석 차에 승차
23:40 숙소(코지 하우스, 대산고 근처) 도착
01:00 취침 
==============================================================================================================

- 축구화 할인 사이트
1. http://www.crazy11.co.kr/shop/mypage.html
2/. 미즈노 모나르시다 네오 II JP (P1GA172009) 일본산, 175,000원 (24%↓)
http://www.crazy11.co.kr/shop/shopdetail.html?branduid=780214&xcode=&mcode=&scode=&GfDT=aWl3UQ%3D%3D
==============================================================================================================

- 축구화 끈 구입
1. 신발끈(고무끈 평끈, 150mm, 빨간, 검정색, 2개), 가격: 9,500원
 http://storefarm.naver.com/two2/products/663509379
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.29(월) 작업■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 22:30  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리   
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
  ==> B/L 등록(TI::TI10302_Popup.xfdl)
==============================================================================================================

- 버튼 Class 설정, visible 설정
this.btnSave.set_cssclass(""); // 저장 버튼 Class(btn_pop_OK) 
this.btnSave.set_visible(false); // 저장 버튼 inVisible
this.btnSave.set_visible(true); // 수정 버튼 visible
==============================================================================================================

- transaction에서 InDatasets, OutDatasets 처리
/****************************************************************************************
 * Description     :  ufn_getBLData 
 ****************************************************************************************/ 
this.ufn_getBLData = function()
{  
	 this.dsIMS_ZTITBLK.copyData(this.dsEX_ZTITBLK);  // DS 복사 @@@
	  
	 var strSvcId = "TI10301_PopupRfc"; 
	 var strSvcUrl = "/TI/selectTiBlRegDtlA.do";  // strSvcUrl: Z_TI_BL_RFC_CREATE(B/L등록목록상세조회)
	 var inData = = "dsIMT_ZTIS_PKEY=dsIMT_ZTIS_PKEY_02";   // inData(WAS 서버 jco에서 IMT_ZTIS_PKEY 설정 해줌, dsIMT_ZTIS_PKEY_02: 임의의 DS) 
	 var outData = "dsET_LIST=dsET_LIST_W";  // outData(WAS 서버 jco에서 dsET_LIST_W 설정 해줌, dsET_LIST: 임의의 DS)
	 var strArg ="";
	 var callBackFnc = "fn_callback";
	 var svcType = "R";
	 var isAsync = true;
	 var bWait = true;

	 this.gfn_transaction(strSvcId, strSvcUrl, inData, outData, strArg, callBackFnc, svcType, isAsync, bWait);
}
==============================================================================================================
- MSI GE60_2OE)에 SSD 설치 문의
1. MSI GE60_2OE) 구입(집에서 사용하는 노트북)에 삼성 SSD PM851 mSATA 시리즈 128G MSI 노트북에 장착되어 있음.
 1) 삼성 850 EVO mSATA 시리즈 512G 설치 가능 여부 문의  ==> MSI 콜센터 전화 통화 중
==============================================================================================================

- TI10302_Popup_A02_save 저장 에러
01. dsET_RETURN(리턴 매개변수 DS)  @@@@@@@@   -- 메시지 유형: S 성공, E 오류, W 경고, I 정보, A 중단 @@@\
==> 해결: 원본여부(BLAYN)를 사본으로 설정하면 됨
<Dataset id="dsET_RETURN">
 <ColumnInfo>
  <Column id="TYPE" type="string" size="32"  />
  <Column id="ID" type="string" size="32"  />
  <Column id="NUMBER" type="string" size="32"  />
  <Column id="MESSAGE" type="string" size="32"  />
  <Column id="LOG_NO" type="string" size="32"  />
  <Column id="LOG_MSG_NO" type="string" size="32"  />
  <Column id="MESSAGE_V1" type="string" size="32"  />
  <Column id="MESSAGE_V2" type="string" size="32"  />
  <Column id="MESSAGE_V3" type="string" size="32"  />
  <Column id="MESSAGE_V4" type="string" size="32"  />
  <Column id="PARAMETER" type="string" size="32"  />
  <Column id="ROW" type="string" size="32"  />
  <Column id="FIELD" type="string" size="32"  />
  <Column id="SYSTEM" type="string" size="32"  />
 </ColumnInfo>
 <Rows>
  <Row>
   <Col id="TYPE">E</Col>
   <Col id="ID">ZMTI00</Col>
   <Col id="NUMBER">915</Col>
   <Col id="MESSAGE" />
   <Col id="LOG_NO" />
   <Col id="LOG_MSG_NO">000000</Col>
   <Col id="MESSAGE_V1">원본입수일</Col>
   <Col id="MESSAGE_V2" />
   <Col id="MESSAGE_V3" />
   <Col id="MESSAGE_V4" />
   <Col id="PARAMETER" />
   <Col id="ROW">0</Col>
   <Col id="FIELD" />
   <Col id="SYSTEM" />
  </Row>
 </Rows>
</Dataset
==============================================================================================================
  
- 오수석과 한바탕 함(22시)
1. 너무 쪼으고 하나하나 잔소리가 심함 ==> 편의점에서 음료수 사먹으면서 품
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.30(화) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:40  ==>  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리   
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
  ==> B/L 분할(TI::TI10302_PopupSplt.xfdl)
==============================================================================================================

- 원본 B/L일 경우 원본입수일(OJRDT)이 필요(저장(TI10302_Popup_A02_save)시 에러 발생)
<ColumnInfo>
  <Column id="itemCd" type="STRING" size="256"/>
  <Column id="itemNm" type="STRING" size="256"/>
</ColumnInfo>
<Rows>
  <Row>
    <Col id="itemCd">O</Col>
    <Col id="itemNm">원본 B/L</Col>
  </Row>
  <Row>
    <Col id="itemCd">D</Col>
    <Col id="itemNm">사본 B/L</Col>
  </Row>
</Rows>
==============================================================================================================

- B/L 분할 논의
IBLIT    B/L 품목 번호 
--> 1로 던지기
IBLPT   B/L 품목 분할 번호 
--> Grd : 0001 --> 1씩 자동 증가 @@@
BLDST_S   선적서류 상태  --> NULL 값  @@@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.05.31(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 20:20  ==> 석식(김밥, 라면: 10,500원, 오상민 수석): 청구할 것  

- 현대오일뱅크 수출입 통관 개발 Prj 
1. 수입 B/L 관리   
 2) 수입 B/L 등록목록조회(TI::TI10302.xfdl)
  ==> B/L 분할(TI::TI10302_PopupSplt.xfdl) ==> 완료 @@@
  ==> 통관요청(TI::TI10302.xfdl) ==> 완료 @@
==============================================================================================================

- Windows 탐색기 즐겨찾기 @@@@
다운로드[★★★]
00. 다운로드 Back_up
문서[★★]
01. Back_up [☎  즐겨찾기 ☎]
01. Memo [D] === [■, ★★★★, ■] === @@@
40. ====== [■, ★★ [개발] ★★, ■] ===== @@@
40_01. 수출입통관시스템구축 Prj[★★]
40_40. 화면설계
40_40.설계
40_50.구축
40_51. 수입_spec
40_52. 수입 Interface 테스트[♥♥♥]
40_61. 수출_Function_Spec
40_62. 수출 Interface 테스트[♥♥♥]
41. ---------------------------------------------  @@@
44_91. hicts_xui(메인 소스)[★★]
44_HoilLibrary
90. Back_up [C] ================== @@@
90_50. 구축 [파일 서버]
90. Portal(WEB) [▦ 파일 서버 ▦]
90_50. 구축 [파일 서버]
90_51. 수입_spec[파일 서버]
90_52. 수입 Interface 테스트[파일 서버] [♥♥]
90_61. 수출_Function_Spec[파일 서버]
90_62. 수출 Interface 테스트[파일 서버] [♥♥]
99. ---------------------------------------------  @@@ 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
