

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2017.04) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 

■■■■■■■■■■■■■■■■■■ 2017.04.01(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 주말
06:00 기상
06:20 다리 아파서 축구 안 나감
09:40 조식(라면)
10:30 아파트 놀이터(수종)
12:30 종료
13:00 중식
14:00 수종, 루옌 나들이
16:00 수종, 루옌 귀가 
19:00 석식
00:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.02(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==>  

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)
06:30 대림운동장  
08:10 숏게임
08:00 게임(신길 5동 조기회) ==> 3게임함
12:00 종료
12:30 중식(김치찌게: 철희형 오징어집): 회에서 쏨
13:30 종료
14:00 선이 형 가게(형들 카드하고 있음)
15:00 서울식당(맥주: 수춘이형, 선이형, 태우)
17:10 종료 
17:20 대림운동장
18:00 게임(은혜교회 2:0 교회팀[흰 유니폼]): 레프트 윙, 대운이하고 같이 뜀 ==> 영만이형이 교회 집사
18:58 종료 
19:20 귀가 
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.03(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 구종식 부장, 김찬흠 부장 철수, 본사 대기

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 전자정부 표준프레임워크 강좌
https://www.youtube.com/watch?v=0VI4wR5YfzU&index=15&list=PLtaqZ9UjPhXDsTged2wrs1gHiXf5EHZ5Y  
1. 표준프레임워크 버전 3.5 이해 
https://www.youtube.com/watch?v=NVTGNTPH00E&index=5&list=PLtaqZ9UjPhXDsTged2wrs1gHiXf5EHZ5Y
==============================================================================================================
 
- Heidi SQL
1. HeidiSQL 설치 및 사용방법(MySQL, MSSQL and PostgreSQL made easy) ==> http://h5bak.tistory.com/277
2. https://www.youtube.com/watch?v=-MzQRdw7RzU
---------------------------------------------------------------------------------------------------------

- Maria DB(오픈 소스: 무료)
1. https://www.youtube.com/watch?v=hfpbCknpISo 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.04(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>  

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- HP ProBook 4530s 노트북에 SSD 256GB 설치
1. 삼성 SSD 830 Series 256GB(개인 것)를 설치 ==> 기존 히타치 500GB HDD 떼내고 OS 다시 설치(노트북 가방에 보관할 것)
==============================================================================================================

- Windows용 64비트 Java(JRE) 설치
1. 무료 Java 다운로드 ==> https://java.com/ko/download  --> jre-8u121-windows-x64.exe(더블 클릭 => 실행)

C:\Users\Administrator>java -vserion
Unrecognized option: -vserion
Error: Could not create the Java Virtual Machine.
Error: A fatal exception has occurred. Program will exit.
==============================================================================================================

- bimatrix 교육
1. 사내 강사: 김민수 차장
2. 내용
 1) DB Data 가져오기(SQL Query로 처리: 중요) 
 2) 가져온 DB Data를 Excel을  이용해서 조작(Pivet: Excel 기반)  
 3) bimatrix 교육 자료 ==> http://support.bimatrix.co.kr:8080/matrix5/eduinfo,  edu / edu10
--------------------------------------------------------------------------------------------------------

- 웹스퀘어 교육
1. 사내 강사: 진태만 부장
==============================================================================================================

- 전화상담(17:30, 어린이집)
1. 수종이 미소반 선생님과 전화 통화
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.05(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>  

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- ncs01_요구사항확인, 유스케이스 다이어그램, 클래스 다이어그램, ERD 동영상 강의 시청 ==> 분석, 설계
https://www.youtube.com/watch?v=T-Kefezhc_k

1. Object Aid
 1) 시퀀스 다이어그램(유료)
2. 괜찮은 ERD 프로그램[eXERD] :: 세상만사  ==> http://kwssite.tistory.com/137
==============================================================================================================

- X-Up 프로젝트 분석
1. 현대오일뱅크 대산 보산(충청남도 서산시 대산읍 평신2로 182)
2. 프로젝트 투입 예상일: 2017.04.24(월)
3. SAP ERP --> JCO(RFC) --> X-Up(RFC 함수를 Nexacro로 연결해주는 매개체: eclipse에서 구현) --> Nexacro
 1) RFC: SAP과 타시스템 간에 인터페이스를 돕는 역할이 SAP PO이고, 그 안의 함수를 RFC(Remote Function Call)
- SAP과 SAP RFC와 SAP JCO의 관계  ==> http://derveljunit.tistory.com/102
==> JCO는 자바로 SAP ERP 시스템과 통신하기 위해 SAP에서 제공하는 Middle Ware이다. 
==============================================================================================================

- SAP 분석
- Java JCo 3.0 Client를 이용해 SAP Function 사용하기
http://wonzopein.com/70

- SAP JCO에 대해 정리가 잘 되어있는 사이트
http://laily.tistory.com/22

- [SAP] 개인 PC에서 JDK 설치에서 JCO 테스트까지
http://blog.naver.com/flyingpig02/70001644566

- JCO 서버 설정
http://itpe.me/549-2/

- [SAP] JCO를 이용한 JAVA와 SAP의 연동 : 네이버 블로그
http://blog.naver.com/PostView.nhn?blogId=kst7132&logNo=140128160883

- SAP Jco Connector를 이용한 Java 에서 SAP 함수 호출하기
http://iheedol.tistory.com/entry/SAP-Jco-Connector%EB%A5%BC-%EC%9D%B4%EC%9A%A9%ED%95%9C-Java-%EC%97%90%EC
%84%9C-SAP-%ED%95%A8%EC%88%98-%ED%98%B8%EC%B6%9C%ED%95%98%EA%B8%B0 

- 자바(java)에서 SAP 연계하여 데이터 조회
http://nicebury.tistory.com/117
==============================================================================================================

- Win7 USB 부팅 디스크 만들기
1. USB 부팅 디스크 만드는 프로그램: Windows7-USB-DVD-tool.exe'
2. 정품 CD: windows7-all.iso
3. USB 메모리 준비하기(최소 4G 이상)  ==> 8G 추천
http://imrich.tistory.com/959
https://www.youtube.com/watch?v=YasIXqxTA74 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.06(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>  

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 경력기술 프로필 추가
1. 2월 추가
==============================================================================================================

- [비지니스] 나의 PM 이야기를 시작하며….
http://daitso.kds.co.kr/56926/
1. [비지니스] 나의 PM이야기 #1 프로젝트 착수, 인력투입
http://daitso.kds.co.kr/28372/
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.07(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>  

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 혼자서 모바일 앱 기획부터 개발까지
1. https://www.slideshare.net/aksmj/ss-47849372
--------------------------------------------------------------------------------------------------------

- 2017 Do it! 안드로이드 앱 프로그래밍 [개정 4판 누가(7.0) 버전]
1. https://www.youtube.com/watch?v=9J5Z_pyqP_s&list=PLG7te9eYUi7sj1mAKtunTzO7s_jPxez-e
==============================================================================================================

- 스위프트로 시작하는 아이폰 앱 개발 교과서 1차 0강
https://www.youtube.com/watch?v=1tJfpVrO_b4

- Do it! 아이폰 앱 프로그래밍<iOS 9 버전 전면 개정 2판 >
http://www.easyspub.co.kr/20_Menu/BookView/96
==============================================================================================================

- 대림3 축구회 소개
대림3동 축구회는 1973년 1대 윤덕기 회장님을 필두로 시작하여 41대 이상길 회장님에 이르고 있습니다. 총 80여명의 
회원으로 구성된 대림3동 축구회는 "대림축구회 우리는 하나"라는 회 슬로건을 바탕으로 회원간의 화합과 사랑을 중요시
하는 축구회 입니다. 40년이 넘는 세월동안 연합회장기 및 구청장기 여러 단일 회장기에서 각종 우수한 성적을 거두었습니다. 
영등포구 모든 축구회가 하나이듯 하나된 대림3동 축구회가 발전해 나가는데 많은 관심과 격려 부탁드립니다.
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2017.04.08(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 90, 91 동기회(비회원으로 참석)

- 주말
06:00 기상
06:20 자전거(문영APT -> 대림운동장)
06:30 대림운동장
07:10 숏게임
08:00 종료
08:20 조식(북어국, 우리 감자탕, 6명) ==> 전태성 고문님이 쏨
09:30 귀가
10:40 낮잠
14:00 기상
15:00 집출발
15:10 대림역 -> 안국역(6번 출구)
15:40 별다방 미스리 도착(태용, 상환, 호수, 일남, 인선): 커피(6천원)
16:30 인사동(후남, 광석, 종환 도착)
17:30 아쿠탕집(현용 도착) ==> 동기회에서 해외 여행 가자고 함
19:00 천계천 --> 방산 시장
19:30 술집(방산 시장내, 2층, 전, 김밥)
21:30 한잔포차(동대 후문)
22:50 창 노래방(3층, 후남, 인선 잘 놈) ==> 후남 택시타고 감
01:00 호프집(현대레지던스 근처, 현용, 호수, 종환, 광석, 인선)
03:30 종료
03:50 현대레지던스 호텔 투숙
04:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.09(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 축구 못함

▦ 조기축구
09:30 기상(현대레지던스 호텔): 칫솔, 치약 없음
10:40 현대레지던스 호텔 1층 로비
10:50 조식(오장동흥남집, 물냉면:맛 있었음): 회냉면이 유명함  
11:30 모임 종료
11:40 을지로4가역 -> 대림역
12:30 우리 감자탕집
13:20 택시(이상길 회장, 최선 총무, 태우) --> 오목교역
13:50 힘찬병원(김승중 단장님이 어깨 아파서 입원)
14:20 횟집(김승중 단장이 쏨)
	==> 수춘이형 부장(관리자)된다고 함
16:00 종료 
16:20 최선형 가게(탕수육)
18:00 종료
18:20 귀가
18:30 루옌, 수종 귀가
22:40 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.10(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 구종식 부장, 김찬흠 부장 대명 라이프웨이 회의 갔다옴(별로 기대 안함)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.11(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 회사 홈페이지 개편 지시 
1. http://gidata.co.kr/page/target.php?theme=login  ==> admin, / adm1472,
2. 호스팅 업체(한비로): http://mypage.hanbiro.com/index.asp?l=2  --> hanbiro@hanbiro.com --> 1544 - 4755
 1) 호스팅(Gidata) ==> http://mypage.hanbiro.com ==> gidata / adm1472
-----------------------------------------------------------------------------------------------

3. 수정 페이지
 1) 회사소개 > 연혁
==> http://gidata.co.kr/page/target.php?theme=history  -->  /page/history.php
 2) 사업영역 > 수행실적
==> http://gidata.co.kr/page/target.php?theme=performance --> /page/performance.php
==============================================================================================================
 
- 응원도구 검색
1. 최저가/9색상/막대풍선/10쌍20개입/응원도구/응원용품
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=153377966&GoodsSale=Y&jaehuid=200002673
2. 응원깃발//응원 운동회 용품 도구 소품
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=716179918&GoodsSale=Y&jaehuid=200002673
3. 파티쇼 태극기 머리띠
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A540030699&frm3=V2
4. 축구공짝짝이비눗방울/응원도구
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=810228035&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
 
- 단체 도시락 주문 검색
1. 한솥 도시락
http://www.hsd.co.kr/lunch/orderLunchList.html
2. 알뜰 도시락
https://www.iobong.com:5005/ob_menu/menu1/menu1.php
3. 본 도시락
http://www.bonif.co.kr/brand/menu_list2.asp
4. 정담 도시락
http://jungdamdosirak.co.kr/sub/menu.php
5. 예림푸드(모락모락)
http://www.modorak.com/new/order/list.php
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.12(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 응원도구 구입
1. 최저가/9색상/막대풍선/10쌍20개입/응원도구/응원용품 ==> 막대풍선 20개, 머리띠 10개, 가격: 23,800원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=153377966&GoodsSale=Y&jaehuid=200002673 
==============================================================================================================
 
- 수종 병원 예약(16시, 고대구로병원)
1. https://guro.kumc.or.kr  --> tamario, / tama339@,  
2. 2017.04.12(수) 16시 이비인후과 채성원 교수 
-----------------------------------------------------------------------------------------------------

- 수종 대학 병원 치료
11:20 퇴근 
11:40 선릉역 정류장 출발
12:50 대림역 정류장 도착
13:20 김밥 2줄, 떡 3개 구입(대림역 노점)
13:30 귀가
13:40 중식(김밥2, 떡 2개)
15:30 집출발
15:35 대림3동 어린이집(수종 데려옴)
15:50 고대구로병원 접수
16:10 고대구로병원 진료: 귀 검사(오른쪽 귀에 물이 찼다고 함) ==> 약 없이 3주 후에 다시 오라고 함, 동네 병원에
        가서 진단 받는다고 함
16:40 종료
17:00 진료(서울가정의학과의원): 수종 감기
17:10 조제(래미안 나나 약국): 수종 감기
17:30 구로리 놀이터(수종)
18:30 귀가
19:30 석식
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.13(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 루옌 한국 입국 4주년 행사(케익)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 파피콘 만들기 - 인터넷창 탭에 들어있는 아이콘 이미지(favicon)
1. http://sowoonnim.tistory.com/30
==============================================================================================================

- 응원도구 구입[2017.04.13(목)]
1. 최저가/9색상/막대풍선/10쌍20개입/응원도구/응원용품 ==> 막대풍선 20개, 가격: 7,500원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=153377966&GoodsSale=Y&jaehuid=200002673 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.14(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==> 장모님 마중(19:30, 고속버스터미널)

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 프로젝트 정보(이석부 사장님 회의)
1. 국민건강보험공단 프로젝트
 1) MP --> WebSquare로 변환
 2) 예스 오태범 사장이 Inswave 영업을 통해서 가져온 정보
 3) 4월 하순에 발표 난다고 함(원주)
2. (주)투비소프트에서 자기네 직원들 우선으로 프로젝트를 배정(협력사를 배제한다고 함)
==============================================================================================================

- 장모님 내과 진료 예약(11시, 속편한 내과 진료)
1. 장소: 속편한 내과  ==> http://www.sok88.net
2. 장모님 위 내시경 검사 예약
 1) 내시경 검사 하루 전에 반 22시 이후 금식, 물도 없으면 안됨
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.15(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 주말
06:00 기상
06:30 집출발
06:40 대림운동장
07:10 숏게임
08:00 종료
08:20 조식(북어국, 우리 감자탕) ==> 도신 회장님이 쏨
09:30 귀가
09:40 진료(서울가정의학과의원): 수종 감기
10:10 조제(래미안 나나 약국): 수종 감기
10:30 집출발
10:40 택시(대림역 -> 속편한 내과): 3,000원
11:00 진료(초음파검사, 수면내시경검사)
	==> 원장님이 위가 헐었다고 함(위궤양), 췌장에 돌이 있다고 함(담석증), 1주일 약먹고 경과를 지켜보자고 함
13:20 종료
13:30 택시(속편한 내과 -> 대림역): 3,400원
13:50 귀가
14:00 중식(붕어빵)
14:30 최선형 가게
16:00 홈플러스 문래점(라면 1박스 구입): 최선형 다마스 차
16:30 영등포청구물 시장(바나나 2박스, 방울토마토)
17:00 창고(짐정리: 골기퍼 장갑 새것 찾음)
17:20 강고문님 댁(3층): 맥주 얻어 먹음(겉저리) --> 강고무님, 김승중 단장님, 최선형 --> 선완이 내시로 나오는 서태후
        드라마 시청(연기 매우 잘 함)
18:30 종료
19:00 귀가
20:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.16(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 제40회 협회장기 축구 대회(08시, 양천운동장)

▦ 조기축구
06:00 기상(물 냉동 시킨 것 4개, 응원도구 챙김)
06:20 자전거(문영APT -> 대림운동장)
06:30 최선형 가게
06:40 다마스 짐을 봉고차에 싣기
07:00 다솜에 가서 음식 싣기
07:10 출발
07:25 양천운동장 도착
08:00 개회식(막대풍선(40개), 머리띠(10개) 나눠줌) ==> 가족들이 많이 나와서 입장상 3등 함
09:30 40대 시합(A구장) ==> 대림3동 2(1): 2(3) 신길1동 --> 승부차기 패로 예선 탈락[선수가 12명 밖에 없었음,
	전반 최선형이 한골 넣음, 서상배형이 후반에 교체되어서 한 골 넣음, 레프트위으로 뜀, 리사드 마크함)
	==> 50대에서 서상배, 김대중, 김동주 3명이 내려옴
11:30 중식(북어국: 운동장)
12:30 당산초교로 이동
15:30 30대 2번째시합 ==> 대림3동 1:2 신광 --> 선수가 11명 밖에 안됨(창구형, 수춘이형도 뜀), 영훈이를 윙백 시켜서
	PK 먹고 짐
	==> 50대에서 윤창구, 이수춘 2명이 내려옴
16:30 종료
17:00 대동초교로 이동
15:00 50대 2번째시합 ==> 대림3동 1(5): 1(4) 신길5동 --> 68년생이 많이 뛰었는데도 비김, 승부차기로 4강 진출
18:10 종료
18:20 다솜 식당(삼겹살, 주물럭, 냉면): 최선형 일찍 귀가함
19:30 종료
19:50 귀가
21:00 취침
==============================================================================================================

- 승부차기 @@@
- [스포츠 사이언스] 페널티킥, 무조건 성공하려면?
https://www.youtube.com/watch?v=ei_amWwE1Qw

- 성공 확률이 높은 페널티킥 방향은?
https://www.youtube.com/watch?v=n4EAHmMtp-I

- 승부차기때 골키퍼 특급 꿀팁.. (이래서 전문가구나...)
https://www.youtube.com/watch?v=QuF_XeKWDBo

- 2014 브라질 월드컵 승부차기와 페널티킥에 숨은 심리학
https://www.youtube.com/watch?v=9v3Py948vKs
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.17(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.18(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================
 
- [토크멘터리 전쟁史] 28부. 칭기즈칸의 정복전쟁
https://www.youtube.com/watch?v=DtDht-xfwk8
==============================================================================================================

- 장난감 버스(수종이 어린이날 선물)
1. 뉴에어포트 리무진 버스, G마켓, 가격: 23,100원
http://item2.gmarket.co.kr/Item/detailview/Item.aspx?goodscode=883471558&GoodsSale=Y&jaehuid=200002673
==============================================================================================================
 
- LotteWorldTower Prj 지원(10시)
1. 서문여고 Prj, 박준형 사원(010-3810-2193, pjh83@gidata.co.kr)
2, 다음주 금요일 오픈 예정(다음주 금욜까지 지원) ==> java, jsp
==============================================================================================================
  
- 오라클 SQL Developer 설치 및 연결
1 접속 이름(N): lwtsts
2. 사용자 이름(U): stsadmin
3. 비밀번호(P): stsadmin
4. 오라클
 1) 접속 유형(Y): 기본, 롤(L): 기본값
 2) 호스트 이름(A): localhost
 3) 포트(R): 11111
 4) SID(I): lwtsts
== > SID: lwtsts, ---> stsadmin / stsadmin
==============================================================================================================

- PUTTY 연결
1. Host Name: 124.243.43.139, Port: 22 
2. Saved Sesseions: 01. LotteWorldTower
3. 터널(/Connection > SSH > Turnnels
 1) Source PORT: 11111
 2) Destination: 10.127.1.160:1521
   ==> hmpmng, hmpmng123,
------------------------------------------------------------------------------------------------------

- mtputty 설치
https://www.youtube.com/watch?v=0c1cWrMnZlc
1. 다운로드 받아 설치한 후, 기존에 쁘띠 위치를 지정해주면 끝!
뿌띠에 넣어뒀던 설정을 자기가 불러와서 보여준다.
2. 설치 순서
 1) putty.exe 설치
 2) MTPuTTY_setup.exe 설치
 3) MTPuTTY 실행 
  가. PUTTY location에서 PUTTY location(putty가 실행될 위치): C:\LotteWorldTower\putty.exe --> Ok(클릭) 
==============================================================================================================
 
- LotteWorldTower Prj IP 주소 설정(IP 설정) 
1. IP 주소: 211.56.253.184
2. S/M: 255.255.255.192
3. GW: 211.56.253.129
4. 기본 DNS: 168.126.63.1
   보조 DNS: 8.8.8.8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.19(수) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:30  ==>

- LotteWorldTower Prj 지원
1. 홀 예약 관리
 1) 홀 예약 조회(홀 예약 가능 여부 조회, 예약 선택))(/probDateList.jsp)
  가. 예약 불가 조건
==> 1. 인원이 해당 홀보다 같거나 적을 것  ==> 1) SKY Hall(220석), 2) SUN Hall(180석) 등...
==> 2. 이용시간(6개 조건) 
==> 3. 예약여부(RC: 예약 완료)  ==> CC: 예약 취소, EE:행사 종료 
==> 4. 해당 날짜가 오늘보다 작거나 같으면 
==============================================================================================================

- LotteWorldTower Prj 회의
1. 일정 ==> 다음주 까지 불가능 --> 5월 말까지 가능하다고 답변
2. PM이 비용 문제 재기 한다고 함
==============================================================================================================

- JSP 로그
<%out.println("[/index.jsp] [TEST]"); %> 
log.debug("[/HallController.java] [registView()] [TEST]");
log.debug("[/HallController.java] [HttpServletRequest()] [vo]"+ vo ); 
alert("[/HallController.java] [registView()] [TEST]");
==============================================================================================================

- elipse 실행 에러(Publishing failed 에러)
1. 현상:  
Publishing failed with multiple errors
Error reading file C:\LotteWorldTower\workspace2\hmp_mng\target\xmlbeans-xmlbeans-2.3.0.jar
C:\LotteWorldTower\workspace2\hmp_mng\target\xmlbeans-xmlbeans-2.3.0.jar (지정된 파일을 찾을 수 없습니다)
Error reading file C:\LotteWorldTower\workspace2\hmp_mng\target\org.apache.xmlbeans-xmlbeans-2.3.0.jar
C:\LotteWorldTower\workspace2\hmp_mng\target\org.apache.xmlbeans-xmlbeans-2.3.0.jar (지정된 파일을 찾을 수 없습니다)
2. 조치: xmlbeans-xmlbeans-2.3.0.jar, org.apache.xmlbeans-xmlbeans-2.3.0.jar 파일이 실제 미 존재(복사해 넣음)
==============================================================================================================

- SQL Formatter 설정
1. Standard Formatting
 1) Indent: \t		2) Indent Width: 700
 3) Max Width: 900
2. Expand Comma Lists
 1) Space After Comma: 체크
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.20(목) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 18:00  ==>

- LotteWorldTower Prj 지원
1. 홀 예약 관리
 1) 홀 예약 조회(홀 예약 가능 여부 조회, 예약 선택))(/probDateList.jsp)
  가. 예약 불가 조건
==> 1. 인원이 해당 홀보다 같거나 적을 것  ==> 1) SKY Hall(220석), 2) SUN Hall(180석) 등...
==> 2. 이용시간(6개 조건) 
==> 3. 예약여부(RC: 예약 완료)  ==> CC: 예약 취소, EE:행사 종료 
==> 4. 해당 날짜가 오늘보다 작거나 같으면 
==============================================================================================================

- JSTL IF 조건문
<c:if test="#{bean.booleanValue}" />
<c:if test="#{bean.intValue gt 10}" />
<c:if test="#{bean.objectValue eq null}" />
<c:if test="#{bean.stringValue ne 'someValue'}" />
<c:if test="#{not empty bean.collectionValue}" />
<c:if test="#{not bean.booleanValue and bean.intValue ne 0}" />
<c:if test="#{bean.enumValue eq 'ONE' or bean.enumValue eq 'TWO'}" />
==============================================================================================================

- LotteWorldTower Prj 회의
1. 4월 말까지 무조건 개발 완료하라고 함 ==> 불가능, 능력없다고 답변 --> 결론 안 남
 1) 내가 기획, DB 설계 문제를 지적 --> 기획자 개발 참여 요구
2. 업체 최상위 고객이 비용 문제 재기 ==> 하위 업체는 반발 ==> 박형준씨에게 진척도 메일로 보내라고 요구
==============================================================================================================

- jquery 강좌(동영상 강의)
https://www.youtube.com/watch?v=RmRGAOjKpRU&list=PLdajQmV2DgoR_VtxvBsBW9n6w9O1GqqKk
1. jQuery Tutorial
https://www.w3schools.com/jquery/default.asp

- jQuery 예제 @@@
<!DOCTYPE html>
<html>
<head>
<script src="https://ajax.googleapis.com/ajax/libs/jquery/3.2.0/jquery.min.js"></script>
<script>
$(document).ready(function(){
    $("p").click(function(){
        $(this).hide();
    });
});
</script>
</head>
<body>

<p>If you click on me, I will disappear.</p>
<p>Click me away!</p>
<p>Click me too!</p>

</body>
</html> 
==============================================================================================================
 
- 로지텍 MK240 마우스, 키보드 콤보 밧데리 수명 만료[구입: 2016.11.24(목)]
1. 밧데리 수명(키보드: 2명, 마우스: 1년, AA 2개), 가격: 27,280원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B239830970&frm3=V2 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.21(금) 작업■■■■■■■■■■■■■■■■■■
---> 08:30 ~ 19:00  ==> LotteWorldTower Prj 철수(10시), 본사 복귀(13시)

- LotteWorldTower Prj 지원
1. 홀 예약 관리
 1) 홀 예약 조회(홀 예약 가능 여부 조회, 예약 선택))(/probDateList.jsp)
  가. 예약 불가 조건
==> 1. 인원이 해당 홀보다 같거나 적을 것  ==> 1) SKY Hall(220석), 2) SUN Hall(180석) 등...
==> 2. 이용시간(6개 조건) 
==> 3. 예약여부(RC: 예약 완료)  ==> CC: 예약 취소, EE:행사 종료 
==> 4. 해당 날짜가 오늘보다 작거나 같으면 
==============================================================================================================

- Oracle 한글 깨짐 현상
http://babtingdev.tistory.com/67 
시작 -> 실행 > regedit으로 레지스트리 편집기를 열고, " HKEY_LOCAL_MACHINE\SOFTWARE\ORACLE\ "의 
하위 폴더에보면 자신의 오라클베이스폴더가 있습니다. 그것을 클릭해보면 NLS_LANG키가 있는데. 키값을
KOREAN_KOREA.KO16MSWIN949 KOREAN_KOREA.KO16KSC5601 로 바꿔줍니다.
레지스트리편집기를 끈후 다시 시작 -> 실행
cmd로 커맨드입력창을 하나 띄웁니다.
sqlplus /nolog
conn /as sysdba;
update props$ set VALUE$='KO16MSWIN949' where name='NLS_CHARACTERSET';
commit;
shutdown immediate;(데이터베이스를 언마운트 하는작업이라 시간이 걸립니다.)
startup;
 
select name, value$ from sys.props$;
NAME                         VALUE$
--------------------  ----------------
NLS_LANGUAGE         AMERICAN
NLS_TERRITORY         AMERICA
NLS_CHARACTERSET  KO16MSWIN949
 
NLS_LANGUAGE의 값을 AMERICAN -> AMERICAN_AMERICA.KO16MSWIN949로
설정하여 사용해야 합니다.
==============================================================================================================

- 프로젝트 회의(지아이데이타)
1. 대명 상조 Prj
 1) 김찬영 부장 투입 예정
 2) 6 ~8월: 소스 분석, 9월부터 1년 계약
2. 롯데 캐논 Prj
 1) VB, COBEL ==> MP, Nexacro로 변경
 2) 안산 공장 ==> 사이징(다음주 화요일 오태범 사장과 같이 동행 예정)
 3) 5월: 분석, 6월: 시작
3. 키스콤 Prj
 1) VB ==> MP 변경된 소스를  MP ==> Nexacro로 변경하는 프로젝트
 2) 일본어 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.22(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 주말
07:00 기상
08:00 집출발
08:10 택시(대림역 -> 속편한 내과): 3,100원
08:20 진료(초음파검사, 수면내시경검사)
	==> 원장님이 1주일 약먹고 이상이 없으니 2주일 약먹고 아프면 다시 오라고 함(심한 편이 아니라고 함)
	--> 위궤양 추정
09:00 종료
09:10 택시(속편한 내과 -> 대림역): 3,200원
09:20 귀가
09:30 진료(서울가정의학과의원): 수종 감기
09:45 조제(래미안 나나 약국): 수종 감기
10:00 구로리 놀이터(수종) 
11:40 종료
11:50 테이크아웃(뼈해장, 4그릇: 소문난 해장국 식당)
12:00 귀가
12:30 중식(뼈해장국)
14:00 낮잠
18:00 기상 
19:30 석식(뼈해장국)
20:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.23(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 제40회 협회장기 축구 대회(11시, 대림운동장)

▦ 조기축구
06:00 기상
06:10 자전거(문영APT -> 대림운동장)
06:20 창고(심기석형, 최선형 도착)
06:30 도신초교 도착
08:10 숏게임
08:00 게임(도신 조기회) ==> 2게임함
10:30 종료
11:00 대림운동장 도착 
12:00 50대 4강전 ==> 대림3동 3: 1 신길7동 --> 실력으로 이김(결승 진출, 도림하고 결승전함)
13:10 종료
13:30 중식(북어국: 우리 감자탕): 회에서 쏨
	==> 정지경형이 5만원 찬조(총무님이 돈을 내한테 줘서 집에 가지고 옴)
14:10 종료
14:30 귀가 ==> 루옌 장모님 배웅하러 고속터미널에 감
15:00 낮잠
18:00 기상 
19:30 석식(뼈해장국)
20:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.24(월) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 본수 산정
==============================================================================================================
 
- 엔투비 MRO Prj 분석
1. 장   소: 테헤란로 123
2. 자격요건: WebSquare5 UI 공통 모듈 개발
3. 등   급: 고급
4. 기   간: ASAP ~ 2017.07.09
5. 기타: UI 공통(4월 13일 투입 후 교체 요청으로 철수함)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.04.25(화) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- 엔투비 MRO Prj 투입 요청
1. 인스웨이브 김영은 팀장에게 전화해서 엔투비 MRO Prj 투입 요청함
  ==> 엔투비 MRO Prj PM에게 이력서 보내고 면접 일정 잡아준다고 함(10시 40분)
==============================================================================================================

- 핸드폰 액정 보호 필름
1. 다이소: 천원
----------------------------------------------------------------------------------------------------------

- 핸드폰 필름 붙이기 
1. 스마트폰 액정필름 잘 붙이는 법 갤럭시 노트 4 (part 1)  ==> 테이프를 세로로 붙여서 고정하기
https://www.youtube.com/watch?v=c1z0fW_tG5I
 1. Front(Adhesive Film: 접착 필름) ==> 제일 먼저, 스카치 테잎으로 미세먼지 제거할 것
 2. Back(Protective Film: 보호 필름)
 
2. 공사장에서 핸드폰필름붙이기
https://www.youtube.com/watch?v=0g_v3u3k_CU

3. [굿브러시] 갤럭시노트 허그유 액정보호필름 부착 방법
https://www.youtube.com/watch?v=UfVW5IAC-_Q
 
4. 액정필름 붙이는법 기포없이 깔끔하게 : 네이버 블로그
http://blog.naver.com/PostView.nhn?blogId=s2akazee&logNo=40197246075

5. [유니크TV] 집에서 쉽게 곡면 액정필름 붙이기 - 1분안에 가능
https://www.youtube.com/watch?v=9ctaFD7nNDk

6. 액정필름 잘붙이는법 phone shield - mirror screen guard 스크린가드 
https://www.youtube.com/watch?v=NKVD5PcvBmQ
----------------------------------------------------------------------------------------------------------

- 액정필름 구입
1. 핸드폰 케이스/액정필름모음, 가격: 990원
http://www.ticketmonster.co.kr/deal/488074086?opt_deal_srl=488717970&is_adult=N&adult_type=N&keyword=%ED%95%84%EB%A6%84#buy
==============================================================================================================

- SKT 통신사 명의 변경 방법 
1. 가족간명의변경 = 두 분 신분증 + 가족관계증명서 또는 등본
 1) 이 두가지 중 한가지로 맞는거에 맞춰 가면되고요 서류는 필시 양수인, 양도인 신분증 원본 필요합니다. 
==> 서류 지참후 SK 공식인증대리점 가서 하시면 됩니다.
==============================================================================================================

- 로지텍 MK240 마우스, 키보드 콤보 밧데리 구입, 교체[구입: 2016.11.24(목)]
1. 밧데리 수명(키보드: 2명, 마우스: 1년, AA 2개), 가격: 27,280원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B239830970&frm3=V2 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.04.26(수) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- ABLE 모바일프레임웍 기반 모바일 앱 개발 제안요청서 분석
1. 현대파워텍 정보기획팀
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.04.27(목) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2017.04.28(금) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 본사 대기
1. 웹스퀘어 분석
==============================================================================================================

- MS Project를 활용한 거북선 제작 프로젝트
https://www.youtube.com/watch?v=MRaNpy3KTZs

- 못말리는 소프트웨어 공학 동네_1화(코딩편)
https://www.youtube.com/watch?v=c7Ni0yEcMuM
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.29(토) 작업■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00  ==>

- 주말
08:00 기상
09:00 조식(라면)
10:00 집출발
10:30 대림역(6511번 버스)
11:00 봉천중 
11:50 글빛정보도서관(2층: 어린이도서관): 수종에게 책 읽어 줌
13:00 종료
13:50 봉천중앙시장(6511번 버스) 
14:50 대림역: 자전거 --> 구로리 공원
18:00 종료
18:00 귀가
19:00 루옌 귀가 ==> 아르바이트 갔다옴
20:00 석식  
20:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2017.04.30(일) 작업■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:00 ==> 제40회 협회장기 축구 대회(15시, 장훈고) 50대 결승

▦ 조기축구
06:00 기상
06:20 자전거(문영APT -> 대림운동장)
06:30 대림운동장(창고: 병재, 최선형)
08:10 숏게임
08:20 게임(도신 조기회) ==> 3게임함
11:40 종료
12:10 중식(북어국: 우리 감자탕): 회에서 쏨
12:20 최선형이 5월 야유회 내가 주도적으로 진행하라고 해서 못 한다고 함 ==> 최선형이 내가 정색을 하며
        말한다고 화를 냄(서로 엄청 기분 나빴음)
12:30 5월 야유회 관련 회의(우리 감자탕, 도신 임원진) ==> 식사는 대림3동에서 하고 이벤트는 도신에서 하라고
	함 --> 5월 4일(금)에 도신에서 사전 답사 가리고 함
13:20 종료
13:30 강고문님 댁 지하 ==> 구경함
13:40 강고문님 댁 출발(최선형 다마스 차로 출발)
14:10 장훈고 도착
14:30 40대 결승==> 대호 1: 2 양평(양평 우승)
15:30 50대 결승==> 대림3동 2(5): 2(4) 도림 ==> 전반에 종국이형이 한골 PK 한골 넣음 후반에 2골 먹음
	==> PK 골기퍼로 종국이형이 나서서 한골 막음(MVP로 선정)
	==> 회장님이 수비하다가 넘어져 인대가 끊어짐 --> 성앤병원 응급실로 실려감
	==> 전정현형(우리은행장)이 선수 대기하다가 집에 가고 선수 교체 사인이 안 맞아 감독(기석이형)이 최선형에게
	화를 냄: 최선형 총무 안한다고 난리침
	==> 내한테 자기가 별로 시킨 것도 없는데 힘들어 한다고 부총무 그만두라고 함
16:30 종료
17:00 성애병원 응급실 ==> 응급 조치하고 내일 수술한다고 함
17:40 다솜 식당(삼겹살, 주물럭, 냉면): 최선형 화나서 일찍 귀가함(병재에게 법인카드 맡기고 일찍 가버림)
19:30 종료
19:50 귀가
21:00 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
