

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.01) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.01.01(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 22 30 ==> 신정(휴일)
 
- 휴가[★] 
07:40 기상
08:11 조식
08:30 실내 자전거 타기
09:30 종료
09:40 인터넷 서핑
12:00 중식 
12:30 실내 자전거 타기
12:40 루옌(수종) 은영이집에 놀러감
13:30 종료
13:40 인터넷 서핑
18:11 석식
18:40 실내 자전거 타기
19:40 종료
20:00 루옌(수종) 귀가
23:00 취침
==============================================================================================================
 
- 스마트폰에서 문서 스캔하는법 - 캠스캐너(Cam Scanner) 사용법
https://youtu.be/F8ooF08CkHE
 ==============================================================================================================
 
- PC로 도장이미지를 가져와서 도장이미지만들기 / 적용하는 방법
https://youtu.be/CRe-Xec0eJA
==============================================================================================================

- 지출결의서 작성
1. 지출결의서_진태만(2020.12).xls 파일 작성(12.04(금) ~)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.02(토) 작업 ■■■■■■■■■■■■■■■■■■ 
--->07:30 ~ 20:00 ==> 
 
- 주말[★]
07:40 기상
08:11 조식
08:30 실내 자전거 타기
09:30 종료
09:40 인터넷 서핑
12:00 중식
12:20 루옌(수종) 은영이 집에 놀러감
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
18:11 석식(수종) 귀가
22:00 샤워 ==> 체중: 72.9kg
22:23 인슐린 약 교체(277U, 12U 남음)
22:30 루옌(수종) 귀가
23:40 루옌에게 이사 계획 통보(23:40) : 음성 녹음
23:55 취침
==============================================================================================================
 
- 스마트폰 음성녹음 방법 음성을 텍스트로 변환하는법
https://youtu.be/8Mmw_3kV-98
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.03(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21 30 ==> 

- 주말2[★] 
07:40 기상
08:11 조식
08:30 실내 자전거 타기
09:30 종료
09:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
12:20 루옌(수종) 은영이 집에 놀러감
18:11 석식
18:40 실내 자전거 타기
19:40 종료
20:20 루옌(수종) 귀가 
23:00 취침
==============================================================================================================
 
- 수종에게 이사 계획 통보(11시)
1. 음성 녹음
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.04(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 22 30 ==> 휴가2
 
- 휴가2[★] 
07:40 기상
08:11 조식
08:30 실내 자전거 타기
09:30 종료
09:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
14:40 한국이사센터(짐싸 어플): 한남 익스프레스 김정옥 실장 방문 ==> 이사 견적(5톤: 105만원, 6톤: 115만원)
15:50 영구크린 포장이사 정인 실장 방문 ==> 이사 견적(5톤: 155만원) ==> http://www.mcygclean.com/main/index.jsp
16:40 수종 귀가(태권도 안감)
18:11 석식
18:40 실내 자전거 타기
19:40 종료 
20:00 2404 포장이사 최순일 팀장 방문 ==> 이사 견적(5톤: 134만원[인부 3명, 사다리차 사용]) ==> https://www.yes2404.com
23:00 취침
==============================================================================================================

- 진짜 자산가가 알려주는 돈 버는 이야기 | 돈의 속성
https://youtu.be/XsIJXLnJA9A
==============================================================================================================

- 임대차계약서 쓰는법 핵심정리
https://youtu.be/3LRJO8vf_FU
==============================================================================================================

- 등기부등본 보는법 핵심정리
https://youtu.be/EkhMPS_qnts
==============================================================================================================
 
 - 온라인 확정일자 신청 절차
 http://www.iros.go.kr/pos1/jsp/help2/jsp/006001001002.jsp
 ==============================================================================================================
 
- 정신없는 이사, 이것만은 꼭 챙기세요! / YTN 김생민 '원 포인트 생활상식'
https://youtu.be/YvhpZblkbi4 
1) 장기수선충당금(관리사무소에 내역 요청: 집주인에게 청구)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.05(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 05:20 ~ 22 00 ==> 휴가3
 
- 휴가3[★] 
05:20 기상
05:40 조식
06:10 실내 자전거 타기
07:10 종료
08:40 운수대통 포장이사 김성수 대표 방문 ==> 이사 견적(6.5톤: 163만원[인부 4명, 사다리차 사용) ==> www.1599-2400.co.kr
09:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료
14:10 당근 마켓에서 에어컨 판매 내용 보고 가전제품 업자 방문 ==> 1. 거실 에어컨 철거, 2. 안방 에어컨 철거, 3. 냉장고 철거, 에어컨
		거실 창문 열고 실외기 철거, 5. 런닝 머신 철거: 총 4만원 받고 판매함(스텐드 에어컨 밑 부분이 깨져서 재값 못 받음: 그래도 만족)
15:00 종료
16:40 수종 귀가 
17:00 집출발(자전거)
17:10 LG U+ 대리점 방문 ==> 갤럭시 S8 액정 필름 교체 요청(가지고 간 필름 상태가 안 좋아서 대림점에 있는 필름으로 교체해줌: 대만족)
		==> LG U+ 카카오 리틀 프랜즈폰3 상담(2만 6천원: 인터넷 구매보다 비쌈)
17:40 맛닭꼬 남구로점  ==> 갈릭 베이크(포장: 10,900원) 구입 
18:00 귀가
18:10 석식(수종)
18:40 실내 자전거 타기
19:40 종료
23:00 취침
=======================================================================================================

- 당근 마켓에 판매
1. 에어컨 판매(3만원) ==> 판매 완료(인기 폭발: 4명 채팅으로 구매 요청)
에어컨 (LG 휘센 에어컨 2in 1(F-Q165DMPWQW)) 에어컨 판매 합니다.
구입한지 7년이 지났지만 아파트가 넓어서 실제로 사용은 많이 안 했어요.
더 확인을 해보니 다시 올린 사진에 에어컨 아래 부분이 ?어져 있습니다.(참고 하세요)
직거래 원하고 직접 가지고 가야 합니다.
2. 냉장고(만원) ==> 에어컨 업자에게 판매 완료
아직 쓸만한 LG 냉장고 판매 합니다.
2011.07.17에 구입한 LG R-B247QV(237L) 냉장고 입니다.
직거래 원하고 직접 가지고 가야 합니다.
3. 런닝 머신 판매 ==> 당근 마켓으로 판매 안 함(에어컨 업자에게 판매 완료)
4. 장롱, 침대 판매(무료 나눔)
 1) 장롱 사이즈(가로x세로x높이): 80x190x55cm
 2) 침대 사이즈(가로x세로x높이): 11x185x48cm
5. 식탁(대리석) 판매(만원) ==> 당근 마켓에서 판매중으로 처리
6. 화장대(무료 나눔) ==> 당근 마켓으로 판매 안 함
==============================================================================================================

- 아이핀 인증 비밀번호 변경(i-pin)[2021.01.05(화)]
1. 발급기관: 나이스 아이핀 ==> http://www.niceipin.co.kr/index.ni ==> tamario / 20수*@
 1) 2차 비밀번호: Master key: u, 패턴: U
==============================================================================================================
 
- 집에 쌓아둔 책을 중고로 팔자_스마트폰으로 찍고 책을 보내면 끝! yes24 바이백
https://youtu.be/D-jHEun3emI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.06(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 05:20 ~ 22 00 ==> 휴가4, 포장이사 업체 선정
 
- 휴가4[★] 
06:00 기상
06:40 조식
07:10 실내 자전거 타기
08:10 종료
08:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료
16:40 수종 귀가
18:11 석식 ==> 눈이 내려서 쌓임(3.8cm)
18:40 실내 자전거 타기
19:40 종료 
23:00 취침
==============================================================================================================

- 이사 업체 예약
1. 한국이사센터(짐싸 어플): 한남 익스프레스 김정옥 실장 방문 ==> 이사 견적(5톤: 105만원, 6톤: 115만원)
 1) 최종 110만원에 합의 봄(짐이 많아도 무조건 책임 진다고 함) ==> https://www.yes2404.com
 2) 송금할 계좌번호: 농협 392-02-081968(김은숙), 이사 계약금 10만원 송금
 ==> 허가이사종합정보 --> http://www.xn--o39a150b12ef3p.com/Search24.aspx 
==============================================================================================================

- T- 지킴이 서비스 해지
 1) 송금할 계좌번호: 신한 140-005-147861((주)루키스), 이사 계약금 40,769원, 대동초진수종 송금  
 2) 무상 대여 주소: 서울시 성동구 성수일로4길 25, 1608호(성수동2가) T안심알리미
-------------------------------------------------------------------------------------------------------------

- 등하교 안심문자 서비스 신청 안내
https://blog.naver.com/myeonmok_study/221986342892
1. T- 지킴이서비스 신청(3일 후에 단말기 택배로 도착한다고 함) ==> http://newonline.anycarenet.co.kr
 1) 요금제: T-3000, 가입비: 11,000원, 월 이용료: 3,300원, 단말기 비용: 무상대여(구매가: 11,000원), 약정: 12개월
 2) T- 안심알리미 앱 설치를 하면 보호자 3명까지 등하교 문자 수신 가능 
==============================================================================================================

- [카카오뱅크] 자유 적금 해지 
1. 2021.01.09(토) 2,450,000원 출금 완료
==============================================================================================================
 
- 더케이저축은행 정기예금 해지[2021.01.06(수)]
1. 예금명: e-정기예금(복리) ==> 계좌번호: 021-61-24-0106691
2. 가입일자: 2018년 01월 05일
3. 만기일자: 2020년 01월 05일(2021.01.06 해지)
4. 가입기간: 12개월 
5. 이율: 2.7%(복리율: 2.7336%)  
6. 예치금액: 45,000,000원 
7. 출금계좌번호: 021-61-13-0021880
==> https://www.thekbank.co.kr
==============================================================================================================  
  
- 더케이저축은행 정기예금 가입
1. 예금명: e-정기예금(복리) ==> 계좌번호: 021-61-24-0417361
2. 가입일자: 021년 01월 06일
3. 만기일자: 2024년 01월 06일
4. 가입기간: 36개월 
5. 이율: 2.20%(복리 : 2.27%)
6. 예치금액: 40,000,000원 
7. 출금계좌번호: 021-61-13-0021880
8. 기타: 인테넷으로 가입 ==> https://thek.ibs.fsb.or.kr/main.act
============================================================================================================
 
- 모네타 예금
http://finance.moneta.co.kr/saving/bestIntCat01List.jsp?wlog_fn=M3
============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.07(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 05:20 ~ 22 00 ==> 휴가5
 
- 휴가5[★] 
05:20 기상
05:40 조식
06:10 실내 자전거 타기
07:10 종료
07:40 인터넷 서핑
12:00 중식
12:30 실내 자전거 타기
13:30 종료
14:30 집출발(자전거): 눈이 길 바닥에 얼어서 위험(손이 씨러울 정도로 추움)
15:10 신도림테크노마트 ==> 오피스텔 분양 홍보관에서 설명 들엄(화장지 4개 받음)
15:30 한화생명 신도림고객센터 내방 ==> 이전 했다고 함[엄청 열받음)
15:40 이마트(지하 2층) : 광천 재래김 20봉 구입
16:00 문영APT 관리실 방문 ==> 문영 APT 관리 소장이 1월 30일(토) 이사갈 때 나와서 정산해 준다고 약속함
16:20 귀가
16:40 수종 귀가
18:00 석식
18:40 실내 자전거 타기
19:40 종료
20:20 루옌(수종) 귀가 
23:00 취침
==============================================================================================================

- 무배당플러스유니버설CI보험(한화생명, 루옌) 해약
1. 무배당플러스유니버설CI보험(한화생명, 루옌), 월 80,409원 납입 
 1) 총 납입보험료: 7,583,474월, 해지환급금: 4,835,742원
  가. 보험거래전용 비밀번호(한화생명 신도림고객센터 내방 ==> 이전 했다고 함[엄청 열받음)
   ==> 귀가해서 한화생명 콜센터에 전화해서 짜증냄: 보험거래전용 비밀번호 없이 공동인증서로 해약 완료 함
 https://www.hanwhalife.com/index.jsp 
 ---------------------------------------------------------------------------------------

[한화생명] [오후 4:51] [한화생명] 해약처리 완료 안내
안녕하세요. 진태만 고객님
언제나 변함없는 관심과 사랑으로 한화생명을 성원해 주셔서 감사합니다. 
고객님의 해약처리를 아래와 같이 안내 드립니다.
■ 해지일시 : 2021.01.07일 16:51 
■ 해지환급금: 4,835,742원(국민은행 계좌로 이체 처리)
■ 대상계약 : 1***73769 
■ 상품명 : (무)플러스유니버셜CI 
■ 보험료 : 85,498원 
■ 최종납월/납회 : 2021.01/93회
---------------------------------------------------------------------------------------

- 실비보험이 있다면 반드시 알아야 할 5가지
https://youtu.be/0c4wpiLuX9A
==============================================================================================================

- 변액유니버셜종신보험 제발 알고 가입하자!
https://youtu.be/qSOOVz2EF_c
==============================================================================================================  

- GS25 편의점 택배[2021.01.07(목)]
1. POST BOX 택배(회원 500원 할인) 예약
http://www.cvsnet.co.kr/_ver2/board/ctod_status_new.jsp?pageNum=3&subNum=1&ssNum=0 ==> tamario / 20**오십h@
1) 핸드폰 번호: 010-3072-0898, 비밀번호: 20**tam*@(20타마) 

- T- 지킴이 단말기 택배로 보냄
 1) 송금할 계좌번호: 신한 140-005-147861((주)루키스), 이사 계약금 40,769원, 대동초진수종 송금  
 2) 무상 대여 주소: 서울시 성동구 성수일로4길 25, 1608호(성수동2가) T안심알리미
 3) 택배비: 2,4000원
==============================================================================================================

- 장기수선충당금 요청(18시, 관리사무소)
 1. 문영 APT 관리 소장이 1월 30일(토) 이사갈 때 나와서 정산해 준다고 약속함
  ==> 럭키 부동산 김선자 대표에게 확인 전화함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.08(금)작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 23 30 ==> 휴가6, 한파(-18도): 보일러 온수 안 나옴
 
- 휴가4[★] 
07:00 기상
08:10 조식
07:10 실내 자전거 타기
08:10 종료
08:40 인터넷 서핑
11:00 수종 감기 기운 있다고 돌봄교실에서 하교
12:00 중식
12:30 실내 자전거 타기
13:30 종료 
14:00 보일러 온수 녹이기(온수 선을 수건으로 감싸고 뜨거운 물을 집중적으로 붓기): 보일러 온도를 21도로 설정
15:00 집출발(도보, 수종)
15:10 박소아과 ==> 수종 감기 초기 증상
15:30 약국
15:40 귀가 
16:40 보일러 온수 녹이기2(수건, 뜨거운 물) ==> 온수 나옴(성공)
18:11 석식
18:40 실내 자전거 타기
19:40 종료 
23:00 취침
==============================================================================================================
 
- 다음 팟플레이어 사용해서 유튜브 광고없이 쾌적하게 보는 법
https://youtu.be/eH6K7Ff7x4A
https://tv.kakao.com/guide/potplayer
==============================================================================================================
  
- 01. 카카오(다음) 로그인 
https://accounts.kakao.com/login/kakaostory  ==> tamario@naver.com /tam*3**
==============================================================================================================
  
- 보일러 온수가 안 나올때 이게 답이다! 손쉬운 동파예방/돈안드는 수도관 녹이기
https://youtu.be/B0htVBwqlro

- 어딜 어떻게 녹여야 빨리 녹일까요?..포인트 찾는법
https://youtu.be/yh_YCrrz_tk
==============================================================================================================
 
- 쓸 만한 아동용 자전 판매(당근 마켓에 올림)
2019.04.29에 구입한 자전거 입니다. 우리애가 7살때 구입을 했는데 자전거에 흥미가 없어서
많이 타지 않았어요.(단,  자잔거 받침대가 고장나서 제대로 세워지지 않는데 대리점에 가니깐
5천원이면 수리가 된다고 했어요)
-----------------------------------------------------------------------------------------------

- 자전거 구입[구매일: 2019.04.29(월)]
1. 스페이스넘버원1. 스페이스넘버원 어린이 자전거(18인치, 블랙, 80프로 미조립), 가격: 155,590원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B549672658&frm3=V2 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.09(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 22 00 ==>  한파(-11.9도): 보일러 냉수, 온수 안 나옴
 
- 휴가4[★] 
07:00 기상
07:10 수도에서 온수가 한 방울씩 나옴(수도물 끔)
07:40 석식 전 주입(주입 이상 발생)  
07:43 조식
08:10 실내 자전거 타기
09:10 종료
09:20 인터넷 서핑
09:50 보일러 냉수, 온수 안 나옴 ==> 보일러 온도 20도에서 22도 설정
11:00 진대규에게 전화해서 변액 보험 상담(메일 보냄)
12:00 보일러 냉수, 온수 다시 나옴 ==> 양동이 2개에 찬물 받아 둠
12:10 중식
12:30 실내 자전거 타기
13:30 종료   
13:40 인터넷 서핑
18:11 석식
18:30 문영APT 경비원이 방문해서 세탁기 배수로가 얼었으니 빨래 하지 말라고 함
18:40 실내 자전거 타기
10:40 종료
21:30 샤워 ==> 체중: 70.3kg
21:55 인슐린 약 교체(290U, 10U 남음) 
23:55 취침
==============================================================================================================

- 의무화된 친환경 보일러 과연 어떤 브랜드가 좋을까?[보일러 원리]
https://youtu.be/H9i_VEWNZeA
==============================================================================================================

- 중고책 중고도서 방문 매입(헌책 사진 촬영 후 문자 보냄)  ==> 수거 거부(실패)
1. 코코북스: 010-4934-8754 
http://cocobooks.blogspot.com
==============================================================================================================
 
- 99%가 모르는 갤럭시의 숨겨진 기능 5가지[빅스비 루틴]
https://youtu.be/LmsrwvjVeao
==============================================================================================================

- 갤럭시 쓰면서 이걸 안 써요? ㅣ삼성페이 활용 5가지 방법!
https://youtu.be/unFJOoDSNc8
==============================================================================================================

- 스마트폰 단말기와 유심카드 통신사가 달라도 교통카드 쓰는 방법!(feat 갤럭시 S9 +)
https://youtu.be/Ltbc-UNO-1k

- 통신사 달라서 삼성페이 교통카드 안 될 때 해결방법
1. 롯데카드 전용 앱으로 교통카드 사용
https://zekesnote.tistory.com/1556
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.10(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21 30 ==> 

- 주말2[★] 
07:00 기상
07:40 조식
08:00 실내 자전거 타기
09:00 종료 ==> 체중: 69.3kg[체중 앞자리 7에서 6으로 변경]
09:10 인터넷 서핑
12:00 중식
12:20 루옌(수종) 은영이 집에 놀러감
12:30 실내 자전거 타기
13:30 종료
13:40 인터넷 서핑
18:11 석식
18:40 실내 자전거 타기
19:40 종료
22:10 루옌 귀가(수종이 은영이 집에서 자고 온다고 함: 내일 감기 증상이 있어서 돌봄 교실 못 간다고 함)
23:00 취침
==============================================================================================================
 
- (Eng sub) 5년 후 돈 버는 방법이 바뀐다고?! 새라 케슬러의 『직장이 없는 시대가 온다』
https://youtu.be/oOfHRs-evK0
1. 긱 경제(프리랜서 경제), 원격지 능력자, 크라우드 노동자, 플랫폼 노동자(별점)
==============================================================================================================

- 당신의 퇴직금 손해보고 있다
https://youtu.be/IoKJAmNMuxI
1. DC형: 확정기여(Defined Contribution)형 ==> 초기: 주식 투자, 후기: 펀드 투자

- 퇴직연금 상품 완벽 마스터[IBK 퇴직연금]
https://youtu.be/SG3p_vJAtAs
==============================================================================================================

- 재택근무 하실 때 이런 모니터 하나 있음 좋아요! (LG 35WN65C 리뷰), 가격: 499,000원
https://youtu.be/Y8V2z1QhU9s
==============================================================================================================

- [플랭크의 정석] 정확한 동작
https://youtu.be/qJRyY9q1AmQ
==============================================================================================================

- [핫뉴스] ‘영끌’ 가계부채 폭증... 금융 위기 위험(20210104)
https://youtu.be/ZoA28X7qtpo
==============================================================================================================

- 신한은행 모바일 OTP 발급[2021.01.10(일)]
1. 비대면 인증(주민증) ==> 계좌:번호 신한 : 110-437-783130
 1) 1일 이체 한도: 5억원,  1회 이체 한도: 1억원
==============================================================================================================
 
- 귤 10kg 주문
1. [나영이네농장] 맛좋은 감귤7kg 10kg산지, 옵션 : 나영이네 맛좋은감귤10kg(S~M)-로얄과, 가격: 14,910원
http://www.enuri.com/detail.jsp?modelno=56516595
http://www.11st.co.kr/products/2585168399?&xfrom=&xzone=
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:00 ~ 17:00 ==> 지출결의서_진태만(2020.12) 작성, , 퇴직연금 추가 요청(김유진 대리에게 요청), YES24 바이백 처리(GS25 대림점)
									, 수종이 귀가(21:30, 내일부터 돌봄교실 간다고 함)
									
- 본사 대기[★]
1. 일부 직원 하나 손해보험 프로젝트 투입됨(이경일 부장, 박건유 대리, 김유이 사원) ==> 나는 당분간 본사 대기
2. 오태범 이사에게 2021년 달력 선물 받음(성당 달력: 무척 마음에 듬)
3. 델 모니터 사무실 책상에 셋팅
==============================================================================================================

- Microsoft(마이크로소프트) 홈페이지 로그인 변경[2021.01.11(월)]
https://www.microsoft.com, tamario@naver.com/30육*h@  --> 40칠*h@
=============================================================================================================
 
- 회사 노트북 윈도우10 비밀번호 설정
1. 윈도우 비밀번호:  30dbrtlqh@  ==> 20육*h!, 윈도우 PIN: 12**11
==============================================================================================================

- 윈도10 설정창 안 열리는 버그 걸렸습니다.
https://gigglehd.com/gg/soft/3732995

- Windows 10에서 개인설정 진입 시 ms-settings:display 오류 메세지 출력 증상 해결하기 
Windows 2018. 1. 23. 19:00 posted by Cecil CecilDeSK 
1. 조치:
 1) netplwiz를 이용하여 사용자 환경을 재설치해주는 방법
시작 -> 실행 -> netplwiz 엔터 -> 사용자이름 클릭 후 속성 -> 그룹 등록 -> 관리자(A) (Administrator 그룹) 선택
 -> 적용 -> 사용자 계정 ~ 로그아웃 메세지 출력시 리부팅 
 2) 리부팅 완료 후 시작-실행- ms-settings:display 또는 바탕화면에 마우스오른쪽 버튼 클리후 디스플레이 설정 
2. 해결 방법: 윈도우10 내 디스플레이설정 버튼을 눌렀을때 위와같이 확인된다면 포맷 또는, 사용자 계정을 변경하여 처리
 1) 포맷 밖에 해결책이 없는 듯 함
==============================================================================================================
  
- 카카오 지갑 생성
1. 비밀번호: 033*0*
==============================================================================================================
 
- 국민은행 인터넷 제한 풀기(09:40, 선릉점 방문)
1. 인터넷 뱅킹 사용 가능
==============================================================================================================
  
- IBK 기업은행 인터넷 뱅킹 가입(10:20)
1. 로그인 방식: 패턴(21), 간편 로그인 비밀번호: 03**01
2. 퇴직 연금 상담(기업은행 기술센터 출장소 김연희 소장)
 1) DC형(현재 예금으로 운용되고 있음)
==============================================================================================================

- 윈도우 기본 제공 가장 강력한 윈도우 백업 및 복구 방법. 부팅이 안 될 때에도 복구(이미지 백업)하는 방법
https://youtu.be/jVC3FFTDCqI
---------------------------------------------------------------------------------------------------------------

- 윈도우10 설치 후 로컬계정으로 로그인하기
https://youtu.be/MtAFyYtY_pk

- 윈도우10 - 로그인 패스워드 제거방법 (비번없이 로그인하기)
https://youtu.be/Pt-xelHRU_g

- 윈도우 부팅시 암호를 분실했을때 암호를 초기화하는 방법
https://youtu.be/spmiXdcHhOQ
==============================================================================================================
 
- YES24 바이백 신청 및 택배 접수(GS25 대림역점 (02-832-5931))
1. YES24 바이백 신청내역: 잡스의 기준 외 5건: 예상 매입가: 28,000원
[예스24] [오후 9:59] [YES24 바이백] 접수번호: <210110-20079>, 편의점 접수 승인번호<131000768920>
접수번호를 동봉하여 포장해 주시거나 포장박스에 기재하여 선택하신 편의점에서 위 승인번호를 사용하여 접수해 주세요.
1. 이용방법: 편의점PostBox(택배 접수장비) > 쇼핑몰거래 > 승인번호입력 > 신청박스 무게 측정 > 운송장출력 및 박스에 부착 >
편의점직원에게 신청박스 전달, 접수 영수증 수령
※바이백 신청내역 확인※
http://m.yes24.com/BuyBack/Detail?buyBackNo=210110-20079
http://www.yes24.com/Mall/BuyBack/View?CategoryNumber=018&buybackno=210110-20079

- 집에 쌓아둔 책을 중고로 팔자_yes24 바이백 ==> https://youtu.be/D-jHEun3emI
- 집에 쌓아둔 책을 중고로 팔자 2_ yes24 책 팔고 정산 받는 법 ==> https://youtu.be/1xxLbVUJmgY 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.01.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 망막 검진(08:40, 누네안과병원>: 4월 26잃(토) 08:40 예약), 눈 많이 옴(15시, 따뜻), 배아픔(20시)

- 본사 대기[★]
- 윈도우 10 설치 방법 동영상 시청, 문서 작성
==============================================================================================================

- 왕초보 윈도우10 설치 교과서/USB제작/설치방법/최적화/최신 드라이버/정품인증
https://youtu.be/ZSBG0yp4LTU
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.01.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 설사(6시): 힘이 없음, 명지성모병원 입원(급성 충추염[맹장염], 18시)

- 본사 대기[★]
- 윈도우 10 설치 방법 동영상 시청, 문서 작성
==============================================================================================================
 
- 명지성모병원 입원[★]
05:00 기상(몸에 힘이 없고 걷으면 오른쪽 배가 아파 제대로 못 걸음)
05:40 조식
06:15 집출발
07:40 출근
11:40 중식
15:00 퇴근(배가 아퍼서 조퇴)
16:00 귀가
17:00 집출발(자전거)
17:10 서울가정병원(수요일 휴원(13시까지 운영))
17:20 진료(배아픔: 급성 맹장염 진단 --> 큰 병원으로 가라고 함)
17:40 명지성모병원 응급실 ==> 검사(피검사, CT 촬영)
19:00 급성 충주염[맹장염] 판정 받음 ==> 입원해야 한다고 함, 내일 오전에 수술 가능 하다고 함
19:20 코로나 간이 검사(4만 8천원, 15분만에 결과 나옴[80% 정확도]) 음성 나옴 ==> 인슐린 펌프 제거(2동안 사용) --> 금식
20:00 보호가 없이 간호, 강병 통합 서비스 병동 523호에 입원(TV 없음)
20:10 루옌에게 전화해서 세면도구 갖다 달라고 함 ==> 1층 안내 데스크에서 맡겨 놓은 거 간호사가 가지고 옴
22:10 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 맹장 수술

- 명지성모병원 입원2[★]
05:50 식전 혈당 207
05:00 기상
08:30 주치의 회진 ==> 11시에 수술한다고 함
10:30 안면 X레이 찍기(지하 1층)
11:00 지하 1층 수술실 ==> 맹장 수술(전신 마취)
12:00 수술 종료
13:00 마취에서 ?어 남: 거의 안 아픔): 주머니 생김, 방구 나와야 밥 준다고 함, 침대에 누워 있음
17:30 도보(병동 내부 걷기)
19:50 종료
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 

- 명지성모병원 입원3[★]
05:00 기상
06:00 드라마 자이언트 시청(마지막회{60회)
08:40 주치의 회진 ==> 다음주 월요일 외출 요청
09:00 도보(병동 내부 걷기)
09:50 종료
13:00 도보(병동 내부 걷기)
13:50 종료
19:00 도보(병동 내부 걷기)
19:50 종료
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 

- 명지성모병원 입원4[★]
05:00 기상
06:40 배 소독(간호사)
09:00 도보(병동 내부 걷기)
09:50 종료
11:00 드라마 스토브 리그 시청(첫회)
13:00 도보(병원 1층 걷기)
13:50 종료
15:35 방구 나옴(3일 만에 나옴: 배는 안 고팠는데 걱정 많이 함)
17:20 석식(미음)
19:00 도보(병원 1층 걷기)
19:50 종료
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 

- 명지성모병원 입원5[★]
05:00 기상 
07:20 조식(죽)
07:30 도보(병원 1층 걷기)
07:40 종료 
12:20 중식(죽)
13:00 도보(병원 1층 걷기)
13:50 종료
17:20 석식(죽)
17:30 도보(병원 1층 걷기)
18:30 종료
18:40 드라마 스토브 리그 시청(4회까지 무료)
19:00 드라마 올인 시청(첫회)
23:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.01.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 

- 명지성모병원 입원6[★]
05:00 기상(밤에 눈 조금 내림)
07:20 조식(죽)
07:30 도보(병원 1층 걷기)
07:40 종료 
08:40 주치의 회진 ==> 외출 허락 받음
09:00 주머니 제거
10:30 병원 출발(사복입고, 외출층 1층 원무과에 가서 도장 받아서 제출)
10:50 귀가 
11:10 장롱 무료 나눔 완료(생각보다 장롱 세월의 흔적 있어서 미안 했음)
12:00 병원으로 귀원
12:20 중식(죽)
13:00 도보(병동 내부 걷기)
13:50 종료
17:20 석식(죽)
17:30 도보(병동 내부 걷기)
18:30 종료
18:40 드라마 올인 시청
23:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.01.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 퇴원(10:30)

- 명지성모병원 퇴원[★]
05:00 기상
07:20 조식(죽)
07:30 도보(병원 1층 걷기)
07:40 종료 
08:40 주치의 회진 ==> 퇴원 허락 받음
10:00 1층 원무과에서 퇴원 정산하라고 전화 옴 ==> 병원비 총 992,320원 정도 나옴 --> 코로나 19 ?문에 하루 종일 마스크 껴야 하고
		TV도 없어서 심심했음, 병 조기에 발견해서 그나마 다행 
		==> 이새롬 간호사가 내가 인슐린 펌프 착용할 정도로 당뇨가 심각하지 않다고 조언: 병원(희망내과) 다시 가보기로 결심
10:30 병원 출발
10:50 귀가  
12:20 중식(밥)
13:00 드라마 올인 시청
18:00 석식(밥)
18:30 도보(거실)
19:30 종료
19:40 드라마 올인 시청
23:00 취침
==============================================================================================================
 
- YES24 바이백 정산
1. YES24 바이백 신청내역: 잡스의 기준 외 5건: 예상 매입가: 28,000원 --> 실제 정산: 18,700원(예치금환불 요청해서 신한은행 계좌로 입금됨)
 1) http://www.yes24.com/Templates/FTMyAccount_2Keep.aspx
==============================================================================================================

- 수종이 핸드폰 신청
- 키즈폰 카카오키즈폰 어린이폰 가격 할부0 원 진짜 공짜폰 초등학생폰 SKT KT LG 어린이 핸드폰 휴대폰 스마트폰 싸게 사는법 추천
https://youtu.be/N0YEtJoUD-c
https://m.cafe.naver.com/ca-fe/web/cafes/smarthot09/articles/181696?useCafeId=false
1. 간편상담 신청서 작성 ==> 통신사 공식신청서(e-mail로 받기)
 1) 가입대리점명 :주식회사 엠오티:070-4417-2019
 2) 판매점명 :엠오티-온라인주소 : 010-4157-5985, 사업자등록번호: 817-87-00883
 https://onsalemobile.uplus.co.kr/open-market/step1
==============================================================================================================

- 실명등록
1. 미성년자 실명 등록 ==> 진수종: 130924-3067711
https://www.siren24.com
https://m.blog.naver.com/iti1002/221448951126
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 수술 후 첫 출근, 드라마 올인 마지막회(24회) 시청

- 본사 대기[★] 
==============================================================================================================

- 국민은행 출금
1. KB 종합 통장- 보통예금(640-21-0052-309: KB 주거래 통장)에서 180,740원 출금
2. KB 종합 통장- 보통예금(617401-04-092699: 나눔계 통장)에서 4,865,260원 출금
==> 총: 5,046,000원 출금
==============================================================================================================

- 수종 핸드폰 신청
1. 온라인 실명등록(나이스평가정보)
https://www.niceid.co.kr/name_inpt.nc
1. 온라인 실명등록  ==> 미성년자 ===> 법정대리인 동의서(14세 미만)
2. 공식 신청서 작성(온라인)
https://onsalemobile.uplus.co.kr/open-market?formId=1247566&agentId=314365&openmktCd=1
3. 미성년자  구비서류 전송
 1) 법정대리인 신분증 + 가족관계증명서 + 기본증명서 상세 스캔본 첨부

- LG U+ 카카오 리틀프랜즈폰4(삼성 갤럭시 A10e) 혜택 끝판왕 【할부금 0원+최대 6개월 기본료도 0원】
https://cafe.naver.com/smarthot09/216097 
1. 기종: 삼성 갤럭시 A10e
==============================================================================================================

- 대형폐기물 배출 신청(영등포구)
https://www.ydp.go.kr/reserve/contents.do?key=4176&
==============================================================================================================

- 일월 옥매트 판매 당근 마켓에 판매
1. 일월 일품 프리미엄 카페트 온수매트[대형(분리난방,183x240cm), 거실용], 가격: 171,490원
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=B285757368&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 비 옴(15시, 우산)

- 본사 대기[★] 
- 윈도우 10 설치 방법 동영상 시청, 문서 작성
==============================================================================================================
 
- 수종이 선생님(김진주)께 수종이 전학 통보(10:20)
1. 체험 학습 문서 작성 요청 ==> 절차가 복잡하고 모호하니 다음주 월요일 포항으로 전학 시키라고 함
2. 수종이 학교에서는 공부 열심히하고 생활 잘 한다고 함
==============================================================================================================

- 포항집 현대HCN 인터넷 약정 가입[2021.01.21(목)] 
1. 큰누나가 대신 해줌
2. 내일 전화한 후 설치 해달라고 요청함(큰누나)
3. 약정 기간 ==> 4년 (2021.01.23 ~ 2025.01.23), 월 납입금: 16,000원 
==============================================================================================================

- 대형가전 무료 수거 예약
http://www.15990903.or.kr/user/reserve/reserve_reg1.do 
1. 배출 희망일자: 01.27(수), 배출지: 밖
2. 배출 품목: LCD TV(65인치), 레이저 프린터, 전기밥솥
- 예약일자 : 01월 27일(수)
- 예약번호 : 1000057, 진행절차 확인 가능
- 예약취소 및 변경 : www.15990903.or.kr 접속 → "예약조회, 변경"에서 고객명, 예약번호 입력 → 정보 변경
- 방문기사 정보는 방문일자 하루 전날에 전송됩니다.
==============================================================================================================

- [슬기로운 건강생활] EP5. 당뇨병 최신치료 : 연속혈당측정기, 인공췌장 - 내분비내과 문선준 교수
 https://youtu.be/bswa9ABakhA
==============================================================================================================

- 제주 섭지코지/올인 하우스/드라마 올인 촬영지
https://youtu.be/aTFHbYsLfso
==============================================================================================================

- 쓸모없는 장기 맹장, 오히려 도움 된다고? [건강프라임-시선뉴스]
https://youtu.be/tc8Gk8EpznE
==============================================================================================================
 
- 연말정산 하는 방법 한번에 끝내기! 실전편
https://youtu.be/VQIjS-tBvEM
==============================================================================================================
 
- 진수종 gmail 생성
1. https://mail.google.com/mail, soojong2020@gmail.com / soo0508@
==============================================================================================================

- 진수종 네이버 생성
1. https://mail.naver.com, soojong2021@naver.com / soo0508@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 휴가
 
- 병원 진료[★]
05:20 기상
06:00 조식
06:20 집출발
06:28 대림역 --> 군자역
07:20 군자역 2번 출구 도착
07:30 희망내과 도착(예약 리스트에 이름 작성)
07:40 도보
08:20 종료
08:40 희망내과 오픈
08:50 당화 혈색소 검사(3분 걸림): 당화 혈색소: 6.1%
08:55 인바디 검사 ==> 인바디 점수: 82점, 체중: 70.3kg(적정 체중: 68kg), 신장: 169cm ==> 
		BMI: 24.6, 체지방률: 17.8
09:10 당뇨합병증 검사 
09:20 진료(송필훈 원장): 인슐린 펌프 굳이할 필요 없다고 함 ==> 약물 치료로도 가능하다고 함. 2주간 지켜 보기로 함
09:20 조제(당뇨약: 15일분, 푸른약국)
09:40 종료
09:50 군자역 2번 출구
10:20 대림역 도착
10:30 명지성모병원 1층 일반외과 도착
10:40 진료(옥찬호 원장): 배에 실밥 풀기(2일 후 샤워 가능 하다고함)
11:00 종료
11:10 귀가
11:10 인터넷 서핑
12:00 조식
12:10 실내 도보
12:40 루옌, 수종 도착 ==> 수종 핸드폰 가지고 옴
12:55 종료
13:00 수종 핸드폰 환경 설치 및 액정 필름 부착(루옌)
		==> 진수종: 010-5749-0898
15:00 인터넷 서핑 
18:00 조식
18:10 실내 도보
22:30 취침 
==============================================================================================================

- Memo(2020.12) 정리
1,
==============================================================================================================

- 포항집 현대HCN 인터넷 약정 해지
1. 약정 기간 ==> 4년 (2021.01.23 ~ 2025.01.23), 월 납입금: 16,000원
==============================================================================================================

- 포항집 현대HCN 인터넷 약정 설치 제안
1. 포항 현대HCN 설치 기사 제안
 1) TV: 월 4천 4백원(약정 기간: 3년), 인터넷: 월 9천 9백원(약정 기간: 4년) ==> 월 만 4천 3백원
==============================================================================================================

- 수종 핸드폰 도착
1. 환경 설치 및 액정 필름 부착 ==> 수종 엄청 좋아함

- LG U+ 카카오 리틀프랜즈폰4 혜택 끝판왕 【할부금 0원+최대 6개월 기본료도 0원】
https://cafe.naver.com/smarthot09/216097 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.01.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==>  

- 포항행[★]
05:00 기상
05:40 조식
06:00 실내 도보
06:30 수종이 깨움(루옌이 수종이에게 김밥 제공)
06:50 종료
07:00 집출발(수종): 큰 캐리어 1개, 작은 캐리어 1개, 수종 햄스트 케이지
07:10 대림역 --> 서울역(짐이 많아서 엘리베이트 이용)
07:50 서울역 도착
08:10 서울 출발(코로나 때문에 승객이 많이 없음)
10:40 포항 도착(비옴)
10:50 택시 
11:20 포항집 도착 ==> 엄마
11:50 중식
12:10 실내 도보
13:50 종료
18:00 석식
18:10 실내 도보
19:10 종료
20:00 큰누나, 매형 도착
22:00 큰누나, 매형 귀가 
22:30 취침 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.01.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 비 조금씩 계속 옴(오후에 그침)

- 포항행[★]
06:50 기상
07:00 조식
07:20 실내 도보 
08:20 종료 
11:50 중식
12:10 실내 도보
13:50 종료
15:00 다이소 포항두호점 방문(수종) ==> 선반 구입
15:10 리플러스 마트 방문(수종) ==> 귤 5KG 구입
15:30 귀가
16:00 화장실 세면기 막힌 것 제거, 세면대에 선반 설치
16:30 다이소 포항두호점 방문 ==> 선반 구입, 다이소 핸드폰 고속 충전기(EMAC: C타입 케이블 포함) 구입
17:00 귀가
16:00 거실방에 선반 설치
17:00 큰누나, 령경 도착형 도착
18:00 석식
18:10 실내 도보
19:10 종료
19:30 큰누나가 60계 치킨 시킴: 나는 안 먹음
20:00 큰누나 식후 혈당 185 나옴 ==> 당뇨 전단계 의심
20:20 집출발(수종, 큰누나, 령경)  
20:30 영일대 해수욕장 도보(별로 안 추움)
21:30 종료
22:00 큰누나 귀가(령경이는 자고 감)
22:30 취침 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.01.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==>  

- 포항행[★]
06:50 기상
07:00 조식
07:20 실내 도보 
08:20 종료 
08:50 집출발(엄마, 수종) 
09:00 현대HCN 설치 기사 방문: 인터넷 설치 요청(령경이가 집에 있음)
09:00 두호동 주민센터 ==> 전입신고: 진수종을 엄마(세대주) 서대에 편입 시킴 ==> 포항 두호초등학교로 배정됨
        ==> 엄마는 공공근로 신청하러 감
09:30 포항 두호초등학교 교무실 ==> 전학 신청(2월 1일(월) 자로 신청함): 1학년 2반으로 배정됨
10:00 종료
10:10 국민은행 방문: 수종 통장 계설 요청(서류가 필요 하다고 함)
10:20 귀가  
10:25 인터넷 설치 마무리(설치비 3만원 지불) ==> 거실 TV 180 채널, 안방 TV 90 채널 ==> 월 14,300원(4년 약정)
10:30 다이소 포항두호점 방문(수종) ==> 령경 아이폰 핸드폰 고속 충전기 구입(선물해줌)
10:40 골든 열쇠 가게 방문 ==> A/S 요청
10:50 골든 열쇠 A/S 방문 ==> 현관문이 지진으로 틀어져서 문이 자동으로 안 잠긴다고 함(수리비 만원 지불)
11:30 중식
11:35 엄마 귀가
12:00 집출발: 백팩에 반찬(진매채, 시금치, 생선 2개), 
 가지고 옴 ==> 포항항만 ==> 죽도시장 ==> 포항고속터미널(50분 걸림)
12:50 포항고속터미널 도착
13:10 포항 출발(동양고속)
17:03 강남터미널 도착(약 3시간 50분 걸림)
17:25 고속터미널 정류장(6411번 탑승) 
18:20 대림역 정류장 도착
18:40 귀가
19:10 석식
19:30 실내 도보 
19:40 인터넷 서핑
20:20 일월 옥매트 판매(만원에 판매함) ==> 여자가 작은 차 가지고 와서 보드 싣는 차 위 거치대에 묶에 싣고 감
20:40 종료
23:20 샤워(맹장 수술 후 처음 샤워, 체중: 67.7kg)
22:30 취침 
==============================================================================================================
 
- 남은 당뇨 소모품 확인[2021.01.25(월)]
1	슈퍼라인-ST[바늘 길이: 6.5mm]: 19개 
2	다나 3cc 주사기(다나 플러스, 다나 용)	: 19개  
3. 인슐린 5병
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 대형 폐가전 아파트 복도에 처리(19:30, 내일 업체에서 가져갈 예정), 이불 처리(20시, 재활용통에 버림)

- 본사 대기[★]
- 연말 정산 처리
- 2020년 귀속 연말정산 자료(2021.01.26) 처리 방법(2019년 귀속 연말정산 자료(2020.01.27) 참조할 것)
1. 크롬 브라우저로 연결
2. 로그인: 금융인증서 사용
3. 소득.세액공제 자료 조회
 1) 귀속년도: 2020년 1월 ~ 12월: 체크
 2) 건강보험, 국민연금....기부금: 클릭
 ==> 한번에 내려받기: 클릭 ==> 진태만(720625)-2020년도자료.pdf 파일이 다운로드 됨 
https://www.hometax.go.kr/websquare/websquare_cdn.html?w2xPath=/ui/pp/UYRSLGNEXE.xml&menuNo=01 

==> 공제신고서.pdf 파일을 다운로드 받아서 소득공제신고서_진태만.hwp 파일 내용 작성할 것

 - 제공동의 현황에서 자려료공동의 신청(중요 ■)
 1. 어머니, 진수종(미성년자) 추가
-------------------------------------------------------------------------------------------------------------------------

- 예상 세액 계산 결과
1. 총급여: 51,092,304(2020년 총급여 총합)
2. 기납부 세액: 1,109,740(2020년 소득세 + 지방소득세)
※ 고객님의 추가납부 세액은 537,270원,  지방소득세는 53,720원입니다.

※ 2020년 귀속 실제 납부 세액(실제 납부금)		
종합소득세	주민세	실제 환급액 
 537,270원 	 53,720원 	 590,990원
==============================================================================================================

 - 표4-줄 칸 추가하기 셀 나누기(한컴 오피스에서)
 https://youtu.be/HljjioKnElM
1. 표에서 마지막 셀에 커서 놓기: 마우스 우 클릭 ==> 줄/칸 추가하기(I): 클릭 ==> 아래쪽(B): 선택 ==> 추가(D)
2. 표 내용 우측 정렬 ==> 표(Q) ==> 표 편집

 - 한비 06 표 서식 복사(단축키 Alt + C) (한컴 오피스에서)
https://youtu.be/Nn41a6WPDMg 
==============================================================================================================

- 연말 정산하는 법[금융의 정석, 환급금 계산]
https://youtu.be/IvSy7jW1AbI

- 연말정산 환급금 계산하기(연말정산 하는법)[머니센스]
https://youtu.be/q0pUJBafP-U



==============================================================================================================
  
- 홈택스 연말정산 간소화서비스 사용방법 (부양가족,공제자료)
 https://youtu.be/J0LswBhuLT0
==============================================================================================================
  
- [2021][레시피3][연말정산] 20강 국세청 홈택스 연말정산간소화서비스
https://youtu.be/oW84vXS54bY
==============================================================================================================
 
- [탑파이브] 대용량 보조배터리 추천순위 - 40000mAh 이가격 실화냐
https://youtu.be/AxpbnGe2wOY
==============================================================================================================

 - 오만상사 | 보자마자 1초만에 샀음;; 무선충전기와 보조배터리가 합쳐진 샤오미 신형 2 in 1 보조배터리 사용기
 https://youtu.be/0HLGX3osz90
 http://www.enuri.com/detail.jsp?modelno=57696387
 
- 130W 보조배터리 끝판왕 더 작아졌는데 PD/PPS/QC3.0 까지 진짜 꼭 사세요!
https://youtu.be/Kx9Olc148RQ 


- 언박싱 & 간단사용기] Baseus 30000mAh / 65W출력 보조배터리
https://youtu.be/gBgFTfG8tYw
http://www.enuri.com/detail.jsp?modelno=59997120
==============================================================================================================

- 통신사 공유기에서 공유기를 바꿨는데. 속도가 4배나 빨라졌습니다
https://youtu.be/A0t3sBvuCt0
==============================================================================================================

- 인터넷 이전 설치(10시, 현아트빌)
1. 인터넷 이전 요청 전화(101): 2021.01.26(화)
 1) 해지한다고 하니깐 이전 설치비 35,400원 중에 13,000원 만 납부해준다고 함
  가. 강아현 명의로 인터넷이 가입되어 있다고 함 ==> 설치 후 1년 동안 해지 안 한다는 조건
 2) 지금 해지하면 위약근 50만원 정도 된다고 함
2. 인터넷 이전 설치 약속: 2021.02.01(월) 10시
3. 현아트빌주소: 서울 관악구 조원로 159-1 현아트빌 404호, (우)08704, 지번: 신림동 470-21
=============================================================================================================

- 경제적 자유를 달성하는 핵심 비법 5가지
https://youtu.be/E-6-yW3firM
=============================================================================================================

- 비밀번호 저금통 구입(수종 선물)
1. 천년인터내셔널 디지털 ATM 저금통(10color, 흰색), 가격: 10,750원
http://www.enuri.com/detail.jsp?modelno=46969222
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=B504147185&frm3=V2
=============================================================================================================
 
- 당뇨 소모품비 제출(10시, 건강보험공단)
1. 건강보험공단 강남점(선릉역 근처) 6층에 가서 소모품비 청구 ==> 2020.10.17 양재최의원에서 발행한 처방전
==> 24,750원 입금됨[2021.01.27(수)]
==============================================================================================================
 
- LG U+ 인터넷, TV 이전 요청
1. 인터넷 이전 요청 전화(101): 2021.01.26(화)
 1) 해지한다고 하니깐 이전 설치비 35,400원 중에 13,000원 만 납부하면 된다고 함(설치 후 1년 동안 해지 안 한다는 조건)
   가. 지금 해지하면 위약금이 50만원 정도 된다고 함 
 2) 강아현 명의로 인터넷이 가입되어 있다고 함
2. 인터넷 이전 설치 약속: 2021.02.01(월) 10시
3. 현아트빌주소: 서울 관악구 조원로 159-1 현아트빌 404호, (우)08704, 지번: 신림동 470-21
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 폐가전 수거 완료 문자 받음(09:40), 이불, 옷 처리(20시, 재활용통에 버림)

- 본사 대기[★]  
- 윈도우 10 설치 방법 동영상 시청, 문서 작성
==============================================================================================================

 - 진수종 국민은행 계좌 개설
1. 계좌번호: 839202-04-266846, 예금주: 진수종, 국민은행 테헤란로 지점
 1) 가족관계증명서(일반), 기본증명서(상세) ==> 진수종 명의
==============================================================================================================
 
- 수종 용돈 자동이체 설정(신한은행에서)
1. 이체할 계좌: 839202-04-266846, 예금주: 진수종, 이체금액: 5천원, 이체일자: 27일
 1) 기간: 2021.02.27 ~ 2031.01.27
==============================================================================================================
 
- 수종 양육비 자동이체(신한은행에서)
1. 이체할 계좌: 606401-04-083394, 예금주: 진수종, 이체금액: 50만원, 이체일자: 27일 
 1) 기간: 2021.02.27 ~ 2025.01.27
==============================================================================================================

- 당뇨 3개월 진료(12:00, 매봉역): 마지막 방문
1. 당화혈색소 검사
2. 당뇨병환자 소모성 재료 처방전 받음 ==> https://blog.naver.com/dndtjr70/220565721407
3. 인슐린, 당뇨 소모품 구입 안함 ==> 당뇨 완치를 위해 노력할 것
==============================================================================================================

- 문영 APT 1806호 주인에게 전화
1. 전세금(2억 5천) 모두를 1월 29일(금) 오전까지 송금해준다고 함
2. 1월 20일(토) 10시에 와서 장기수선충당금을 준다고 함
==============================================================================================================

- 대동초 1학년 2반 수종이 담임선생에게 문자 옴(16시)
1. 2월 1일(월) 개학(원격수업) ==> 갤럭시 탭에 줌(Zoom) 설치
2. 2월 8일(월) 등교
---------------------------------------------------------------------------------------------------

- 현직 초·중·고 교사가 전하는 #원격수업? 이야기! [교육부 국민 서포터즈]
https://youtu.be/ZP28b1lSHJo
==============================================================================================================

- 초보자도 쉽게 하는 줌(zoom) 사용법(강의실 만들고 세팅해서 온라인 화상강의 시작하기)
https://youtu.be/EO7j_87dWok
==============================================================================================================
 
- 무료 영상통화 구글 듀오(DUO) 사용 방법
https://youtu.be/T9DrIIOtBSA
1. 구글 듀오(DUO) 설치 ==> 내 폰, 수종이 폰: 화질 좋음(만족)
==============================================================================================================

- 포항집 갤럭시 탭에 하이클래스 어플 설치(령경이가 도와 줌)
1. 원격수업용 ==> 수종 아이디: db1226, 비번: 1226
'하이클래스-알림장, 가정통신문, 하이톡'에 대해 알아보세요 - 
https://play.google.com/store/apps/details?id=com.iscreammedia.app.hiclass.android
==============================================================================================================

- 당뇨 3개월 진료(12:00, 매봉역): 마지막 방문
1. 당화혈색소 검사
2. 당뇨병환자 소모성 재료 처방전 받음 ==> https://blog.naver.com/dndtjr70/220565721407
3. 인슐린, 당뇨 소모품 구입 안함 ==> 당뇨 완치를 위해 노력할 것
============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.01.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 연말 정산 제출(9시, 김유진 대리 메일로 보냄), 눈 조금 옴(10시, 강풍, 눈 안 쌓임)

- 본사 대기[★]  
A. PC 조립 견적
- RTX 3080 포함한 드래곤볼급 PC 출고~ 그린컴 에서는 아직 희망이 있다
https://youtu.be/cCmvFsatlb0
https://www.greenpc.co.kr/shop/system_detail.html?pd_no=150107 ==> [그린컴] GU92: 1,039,200원
==============================================================================================================

- 2021년 강력추천 80만원대 게이밍 조립컴퓨터![개발도하는 한대표]
https://youtu.be/a2IkkoUToDk
https://cafe.naver.com/amunamuna/16731
==============================================================================================================

- 2021년 1월~2월 지금 컴퓨터 사려면 이 영상 꼭 보세요
https://youtu.be/1AgTRni5N-w
==============================================================================================================
 
- 2021년 01월 신년 조립 컴퓨터 견적 추천 l 컴퓨터 시장의 최대 암흑기.
https://youtu.be/pDvCtLN7jVI
1. 80만원대

-1월 띵 추천 컴퓨터 I (영재 컴퓨터)
https://www.youngjaecomputer.com/shop/item.php?it_id=2610082798
1. 97만원
==============================================================================================================

- 40만원대 가성비 롤PC 4350G 조립컴퓨터
https://youtu.be/dhzCNjOuKB0
- [현금특가] MF435(마인드 PC)
https://mindpc.co.kr/shop/system_detail.html?pd_no=17919
==============================================================================================================

- 채굴 미쳤네.... 재택근무용? 컴퓨터 80~100만원대 견적 구성 추천드립니다
https://youtu.be/oNGToVF36Og

- 신축년 659,000원 컴퓨터는 이 정도군요! 'i3-10100F + GTX 1650 조합 컴퓨터'[도레]
https://youtu.be/YMOsDuW3qaY

- 이것만 알면 컴퓨터 견적을 맞출 수 있다. - 게임용-
https://youtu.be/rmdOCTAhwRg

- 2070 SUPER 띵 추천 컴퓨터(영재 컴퓨터)
https://www.youngjaecomputer.com/shop/item.php?it_id=2611744545
==============================================================================================================

- 이사 계획 수립
91. 현아트빌 이사 비용(2021.01.30).xlsx 파일 작성
서울도시가스에 연락, 서울도시가스
=============================================================================================================='

- 삼성의 극가성비 10인치 태블릿 갤럭시탭A7은 쓸만할까?
https://youtu.be/3M07ezY7DN0
1. 삼성전자 갤럭시탭A7 10.4 WiFi 32GB [해외쇼핑], 가격: 26,5000원
==============================================================================================================

- [IRP 1탄] IRP계좌가 무엇인가요? 연말정산 환급, 퇴직금을 받는 방법
https://youtu.be/Atv8ZEzjAVM
IRP(Iindividual Retirement Pension): 개인퇴직연금(연금저축과 유사)
https://www.youtube.com/watch?v=xqXD9R_3TOI&ab_channel=%EB%B0%95%EA%B3%B0%ED%9D%ACTV
==============================================================================================================

- 서울도시가스 가스앱으로 이사(전출) 방문 신청 ==> 한달 전에 할 것 ■
1. 2021.01.30(토) 10시에 방문한다고 함 ==> 문영 APT 1806호
--------------------------------------------------------------------------------------------

- 서울도시가스 가스앱으로 이사(전입) 방문 신청 ==> 한달 전에 할 것 ■
1. 2021.01.30(토) 14시에 방문 신청 ==> 현아트빌 404호
 1) 가스 레인지를 사용하지 않아서 방문 필요 없다고 함(전기 인젝션 사용)
 2) 현아트빌 404호에 살았든 주인에서 도시가스 정산 확인하고 사용하라고 함
============================================================================================================== 

- 아파트 관리비 자동이체 해지 처리
1. 롯데카드에 전화해서 문영APT 1806호 아파트 관리비 자동이체 해지 요청
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2021.01.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 11:00 ==>  

- 본사 대기[★]  
- PC 견적, 조립 분석
==============================================================================================================

- 하나 손해보험 투입 결정(10시)
1. 노트북 포맷을 해서 윈도우 정품과 오피스 설치해서 오면 여기서 처리
2. 코로나19 검사 문자로 받아서 가지고 올것
==============================================================================================================

- 코로나 19 검사(13:30, 영등포 배드민턴장)
1. 코로나19 검사
==============================================================================================================

- 이사 준비[★]  
11:00 퇴근(백팩에 노트북 들고 옴)
11:40 귀가(문영 APT 1806호)
12:00 중식
12:10 실내 보도 ==> 문영 APT 1806호 주인이 2억 5천 송금 했는데 내가 예금 계좌로 보내라고 해서 안 들어옴(비상 걸림)
12:20 집출발(자전거)
12:30 신한은행 대림점 ==> 예금 계좌로 2억 5천 송금된 것 확인 ==> 주거래 통장으로 2억 5천 재송금
		 ==> 현아트빌 주인 계좌로 2억 5천 송금(잔금 천 5백 남음)
12:50 영등포 다목적 배드민턴 체육관 도착 ==> 코로나19 검사(2분 걸림): 2~3일 내로 문자로 통보해준다고 함
12:50 엘마트: 종량제 봉투 75리터 3장 구입(이사용)
13:20 대림2동 주민센터: 대형폐기물 신청 
 1. 대림2동 주민센타 방문해서 직접 신청, 수수료 납부, 스티커 받아옴
 1) 신청한 품목: 식탁, 의자(4개),  TV 다이, 화장대, 침대, 스툴(2개), 밥상(2개), 플라스틱 서랍장, 서랍장(2개) ==> 총 55,600원
13:50 귀가
14:20 이사짐 정리 ==> 대형폐기물 스티커 붙이기(테이프가 안 떨어져 엄청 고생함)
18:00 석식
18:20 실내 보도
19:20 종료
20:00 이불, 옷 여행용 캐리어, 가방에 넣어서 외부 헌옷 수거함에 넣기
20:30 옷 여행용 캐리어, 가방에 넣어서 아파트 헌옷 수거함에 넣기 ==> 2번 처리(총 5번)
21:00 내방 짐정리 
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 현아트빌 이사
 
- 이사 전쟁[★]  
05:00 기상
05:40 조식
06:00 실내 도보 
06:30 종료 
06:20 현아트빌 404호 주인에게 잔금 천 5백 송금(모두 처리함)
06:30 짐 정리
08:00 이사짐 센터(한남 익스프레스: 5톤 차)에서 옴
08:10 이사 시작: 대형폐기물 먼저 내려 보냄, 버릴 물건: 책, 장난감들 지정[상상외로 많음]
09:00 문영 APT 1806호 주인 도착
09:50 아파트 경비실에 재활용 쓰레기 쌓아둠(산더미 같음): 경비원이 분리수거 하라고 요구함
10:00 문영칸타빌레슈퍼에서 종량제 봉투 75리터 3장 구입(6천)
10:00 재활용 쓰레기 분류 작업(엄청 많이서 고생함): 아파트 경비원에게 3만원 주고 나머지 정리 부탁
10:10 도시가스 정산(직원이 와서 검사하고 내가 카드 결제함) ==> 120,700원
11:00 아파트 경비원에게 3만원 주고 나머지 처리 요청
11:10 문영 APT 1806호 주인에게 출입문 비번 알려주고 장기수선충담금 받아옴(모든 정산 완료) ==> 684,000원(17개월)
11:15 문영 APT 출발(자전거)
11:30 현아트빌 도착 ==> 한남 익스프레스 팀장이 현아트빌은 사다리차를 사용 못하기 때문에 인부 2명을 추가로 불러야 하니
		추가 비용 30만원을 달라고 함(25만원에 합의)
11:40 현아트빌 404호 주인 여자가 와서 자기들은 영구크린에서 100만원 주고 이사한다고 자랑함
		==> 새로 전세로 가는 아파트는 20년 넘어서 귀신 나올 것 같다고 함(조만간 현아트빌 404호 매각한다고 함)
12:10 중식(GS25편의점: 김밥) 
12:30 낙원부동산 도착: 계약 변경 사항 사인함, 수수료 855,000원 송금함
12:50 현아트빌 404호 주인 나감(인수인계 안하고 그냥 전화로 통보함) ==> 주인(문현철)이 전기세, 수도세 19,1000원 신한은행으로 송금해준
13:00 이삿짐 내리기
14:35 추가 인력 5명 도착
15:50 이사끝(125만원 현금 지불: 신한은행에서 현금 찾아와서 지급): 이사팀은 이사 끝나자 말자 돈 받고 가버림
		 ==> 다음부터는 꼼꼼하게 점검 후(최소 30분) 마음에 들면 돈을 지불할 것
		 ==> 이사한 집에 전기레인지(인덕션[십자가], 하이라이트[원형 코일]) 설치되어 있음: 인덕션은 아님, 하이라이트 3구
16:00 이사짐 확인
17:30 집출발(자전거)
17:46 이마트 구로점: 변기 덮게(대형) 구입
18:00 변기 덮게 크기가 안 맞음 
18:00 석식
18:30 실내 도보 
19:00 집출발(자전거)
19:10 이마트 구로점: 변기 덮게(대형) 반품
20:00 짐정리
20:30 취침(피곤해서 잠듬)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.01.31(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 17:00 ==> 현아트빌 이사짐 정리
 
- 이사 처리2[★]  
07:00 기상
07:40 조식
08:00 실내 도보 
09:00 종료 
09:20 짐 정리(내방) 
12:00 중식
12:10 실내 도보 
13:10 종료 
13:20 짐 정리(안방): 안방 장롱과 침대가 부딪쳐서 이불을 넣을 수 없다는 것을 확인 
15:20 짐싸 어플에 감상평 솔직하게 작성
18:00 석식
18:15 한남 익스프레스 김정옥 실장(견적)한테 전화해서 이사가 마음에 안 들었고 장롱 재배치 안 해주면 신고 한다고 통보함
18:30 실내 도보 
19:30 종료 
19:40 한남 익스프레스 팀장한테 전화: 이번 주(2월 3일 이후)에 장롱 재배치 해준다고 함
20:20 집출발(자전거)
20:30 다이소 난곡점: 행주, 못통, 줄자 구입
20:40 진흥마트: 음식물 쓰레기2리터(10장), 종량제 봉토 5리터(10장) 구입 
20:50 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// 이사 전 처리할 사항 //------------------------/ 2021.01.28(목) /-----+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  
 - 이사 업체 계약  ==> 최소 2달 전에 할 것 ■
1. 전세 계약과 동시에 이사 업체 선정하고 계약할 것
 1) 빨리 계약해야 이사 비용을 줄일 수 있음(손 있는 날, 금요일 피할 것)
=============================================================================================================

- LG U+ 인터넷, TV 이전 요청[2021.01.26(화)]  ==> 한달 전에 할 것 ■
1. 인터넷 이전 요청 전화(101): 2021.01.26(화)
 1) 해지한다고 하니깐 이전 설치비 35,400원 중에 13,000원 만 납부하면 된다고 함(설치 후 1년 동안 해지 안 한다는 조건)
   가. 지금 해지하면 위약금이 50만원 정도 된다고 함 
 2) 강아현 명의로 인터넷이 가입되어 있다고 함
2. 인터넷 이전 설치 약속: 2021.02.01(월) 10시
3. 현아트빌주소: 서울 관악구 조원로 159-1 현아트빌 404호, (우)08704, 지번: 신림동 470-21
 ==> 빨리 신청을 안 해서 월요일에 옴(토, 일 인터넷, TV 사용 못 함) 
=============================================================================================================
 
- 서울도시가스 가스앱으로 이사(전출) 방문 신청[2021.01.28(목)] ==> 한달 전에 할 것 ■
1. 2021.01.30(토) 10시에 방문한다고 함 ==> 앞으로 이사할 때 한 달 전에 신청할 것
--------------------------------------------------------------------------------------------

- 재활용 쓰레기 처리 ==> 한달 전에 할 것 ■
1. 빨리 안하면 이사 당일 쓰레기 폭탄을 맞고 분리수거를 해야함(뼈져린 경험)
2. 이불, 헌옷, 신발 수거함에 버리기(버려야 산다) [2021.01.29(금]
============================================================================================================== 

- 아파트 관리비 자동이체 해지 처리[2021.01.28(목)] ==> 한달 전에 할 것 ■
1. 롯데카드에 전화해서 문영APT 1806호 아파트 관리비 자동이체 해지 요청
==============================================================================================================

- 이사 업체에 확인 전화[2021.01.29(금]
1.한국이사 업체 김정옥 실장에게 전화 
 1) 내일 8시에 이사팀이 방문한다고 함
 2) 종량제 쓰레기 봉투 1장 구입하라고 함 ==> 종량제 쓰레기 봉투 75리터 최소 3장 구입할 것
--------------------------------------------------------------------------------------------
 
- 전세금 송금 받기, 보내기[2021.01.29(금]
1. 이사 전날 대부분 보낼 것 ==> 이사 당일날  최소 천 만원을 남기고 전세집 상태 확인 후 잔금 천만원 송금해 줄 것 ■
--------------------------------------------------------------------------------------------
 
- 대형폐기물 신청(대림2동 주민센타) [2021.01.29(금] ==> 1주일 전에 할 것 ■
1. 대림2동 주민센타 방문해서 직접 신청, 수수료 납부, 스티커 받아옴
 1) 신청한 품목: 식탁, TV 다이, 화장대, 침대
 2) 대형폐기물 배출안내 ==> https://www.ydp.go.kr/reserve/contents.do?key=4176& 
--------------------------------------------------------------------------------------------

- 귀중품 여행용 가방에 담기 [2021.01.29(금]
1. 약 분실 ==> 귀중품 확실하게 챙기길 것
==> 비상금 20만원 몸에 지니고 다니고 신한은행 직불 카드 핸드폰에 넣고 현금 항상 출금 대기할 것
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// 이사 후 처리할 사항 //------------------------/ 2021.01.28(목) /-----+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  
- 전입신고, 확정일자 받기(신사동 주민센터) [2021.02.01(월)] 
1. 신사동 주민센터에 직접 방문해서 처리할 것
2. 참고
 1) 전입신고(정부24) ==> https://www.gov.kr/main?a=AA020InfoCappViewApp&CappBizCD=13100000016
 2) 온라인 확정일자 신청(대법원 등기소) ==> http://www.iros.go.kr/pos1/jsp/help2/jsp/006001001002.jsp
=============================================================================================================

- 주소 변경[2021.02.01(월)] 
1. KT moving◀ ==> 원클릭 주소 변경 서비스 ==> https://www.ktmoving.com
 1) 이사 후에 집주소 변경하는 방법! ==> https://m.post.naver.com/viewer/postView.nhn?volumeNo=15773935&memberNo=42031737
=============================================================================================================

- LG U+ 인터넷, TV 설치[2021.02.01(월)] 
1. 인터넷 이전 요청 전화(101): 2021.01.26(화)
 1) 해지한다고 하니깐 이전 설치비 35,400원 중에 13,000원 만 납부하면 된다고 함(설치 후 1년 동안 해지 안 한다는 조건)
   가. 지금 해지하면 위약금이 50만원 정도 된다고 함 
 2) 강아현 명의로 인터넷이 가입되어 있다고 함
2. 인터넷 이전 설치 약속: 2021.02.01(월) 10시
3. 현아트빌주소: 서울 관악구 조원로 159-1 현아트빌 404호, (우)08704, 지번: 신림동 470-21
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
