

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.12) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.12.01(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 한파(영하 3도)

- LG U+ 게시판 기능 개선 Prj[★]
- 댓글 삭제 기능 ==> 완료[♥♡] 
scwin.btn_deleteRpl_onclick = function() { 
	console.log("[/eacmAcMossComulListBbsAtcl.xml] [btn_deleteRpl_onclick()] ==> [TEST_01] [댓글 삭제 버튼 클릭 이벤트]");
	
	dm_deleteRplParaam.setEmptyValue();
	
	var idx = this.getUserData("idx");
	dm_deleteRplParaam.set(bbsId", dl_rpl.getColumnData(idx, "dd): ):	// 게시판ID
 
	com.sbm.execute(sbm_commonGroup);   // 코드관리 조회
}; 
==============================================================================================================
 
- NTOSS 로컬 서버(eclipse) Websquare 라이선스 키 등록(라이센스 등록)
1. eclipse > Help > 웹스퀘어 라이선스 등록 > 라이선스 키(license)
2022년 01월 31일 만료 WebSquare Platform, Hybrid, Push 통합 라이선스 (cpu = 64)
Jjkc4WEw3O1dCQz5OODQxVlM3Qzw1SDA=
7n58cA5msfta0KJgQSypVv5rgZNayoncOM7G0HlpNEmfAYxvGc+j4WwH675BoxHXYkqxMrG
Od22pQBzC3F3KGHdSyMEdPhx8PWHZlM= 
--------------------------------------------------------------------------------------------------------

2. Loading License. PATH: C:\WS5_SAMPLE\RESOURCE\websquare_home\license\license 파일에 복사, 붙여넣기
Jjkc4WEw3O1dCQz5OODQxVlM3Qzw1SDA=
7n58cA5msfta0KJgQSypVv5rgZNayoncOM7G0HlpNEmfAYxvGc+j4WwH675BoxHXYkqxMrG
Od22pQBzC3F3KGHdSyMEdPhx8PWHZlM=
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.02(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★] 
- 개발 서버(TOSS3.0_DEV)에 소스 이관(Git Extensions에서)
1. 우서범  사원이 보안 클라우드에 접속하여 소스 이관해 줌(9개 파일)
2. [DEV] [SI-매뉴얼게시판] [공통] [진태만] AS 게시판 관련 수정
==============================================================================================================

- 통시 서버(TOSS3.0_TST)에 소스 이관(Git Extensions에서)
1. 내가 보안 클라우드에 접속하여 소스 이관 처리함(9개 파일)
==============================================================================================================

- 법무법인 효성에서 현아트빌 404호 경매 절차 시작 통지 우편 보냄(19시, 집)
1. 낙원 부동산 사장에게 전화 ==> 현아트빌 404호 등기부 등본 보내줌
2. 빌라 소유자 우종길에게 전화 ==> 내일 알아보고 전화 준다고 함
3. 일남이에게 전화: 전화 안 받음
4. 태용이와 전화
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.03(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★] 
- 통시 서버(TOSS3.0_TST)에 모바일 게시판 댓글 등록 권한 확인
1. 전체 AS매뉴얼 화면 클릭 ==> "해당 메뉴에 대한 권한이 없습니다"라는 에러가 뜸(권한 TABLE 문제)
==============================================================================================================

- 댓글 삭제 후 refresh 수정
1. 댓글 수 변경 처리 
==============================================================================================================

- 권한 요청 엑셀로 요청서 작성하여 공통(김춘미 과장)에게 요청
1. 양식 틀리다고 2번이나 다시 작성하라고 함 ==> 짜증나서 안 하고 퇴근
2. 지하철에서 노동연 이사한테 전화 옴 ==> 내가 여기 SM 문제 많다고 짜증냄
==============================================================================================================

- 보안 클라우드에 원노트 사용
1. 편집 툴로는 최고라고 판단됨(MS 워드패드 대체)
==============================================================================================================

- 빌라 소유자 담당 부종산에서 전화옴(09시, 사무실)
1. 내가 1순위 방어권이 있으니 걱정마라고 함(양재호 대포: J&S Housing)
 1) 최악의 경우 내가 빌라 매입하면 된다고 함
2. 압류 금액이 총 2천이고 변재하고 경매 취하하겠다고 함 
==============================================================================================================

- 원노트 간단한 사용법 OneNote 앱 설명[IB 96]
https://youtu.be/fLfs4dN1lSI
 
- [OneNote] 원노트 사용법 1편 - 원노트 기본 개념 및 구성 설명 (feat. 전자필기장, 섹션, 페이지)
https://youtu.be/4PJK_nwJ5CE
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.04(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
05:00 기상
05:15 조식
05:56 집출발
06:02 남서울중학교 정류장 도착 
06:08 643번 버스 승차
06:50 고속버스터미널 하차
07:20 포항행 고속버스 승차(12번 좌석: 햇빛 때문에 신경 쓰임)
11:16 포항 고속버스 터미널 도착
11:33 고속버스 터미널 정류장(209번 버스 승차)
11:45 두호동 주민센터 하차
11:50 포항집 도착 ==> 로지텍 MK245/MK240 무선 키보드 마우스 세트(수종 선물)
12:08 중식
12:37 실내도보
14:15 종료
14:20 인터넷 서핑
15:25 집출발 
15:53 두호 철물 방문 ==> 거실문 손잡이(2개, 8천원) 구입
16:00 리더스 마트앞 노점상 ==> 국화빵(30개(9천원): 10개 3천원) 구입
16:20 귀가 ==> 엄마가 국화빵 나눠 먹는 거 아주 좋아 함
16:30 거실문 손잡이 설치 
16:35 집출발 
16:41 두호 철물 방문 ==> 사랑방 손잡이(2개, 8천원) 구입 
16:47 리플러스 방문 ==> 찰흙미 1kg(3개, 개당 6천 3천원, 총 18,900원) 구입
16:20 귀가
17:35 집출발 
17:47 다이소 포항 두호점 방문 ==> 고무 나무 북 스텐드(대형) (5천원), MS 접이식 테이블(50*30cm) (5천원) 구입 
17:57 귀가
18:05 석식
18:30 실내도보  ==> 주식의 정석 79강 종료(7번 수강 완료)
20:35 종료
20:30 사랑방 창문 손잡이 재설치 ==> 샤시에 볼트 잘 안 막히고 유리 가까지에 볼트를 뚷어서 창문 유리 깨짐
21:15 집출발 
21:25 다이소 포항 두호점 방문 ==> 사생활 보호용 창문 시트(50*120 cm) (3천원) 구입
21:12 귀가 
21:20 사랑방 창문에 사생활 보호용 창문 시트 설치(흰색이라 그나마 다행)
21:50 종료
23:10 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.05(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:40 조식
07:00 실내도보
08:10 종료
09:00 주방 도배 시작 ==> 1. 벽쪽 3장 먼저 바름 
         1. 주문한 벽지 확인, 2. 주문한 장판 확인, 3. 장판 벽지 장비 확인
10:00 주방 장판 시공 시작 ==> 크기를 잘못 계산해서 짧게 자름(칼로 잘라서 비뚤하게 잘림)
11:20 종료
12:00 중식
12:30 실내도보
13;05 종료 
13:10 주방 냉장고 벽쪽 도배 시작(3장)
13.50 주방 냉장고 벽쪽 도배  종료
15.00 주방 냉장고, 김치 냉장고 약간 들어서 장판 끼워 넣음
15:10 주방 장판 2장 이음매 절단(Edge Cutting): 자 대고 칼로 장판을 잘라도 삐뚤하게 잘림(초보자의 한계)
16:35 장판 시공 종료
18:00 석식 
18:20 실내도보
20:00 종료
20:10 인터넷 서핑 
23:00 샤워(매우 피곤함)
23:10 취침(수종)
==============================================================================================================
 
- 실리콘! 이 영상만 보면 저희보다 더 잘 쏠 수 있습니다. 실링에서 접착까지 보여드립니다.
https://youtu.be/tYoYk-7wTLY
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.06(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:40 조식
07:00 실내도보
08:10 수종이와  같이 동부초 등교
08:30 귀가
09:00 사랑방 도배 시작(남은 3.5장 도배지 사랑방 벽쪾에 붙이기로 함)
        ==> 0.5장 도배지가 굳어서 분무기로 물 뿌려서 겨우 떼냄: 성공적으로 도배 마침
10:50 종료
11:30 중식 
12:10 집출발
12:19 두호주민센터 정류장 ==> 209번 버스 승차
12:40 포항 고속버스터미널 도착
13:10 포항 출발(동양고속 와이파이 사용[속도 빠름: 혁신적], 비트코인 분석)
15:40 낙동강구미 휴게소 도착 ==> 박원상 부사장과 전화: 흥국생명 또는 흥국화재 SM 680(연간 계약)로 제안
		--> 700으로 합의하고 인터뷰 보기로 함
17:10 서울 강남터미널 도착
17:12 고속 터미널 정류장 ==> 643번 버스 승차
18:00 남부초 정류장 하차
18:10 귀가
18:54 석식
19:15 집출발(자전거)
19:30 연세미래치과(포도빌딩 8층)
19:40 신경치료(완료), 보철 본뜨기(지르코니아 계열 투티 타오), 임시 치아 생성 ==> 총 467,800원 
20:40 종료
21:00 귀가
21:20 청소
21:30 인터넷 서핑 ==> 박원상 부사장에서 01. 경력기술 프로필(진태만).doc 수정하여 이메일 보냄
00:00 취침
==============================================================================================================

- 4차 산업혁명시대, "비트코인, 블록체인" 알려드립니다! l 고려대학교 정보보호대학원 "김승주 교수" 강의(채굴: 투표)
https://youtu.be/t9_3JNJosiI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.07(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> LG U+ 출입증 나옴(16:20, 지하 1층 업무지원센터, 기존 CNS 출입증 손태기 책임에게 반납)
							,  주식의 정석 1강 시작(8번 수강 시작)

- LG U+ 게시판 기능 개선 Prj[★] 
- Git Extensions에서 에러 발생
1. Fetch all ==> Merge 하면 Commit이 4950개 생성됨
 1) Commit 된 소스 Reset 불가능함
2) 우서범 사원이 보안 클라우드에 접속하여 작업
==============================================================================================================

- 모바일 게시판 검색 수정
1. 특수 기호 조회시 alert 띄우기 수정
==============================================================================================================

- 모바일 게시판 댓글 수정
1. 댓글 등록되지 않는 댓글도 등록 text area, 버튼 보이게 수정
==============================================================================================================

- Git Extensions 설정(노트북에서)
1. 유튜브 동영상 분석 
- #1 Git 설치 (Git & Git extensions) _ Git 환경에서 S/W 개발하기 첫번째 git 환경 구축[개발자를 꿈꾸다]
https://www.youtube.com/watch?v=ESePPSQSh24&list=PLk3PkBqRCyIEzFyMMrbxPo02JcfvVVtU5
==============================================================================================================

- .gitignore 적용하기
https://velog.io/@psk84/.gitignore-%EC%A0%81%EC%9A%A9%ED%95%98%EA%B8%B0
1. gitignore 사용하는 이유: 퍼일 백업 정보, 제품 빌드 정보 등의 로컬 구성 재정의 등을 저장소에 올려놓지 않기 위함
 1) 이런 파일들을 untracked files로 설정하여 git이 이 파일들을 track하지 않도록 함(불필요한 파일이 github 등의 repo에 올라가지 않도록 하는 것)
==============================================================================================================

- 실리콘 쏘기,장판을 이용해서 실리콘 쉽게 쏘기, 장판을사용하면 쉽고 깔끔하게 처리 됩니다.
https://youtu.be/ie8rqUDsylA

- 손쉬운 장판인테리어, 찢어진 장판 보수 어렵지 않다! 간단한 장판 셀프 시공 방법 | 일꿀TV
https://youtu.be/vyKTXCA8pHA

- 장판 복원 내가 하고 내가 놀란 기적의 마술같은 영상 찍히고 찢어진 장판 셀프 보수
https://youtu.be/53CVsgxja74
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.08(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★] 
- 개발 서버, 통시 서버에 소스 배포(12.08) 
1. 모바일 게시판 검색, 댓글 View 수정(2개 파일)
 ==> 로컬 서버(eclipse 에러가 나서 제대로 테스트 못함)
==============================================================================================================

- Git Extensions 설정(노트북에서)
1. 유튜브 동영상 분석 
- #1 Git 설치 (Git & Git extensions) _ Git 환경에서 S/W 개발하기 첫번째 git 환경 구축[개발자를 꿈꾸다]
https://www.youtube.com/watch?v=ESePPSQSh24&list=PLk3PkBqRCyIEzFyMMrbxPo02JcfvVVtU5
==============================================================================================================
 
- 로컬 노트북 GitHub 생성 및 설정
01. 저장소 생성(웹(https://github.com)에서)
https://github.com/JINTAEMAN/01_Git_TAMA   ----> INTAEMAN/22tadhtlqenf!
2) HTTPS: https://github.com/JINTAEMAN/01_Git_TAMA.git
02. 저장소 Clone(Clone repository)  @@@
1. 로컬 탐색기에서 D:\91_Git_TAMA 폴더: 마우스 우 클릭 ==> GitExt Clone
2. Clone(새창)
 1) Repositories to clone: https://github.com/JINTAEMAN/01_Git_TAMA.git
 2) Destination: D:\91_Git_TAMA
 3) Subdirectory to create:  01_TEST
 4) Branch:  (default: remote HEAD) 
 5) repository type: Personal repository --> Clone: 클릭
==> .git 생성됨(D:\91_Git_TAMA\01_TEST)	 ===> ■■■
==============================================================================================================

- 01. github 블로그 생성
https://jintaeman.github.io
1. 파일 생성
_posts/2021-12-08-firstReg.md
_posts/22021-12-08-secondReg.md
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.12.09(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 게시판 수정
1. 5개 AS 게시판 통합해서 View
 AND BBS_ID IN( '25', '26', '27', '28', '29', '30')		// 게시판 ID(25: 인터넷, 26: TV, 27: 전화, 28: IOT, 29: 특이장애, 30: 전체 AS 매뉴얼) 
==============================================================================================================
 
- AS 전체 게시판 검색 수정
1. sbx_mossBbs.setValue(scvar.scrnId);		// 게시판ID(메뉴ID): 추가[2021.12.09, by 진태만]
==============================================================================================================

- AS 전체 게시판 등록, 수정 삭제 수정
1. Grid 클릭시 변경된 게시판 ID(bbsId)를 가지고 와야 함
 1) dm_listBbs_2.set("bbsId", dm_listBbs.get("bbsId");	// 게시판ID 추가[2021..12.10, by 진태만]
==============================================================================================================
 
- 개발 서버, 통시 서버에 소스 배포(12.09) 
1. 모바일 게시판 검색, 댓글 View 수정(2개 파일)
==> 손태기 책임에게 소스 이관 완료 메일 보냄(17:30)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.10(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 테스트: AS 전체 게시판 신규 등록시 에러 발생 ==> 모든 파라미터 dm_listBbs_2.set 할 것
==> 로컬 clipse 에러로 제대로 작업 못 함
==============================================================================================================
 
- 전체 게시판 공통 모듈화
1. 공통메타코드 목록 테이블 이용할 것 ==> 공통메타속성값6(전체 게시판 부모 ID), 공통메타속성값7(전체 게시판 ID)
==============================================================================================================

- 김춘미 과장이 sql 하드 코딩했다고 노동연 이사에게 전화옴(11:30)
1. 다시 전화 걸어서 약간 화냄
2. 김춘미 과장에게 메일 보내 구체적인 가이드 달라고 요청
3. 김춘미 과장이 공통메타코드 목록 테이블 이용하라고 답장 메일 보냄
==============================================================================================================
 
- 어도비 포토샵 2022 구입 및 PC에 설치
- 어도비 포토샵 2022, Adobe Photoshop CC, 선택: 포토샵 2022 윈도우용(+100원), 가격: 150원(네이버 페이로 결제)
https://smartstore.naver.com/zhemgodqhr/products/6072061363
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.11(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
05:30 기상
05:40 조식 ==> 당뇨약 다 먹음(완전 종료)
06:15 집출발
06:25 남서울중학교 정류장 도착
06:20 643번 버스 승차
07:50 강남역 정류장 하차
07:55 누네안과병원(선릉역 1번 출구 도착 ==> 코로나 문진표 작성, 15층 데스크 접수
07:55 안과 검사(15층): 1번(안압 검사), 2번(시력 검사)
08:07 망막 검사(13층): 눈약 넣기, 1번(망막 CT 촬영: 파란 십자가), 2번(망막 전체 사진 촬영(볼 데기): 파란 원), 3번(안저 퇄영(노란 X표))
08:34 종료
09:38 진료(김주영 원장 10번 진료실, 13층) 
08:43 수납(13층) ==> 진료비: 총 52,300원 ===> 다음 예약: 4월 9일(토)
09:20 643번 버스 승차
10:10 신림역 하차
10:20 16:16 헌혈카페 신림점 방문 ==> 문 닫힘
10:25 다이소 신림3호점 방문 ==> 수성 싸인펜 6본입(천원), 접지형 스위치 콘센트3구 (1.5 m)(2개, 만원) 구입
10:50 귀가
12:00 중식
12:30 실내 도보
12:30 종료
13:40 인터넷 서핑
19:00 석식
19:30 실내 도보
20:30 종료
20:30 인터넷 서핑
22:30 종료
22:35 취침
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.12(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:40 조식
===================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.13(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 13:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 노동연 이사에게 로컬 clipse 에러 조치 요청 메일 보냄
1. 10시에 우서범 사원이 보안 클라우드에 접속해서 작업 ==> 11시: 작업 완료: 로컬 clipse 재 가동됨
==============================================================================================================

- 전체 AS 매뉴얼에서 등록시 에러 발생
1. 수정 작업 중
==============================================================================================================
  
- 면접[★]
13:00 퇴근
13:15 월드컵 파크 5단지 정류장: 171번 버스 승차
13:55 경복궁역 정류장 하차
14:10 스타벅스 숭례문 북창점 방문: (주)와이즈인포텍 장영수 상무 만남(커피[아메리카노] 먹음)
14:30 흥국생명 5층 방문: 흥국생명 담당자 면접(여직원 휴게실)
15:20 종료
15:30 흥국생명 3층 방문: 흥국화재 담당자(2명) 면접(회의실)
16:00 종료
16:10 삼성본관앞 정류장: 504번 버스 승차 ==> 배상범에게 카톡 보냄(흥국생명, 화재 면접 제안: 배상범이 장영수 상무에게 메일 보냄)
17:05 신림역 정류장 하차
17:15 연세미래치과 방문
17:20 보철(지르코니아 계열 투티 타오) 장착, 스켈링(14,500원: 치석이 많이 나와서 간호사가 하루에 한번 치실 작업 하라고 함)
		==> 실비 보험 서류 수수료: 3천원
17:45 종료
18:07 석식
18:30 실내 도보 
19:58 종료 
20:00 인터넷 서핑 ==> 제주도 가족 여행 서핑
23:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.12.14(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 수정
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2021.12.15(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 배상범이 흥국생명 SM 면접보고 합격했다고 함(16:30, 축하): 나는 불합격

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 수정
1. mybatis (foreach문, in절) 사용 
 1) mybatis (foreach문, in절): WHERE 절의 조합(AND / OR / NOT / IN 연산자) 
==============================================================================================================

- dataMap setJSON 테스트(웹스퀘어에서)
dataMap1.set("name","진태만");  
dataMap1.set("addr", "신대방동");

// var data1 = dataMap1.getJSON();
dataMap2.setJSON(dataMap1.getJSON()); 		// DataMap의 전체 데이터를 JSON으로 셋팅
console.log("[/login.xml] [onpageload()] ==> [TEST_21] [01. 테스트 dataMap] [name]"+ dataMap1.get("name") +"[addr]"+ dataMap1.get("addr") ); 
console.log("[/login.xml] [onpageload()] ==> [TEST_32] [02. 테스트 dataMap] [name]"+ dataMap2.get("name") +"[addr]"+ dataMap2.get("addr") );
----------------------------------------------------------------------------------------------------------------------------------------------

<!--// 01. 테스트 dataMap //-->
<w2:dataMap id="dataMap1"> 
	<w2:keyInfo> 
		<w2:key id="name" name="이름" dataType="text"></w2:key> 
		<w2:key id="addr" name="주소" dataType="text"></w2:key> 
	</w2:keyInfo> 
</w2:dataMap>  
<!--// 02. 테스트 dataMap //-->
<w2:dataMap id="dataMap2"> 
	<w2:keyInfo> 
		<w2:key id="name" name="이름" dataType="text"></w2:key> 
		<w2:key id="addr" name="주소" dataType="text"></w2:key> 
	</w2:keyInfo> 
</w2:dataMap>  
--------------------------------------------------------------------------------------------------------------------------------------------

- dataMap setJSON 테스트(웹스퀘어에서)
/**
 * 조회 버튼 클릭 이벤트
 */
scwin.btn_search_onclick = function() {
	console.log("[/WF001M.xml] [btn_search_onclick()] ==> [TEST_01] [조회 버튼 클릭 이벤트]" );
	
		var setJSON = {
			"TASK_ID": taskId.replaceAll(" " ,"") ,
			"TASK_NM": taskNm.replaceAll(" " ,"")
		}; 
		console.log("[/WF001M.xml] [fn_search()] ==> [TEST_50] [setJSON]"+ JSON.stringify(setJSON) );
		// console.log("[/login.xml] [btn_login_onclick()] ==> [TEST_20] [dataMap값 조회] [dma_loginCheck]"+ JSON.stringify(dma_loginCheck.getJSON()) );
		
		com.exeService(
			{"ServiceID":"T_WF_0001"},		// Sub Info(1. ServiceID: 서비스 ID, 2. URL: 호출할 URL) ■■■
			setJSON,									// INPUT 값(inJSON)
			scwin.fn_search_callback			// 결과 콜백 함수(callbackFn)
		);
	};
};
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.16(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 손동욱 고모 조의금(명시당): 송금함

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 수정 
v_gridBbsSrchYn = "Y";	// 게시판 정보 조회 여부
v_gridClikBbsSrchScpID = "Y";	// 클릭한 Grid 내 게시물 scop Obj ID
1. 최초 조회이면 
 1) dm_listBbs_ori (게시판 최초 메타 정보) DataMap 생성하여 데이타 복사
dm_listBbs_ori.setJSON(dm_listBbs.getJSON());	// dm_listBbs DataMap의 전체 데이터(dm_listBbs_ori)를 JSON으로 셋팅 
2. 최초 게시판ID와 클릭한 Grid 게시판 ID가 다르면 
==> 01. 메뉴 게시판 정보 다시 조회(클릭한 Grid 게시판 메뉴ID로 dm_listBbs 다시 조회)
dm_listBbs.setJSON(dm_listBbs.getJSON());
==============================================================================================================
  
- 전체 게시판 공통 모듈화
1. 공통메타코드 목록 테이블 이용할 것  
 1) 공통메타속성값4(전체 게시판 부모 ID): M5825, 공통메타속성값5(전체 게시판 ID): M5825
 2) 전체 게시판 공통 명명법
 1) PC + 게시판명: 전체 전체 AS매뉴얼(M5825): M5825
 1) 모바일 + 게시판명: 전체 전체 AS매뉴얼(MM5801): MM5801
==============================================================================================================
 
- 개발 서버(TOSS3.0_DEV)에 소스 이관(Git Extensions에서)
1. [DEV] [SI-매뉴얼게시판] [공통] [진태만] AS 게시판(전체 게시판) 수정
==============================================================================================================

- 통시 서버(TOSS3.0_TST)에 소스 이관(Git Extensions에서)
1. [TST] [SI-매뉴얼게시판] [공통] [진태만] AS 게시판(전체 게시판) 수정
==> LG CNS 손태기 책임이 무리하게 소스 이관하라고 해서 16시 30분경에 이관 처리(Merge 에러 발생: Commit하고 처리)
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.12.17(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 테스트
1. 
==============================================================================================================
  
- LG U+ 게시판 기능 개선  관련 회의(10시)
1. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.18(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:20 기상
04:30 인터넷 서핑
05:15 조식
05:56 집출발
06:00  남서울중학교 정류장 도착
06:07  5416번 버스 승차
06:50 고속버스터미널 하차
07:20 포항행 고속버스 승차
11:11 포항 고속버스 터미널 도착
11:16 고속버스 터미널 정류장(209번 버스 승차)
11:30 두호동 주민센터 하차
11:35 포항집 도착
11:50 중식 
12:20 실내도보
14:05 종료  
14:20 인터넷 서핑 ==> 김태욱 과장과 전화(이사, 부인 병, 바뻐서 못 만난다고 함)
15:25 집출발
15:35 다이소 포항 두호점 방문 ==> 네트망(3326 cm), 천원), 수예용 둥근고무줄(약 4 mm*3.5 m, 천원), 따따시 수면 양말(2천원)
		, 바세린 데일리 모이스쳐로션(180 ml)(3천원) 구입
16:00 리더스 마트 앞 노점상 방문 ==> 국화빵( 30개(만원): 10개 3천원) 구입
16:20 귀가
16:30 화장실 선반 설치(못질): 서울에 눈 옴(8mm 쌓임)
16:30 인터넷 서핑
18:05 석식
18:30 실내도보 
20:15 종료
20:35 인터넷 서핑
22:00 잠(피곤)
23:00 기상
23:10 샤워(수종)
23:33 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.19(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:40 조식
07:00 실내도보
08:40 종료
08:50 인터넷 서핑: 법원 경매 분석
10:00 집출발
10:10 다이소 포항 두호점 방문 ==> 긴형 직사각 네트바구니(대/소아소트)B(2천원), 오릭스 핸드로션(350 ml)(3천원)
		, 과일나라 아프리카 아보카도핸드크림(80 ml)(천원) 구입
10:30 귀가
10:35 사랑방 선반 재 설치(못질)
10:40 종료
11:56 북경반점에 탕수육, 짜장면 5개 주문(큰누나가 시킴)
12:20 큰누나네 도착
12:36 중식(중화요리: 큰누나가 쏨)
13:20 실내도보
14:40 종료
14:50 집출발(큰누나 차: 매형, 수종)
15:20 다이소 포항 우현점(엄마 입원 물품 구입: 큰누나가 쏨)
15:40 리플러스 방문(수종 음식 구입: 내가 쏨): 45.240원 결제
16:00 귀가
16:05 석식
16:55 집출발(큰누나 차(매형): 큰누나에게 받은 2022년 달력 실수로 놓고 옴)
17:15 포항 고속버스터미널 도착
17:30 포항 출발(동양고속 와이파이 사용: 수면)
21:22 서울 강남터미널 도착(서울에 는 와서 쌓여 있음(8mm))
21:37 고속 터미널 정류장 ==> 643번 버스 승차
22:10 남부초 정류장 하차
22:15 귀가
22:30 청소
23:10 인터넷 서핑
01:00 취침
===================================================================================================================

- 10분만에 배우는 부동산경매절차[박철호의 경매TV]
https://youtu.be/j6bRZET35_g

- 부동산 경매를 위한 기본 중의 기본, 용어부터 사례까지! | 부동산 권리분석 요령[에어클래스]
https://youtu.be/HzjGxK9IG8k

- 1강_생초보가이드! 너무쉬운 법원경매입문◀오늘의경매_법원 부동산재테크교육 무료강의[오늘의경매]
https://youtu.be/__SFSlVcd5M
===================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.20(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- LG U+ 게시판 기능 개선 Prj[★]
- 전체 AS 매뉴얼 수정
==============================================================================================================

- 개발 서버, 통시 서버에 소스 배포(16시) 
1. 8개 파일 배포 ==> 스테이지 서버 배포는 18시 이후 가능 하다고 함
==============================================================================================================

- 전체 AS 매뉴얼 게시판 수정
1. 전체 검색에서 '댓글' 검색 가능
2. Paging 처리 가능 ==> 전체 게시판ID 조회 Query 제거
 1) 02. 리스트 게시물 목록 조회 Query에 포함 시킴
==============================================================================================================
 
- U Cloud 포털 비밀번호 변경(90일 경과)
https://ucloud.lguplus.co.kr/vmCube/DesktopLauncher/PCPC02W164#, tamario01/10tatktql!(10ta사십!) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.21(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 엄마 포항 의료원 입원(10시, 무릎 수술)

- LG U+ 게시판 기능 개선 Prj[★]
- 개발 서버, 통시 서버에 소스 배포(9시) 
1. 8개 파일 배포 ==> 어제 배포 잘못 했음(이전 소스 배포)
==============================================================================================================
 
- 개발 서버, 통시 서버에 소스 배포(17:45) 
1. 3개 파일 배포 ==>  결함 다수 발생, 손태기 책임이 오늘까지 다 수정하라고 해서 열받음
 1) (주)와이즈인포텍 박원상 부사장에게 전화해서 철수한다고 이야기함(부사장이 만류해서 참음) 
==============================================================================================================
 
- 산출물 작업
1. 사용자 지침서 작성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.22(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:00 ==> 엄마 무릎 수술(10시, 포항 의료원), CJ ENM BBP 구축 면접(18:30, CJ 제일제당 본사), 23시 창맥 전현노한테 전화옴
								  (홍대근처에 숙소 잡음, 조만간 종윤이와 같이 술 한잔 하자고 함)

- LG U+ 게시판 기능 개선 Prj[★] 
- 개발 서버, 통시 서버에 소스 배포(8시) 
1. 1개 파일 배포 ==> 모바일 AS게시판 검색 2줄 생김
==============================================================================================================
 
- 개발 서버, 통시 서버에 소스 배포(10시) 
1. 1개 파일 배포 ==> 헬프 데스크 쿼리 에러
==============================================================================================================
 
 - 개발 서버, 통시 서버에 소스 배포(14시) 
1. 1개 파일 배포 ==> Grid 헤드 소트 에러 
 1) copmf.headerSvcSortInit(grd_listAtcl.id, gridHearId, "scwin.sortFunc");
 2)  submission에서 action="/noss/.../{sortDirc}}/{allBbsParent|}"  ==> action="/noss/.../{sortDirc}/{allBbsParent|}"로 수정 
==============================================================================================================

- CJ ENM BBP 구축 면접[★]
17:00 퇴근(조현준 수석에게 무릎 아파서 병원 간다고 함)
17:20 DMC역 ==> 공덕역(환승)
17:30 동대문역사문화공원역(6번 출구)
17:40 CJ 제일제당 본사 도착 ==> 차용석(부장) 만남
17:50 뚜레쥬르 제일제당 사옥점 베이커리 방문 ==> 차용석(부장) 면접: DB에 대해 많이 물어봄		 
18:20 종료
18:30 동대문역사문화공원역 ==> 신대방역
19:15 귀가
19:20 석식
19:35 실내도보
20:20 종료
23:00 취침
==============================================================================================================

- CJ ENM BBP 구축 
1. 쌍림동:	1~10월
2. Java javascript springboot mybatis mysql
3. AWS 및 MSA 기반 시스템 설계 밀 개발: 로그 데이터 수집 적재 개발 우대
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.23(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> LG U+ 게시판 기능 개선 Prj 운연 반영(연기), 석식(편의점 햄버그, 컵라면): 야근 취소

- LG U+ 게시판 기능 개선 Prj[★] 
- 개발 서버, 통시 서버에 소스 배포(9시) 
1. 1개 파일 배포 ==> 모바일 조회 조건 정렬 처리
==============================================================================================================

- 스테이징 서버에 소스 배포(14:43) 
1. 8개 파일 배포 ==> 손태기 책임이 통시 테스트 및 사용자 테스트 완료했다고 통보(스테이징 서버 배포하라고 함)
 1) merge 에러가 나서 반영이 안됨 ==> 스테이징 서버에서 checkout 후 직접 소스 반경해야 함
==============================================================================================================
  
- 산출물 작업
1. 사용자 지침서 작성 ==> 완료[♥♡] 
 1) NTOSS(AS게시판 기능개선)-REV-05(사용자지침서)_V1.0.ppt
2. 운영 반영내역 작성 ==> 완료[♥♡] 
 1) NTOSS(AS게시판 기능개선)-REV-99(운영 반영내역)_V1.0.ppt
==============================================================================================================

- LG U+ 게시판  기능 개선 Prj 운연 반영(연기)
1. merge 에러가 나서 반영이 안됨 ==> 스테이징 서버에서 checkout 후 직접 소스 반경해야 함
2. 노동연 이사가 내일 마곡 사옥으로 출근해서 변경 소스 반영 하라고 함(석식 후 18시 25분에 노트북 가지고 퇴근함)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.24(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> LG U+ 마곡 사옥으로 출근

- LG U+ 게시판 기능 개선 Prj[★] 
- 소스 재 반영
1. CNS 김태기 수석이 스테이징 서버에 saveRating 함수를 올려놓고 통시 서버에는 안 올려놓음(양서버 동기화 안됨)
 1) 스테이징 서버에서 CNS 김태기 수석 수정 전 파일 받아옴(우서범 사원)
 2) 우서범 사원이 내가 개발한 소스 그대로 추가하라고 지시
 3) 우서범 사원이 내가 수전한 소스 파일 확인하고 검수 완료 
 4) 개발 서버에 배포
 5) 개발 서버에서 사용자 테스트 완료(우서범 사원 확인)
 6) 통시 서버에 배포
 7) 통시 서버에서 사용자 테스트 완료 
==> 노동연 이사에게 다음주 월요일날 휴가 간다고 했는데 거부당함(모든 잘못이 내한테 있다는 식으로 이야기 함)
==============================================================================================================

- 개발 서버에 소스 배포(15:50) 
1. 개발 서버에서 사용자 테스트 완료(우서범 사원 확인)
==============================================================================================================

- 통시 서버에 소스 배포(17:10) 
1. 18시 30분 이후 확인 가능 ==> 손태기 책임에게 배포 완료 메일 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.25(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 성탄절(영하 13도)

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:30 인터넷 서핑 ==> 76. 혈당관리 수첩_ALL_2020.05.xlsx 정리
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==>  
18:00 석식
18:20 실내 도보 
19:30 종료 
20:30 인터넷 서핑 ==> 
23:20 종료
23:25 취침
==============================================================================================================

- 주식 전업투자 후기[Srh] 
https://www.youtube.com/results?search_query=주식+전업투자+후기

- 15년 주식전업투자자가 전업을 꿈꾸는 분에게 드리는 조언[주식전업투자자-음봉타법]
https://youtu.be/DkKt6zjtYgQ

- 주식 투자자가 망하는 과정 | 전업투자자가 깡통차는 이유[주식전업투자자 - 주덕]
https://youtu.be/NZjQr4Y4QAk

- 건전한 전업 투자자의 하루[주식투자는 린지와 소공]
https://youtu.be/fMVsVP0mIkM

- 전업투자 꼭! 해야겠다면 지켜야 할 것들[허브경제TV]
https://youtu.be/H2r6A7xCyx0
==============================================================================================================
 
- 서울대병원 류지곤 교수의 건강법, 1일 1식과 걷기 - 걸음아 나 살려라 ‘10cm 더’(KBS_745회_2020.09.16) [KBS 생로병사의 비밀]
https://youtu.be/uXjpkNN1TbI
==============================================================================================================

- 당뇨를 이긴 사람들의 운동법 (KBS_2018.11.07) [KBS 생로병사의 비밀]
https://youtu.be/CZuM-JGAXio
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.12.26(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 한파(영하 16도)
 
- 주말2[★]
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:30 인터넷 서핑 ==> 보조 배터리, 홈바 의자 구입
12:00 중식
12:30 실내 도보  ==> 주식의 정석 82강 종료(8번 시청 완료), 주식의 정석 1강 시작(9번 수강 시작)
13:55 종료
14:00 인터넷 서핑 ==> 
16:51 (주)유성씨앤아이 한철영 대표에게 전화와서 통화, 이력서 이메일(chcy2783@naver.com)로 보냄
16:58 무릎 인공관절 수술 한 엄마와 전화 통화(수술 성공적: 보행보조 기구(워커) 이용하여 걸어다닌다고 함)
18:00 석식
18:20 실내 도보
20:00 종료
20:30 청소(빗자루, 밀대)
20:50 인터넷 서핑 ==> 법원경매정보 분석
22:21 (주)다룸씨엔씨 유병우 대표에게 이력서 이메일(bbwyou@naver.com)로 보냄
23:00 취침
==============================================================================================================
 
- 보조 배터리 구입
- 샤오미 5세대 20000mAh 보조배터리 PLM18ZM 대용량 C타입 PD 고속충전 ST, 가격: 28,630원
http://www.enuri.com/detail.jsp?modelno=65251471
https://escrow.gmarket.co.kr/ko/order?orderIdx=1cbb182ce&itemNo=2030778521 
==============================================================================================================

- 홈바 의자 구입
- 베스트렉 더블쿠션 발걸이형 홈바의자, 색상: 블랙, 가격: 32,457원
http://www.enuri.com/detail.jsp?modelno=18957120
https://www.lotteon.com/p/product/LD28319363?sitmNo=LD28319363_0&ch_no=100077&ch_dtl_no=1000235&entryPoint=pcs&dp_infw_cd=CHT
==============================================================================================================
 
 [잡코리아] [오후 8:47] [잡코리아] ㈜다룸씨엔씨에서 포지션 제안 ■■■
■ 기업명 : ㈜다룸씨엔씨 
■ 응답 만료일: 2021년 12월 31일
■ 제안 포지션: 영등포 근로복지공단. 전국민 교용보험확대 구축, 12개월, 780만/월
■ 제안내용 상세보기: http://joburl.kr/CeduU
==============================================================================================================

[잡코리아] [오후 3:56] [잡코리아] ㈜유성씨앤아이에서 포지션 제안 ■■■
■ 기업명 : ㈜유성씨앤아이 
■ 응답 만료일: 2021년 12월 27일
■ 제안 포지션: 프로젝트 제안드립니다 (투입 일정 협의 가능합니다)
■ 제안내용 상세보기: http://joburl.kr/CpnJg

프로젝트명 : SK매직 랜탈사업 고도화 : 탈락 ==> SK 건설(종로), 750(4개월: 이후 연장 계약)
등급 및 인원 : 중고급 다수
필수스킬 : Java, 오라클
근무지 : 서울역
기간 : 즉시(또는1월) ~ 6개월
단가 : 750 (이후 연장 계약)

프로젝트명 : 현대백화점 차세대 개발
등급 및 인원 : 중고급 2~3명
근무지 : 강남역
필요스킬 : Java / Nexacro
기간 : 1월중순~내년7월
단가 : 750
==============================================================================================================

- 하루 10초만 하세요. 이 자세 반복만 해도 놀라운 신체변화가 생겨요[건나물TV]
https://youtu.be/GrJmqZfvrxE
1. 팔굽펴 펴기, 플랭크 운동, 계단 걷기
==============================================================================================================

- 치실의 모든 것! 사용법부터 언제써야 좋을까? [치과의사 부부CHIKABUBU]
https://youtu.be/OTph_vACp2w
1. 치간 칫솔, 치실

- 치실 못 쓰는 사람 드루와! | 치실 잡는 법부터 차근차근 설명하는 치실사용법! [치대남_치과의사 고광욱_Dentist]
https://youtu.be/eMQr7hmKlAs

- 양치 방법중 가장 효과 없는 것은... 회전법? [치대남_치과의사 고광욱_Dentist]
https://youtu.be/hTPGKQFv8Ws

- 양치질 습관! 제대로 하려면 지금 당/장/ 바꾸셔야 합니다 [치대남_치과의사 고광욱_Dentist]
https://youtu.be/iWGueIDbODc

- 치석 셀프로 확인 가능할까요? [치대남_치과의사 고광욱_Dentist]
https://youtu.be/Muq2csaQhjk
1. 치경 덴탈 미러
==============================================================================================================
 
- ALN 고급 스테인레스 치경(덴탈미러/옵션), 2개, 가격: 총 8,140원
https://www.11st.co.kr/products/780918512?&xfrom=&xzone=
1. [추가상품] 이크린 고급형치실(55야드) 2개
==============================================================================================================
 
- 01. 법원경매정보
https://www.courtauction.go.kr/jsp/por/pas/PAS101012HwonLogin.jsp, tamario/20*0오십h@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.27(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:00 ==> LG U+ 마곡 사옥으로 출근, 우리금융 Prj(상암DMC, 780) (주)윈스(hr@winssystem.com)에 이력서 보냄

- LG U+ 게시판 기능 개선 Prj[★] 
- 소스 분석
1. 스테이징 서버에 소스 ServiceImple.java 파일에서 saveRating 함수를 추가 여부 확인
==============================================================================================================

- LG U+ Prj Stag 서버 반영 취소
1. 노동연 이사가 취소하라고 함 ==> 목요일 14시에 SM 인수인계만 받는다고 함
==============================================================================================================
   
- 산출물 작업
1. 단위테스트 케이스 작성 ==> 완료[♥♡]
 1) NTOSS(AS게시판 기능개선)-DVT-01(단위테스트케이스)_V1.0.ppt
==============================================================================================================

- 소파 버리기(10시, 집)
1. 관악구 재활용센터(신림점 842-8425)에 전화 ==> 3인용 소파 사진찍어서 전송 ==> 낡았다고 수거 거부함
2. 대형폐기물 배출안내(관악구) ==> https://www.gwanak.go.kr/site/gwanak/07/10703010500002016051206.jsp
 1) 3인용 소파 버리기(대형폐기물 배출: 관악구): 수수료 9천원 납부(12월 29일(수)에 버리기)
==============================================================================================================

- 「정부24」민원에서 초본 출력
1. 프린터 출력
==============================================================================================================

- 케어센스N 혈당지 주문
1. 케어센스N 혈당지 구입[쌍봉 종합의료기] ==> 1개당 220원에 10(통) 110,000원에 구입
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.12.28(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 16:00 ==> LG U+ 상암 사옥으로 출근, 근로복지공단 면접(17:30, 영등포시장역), 대형폐기물(3인용 소파, 9천원) 배출(21시, 집): 
								  혼자 소파 끌로 내려옴, 홈바 의자(블랙) 도착(21시, 조립: 마음에 들어서 의자(레드) 재구매)
								  
- LG U+ 게시판 기능 개선 Prj[★] 
- Git 분석
1. 유튜브 동영상 시청
==============================================================================================================
 
- 근로복지공단 면접(17:30, 영등포시장역)
1. 사업장 못 찾아서 고생함(서울시 영등포구 영등포동2가 94-344 진흥빌딩 3층)
 1) 한국이디에스 이규영 이사(010 2985 4251)
 2) PM 면접
  가. SM이 주도(1월 4일 1차 오픈): 체계가 안 잡힌 것 같았음: 공통, 개발 PL 없음
  나. A 시스템(WebSquare), B 시스템(Miplatform), C 시스템(WebSquare)
==============================================================================================================

- 홈바 의자 구입
- 베스트렉 더블쿠션 발걸이형 홈바의자, 색상: 레드, 가격: 32,980원
http://www.enuri.com/detail.jsp?modelno=18957120
https://www.lotteon.com/p/product/LD28319363?sitmNo=LD28319363_0&ch_no=100077&ch_dtl_no=1000235&entryPoint=pcs&dp_infw_cd=CHT
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.12.29(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 11:30 ==> 경매 배당 신청(14시, 현아트빌 경매, 법원), DB손보 면접(14시, DB금융센터), 코로나 예방 접종 3차 예약(12시, 병원)
 
- LG U+ 게시판 기능 개선 Prj[★] 
- Git 분석 
- Git 설정 
D:\91_Git_TAMA\WRM
-----------------------------------------------------------------------------------------------------

- Eclipse 설정
D:\91_Git_TAMA\WRM\WRM 
.git 폴더
WRM
.gitignore
 ==============================================================================================================

- 하나의 eclipse로 workspace 여러개 쓰기
1. 00. WS_WRM
C:\WEBSQUARE_DEV_PACK\bin\eclipse-jee-2020-03-win32-x86_64\eclipse.exe -data C:\WEBSQUARE_DEV_PACK\workspace
2. 01. WRM_New(Git 연동 처리)
C:\WEBSQUARE_DEV_PACK\bin\eclipse-jee-2020-03-win32-x86_64\eclipse.exe -data D:\91_Git_TAMA\WRM
==============================================================================================================
 
- Git ignore 특정 파일또는 폴더 제외 or 무시하기
 https://kcmschool.com/194 [web sprit]  
- /.gitignore 파일에서 @@@
## 폴더 무시[ 폴더 하위의 파일이나 폴더 또한 ignore(무시)
/WRM/bin
# 특정 확장자 파일 다 제외하기
*.lock
# 특정 파일  제외하기
/WRM/src/com/inswave/wrm/config/log4j.xml
==============================================================================================================
 
- 강남 나들이[★]
12:15 퇴근
12:35 수색역 --> 옥수역 --> 교대역
13: 50 서울 법원 종합 청사 4별관 도착
14:05 경먀계 4과: 배당신청 접수 완료
14:10 상담(경매 2계)
		1. 현아트빌 404호 감정가액: 3억 50만원
		2. 롯데카드 청구금액: 10,883,466원
		3. 세금 체납액, 경매 비용 문의: 알 수 없음
		4. 경매 개시일: 미정(4~5월 예상) ==> 경매에 참여할 것
14:16 종료
14:50 헌혈의집 강남센터 방문
15:10 문진표 작성(ABO Friends 가입, 지문 등록)
15:15 헌혈(전혈): 음료수(포카리스웨트), 롯데 제크 크래커 100g, 편의점 상품권 2장(만원) 받음 ==> 총 헌혈횟수 9회
		 대한적십자사 혈액관리 본부 ==> https://www.bloodinfo.net/main.do
15:25 종료
15:40 헌혈의집 출발(도보)
16:20 다이소 선릉점 방문 ==> 리빙 메쉬 바구니 6호(베이지, 브라운) (천원), 3련 후크(접착식 스티커 걸이) (천원), 원터치 케이스 치실100p(대) 
		(2천원) 구입
15:40 헌혈의집 출발(도보)
16:40 DB금융센터 방문
17:15 면접(DB금융센터 지하 1층 회의실, 아데나소프트(주) 김일호(이사, 010-5440-3846))
17:50 종료
17:55 선릉역 --> 신림역
18:37 귀가
18:40 석식
19:20 실내 도보
19:40 종료 
23:00 취침
==============================================================================================================
 
- DB손보 면접(17:30, 동부금융센터)
일시: 21.12.29(수) pm 5시30분
장소: 포스코 동부금융센터 1층 로비
연락: 아데나소프트(주) 김일호(이사, 010-5440-3846)
 --------------------------------------------------------------------------------------------------------
고객: DB손해보험
플젝: TM모바일 전자청약시스템
기간: 22.01~22.04(4개월)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.12.30(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> LG U+ Prj SM 인수인계(14시, 상암 사옥): 노동연 이사, 김춘미 과장: 큰 문제 없이 끝냄
 
- LG U+ 게시판 기능 개선 Prj[★] 
- SM 인수인계 ==> 완료[♥♡]
1. 산출물 담당자에게 이메일로 보내기
 1) 사용자 지침서 작성 ==> NTOSS(AS게시판 기능개선)-REV-05(사용자지침서)_V1.0.ppt
 2) 운영 반영내역 작성 ==> NTOSS(AS게시판 기능개선)-REV-99(운영 반영내역)_V1.0.ppt
 3) 단위테스트 케이스 작성 ==> NTOSS(AS게시판 기능개선)-DVT-01(단위테스트케이스)_V1.0.ppt
==============================================================================================================
 
- WebSquar WRM Prj 경로 변경
1. C 드라이브에 있는 WRM 을 D 드라이브로 변경할 때 수정 사항
D:\WEBSQUARE_DEV_PACK\maria_db.bat
D:\WEBSQUARE_DEV_PACK\maven\settings.xml
D:\WEBSQUARE_DEV_PACK\bin\eclipse-jee-2020-03-win32-x86_64\eclipse.ini

Tomcat  Runtime Environment Apache Tomcat 경로 확인
VM arguments 에 -DWEBSQUARE_HOME 경로 확인
==============================================================================================================

- eclipse 시작 에러
1. 현상: 
심각: Error configuring application listener of class [websquare.http.controller.JavascriptInitializer]
java.lang.ClassNotFoundException: websquare.http.controller.JavascriptInitializer
2. 원인: maven > update project해주면 종종 날라감
3. 조치: 
 1) 프로젝트 > properties > Deployment Assembly 에서 Add를 눌러 Java Build Path Entries > Maven Dependencies 선택 후, Apply 
  2) tomcat Restart
  3) WRM 시작
   가. 01. WRM_N  ==> http://127.0.0.1:9090/
----------------------------------------------------------------------------------------------------------------------------------------

- /web.xml 파일에서
<!-- WAS를 구동하면서 웹스퀘어 엔진을 로딩하기 위해서 JavascriptInitializer를 listener에 등록 -->	 
<listener>
	<listener-class>websquare.http.controller.JavascriptInitializer</listener-class>
</listener>
==============================================================================================================

- 이클립스를 통한 라이브러리 추가
출처: https://lee-mandu.tistory.com/289?category=633568 [개발/일상_Mr.lee 
1. JRE System Library 경로 확인
1) 프로젝트: 우클릭 >  Properties: 클릭 > Properties(새창)
Java Build Path > Libraries(Tab): JRE System Library 설치된 경로 확인
==> resources.jar - C:\WEBSQUARE_DEV_PACK\bin\jdk1.8.0_241\jre\lib\
--> resources.jar - D:\91_Git_TAMA\WRM\bin\jdk1.8.0_241\jre\lib\로 경로 변경해야 함 ■■■ 

2. JRE System Library 경로 변경
1) Libraries(Tab) --> Add Library: 클릭 > Add Library(새창)
--> JRE System Library: 클릭 --> Alternate JRE: 선택 --> Installed JREs: 클릭
> Preferences(새창)
Java --> Installed JREs
Name					Location(JRE home)
jdk1.8.0_241			C:\WEBSQUARE_DEV_PACK\bin\jdk1.8.0_241   --> 확인 ■
jdk1.8.0_241			D:\91_Git_TAMA\WRM\bin\jdk1.8.0_241   			--> 경로 변경 ■

3. Maven Dependescies 경로 변경(이클립스 maven repository 사용자 경로 설정)
1) Libraries(Tab) --> Add Library: 클릭 > Add Library(새창)
--> Maven Managed Dependescies: 클릭 --> User Maven Project settings: 클릭
--> Maven > Active Maven Profiles: : Applly and Close
2)  [Window] - [Preferences] - [Maven] - [User Settings] 
가. Global Settings --> D:\91_Git_TAMA\WRM\maven\settings.xml
나. User Settings --> D:\91_Git_TAMA\WRM\maven\settings.xml
다. Local Repository --> D:\91_Git_TAMA\WRM\maven\settings.xml 
------------------------------------------------------------------------------------------------------------

- /settings.xml 파일에서
<localRepository>D:/91_Git_TAMA/WRM/maven/repository</localRepository>      
<!--// local Repository 수정[2021.12.30, by 진태만] //-->
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.12.31(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 16:30 ==> 한파(영하 9도), LG U+ 게시판 기능 개선 Prj 철수(16시), 가계부 월말 결산(22시, 집) 
 
- LG U+ 게시판 기능 개선 Prj[★]
- LG U+ 게시판 기능 개선 Prj 철수 전 사전 작업
1. 아이디 삭제 신청: tamario ==> 완료[♥♡] 
2. Uplus PM 프로그램 실행 후 사진 캡처해서 노동연 이사에게 보낼 것 ==> 완료[♥♡] 
  1) PC 내 개인정보 보유 파일 관리(영구삭제) ==> 14시 54분에 완료
3. LG U+ 출입증 반납(16시: 지하 1층 업무지원센터에 방문하여 출입증 반납할 것) ==> 완료[♥♡] 
==============================================================================================================

- 스프링 프레임워크 강의 1강 - Spring 소개와 학습 안내[뉴렉처]
https://www.youtube.com/watch?v=XtXHIDnzS9c&list=PLq8wAnVUcTFUHYMzoV2RoFoY2HDTKru3T
1. MVC: DI(Dependecyt Injection: 종속 객체를 생성 조립해주는 도구)
2. 로그 처리, 보안 처리, 트랜잭션 처리: AOP(Aspect Oriented Programming)
3. 보안: Servlet Filter
----------------------------------------------------------------------------------------------------------------------------------------

IoC(Inversion Of Control) 컨테이너
스프링 IoC 컨테이너 사용하기(ApplicationContext 이용하기)
스프링 프레임워크 강의 11강 - 콜렉션 생성과 목록 DI
스프링 프레임워크 강의 12강 - 어노테이션을 이용할 때의 장점과 @Autowired를 이용한 DI 해보기
스프링 프레임워크 강의 13강 - @Autowired의 동작방식 이해와 @Qualifier 사용하기
스프링 프레임워크 강의 16강 - 특화된 @Component 어노테이션 (@Controller/@Service/@Repository)
스프링 프레임워크 강의 17강 - XML Configuration을 Java Configuration으로 변경하기

스프링 프레임워크 Part2 AOP 강좌 01강 - AOP(Aspect Oriented Programming) 이란?
1. Proxy 호출
스프링 프레임워크 Part2 AOP 강좌 05강 - BeforeAdvice 구현하기
스프링 프레임워크 Part2 AOP 강좌 06강 - After Returning / Throwing 어드바이스 구현하기

스프링 프레임워크 Part2 AOP 강좌 07강 - Point Cut(Weaving, Join Point)
1. weaving(뜨개질)
2. Point Cut
스프링 프레임워크 Part2 AOP 강좌 08강 - 간소화된 Advisor

Spring MVC (스프링 웹 MVC) 강의 01 - Spring MVC란
1. Dispather

Spring MVC (스프링 웹 MVC) 강의 03 - 메이븐을 이용한 기본 웹 프로젝트 생성하기
Spring MVC (스프링 웹 MVC) 강의 05 - dispatcher-servlet.xml 파일
Spring MVC (스프링 웹 MVC) 강의 06 - 스프링 컨트롤러 IndexController 작성하기
==============================================================================================================  
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

.
