

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.03) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.03.01(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 삼일절(공휴일)

- 주말2[★]
07:00 기상
07:10 조식
08:00 도보(흐림): 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
09:20 종료
09:30 엄마 갈평 토지 제산세 고지서 사진찍어서 성철이 외삼촌에게 보냄(외삼촌이 명의 이전 한다고 함)
12:50 중식 
13:30 도보(비 조금씩 옴): 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
14:00 종료
16:40 석식
17:20 포항집 출발(비 많이 옴) ==> 케리어(쌀 10kg, 반찬) ==> 짐 엄청 무거움
17:30 두호동 주민센터 도착(209번 버스 승차)
17:50 고속버스 터미널 하차
18:20 서울행 승차
22:20 서울 강남터미널 도착(비 조금 옴): 삼성 갤럭시 노트9 분실할 뻔 함(절대 주의)
22:40 서울 강남터미널 정류장 도착(643번 버스 승차)
23:20 남부초교 정류장 하차
22:30 귀가
23:30 청소
03:00 취침
==================================================================================================================      

■■■■■■■■■■■■■■■■■■ 2021.03.02(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  박찬형 대리, 지성희 과장, 이한신 과장, 백종오 대리, 이현숙 과장(퍼블리셔) 투입(9시) 
									, 미래에셋 증권 센터원 지점 방문(12시, 명동역 근처, IRP 상담)

- 하나 손해보험 Prj[★]
- 실시간 접수현황(/FNGCLRK0102.xfdl) 분석[보상 ==> 사고접수]
1. 조회 처리
------------------------------------------------------------------------------------------------------------------------------------

- 조회 에러
1. 현상: Cannot read property '_@Param' of undefined [Fatal Error] -1-1: Premature end of file, 		==> 미성숙한 파일의 끝 
org.xml,sax.SAXParseException: Premature end of file.
at org.apache.xerces.parsers.DOMParser.parse(Unknown Source)
at org.apache.xerces.jaxp.DocumentBuilderlmpl.parse(Unknown Source)
2. 원인: 서버가 재설치 안되어서 나는 현상
==================================================================================================================

- 노트북 거치대 구입
1. [B780945279] 애니키 애니키 F8 접이식노트북거치대 노트북받침대 가격: 15,780원
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=B780945279&frm3=V2
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.03(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  IRP 계좌 재개설(tamario3, 20** 오*h@), 펀드 투자 상담(미래에셋 증권 신태완 매니저, 09:40)
									, 주간보고 작성(9시, 8주차 - 20210305), 애니키 F8 노트북 거치대(새로 구입) 도착(13시, 만족)

- 하나손해보험 Prj[★]
- 실시간 접수현황(/FNGCLRK0102.xfdl) 분석[보상 ==> 사고접수]
1. Onload, 조회 처리
==================================================================================================================
  
- 진수종 개학(2학년 2반에 편성됨)
01. 아동기초 조사표 노트북에서 작성 ==> 큰누나한테 대필 요청
==================================================================================================================
  
- 수종 담임에게 문자 보내기
1. 윤정숙(수종 당임, 동부초 2-2): 010-9606-2288
2. 수종이 준비물 챙기기 ==> 큰누나가 포항집에서 도와줌 
==================================================================================================================
 
- 퇴직 연금(IRP: Individual Retirement Pension) 가입(12시, 미래에셋 증권)
1. 납입한도: 연 1,800만원까지 입금 가능(나는 1,620만원까지 납입 가능
2. 세액 공제 한도: 연 700만원
3. 세액 공제율: 연소득 5천 5백만원 이하 --> 공제율: 16.5%
 가. 최대 공제금액: 700만*16.5% = 115.5만원
4. 연금수령조건: 만 55세 이상, 가입기간 5년 이상, 연금으로 10년 이상 수령
5. 연금수령시 세금: 5~60대: 5.5%, 70대: 4.4%, 80대: 3.3%
6. 연금외 수령 시 세금: 기타 소득세 16.5%, 세액공제 받지 않은 금액 비과세
7. 상품운용: 여러 금융 상품 교차
8. 상품제한: 주식형 자산 등에 70%까지만 가능
9. 담보대출: 불가능 
10. IRP 개설 후 수수료(자산관리, 운용관리) 면제: 미래에셋대우, NH투자증권, 한국투자증권, 삼성증권
==================================================================================================================

- [상품지식] IRP[퇴직 연금]가 노후준비용으로 최강인 이유 (vs.연금저축펀드) [박곰희TV]
==> https://youtu.be/xqXD9R_3TOI 

- 개인IRP/퇴직연금 안전자산30% 고민되시죠? TDF펀드 대신 저는 이렇게 채웠습니다.
https://youtu.be/BhYkHI2co3E 

- [투자스터디] 퇴직연금(IRP)에 안전자산으로 넣을 채권 ETF는? | IRP 안전자산 채권 ETF 소개
https://youtu.be/ZDIaYuFkMeY
==================================================================================================================

- IRP/퇴직연금 안전자산 30%
1. KODEX 단기채권, KODEX 단기채권 PLUS 
2. KODEX TRF3070
3. KOSEF 국내10년
-------------------------------------------------------------------------------------------------------------

- 퇴직연금 IRP ETF투자 꼭 알아야할 10개 종목 ==> 퇴직연금 DC ETF | KODEX | IRP계좌 ETF | ETF |
https://youtu.be/F1u1kKpImFY
1. KODEX KTOP30: 한국거래소의 KTOP 30지수를 추종(한국 경제를 대표하는 30개 종목에 투자)
2. TIGER TOP10: 에프앤가이드가 발표하는 "FnGuide TOP10 지수" 추종
3. KODEX 미국FANG 플러스(H) 미국 차세대 기술 관련 기업 10개 종목에 집중 투자(미국의 대표 기술주인 페이스북, 아마존, 넷플릿, 구글 등)
4. KODEX 미국 S&P 고배당 커버드콜(합성H): 분기마다 분배금 지급
5. KODEX MSCI Korea TR
6. KODEX 200 TR
7. KBSTAR 대형 고배당 10TR
==================================================================================================================

- IBK 기업은행 퇴직연금 예금에서 펀드로 변경
1. i-ONE 로보가 만들어 준 포트폴리오 대로 펀드 투자 함 
==================================================================================================================

- 2년치 퇴직연금 압금 요청 메일 보냄
1. 김유진 대리에게 직접 메일로 보냅 
==================================================================================================================

- 현아트빌 404호 관리비 자동이체 설정
1. 반장(김진아 현아트빌 202호) 신한은행: 110-504-967679, 예금주: 김진아
1. 이체할 계좌: 10-504-967679(신한은행), 예금주: 김진아, 이체금액: 4만원원, 이체일자: 25일
 1) 기간: 2021.03.25 ~ 2023.01.25
================================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2021.03.04(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> NH투자증권 IRP 계좌 고민(14시, 콜센터 전화) 

- 하나손해보험 Prj[★]
- 카드BIN관리(/FNGFAIC0010.xfdl) 분석[입출금 ==> 카드]  	==> 완료[♥♡] 
==================================================================================================================

- 사고사전등록조회(/FNGCLRA0202.xml) 분석[보상 ==> 사고접수 ==> 사고사전등록]
==================================================================================================================
 
- 카메라 셔터음 무음 만들기 초간단 갤럭시s20, 갤노트10[누나IT]
https://youtu.be/yYeynzQWyck ==> CatMera 어플
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.05(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
- 사고사전등록조회(/FNGCLRA0202.xml) 분석[보상 ==> 사고접수 ==> 사고사전등록]
1. Bind 처리
/**
* 초기 스크립트 수행 함수 정의
*/
scwin.onpageload = function { 
	gcm.log("[/FNGCLRK0102.xml] [onpageload()] ==> [TEST_01] [실시간 접수현황 화면 초기화(his)..@@@]");

	ds_rlhrRctPsstInfBcVo,setRowPosition(0); 		// Grid에서 선택할 행의 위치 설정[datalMap이 아닌 dataList를 조회 값으로 사용]
};
----------------------------------------------------------------------------------------------------------------------------

<Bind>
	<Binditem id="item4" compId="callnqStDt" propid="value" datasetid="ds_rheRctPsstinfBcVo" columnId="inqStDt"/>
</Bind>
==>
<w2:inputCalendar footerDiv="false" rightAlign="false" focusOnDate Select="false" displayFormat=""
	readOnly="" style="" id="callngStDt" renderType="component" class="wd-100 reg" renderDiv="true" mandatory="true" 
	calendarValue Type="yearMonthDate" ref="data:ds_rlhrRctPsstInfBcVo.inqstDt"> 	<!--// ref 변경 //--> 
</w2:inputCalendar)
==================================================================================================================

- async, await 사용[async 안에 Promise가 포함되어 있음]
/**
* <p>저장 이벤트 </p>
"/
scwin.fnCardBin = async function() { 		// async ■
	// 정합성 체크 
	if(false == await scwin.fnValidate("save")) { 		// await ■
	return false;
};
----------------------------------------------------------------------------------------------------------------------------

/**
* <p>정합성 체크 </p> 
"/
scwin.fnValidate = async function(chkld)  		// async ■
 { 
	if (chkld == "search") { 		// 조회 검증 
		if(typeof crdBin.getValue() != 'undefined' && crdBin.getValue() !="" && crdBin.getValue().length < 2) { 
			await $xplib.cf_Alert("FA10158"); 		// await ■	==> // "카드BIN번호를 2자리 이상 입력하세요"		
			crdBin focus(); 
			return false; 			
		} 
		else if(chkld == "save") 		// 저장 검증
		{
			if ($xplib.cf_IsModifyDs(ds_grd_crdBinDtlInfBcVo) == false) { 
				await $xplib.cf_Alert("FA10118"); 	// await ■	==> 	// 변경된 사항이 없습니다. 
				return false; 
			}
		}
	} 
	return true;
}; 
==================================================================================================================

- 개인 네트워크 정보[아이피 주소] (옮긴 9층 자리)
1. IP 주소: 10.1.39.117						2. GW(D): 10.1.39.254					3. SM(U): 255, 255,255.0
4. 기본 DNS 서버(P): 10.1.1.11 			5. 보조 DNS 서버(A): 10.11.1.1
==> 제어판 네트워크 및 인터넷 네트워크 연결
==================================================================================================================  
  
- 프린터 설정(옮긴 9층 자리)
1. 01. IR-ADV C5535
2. 위치(L): http://10,1.39.240:80/wsd/mex ==> 프린터3(10.1.39.240)
3. 프린터 정보: Canon
4. 모델: Microsoft OpenXPS Class Driver 2
==================================================================================================================  

- 각종 계약서, 서류 , 오래된 사진을 어도비 스캔으로 스마트폰에 스캔(How to Use Adobe Scan)
https://youtu.be/4x3O7E66ejc
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.06(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 	

- 주말[★]
05:00 기상
05:40 조식
06:15 집출발
06:28 신대방역 --> 대림역 --> 군자역
07:20 군자역 2번 출구 도착
07:30 희망내과 도착(예약 리스트에 이름 작성: 3번째)
07:40 도보
08:30 종료
08:45 희망내과 오픈
08:50 혈당 검사: 140(식후 3시간 후 검사)  
09:10 진료(송필훈 원장): 저녁 혈당이 높다고 저녁에도 약먹자고 함, 나는 아침 약도 끊자고 주장 ==> 다음달 당화혈색소 결과 보고 판단
		 하기로 함
09:20 조제(당뇨약: 한 달분, 푸른약국)
09:25 종료
09:45 군자역 --> 아차산역 2번 출구 도착
09:50 어린이대공원 후문 --> 어린이대공원 구경
10:12 태용 만남(아차산역 2번 출구)
10:15 아차산 산행
11:00 아차산 1보류 ==>  아차산 5보류 ==>  아차산 2보류 ==>  아차산 ==>  아차산(205.7m) 
12:30 긴고랑 계곡(하산): 태용이가 다리 근육에 문제가 생겨서 하산[태용이가 너무 늦게 걸음: 마지막 산행] ==> 긴고랑 관리사무소
12:40 광진02 마을버스 승차 ==> 군자역
13:00 군자역 ==> 신대방역
14:20 중식(왕대패 삼겹살, 삼겹살, 냉면): 태용[내가 쏨, 31,000원] ==> 맛 있었음
14:40 종료
14:45 도보 ==> 보라매공원에서 트랙 도보(차음)
16:00 귀가
15:30 인터넷 서핑 
19:11 석식(라면 1개 + 베트남 라면) 
19:30 실내 도보
20:30 종료
20:40 인터넷 서핑
21:00 루옌에게 돌봄교실 제출 서류 요청 카톡 보냄 ==> 루옌이 현재 실직 상태이고 아르바트로 생활하고 있다고 함(재직증명서 제출 불가)
	 ==> 다음날 아침 수종 동부초 2학년 2반 담임선생에게 현재 상황 카톡으로 보냄
23:00 취침
==================================================================================================================

 - 태용 추천하는 주식
1. 셀트리온, 현대차, LG전자, SK 이노베이션 

- 셀트리온 정보
https://youtu.be/BIovR-7REwM 
https://youtu.be/ZcUjrCfsYZY 
1. 셀트리온은 항체 의약품을 만드는 생명공학 기업(바이오 제약 회사)
==================================================================================================================
 
- 계좌개설&이벤트] 증권사별 계좌개설 혜택비교 (at.2021년2월) [박곰희TV]
https://youtu.be/XQ6Gw-O6xMs
------------------------------------------------------------------------------------------------------

 - 각 증권사 별 수수료[유관기관 수수료율](2020년 12월 기준)
1. 미래에세대우: 0.0036%
2. 키움증권[국내 주식 수수료 높은 편]: 0.0036% ==> 삼성증권, 한국투자증권, 대신증권  
3. NH투자증권: 0.0043% ==> SK증권
4. 한화투자증권: 0.0045%
----------------------------------------------------------------

- 주식 거래시 발생하는 수수료 3가지
1. 위탁거래 수수료(HTS, MTS): 주식을 매수하고 매도할 때 내는 수수료
2. 유관기관 수수료: 예탁결제원, 한국거래소, 증권협회에 수수료
3. 거래세: 매도 시 내는 수수로(0.25%)
==> 증권사 매매 수수료: 위탁거래 수수료 + 유관기관 수수료
==================================================================================================================

- [주식] 주식 매수 절차는 3개만 알면됩니다 (ft.주식/ETF 매수방법)
https://youtu.be/6RnM1qM0o6Q
==================================================================================================================

- 박현주 회장의 노후준비 조언[미래에셋?_박현주 회장]
https://youtu.be/hHr6OJATXms
1. 건강해야 투자를 잘한다.
==================================================================================================================

- 돌봄교실 제출 서류
1. 학부모 재직증명서(양쪽 부모 모두) 각 1부
2. 의료보험 납부확인서(양쪽 부모 모두) 각 1부
==> 모든 서류 위에 학생 이름을 적어주시기 바랍니다.
==> 서류 제출 기간: 2021.03.10(수)까지
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.07(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
07:00 기상
07:40 조식
08:00 실내 도보
09:00 종료
09:10 인터넷 서핑
12:10 중식(라면 1개 + 베트남 라면) 
13:30 집출발(반바지) 
13:30 도보 ==> 보라매공원에서 트랙 도보
14:30 귀가
14:00 인터넷 서핑
14:25 인터 전기 온풍기 판매(당근 마켓 어플에서, 5천원): 구입자 직접와서 사감
18:00 큰누나 한테 전화 옴 ==> 포항에서 강아지(푸들) 분양 알아 봤는데 100만원이 넘는다고 함(너무 비싸서 포기하라고 함)
19:00 석식
19:30 실내 도보
20:30 종료   
20:30 TV시청(코미디 빅리그)
21:10 인터넷 서핑
22:30 청소
22:40 샤워
23:00 취침
==================================================================================================================

- 유만덕에게 100만원 송금(09:25, 집)
1. 우체국, 101824-02-332343, 예금주: 이금연 ==> 만주 고모 부탁(엄마 통장으로 받을 것)
==================================================================================================================

- [견종정보] 10분만에 알아보는 '무조건 알아야하는 푸들 성격과 특징' 7가지 비밀
https://youtu.be/LCyWy6M-hJE

- 강아지 키우는데 필요한 초기비용, 고정비용, 추가비용 (처음 키울때 비용 / 한달 비용)
https://youtu.be/K0CLi9m0ebA
==================================================================================================================

- 강냉이 주문
- 보아스몰 포대간식 강냉이 대용량 2kg 이상~5kg 튀밥 선택 : 03_미가람 맛강냉이 5kg (+4,600원), 가격: 19,990원 
http://www.enuri.com/detail.jsp?similar=Y&modelno=17021066
http://item.gmarket.co.kr/detailview/item.asp?goodscode=731236368
==============================================================================================================
 
- 35형 커브드 모니터 구입
1. [주문번호 : 3462184048] KXG UNDERDOG QX352RC REAL 200 HOT, 가격: 387,000원
 1) 모니터|89cm(35인치)|커브드(1800R)|해상도:2560x1080(WFHD)|21대9|AMVA3패널(광시야각)|눈부심방지|LED백라이트|픽셀피치:
0.32025mm|밝기:250cd|명암비 2000:1|동적명암비 50만:1|주사율:200Hz|응답속도:4ms|sRGB(115%)|시력보호:로우블루라이트,
플리커프리|게임특화:게임모드,게이밍핫키,조준선표시,FreeSync|단자:DVI,HDMI,DisplayPort|스탠드:틸트(상하)|
VESA홀:100x100|소비전력:53W  ==> 입출력 단자: DL-DVI, HDMI(2.0), DP(1.2), HEADSET
http://www.enuri.com/detail.jsp?modelno=27279398
https://www.g9.co.kr/Display/VIP/Index/1776713216 
- 입출력 단자 케이블 교체[2021.06.27(일)]
1. 기존 HDMI 케이블 제거하고 35형 커브드 모니터 구입할 때 받은 DP 케이블 연결
==================================================================================================================

- 재택근무 하실 때 이런 모니터 하나 있음 좋아요! (LG 35WN65C 리뷰), 가격: 499,000원[2021.01.10(일)], 카드가: 758,500원[2021.03.05(금)]
https://youtu.be/Y8V2z1QhU9s
http://prod.danawa.com/info/?pcode=12098972&keyword=35%EC%9D%B8%EC%B9%98%20%EB%AA%A8%EB%8B%88%ED%84%B0&cate=112757
==================================================================================================================

- 청구의 신
http://cheong9shin.com/faq.html
1. 서류가 필요없는 초간편 보험청구(실손보험)
==================================================================================================================

- 전기세, 수도세 확인 
1. 전기세(한전): T): 02-123  ==> https://cyber.kepco.co.kr/ckepco/front/jsp/CY/E/C/CYECHP002.jsp
2. 수도세(아리수): T): 02-1230 ==> https://i121.seoul.go.kr/cs/cyber/front/cgcalc/NR_cgJungInfo.do?_m=m1_1
==================================================================================================================

- 아이핀 인증 비밀번호 변경(i-pin)[2021.03.07(일)]
1. 발급기관: 나이스 아이핀 ==> http://www.niceipin.co.kr/index.ni ==> tamario / 2020오*h@
1) 2차 비밀번호: Master key: u, 패턴: U
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.08(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> GS25 편의점 커피(08:50. 김용운 차장: 보상 파트), 김선중 대리 투입(9시, 입출금 파트)
								, 프로젝트 설명(14:30, 김운용 차장, 김선중 대리), 퇴직연금(IRP) 매수(700만원, 22:20, 집)

- 하나손해보험 Prj[★]
- 실시간 접수현황(/FNGCLRK0102.xml) 분석[보상 ==> 사고접수]  	==> 완료[♥♡] 
==================================================================================================================

- 개발자 회의(16시, 중회의실1) 
1. 개발 일정 산출 
 1) 단위 테스트, 통합 테스트 고민(구종식 부장)
 ==> Z: \7000.개인별 작업공간\구종식\프로그램 목록_전체현황 20210308_0900.xlsm
 ==> 2. 개발 산출물 작성 
 ==> V:\메리츠_차세대산출물\C300. 보상손사팀\C320. CLG_손사\C. 구축\01.화면설계서\
	MEF-CLG-C-01(화면설계서-UC_CL010201.사고접수)-V.1.0.xls
==================================================================================================================

- 퇴직연금 지연 지불 문제 선희 누나에게 문의 전화(20:30, 집) 
1. 퇴사 후 14일 이내 퇴직 연금(DC형)을 지연하면 10% 가산금을 업주가 지불해야 함: 형사 처벌 대상
2. 퇴사 후 14일 이후 퇴직 연금(DC형)을 지연하면 20% 가산금을 업주가 지불해야 함: 형사 처벌 대상): 민사 처벌 대상
==================================================================================================================

- 전기세, 수도세 확인
1. 전기세(한전): T): 02-123
2. 수도세(아리수): T): 02-1230?
==> 3월 15일(월)쯤에 고지서 나온다고 함
==================================================================================================================

- 퇴직연금(IRP) 투자(22시, 집, 어플에서) [2021.03.08(월)]
01. 미래에셋연금 이디아 이프라증권투자신탁1호(주식)C-P2e: 200만원 매수 
02. 미래에셋G2 이노베이터 증권자 투자신탁(주식)C-P2e: 200만원 매수
03. 한국투자TDF알아서 2030 증권투자신탁(주식혼합-재간접형)종류C-Re: 300만원 매수
==> 매도 결제일: 2021.03.08(월), 매수 결제일: 2021.03.11(수) 
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.09(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 구부장 면담(08:50, 퇴직연금(DC형) 설명, 회사에 퇴직금 납입 요청), 저축은행 예금 해약(22시, 집)

- 하나손해보험 Prj[★]
- 자동차사고조사(/FNGCLAKO100.xml[보상 ==> 사고조사]
==================================================================================================================

- 개발자 공통 교육(09:30, 대회의실)
1. 3번째 교육
==================================================================================================================

- 오케스트라 진척 관리 교육(10:30, 대회의실)
1. UI전환 개발 요구 계획할 수립[응용] 3/8(월) ~ 3/10(수) 18:00
2. 응용 계획 수립 취합[품질관리] 3/11(목) 09:00
3. 계획일 수립[UI전환팀] 3/11(목) ~ 3/12(금) 17:00
4. 전환 계획일 업로드[이전환팀] 3/12(금) 17:00
==================================================================================================================

- SMART IDE 교육(14:10, 구부장 자리)
1. FTP:\보험 업무시스템 구축\5000.업무간공유작업\5100.설치필요SW\30.하나IDE 
2. 윈도우 ==> \5000.업무간공유작업\5100.설치필요SW\30.하나IDE 
3. ui에서 사용 시, ini 파일에 메모리 설정(256m~1g) 조절 ==> m1420357 / hanafire!2 
==================================================================================================================

- 더케이저축은행 정기예금  중도 해지
1. 예금명: e-정기예금(복리) ==> 계좌번호: 021-61-24-0417361
2. 가입일자: 2021년 01월 06일
3. 만기일자: 2024년 01월 06일  ==> 중고 해지일자: 2021.03.09(화)
4. 가입기간: 36개월 
5. 이율: 2.20%(복리 : 2.27%)
6. 예치금액: 40,000,000원  ==> 해지 환급금: 40,065,149원
7. 출금계좌번호: 021-61-13-0021880
8. 기타: 인터넷으로 가입 ==> https://thek.ibs.fsb.or.kr/main.act
==================================================================================================================

- OSB 예금 중도 해지
1. 예금명: 복리정기예금 ==> 계좌번호: 00321-24-0821479
2. 가입일자: 2020년 10월 14일
3. 만기일자: 2021년 10월 14일 ==> 중고 해지일자: 2021.03.09(화)
4. 가입기간: 12개월 
5. 이율: 2.000 %
6. 예치금액: 40,040,299원 ==> 해지 환급금: 40,201,718원
7. 출금계좌번호: 00311-13-0065099
8. 기타: 종로지점에서 가입 ==> https://ibs.osb.co.kr/ib20/mnu/BNK00035
 1) 12개월 후 자동이체 계좌(사용 안함: 인터넷으로 설정할 것) ==> 신한은행: 110-437-783130
 2) 12개월 후 자동으로 재가입 설정(3번 사용 가능)
==================================================================================================================

- 매래에셋대우 계좌 개설(ID: tamario) [2021.03.09(화)]
1. 주식 계좌번호: 010-307208987
2. CMA 계좌번호: 계좌번호-307208988
==> 펀드 ID: tamario2 펀드 계좌번호: 010-307208981
tamario:  010-30-7208987[종합]
tamario:  010-30-307208988[종합_CMA]
tamario2:  052-99-007971[종합]
tamario3:  0010-30-7208980[퇴직연금]
==================================================================================================================

- 증권(개인) 공동인증서 발급(무료)
1. 유효기간: 2021년 03월 09일 ~ 2022년 03월 09일
2., 비밀번호: 20**오*s*@
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.10(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주간보고 작성 (9시, 9주차 - 20210310), GS25 편의점 커피(10:20, 윤민지[72년생] 차장: 키작고 못 생김)
								, 주식 투자 시작(13시, SK 이노베이션 90주 첫 매수, 현대차 88주 매수, 셀트리온 138주 매수
								--> 총 금액 8천 만원 상당 사용[미래에셋대우 어플에서], 사업장)

- 하나손해보험 Prj[★]
- 실시간 접수현황(/FNGCLRK0102.xfdl) 분석[보상 ==> 사고접수]
1. 조회 처리
==================================================================================================================
 
- expression 전환 
<cell col="1" style="align:center;" text="expr:getSum(&quot;persCnt&quot;)"/> 
==> inputType="expression" expression="sum('persCnt')">
==================================================================================================================
 
- 77. APICWS)
file:///C:/WS5_HANA/DOC/API/html/index.html.

- 78. 도움말(WS) 
127.0.0.1:64920/help/index.jsp?topic=%2Fcom.inswave, websquare help%2Fhtrnl%2Fwebsquare%2Fguide %2FSP4%2520User%2520Guide
==================================================================================================================

- 주식 매수(12:20, 사업장) [ 2021.03.10(수)]
1. SK이노베이션     20,565,000원   228,500원     90주 
2. 현대차     			20,196,000원     229,500원     88주 
3. 셀트리온     		39,330,000원     285,000원     138주 
4. LG전자     			20,000,000원     144,500원     138주 ==> 매수 안 함
==> 2031년 수종이가 대학갈 때 주식팔 것
==================================================================================================================
 
- 2017년 귀속 종합소득세 신고 자료 메일로 보냄
1. sunjoong91@nate.com. 김선중 대리에게 메일 보냄
==================================================================================================================

- [IT애정남] 노트북을 모니터에 연결했는데 소리가 안나요!
https://it.donga.com/27717
1. Windows 설정(윈도우 + i) (새창)
 ==> 시스템 ==> 소리 ==> 출력 장치 선택: 스피커(High Definition Audio Device)
==================================================================================================================

- 35형 커브드 모니터 도착 및 설치
1. DP 케이블 노트북에 설치 않됨 ==> HDMI 케이블로 연결: 21: 9 모니터 해상도 설정 안됨
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.11(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 변액보험 해지(12시, 미래에셋 생명 종로 사업본부: 지점 이전: 헛걸음)
									, 매수한 주식 3개 주가 총 200만원 정도 수입 발생 확인(22시, 일희일비 금지)
 
- 하나 손해보험 Prj[★
- 실시간 접수현황(/FNGCLRIK0102.xfdl) 분석[보상 ==> 사고접수]
1. 조회 처리.
==================================================================================================================

- 개발 진척 계획 회의(10시, 중회의실)
1. 개발 일정 수립 회의
==================================================================================================================

- 개발 진척 계획 수립 
1. 보상손사: 916본 
2. 프로그램 목록_전체현황_20210310_1800(주차별계획수립).,xlsm 파일에 담당자, 시작일, 종료일 기입
==================================================================================================================

- 보상손사 퍼블 요청 화면(번호별 우선 순위)
1. FNGCLRK0100.xml: 자동차사고접수 
2. FNGCLRK0100_08.xml: 교통사고조사 정보조회
3. FNGCLRK0100_11.xml: 과실약도
4. FNGCLCU0400.xml: 통합사고조회
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.12(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 포항행 짐싸기(20:30, 집), 변액보험2 해지(21시, 미래에셋 생명 홈페이지)

- 하나손해보험 Prj[★]
- 교통사고조사정보조회(/FNGCLAK0100_08.xfdl) 분석[손사 ==> 사고 접수 ==> 사고 접수] ==> 완료[♥♡]
1. 조회 처리
==================================================================================================================

- 과실 약도(/FNGCLAK0100_11.xfdl) 분석[손사 ==> 사고 접수 ==> 사고 접수] ==> 완료[♥♡]
1. 조회 처리
==================================================================================================================

- 피해자조사 및 추산입력(/FNGCLDKO100.xml) [보상 ==> 대민 손해 조사] ==> 완료[♥♡]
1. 조회, 저장 처리 
 1) 업무 절차: 1. 접수 ==> 2. 조사 ==> 3. 추산 ==> 4. 치료비 ==> 5. 합의금 ==> 6. 비용 ==> 7. 결정 ==> 8. 종결 ==> 9. 면책	==> 10. SIU 
 ==> 11. 구상 ==> 12. 소송
==================================================================================================================

- 예상판결 - 지급기준(/FNGCLDK0210.xml) [보상 ==> 대인손해조사] ==> 메뉴 못 찾음 @@@
1. 조회, 저장 처리
==================================================================================================================

- 피해자과정관리(/FNGCLDK0300.xml) [보상 ==> 대인손해조사] ==> 완료[♥♡]
1. 조회, 저장 처리, Tab 3개
==================================================================================================================

- 치료비심사(/FNGCLUK0100.xml) [보상 ==> 치료비심사]
]. 조회, 저장 처리
==================================================================================================================

- 퍼블 요청 
1. 시작일자를 기입
Z:\7000.개민별\작업공간\구종식\001.퍼블1차일정\퍼블1차밀정_1.0.xlsx
==================================================================================================================

- 티머니 페이
https://pay.tmoney.co.kr, tamario@naver.com, 20**오*h@
1. 현대카드에서 5만원 적립함: 고속버스 예매할 때 사용할 것
==================================================================================================================

- 한전(전기세)
https://cyber.kepco.co.kr, tamario, 20**오*h@
1. 고객번호: 01 5276 7609(0152767609)
2. 2021년 3월 전기요금(12,670원) ==> 납기일: 2021.03.25
3. 현대카드에서 정기결제 신청 ==> https://www.hyundaicard.com/cpa/pc/CPAPC0101_44.hc
==================================================================================================================

- 변액 보험 해지 신청
90. (무) 드림링크 변액유니버셜보험 II(종신보험, 매형, 진태만) ==> 신청 완료[♥♡]
1. 기납입금액(원): 38,700,000원, 실납입금액(원): 38,700,000원, 기인출액(원): 26,520,000, 환급률(인출제외)(%): 31.31, 환급률(인출포함)(%): 99.83
지급금액(원): 12,117,992원, 공제금액(원): 0원, 지급예정일: 2021.03.17, 실지급금액: 12,117,992원(세후 금액: 비과세) 
--------------------------------------------------------------------------------------------------------------------------------

91. (무) 프리미어 변액유니버셜보험 Ⅲ(저축형) ==> 신청 보류
==> 실지급금액: 13,863,890원(세후 금액) 
총납입 보험료: 45,000,000원, 기인출액: 32,180,000, 공제금액: 190,010원
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.13(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
05:00 기상
05:12 조식
05:40 집출발: 여행용 케리어(1인용 매트, 커피), 백팩(그릇, 컵) ==> 짐 엄청 무거움
05:50 남서울중학교 정류장 도착
06:00 643번 버스 승차
06:30 서울 강남터미널 하차
07:20 포항행 고속버스 승차
11:10 포항 고속버스 터미널 도착
11:20 고속버스 터미널 정류장(209번 버스 승차)
11:50 두호동 주민센터 하차
12:00 포항집 도착 
12:10 중식 
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가
14:00 종료
14:10 TV 시청 
17:00 석식
17:20 집출발(수종)
17:50 홍승표집 --> 과수원(작은 아버지 차): 안 보고 옴
18:20 꾀꼬리 미용실(큰누나): 수종 이발, 노트북 점검(크롬 설치해줌)
19:00 종료
19:20 귀가(큰누나 차)
20:00 TV 시청 
22:50 취침
==================================================================================================================    
 
■■■■■■■■■■■■■■■■■■ 2021.03.14(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 16:30 ==> 

- 주말2[★]
07:00 기상
07:10 조식
07:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가
09:00 종료
10:40 큰누나, 매형 방문 
11:00 집출발(수종, 매형): 큰누나 차
11:30 보경사
11:40 보경사 매표소(어른: 35,000원, 어린이: 2천원): 큰누나가 계산
11:50 보경사 --> 문수앞 --> 쌍생폭포 --> 관음폭포--> 연산폭포
         ==> 수종이가 잘 걷는다고 큰누나게 칭찬 많이 함(수종 등산 싫어 함)
12:50 연산폭포에 도착(하산)
13:10 수종 넘어져서 무릎 다침(다행히 크게 다치 않음: 내가 팔로 부축해서 내려옴) 
13:20 하산
13:45 부산식당(진주식당[유명]이 대기 너무 길어서 포기하고 옆집으로 감): 산채 돌솥밥(만원), 묵 ==> 큰누나가 쏨
14:20 종료
14:50 귀가
15:00 만주 고모 돈 문제 협의 ==> 천 만원 내명의 국민은행 통장으로 관리하기로 함, 천 6백 만원(엄마 돈)은 예금하기로 함
		  ==> 2월 27일(토)에 와서 만주 고모한테 남은 돈 천만원 있다고 이야기 하기로 함
15:50 큰누나, 매형 귀가
17:30 석식
18:05 출발: 여행용 케리어(국, 쌀, 반찬) ==> 짐 엄청 무거움, 체혈기 휴대 안함(석식 후 혈당 측정 못 함)
18:20 여행용 케리어 바뀌 뿌려짐: 짐이 무거운데 힘을 써서 뿌려진 것으로 추정(쌀, 국 가지고 오지 말 것)
18:55 고속버스 터미널 도착(바뀌 없어서 엄청 힘들었음)
19:10 포항 출발
22:57 서울 강남터미널 도착(비 조금 옴): 삼성 갤럭시 노트9 분실할 뻔 함(절대 주의)
23:20 서울 강남터미널 정류장 도착(643번 버스 승차)
23:50 남부초교 정류장 하차
23:57 귀가
24:30 청소, 샤워
03:00 취침
================================================================================================================== 
  
■■■■■■■■■■■■■■■■■■ 2021.03.15(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  정현정 차장, 김용운B 과장, 박수용 대리, 김용운 과장, 이현숙 과장(퍼블리셔) 투입(9시)
									, 만주 고모 통장 개설(12:30. 기존 나눔계 통장, 3천원[통장 변경 수수료]), 변액보험 해지(21시, 미래에셋 생명 홈페이지)

- 하나손해보험 Prj[★]
- 교통사고조사정보조회(/FNGCLAK0100_08.xml) (팝업) 개발[업무메뉴: 보상 == 사고조사 ==> 자동차사고조사 Main]
1. 조회 처리
================================================================================================================== 
  
- 과실 약도(/FNGCLAK0100_11.xml) (팝업) [업무메뉴: 보상 ==> 사고조사 ==> 자동차사고조사 Main] 
1. 조회 처리
================================================================================================================== 
  
- 신도표조회/(FNGCLAK0100_12.xml) (팝업) [업무메뉴: 보상 ==> 사고조사 ==> 자동차사고조사 Main] 
1. 조회 처리
================================================================================================================== 
  
- 사고조사의뢰 및 회신(/FNGCLAK0101.xml) (팝업) [업무메뉴: 보상 ==> 사고조사] 
1. 조회 처리
================================================================================================================== 
  
- 자동차사고조사(/FNGCLAK0100.xml) [업무메뉴: 보상 ==> 사고조사] 
==> 자동차사고조사(/FNGCLAK0100.xfdl) 분석[보상 == 사고조사]
================================================================================================================== 

- 개발자 공통 교육(16시. 대회의실)
1, 4번째 교육
==================================================================================================================

- 응용팀(보상.손사 파트)과 상견례 (17시. 대회의실) 
1. 응용팀과 개발 진행 방향과 일정에 대해서 상견례
==================================================================================================================

- 국민은행 계좌 변경(12시, 국민은행 방문)  ==> 완료[♥♡]
1. 도장 변경(사인 --> 도장)
2. 비밀번호 변경(9923)
3. 국민은행 계좌번호: 617401-04-092699[보통예금, 나눔계 --> 만주 고모 통장으로 변경], 예금주: 진태만 ==> 총 천 만원 입금
==================================================================================================================

- 신한저축은행 예금 가입(21시, 집)
1. 천 6백 만원(엄마 돈 예금)
==================================================================================================================

91. (무) 프리미어 변액유니버셜보험 Ⅲ(저축형) ==> 신청 완료[♥♡]
1. 총납입 보험료: 45,000,000원, 기인출액: 32,180,000, 환급률(인출제외)(%): 31.59, 환급률(인출포함)(%): 103.10
지급금액(원):	14,219,348원, 공제금액(원): 215,490원, 지급예정일: 2021.03.18, 실지급금액: 14,003,858원(세후 금액)
==================================================================================================================

- 노트북 와이드 모니터 16:9(1920x1080) 비율 설정 변경
1. 바탕화면: 마우스 우 클릭 ==> 그래픽 속성 ==>인텔 HD 그래픽 제어판(새창)
 1) 디스플레이 ==> 해상도: 2560*1080: 선택, 60p Hz: 선택 --> 적용: 클릭
==================================================================================================================

- 집 노트북 사양
0. 모델명: MSI GE60_2OE
1. CPU: 인텔 i7-4700MQ(2.4GHz)
2. RAM(메모리): 하이닉스 DDR3 PC3L 8 GB  메모리(슬롯 2개)
3. 그래픽 칩셋: 엔비디아 인텔 지포스GTX765M(GeForce GTX 765M)
==================================================================================================================

- 다음 카카오 메일 가입 실패
1. 만 14세 이상만 가입 가능 ==> soojong2021@kakao.com
==================================================================================================================

- OSB 저축은행 예금 가입 예정(부모님 돈)
1. 예금명: 복리정기예금 ==> 계좌번호: 00321-24-0821479
2. 가입일자: 2020년 10월 14일
3. 만기일자: 2021년 10월 14일
4. 가입기간: 12개월 
5. 이율: 1.713%
6. 예치금액: 16,000,000원 ==> 만기예상지급액: 16,231,929원
7. 출금계좌번호: 00311-13-0065099(E-보통예금), 예금주: 진태만
8. 인터넷으로 가입 ==> https://ibs.osb.co.kr/ib20/mnu/BNK00047?ib20_wc=WID00056:WID00057
https://www.osb.co.kr/ib20/mnu/HOM00091
================================================================================================================== 
  
■■■■■■■■■■■■■■■■■■ 2021.03.16(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
- 교통사고조사정보조회(/FNGCLAK0100_08.xml) (팝업) 개발[보상 => 사고 접수 ==> 자동차사고조사 Main] 
1. 조회 처리,
==================================================================================================================

- 보상파트 회의(09:10. 중 2 회의실)
1. 일시: 2021년 3월 16일 09:10 ~ 10:00
2. 장소: 9층 소 1회의실| 
 1) 회의실이 없어 50분에 걸쳐 협의하고 시간 부족시 2차 일정으로 진행하겠습니다. (서명준 부장이 요청)
3. 내용 
 1) 개발자 4명 기준으로 개발 일정 재작성 ==> 02_최성제(부장) [1. 보상]. 03_송기태(부장) [2. 손사]
 ==> 개발 일정 재작성: 서영준 부장에게 메일로 보냄
==================================================================================================================

- 보상 파트 회의(16시, 중 1회의실)
1. 최성제 부장(프리랜서)이 보상(자차) 업무 전체 설명해줌
2. 보상 업무 플로우 
A. 사고접수 
 1. 계약사항, 2. 사고내용, 3. 피해 입력 ==> 등록 ==> 저장
B. 자동차 사고조사(사고조사)
 1. 과실 약도(주요도표): 조사자 의견: 과실 확정
 2. 피해자/물 관리 
C. 피해 물관리(추산)
D. 심사(결재)
 1. 피해자관리: 치료비, 합의금(사망, 장애, 부상)
E. 보험금결정 (결정)
 1. 결재 ==> 입출금관리(경리)
==================================================================================================================

- REBIT-A 키보드 어플 설치
1. 키보드가 넒어서 오타가 적게 남: 만족
https://play.google.com/store/apps/details?id=com.phillit.akeyboard&hl=ko&gl=US
==================================================================================================================

- 나만 몰랐던 삼성노트 활용팁 10가지(S펜)
https://youtu.be/QoQS4wSjRHI
1. 노트빠르게 열기
2. 노트투명
3. 분활화면
4. 노트잠금
5. 보기방식
6. 카테고리 분류
7. 노트공유
8. 노트 오디오녹음
9. 노트 검색
10. 노트를 바탕화면에 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.17(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주간보고 작성(9시, 10주차 - 20210317), 김용운B 과장 철수(16시)

- 하나손해보험 Prj[★]
- 교통사고조사정보조회(/FNGCLAK0100_08.xml) (팝업) 개발[업무메뉴: 보상 ==> 사고조사 ==> 자동차사고조사 Main]
1. 조회 처리
==================================================================================================================

- 손사 파트 회의(9시. 중2 회의실)
1. 박창준 차장(프리랜서)이 손사 업무 전체 설명해줌
2. 손사 업무 플로우
 A. 사고접수
  1. 청구유형정보, 2. 사고정보, 3. 피보험자 및 담보선택 ==> 등록 ==> 저장 
B. 사고정보 입수 
  1. 병원비 등 영수증 등록
C. 손해 조사
 1. 보험금 조정
D. 추산 
 1. 상해 Tab, 질병 Tab, 부대비 Tab   
E. 보험금결정(결정)
 1. 결재 ==> 입출금관리(경리)
==================================================================================================================

- 구종식 부장과 보상 일정 조정 문제로 충돌(16:30, 중 2 회의실)
1. 내가 보상 파트 8명 일정 모두 작성 ==> 이수용 대리(초급, 8번째) 일정 문제 제기: 일정 4명은 자기가 작성한다고 함 
2. 이대로 하면 보상파트 개발 안 끝난다고 함 ==> 그럼, 해결책을 가져 오라고 함
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.18(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  도시가스 검침(19:20, 아줌마 방문: 이상 없음, 가스 사용량이 극히 적다고 함)
									, OSB 저축은행 예금 가입(21시, 집, 엄마돈 천 6백 만원)

- 하나손해보험 Prj[★]
- 교통사고조사정보조회(/FNGCLAK0100_08.xml) (팝업) 개발
1. 조회 처리
==================================================================================================================

- 신도표조회(/FNGCLAK0100_12.xml) (팝업) 개발
1. 조회 처리
==================================================================================================================

- OSB 예금 가입(부모님 돈) [2021.03.18(목)]
1. 예금명: 복리정기예금 ==> 계좌번호: 00321-24-0821479
2. 가입일자: 2020년 10월 14일
3. 만기일자: 2021년 10월 14일
4. 가입기간: 12개월 
5. 이율: 1.700%
6. 예치금액: 16,000,000원
7. 출금계좌번호: 00311-13-0065099(E-보통예금), 예금주: 진태만
8. 인터넷으로 가입 ==> https://ibs.osb.co.kr/ib20/mnu/BNK00047?ib20_wc=WID00056:WID00057
https://www.osb.co.kr/ib20/mnu/HOM00091
==================================================================================================================

- BHC 치킨 회원가입
https://www.bhc.co.kr/ecoupon/ecoupon.asp, tamario, 20**오*h@
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.19(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 다음주 보상 시연 일정 조절ㅇ11시 응용 1팀 서명준 부장과 미팅 후 금요일에 시연하기로 잠정 합의)

- 하나 손해보험 Prj[★]
- 신도표조회(/FNGCLAK0100_12.xml) (팝업) 개발
1. 조회 처리, treeview 생성 
scwin.fnonLoad = function(obj___Form, e__LoadEvertinfo) { 
	sewin.fn_testSearch(); 	// TEST 데이타 생성, 조회 추가(2021.03.19, by 진태만) ■■■ 
};

/**
* TEST + 데이타 생성, 조회 ==> TEST 조회 추가(로컬 TEST 목적) [2021,03.18. by 진태만]
*/
scwin.fn_testSearch = function() {  
	gcm.log("[/FNGCLAK0100_12.xml] [fn_testSearch()] [TEST_01] [TEST 데이타 생성, 조회] ==> 조회결과 처리 @@@" );
	gcm.log("[/FNGCLAK0100_12.xml] [fn_testSearch()] [TEST_20] [INPUT Ds]"+ JSON.stringify(ds_dgChtMenuDtalsMSGBcVo) );
   
	// 01. 과실도표 정보 Ds 데이타 셋팅
	$xp.addRow(ds_dgChtMenuDtalsMSGBCVO);
	ds_dgChtMenuDtalsMSGBcVo.setCellData(0, "cd", "100001")		
	// 과실도표 코드 칼럼 DS에 추가[2021.03.17. by 진태만]  ===> TEST @@@ ===>
	ds_dgChtMenuDtalsMSGBcVo.setCellData(0, "cdNm", "제 1장 자동차와 보행자의 사고 : 101 ~134");
	// 과실도표 내용 칼럼 DS에 추가[2021.03.17. by 진태만]  ===> TEST @@@ ===>
	
	$xp.addRow(ds_dgChtMenuDtalsMSGBCVO);
	ds_dgChtMenuDtalsMSGBcVo.setCellData(0, "cd", "100110")		
	// 과실도표 코드 칼럼 DS에 추가[2021.03.17. by 진태만]  ===> TEST @@@ ===>
	ds_dgChtMenuDtalsMSGBcVo.setCellData(0, "cdNm", "(1) 횡단보도 내 (신호등 있음 : 101~1110");
	// 과실도표 내용 칼럼 DS에 추가[2021.03.17. by 진태만]  ===> TEST @@@ ===> 
	
	// scwin, fn_dataBinding("2");  // 데이타 바인딩 처리 추가(1: 조회 조건, 2: 조회 결과) 추가(2021.03.19. by 진태만)
};
==================================================================================================================
   
- 구종식 부장과 보상 일정 조정 문제로 충돌2(10:45, 중2 회의실)
1. 또 일정 가지고 머라고 하길래 짜증냄 : 퇴직 연금 이야기도 꺼냄 (개처럼 일하고 개취급 한다고 함 야근 절대 만한다고 함)
==================================================================================================================
   
- 고도화로 넘어감(개발 안해도 됨 : 최성제 부장 확정)
FNGCLMD0100 위임등록
FNGCLMD0100_02 피해물입찰 
FNGCLMD0100_03 위임업체 담당자변경 관리 
FNGCLMD0101 위임 현황조회 
FNGCLMD0102 위임접수진행 보고 
FNGCLMD0103 위임 등록리스트
FNGCLMD0107 대물위임건 평가 
FNGCLMD0108 대물위임업체용통계 
FNGCLMR0100 그린회원관리 
==================================================================================================================
  
- 대성 설틱 보일러(DR-100) 난방 끄기
1. 현아트빌 404호
- 대성쎌틱 온도조절기 사용방법(DR-100) 콘덴싱 완벽해결(동파방지)
https://youtu.be/i1wXrDnx9Vo
 1) 외출 설정 / 해지하기
 가. '난방/외출' 버튼을 반복해서 누르세요. - '난방/외출' 버튼을 반복해서 누르면 외출 모드로 설정됩니다.
 나. 외출 해지 - 외출 모드를 해지하려면 '난방/외출' 버튼을 눌러 해지합니다. 외출 모드는 외출을 하거나 난방을 하지 않을 때 사용
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.20(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 오후 비 조금 내림

- 주말[★]
05:00 기상
05:40 조식(베트남 2개) 
06:15 실내 도보 
07:25 종료 
07:40 인터넷 서핑 
12:00 중식 
12:30 실내 도보
13:30 종료
13:40 인터넷 서핑 
15:10 영화 미나리 시청(정이삭 감독, 윤여정): 재미 없음
18:00 석식(베트남 2개) 
18:20 실내 도보
19:20 종료
20:00 캐시워크 E-쿠폰으로 BHC 치킨 주문
21:10 집출발(자전거)
21:22 GS25 편의점: 캐시슬라이드 어플에서 19,000캐시 사용 ==> GS25 농심)신라면큰사발 획득  
21:30 BHC 치킨 신대방역점 ==> 양념치킨+콜라1.2L 무료로 가지고 옴
21:40 귀가
21:50 인터넷 서핑 
23:00 취침
==================================================================================================================
 
- 아리수(수도세)
https://i121.seoul.go.kr/ tamario, 20**오*h@
1. 고객번호: 039256081, 수용가명: 진태만, 수용가번호: 620-685-1-23-1000-23, 지번: 470-21, 업종: 가정용(2개월)
2. 사용기간: 2020.12.23 ~ 20201.02.22, 2개월간, 2021년 3월 납기(납부기한: 20201.03.31까지), 총사용금액: 22,620원, 차감금액: 0월
	, 납부금액: 22,620원, 검침일: 23일
3. 서울시ETX에서 현대카드로 납부(상하수도 요금) 납부 ==> 완료[♥♡]
4. 서울시ETX에서 자동이체(카드)로 신청 ==> https://etax.seoul.go.kr ==> 완료[♥♡]
----------------------------------------------------------------------------------------------------------------------------

- 소유자(사용자) 명의변경 신고 ==> 완료[♥♡]
https://i121.seoul.go.kr/cs/cyber/front/cvplsvc/NR_index.do?_m=m2_1
1. 문현철에서 진태만으로 변경
==================================================================================================================

- 미래 생존법칙 7가지
https://youtu.be/SY_9QTz9d5U
1. 트랜드 공부: 인공지능, 모빌리티, 블록체인
==================================================================================================================

- 주식 사지 말고 집부터 사라는 6가지 이유 (1부)
https://youtu.be/KAfdwOXuUz8
==================================================================================================================

- 반팔 셔츠  구입
1. 네파 폴로 여름 반팔 셔츠 카라티 남자 티셔츠, 가격: 23,580원
http://www.enuri.com/detail.jsp?similar=Y&modelno=39821646
https://www.g9.co.kr/Display/VIP/Index/1646074305
==================================================================================================================

- 비참한 인생을 만드는 8가지 습관 [동기부여 영상]
https://youtu.be/3GaBpXT-1fM
==================================================================================================================

- 보험사기특별조사반(SIU, Special Investigation Unit)
1. 보험사기를 인지하고 보험사기 입증을 위한 증거자료(현장증거, 사고데이터 등)를 수집해 분석하는 역할을 담당
==================================================================================================================
 
- 캐시워크 E-쿠폰으로 BHC 치킨 주문(20:44, 집) 
https://online.bhc.co.kr/order/orderConfirm.do
1. 결제방법: BHC e-쿠폰, E양념치킨+콜라1.25L (수량 : 1),18,000원, 신대방역점 (02-852-9282)
  1) BHC 홈 ==> e쿠폰 주문 ==> 주문하기(새창),  배달주문: 클릭 ==> 주소검색: 조원로 159-1
 ==> 매장검색
1. 상세주소: 현아트빌 404호
2. 받을 전화번호: 01030720898
3. E-쿠폰번호: 900242888738
==> 주문하기: 클릭
==> 신대방역점에서 전화옴(배달료 2천원 요구: 직접 가지로 간다고 하면 됨)
A. 캐시워크 어플에서 26,00캐시 사용하여 양념치킨+콜라1.2L 주문 ==> 쿠폰 코드번호: 900242888738
 ==> 양념치킨 주문 가격: 16,000원 
B. 캐시슬라이드 어플에서 19,000캐시 사용
 1. GS25 농심)신라면큰사발 획득  
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.21(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  
- 주말2[★]
08:00 기상
08:40 조식(베트남 2개) 
0900 실내 도보
10:10 종료
08:10 인터넷 서핑
12:10 중식
13:30 집출발(반바지) 
13:30 도보 ==> 보라매공원에서 트랙 도보
14:30 종료
14:00 인터넷 서핑
19:00 석식(베트남 1개, 어제 주문한 양념치킨 먹음)
19:30 실내 도보 
19:50 TV시청(코미디 빅리그)
20:30 가스레인지 판매(당근 마켓 어플에서)
21:01 종료
21:10 인터넷 서핑
21:44 Memo(2020.12) 작업
22:30 청소
22:40 샤워 ==> 체중: 74.1kg
23:00 취침
==================================================================================================================

- 가스레인지 판매(당근 마켓 어플에서, 20:30)
1. 아줌마가 카트 가지고 와서 사감(2만 5천원): 내일 이사갈 집에 설치 후 크기가 안맞으면 반품 해준다고 약속하고 판매 ==> 판매 완료
==================================================================================================================
 
- 노후준비 끝! 확실하게 부자되는 법 (존리)
https://youtu.be/K8jaf2BNHhY
1. 메리츠자산운용 ==> https://www.meritzam.com/new/index_n.php
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.22(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 수도세 서울시ETX에서 자동이체(카드)로 신청(21시, 집), 허민준 대리 우연히 만남(10시, 사업장): GS25 편의점 커피 사줌

- 하나손해보험 Prj[★]
 - 신도표조회(/FNGCLAK0100_12.xml) (팝업) 개발
 1. 조회 ==> 데이타 생성
==================================================================================================================

- 구종식 부장 면담(10:20. 중 2 회의실)
1. 보상팀 투입 인력(5명) 조언 요청: websquare 경험자 1명, Miplatform 경험자 2명, 여직원 2명
==> 개발자 구하기 힘드고 개발 능력 검증이 힘드니 이 사람들 뽑아서 빨리 투입하라고 요청함
==================================================================================================================

- 김유진 대리와 충돌(10:40)
1. 퇴직 연금 관련해서 자기에게 이야기 안하고 구부장에게 이야기 했다고 함 ==> 1월부터 계속 이야기 하고 2월에 메일을 보냈는데 제대로 
답변 안 해줌(6월달에 줄 예정이라고 만 함): 열 받음 
2. 퇴직 연금이 당연히 줘야 하는 건데 회사 사정으로 지급을 늦어 진다고 함: 전혀 미안함이 없음 ==> 열 받음
==================================================================================================================

- 허민준 대리 
1. 응용 1팀 자동차보험 파트, 김주현 차장 이름표 ==> 하나 메신저: 이병철
==================================================================================================================

- 개발자 회의(17시, 중2 회의실)
1. 개발 일정 오케트스라에 등록 요청
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.23(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
 - 신도표조회(/FNGCLAK0100_12.xml) (팝업) 개발
1. 데이타 생성, 이미지 생성 
==================================================================================================================
 
- 완료 처리
1. [UI전환] UI전환팀 개발에서 교통사고조사정보조회(/FNGCLAK010_08.xml) 완료 처리
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.24(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주간보고 작성(11시, 처음 작성): 주간보고 11주차 - 20210324, 개발 시연(14시, 내자리)
 
- 하나손해보험 Prj[★]
- 신도표조회(/FNGCLAK0100_12.xml) (팝업) 개발
1. 새창 띄우기, 닫기
var dsResult = $xplib.cf_OpenPopup("cla::FNGCLAK0100_12", objArg, "left=-1, top=-1, width=976, height=90
	, modeless=false, autosize=false", callback, parentObjs); 		// 과실도표 화면(팝업) 
==================================================================================================================

- 허민준 대리와 윤민지 차장 미팅(09:30, GS 편의점 커피샵)
1. 응용 1팀 자동차보험 파트 업무 협조 하라고 소개해줌
==================================================================================================================

- 개발 시연 (14시, 내자리)
1. data Binding이 안되는 것에 대한 불만 표시 ==> data Binding은 w-craft 툴에서 지원 안한다고 함
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.25(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
- 과실 약도(/FNGCLAK0100_11.xml) (팝업) 개발
1. Load 처리, 조회
==================================================================================================================

- 팝업개발 진행시 작업 방법
1. 추가 폴더 : /popuptest/ui 
 1) 위 폴더에 진행중인 팝업창 아이디와 동일한 파일을 생성해주세요. (예:FNGCUCC0101.xml)
 ==> SAMPLE LIST 화면에서 팝업테스트 화면 열기 화면 ID 입력: FNGCLAK0100 --> OPEN
 FNGCLAK0100.xml 파일(/popuptest/ui/FNGCLAK0100.xml) 호출됨
==================================================================================================================

- 크롬에서 로그 찍기 
> gcm.debugScope().dslmg.getAllJSON()
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.03.26(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
- 과실 약도/FNGCLAK0100_11.xml) (팝업) 개발
1. Grld 수정, 이벤트 처리, 확인(저장)
==================================================================================================================
 
- InputBox 텍스트 변경 이벤트 수정 
//scwin.Divo2_maeFltcCd_ontextchanged = function(objI_Edit. e_.TextChangedEventinfo) {
scwin.Divo2_maeFltcCd_ontextchanged = function(info) { 		// InputBox 텍스트 변경 이벤트 수정[2021.03.26, by 진태만] 
	gcm.log("L/FNGCLAK0100_11.xml] [Divo2_maeFltcCd_ontextchanged()] == [TEST_01] [도표번호 InputBox 텍스트 변경 이벤트] [info]"+ info );
 
	Div02_cobFltcTmCd.setValue(""); 
	scwin.verifyFltCd = "2";

	$xp.clearData(ds_fltcMdfEmtlnfBcVo);		// ds_fltcMdfEmtlnfBcVo Ds 삭제 처리
};
==================================================================================================================
 
- 교통사고조사정보조회(/FNGCLAKO100_08.xml), 신도표조회(/FNGCLAKO100_12.xml) (팝업) 완료 처리
1. 화면설계서 첨부해서 오케스트라에 등록
==================================================================================================================
 
- 하나 손해보험 Prj 01. TEST_서버(구종식 부장 PC)
http://10.1.39.134:8111/wq/login 		==> 응용1팀 보상 파트와 공유
==================================================================================================================
 
- 살찌지 않는 사람이 되는 31가지 방법, 1탄 - 먹는 시간
https://youtu.be/kFsRWiABed0
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.27(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
05:00 기상
05:12 조식
05:40 집출발: 백팩(냄비, 쟁반, 컵, 반찬 그릇), 마트용 카트(컵, 그릇), 휴지(1롤) ==> 짐 별로 안 무거움
05:50 남서울중학교 정류장 도착
06:00 5413번 버스 승차
06:30 서울 강남터미널 하차
07:20 포항행 고속버스 승차
11:15 포항 고속버스 터미널 도착
11:22 고속버스 터미널 정류장(209번 버스 승차)
11:35 두호동 주민센터 하차
11:40 포항집 도착 
12:10 중식 
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가
14:00 종료
14:10 TV 시청 ==> 만주 고모용으로 만들어 준 통장, 도장 엄마한테 줌
		포항시 주소이전 지원금 신청서, 위임장 작성(엄마한테 월요일날에 두호주민센터에 가사 재 신청하라고 함)
18:00 석식
18:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가(비 조금 옴)
19:50 종료
20:00 TV 시청
23:50 취침
==================================================================================================================    

■■■■■■■■■■■■■■■■■■ 2021.03.28(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 16:30 ==> 

- 주말2[★]
07:00 기상(새벽에 비 많이 옴, 아침에 그침)
07:10 조식
07:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가
09:00 종료
11:00 큰누나, 령경 방문 
11:30 집출발(수종, 령경): 큰누나 차[벚꽃, 개나리, 진달래 핌]
12:00 양덕 둘래길: 낮은 산으로 되어 있음
12:40 종료 
13:00 중식(포메인[베트남 쌀국수]: 포메인 쌈 & 쌀국수 세트 (2인), 맛있음(수종 쌀국수 잘 먹음) ==> 8만원 나옴: 큰누나가 쏨
14:20 귀가 
14:30 큰누나, 령경 미래에셋 증권 온라인 계좌 개설 신청 ==> 령경이한테 LG전자 주식 1주(143,000원) 사주기로 약속함
15:00 큰누나, 령경 귀가
16:00 석식
16:30 집출발: 백팩(반찬) ==> 짐 별로 안 무거움 
17:20 포항고속버스 터미널 도착
17:30 포항 출발
22:15 서울 강남터미널 도착(비 조금 옴)
22:20 서울 강남터미널 정류장 도착(643번 버스 승차)
22:35 남부초교 정류장 하차
22:40 귀가
24:55 청소
00:00 취침
================================================================================================================== 

- 당뇨를 이긴 사람들의 운동법- (20.04.08) 생로병사의 비밀 스페셜 당뇨와의 전쟁
https://youtu.be/MML9Mjra2Cs
1. 당뇨 운동 원칙
 1) 표준체중에 도달할 때까지 유산소 운동 지속
 2) 표준체중에 도달하면 근력운동 강화
==================================================================================================================    

■■■■■■■■■■■■■■■■■■ 2021.03.29(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 보상 파트 김태환 차장, 박은경 주임[QNIX QX2775F 모니터, 권지영 선임[대림동 우성2차 APT] 투입(10:20, 커피)
								 , 기령경(조카)에게 LG전자 주식 1주(143,000원) 선물, 진수종 감기 종합 검진(16시, 포항 선린병원 근처 병원)

- 하나손해보험 Prj[★]
- 통합사고조회(/FNGCLCU0400.xml) 개발 
1. Load 처리, 조회
==================================================================================================================    

- setPosition 처리 방법 
1. XP에서 변경된 Position 찾아서 복사: FNGCUCC0101(고객정보 검색) 
 1) 이메일(ntwCtpCon) Edit 위치 확인: absolute 975 90 1051 112  ==> ntwCtpCon, position = "absolute 190 50 266 72":로 변경
// 전화번호유형 콤보 변경시  
function Divo1_cobTelNoTPCd_onitemchanged(obj:Combo, e:ItemChangeEventInfo)
{
	if(obj.value == 3) {
		// ntwCtpCon.visible = true;
		ntwCtpCon.show("");		// ntwCtpCon 보이기 처리
		// ntwCtpCon.position = "absolute 190 50 266 72"; 	// 이메일(ntwCtpCon) Edit 변경된 위치 주석 처리 ■■■
		// ntwCtpCon.enable = true; 
		ntwCtpCon.setDisabled(false");		// ntwCtpCon 수정 가능 처리
		ntwCtpCon.setFocus();	
	) 
}

2. WS에서 변경된 메일(ntwCtpCon) Edit을 hide 시킴
3. WS에서 Divo1_cobTelNoTPCd_onitemchanged 함수 변경시 show 처리
/**
* 전화번호유형 콤보 변경시
*/ 
scwin Divo1_cobTelNoTpCd_onitemchanged = function(obj:Combo, e:ItemChangeEventinfo)) {
	ntwCtpCon.show(""); 	// ntwCtpCon 보이기 처리
};
------------------------------------------------------------------------------------------------------------------------

/**
<p> 사고번호 Edit 설정 </p>
*/ 
// scwin.fnSet_edtacdNo_Disable = function(ntype__String) { 
scwin,fnSet_edtacdNo_Disable = function(ntype) {  
	gcm.log(" [/FNGCLCU0400.xml] [fnSet_edtacdNo_Disable()] ==> [TEST_01] [사고번호 Edit 설정 @@@] [ntype]"+ ntype );
	
	if (ntype: "0") { 		// 0 이면 ==> 사고번호(년도, 순번) 2개 모두 보이기 처리
		gcm.log(" [/FNGCLCU0400.xml] [fnSet_edtacdNo_Disable()] ==> [TEST_11] [사고번호(년도, 순번) 2개 모두 보이기 처리]" );

		edtAcdNo, maxlength = 4; 
		// edtacdNo.position = "absolute 536 65 583 82";		// 사고번호(년도) Edit 주석 처리[2021.03.30, by 진태만]
		edtAcdNo.removeClass("wd-250"); 	// wd-250 Class 삭제[넓이 줄이기] [2021.03.30, by 진태만]
		edtacdNo.addClass("wd-50"); 	// wd-50 Class 추가[넓이 줄이기] [2021.03.30, by 진태만]

		edtacdN000.show("); 	// 사고번호(순번) Edit 보이기
		// edtacdNodo.position = "absolute 590 65 791 82";	// 사고번호(순번) Edit 주석 처리[2021.03.30, by 진태만]
	}
	else	 // 1 이면 ==> 사고번호(년도) 만 보이기 처리
	{ 
		gcm.log(" [/FNGCLCU0400.xml] [fnSet_edtacdNo_Disable()] ==> [TEST_51] [사고번호(년도) 만 보이기 처리]" )

		edtacdNo.maxlength = 18;  // 사고번호(년도) Edit 
		edtAcdNo.addClass("wd-250"); 		// wd-250 Class 추가[넓이 늘이기] [2021.03.30, by 진태만]
 
		// edtAcdNo.position.width = 255;		// 사고번호(년도) Edit 주석 처리[2021.03.30, by 진태만]
		edtacdNodo.hidel): 	// 사고번호(순번) Edit 숨기기  
	}
	gcm.log(" [/FNGCLCU0400.xml] [fnSet_edtacdNo_Disable()] ==> [TEST_99]");
};
==================================================================================================================

- 메뉴 정보 조회 
> $xpgv.getDataList("gdsMenu").getALLJSON()
3188: {menulD: "FNLV5001384", menuNm: "통합사고조회", upmenulD: "FNLV5001382", prefix: "CLC", formid: "FNGCLCU0400", }
==================================================================================================================

- [모니터 교체 요청]: 카카오톡으로 구종식 부장에게 보냄
부장님, 안녕하세요? 진태만입니다.
다름이 아니라, 현재 22인치 모니터를 사용하고 있는데 화면이 너무 작아서 복잡하고 정교한 현재의 프로젝트 특성상
업무 효율과 능률이 현저히 떨어지고 있으니 27인치형 모니터로 교체를 요청 드립니다.
처리 부탁 드립니다.
감사합니다.
------------------------------------------------------------------------------------------------------------------------------

1. 구입 요청 모니터
 1) QX2775F REAL 75 HDR, 가격: 146,490원
http://www.enuri.com/detail.jsp?modelno=51620740

2. 현재 사용 중인: 델 모니터(P2217H)
 1) DELL P2217H 22인치 모니터 16:9 IPS 델 피벗 스텐드, 가격: 189,500원
http://www.enuri.com/detail.jsp?modelno=14441803
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.30(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 하나손해보험 Prj[★]
- 통합사고조회(/FNGCLCU0400.xml) 개발 
1. Load 처리 
==================================================================================================================
 
- 컴포넌트 안 보이기 처리 
display:none
==================================================================================================================
 
- enable 처리
// maeDrvpeCtp TelNo.enable = false; 	// 전화번호 InputBox 주석 처리[2021.03.25, by 진태만]
==> maeDrypeCtpTelNo.setDisabled(true); 	// 전화번호 InputBox 추가[2021.03.25, by 진태만]
==================================================================================================================
 
- 응용1팀과 회의(10시, 소회의실)
1. 개발 완료한 화면 컨펌 못 한다고 함 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.03.31(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>주 간보고 작성 (9시, 12주차 - 20210331)

- 하나손해보험 Prj[★]
- 통합사고조회(/FNGCLCU0400.xml) 개발 
1. Event 처리, 조회 처리
==================================================================================================================

- 고객검색
/ui/cuc/FNGCUCC0101.xml
=================================================================================================================

- 오태범 이사 면담(12시, 식당: 비빕밥)
1. 하나손해보험 프로젝트 종료(08월 31일) 후 보너스(200만원) 주기로 합의함
2. 하나손해보험 프로젝트 상황 보고 이메일로 오이사에게 보냄
==================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
