

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.08) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.08.01(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- 주말2[★]
07:30 기상
08:00 조식(수종: 치킨 남은 것 먹음)
08:20 실내 도보
09:30 종료
09:40 인터넷 서핑: 비 조금 옴
12:00 중식(수종)
12:00 중식
12:20 실내 도보
13:40 종료
13:40 인터넷 서핑
14:00 집출발(자전거): 비 약간 옴(우산 쓸 정도 아님, 딱 좋음)
14:45 구로 2차 순영 웰라이빌 아파트 304호 도착(은영이네 집): 수종이와 헤어짐
15:10 조원도서관: 당뇨병이 낫는다...[황성수 지음] 대출 ==> 도서관 도로나19 4단계로 열람 금지, 대출, 상호대차만 가능 함
15:30 귀가
16:00 독서(당뇨병이 낫는다.): 나름 괜찮은 책으로 판단됨
18:40 종료
19:00 석식
19:00 실내 도보
20:40 종료
20:40 청소(청소기, 밀대) 
21:00 샤워
21:20 종료
21:40 인터넷 서핑
22:20 취침
==================================================================================================================

- 코로나 예방 접종 예약
- 코로나19 예방접종 쉽고 빠른 온라인 예약방법 따라하기![질병관리청 아프지마TV]
https://youtu.be/F9zbymjeu7s

- 코로나19 예방접종 온라인 예약
https://ncvr.kdca.go.kr
==================================================================================================================

- 샤르르 샤를 침대 매트리스커버 Q 구입, 가격: 37,160원
http://www.ssg.com/item/itemView.ssg?itemId=1000043198953&siteNo=6004&salestrNo=6005
-----------------------------------------------------------------------------------------------------------

- 에이스 침대] LUCE-II LQ CA (퀸침대) 침대 규격 ==> 안방애 있는 에이스 침대
1. 침대: 1580 * 2179 * 1158, 매트리스: 1500 * 2000 * 230 
==================================================================================================================

- 도서 대출(09시, 조원도서관)
1. 당뇨병이 낫는다 : 밥으로 병을 고치는 의사 황성수의 당뇨 치료 지침서 / 황성수 지음
 1) 대출 기간: 2021.08.01 ~ 08.24
=========================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.02(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 출근 때 비 조금 내림(우산 X), 중식 (11:40, 야채 셀러드), 커피 끊기(일단 하루 1개 만 먹기)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발
21-1, FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대폰번호 입력 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMC01521R.view --> /fmco1521s.jsp
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.03(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 중식 (11:40, 옥수수)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 . 
21-2. FMCO1522R VIP 금융컨설팅 - STEP2) 신청영업점 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMCO1522R.view --> /fmco15225.jsp
21-2-2. FMC01530R 영업점 찾기 
1. http://localhost:8088/servlet/FMC01530R.view 
 1) function sendMapCommHttp(){ } 	// 영업점 목록 가져오기 - 트리탑스 ajax 통신 
function closeSearchBranches Popup(branchCode, name) { 
	navigate("FMCO1523R", { 		// FMCO1523R( VIP 금융컨설팅 - STEP3) 상담희망일)로 이동
		"returnPage": "${REQUEST_MAP.returnPage}",
		"MPNO_VIEW": "${REQUEST_MAP.MPNO VIEW}", 	// 휴대폰번호 화면출력용 
		"MPNO": "p{REQUEST_MAP.MPNO}", 	// 휴대폰번호
		"RO BRNM": name, 
		"RQ_BRC": branchCode
	});
}
-----------------------------------------------------------------------------------------------------------------------------

21-3. FMCO153R VIP 금융컨설팅 - STEP3) 상담희망일 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMC0153R.view --> /fmco1523s.jsp
==================================================================================================================

21-4. FMC01524R VIP 금융컨설팅 - STEP4) 상담내용 입력 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMC01524R.view --> /fmco15240.jsp
==================================================================================================================

- 반장(이은희 현아트빌 302호)과 싸움(21시, 집)
1. 반장이 카톡으로 관리비 안 냈다고 문자옴 ==> 알고보니 현아트빌 단톡방에 공지사항에 반장 교체 후 신임 반장이 자동이체 변경을 알림
 1) 8월 관리비는 전 반장 계좌로 이미 이체됨(반장이 전 반장에게 연락해서 찾아온다고 함)
2. 나는 공지를 알리는 것이 아니라 직접 개인에게 통보를 하지 않아서 나는 몰랐다고 함
3. 반장은 공지만 올리면 된다고 주장함
4. 내가 열받아서 반장( 집(현아트빌 302호)로 가서 소리지르고 난리침 ==> 반장도 같이 소리침
5. 내가 다시 집으로 돌아옴(열받아서 PC 전원 바로 껐는데 PC 다시 안 켜짐: 고장 추정)
6. 반장이 20시 반쯤에 아줌마랑 찾아서 우리집 문앞에서 논쟁을 벌림
7. 내가 소리 지른 것에 대해 사과하고 끝냄
==================================================================================================================
 
- 현아트빌 404호 관리비 자동이체 설정(재설정)
1. 반장(이은희 현아트빌 302호) 국민은행: 547801-04-047318 , 예금주: 이은희
 1) 이체금액: 4만원, 이체일자: 25일, 기간: 2021.08.25 ~ 2022.12.25
----------------------------------------------------------------------------------------------------------------------------------
- 현아트빌 404호 관리비 자동이체 해지
1. 반장(이은희 현아트빌 302호) 국민은행: 110-504-967679, 예금주: 김진아
 1) 이체금액: 4만원, 이체일자: 25일, 기간: 2021.03.25 ~ 2023.01.25
================================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2021.08.04(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 중식(11:40, 김밥), 과탄산소다 사용하여 막힌 세면대 뚫음(21시, 집): 깨끗하게 뚫림, 만족, 2번째 사용

- 농협 PFM 고도화 Prj[★]
- 농협 PEM 고도화 Prirl - PFM 고도화 2차 개발
21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대폰번호 입력 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMCO1521R.view --> /fnco15215 jsp 
 1) 이전 버튼 클릭: 나가기와 같은 기능(창닫기), header 부분 이전 버튼: 제외 ==> 최수경 수석 확인
==================================================================================================================

22. FPSE4000R VIP 신청내역 ==> 확인 요망[♡♡] 
1. http://localhost:8088/servlet/FMSE4000R,View --> /fmse4000r.jsp
 1) 상담 상태명 변경(기간경과 --> 기간종료): 현재일이 상담 희망일 다음날이면
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.05(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발  
31. FMMY5100R 하나로 가족고객[구) FMRP2100R --> /fmrp2100r.jsp
1. http://localhost:8088/servlet/FMMY5100R.view --> /fmmy5100r.jsp
==================================================================================================================

34. FMMY5310R 하나로 가족고객 혜택 - 기본 우대서비스(구) FMRP2310R --> /fmrp2300r.jsp] ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMMY5310R.view --> /fmmy5310r.jsp
 1) / FMMY5310R.service, /fmmy5310r.jsp
-----------------------------------------------------------------------------------------------------------------------------
 
34-1. FIYY5320R 하나로 가족고객 혜택 - 기본 우대서비스 Tab ==> 완료[♥♡] 
1. FMMY5310P 하나로 가족고객 혜택 - 등급 선택 --> 없음 ===> HL221000.html 파일내에 포함됨 
// 우대서비스별 HTML 파일 
HL221000.html; 탑클래스, HL222000.html: 골드, HL223000.html: 로얄, HL224000.html: 그린, HL225000.html: 블루 
==> var targetPath = "/content/nhasset/html/rp/"url+".html"; ==> 개발서버[CMS 통해 관리]
-----------------------------------------------------------------------------------------------------------------------------
 
34-2. FMMS320R 하나로 가족고객 혜택 - 특별 우대서비스 Tab ==> 완료[♥♡] 
1. HL226000.html
-----------------------------------------------------------------------------------------------------------------------------

34-3. FMMYS330R 하나로 가족고객 혜택 - 자산관리서비스 Tab ==> 완료[♥♡] 
1. HL22A000.html
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.06(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 배상범 만남(19시, 60계 신도림점): 치킨, 맥주[52,300원: 내가 쏨)

- 농협 PFM 고도화 Prj[★]

- PFM 고도화 2차 개발 
40. 자산 (항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 계좌: 클릭
41. FMAS1310R 입출금 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1310R.view --> /fmas131r.jsp  
-----------------------------------------------------------------------------------------------------------------------------
 
40. 자산(항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 부채: 클릭(2000629820: 로그인)
41. FMAS1313R 입출금 상세_마이너스통장 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1313R.view --> /fmas1313r.jsp
-----------------------------------------------------------------------------------------------------------------------------

40. 자산(항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp  ==> 보험 : 클릭
 42. FMAS1610R 보험 상세 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMAS1610R.view --> /fmas1610r.jsp 
1-1 : 연금보험, 연금저축보험 연금항목으로 재분류됨으로 LEVEL3 유형명 변경: 저축 · 연금보험 > 저축보험
==================================================================================================================

42. FMAS1610R 보험 상세 
http://localhost:8088/servlet/FMAS1610R. View --> /fmas1610r.jsp ==> 특약정보 > 더보기 버튼 : 클릭
3. FRAS1612P 특약정보 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet EMAS1612P.view --> /fmas1612p.jsp
==================================================================================================================

49. 자산(항목별목록)  
http://localhost:8088/servlet/FNAS1100R.view --> /fmas1100n.jsp ==> 실물 --> 부동산 1개: 클릭 
44. FMAS1811R 부동산 목록 
http://localhost:8088/servlet/FIMAS1811R.view --> /fmas1311r.jsp ==> 부동산명: 클릭

44. FMAS1812R 부동산 상세 . 
1. http://localhost:8088/servlet/FMAS1812R.view --> /fmas 1812r.jsp 
1. Header명 변경, 	2. 자가 상단 영역 수정, 	3. 자가 주요 정보 추가,	 4. 자가 상세 정보 수정(단지 정보 보기 팝업 버튼)
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.08.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★]
05:30 기상
05:40 조식
06:00 집출발
06:10 남서울중학교 정류장 도착
06:30 643번 버스 승차
07:20 강남역 정류장 하차(배가 아퍼서 제대로 못 걸음)
07:35 삼성제일빌딩 도착 ==> 화장실(설사)
08:10 누네안과병원(선릉역 1번 출구 도착 ==> 코로나 문진표 작성, 15층 데스크 접수
08:30 안과 검사(15층): 1번(안압 검사), 2번(시력 검사)
09:00 망막 검사(13층): 1번(검사), 2번(검사), 3번(검사)
09:10 진료(김종민 원장, 13층) ==> 큰 문제 없다고 함, 근시용 안경 착용해도 된다고 함(12월 11일(토) 08시 예약)
09:17 수납(13층) ==> 진료비: 총 52,300원 
10:05 643번 버스 승차
11:10 호림박물관 하차 -> 다이소 난곡입구점 방문 ==> 계량컵, 다각형 투명 손잡이 티 스푼(작은 숟가락, 파란색) 구입
11:20 오이(3묶음; 총 15개) 구입: 신사시장 진흥마트 옆 가게
11:30 귀가
12:00 중식
12:30 실내 도보
12:30 종료
13:40 인터넷 서핑
19:00 석식
19:30 실내 도보
20:30 종료
20:30 인터넷 서핑
22:30 종료
22:35 취침
==================================================================================================================

 - 인류 필수품 옥수수를 둘러싼 전쟁 | 식자재부터 바이오 연료까지- KBS 대기획 “옥수수 전쟁” (KBS 081116 방송) [KBS 다큐]
 https://youtu.be/czr1cop4XYA
1. 2005년 ‘포괄적 에너지 법안’이 공포된 이래 미국은 바이오 에탄올 생산에 박차
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.08(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★]
07:00 기상
07:40 조식
08:00 실내 도보
09:10 종료
09:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:40 종료
13:40 인터넷 서핑
16:00 소나기 조금 옴(30분 후 그침)
19:00 석식
19:30 실내 도보
20:00 2020 도꾜 올림픽 폐막식(코로나19로 무관중 올림픽)
20:30 종료
20:40 청소(청소기, 밀대)
21:00 샤워
21:30 인터넷 서핑
23:00 취침
==================================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.08.09(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 퇴근할 때 소나기(18시, 우산), 열대야 끝(22:40, 취침시 선풍기X)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 40. 자산(항목별목록) 
http://localhost: 8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 실물 --> 부동산 1개: 클릭 
44. FMAS1811R 부동산 목록
http://localhost:8088/servlet/FMAS1811R.view --> /fmas1811r.jsp ==> 부동산명: 클릭

44. FMAS1812R 부동산 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1812R.view --> /fmas1812r.jsp
 1) 거래코드(AP): COM2201S03(최종스크래핑 일시 조회 서비스) 
 2) 거래코드(AP): ASS1611S04(실물: 부동산 상세 조회 서비스) 
 3) 거래코드(AP): ASS1611S05(실물: 부동산 대출계좌 조회 서비스) 
2. Header명 변경, 2. 상단 영역 수정, 3. 주요 정보 추가, 4. 상세 정보 수정 (단지 정보 보기 팝업 버튼 추가) 
.nhasset .value_02{color:#7e858e;} 	/* 글자색 변경(글자색)[2021.09.01, by 진태만] TEST @@@ ===> */
==================================================================================================================
 
48. FMAS1818R 기타 부동산 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1818R.view --> /fmas1818r.jsp
 1) 거래코드(AP): ASS1611504(실물 : 부동산 상세 조회 서비스) 
2. Header명 변경, 2. 상단 영역 수정, 3. 주요 정보 추가, 4. 상세 정보 수정 (단지 정보 보기 팝업 버튼 추가) 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.10(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 말복(더위 끝)

- 농협 PFM 고도화 Prj[★]
- 프로그램 목록 작성
1. NHPFM-AP-DS07-프로그램목록_2차_통합_20210809.xlsx ==> 전체 58건(신규: 9건, 변경: 13건)
 1) 작성 완료 후 김용석 부장에게 쪽지로 파일 보냄(17시)
==================================================================================================================
 
- 크롬에서 화면 Capture 
1. 크롬에서 Ctrl + Shift + I(단축키) : 개발자 모드로 가기 
2. 개발자 모드에서 Ctrl + Shift + P(단축키): 검색창으로 가기
2 3. 검색창에서 scr: 입력 
 1) Capture area screenshot: 원하는 영역을 마우스 드래그 & 드롭하여 캡처 
 2) Capture full size screenshot: 전체 영역 캡처 
 3) Capture screenshot: 현재 보여지는 영역 캡처
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.11(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- 농협 PFM 고도화 Prj[★]
47. FMAS1814R 부동산 정보 수정[자가]
1. http://localhost:8088/servlet/FMAS1814R.view --> /fmas1814r.jsp --> 수정 버튼: 클릭 
1) 거래코드(AP): ASS1611U01(실물: 부동산 정보 수정 서비스)
-----------------------------------------------------------------------------------------------------------------------------
 
47-1. FMAS1816P 부동산 자가 수정 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1816P.view --> /fmas1816pr.jsp
==================================================================================================================

47. FMAS1814R 부동산 정보 수정[전세]
1. http://localhost:8088/servlet/FMAS1814R.view --> /fmas1814r.jsp --> 수정 버튼: 클릭 
1) 거래코드(AP): ASS1611U01(실물: 부동산 정보 수정 서비스)
-----------------------------------------------------------------------------------------------------------------------------

47-2. FMAS1817P 부동산 전세  수정 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1817P.view --> /fmas1817pr.jsp 
==================================================================================================================

48. FMAS1818R 기타 부동산 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1818R.view --> /fmas1818r.jsp
1) 거래코드(AP): ASS1611S04(실물: 부동산 상세 조회 서비스)
2.  Header명 변경, 	2. 상단 영역 수정, 	3. 주요 정보 추가,	 4. 상세 정보 수정(단지 정보 보기 팝업 버튼 추가)  
 -----------------------------------------------------------------------------------------------------------------------------
 
48. FMAS1819P 기타 부동산 수정 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1819P.view --> /fmas 1819pr.jsp 
1) 거래코드(AP): ASS1611S04(실물: 부동산 상세 조회 서비스)
==================================================================================================================

45. FMAS1812P 단지 정보[신규] ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1812P.view --> /fmas1812p.jsp
1) 거래코드(AP): ASS3701506(실물: 단지 정보 조회 서비스): 신규
==================================================================================================================

- 쿠쿠압력밥솥 뚜껑분해 청소 수리하기
https://youtu.be/whWElWo7Se0
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.12(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
31. FMMY5100R 하나로 가족고객[구) FMRP2100R --> /fmrp2100r.jsp
1. http://localhost:8088/servlet/V.view --> /fmmy5100r.jsp
 1) 최수경 수석에게 JSP에서 JAVA 함수 선언 관련 문의를 한 결과 JAVA Service단에서 처리하라고 함
1. /fmmy 5100tS.java 파일에서 
@suppressWarnings ("deprecation") 
public IDataSet getInfo(IDataSet dataset, IBizServiceContext context) throws Exception {
	System.out.println("[/fmmy5100ts.java] [getInfo()] ==> [T_01] [하나로 가족고객[보고서 정보 조회]");
	
	// 현재점수 기준일
	if(!"".equals(CURR_DATE)) {
		Date TEMP_CURR DATE = NHBDateUtil.stringToDate (CURR_DATE); 
		CURR DATE TEXT = NHBDateUtil.getFormattedDate(TEMP_CURR DATE, "yyyy.MM.dd"); 
		DateFormat yyFormat = new SimpleDateFormat("yy년 ");
	
		// 분기값 구하기 ==> 함수 호출[2021.09.01, by 진태만]	 // ===> TEST @@@ ===> 
		NEXT_CURR_DATE_TEXT = NHBDateUtil.getFormattedDate (TEMP_CURR_DATE, "yy ") 
		+ getQuater(TEMP_CURR(DATE.getMonth()+1); 	// 분기값 샘플: 18년 3분기 말 ■■■
	}
}

* 설명: 분기값 구하기
* @param month
* @param month
* @return string 
* @throws Exception
*/
private static String getQuater(int month) throws Exception { 
	String sRnt = "";
	
	if (month >= 1 && month <= 3) {
		SRnt = "1분기 말 ":
	}else if(monthl>= 4 && month <= 6) {
		sont = "2분기 말 ":
	}else if (month >= 7 && month <= 9) {
		sRnt = "3분기 말 ":
	}else if(month >= 10 && month <= 12) {
		sRnt = "4 분기 말 ":
	}
	System.out.println("[/fmmy5100S.java] [getQuater()] ==> [T_01] [분기값 구하기] [월]" + month +[결과값]"+ sRnt );
);
==================================================================================================================

2. /fmmy 5100r.jsp 파일에서 
<%! 		// ==> JSP에서 JAVA 함수 선언 금지 @@@ 
private String getQuater(int month) throws Exception { 	// 분기값 구하기
	String quaterStr = ""; 
	return quaterStr;
}
%>

<%

	NHBMapUtil resMap = NHBMaputil.getMapObject(request.getAttribute("RESULT_MAP"));
	NEXT_CURR_DATE_TEXT = resMap.getString("NEXT_CURR_DATE_TEXT", ""); 	// 분기값(yy년 x분기 말)
	System.out.println("[/fmrp2100r.jsp] ==> (T_51] [현 분기값]"+ NEXT_CURR_DATE_TEXT ); 
%>

<p class="txtSmGray2 mt10">점수 기준일 : <%=CURR_DATE_TEXT%></p> 
	<div class="gradePointWrap">
	<p더움 등급 산정기준일은 <strong><%= NEXT_CURR_DATE_TEXT%></strong>이며,<br> 
	현재 점수를 유지 시<br><strong class="gradeColor<%= CURR_CLASS%>"><%= NEXT_CURR_GRD%></strong>
	등급이 에상</p> 
</div> 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.13(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 문태용 부친 별세 했다는 전화 옴(08시), 구로 2차 순영 웰라이빌 아파트 도착(20:20, 은영이네 집): 수종이짐 자전거에 
								 싣고 수종이와 같이 도림천으로 걸어옴

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발
31. FIMMY5100R 하나로 가족고객 [구) FMRP2100R --> /fmrp2100r.jsp] ==> 완료[♥♡]
1. http://localhost:8088/servlet/V.view -->/fmmy5100r.jsp
 1) /FMMY5100R.service, /fmmy5100tc.java /fmmy5100ts.java /fmmy5100r.jsp
 2) 거래코드(AP): RPT1001S01(고객 CRM EAI 하나로 가족고객 정보 조회)
 
31. FMMY5110P 하나로 가족고객 - 하나로 가족고객 등급 안내 (POP) 
1. fmmy5100r.jsp 파일 안에 존재
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.14(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★]
05:00 기상
06:40 조식
06:20 수종 기상(수종 과자 먹음)
06:35 집출발(수종) ==>  태용이 부친상 조의금 5만원 송금
06:45 남서울중학교 정류장 도착
06:50 506번 버스 승차
07:30 서울역 도착 
07:40 서울역 도보(수종, 내 가방 들고 걷음[엄청 성장한 것 같음, 초3 정도 신체)
08:10 포항행 KTX 출발
10:35 포항역 도착
10:55 코로나19 PCS 검사(포항 북구 보건소 포항 출장소): 수종 검사 받음 ==> 음성 나옴 
11:10 택시(포항역, 수종): 비 조금 옴
11:30 다이소 포항 두호점: 수종, 내 숟가락 구입, 물통(회사용) 구입
11:45 포항집 도착 
12:00 중식(현미밥[3:7])
12:30 도보(수종): 영일대 해수욕장 --> 포항 여객터미널 등대 --> 귀가: 비 조금 옴(장마 시작)
13:50 종료
14:00 집출발
14:20 두호주민센터 정류장(207번 버스 탑승): 포항 ==> 동대구 예매 안됨(신용카드 결제 에러뜸)
14:49 포항 터미널 도착
15:00 포항 출발
16:07 동대구 환승터미널 도착
16:20 동대구 소방서 정류장(814번 버스 탑승)
16:50 TBS 정류장 하차
17:00 한패밀리 병원 장례식장 특실 도착(문태용 부친 상 조문)
17:10 나눔 사람 만남(맥주[땅콩]): 정근이형, 상환, 현용, 호수, 종환, 광석, 승본
		==> 내가 살 빠졌다고 난리남, 코로나19 예방 접종 대부분 8월달에 완료라고 함
17:50 현용, 호수 서울행
18:50 종료
19:00 광석이 차(종환, 승본)
19:00 동대구역 하차
19:20 동대구 출발
20:30 포항 터미널 도착: 비 조금 옴
20:40 포항 터미널 정류장(900번 버스 탑승)
21:00 두호주민센터 정류장 하차
21:10 귀가
21:20 TV 시청 
22:30 취침
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.15(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 광복절(휴일)

- 주말2[★]
07:00 기상
07:10 조식(현미 찹쌀밥)
08:20 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가: 비 조금 옴
09:30 종료
09:40 인터넷 서핑
12:00 중식
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가: 비 조금 옴
13:40 종료
13:40 인터넷 서핑 ==> 엄마 코레일 회원 가입
16:40 다이소 포항점 방문 ==> 우산 4개, 핸드폰 충전기(수종), 숟가락 구입
18:00 석식
18:30 실내 도보
19:00 종료 
19:10 TV 시청 
20:00 코로나19 예방접종 온라인 예약(핸드폰으로 하다가 에러가 나서 노트북으로 처리: 안일하게 일 처리함)
22:30 샤워(수종)
22:50 취침
==================================================================================================================

- 신화자(엄마) 코레일 로그인 정보  
1. https://info.korail.com/mbs/www/jsp/member/login.jsp, 2172485391, soo0508@
 1) 현장발권 비밀번호: 0508
--------------------------------------------------------------------------------------------

- Korail(코레일) 철도 회원 카드(KTX)[2020.06.12(금)]
1. KTX 패밀리 체크 카드(철도회원) ==> 카드번호: 0550566830/202*오*h@
http://www.korail.com/bt/pr11100/w_pr11110.html ==> 현장발권 비밀번호: 0**9
==================================================================================================================

- [국민비서 구삐] [오후 9:10] [질병관리청]1차 예약 확인 ==> 취소함
진태만 님, 코로나19 백신 1차 접종을 예약하셨습니다.
● 현재 예약된 내역입니다.
ㅡ 일시 : 2021년 9월 10일 (금) 18:00
ㅡ 장소 : 연세의원: 02-837-6333[서울특별시 관악구 신원로 23, (신림동) 2층]
ㅡ 백신 : mRNA(모더나 또는 화이자)백신
ㅡ 예약번호 : 2142111219
● 만약 예약일시나 장소를 변경하시려면 예약일 변경가능 기간 내에 http://ncvr.kdca.go.kr 에서 예약일시나 장소를 변경하실 수 있어요.
ㅡ 이후에는 예약된 접종장소에 전화하여 변경해 주세요.
----------------------------------------------------------------------------------------------

- 코로나19 예방접종 쉽고 빠른 온라인 예약방법 따라하기![질병관리청 아프지마TV]
https://youtu.be/F9zbymjeu7s

- 코로나19 예방접종 온라인 예약
https://ncvr.kdca.go.kr
----------------------------------------------------------------------------------------------------------------

2차 예약 의료기관	의료기관명 : 연세의원
2차 접종일시	2021-10-22 / 18:00
==================================================================================================================
 
- 최희정 내과의원 
https://kidneydr.modoo.at/?link=60lpaxt4
==================================================================================================================

- 심사평가원이 인정한 당뇨병 진료 잘하는 서울 지역 의원은?
http://medipharmhealth.co.kr/mobile/article.html?no=37156
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.16(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 대체 공휴일(광복절)

- 주말2[★]
07:00 기상
07:10 조식
07:30 실내 도보
09:30 종료
09:40 인터넷 서핑
12:00 중식
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대 --> 귀가
13:40 종료
13:40 인터넷 서핑
16:00 석식
16:30 집출발(백팩에 김치, 반찬, 현미 찹쌀밥(4인분), 현미 찹쌀 3kg)
16:40 두호주민센터 정류장(209번 버스 탑승) 
17:00 포항 터미널 도착
17:30 포항 출발
21:30 강남터미널 도착(4시간 걸림)
21:45 서울 강남터미널 정류장 도착(643번 버스 승차)
22:15 남부초교 정류장 하차
22:22 귀가
22:50 청소
23:50 샤워
01:00 취침
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.08.17(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 다이소 물병(Neo kelevin) 가지고 옴(8시), 퇴근시 비(18시, 우산) 

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
31. FMMY5100R 하나로 가족고객[구) FMRP2100R --> /fmrp2100r.jsp ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMMY5100R.view --> /fmmy5100r.jsp
 1) /FMMY5100R.service, /fmmy5100tc.java /fmmy5100ts.java /fmmy5100r.jsp 
 2) 거래코드 (AP): RPT1001S01(고객 CRM EAI 하나로 가족고객 정보 조회)
==================================================================================================================

- 달리 이미지 확인
img_gradeStatus1.png: 등급유지 ==> imgDalli01: 파일 존재 안함 
img_gradeStatus2.png: 등급 ==> imgDal1102; 파일 
img_gradeStatus3.png: 등급하락 ==> imgDalli03: 파일 존재 
img_gradeStatus4.png: 탑클래스 유지 ==> imgDalli04: 파일 존재 안함 ==> nhasset1/images 폴더에는 존재 
==> 이미지 경로: /XEFMS/WebContent/content/nhasset/images 
==> 이미지 경로: C:\NSWP\PLATFORM\workspaces\project-workspace \XEFMS\Web Content content\nhasset1 
\images limg_gradeStatus3.png
GET http://localhost:8088/content/nhasset/images/img gradeStatus 2.png 404 Not Found) nhasset_cont.css:1
GET http://localhost:8088/content/nhasset/images/arr Grader.png 404 (Not Found) 
1. nhasset1\images\img_gradeStatus3.png 파일 복사하여 nhassetlimages\img_gradestatus3.png 붙여넣기 
==> 퍼블리싱 담당 윤지현 이사(010-3706-0718)가 이번주에 개발서버에 넣어 준다고 함
==================================================================================================================
 
- 커블 체어 구입(수종)
- [H몰혜택] 커블체어 인체공학 바른 자세 의자 키즈, 가격: 34,600원
1.https://www.hmall.com/p/pda/itemPtc.do?slitmCd=2120345190&ordpreview=true
==================================================================================================================

- 2021년 08월(정기분) 주민세 납부
1. https://etax.seoul.go.kr/index.html?20210817 ==> 현대카드 앱카드로 결제
 1) 5,850원 --> 실제 결제 금액: 5,150원[포인트: 700원]
인터넷 납부시 입력번호
납세번호	기관번호	세목	납세년월기	과세번호
6206852	10104101	2021081	0077867
세목	납기내금액	납기후금액	산출내역
주민세 개인분	4,650	4,940	주민세 세액 : 4,650
지방교육세 세액 : 1,200
세액 합계 : 5,850원
주민세 공제액 : 150
공제액 합계 : 150
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.08.18(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 근시 비(06시, 우산)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발
32. FMIY5200R 하나로가족고객 - 등급 시물레이션[구) FMRP2200R --> /fmrp2200r.jsp] --> 수정 ■■■
1. http://localhost:8088/servlet/FMIY5200R.view --> /fmmy5200r.jsp
==> (등급상승 필요금액 원) ==> 완료[♥♡]
==> 추천상품 AP에서 개발후 통보 해준다고 함.jsp 
 1) 거래코드(AP): RPT1001S01(고객 CRM EAI 하나로 가족고객 정보 조회)
==================================================================================================================
 
- PFM Prj 회의(13:30, 회의실) 
1. 오늘부터 PFM Pri 2차 개발 시작 
2. 프로그램 제약사항 추가 관련 논의
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.19(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 포항 수종이 방 형관등 고장(18시, 전화 옴): 작은 누나에게 전화함(여수 매형한테 조언 구함)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발
32. FMMY5200R 하나로 가족고객 - 등급 시물레이션 [구) FMRP2200R --> /fmrp2200r.jsp --> 수정 ■■■
1. http://localhost:8088/servlet/FMMY5200R.view --> /fmmy5200r.jsp 
==> (등급상승 필요금액 원) ==>완료[♥♡]
==> 다시 계산하기 버튼 추가 ==> 완료[♥♡]
==> 추천상품 노출: AP에서 개발 후 통보 해준다고 함
==================================================================================================================

- 스크립트 캡술화 지양 처리 
1. 예외: 팝업 페이지의 경우 캡슐화 사용 가능 
<script type="text/javascript">
	devConsole.log(""); devConsole.log(""); 
	devConsole.log("[/fmmy5200r.jsp] ==> [TEST_01] [등급시뮬레이션 화면_@@@] ======> ");
	
	setHeaderTitle("등급 시뮬레이션");
 
	// var fmrp2200r = (function(){ 		// 주석 처리[2021.08.19, by 진태만] 
	$.alopexready(function() {
		devConsole.log("")
		devConsole.log("[/fimmy5200r.jsp] [alopexready()] ==> [TEST_01] [초기화...]" ); 
	});
	
	// return { 
	// calcGrade, clearAll, moveInfoPage, calendarCallback,
	// openPopupSimInfo, moveFMPage,
	// showCalcResult 
	// } 
	// })(); // 주석 처리 [2021.08.19, by 진태만]
</script>
==================================================================================================================
 
- 하나로가족고객 소스 SVN에 신규 등록
==================================================================================================================

- 16년차 월급쟁이가 2년만에 경제적 자유를 얻은 비법[책읽는 책도리]
https://youtu.be/hG_PbQ1DtbE
==================================================================================================================
 
- 하비 다이아몬드 박사 - 자연법칙에 따르면 비만과 질병은 사라진다[ 책 추천해 주는 남자]
https://youtu.be/p57dtrnpwqg
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.20(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
12. FMSE3100P MY정보 - 나의 관심사 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMSE3000R.view --> /fmse3060r.jsp ==> 나의 관심사 설정 버튼: 클릭
 1) http://localhost:8088/servlet/FMSE3100P.view -> /fmse3100p.jsp
  가. 거래코드(AP): COM2103S01(관심사 리스트, 조회 서비스 (사용여부 포함)) ==> AP 변경해야 함
==================================================================================================================

- PFM 2차 개발AP URL 변경 처리 . 
1. /instance.properties 파일에서 
- # PFM 2차 개발AP URL ===> / 통합전 작업일시: 2021년 8월 20일(금) 오후 2시[2021.08.02, by 진태만] 
PFM.AP.URL=http://16.24.147.100:8020/api/api/
==================================================================================================================
 
 21-0. FMC01510R VIP 금융컨설팅 - 서비스안내 ==> 수정 중[☞☜]
1. http://localhost:8088/servlet/FICO1510R.view --> /fmco1510r.jsp

21-0-1. FMCO1511P NH WM마스터즈 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMCO1511P.view --> /fmco1511p.jsp
==================================================================================================================

- WIN10 업그레이드 처리 ==> 완료[♥♡]
1. 소프트웨어 센터에서 윈도우20H2 설치 이미지 다운로드 (C:\Windows\ccmcache\1h ==> win10_20H2)
 1) D:\win10 20H2 폴더 생성 ==> 폴더 용량 5.20GB
 2) 2_win10_local.bat 파일 더블 클릭 ==> 윈도10 업그레이드 진행 
2. 설치 에러
 1) 현상: C 드라이브 ==> 24.4GB/97.6GB 
 작업을 위한 C드라이브 여유공간 (32G) 이 부족합니다. 작업을 중단 합니다.
 2) 조치: C드라이브 디스크정리 처리 ==> C 드라이브 ==> 30.0GB/97.6GB
 3) 조치2: C: \NSWP (738) 폴더 잘라내기 ==> D:\NSWP (3.83GB) 폴더로 이동 
3. 업그레이드 완료 및 업무 확인 
 1) 윈도우 버전 확인 - 실행창(윈도우키+R)을 열고 "winverr ==> Windows 정보(새창)
  가. Microsoft Windows: 버전 20H2(OS 빌드 19042.630) --> 20H2 확인 
 91. 102393243_붙임3. Win10 20H2 업그레이드 오류조치 Q&A 게시용_v1.3.hwp 파일 참조
==================================================================================================================

- 찹쌀 현미 구입 검토
1. 삼원농산 현미 10kg, 가격: 26,730원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B472978821&frm3=V2
==================================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2021.08.21(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보(오른쪽 무릎이 너무 아파 제대로 못 걸음[전날 계단 속보, 달리기가 원인으로 추정됨])
08:10 종료
08:45 집출발(자전거: 쿠쿠압력밥솥 실음): 비 많이 옴, 우산
09:10 쿠쿠압력밥솥 구로 대리점 도착 ==> 밥솥 뚜껑 고무 교체(천원) [청소: 만 6천원, 고무 패킹 만 5천원]
09:10 종료
09:30 한독 프라자 약국 방문 ==> 안티푸라민 케토(파스, 3천원) 구입[오른쪽 무릎 치료용)
09:40 제일 전기 에어컨(철물점) 방문 ==> 화장실문 잠금 장치(2천원) 구입[포항집 화장실에 설치 할 것)
09:50 귀가
10:00 현아트빌 404호 현관문 밧데리(8개) 교체
10:00 빨래
10:10 쿠쿠압력밥솥 청소
10:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:40 종료
13:40 인터넷 서핑
19:00 석식
19:30 실내 도보 
20:10 수종이와 영상 통화 ==> 큰누나, 매형이 와서 수종이 방 형광등 교체해줌
20:25 종료
21:30 인터넷 서핑
23:00 취침
==================================================================================================================

- 와... 이게 가능해? 최강의 북스캔앱 vFlat을 추천드리는 이유 (+저작권 정보까지) (테크몽)
https://youtu.be/NUfQGNMfwis
1. 준비물: 스마트폰용 삼각대, 북 스탠드
2. 두 페이지 찍어내기 모드로 변경
3. 타이머: 3초 설정
4. 300페이지 스캔: 7분 40초 ==> 10분대 안되어 책 한권 스캔 완료
==================================================================================================================

- 당뇨병 이기려면 꼭 해야되는 이 운동!! 하루 10분만 투자하세요~! | 대한당뇨병학회(스쿼트, 런지) [당뇨병의 정석]
https://youtu.be/vUnEtNHkDlg
==================================================================================================================

- 코로나 예방 접종 재예약  ==> 취소
예약자 이름:	진태만
예약자 주민등록번호:	720625 - 1******
예약자 휴대폰번호: 010-3072-0898 
예약번호: 2147364998 ■■
접종받는 분(피접종자) 이름: 진태만
접종받는 분(피접종자) 주민등록번호: 720625 - 1******
1차 예약백신: mRNA(모더나 또는 화이자) 백신
1차 예약 의료기관	의료기관명 : 이이비인후과의원[서울특별시 관악구 난곡로 202, (신림동) 2층: 02-852-7089]
1차 접종일시: 2021-09-24 / 15:00 ■■
2차 예약백신	mRNA(모더나 또는 화이자) 백신
2차 예약 의료기관	의료기관명 : 이이비인후과의원 의료기관
2차 접종일시: 2021-11-05 / 15:00  ■■.
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.22(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★]
07:00 기상
07:40 조식
08:00 실내 도보
09:10 종료
09:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:40 종료
13:40 인터넷 서핑
15:00 집출발(자전거)
15:16 도서 반납(조원도서관) 당뇨병이 낫는다 : 밥으로 병을 고치는 의사 황성수의 당뇨 치료 지침서 / 황성수 지음
15:30 다이소 난곡사거리점 방문 ==> 미니 그립 삼각대(3,000원), 핸드폰 거치대A(1,000원), BH 심플 디자인 디저트 스푼(1,000원: 수종) 구입
15:40 오이(5묶음; 총 20개, 만원) 구입: 신사시장 진흥마트 옆 가게 
16:00 귀가 
16:10 인터넷 서핑
19:00 석식
19:30 실내 도보 
20:30 종료
20:40 청소(청소기, 밀대)
21:00 샤워
21:30 인터넷 서핑
23:00 취침
================================================================================================================

- 아리수 수도물 자가검침[2021.08.22(일)]
https://i121.seoul.go.kr/cs/cyber/front/owngc/NR_ownGcDtlsList.do: 서비스 바로가기 ==> 검침입력: 클릭 ==> 자기검침입력 화면
1. 고객번호: 039256081, 수용가명: 진태만, 수전주소: 서울특별시 관악구 조원로 159-1, 404호 (신림동 ,현아트빌 )
2.. 검침기간: 08/21~08/25 23(23:59)시까지 (5일간)
3. 08지침: 0621 / 사용량 0 ㎥  ==> 모바일 아리수 앱 설치해서 검침(계량기 빌라 문앞에 있음)  
--> 06 월지침	0617 / 사용량 4 ㎥
--------------------------------------------------------------------------------------------- 

- 검침입력 결과 
고객번호	039256081
전월 지침	617
당월 지침	621
사용량	4 ㎥ (※ 전월 사용량보다 0% 증가)
2021년 09 월분 예상요금	5,330 원
자가 검침 감면 : 600
==================================================================================================================

- 포토스케이프(PhotoScape: 프로그램)에서 일괄 편집 처리
1. 포토스케이프(프로그램) 실행
2. 상단 ==> 일괄편집(Tab): 클릭
 1) C:\Users\TAMA_HAart_404\OneDrive - 서울대동초등학교\바탕 화면\01. 이미지 편집[■]\01. 당뇨병이 낫는다(황성수 지음) 폴더로 이동
  가. 편집을 원하는 파일을 선택 ==> 마우스로 선택된 파일을 끌어서 오른쪽 Tab에 사진추가함
3. 크기조절 
 1) 가로 조절: 선택 ■■
 2) 가로:  900: 입력 ■■
 3) 모든 사진 저장(변환): 클릭
4. 저장(변환)하기(새창)
 1) 저장 위치
  가. 변환된 사진을 첫번째 사진 아래에 폴더를 만들어 저정합니다.: 체크
 2) 저장 파일명
  1) 원본과 동인한 파일명으로 저장합니다.: 체크
 3) 이미지 포맷
  가. 포맷 유지
 4) JPEG 저장품질
  가. 95: 95이상의 고품질로 저장할 것을 권장합니다.
5. 결과 확인
 1) 편집 작업 폴더 위치
C:\Users\TAMA_HAart_404\OneDrive - 서울대동초등학교\바탕 화면\01. 이미지 편집[■]\01. 당뇨병이 낫는다(황성수 지음)\ output 폴더 용량: 86.8MB
C:\Users\TAMA_HAart_404\OneDrive - 서울대동초등학교\바탕 화면\01. 이미지 편집[■]\01. 당뇨병이 낫는다(황성수 지음)\ output 폴더 용량: 86.8MB
 2) 필요 작업 폴더로 이동 
D:\01. TAMA_DATA\01. TAMA Work\91. So on\71. 도서\01. 당뇨병이 낫는다(황성수 지음)\ output 폴더 용량: 12.2MB
=============================================================================================================

- [언박싱] 다이소 3천원 신형 스마트폰 삼각대 2종류 가성비 갑
https://youtu.be/-rUVCW6e_w4
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.23(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 출근할 때 오른쪽 무릎 통증(저번 주 금요일 밤부터 시작), 다이소 핸드폰 거치대 사용(9시, 사업장)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대폰번호 입력 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMCO1521R.view --> /fmco1521s.jsp
-----------------------------------------------------------------------------------------------------------------------------

21-2. FHCO1522R VIP 금융컨설팅 - STEP2) 신청영업점 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMC01522R.view --> /fmco15220.jsp 
21-2-2. FMC01530R 영엽점 찾기 · 
1. http://localhost:8088/servlet/FMC01530R.view 
 1) function sendMapCommHttp(){} 	// 영업점 목록 가져오기 - 트리탑스 ajax 통신 
function closeSearchBranches Popup(branchCode, name) { 
	navigate("FICO1523R", { 		// FMCO1523R( VIP 금융컨설팅 - STEP3) 상담희망일)로 이동
		"returnPage" : "${REQUEST_MAP.returnPage}", 
		"MPNO VIEW": "%{REOUEST MAP.MPNO VIEW}", 	// 휴대폰번호 화면출력용 
		"MPNO": "${REQUEST_MAP.MPNO}", 	// 휴대폰번호 
		"RO_BRNM": name, "RQ_BRC": branchCode
		});
}

2. FMAS1310R 입출금 상세 ==> 
1. http://localhost:8088/servlet/FMAS1310R.view - /fmas1310r.jsp 
 1) $("tranList").append(sHtml); 	// 거래내역 리스트 ==> 확인할 것 
<div class="inoutListWrap longTit" id="trantist"></div>
==================================================================================================================
 
21-3. FMCO153R VIP 금융컨설팅 - STEP3) 상담희망일
1. http://localhost:8088/servlet/FMC0153R.view --> /fmco15230.jsp 
 1) 거래코드(AP): COMA100S02(금융컨설팅 상담 예약가능 기간 조회 (영업일 조회))
 -----------------------------------------------------------------------------------------------------------------------------

21-4. FMC01524R VIP 금응컨설팅 - STEP4) 상담내용 입력
1. http://localhost:8088/servlet/FMC01524R.view --> /fmco1524o.jsp
==================================================================================================================
 
- 크름 브라우저 실행 안됨 
1. 크름 SW 삭제 후 ChromeStandalonesetup64.exe 다시 실행
 1) 124번 에러 발생 
2. chrome.exe 파일 찾기
C:\Users\nh\AppData\Local\Google\Chrome\Application\chrome.exe
==================================================================================================================

- 위기 때마다 현명하게 자산을 지키고 늘리는 방법ㅣ [특강] 홍춘욱 박사[카이로스 북클럽]
https://youtu.be/sExbp-1dog8
==================================================================================================================

- 안경 구입 검토(다초점 렌즈[MIDAS M] , 다비치 안경) 
- 노안 안경이 필요한 분들께 적응이 쉽고 빠른 누진다 초점렌즈 추천!, 다비치 안경[생활리뷰 싹피디]
https://youtu.be/K35RNRbZMk8

- 노안은 30대부터! 다초점, 적어도 이것만은 알고 쓰세요
https://youtu.be/ZNvd75ziysg
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.24(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 오른쪽 무릎 통증 거의 정상 회복(06시, 계단 사용 금지). 퇴근시 비(18시, 우산) m 태풍 '오마이스' 제주도 통과하여 
								소멸(07시, 많은 비[피해 크지 않음]), 

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
21-3. FMCO153R VIP 금융컨설팅 - STEP3) 상담희망일 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMC0153R.view -->/fmco1523o.jsp
 1) 거래코드(AP): CON4100S02(금융컨설팅 상담 예약가능 기간 조회(영업일 조회))
-----------------------------------------------------------------------------------------------------------------------------

21-4. FMCO1524R VIP 금융컨설팅 - STEP4) 상담내용 입력 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMC01524R.view --> /fmco15240.jsp
==================================================================================================================

12. FMSE3100P MY정보 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMSE3000R.view --> /fmse3000r.jsp 
 1) 거래코드(AP): COM2103S01(관심사 리스트 조회 서비스(사용여부 포함))
 
12-1. FMSE3100P 정보 - 나의 관심사 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMSE3000R. View --> /fmse3000r.jsp ==> 나의 관심사 설정 버튼: 클릭 
 1) http://localhost:8088/servlet/FMSE3100P.view --> /fmse3100p.jsp 
  가. 거래코드(AP): COM2103I01(관고객 관심사 등록,수정,삭제 서비스) 
==================================================================================================================

- 코로나 예방 접종 재예약: 3차 
예약자 이름:	진태만
예약자 주민등록번호:	720625 - 1******
예약자 휴대폰번호: 010-3072-0898 
예약번호: 1048480172 ■■
접종받는 분(피접종자) 이름: 진태만
접종받는 분(피접종자) 주민등록번호: 720625 - 1******
1차 예약백신: mRNA(모더나 또는 화이자) 백신
1차 예약 의료기관	의료기관명 : 성모베스트 이비인후과의원[서울특별시 관악구 난곡로 214, (신림동, 금정빌딩) 5층: 02-863-1175]
1차 접종일시: 2021-09-06 / 17:00 ■■
2차 예약백신	mRNA(모더나 또는 화이자) 백신
2차 예약 의료기관	의료기관명 : 성모베스트 이비인후과의원[서울특별시 관악구 난곡로 214, (신림동, 금정빌딩) 5층: 02-863-1175]
2차 접종일시: 2021-10-18 / 17:00 ■■.
==================================================================================================================

- 위기 때마다 현명하게 자산을 지키고 늘리는 방법ㅣ[특강] 홍춘욱 박사ㅣ 카이로스 독서모임 [부자클럽] [카이로스북클럽]
https://youtu.be/sExbp-1dog8
==============================================================================================================

- 주식 장기투자로 망하지 않으려면, 이 3가지 반드시 확인[상승효과TV]
https://youtu.be/RhxZEFjapn8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.25(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 국민연금 추가 출금(24,898,500원) (09시, 신한은행 에서 자동이체됨) 

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
21-0. FMCO1510R VIP 금융컨설팅 - 서비스안내 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMC01510R.view --> /fmco1510r.jsp 
==> 맞춤 컨설팅을 위한 사전 진단(01, 투자성향진단, 02. 연금 정보)
 1) 투자성향 조회 AP 거래코드: COM4201502
 2) 연금진단정보 입력 여부 확인 AP 거래코드: MYP1002502
================================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2021.08.26(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발
40. 자산 (항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 계좌: 클릭 
41. FMAS1310R 입출금 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1310R.view --> /fmas1310r.jsp
 1) 거래코드(AP): ASS1142521(계좌 조회 서비스) --> ASS3101S01
  2) 거래코드(AP): ASS1142523(계좌 상세 조회 서비스) --> ASS3101S02
==================================================================================================================
 
40. 자산(항목별목록) 
http://localhost: 8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 부채: 클릭(2000629820: 로그인) 
41. FMAS1313R 입출금 상세 마이너스통장 ==> ASS1331506 AP 9월 17일 개발 완료 예정 aaaaaaaaaeeee 
1. http://localhost:8088/servlet/FMAS1313R.view --> /fmas1313r.jsp 
 1) 거래코드(AP): ASS1142S21(계좌 조회 서비스) --> ASS3101501 
 3) 거래코드(AP): ASS1331S06(대출 계좌 상세조회 서비스) --> ASS1331S06[/fmas1310ts.java 파일]
==================================================================================================================

40. 자산(항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 보험: 클릭 
42. FMAS1610R 보험 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1610R.view --> /fmas 1610r.jsp 
1-1 : 연금보험, 연금저축보험 연금항목으로 재분류됨으로 LEVEL3 유형명 변경 : 저축·연금보험 > 저축보험
 1) 거래코드(AP): COM2201S23 (최종스크래핑일시 조회 서비스) 
 2) 거래코드(AP): ASS1432S02(보험 상세 조회 서비스) --> ASS1432S02[/fmas1610ts.java 파일] 
 3) 거래코드(AP): ASS1432S04(보험 납입내역 조회 서비스) --> ASS1432S04[/fmas1610ts.java 파일] 
==================================================================================================================

32. FMMY5200R 하나로 가족고객 - 등급 시물레이션 [구) FMRP2200R --> /fair a2200r.jsp] ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMIY5200R.view --> /fmmy5200r.jsp 
==> (등급상승 필요금액 원) == > 완료[♥♡] 
==> 다시 계산하기 버튼 추가 ==> 완료[♥♡] 
==> 추천상품 노출: AP에서 개발 후 통보 해준다고 함 | 
==> MYP6001501: 하나로가족고객 : 등급상승 시뮬레이션 필요금액 산출 ===> ■■■
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.27(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 병가(08시, 김홍석 부장에서 전화: 허락 함)

- 병가[★]
05:00 기상 --> 오른쪽 무릎위 대퇴사두근 손상되어 밤새 잠 못 잠 
05:40 조식
06:00 잠
07:10 기상 
07:20 인터넷 서핑
08:00 김홍석 부장에서 전화: 허락 함
08:44 집출발(자전거): 무릎이 아파서 자전거 제대로 못 탐, 비 조금 옴
09:10 신림 제일정형 외과의원 도착 ==> 진료, 물리 치료: 49,400원
09:50 신림 수 약국 ==> 조제(오른쪽 무릎위 대퇴사두근 손상: 아침, 저녁 5일분): 5,200원
10:20 귀가 
12:00 중식
12:30 인터넷 서핑
12:33 오른쪽 무릎 냉찜질(냉동실에 넣어둔 수건)
18:00 석식
18:20 실내 도보
18:50 종료
19:00 오른쪽 무릎 냉찜질
19:10 인터넷 서핑
22:00 취침
==================================================================================================================

- 무릎 통증(09시, 정형외과)
1. 신림 제일 정형 외과의원 ==> https://place.map.kakao.com/1574828908?service=search_pc
 1) 진료(허영재 원장): 오른쪽 무릎위 대퇴사두근 손상{물 차 있음] --> 주시기 2개로 물 빼기, 물리 치료(얼음 찜질, 열 찜질, 물침대)
==================================================================================================================

- 무릎 통증 사라지는 하루 10분 초간단 운동법 - 김준배의 관절 리모델링 #2
https://youtu.be/zmODmWSc9Kc
1. 전방 통증 증후군
==================================================================================================================

- 무릎[위쪽, 고위] 통증, 아무도 가르쳐 주지 않던 무릎 뼈의 비밀 / 이론편
https://youtu.be/DWGgHjAr6bE
1. 무릎뼈 위쪽과 아래쪽이 아프다면 무릎뼈 고위를 의심해봐야 합니다.
==================================================================================================================

- [슬개골 연골 연화증] 앉았다 일어날 때만 아프니 괜찮다? 무릎 연골 닳았을 수도… 방치하면 퇴행성 관절염까지[헬스 조선]
https://youtu.be/rqFdNFkPXyQ
==================================================================================================================

- 몸속 가득찬 내장지방 싹 없애는 방법 5가지
https://youtu.be/l8b_V5P9kzk
1. 식물성 단백질: 시금치, 브로콜리, 그릭요거트, 렌즈 콩, 병아리 콩, 두부, 청국장, 견과류, 아몬드, 땅콩
==================================================================================================================

-고기말고 단백질 많은 음식 5가지 (고단백 음식 추천) [닥터리TV 다이어트 멘토]
https://youtu.be/Ry1lnBv6SpY
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.28(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
07:00 기상
07:40 조식
08:00 실내 도보
08:30 종료
10:10 인터넷 서핑
12:00 중식
12:30 실내 도보
13:50 종료
13:40 인터넷 서핑
18:00 석식
18:20 실내 도보
18:50 종료
19:00 오른쪽 무릎 냉찜질
19:10 인터넷 서핑
22:00 취침
==================================================================================================================

- 주식투자로 반드시 부자 되는 10가지 비밀, 지금 공개합니다! [상승 효과 TV]
https://youtu.be/tcU5XihZAUk
1. 반드시 현금을 보유하라
2. 살 때는 신중하게, 팔 때는 과감히!
3. 공포에 사고, 환희에 판다
4. 좋은 종목만 사라!
5. 일희일비하지 마라!
6. 뉴스에 무작정 의존하지 마라!
7. 밀짚모자는 겨울에 사라!
8. 주식은 카사노바처럼!
9. 본전심리가 계좌를 망가뜨린다!
10. 돈을 잃지 마라!
==================================================================================================================

- 노션(NOTION) 분석
- 쉬운 콘텐츠 정리, 공유, 협업[피터의 커뮤니케이션 한창훈]
https://youtu.be/oAT2qj_EQq8

- 노션 입문자, 이 영상 하나로 OK! | 협업툴 | NOTION[스타트업잡스]
https://youtu.be/UHHTFlE93ag

- 노션(Notion) 무료 특강[경험수집 잡화점]
https://youtu.be/5teyq_P_3KA

- 노션 활용하기 1. 메인페이지
https://youtu.be/WpKGem32RvE

- 유료결제 No! 대학생, 직장인의 공부, 업무 관리, 데이터 관리 스마트하게 하는 법 with Notion[방구석 리뷰룸]
https://youtu.be/Dl8-V_B9P4k
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.08.29(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★]
07:00 기상
07:40 조식
08:10 실내 도보
08:50 종료
09:20 인터넷 서핑
12:00 중식
12:20 실내 도보
13:20 종료
13:40 인터넷 서핑
17:00 집출발(자전거)
17:20 다이소 난곡사거리점 방문 ==> 치약 3개(3,000원), 김(12봉: 3,000원) 구입
17:30 신사시장 진흥마트 옆 가게 ==> 오이: 다 팔림:  
17:50 귀가
18:00 석식
18:20 실내 도보 
19:30 종료
19:49 인터넷 서핑
22:00 청소(청소기, 밀대)
22:30 샤워
22:40 취침
================================================================================================================

- 모바일로 달러통장 만드는 법[재테크하는 아내, 구채희]
https://youtu.be/4fvSLpyQT8U
--------------------------------------------------------------------------------------------------------------------------------

- [상품지식] 달러투자 방법 총정리[박곰희 TV]
https://youtu.be/Mcjhjgh50Is
1. 달러예금
2. 국내 달러 ETF
3. 미국달러 ETF
4. 달러RP 
 1) 미래에셋: 0.24(수시형), 1년(0.8)
 2) 대신증권: 0.3(수시형), 1년(1.0) ==> 추천 ■■■
5. 달러발행어음
 1) 한국투자증권: 0.6(수시형), 1년(1.6), 최소 투자금(1,000달러) ==> 추천 ■■■
--------------------------------------------------------------------------------------------------------------------------------

- 달러투자로 돈을 버는 가장 현실적인 방법. 추천 달러상품 3가지 (ft.홍춘욱 박사)
https://youtu.be/HSEMJC7Zd5A
================================================================================================================

- 진수종 태블릿 PC 구입
1. 갤럭시 Tab S6  라이트 10.4 WiFi 64GB [해외쇼핑], 370,780원[TV 시청용]: 북커버 미 포함
http://prod.danawa.com/info/?pcode=11848150&keyword=%EA%B0%A4%EB%9F%AD%EC%8B%9C+Tab+S6++%EB%9D%BC%EC%9D%B4%ED%8A%B8&cate=12210596
https://www.11st.co.kr/products/3348687186?&xfrom=&xzone=
================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.30(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 오이(10묶음[개당 4개]; 총 40개) (19시, 신사시장 진흥마트 옆 가게: 자전거)

- 농협 PFM 고도화 Prj[★]
- PFM 고도화 2차 개발 
40. 자산 (항목별목록) 
http://localhost:8088/servlet/FINAS1100R.view --> /fmas1100n.jsp [수정] ==> 계좌: 클릭 
41. FMAS1310R 입출금 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1310R.view --> /fmas1310r.jsp 
 1) 거래코드(AP): ASS1142521(계좌 조회 서비스) --> ASS3101501 [/fmas1310ts.java 파일 수정]
 2) 거래코드(AP): ASS1142523(계좌 상세 조회 서비스) --> ASS3101502 [/fmas1310ts.java 파일 수정]
 3) 거래코드(AP): ASS1142522(입출금 거래내역 조회 서비스) --> ASS3101503[/fmas1311ts.java 파일 수정]
================================================================================================================== 

40. 자산 (항목별목록) 
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 실물 --> 부동산 1개: 클릭 
44. FMAS1811R 부동산 목록(사용 안함 @@@) 
http://localhost:8088/servlet/FMAS1811R.view --> /fmas1811r.jsp ==> 부동산명: 클릭

44, FMAS1812R 부동산 상세 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1812R.view --> /fmas1812r.jsp 
 1) 거래코드(AP): COM2201503 (최종스크래핑일시 조회 서비스) 
 2) 거래코드(AP): ASS1611S24(실물: 부동산 상세 조회 서비스) --> ASS3701502[/fmas1310ts.java 파일 수정]
 3) 거래코드(AP): ASS1611s25 (실물: 부동산 대출계좌 조회 서비스) --> ASS3701503[/fmas1310ts.java 파일 수정] 
2. Header명 변경, 2. 상단 영역 수정, 3. 주요 정보 추가, 4. 상세 정보 수정 (단지 정보 보기 팝업 버튼 추가) 
.nhasset .value_02{color:#7e858e;} /* 글자색 변경(글자색)[2021.09.01, by 진태만] TEST @@@ ===> */
-----------------------------------------------------------------------------------------------------------------------------

45. FMAS1812P 단지 정보 [신규] ==> 수정 중[☞☜]
1. http://localhost:8088/servlet/FMAS1812P.view --> /fmas1812p.jsp 
 1) 거래코드(AP): ASS3701S06: 실물 : 단지 정보 조회 서비스
==================================================================================================================

47. FMAS1814R 부동산 정보 수정 [자가] 
1. http://localhost:8088/servlet/FMAS1814R.view --> /fmas1814r.jsp --> 수정 버튼:
 1) 거래코드 (AP): ASS1611001 (실물 : 부동산 정보 수정 서비스)
==================================================================================================================

47. FMAS1814R 부동산 정보 수정 [전세]
1. http://localhost:8088/servlet/FMAS1814R.view --> /fmas1814r.jsp
 1) 거래코드(AP): ASS1611001(실물 : 부동산 정보 수정 서비스)
==================================================================================================================

48. FMAS1818R 기타 부동산 상세 ==> 완료[♥♡] 
1. http://localhost: 8088/servlet/FMAS1818R.view --> /fma1818r.jsp 
 1) 거래코드(AP): ASS1611504 (실물 : 부동산 상세 조회 서비스) 
2. Header명 변경, 2. 상단 영역 수정, 3. 주요 정보 추가, 4. 상세 정보 수정(단지 정보 보기 팝업 버튼 추가)
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.08.31(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 오전부터 비(08시, 퇴근할 때 비 많이 옴: 옷 젖음

- 농협 PFM 고도화 Prj[★]
00. FMAS1352R 외화 상세 적금 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMAS1352R.view --> /fmas1310r.jsp 
-----------------------------------------------------------------------------------------------------------------------------

- 에러 발생
1. 현상:
2: Servlet.service() for servlet jsp threw exception
 org.apache.jasper.el.JspPropertyNotFoundException: /WEB-INF/jsp/service/fm/as/fmas1352r.jsp(533,6) 
 '${itemDetailList.ANW_DT}' Property ANW_DT' not found on type java.lang.String
at org.apache. jasper.el. JspValueExpression.getValue() spValueExpression.java:104)

2. 원인: ass1142523List을 JSON으로 변환방법 변경에서 에러가 남
public IDataSet getDPIDPAccountInfo(IDataset dataset, IBizServiceContext context) throws Exception {
	System.out.println("[/fmas1313ts.java] (getDPIDPAccountInfo()] ==> (TEST_01] [예적금 계좌 상세, 거래내역 조회]");
	
	data = NHBMapUtil.getMapobject( super.send(dataset, context, "ASS3101502")); 	// 계좌 상세 조회 서비스 수정
	NHBListutil ass1142523List = NHBListUtil.getListObject(data.get("data")); 
	// dataset.getOut().setValue("ASS1142523_List", NHBListutil.parselistToJson(ass1142523List.getList())); 
	// 21. 8. 17. 23 3:04 4 CS519998 json 변환방법 변경 @@@@
	
	dataset.getOut().setValue("AS51142523 List", ass1142523List.getList()); 	// 수정[2021.08.26, by 진태만]
	System.out.println("[/fmas1310ts.java] [getDPIDPAccountInfo() ==> [T_51] [계좌 상세 조회 서비스 수정] "+ ass1142s 23List.getList() );
} 
================================================================================================================== 

00. FMAS1312P 조회조건 설정(/fmas1312p.jsp) ==> 완료[♥♡]
41. FMAS1310R 입출금 상세
1. http://localhost:8088/servlet/FMAS1310R.view --> /fmas1310r.jsp ==>조회 조건 클릭
 1) 조회 조건에 금융자산번호(FNC_ASET_NO) 필드 추가
================================================================================================================== 

- 20분만에 혈당 확 낮추는 당뇨 운동법 (feat. 짜장면) [당뇨관리 닥다TV]
https://youtu.be/2veZs-X58kw
==================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
1. OX ↑↓ ↔  ⇒ ⇔  ==> 완료[♥♡]  ==> 개발 중[☞☜]＃＆＠ § ※ ☆ ★ ○ ●◎ ◇ ◆ □ ■△ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣
