

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.05) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.05.01(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★]
06:37 기상
07:00 조식
07:30 실내 도보
08:30 종료
08:50 Memo(2021.03) OCR 편집 작업 
12:00 중식
12:30 집출발(반바지)
12:30 도보 ==> 보라매공원에서 트랙 도보
13:45 귀가
13:30 종료
14:00 Memo(2021.03) OCR 편집 작업
15:00 낮잠
15:00 낮잠
18:05 기상 
18:17 Memo(2021.02) OCR 편집 작업
19:00 석식
19:30 실내 도보
20:30 종료  
20:30 Memo(2021.02) OCR 편집 작업  ==> 완료[♥♡]
23:00 2014년 4월 가계부 월말 결산 처리
23:30 종료
23:35 취침
==================================================================================================================

- 비밀번호(암호) 변경 패턴[2021.05.01(토)]
1. 2020오*h@ --> 2020오*ss@[공인인증] [사용중]
2. 30육*h@ --> 마이크로소프트[사용중]
3. 11사십하나@ ===> 새로 사용할 것 @@@
3. 21오십하나@ ===> 새로 사용할 것 @@@
4. 31육*하나@
5. 41칠*하나@
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.05.02(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:16 기상
06:42 조식
07:00 실내 도보
08:40 종료
09:20 01. WS 전환 OCR 편집 작업
12:00 중식
12:30 집출발(반바지) 
12:30 도보 ==> 보라매공원에서 트랙 도보
13:45 귀가
13:30 종료
14:00 인터넷 서핑
14:30 집출발(자전거) 
15:10 이마트 구로점 ==> 카트(없음): 이마트 구로점 공사중(어수선함)
15:30 다이소 남구로점 ==> 실내화(260, 3천원), 과탄산소다(2천원), 안마 망치(2천원) 구입
15:50 소금창고 ==> 아다바트 반팔 티셔츠(29,000원), 코오롱 스판텍스 바지(43,000원, 32인치) 구입
16:10 수아 수선 ==> 바지 기장 수선(3천원)
16:40 귀가
17:00 01. WS 전환 OCR 편집 작업
19:00 석식
19:30 실내 도보
20:30 종료
20:40 청소(청소기, 밀대)  
21:00 01. WS 전환 OCR 편집 작업
23:35 01. WS 전환 OCR 편집 작업  ==> 완료[♥♡] 
23:40 샤워
23:30 종료
23:35 취침
==================================================================================================================

- 디블록스 아다바트 남성 앞주머니 카라 반팔 티셔츠, 가격: 33,610원
http://www.enuri.com/detail.jsp?modelno=65914024
==================================================================================================================

- 묵은 뱃살 내장지방 이렇게 했더니 쫙~ 빠졌다
https://youtu.be/796xiWGPX4c
==================================================================================================================

- 초간단 막힌 세면대 , 배수관 찌든때 청소 주의사항은 아셔야 합니다.[과탄산소다]
https://youtu.be/ba_pIcrKZcs

- 누구나 손쉽게 세면대 뚫는법 - 도구 없이도 세면대 막힘 해결!
https://youtu.be/FRBJYIiftTk
==================================================================================================================

- EBS 명의] 당신의 어깨가 아픈 이유 - 어깨 통증
https://youtu.be/W3hGAIZsYwA
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.03(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 농협 PFM 고도화 Prj 투입(07:45, 농협IT센터(인덕원역 근처)): LG 모니터(M2450D-PN) 카트에 싣고 감
								, 갤럭시 Tab S6 라이트 도착(17시, 해외 배송인데 1주일 만에 빨리 도착)

- 농협 PFM 고도화 Prj[★] 투입
05:00 기상
05:40 조식
06:15 집출발(백팩(노트북 미지참), 카트에 LG 24인치 모니터 싣고 출발)
06:30 남서울중학교 정류장(9-3번 버스 탑승)
07:10 인덕원역 8번 출구 정류장 하차
07:50 인덕원역 1번 출구 ==> 양지천 ==> 양지천3교 ==> 농협 IT센터 도착 
07:55 농협 IT 센터 도착
08:40 고객 접견실: (주)한국유투더블유 이호준 이사 만남 
09:10 SK C&C 조현준 수석(영업관리) 만남 ==> 출입증 수령 
09:20 농협 IT 부서 임주현 계장 만남 ==> 출입 처리 
09:25 모니터 맡기기 : 결재가 안남
09:30 농협 IT센터 8층 ==> 자리 잡음 
10:30 SK C&C 문태기 수석 (PM) 회의: 프로젝트 관련 브리핑D
		==> 1. 8월 4일 1차 오픈: 스크래핑 --> 오픈 API, 2. 10월 16일 2차 오픈: 신규 서비스 추가 
11:30 중식(김밥[GS 25 편의점])
11:50 도보(양지천 --> 청계산 입구 --> 학의천 --> 인덕원교 --> 양지천)
12:50 종료
13:00 LG 24인치 모니터 수령 ==> 내자리에서 환경 설정 --> 18인치 모니터 1댄 지급 받음(RGB 케이블) 
13:30 LG 24인치 모니터 받침대 설치(드라이버 가지고 감) 
13:35 LG 24인치 모니터 연결: PC ==> LG 모니터 연결: DVI --> 신형 케이블(사용함)
13:40 회의 (김홍석 PL): 간단한 업무 설명 
13:50 종료
==================================================================================================================

- NH PMS 
1. 경로: ==> http://16.24.86.45:8868/nhpms, CS523262/nacf1234 --> 11사*하나@
==> 프로젝트 선택(새창)
1. 성명: 진태만 
2. 회사명: (주) 한국유투더블유
---> 참여하고 있는 프로젝트가 없거나 미승인 상태입니다. ==> 권영진 선임에서 조치 요청
 1) 참여 프로젝트 : 개인종합자산관리 서비스 [NH자산+] 고도화 전산개발 요청
 ==================================================================================================================

- 계정 관리시스템 OTP 발급
1. 경로: ==> https://16.24.87.59/IMUS/
2. 사용자 등록: C5523262, 11사*하나! 
==================================================================================================================

- META
1. 경로 ==> http://16.24.55.127:9650/main.do, : C5523262/nacf1234 --> 11사*하나@
==================================================================================================================

- 비밀번호 관리시스템 
1. 경로 ==> https://16.24.87.61:8443, C5523262/11111 
--> 11사*하나@ ==> OTP 인증(핸드폰 > NHB OTP: 123456 6자리)
==================================================================================================================

- PC 지급 받음
1. 원성욱 부장이 사용했든 PE --> 새로 포맷 안하고 추가 설치 
==================================================================================================================

3. 농협 PFM(개인자산종합관리)고도화] 개발 완료 후 고도화
- 기간: 5월1일 ~ 10월31일(6개월)
- 업무: PFM 서비스 개발(Personal Finance Management)
- 등급: 중고급 2명
- 기술: Java
- 장소: 의왕 농협IT센터
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.04(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 아침부터 비 조금 옴(12시, 농협 IT센터 실내도보), 퇴직연금 IRP 계좌 개설(12시, NH농협IT센터<출>)

- 농협 PFM 고도화 Prj[★]
- SW 설치 
==================================================================================================================

- Local 개발 환경 설정
0) 사전 준비
- SVN 계정 및 기타 개발관련 서비스 계정은 PMO를 통해 고객사 요청하여 발급 
- 개발PC --> DB, AP 방화벽은 PMO를 통해 고객사 요청하여 해제 
1) NSWP F/W 개발환경 구성 필요 소프트웨어 수급
- NSWP 어드민 ==> http://16.24.116.93:39770/xonm/
==================================================================================================================

- UltraEdit 사용법 
1. 배경색 설정 
 1) 메뉴 ==> 보기 (V) ==> 테마(m) ==>
  가. Slate(검정 배경, 흰색 글자, 연두색 특수 문자) [강추]
  나. Twilight(검정 배경, 흰색 글자, 주황색 특수 문자) 
 2. 글자 설정 
 1) 메뉴 ==> 보기 (V) ==> 글자(V) ==> 글자(F): 함초롬돋움, 글꼴 스타일 (V): 보통, 크기(S):11 
3. 울트라 에디트에서 창 수직 배열 설정 
 1) T_01.sql, T 02.591 파일 열기 
 2) T_02.sql 파일 Tab을 마우스로 끌어서 사각형 선이 생성되면 오른쪽으로 끌어서 놓기
4. 울트라 에디트에서 프로그램 2개 실행 
 1) 메뉴 ==> 고급(A) ==> UltraEdit-32를 새로 시작: 클릭
 2) UltraEdit가 새로 실행됨
 3) 메뉴 ==> 프로젝트(P) ==> 01. 농협 PFM 고도화 Pri(이미 만들어진 프로젝트 파일): 클릭
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.05(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 어린이날(공휴일)

- 어린이날[★]
06:00 기상
06:40 조식
07:00 실내 도보
08:00 종료
08:10 WS 예제 OCR 편집 작업
12:00 중식
12:30 집출발(반바지)
12:30 도보 ==> 보라매공원에서 트랙 도보
13:45 귀가
13:30 종료
14:00 WS 예제 OCR 편집 작업
17:50 집출발(반바지) ==> 네파 네파 남성 노르차 고어텍스(7G57644) 처음 신고 걷기(발이 편함)
18:00 돌아온 돼지사냥(삽겹살집) 도착 ==> 태용 만남
18:10 석식(삽겹살, 냉면, 맥주[돌아온 돼지사냥]): 태용 ==> 4만원(내가 쏨) 
18:45 종료 
18:50 집출발(반바지)
19:00 도보 ==> 보라매공원에서 트랙 도보 
20:00 종료  
20:10 WS 예제 OCR 편집 작업 ==> 완료[♥♡]
23:30 종료
23:35 취침
==================================================================================================================

- vFlat(PDF 스캔 앱) 어플 사용법
1. 사진 촬영
 1) 갤러리에 자동 저장되도록 설정
 
2. 내보내기
 1) 라이브러리 ==> 기본폴더 ==> 기본폴더(화면) ==> 내보내기(하단): 클릭
   가. Text 파일(.txt): 클릭 ==> 모두 선택 --> 문자인식 먼저 진행 ==> 텍스트 내보내기(OCR 작업)
   
3. 내보내기 확인
  1) 내장메모리 >> Documents >> vFlat >> txt 폴더에서 내보낸 파일(2개) 확인
    
4. 공유
  1) 공유 >> 항목 선택(전체) >> 공유 ==> OneDrive
   ==> 99. TEST[■]\
    -->  C:\Users\Administrator\OneDrive - 서울대동초등학교\99. TEST[■] --> 공유된 파일(2개) 확인
	
5. PC에서  공유된 파일(2개)을 편집 작업
==================================================================================================================

- 태용 재건축 예정 아파트 구입
1. 경기도 덕소에 재건축 아파트 구입: 현금 4억 정도로 살수 있는 재개발 빌라 산거임. 
 1) 추가분담금 2028년 집주 때만 내면 10억정도 될것으로 판단

- 덕소 뉴타운, 소액투자 가능한 경기도권 재개발 구역 [6시 내구역/투미TV]
https://youtu.be/dyDJkdecsrs
==================================================================================================================

- 병의 90%는 걷기만 해도 낫는다(나가오 가즈히로) [책한민국]
https://youtu.be/dOsvB0W88j8
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.06(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> PC 조립 분석(21시, 집), 과탄산소다 사용하여 막힌 세면대 뚫음(21시, 집): 깨끗하게 뚫림, 만족, 처음 사용

- 농협 PFM 고도화 Prj[★]
- 로그 
logger.debug("[/Test.java] [ddd()] ==> [TEST_01]"); 
System.out.println("[/Test.jsp] [ddd()] ==> [TEST_01]"); 
devConsole.log("[/fummy5200r.jsp] ==> [TEST_01] [T 화면_21] [ [TEST_98] ========> ");
==================================================================================================================

- 화면 서비스 개발 교육(10시, 회의실1, 장석민 수석)
1. 개발 전반에 대한 교육
==================================================================================================================

- UNIX계정 사용신청
1. 개발 Web, Linux ==> nbeffmltwb02, efmswas, 16.16.132.51, sh, sftp 
1. 업무팀 담당자: 임소현 (IT마이데이터추친팀 계장(5급)) 
3. 업무팀 기획역: 장진호 (과장) 
4. 업무팀 팀장: 장마리(단장) 
5. 업무내용: PFN 고도화 개발을 위한 계정 필요
==================================================================================================================

- DBSafer 사용신청 
1. MS, Oracle ==> nbmifmotdb01 NBMIFMT, MIMS SEL, 16.24.149.61 
2. MY #1, Oracle Exadata ==> lnbmimyxtdb01_NBMIMYT1, MIMY_SEL, 16.24.149.83 
3. MY #2, Oracle Exadata ==> nomimyxtdbo2_NBMIMYT2, MIMY_SEL, 16.24.149.84
==================================================================================================================
 
- 모니터 교체 
1. 18인치 구형 모니터에서 24인치 삼성 모니터(FULL HD)로 교체해줌
==================================================================================================================
 
- eclipse 설정 에러 ==> 사용 안함 
1. 현상: The archive: /XEFFM/lib/antir-runtime.jar which is referenced by the classpath, does not exist. 
2. 원인: C: \NSWP PLATFORMAworkspaces\project-workspace\XEFFM 폴더 삭제한 후 나타나는 현상 
3. 조치: antir-runtime.jar 파일을 classpath에 추가할 것: 사용 안함 ==> readme.txt 파일에서 하라는 것만 하면 됨 
1) Servers ==> XEFMS 서버 (신규) ==> overview (Main 화면) --> Open launch configuration ==> Edit Configuratt
1. Classpath Tab --> Classpath --> User Entries --> Add External JARs: ES
 가) antlr-runtime.jar 파일 추가 --> C: ANSMP PLATFORM Morkspaces\project-workspace\XEFMS \lib 폴더에 해당 파일을 넣어 둠 
 나) jna.jar 파일 추가
 다) sequence.jar 파일 추가
 라) sqljet.jar 파일 추가 
 마) svnkit.jar 파일 추가 
 바) svnkit-javahl.jar 파일 추가 
 사) trilead.jar 파일 추가
==================================================================================================================
 
- 개발자 미팅(15시, 커피숍 최수경 수석)
1. 개인 소개: 최수경 수석이 커피 씀
==================================================================================================================

- 농협 프로젝트에서 지급 받은 모니터 정보(사업장[NH 통합IT센터 8층]에서 사용)
- 사용자명: 진태만
- 모델명: S24R350FH
- S/N번호: BZUNH4TR401954M
- 제조년도: 2021.04
- 식별부호: R-R-SEC-S24R350FH
- 삼성전자 LED 모니터 ==> http://www.enuri.com/search.jsp?keyword=S24R350FH
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.07(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 오전에 비(12시, 도보(양지천 - 청계산 입구 -> 학의천 -> 인덕원교 -> 관양교 - 양지천))

- 농협 PFM 고도화 Prj[★]
- 영업점 찾기 소스 분석 
1. FMCO1526.service: 영업점 찾기 종류 선택 팝업
 ==> /fm/co/fmco1526r.jsp
==================================================================================================================

- FMCO1100R.Service: 서비스 이용 안내 
==> defaultPageViewController, /fm/co/fmco1100s.jsp --> /fmco1100ts.java
==================================================================================================================

- common-base.js 파일에서 
devConsole = console;
gcm = console; 	// TEST console gcm 추가[2021.05.07, by 진태만] 
console = {}; 	// 운영 console 막음
==================================================================================================================
 
- SVN 로그인 정보 
1. CS523262/1111
==================================================================================================================
 
- 개발자 회의(10시, 회의실2, 김홍석 PL) 
1. 다음주 개발 시작 ==> 1차 개발 완료(5월 28일(금)) 
 1) 개인별 업무 분장(각 파트 전임자가 분배)
 2) 공통 이정한 차장이 업무 분배해줌
==================================================================================================================
 
- Sublime Text(편집기) 설치 및 설정 
1. 화면 반으로 나누기: 윈도우 + 방향키 2. 배경 설정
 1) 메뉴Tab(상단) ==> Preferences ==> Color Schema --> Mariana
==================================================================================================================
 
- 자바 디버깅 
1. 손가락 
F5: 계지(새끼 손가락) --> Step In 
F6: 약지 --> Step Over[한줄 씩: 디폴트] 
F7: 중지 --> Step out ) 
F8: 검지(집게 손가락) --> Next Break Point
==================================================================================================================
 
- 포트 사용 여부 확인 및 죽이기 
1. 현상: Several ports (8088, 8009) required by Tomcat v6.0 Server at localhost are already in use. 
2. 조치: 
C:\Users\CS523262> netstat -ano | findstr "8088 8009" 
프로토콜 	로컬 주소			외부 주소		상태 					PID
TCP 			0.0.0.0:8009		0..00.0:			LISTENING		54544
TCP 			0.0.0.0:8088		0..00.0:			LISTENING		54544
 
C:\Users\CS523262> taskkill -F /PID 54544
C:\Users\CS523262> netstat -ano | findstr "8088 8009" 프로토콜 로컬 주소 
==================================================================================================================
 
- 개발도구와 서브라임텍스트 (생활코딩 작심40시간)
https://youtu.be/HcgxWOvqBBY
==================================================================================================================

- 서브라임 텍스트3(sublime_text) 설치
https://jeonghakhur.gitbooks.io/sublime-text3/content/project.html
---------------------------------------------------------------------------------------------------------------------

- 서브라임 텍스트 폰트 변경 하는법
https://spacemonkey925.tistory.com/67

- 10 Color scheme 추가 적용
https://youtu.be/faraAhw8TJI

- daylerees/colour-schemes
https://github.com/daylerees/colour-schemes
================================================================================================================== 

- 서브라임 텍스트(sublime_text) Setting
{
	"color_scheme": "Packages/Color Scheme - Default/Mariana.sublime-color-scheme",   // 01. 컬러 테마 추가
	"font_face": "Bitstream Vera Sans Mono",	 // 02. 글꼴 추가[font 셋팅]
	"font_size": 10,							 // 03. 글꼴 크기 추가
	"theme": "Default.sublime-theme"			 // 04. 테마
	}
------------------------------------------------------------------------------------------------------------------

{
	"color_scheme": "Packages/Color Scheme - Default/Mariana.sublime-color-scheme",		// 컬러 테마 추가
	"font_face": "함초롱돋움",					 // 글꼴 추가
	"font_size": 10,									// 글꼴 크기 추가
	"theme": "Adaptive.sublime-theme",	// 테마 추가
	"line_numbers": false			// 줄번호 추가
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.08(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:50 기상
05:10 조식
05:43 집출발: 백팩(델 27인치 모니터, 바지[뒷주머니 수선], 실내화 아령 3kg, 멀티탭(2개)) ==> 짐 엄청 무거움
05:50 남서울중학교 정류장 도착
05:52 643번 버스 승차
06:20 서울 강남터미널 하차
07:20 포항행 고속버스 승차 ==> 어버이날 용돈 30만원 송금
11:20 포항 고속버스 터미널 도착
11:25 고속버스 터미널 정류장(209번 버스 승차)
11:40 두호동 주민센터 하차
11:45 포항집 도착 
12:10 중식
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대
14:00 귀가
14:10 낮잠
18:00 기상
18:10 큰누나 차 탑승(매형, 령경, 엄마, 수종)
18:40 솔향기 오리촌 도착
18:44 석식(오리 볶음, 볶음밥): 큰누나가 쏨
19:30 종료
19:40 큰누나 차 탑승(매형, 령경, 엄마, 수종)
20:00 송도해수욕장 도착(공사중): 도보
20:50 카페베넷: 망고 아이스크림(수종이와 같이 먹음): 큰누나가 쏨
21:30 종료
21:40 귀가(큰누나 차)
22:00 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 화장실 --> 환호공원 앞 등대 --> 귀가
23:00 귀가
23:20 취침
==================================================================================================================    

■■■■■■■■■■■■■■■■■■ 2021.05.09(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 16:30 ==> 

- 주말2[★]
07:30 기상
07:40 조식
08:00 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대
09:00 귀가
11:00 다이소 두호점 ==> 철사, 반찬통, 멀티탭(2구, 3M): 5천원
11:30 귀가
12:00 중식
12:30 도보: 영일대 해수욕장 --> 포항 여객터미널 등대 --> 환호공원 앞 등대
13:50 귀가
14:00 TV 시청
16:00 석식
16:30 집출발: 백팩(반찬 4개, 쑥덕 3개) ==> 짐 엄청 무거움
17:15 고속버스 터미널 도착
17:30 포항 출발
22:20 서울 강남터미널 도착(4시간 50분 걸림) ==> 어버이날 연휴라 엄청 막힘
22:48 서울 강남터미널 정류장 도착(643번 버스 승차)
23:15 남부초교 정류장 하차
23:25 귀가
24:40 청소, 샤워
04:45 취침
05:00 기상
================================================================================================================== 

- 애플펜슬 짭플펜슬 안드로이드 태플릿호환 터치펜 001, 가격: 18,720원
http://www.enuri.com/detail.jsp?modelno=53588743
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B842764885&frm3=V2
================================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2021.05.10(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 오전에 비(12시 중식 후 실내 도보) 

- 농협 PFM 고도화 Prj[★]
- 로그인 화면(/index.jsp) 분석
1037826119/tama339 ==> C:\home\efmswas\temp_pw_storage \1037826119.def 
1025885779/12345 ==> C:\home\efmswas\temp_pw_storage \1025885779.def 
 [/tempLoginM.jsp] [TEST_02] [callType]-[고객번호] 1025885779[임시 비밀번호] 12345[유입채널설정] 385
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.05.11(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>

- 농협 PFM 고도화 Prj[★]
- Setting(Sublime Text3 SW에서)
{
	"color_scheme": "Packages/Color Scheme - Default/Mariana. sublime-color-scheme", 
	// 배경색 테마 추가[2021.05.10, by 진태만]
	 "font size": 11, /글꼴 크기 추가[2021.05.10, by 진태만] 
	 "font face": "함초로 돋움, // 글꼴 추가[2021.05.10, by 진태만] 
	 "theme": "Adaptive. sublime-theme", // 테마 추가[2021.05.10, by 진태만] 
	 "default encoding": "UTF-8", // UTF-8 코딩 추가 [2021.05.10, by 진태만] 
	 "line_numbers": false // 줄번호 제거 추가[2021.05.10, by 진태만]
 }
==================================================================================================================
 
- 영업점 찾기 
- FMICO1526.Service: 영업점 찾기 종류 선택 팝업 
==> /fm/co/fmco1526r.jsp
==================================================================================================================
 
- FMCO1100R.Service: 서비스 이용 안내 
==> defaultPageViewController, /fm/co/fmco1100s.jsp --> /fmco1100ts.java
==================================================================================================================
 
- 박준영 부장(한국 U2M(수석 컨설턴트) 면담(15:30, 커피숍)  
1. 정병귀 부장, 원지은 차장과 함께: 박준영 부장이 씀
  1) 창가 믹스 커피 먹어도 된다고 함, 년차 눈치 것 사용하라고 함 
  2) 야근때 이용할 식당(고봉민 김밥인 의왕 포일점) 지정해줌 
==================================================================================================================
 
- 엑셀 VBA 실무 TIp - VBA 완벽 암호해제 그리고 암호변경도 절대로 악용하지는 마세요!!
https://youtu.be/l9Hukv0H25k
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.12(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 네파 운동화 깔창 추가(06시, 편안함), 어머니 코로나 예방 접종 2차 (05.18(화) 09:20 조양 아파트 2차 앞, 신분증)

- 농협 PFM 고도화 Prj[★]
- 산출물 분석 
NHPFM_04 화면설계서 설정_v0.042_20210507.pptx
==================================================================================================================
 
- 로그인 화면 (indexm.jsp) 
1. 자산관리 통합메인(/fmma1000r.jsp)으로 화면 이동 
 1) instance.properties 파일에서 
# MS.AP.URL 수정 [TEST용) [2020.05.12, by 진태만]
# MS.AP.URL=http://16.24.147.100:9000/api/ 
# MS.AP.URL=http://16.24.147.100 : 8000/api/
==================================================================================================================
  
- 이클립스에서 자바 디버깅하기
https://youtu.be/6ONHEclZDYc

- eclipse debugger 사용법
https://youtu.be/yqtBICKYD-A
-----------------------------------------------------------------------------------------------------------------------------

- 자바 디버깅 단축키(eclipse ==> Debug 사용)
F5 - Step Into : 해당 라인을 실행. 단 현재 라인에 함수가 포함되어 있다면 그 함수 속으로 들어간다. (함수 속으로 들어가기)
F6 - Step Over : 해당 라인을 실행. 함수가 있어도 실행 후 다음으로 넘어간다. ==> 디폴트 테스트 모드.
F7 - Step Return : 현재 함수의 끝까지 실행하여 현재 함수를 벗어난다. (함수 속으로 나가기)
F8 - 다음 break point 까지 한번에 실행
-----------------------------------------------------------------------------------------------------------------------------

- 자바 디버깅 
1. 손가락 
F5: 계지 (새끼 손가락) --> Step In 
F6: 약지 --> Step Over[한줄 씩: 디폴트] 
F7: 중지 --> Step Out 
F8: 검지(집게 손가락) --> Next Break Point
==================================================================================================================

- SVN 설정 
1. XEFMS ===> URL: svn://efmatus51/ xsvn/XEFMS, CS523262/1111
 ==================================================================================================================

- 텍스트 파일 복호화
1. 일반 텍스트 CV(기존기능) 
--> Sheet1내 텍스트 박스내 CV하고 [텍스트 파일생성] 버튼 클릭.
 ==================================================================================================================
 
- TX3070을 품은 HP 오멘 OMEN 30L 게이밍 데스크톱
https://youtu.be/SDhlBIrBeuY

- HP OMEN 30L GT13-0849KR, 가격: 2,848,760원, 최저가 현금: 2,690,000원
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.13(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 의왕 포일 습지 도보 (09시, 양쪽 다리에 풀독 도보 자제할 것, 날씨 기온 30도 무더위 심각), 농협 PFM(개인 자산 
								종합관리) 고도화 프로젝트 계약서 작성(14시, 나일도 이사, 1층 접견실, 월 730만원: 월말에 단가 지급)
 
- 농협 PFM 고도화 Prj[★]
- 설정 / 이용약관 (목록) (/fmse6000p.jsp) 화면 
1. 51. 942 Svt ==> http://localhost:8088/servlet/FMSE6000P.view
==> FNSE6000P. 설정 / 이용약관 (목록), FNSE6000R: 설정 / 이용약관(상세) --> 거래코드: CFG1301501, CFG1301502
 ==================================================================================================================
 
- 서비스 이용약관(/fmse6100r.jsp) 화면 
1. 52. 서비스 약관 Svt ==> http://localhost:8088/servlet/FMSE6100R.view
==> FMSE6100R: 서비스 이용약관
-----------------------------------------------------------------------------------------------------------------------------

- 이용 설명서 (목록) (/fmse6200p.jsp) 화면 
1. 53, 이용 설명서 (목록) svt ==> http://localhost 8933/servlet/FMSE6200P.view 
==> FMSE6200P: 이용 설명서 (목록) --> 거래코드: MICEG1301501
-----------------------------------------------------------------------------------------------------------------------------
 
- 개인정보수집이용동의서(필수) (목록) (/fmse6300p.jsp) 화면
1. 54. 정보수집 (필수) Svt ==> http://localhost:8088/servlet/FMSE6300P.view 
==> FMSE6300P: 개인정보수집이용동의서(필수) (목록) --> 거래코드: CFG1301501, CFG1301502
==================================================================================================================

- /XEFMS/src/main/resources/META-INF/properties/gemini.properties
##########################################
#CHANNEL SETTING 
########################################## 
#AP CHANNEL SETTING 
AP.CHANNEL ID=MS CHANNEL
 ==================================================================================================================
  
- 수정 @@@ 
private String sendHttp (String channelName, IDataSet dataset, IBizServiceContext context, 
	String serviceId) throws Exception {
	System.out.println("[/EfmsBaseService.java] [sendHttp()] ==> [TEST 01] [Http Components를 통해 PFM AP 호출");
	
	apBaseUrl = PropertiesHelper.getProperty("PFM.AP.URL"); 	// BaseUrl를 FM.AP.URL로 변경
	[2020.05.12, by 진태만] ===>개발 TEST 후 제거할 것 @@@ ===> 
)
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.14(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> (주) 지아데이타 지출결의서_진태만(2021.02, 03, 04): 하나손보Prj: 94,010원 입금 완료[송금 받음]

- 농협 PFM 고도화 Prj[★]
<script type="text/javascript">
	gcm.log(""); gcm.log("");
	gcm.log("[/fmco1120p.jsp] ==> [TEST_01] [자산관리 이용동의 약관 화면_@@@]t/FMSE6000P.view" );
 
	var terms = JSON.parse(decodeURIComponent("${REQUEST_MAP. terms}")); 	// 조회 결과
</script> 
==================================================================================================================

- 자산관리 이용동의 등록(/fmco1120r.jsp) 화면
1. 58. 자산관리 이용동의 등록 ==> http://localhost:8088/servlet/FMC01121R.view  
==> FMC01121R: 자산관리 이용동의 약관
2. 56. 선택약관 동의 ==> http://localhost:8088/servlet/FMSE8300R.view 화면에서 저장 버튼 클릭할 것
==> FMC01121R: 자산관리 이용동의 등록 --> 거래코드: COM2105101(약관동의 여부 등록_수정 서비스)
-----------------------------------------------------------------------------------------------------------------------------

- 자산관리 이용동의(/fmco1120s.jsp) 화면 
1. 59. 자산관리 이용동의 ==> http://localhost:8088/servlet/FMC01120R.view 
==> FMC01121R: 자산관리 이용동의 약관 --> 거래코드: COM2105101(메인화면용 약관 리스트 조회)
==================================================================================================================
 
- 자산관리 이용동의(/fmco1120s.jsp) 화면 
1. 57. 선택약관동의 ==> http://localhost:8088/servlet/FMC01800P.view 
==> FMC01800P: 추가이용동의 -->거래코드: CFG1301501, CF61301502
==================================================================================================================

- 농협 퇴직연금 확인(21시, 집)
1. 090-0113-2339-71: 농협 퇴직연금신탁 계좌  ==> (주)지아이데이타에서 퇴직금 송금 안해줌
-----------------------------------------------------------------------------------------------------

- 농협 계좌
356-1274-9556-83: 자유저축예탁금[태만V수종] ■ 
090-0113-2339-71: 퇴직연금신탁[퇴직연금:IRP]
177250-51-007099: 보통예탁금 ===> @@[대구축산농협 동신천지점]  ==> 만주 고모 통장으로 활용할 것 @@@@
177250-51-006346: 보통예탁금[대구축산농협 동신천지점] 
-------------------------------------------------------------------------
==> 장기 미사용 등록: 완료
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.15(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★]
06:35 기상
07:00 조식
07:30 실내 도보
08:30 종료 
08:40 인터넷 서핑
11:00 집출발(자전거)
11:30 제이엘 마켓 ==> [온천진] 광천 재래김 16P(2,590원) 구입
11:50 소금창고 ==> 아다바트 반팔 티셔츠(29,000원), 코오롱 스판텍스 바지(43,000원, 32인치), 여름 잠바(01,900원, 105호, 곤색 계열 ) 구입
12:10 수아 수선 ==> 바지 기장 수선(3천원)
12:35 귀가
13:00 중식
13:30 실내 도보(오후부터 계속 비옴)
14:30 종료 
15:00 인터넷 서핑
16:00 카트 손잡이 길이 늘이기(정원용 철사로 안마봉 묶기)
19:00 석식
19:30 실내 도보
20:30 종료  
20:30 Memo(2021.02) OCR 편집 작업  ==> 완료[♥♡]
23:00 2014년 4월 가계부 월말 결산 처리
23:30 종료
23:35 취침
==================================================================================================================

- 국산 빨아쓰는 숨쉬기편한 은나노 항균 패션 3D입체 자외선차단 검정 천 연예인 마스크, 가격: 4,400원
https://sharer.kakao.com/talk/friends/picker/link
==================================================================================================================

- 스마트폰 과 컴퓨터를 무선으로 연결하는 가장 쉬운 2가지 방법(CX 파일탐색기, 샌드 에니웨어)
https://youtu.be/CXNJ69vDrRY
1. 네트워크에서 액세스(01. 갤럭시Nt_9)
ftp://192.168.219.101:9090, pc/0339
==================================================================================================================

- 이동식 에어컨(실외기 일체형)
1. LG전자 휘센 PQ08DAWCS, 절전 인버터, 가격: 571,650원
http://www.enuri.com/detail.jsp?modelno=50922805
 1) 실외기 설치가 어렵다면? 선택 아닌 필수!??소음 걱정 확 줄인 LG 이동식 에어컨 사용기
https://youtu.be/w8-WHL4pVpU

2. 위니아딤채 MPP07CAWC, ! 2019 위니아 이동식 에어컨~!, 가격: 335,670원
http://www.enuri.com/detail.jsp?modelno=37466415

3. 이동식 에어컨 실사용 리뷰 / 장점, 단점, 소음, 전기세 등 모든 구매 전 필요한 정보
https://youtu.be/YwcvpYuLiic

- LG전자 휘센 SQ06B8PWDS [수도권(기본설치)], 가격: 388,620원
http://www.enuri.com/detail.jsp?modelno=28431822
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.16(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 새벽부터 계속 비옴

- 주말2[★]
06:16 기상
06:42 조식
06:55 빨래
07:00 실내 도보
08:40 종료
08:45 인터넷 서핑
12:00 중식
12:30 실내 도보 ==> 비옴
13:45 귀가
13:30 종료
14:00 인터넷 서핑
18:30 석식 ==> MBC 복면가왕 시청
19:00 실내 도보
20:00 종료
20:40 청소(청소기, 밀대)   
21:20 수종이와 화상 통화: 핸드폰 화면이 이상하다고 함 
        ==> 수종 핸드폰 화면 터치가 안된다고 함
22:50 프린터 테스트: 에러남
23:00 샤워
23:20 종료
23:30 취침
==================================================================================================================

- 삼성전자서비스 북포항 센터(큰누나에게 수종이 핸드폰 AS 요청 전화(22:20))
1.  포항시 북구 소티재로 56 디지털프라자 북포항본점 2층(포항 대동고 앞)
2. 연락처: 1588-3366  ==> 수종 핸드폰 화면 터치가 안된다고 함
==================================================================================================================

- (5월) 140만원대 현시점 최고의 가성비 컴퓨터를 찾으신다면 꼭 보세요 !!
https://youtu.be/hS3heE6OQhI
1. 영재컴퓨터에서 구매하고 싶다면 카톡 채널: http://pf.kakao.com/_sxmjxgT
==================================================================================================================

- 컴좀 싸게 사볼까? 다나와 보다 싸게 사는법 (컴퓨존, 아이코다, 조이젠, 컴스클럽, 아싸컴 등등) - 신성조
https://youtu.be/7XjuEaK5DHI
==================================================================================================================

- 그래픽 카드 너무 비싸다! 60만원대 버티기용 PC 구성(데이븐 DMAX 케이스 조립)
1. 그래픽 카드: GT1030  ==> GT3060
https://youtu.be/OCTpI4cCVbI
==================================================================================================================

- 여름 티셔츠 구입
1. [기어엑스] 냉감 언더레이어-고급 여름용 상의-남자, 남/고급여름/반팔브이넥/블랙:105 1개, 가격: 19,900원
https://www.hmall.com/p/pda/itemPtc.do?slitmCd=2065111581&ordpreview=true
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.05.17(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 아침부터 보슬비(17시에 그침), 수종 핸드폰 액정 수리(11시, 큰누나가 삼성전자서비스 북포항 센터 방문하여 수리함, 
								5만 8천원 송금)

- 농협 PFM 고도화 Prj[★] 
23 FMSE8300R 선택약관 동의 ===> 팝업으로 1개 화면 호출
1. 56. 선택약관 동의 ==> http://localhost:8088/servlet/FMSE8300R.view 에서  
==> 선택약관 동의(/fmse8300r.jsp) 화면 --> 거래코드: COM2105101(약관동의 조회 서비스) 
==================================================================================================================
 
/**
* 설명: 선택약관 동의 동의여부, 약관정보 조회
* @throws Exception
* /
@SuppressWarnings("unchecked") 
public Object checkAddTerm(IDataSet dataset, IBizServiceContext context) throws Exception {
	System.out.println("[/fmse8008tc.java] (checkAddTerm()] ==> [TEST_01]" );

	IDataSet tempDataSet = dataset.clone(); 
	String addTermsSgno = "STIPUO00000000000005";
	
	SessionObject sob = SessionHelper.getSessionObject(context.getRequest()); 
	String cusNo = sob.get("IO_CUSNO_L"); 
	dataset.getIn().setValue("CUSNO", cusNo); 	// 고객번호
	dataset.getIn().setValue("BBMSG_SQNO", addTermsSano); 	// 약관 일련번호 
	dataset.getIn().setValue("MYD_SVC_DSC", "MYMS"); 	// 마이데이타 서비스 구분코드 추가[2021.05.17, by 진태만] 
	dataset.getIn().setValue("MYD_STLT_NO", "1"); 	// 마이데이타 약관 일련번호 추가[2021.05.17, by 진태만] 
	
	fmco1120ts.checkAddTerms(dataset, context); 	// 자산관리 서비스 약관 동의 여부 확인 합수 호출 ===> ■■■
}
==================================================================================================================

- /web.xml 파일에서(/Servers/Tomcat v6.ⓒ Server at localhost-config/web.xml) 
1. 30 ==> 180으로 변경
<session-config>
<	session-timeout>180</session-timeout> 
</session-config>
==================================================================================================================

- 거래코드관리(WAS <--> AP) 화면 이동
 http://16.24.147.100:8010/#view/adsy0005m -->
 1. Ctrl + Alt + Shift + L 
 2. 개인번호: 12345679 ==> 확인 
 3. 관리자 시스템 ==> 거래코드관리 
==================================================================================================================

20 FMC01100R 유틸/서비스이용안내
1. 70. 유틸/서비스이용안내 ==> http://localhost:8088/servlet/FMC01100R.view 
1) 자산관리 이용동의 약관(/fmco1120p.jsp) 화면 --> 거래코드:
==================================================================================================================

- 2021년 근로소득 원천징수영수증 메일로 받음
1. (주)지아이데이타 김유진 대리에게 요청해서 받음 ==> 2021년 근로소득 원천징수영수증(진태만).pdf
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.18(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 엄마 코로나19 예방 접종 2차(09:30, 포항)

- 농협 PFM 고도화 Prj[★]
13 FMSE2100R 설정/공지사항 ==> 완료[♥♡] 
1. 80. 공지사항 ==> http://localhost:8088/servlet/FMSE2100R.view 
 1) 공지사항(/fmse2100r.jsp) 화면 --> 거래코드: CFG1101501[공지사항 목록 조회 서비스]
-----------------------------------------------------------------------------------------------------------------------------

14 FMSE 2100P 설정/공지사항 상세 ==> 완료[♥♡] 
1. 80. 공지사항  ==> http://localhost:8088/servlet/FMSE2100R.view에서 리스트 클릭
 1) 공지사항 상세(/fmse2100p.jsp) 화면 --> 거래코드:
==================================================================================================================

12 FMSE3000R  설정/정보관리  ==> 
1. 85. 정보관리==> http://localhost:8088/servlet/FMSE3000R.view
 1) 정보관리(/fmse3000r.jsp) 화면 --> 거래코드: COM2101S01[고객 정보 조회] , COM2102S01[고객 가족 정보 조회 서비스]
 , COM2103S01[관심사 리스트 조회 서비스(사용여부 포함)]

- /fmse 3000r.jsp파일에서
<%
	System.out.println("[/fmse3000r.jsp] ==> [TEST_01] [ 221 _@@@]"); 
	
	Map<String, String> MY_INFO = (Map<String, String>) resMap.get("MY_INFO");  	// 고객 정보 조회 
%>

1. 현상 : 
2021. 5. 18 22 10:43:30 org.apache.catalina.core. ApplicationDispatcher invoke 
심각: Servlet.service() for servlet jsp threw exception java.lang.ClassCastException: j
ava.lang.String cannot be cast to java.util.Map
at org.apache.jsp.WEB_002dINF.jsp.service.fm.se.fmse3000r jsp.jspService(fmse3000r jsp.java:97) 
2. 원인: MY INFO에서 mil로 받아오는데 String으로 Map되어 에러가 발생 
[OUT][
	[FIELD] [KEY][reqparams][{"CUSNO": "2000629839"}][@] 
	[FIELD] [KEY](httpStatusCode] [200][0] 
	[FIELD] [KEY][msg][정상적으로 처리되었습니다.][0]
	[FIELD] [KEY] [ success ][true] [0] 
	[FIELD] [KEY][data][0][0] 
	[FIELD][KEY][MY_INFO][][0] 	// 고객 정보 조회
	[FIELD] [KEY][FAMILY_INFO][C]][0]	// 고객 가족 정보 조회 서비스 
	[FIELD] [KEYI FAVORITE INFO][[{SORT_SQ=2, THMNL IMG_URLNM=/content/nhass /images/ico_interest01.png, 
	OBT INP SONO=MG_CT_01, UYN=N, REP_IMG_URLNM= /content/nhasset/images/ico_interest01.png, OB_WRSNM=TIE
	{SORT SQ=3, THMNL_IMG_URLNM=/content/nhasset/images/ico_intereste2.png, OBT_INP_SQNO=MG_CT_02, UYN=N, 
	REP_IMG_URLNM=/content/nhasset/images/ico_interest02.png, OB_WRSNM=2}}]][@] 11 Z A 21AE IOA 
	[FIELD] [KEY][result][00000][0]
	[FIELD] [KEY] [resultMessage](J) 3. tl: MY_INFO Null 3*12 $711859/ ==> [JO5M, No. 11[ ] 

3. 조치: MY_INFO Null인 경우 처리 추가 이용동의  
Map<String, String> MY_INFO = null;
 
if(resMap.get("MY_INFO") == null || resMap.get("MY_INFO") == "") { 	// MY_INFO Null인 경우 처리 추가[]2021.05.11]
} else {
	MY_INFO = (Map<String, String>) resMap.get("MY_INFO");	 // 고객 정보 조회
}
==================================================================================================================

13 FMSE2100R 설정/공지사항 ==> 완료[♥♡] 
1. 80. 공지사항 ==> http://localhost:8088/servlet/FMSE2100R.view 
 1) 공지사항(/fmse2100r.jsp) 화면 --> 거래코드: CFG1101S01[공지사항 목록 조회 서비스] 
[13:53:26.628] [geMoveStrategyNotUsingScreenId-509) DEBUG BODY URL IS WEB-INF/jsp/service/fm/se/fmse 2100r.js 
[13:53:26.628] [geMoveStrategyNotUsingScreen Id-510) DEBUG TILES TEMPLATE PATTERN view:mobile/fm/se/fmse2100r. 
[13:53:26.629] [SERVICE- 1981 DEBUG SERVICE E 
2021. 5. 18 2 1:53:26 org.apache.catalina.core. ApplicationDispatcher invoke
심각: Servlet.service() for servlet jsp threw exception 
java.lang.ClassNotFoundException: org.apache.jsp.WEB_002INF.template.mobile.fm.template_002dmain_jsp
	at java.net.URLClassLoader$1.run(URLClassLoader.java:200)
-----------------------------------------------------------------------------------------------------------------------------

- 307번 에러
1. 현상:
[/EffmBaseService.java] [sendHttp()] ==> [TEST_51] [결과 AP Request Params] {"CUSNO":"2000629839"} 
[/EffmBaseService.java] [sendHttp()] ==> [TEST52] [결과 AP URL]http://16.24.147.100:8000/pfmapi/AS5114110
[/EffmBaseService.java] [sendHttp()] ==> [TEST_53] [결과 상태코드]307 
[/EffmBaseService.java] [sendHttp()] ==> (TEST_54] (결과 results]<!DOCTYPE HTML PUBLIC "-//IETF//DTD HTML 
 <HTML><HEAD> <TITLE> 307 Temporary Redirect </TITLE> 
 </HEAD> <BODY> 
 <H1>Temporary Redirect</H1>
 <HR> 
 </BODY>
 </HTML> 
 2. 원인:
==================================================================================================================

31 FMCO1800R 추가이용동의 필요 여부 확인
1. 77. 자산(항목별목록) ==> http://localhost:8088/servlet/FMAS1100R.view 
 1) 자산 현황 서비메인 - 항목별 목록(/ms1100n.jsp) 화면 --> 거래코드: COM2105S01 -->
==================================================================================================================

16 FMC01210R 공지팝업조회
1. 81. 공지팝업조회 ==> http://localhost:8088/servlet/FMSE2100R.view
 1) --> 거래코드: COM1031S01[팝업 리스트 조회 서비스]
- /common-base.js 파일에서
/* 
* 공지팝업호출
aram: 화면서비스ID 
*/
	function noti_popup_open(serviceID) {
		var dfd = $.Deferred(); 
		
		httpSend("FMC01210R", { "SCID" : serviceID },		// 공지팝업조회
			function (ret)
			{
		}
	} 
==================================================================================================================

- 신한페이판  어플 설치
1,  My빌&페이 ==> 서울시 상수요금, 신한체크카드 요금: 모바일 청구서 신청
2. 터치결제 신청: 신한체크카드를 핸드폰에서 실행
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.19(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 부처님 오신 날(공휴일)[★]
06:15 기상
06:40 조식
07:00 실내 도보
08:00 종료
08:10 인터넷 서핑
12:00 집출발(반바지, 도보)
12:40 명륜 진사 갈비 서울대림점 도착 ==> 태용 만남(태용이 혼자 인왕산 산행하고 옴)
12:40 중식(돼지갈비[무제한], 맥주) ==> 3만 3천 원(태용이가 쏨)
14:10 종료
14:10 도보 ==> 보라매공원에서 트랙 도보[갔다가 더워서 못 함], 도림천 도보
14:55 귀가 
15:00 인터넷 서핑
17:00 낮잠
19:00 취침
19:10 석식
19:30 실내 도보
20:30 종료
20:40 인터넷 서핑
23:00 샤워
23:20 종료
23:30 취침
==================================================================================================================

- SUS RT-AX56U, 와이파이 6면 다 된다면서요? 공유기 바꾸기 전에 꼭 보세요! 저렴한 아이피타임 A2003NS의 재 발견!
https://youtu.be/YsSOM7b3cuI
1. WIFI 6 지원 ==> mesh 지원 여부 확인할 것 --> 갤럭시 노트9 지원 안함(갤럭시 10부터 지원)
https://www.youtube.com/results?search_query=%EC%99%80%EC%9D%B4%ED%8C%8C%EC%9D%B4+%EC%B6%94%EC%B2%9C
==================================================================================================================

- temporary redirect 307 에러
1. 현상:  거리코드(AP: 전문) 호출시 temporary redirect 307 에러 발생
2. 원인: 
 가. 서버가 다운되거나 문제가 발생
 나. 요청한 리소스가 Location (en-US) 헤더에 주어진 URL로 임시로 옮겨졌다는 것을 나타냅니다.
원래 요청한 메소드와 Body를 재사용하여 요청을 리다이렉트 합니다. 여기서 메소드를 GET으로 바꾸기 위해서 303 See Other (en-US)를 
사용하시면 됩니다. 이것은 PUT요청에 업로드된 리소스가 아닌 "You successfully uploaded XYZ"와 같은 확인메시지 응답을 제공 하는데에 
유용합니다.
3, 조치: 서버 담당자에게 문의할 것
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.20(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 오전부터 비(우산), 중식 후 도보(양지천 -- > 학의천 --> 인덕원교 --> 관양교 [T] --> 양지천 --> 홈)

- 농협 PFM 고도화 Prj[★]
30 FMCO18017 개인정보 수집 이용동의 확인 [Main] ==> 완료[♥♡] 
1. 59. 자산관리 이용동의 ==> http://localhost:8088/servlet/FMCO1120R.view 화면에서 다음 버튼 클릭 후 저장 성공이면
 1) 개인정보 수집 이용동의 확인 (/fmco1801p.jsp) 화면
-----------------------------------------------------------------------------------------------------------------------------

31 FMCO1800R 추가이용동의 필요 여부 확인 ==> 완료[♥♡] 
1. 90. 자산(항목별목록) ==> http://localhost:8088/servlet/FMAS1100R.view --> 농협은행과 나의 애정관계 클릭
 1) nnavigateAfterAgreeTerms ('FARP2100R'); 	// 추가이용동의 확인 호출 
function navigateAfterAgreeTerms(serviceId, params) {
	// 자산관리 선택 약관 동의 여부 확인 
	httpSend("FMCO1800R", p, function(resp) { 	// 추가이용동의 필요 여부 확인 ===> ■■■
		if (stltArgyn === "Y") {
		} else { 
			popup_cfFullLayerOpen("FMCO1800P", { 	// 추가이용동의 팝업 ===> ■■■
				tParams : encodeURIComponent(JSON.stringify(P))
			}, function(){
		}
	});
}
 2) 거래코드: MSSVSB1010S02[마케팅 관련조회]
------------------------------------------------------------------------------------------------------
	
32 FMC01800P 추가이용동의 팝업 ==> 완료[♥♡]  
1. 추가이용동의(/fmco1800p.jsp) 화면 --> 거래코드: MSSVSB1010S01[ 서비스가입 약관내용 조회], MSSVSB1010S02[마케팅관련조회]
==================================================================================================================

- 국민연금 관악지점에서 전화 옴(15시, 사업장)
1. 매월 10만원씩 납부하면  ==> 만 65세 이후 87만원 수령
2. 매월 40만원씩 납부하면  ==> 만 65세 이후 매월 1,057,000원 수령: 광석이한테 다시 문의함
==> 만 60세까지 납부(356개월)...매월 1,057,000원 수령 ==> 만 65세 수령 가능(2037년 06월 신청: 다음달 25일부터 평생 수령)
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.21(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 오전부터 비(우산)

- 농협 PFM 고도화 Prj[★]
12 FMSE3000R  설정/정보관리 ==> 완료[♥♡]  
1. 12. 정보관리==> http://localhost:8088/servlet/FMSE3000R.view
 1) 정보관리(/fmse3000r.jsp) 화면 --> 거래코드: COM2101S01[고객 정보 조회] , COM2102S01[고객 가족 정보 조회 서비스]
 , COM2103S01[관심사 리스트 조회 서비스(사용여부 포함)]
==================================================================================================================

- 소스 커밋, 개발 서버 반영 요청 
1. /fmco1120tc.java, //fmco1120ts.java, /fmse3000r.jsp
==================================================================================================================

- 단위 테스트 
NHPFM-PS-IM05 - 단위테스트케이스(결과) FMICO1800P 설정 (추가이용동의 팝업) V1.0.xlsx 
NHPFM-PS-IM05 - 단위테스트케이스(결과) FMCO1800R 설정 (추가이용동의 필요 여부 확인) V1.0.xlsx 
NHPFM-PS-IM05 - 단위테스트케이스(결과) FMCO1100R 설정(유틸 서비스이 안내)_V1.0.xlsx
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.22(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 주말[★]
06:15 기상
07:00 조식
07:20 실내 도보
07:45 태용이 차 현아트빌에 주차(현대 산타페 24머 3884): 태용이 빌라 옥상 공사 한다고 차량 이동 요청했다고 함
		--> 태용이 부처님 오신 날(5월 19일) 인왕산 산행하고 몸살 나서 집에 못 내려 갔다고 함
08:30 종료
08:10 인터넷 서핑
11:10 다로피씨에 견적 상담 신청
12:00 중식
12:30 집출발(반바지)
12:30 도보 ==> 보라매공원에서 트랙 도보
13:45 귀가
13:30 종료 
16:35 태용이 현아트빌에 도착: 주차했든 차 운전해서 숙소로 돌아감
18:50 실내 도보 
20:00 종료  
20:50 Lg U+ 인터넷(와이파이) 끊김 ==> 와이파이 공유기 전원 끄고 다시 시작: 정상으로 돌아옴
23:30 종료
23:35 취침 
==================================================================================================================

- 다로피씨 사이트에 글 작성
http://daropc.co.kr/bbs/board.php?bo_table=comm_pcsangdam&wr_id=6&sop=and&sca=&pd_no=&sfl=&stx=&page=1
==================================================================================================================

- 별컴 연구실 | 인텔 11세대 호환가능한 메인보드 출시?! (ASUS TUF GAMING Z590-PLUS WIFI)
https://youtu.be/eMj1gC-Fcxg
1. 11세대 호환 가능한 메인보드! 10세대도 호환이 가능
==> 구매할 CPU: 인텔 코어 i7-10700F 코멧레이크S(10세대): 주문 취소(11세대로 주문할 것)
==> 구매할 CPU: 인텔 코어 i7-11700 로켓레이크S [정품]
==================================================================================================================

- 그래픽 카드란? 컴알못 탈출! 그래픽 카드의 역할과 구조[브로리퀘스트]
https://youtu.be/3DwOMp8k6Tk

- NVIDIA vs AMD 그래픽 카드 라인업 알아보기[브로리퀘스트]
https://youtu.be/Wk8k3I64SbU

- NNVIDIA(지포스) 그래픽 카드 @@@
1. 206년 파스칼
GTX 1080 Ti, GTX 1080
GTX 1070 Ti, GTX 1070, GTX 1060
GTX 1050 Ti, GTX 1050
GTX 1030

2. 2018년 튜링
GTX 1660 Ti, GTX 1660 SUPER, GTX 1660
GTX 1650 SUPER, GTX 1650 
GTX 1670 SUPER, GTX 1670	==> GTX 1670 이상 만 구매 검토할 것(1650, 1060, 1050 주문하지 말 것) @@@ 
RTX 2080 Ti, RTX 2080  SUPER, RTX 2080  
RTX 2070 SUPER, RTX 2070 
RTX 2060

3. 2020년 암페어
RTX 3090, RTX 3080, RTX 3070
 
4. GTX 판매(스카트컴)
1) GTX 1050 Ti: Colorful 지포스 GTX1050 Ti NE D5 4GB, 가격: 369,000원 ==> http://www.smtcom.co.kr/shop/product_detail.html?pd_no=87266
2) 중고 GTX 1080 (AS기간 6개월보증) => http://www.smtcom.co.kr/shop/product_list.html?depth=2&cate1=17&cate2=21 
----------------------------------------------------------------------------------------------------------------------------------

- AMD(라데온) 그래픽 카드
1. 2017년 폴라리스
RX 590,	RX 580, RX 570, RX 540 		==> RX 570 이상 만 구매 검토할 것 @@@

2. 2017년 베가
RX VEGA 64, RX VEGA 56

4. 2018년 베가
Radeon V11

5. 2017년 나비
RX 5700 XT, RX 5700  
RX 5300
==================================================================================================================

- 메모리 오버클럭 1부 (클럭과 타이밍에 관하여) -신성조
https://youtu.be/89Sg_X_1bx4
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.23(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 주말2[★]
07:33 기상
08:00 조식
08:20 실내 도보
09:30 종료
09:40 인터넷 서핑
11:50 집출발(반바지, 도보)
12:00 태용이 빌라(해바라기빌)에서 만남 ==> 태용이 차 탑승
12:10 우리축산정육식당 도착
12:18 중식(소한마리, 냉면, 맥주) ==> 5만 원(태용이가 쏨)
13:10 종료
13:35 도보 ==> 보라매공원에서 트랙 도보
14:15 귀가 
14:20 인터넷 서핑
18:30 석식 ==> MBC 복면가왕 시청
19:00 실내 도보
20:00 종료
20:40 청소(청소기, 밀대)
21:00 인터넷 서핑
23:00 샤워
23:20 종료
23:30 취침
==================================================================================================================

- 2년간 개발 프로젝트 현장에서 수행한 소프트웨어 테스트 방법론 말씀드립니다~ 10분이면 테스트 전체 조망 (feat. 소프트웨어 개발 현장에서)
https://youtu.be/5dXJavk6KkI
1. 단위 테스트 ==> 함수
2. 통함 테스트 ==> 사니리오: Test case[기획 단계, 기대값]
==================================================================================================================

- 3억 투자 몸투, 재개발
1. 주식으로 깡통나는 사람들의 특징[부자아빠]
https://youtu.be/2cHc2ilLVGg
==================================================================================================================

- 35형 커브드 모니터(QX352RC) 화면 설정
1. 현상: 화면이 해상도가 누렇게 보임
2. 조치: 조이스틱(둥근 리모콘) ==> OK: 클릭 ==>  HDMI V001(새창) ==> 기타 설정: 선택 --> 초기화: 클릭 
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.24(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> (주)지아이 데이타에서 퇴직연금(TRP) 총 21.871,020원 입금 확인 (13시)

- 농협 PFM 고도화 Prj[★]
-     
==================================================================================================================

- SSD 2TB 구입
1. [옥션] 샌디스크 SOI 샌디스크 Ultra M.2 NVMe 3D SSD 2TB, 가격: 248,900원
http://www.enuri.com/detail.jsp?modelno=56998953
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C307944871&frm3=V2
==================================================================================================================

- SSD 1TB 구입
1. 삼성전자 PM981a M.2 2280 병행수입 1T, 가격: 172,720원
http://www.enuri.com/detail.jsp?modelno=44232422
http://www.11st.co.kr/products/3352513765?&xfrom=&xzone=  
==================================================================================================================

- 그래픽 카드 구입
1. [11번가] COLORFUL 지포스 GTX 1650 SUPER 토마호크 D6 4GB(정품), 가격: 497,000원
==> 입출력 단자: DVI, HDMI(2.0), DP(1.4 지원), 4K(지원), 최대 지원 모니터수: 3
http://prod.danawa.com/info/?pcode=9984282&keyword=GTX+1650+SUPER&cate=112753#bookmark_cm_opinion
http://www.11st.co.kr/products/3480683107?&xfrom=&xzone=
==================================================================================================================

- CPU 쿨러 구입
1. [지마켓] NOCTUA NH-D15S CPU쿨러 강력냉각, 가격: 144,180원
http://prod.danawa.com/info/?pcode=9984282&keyword=GTX+1650+SUPER&cate=112753#bookmark_cm_opinion
http://item.gmarket.co.kr/detailview/item.asp?goodscode=1624191653
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.05.25(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 다로피씨에 부품비 983,400원 송금함(6시), 퇴직금 입금(9시, 21,242,114원)

- 농협 PFM 고도화 Prj[★]
No.11, NHPFM-PS-IMO5 - 단위테스트케이스(결과)_FMSE2100P 설정(설정 / 공지사항 상세)_V1.0.xlsx 	==> 완료[♥♡]
No.12, NHPFM-PS-IMO5 - 단위테스트케이스(결과) FMSE2100R 설정(설정 / 공지사항)_v1.0.xlsx	 ==> 완료[♥♡]
==> http://localhost:8088/servlet/FMSE2100R.View
==================================================================================================================

No.02, NHPFM-PS-IM05 - 단위테스트케이스(결과)_FMCO1210R_공통 (공지팝업조회)_v1.0.xlsx 	==> 완료[♥♡] 
==================================================================================================================

No.10, NHPFM-PS-IMO5-TMAS-단위 테스트케이스(결과)_FMSE1000R_설정(설정 서브메인)_v1.0.xlsx
==> http://localhost:8088/servlet/FMSE1000R.view --> Ifmse1000n.jsp
==================================================================================================================

31 FMCO1800R 추가이용동의 필요 여부 확인 
1. 90. 자산(항목별목록) ==> http://localhost:8088/servlet/FMAS1100R.view --> 농협은행과 나의 애정관계 클릭
 1) nnavigateAfterAgreeTerms ('FARP2100R'); 	// 추가이용동의 확인 호출 
function navigateAfterAgreeTerms(serviceId, params) {
	// 자산관리 선택 약관 동의 여부 확인 
	httpSend("FMCO1800R", p, function(resp) { 	// 추가이용동의 필요 여부 확인 ===> ■■■
		if (stltArgyn === "Y") {
		} else { 
			popup_cfFullLayerOpen("FMCO1800P", { 	// 추가이용동의 팝업 ===> ■■■
				tParams : encodeURIComponent(JSON.stringify(P))
			}, function(){
		}
	});
}
 2) 거래코드: MSSVSB1010S02[마케팅 관련조회]
------------------------------------------------------------------------------------------------------
	
32 FMC01800P 추가이용동의 팝업 ==> 완료[♥♡]  
1. 추가이용동의(/fmco1800p.jsp) 화면 --> 거래코드: MSSVSB1010S01[ 서비스가입 약관내용 조회], MSSVSB1010S02[마케팅관련조회]
==================================================================================================================

- (주)지아이데이타에서 퇴직금 수령
1. 총 수령 금액: 21,242,114원(4년 2개월
 1) 연봉의 1달치 적립: 400만원 * 4 = 1,600만원 에상 ==> 21,242,114원 수령(500만원 정도 더 받음: 이자로 판단됨)
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.05.26(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> NH농협은행에서 미래에셋증권 통장(010-3072-089-7)으로 21,242,115원 입금 완료((주)지아이데이타에 지급한 퇴직금)  

- 농협 PFM 고도화 Prj[★]
No.10, NHPFM-PS-IMO5-TMAS-단위 테스트케이스(결과)_FMSE1000R_설정(설정 서브메인)_v1.0.xlsx
==> http://localhost:8088/servlet/FMSE1000R.view --> /fmse1000n.jsp

<script type="text/javascript">
	$(".menulist ul").children().each(function(idx, item) { 
		$(item).find("a").on("click", function(e) { 
			if ($(this).text() === "공지사항") {
				navigate("FMSE2100R"); 
			} else if ($(this).text() === "MY정보") { 	// 메뉴명 '정보관리'에서 'MY정보'로 수정[2021.05.24, by 진태만]
				navigate("FMSE3000R"); 
			} else if ($(this).text() === "신청내역") {
				navigate "FMSE400OR");
			} else if ($(this).text() === "숨김내역 관리") {
				navigate("FMSE5100R"); 
			} else if ($(this).text() === "연결자산 관리") {	 // 메뉴명 '정보관리'에서 'MY정보'로 수정[2021.05.24, by 진태만]
				navigate("FMAR2200");		//	연결자산 관리 상세화면으로 이동
			}
		});
	});
}); 
</script> 

 <li><a href="javascript:-">MY정 </a></li> 			<!--// [2021 1차 한은정: 05-14] 정보관리 메뉴명 수정[2021.05.24, by 진태만]   //-->
 <li><a href="javascrint.:" >연결자산 관리<a></li>	<!--//메뉴명  '연결자산 관리' 추가[2021.05.24, by 진태만]   //-->
==================================================================================================================

- 국민연금 납부 확인[광석이와 통화 상담] (16:30, 사업장)
1. 매월 452,700원을 2032년까지 6월까지 납부 ==> 매월 10일로 신한은행 자동 납부로 처리함(2021.06.10 ~ 2032.06.10)
2. 98년 대교에서 퇴사하고 받은 연금(150만원 추정)을 330만원으로 반납(2021년 7월달에 반납 예정) ==> 수령 보험료 월 5만원 상당
==> 1+ 2 모두 수행하면 2037년 7월 이후 수령 예상 연금액 115만원(2037년 06월 25일 보험금 신청 --> 2037년 07월 25일부터 매월 보험금 수령)
-------------------------------------------------------------------------------------------------------------------------------------

3. 추가납부(41개월) 금액은 현재 보험료 452,700*41개월=18,560,700원 납부시 ==> 예상 연금액은 128만원
==================================================================================================================

- 모니터 거치대 구입
1. [옥션] 카멜마운트 모니터 받침대 MSH-27(화이트) 거치대, 가격: 25,070원  ==> 실제 가격: 19,130원[스마일페이[현금] 결제]
http://www.enuri.com/detail.jsp?modelno=24992946
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B473539210&frm3=V2
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.27(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근할 때 비(6:15, 우산) 

- 농협 PFM 고도화 Prj[★]
12 FMSE3000R  설정/정보관리  ==> 
1. 85. 정보관리==> http://localhost:8088/servlet/FMSE3000R.view
 1) 정보관리(/fmse3000r.jsp) 화면 --> 거래코드: COM2101S01[고객 정보 조회] , COM2102S01[고객 가족 정보 조회 서비스]
 , COM2103S01[관심사 리스트 조회 서비스(사용여부 포함)]
// 가족정보 등록/수정
function openFamilyInfoPopup() {
	devConsole.log(""); var paramsjson = {}; 
	params Json.data = {}; 
	paramsjson.data.rtnsvcID = "FMSE3000R";	// 호출한 응용서비스 화면(FMSE3000R: 설정 / 정보관리)
	
	var params = {}; 
	params.data = encodeURIComponent(JSON.stringify(paramsjson.data)); 	// URL 암호화 
	navigate("MSGS1010R", params); 	// 정부혜택지원 메인 [MSGS1010R] 화면으로 이동 ===>
}
==============================================================================================================

- DB 설정 ==> 완료[] 
1. Orange for ORACLE(Fail-Safe) 설정(기존 사용자가 설치해 놓음) 
2. SQL Developer 설정(기존 사용자가 설치해 놓음) 
번호 OS 유형 호스트 유형 △ ▽ 호스트명 △ ▽									호스트 IP △▽ 		계정 유형 △▽ 계정명△▽
1 		DB 								Oracle nbmimyxtdb01_NBMIMYT1 		16.24.149.83 9.		MIMY_SEL 
==> 01. (개발) 마이데이터DB, Username: CS523262, PH; FO!rsk. 6R ==> 사용 ■■■
3. tnsnames.ora 설정 
C:\app\CS520560\product\11.2.0\client 1\network\admin\tnsnames.ora 파일에서 
# 01. (개발) 마이 데이터DB ==========================> @@@@ 
NBMIMYT = 
	(DESCRIPTION = 
		(ADDRESS_LIST =
			(ADDRESS = (PROTOCOL = TCP)(HOST = 16.24.149.84) (PORT = 1531)) 	#RAC 2호기 
			(ADDRESS = (PROTOCOL = TCP)(HOST = 16.24.149.83) (PORT = 1531)) 	#RAC 1호기
		(CONNECT DATA =
			(SERVER = DEDICATED) 
			(SERVICE_NAME = NBMIMYT)
		)
  )		
==============================================================================================================

- 터미널에서 서버 재시작(유닉스 서버에서)
> cd /sw/jboss/servers/dbapsver01_bapp01
> ./shutdown.sh
> ./start.sh
> tail -f /log/jboss/dbapsver01_bapp01/sever.log			-- 로그 분석 @@@
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.05.28(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근할 때 비(6:15, 우산)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 시나리오 케이스 작성 
 1. 주황색 바탕으로 된 셀에 내용 기입 
	- 설계자ID(J열), 설계자명(K열) 
	- 1차확인자ID(W열), 1차확인자명(X열), 1차확인예정일(Y열) 
2. 작성은 금주 금요일(5/28)까지
3. 참고로 통합테스트는 2차례 진행되며, 1차는 6월1일 ~ 6월18일
==============================================================================================================

- fmsr1500tS 주석 처리 
1. fmco1120tc.java 파일에서
 // private fmsr1500tS fmsr1500tS; /	/ fmsr1500tS 삭제 처리[2021.05.28, by 진태만]
 ==> 최수경 수석 요청 
==================================================================================================================

- 월별 보안점검 등록(정보보호포탈 5월 점검)  ==> 완료[♥♡]
0. 외주용역 직원은 개발자 정보보호포탈 ( http://16.24.55.68:9960/sportal/home)로 접속 후 
[점검관리 - [외주업체 정보보호] - [월별 보안점검 등록] 메뉴에서 보유한 PC별로 점검결과 입력 및 신청 
1. 공유 폴더 사용여부 확인
 C:\Users\CS523262> net share 
 
 공유 			이름 		리소스			설명
 -----------------------------------------------------------------------------------------------------------------------------
IPC$ 
명령을 잘 실행했습니다.

3. 당행 보안 프로그램 설치 1: DA, DRM, V3, NAC, APC, P11, 출력물보안프로그램 
9. 중요자료 저장/보관 여부: 서버IP 정보, 계정 정보, 계정 비밀번호 저장/보관 여부 
10 인터넷 통제 
C:\Users\CS523262> ping 8.8.8.8

Ping 8.8.8.8 32바이트 데이터 사용: 요청 시간이 만료되었습니다.

8.8.8.8에 대한 Ping 통계 :	패킷: 보냄 = 4, 받음 = 0, 손실 = 4 (100% 손실)
==================================================================================================================
 
- 건강보험료(2021년 5월분 청구서 도착
1. 납부자번호(전자납부번호): 2101760326911, 납부의무자: 진태만
2. 장기요양 보험료: 92,150원, 장기요양 보험료:10,160원 ==> 102,760원 청구됨(2021년 6월 10일부터 납부)
3. 참고: 작년까지 정규직(지아이데이타): 171,650원 납부
4. 자동이체 신청: 1577-1000 ==> 자동이체 + 이메일 고지
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.29(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 주말[★]
06:15 기상
07:00 조식
07:20 실내 도보
08:30 종료
08:10 인터넷 서핑
09:05 집출발(반바지, 자전거) ==> 보라매공원 ==> 보라매독서실 ==> 농심 ==> 보라매역 ==> 대방역 ==> 대방지하도(계단)  ==> 여의교
		==> 여의교교차로 ==> 여의교대방로 ==> 원효대교 남단 교차로(진입: 위험) ==> 원효대교(위험: 자전거 도보 안내) 
		==> 원효대교 북단 계단(1.5층) ==> 다리(2층) ==> 용산
09:55 용산 도착 ==> 용산 전자상가 교차로
10:00 넥서스 밸리(서울 용산구 청파로 113-6) 도착
10:05 다로피씨(914호) 방문 ==> PC 부품 확인(1,  CPU, 3번 메인보드, 4. 메모리, 7. 파워, 8. 케이스 ): 박스 2개
10:10 용산 출발(자전거에 박스 2개 싣기: 줄 느슨하게 매어서 오른쪽 정강이 다침)
10:10 용산 출발 ==> 용산 전자상가 교차로 ==> 원효대교 북단 계단([1.5층] 엘리베이트 이용: 2층에서 내려옴: 박스 떨어져서 고생) 
		 원효대교(도보) ==> 원효대교 남단 교차로(왼쪽으로 우회) ==> 여의동로 ==> 시범아파트앞 교차로 ==> 6.3로 ==> 성모병원앞 교차로
		==> 여의동로 ==> 여의교교차로 ==> 대방지하도(계단: 박스 떨어져서 고생) ==> 대방역 ==> 한림대학교 강남성심병원 ==> 대림사거리
		==> 신대방역
11:45 귀가
12:00 중식
12:30 집출발(반바지)
12:30 도보 ==> 보라매공원에서 트랙 도보(약간 내림)
13:45 귀가
13:30 종료 
13:40 인터넷 서핑
16:00 PC 조립
		1. 인텔 코어 i7-11700 로켓레이크S?[정품]  장착 ==> 2. 녹투아 NH-D15 + NM-AM4 라이젠 킷 장착(쿨러가 2개 인줄 알고 찾음: 1개로
		판명됨) ==> 3. 삼성전자 DDR4 PC4-21300[2,666MHz] 16GB 2개 장착
18:45 석식
19:20 실내 도보
20:20 종료
21:00 PC 조립
		4. 케이스(아이구주 VENTI C60 스윙도어)에 메인보드를 창착할 나사가 없음 ==> 나사 아무거나 끼워서 케이스 보드 장착(1. 그래픽 카드가 안 맞음
		[설치 불가], 2. 파워(시소닉 S12III Bronze SSR-650GB3)가 안 맞음)			
23:45 종료   
23:55 취침 
==================================================================================================================

- 방문 수령(10시, 다로피씨: 용산 넥서스 밸리 914호) 
1. 다로피씨에 부품비 983,400원 송금 
2. 용산까지 방문 수령[총 5개 부품]해서 총 배송비 16,020원 절약
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.05.30(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 주말2[★]
07:33 기상
08:00 조식
08:20 실내 도보
09:30 종료
09:40 인터넷 서핑
11:00 PC 조립
		4. 케이스(아이구주 VENTI C60 스윙도어)에 메인보드 창착(하단: 4개의 육각 나사(Mainboard standoff): 메인보드 지지대용
			==> 상단: 둥근 접시 나사를 못 찾아 (굵은) 육각머리 나사를 꽃음): 큰 실수 ■■■
		5. 그래픽 카드(COLORFUL 지포스 GTX 1650 SUPER 토마호크 D6 4GB) 장착 ==> 케이스 뒷편 쇠를 들어 올려서 그래픽 카드 꽃음
		8. 파워(시소닉 S12III Bronze SSR-650GB3 Single Rail) 장착 ==> 뒷편 나사를 2개만 꽃음(4개 안 꽃아도 상관 없이 고정됨) 
		==> 파워 구입한 박스에서 보드 조립 나사들이 들어 있음
12:00 중식
12:30 집출발(반바지)
12:30 도보 ==> 보라매공원에서 트랙 도보(약간 내림)
13:45 귀가
14:20 인터넷 서핑
14:00 PC 조립
		9. 케이블 꽃기
		 1) HD LED(*, -), PWR LED(+,- ), PWR SW, RESET SW
18:30 석식 ==> MBC 복면가왕 시청
19:00 실내 도보
20:00 종료
20:40 청소(청소기, 밀대)
21:00 인터넷 서핑
23:00 샤워
23:20 종료
23:30 취침
==================================================================================================================

- PC 조립[2021.05.29(토)]
1. 인텔 코어 i7-11700 로켓레이크S?[정품]  장착

2. 공냉 쿨러(녹투아 NH-D15 + NM-AM4 라이젠 킷 장착(쿨러가 2개 인줄 알고 찾음: 1개로 판명됨)) 장착

3. 삼성전자 DDR4 PC4-21300[2,666MHz] 16GB 2개 장착

4. SSD(SanDisk Ultra M.2 NVMe 3D SSD(2T)) 장착

5. 케이스(아이구주 VENTI C60 스윙도어)에 메인보드 장착(나사 파워 나사를 먼저 사용)
 1) 그래픽 카드가 안 맞음[설치 불가] ==> 원인: 케이스 뒷편 쇠를 들어 올려서 그래픽 카드 꽃음[잘못 판단함] 

6. 그래픽 카드(COLORFUL 지포스 GTX 1650 SUPER 토마호크 D6 4GB) 장착

7. 파워(시소닉 S12III Bronze SSR-650GB3 Single Rail) 장착 ==> 뒷편 나사를 2개만 꽃음(4개 안 꽃아도 상관 없이 고정됨) 

8. 케이블 꽃기
	1. 전면 패널 연결
	 1) PWR LED(+,- ) [윗쪽(가로 2열) ■] 	===> PWR SW[윗쪽(가로 2열) ■]
	 2) HDD LED(+,- ) [아랫쪽(가로 2열) ■] 	===> RESET SW[아랫쪽(가로 2열) ■]
	2. 파워케이블 설명& CPU, 메인 케이블 연결
	 1) 24핀 커넥터 ==> 메인 보드용 ==> 공냉 쿨러(녹투아 NH-D15)가 너무 커서 케이블 못 꽃음 ■■■
	  2) CPU 커넥터(8+4핀) ==> 수냉 쿨러가 너무 커서 CPU 커넥터 못 꽃음: 수냉 쿨러 재거 한 후 꽃아야 함
	  3) PCI-E 커넥터 ==> 그래픽 카드 
	  
9. SSD(삼성전자 PM981a M.2 2280 병행수입 1T: OS 설치) 장착
==============================================================================================================  

- 컴퓨터 조립할 때 케이블 연결하는 방법![그랜]
https://youtu.be/uE76NIhvvmg 
==================================================================================================================

- 51. PC 조립 리스트[2021.05.29(토)]			
No.	부품명	제품명	수량	가격	배송비	총 가격	ULR	비고
1	CPU	인텔 코어 i7-11700 로켓레이크S?[정품]		 	 	\393,300	구매	다로PC: 현금가
2	쿨러	녹투아 NH-D15 + NM-AM4 라이젠 킷		 		\144,180	구매	지마켓
3	메인보드	ASUS TUF Gaming Z590-PLUS WIFI (인텍앤컴퍼니)				\313,000	구매	다로PC: 현금가
4	메모리	삼성전자 DDR4 PC4-21300[2,666MHz] 16GB 2개	2	\82,100	 	\164,200	구매	다로PC: 현금가
5	그래픽 카드	 COLORFUL 지포스 GTX 1650 SUPER 토마호크 D6 4GB (정품)				\497,000	구매	11번가
6	SSD(HDD)	삼성전자 PM981a M.2 2280 병행수입 1T		\169,720	\3,000	\172,720	구매	11번가
		SanDisk Ultra M.2 NVMe 3D SSD(2T)				\248,900	구매	옥션
7	파워	시소닉 S12III Bronze SSR-650GB3 Single Rail			 	\69,900	구매	다로PC: 현금가
8	케이스	아이구주 VENTI C60 스윙도어		 	 	\43,000	구매	다로PC: 현금가
--------------------------------------------------------------------------------------------------------------------------

- 구매	다로PC: 현금가 983,400원(총 5개 부품: 용산에서 방문 수령)
1. CPU, 3번 메인보드, 4. 메모리, 7. 파워, 8. 케이스
==============================================================================================================  

■■■■■■■■■■■■■■■■■■ 2021.05.31(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 건강보험 자동이체 신청(9시, 사업장): 2021년 5월분 부터(매월 10일 출금됨), 조립PC에 삼성 SSD 1T 장착 (21시)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 시나리오 케이스 작성 
 1. 주황색 바탕으로 된 셀에 내용 기입 
	- 설계자ID(J열), 설계자명(K열) 
	- 1차확인자ID(W열), 1차확인자명(X열), 1차확인예정일(Y열) 
2. 김홍석 부장에서 첨부 파일 (20210528 통합테스트 시나리오 케이스 v0.03.xlsx) 메일로 보냄
==============================================================================================================
 
- goHome 변경 
1. goHome ==> goPfmHome: 자산관리 메인 
2. goHome: 마이데이타 메인
==================================================================================================================

No.13, FMSE3000R 설정(설정 / 정보(구.정보관리)) ==> 
==> http://localhost:8088/servlet/FMSE3000R.view --> /fmse3000r.jsp
1) MW 정보(구.정보관리)(/fmse3000r.jsp) 화면 --> 거래코드, COM2101S01[고객 정보 조회], CON2102S01[고객 가족 정보 , COM2103S01 
[관심사 리스트 조회 서비스 (사용여부 포함), MSSVGS1000P001S02: 가족상태 조회 ===> "AP 미등록 오류 발생" 
==================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
