

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.02) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 
 
■■■■■■■■■■■■■■■■■■ 2021.02.01(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 13:00 ~ 18:00 ==> 하나손해보험 프로젝트 투입(13:10, 웅진 본사(중로 플레이스) 10층 하나손해보험 TFT

- 하나손해보험 Prj[★]
05:00 기상
05:40 조식
06:00 실내 도보 
06:30 종료
08:30 집출발(자전거)
08:40 신사동 주민센터: 전입신고, 확정일자 받기
09:10 다와DC마트: 변기 덮게 구입
09:40 귀가
09:50 LG U+ 설치 기사 방문: 인터넷, TV 설치
10:10 종료
10:15 집출발(자전거)
10:30 LG전자 관악서비스 센터 방문 ==> 노트북 전원 케이블 구입(25,600원): 전원 케이블까지 구입하게 해서 화냄
10:50 귀가
11:10 윈도우10 정품 인증 키 구입(3,600원): 위메프에서 현금 결제
11:50 중식
12:00 집출발(백팩)
12:10 신대방역
12:50 을지로4가역 4번 출구
13:05 하나손해보험 본사 10층(잘못 옴)
13:10 웅진 본사(종로 플레이스) 10층: 구종식 부장, 이경일 부장, 박건유 대리, 김유이 대리
13:30 노트북 셋팅
14:00 보안 서약서 작성
14:38 시건 장치 설치
15:00 출입문 보안 설치: 안면 인식
15:20 노트북 포맷
16:00 보안 프로그램 설치
17:00 구종식 부장 면담(프로젝트 상황 심각)
18:00 퇴근
18:10 을지로4가역
19:00 신대방역 1번 출구 도착
19:10 귀가
19:20 석식 
19:30 실내 도보 
20:30 종료 
21:00 문태용 방문
21:50 문태용 귀가
22:00 가계부 월말 결산 처리
23:10 취침
==============================================================================================================
  
- 윈도우10 Prp 정품 인증
1. 태마 MSI 노트북(TAMA_NB_HOME)에 설치
 1) 정품인증키: WT9PN-MJPDH-DF3TH-3V73H-6XT7C

- 윈도우10 PRO 제품키(tamario@naver.com 메일로 받음)
[마이크로소프트]윈도우10 Home 제품키(MS정품) 64/32비트 겸용(PRO/HOME 가격동일) 이메일10분배송, 가격: 3,600원
https://front.wemakePrjce.com/product/227059017
==============================================================================================================

- 하나손해보험 프로젝트(정품인증)
1. 가지고 간 LG 노트북의 윈도우 10 Pro의 설치일자가 2021.02.13이라서 다시 포맷하고 설치하라고 함(1주내는 인정)
2. 윈도우 10 Pro 다시 설치
 1) 윈도우 10 Pro 정품 인증키 인증: 구매한 정품키(3,000원)로 인증함
 2) MS Office 2013 Standard를 설치(박건유 대리 USB에서 설치): 정품 키 46만원 ==> 윈도우 10 Pro 포맷 후 다시 설치하기로 함
==> 하나손해보험 보안팀에서 확인하고 보안 프로그램 설치를 했는데도 다시 설치
==============================================================================================================

 - 정보보안 서약서 작성 
1. http://securityplus.lgcns.com 
==============================================================================================================

- 하나손해보험 프로젝트 설명(15시, 회의실(구종식 부장))
1. 프로젝트명: 하나손해보험 보험업무통합 시스템
2. 기간: 2021.02.01 ~ 2021.08.31
3. 메리츠 화재 패키지(XP)를 Websquere 로 전환(7300본 --> 3000본 가량 개발)
 1) 3월 12일에 응용팀에서 골라줌
 2) 구체적인 가이드나 현업이 없음
 3. 구종식 부장이 PL: 개발자 40명 정도 필요
 4) 나도 4개 카테고리 중 하나를 맡아서 개발자 관리하라고 함(엄청난 리스트)
==============================================================================================================

- 하나손해보험 Prj 요약
1. 프로젝트명: 하나손해보험 보험업무시스템 구축
2. 고객사 : 하나손해보험
3. 수행사 : LG CNS
4. 프로젝트 특징
 1) 메리츠화재 시스템을 하나 손해보험에 맞게 적용하는 프로젝트 (솔루션 이행 경로)
  2) 총 17개월의 사업기간3) 프로젝트 룸 : 서울시 중구 종로플레이스 9. 10층
5. 사업기간 및 주요 마일스톤
 1) 전체 사업기간 : 21/01/07 ~ 2206106 (총 17개월)
   - 패키지 GAP 분석 단계 : 21/01.07 ~ 21,05107 14M)
   - 패키지 커스터마이징 : 21:05 10 ~ 21, 10:01 (TM)
   - 테스트 및 이행 단계 : 21:10:04 ~ 22:03/04 (5M)
   - 시스템 오픈예정일 : 22/02/21
   - 안정화 단계: 22/03/07 ~ 22/06/06
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.02(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 중식후 보도(다이소 명동점 갔다 옴), 다와DC마트에서 구입한 변기 덮게 반품(20시, 크기가 안 맞음)

- 하나손해보험 Prj[★]
1. 사번 : 5210089
==============================================================================================================

- 윈도우 10 Pro 포맷 후 다시 설치
1. 윈도우 10 Pr 정품 인증키(3,000원) ==> 진태만_윈도우 정품인증.png
2. MS Office 2013 Pro plus 정품 인증키 구입(3,800원)( tamario@naver.com 메일로 받음) ==> 진태만_ms 정품인증.png
 1) Office 2013 제품키: TJN6D-R4XJP-WPCPP-KJ7FX-Y7R3H
 2) 쿠팡에서 주문 ==> https://www.coupang.com/vp/products/2187650770?vendorItemId=71705572467&isAddedCart=	
3. V3 lite 설치: 보안 검사 ==> 진태만_보안검사.png
==============================================================================================================

- 파일 서버 
http://10.1.42.101:7080/hana_files, lgcns_user/lgcns@0107
http://10.1.42.101:7080/m_files, lgcns_user/lgcns@0107
==============================================================================================================

- PC 캡처 증빙 올리기
진태만 5210089 윈도우즈 정품인증.png
진태만 5210089_오피스 정품민증.png
진태만 5210089 악성코드검사.png
==============================================================================================================

- 폰트 설치
- 크롬 설치
- 메신저(Hana Messenger) 설치
- 오케스트라
http://10.1.42,101:9080/orca, 진태만/1212**
==============================================================================================================

- 메일(MS Outlook) 설정 방법
1, tamario@pms-field.Igcns.com
==> tamario@kakao.com
==============================================================================================================

- 하나손해보험 보안 프로그램 설치
==============================================================================================================
 
- 잉크젯 프린터 구입
http://www.enuri.com/detail.jspmodelno=14903162&condiDelivery=N
 
1. 삼성전자 SL-J1660 [무한잉크(외장,~500ml)], 가격: 80,720원
-------------------------------------------------------------------------------------------------------

- 가성비 프린터라는 삼성 SL-J1660 복합기 내 돈주고 사서 언박싱 후기
https://youtu.be/yN-HYMLzYZw
==============================================================================================================
  
- 햄스터 용품 구입
[A923028420] PSP 건강혼합사료 600g 5봉 햄스터 사료, 케이지(1개), 이불, 총 가격: 22,500원
http://www.enuri.com/detail.jspmodelno=22081939
http://itempage3.auction.co.kr/DetailView.aspxitemNo=A923028420&frm3=V2
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.03(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 갤럭시 노트9 주문(14시, 헬로모바일)

- 하나손해보험 Prj[★]
- 프로그램 설치 
1. WS5_HANA, zip 파일을 압축 풀어서 C:\WS5_HANA에 폴더에 붙여넣기
==============================================================================================================
 
- Hana Messenger 설치 
1. 소속사: 하나손해보험, 5210089/20오*h@
==============================================================================================================

- 당근 마켓 어플에 물건 팔기
1. 전자레인지 판매합니다.(3만원)
2. 전기 온풍기 판매합니다.(만원) 
3. 선풍기 판매합니다.(오천원) 
4. 교자상 판매합니다.(오천원) 
5. 교자상 판매합니다.(삼천원. 찍힌 흔적) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.04(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 델 모니터 가지고 홈(12시, 오태범 이사), 모니터 안에서 LG 노트북 전원 발견(오이사가 회사에 청구가 처리: 
								, 멀티탭 4구(8천 5백원) 구입(14시, 오태범 이사가 처리: 박건유 대리가 구입해서 줌), 현대카드 신청
								, 눈 쌓임(06시, 어제 20시부터 눈 내림, 날이 따듯해서 오후에 대부분 녹음), 현대카드 신청(현대카드앱에서)
 
- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석
- ng.ux 분석 (D: \M_DEV\workspace\wng.ux)
1. FNCCLAK0101: 사고조사 의뢰 및 회신
==============================================================================================================

- 하나손해보험 Prj 업무 분석 
1. 상품: PD
2. 장기보험: 
3. 자동차보험  CT(일반/재보험)
4. 보상손사: CL
5. 통합 입출금 : FA
6. 업무공통: CM
7. 통합고객 : CU
8. 영업관리: SA
==> 7,348본 중 3,300본 개발 예정
==============================================================================================================

/"
<P>Application 로딩된 후 발생 </p>
*/
function application_onload(obj: Object, e:LoadEventInfo) {
	trace("[/mef_ngonline.xprj] [application_onload] [TEST_01] [메리츠 화재 프로젝트 시작 @@@@@@ ===> ");}
}
==============================================================================================================

- 시작 프로그램 관리 설정
 1. 윈도우키 + R: shell:startup ==> 시작 프로그램 폴더 Display
==============================================================================================================

- LG헬로비전-현대카드M Edition2(청구할인형) 신청
https://www.hyundaicard.com/cpc/cr/CPCCR0201_01.hccardflag=RC&cardWcd=MCJHE2D
1. 혜택: 서비스 이용요금 월 최대 2만원 청구할인
2. 할인내용:
전월 이용 실적 30만원/70만원 이상 시 할인 적용 실적에 따라 1.7만원/2만원 할인 적용
1) 전월 이용금액 30만원 이상 70만원 미만 시 1만7천원 할인
2) 전월 이용금액 70만원 이상 시 2만원 할인
3. 발급신청모바일 신청(현대카드 App)
1) 신청방법Google Play 또는 App Store 접속 → 현대카드App 설치 → 카드신청 및 제휴 탭 클릭
→ LG헬로비전 현대카드M Edition2 발급신청
4. 연회비 : 국내전용 15,000원 / 국내외 겸용 MasterCard 20,000원
 1) 국내외겸용(UnionPay) 15,000원(기본 연회비 5,000원 + 제휴 연회비 10,000원)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.05(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 13:00 ~ 18:00 ==> 갤럭시 노트9 중고 배송 및 개통(16:30, 2년 약정), 장롱 위치 재이동(20시, 현아트빌)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석 
- ng.ux 분석
==============================================================================================================
 
- 메리츠 화재 업무 분류 
1. 일반보험(CTN), 장기보험(CTN), 자동차보험(CIN), 보상손사(CL), 영업관리(SA)
	, [통합고객 (CU), 입출금(FA), 업무공통(CM), 상품(PD)] 
==============================================================================================================
 
- 메리츠 패키지 화면 접속 방법 
1. host 파일 변경 
C:\Windows\System32\drivers\etc|
 1) host 파일에 아래내용 추가 
10.154,201.31 portaltest.meritzfire.com 
10.154.201.31 bsrapptest.meritzfire.com

2.포탈접속
1) http://10.154.201.31:15030/ 	==> Internet Explorer으로 만 접속 가능
2) 사용자 아이디 : 114203650
==============================================================================================================

 갤럭시 노트9 중고 개통(2년 약정)
1. 갤럭시 노트9 중고 배송 및 개통(16:30, 2년 약정) [2021.02.05(금)] 
======================================================================================================

- LG 헬로 모바일 LG 알뜰폰 휴대폰 갤 노트9 중고 개통(2년 약정)
■ 기본 가입내역 안내
0. 개통일: 2021년 2월 5일(금)
① 모델명 : 중고폰_갤럭시 노트9_128G(SM-N960N)
② 요금제 : 보편 안심 15GB 100분(월 56,100원) [음성 100분/메시지 100건/데이터 15GB: 소진시 3Mbps로 계속 사용] 
③ 약정 기간 : 24개월
④ 핸드폰 금액 : 0원(단말기 출고가: 550,000원: 무로) ==> 할부원금: 0원
⑤ 월 통신 요금: 약 27,300원
  1. 기본요금: 56,100원
  2. 단말 특별 할인: 8,800원[요금제 바꾸면 없어짐)
  3. 제휴카드 할인: 20,000원(월 70만원 이상 사용시) ==> 17,000원(30만원 이상 70만원 미만 사용시)
⑥ 가입비(3개월 분납): 14,400원
④ 유심(최초 1회): 8,800원
⑦ 납부방법 : 신용 카드(말일) - 현대카드
                  ==> 한달에 30 ~ 70만원 만 7천원 할인 ==> 3년을 사용해야 함
⑧ 부가서비스 : 유료부가서비스 없음 
⑨ 개통대리점 : 
⑩ 사용중인 통신망: LG 통신망(알뜰폰)
⑪ 갤럭시 노트9용 충전기는 배송 됨
⑫ "중고폰 특성상 방수, 방진 기능은 사용할 수 없습니다." 라는 문구로 배송됨
=====================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.06(토) 작업 ■■■■■■■■■■■■■■■■■■ 
--->07:30 ~ 20:00 ==> 
 
- 주말[★]
05:00 기상
05:40 조식
06:15 집출발
06:28 신대방역 --> 대림역 --> 군자역
07:20 군자역 2번 출구 도착
07:30 희망내과 도착(예약 리스트에 이름 작성: 3번째)
07:40 도보
08:20 종료
08:40 희망내과 오픈
08:50 혈당 검사: 126(식후 3시간 후 검사)  
09:10 진료(송필훈 원장): 인슐린 펌프 중고로 판매하라고 함 ==> 2021.01.22(금)에 검사한 당뇨합병증 검사 결과가 잘 나왔다고 함
       :  약물 치료로 계속하자고 함(1일 한 알)
09:20 조제(당뇨약: 한 달분, 푸른약국)
09:30 종료
09:40 군자역 --> 고속터미널역 --> 옥수역
10:20 옥수역 4번 출구 도착
10:40 태용 만남
10:45 성동12번 마을버스 탑승
11:00 서울방송고등학교.남산타운아파트 정류장 하차
11:10 서울숲.남산길(매봉산) 산행
11:30 매봉산 팔각정 도착(전망대 멋있음: 구름 조금)
11:40 남산타운아파트(하산) --> 버티고개역 --> 약수역
12:20 중식(된장국, 보쌈, 시골밥상): 태용이가 쏨
12:50 종료
13:00 약수역 --> 교대역 --> 신대방역
13:40 태용이 숙소 앞(태용이와 헤어짐) 
13:51 다이소 난곡사거리점에서 구입한 변기 덮게로 화장실 변기 덮게 교체 ==> 주인(문현철에서 비용(5천원) 청구함
		위생 자동 칫솔 홀더 구입, FOR LG HDMI-HDMI 케이블(반품: 노트북 소리 안 나옴) 구입
14:00 귀가
14:30 낮잠(피곤함)
17:30 기상
18:11 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
23:00 취침
==============================================================================================================

- 모니터 받침대 구입
1. M하라코리아 모니터 받침대 3칸서랍, 색상 : MS-1DM-3_민트, 가격: 12,720원
http://www.enuri.com/detail.jsp?modelno=17001952
http://item.gmarket.co.kr/detailview/item.asp?goodscode=820158444
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.07(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 21 30 ==> 

- 주말2[★] 
07:00 기상
07:40 조식
08:00 실내 도보
09:00 종료
09:10 인터넷 서핑
12:00 중식 
12:30 실내 도보
13:30 종료
13:40 인터넷 서핑 ==> 핸드폰 사진 옮기기
18:11 석식
18:20 실내 도보
19:20 종료
19:30 집출발(화분 버리기: 자전거) ==> 자전거에 화분 싣고 가다가 화분 깨짐: 흙 청소하고 흙은 도림천에 갖다 버림
		--> 화장실 변기 뚜껑 버림
20:00 다와DC마트에서 점에서 HDMI-HDMI 케이블(노트북 소리 안 나옴) 구입
20:10 귀가
20:20 tvN 코미디빅리그 시청
21:10 청소(청소기, 밀대)
21:30 샤워
22:00 인터넷 서핑
23:30 취침
==============================================================================================================
  
- 4만원 이하! 직접 써보고 추천드리는 가성비 생활용품&전자제품 5종
https://youtu.be/q1fxh3Y_Y1M
==============================================================================================================

- 이전 스마트폰에서 갤럭시노트9로 데이터 카톡 옮기기
https://youtu.be/MhwHaigMPPg
==============================================================================================================

- LG U+ PASS앱으로 운전면허증도 모바일로 한번에 PASS!
https://youtu.be/UAuGmPPn2Y0
==============================================================================================================

- HCN 현대 방송(인터넷, TV)
https://www.hcn.co.kr/www/prod/internet/speed.jsp
1. 고속인터넷 월 16,500원 방송과 함께하면 월 9,900원 가입상담 신청
 1) 인터넷 4년 약정 기준, 장비 임대료 포함
 2) 방송 결합 요금: 셋탑 방송 결합시 (UHD, 스마트HD, HD상품)
2. 기가인터넷 월 23,100원 방송과 함께하면 월 19,635원
 ==> https://www.hcn.co.kr/www/prod/internet/giga.jsp
==============================================================================================================

- 르까프 신발 구입
1. 르까프 남성 블랙컬러 랜드로바스타일 워킹화 솔로 1120NSW303, 블랙/270, 가격: 55,060원  
http://www.11st.co.kr/products/3163345501?xfrom=order%5Elist&xzone=order%5Elist
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.08(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 당뇨혈당지 구입(09:20, 24만원), 삼성 프린터 무한 잉크 반품 관련 11번가 콜센터 전화(09:40)
									, 현대카드 수령(15:30), 사업장)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석
- 가계약목록조회(/FNGCTGF0007.xfdl) 분석[공통 ==> 가계약/청약]  ==> 완료[♥♡] 
==============================================================================================================
 
/**
<p>Form이 로딩된 후 발생 </p> ==> 주석: 2021.02.08. by 진태만 ■
*/
function FNGCTNLO210_onload obi:Form, e:LoadEventInfo){
	trace("[/FNGCTNLO210.xml] [FNGCTNL0210Lonload()] ==> [TEST_01] [화면 로딩...@@@]");
}

/**
<p>20131112 가계약조회 고객 조회 조직기준변경 SJH ==> 주석: 2021.02.08. by 진태만 ■
 - 조직항복 초기화 </p>
*/
function fnInitEdtOrgltm) {
	trace("[/FNGCTNLO210.xml] [fnInitEdtOrgitm()] ==> [TEST_01] [고객 조직정보 초기화]"): 
	
	edtOrgld, value = "";
	edtOrgDivCd, value = "";

	comCustNm.setOrgld(edtOrgid, value); 	// 조회구분 Div 세팅(조직코드)
	comCustNm.setOrgDivCd(edtOrgDivCd.value); 	// 조회구분 Div 세팅(조직명)
}
==============================================================================================================

- 메리츠 패키지 메타관리시스템 
http://10.154.201.31:19051/wisemeta, hana/hanafire!2 
1. 사용하시기 전 반드시 브라우져 (IE)의 호환성보기 설정 
==============================================================================================================

- 현대카드 발급 
- [현대카드] LG헬로비전-현대카드M Edition2(청구 할인형) ==> 2021.02.08(월)[주거래 카드] @@@
1. 카드번호: 6243 6800 6630 9900, 유효기간: 01/26, 035, 비번: 5**1 --> 결제일: 25일, 결제은행: 신한은행
2. 혜택
 1) 연회비: 만 5천원
 2) 할인 조건
  가. 월 30만원 ~ 100만원 사용: 1만 7천원 
  나. 월 100만원 이상 사용: 2만 할인 
3. 결제 은행 계좌: 신한은행 두드림 통장(130-20-502841)  
https://www.hyundaicard.com, tatmario2/20*0오**h
4. LG 모바일 사용과 연계: 3년 이상 사용해야 함
================================================================================================================

- 나눔 90, 91 동기회 회비 자동이체 처리 ■
1. 2만 원 신한 송금[농협: 302 1035 8383 11, 예금주: 문태용]
 1) 기간: 2021.02.28 ~ 2030.02.28 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.09(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 석식(17:30, 편의점 김밥), 삼성 프린터 무한 잉크 설치(18시, 용산 원효로)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석
- 가계약목록조회(/FNGCTGF0007.xfdll) 분석[공통 ==> 가계약/청약] ==> 완료[♥♡]
<Form Id="FNGCTGF0007" classname="FNGCTGF0002" inheritanceid="" position="absolute 0 0 930 507" titletext="계약목록">
==============================================================================================================

- 전체상품조회 (VENGCTNC0104, xfdl) 분석[공통 ==> 가계약/청약] ==> 완료[♥♡]
==============================================================================================================

- 상품 추천ENGCTNCO 105. fdl) 분석[공통 ==> 가계약/청약] ==> 완료[♥♡]
==============================================================================================================

- 개발자 회의(13시, 소회의실)
1. 하나손해보험 Pri 개발 종료 및 오픈: 8월 말 
2. 개발 관련 매뉴얼이나 자료 없음(\
 1) 단위 테스트, 통합 테스트 고민(구종식 부장)
3. 다음주에 W-craft 전환툴 사용해서 전환 예정
 1) 기본 틀, 라이브러리 구성
4. 업무 분장 예정
 1) 6파트(리더)로 구성
 2) 2월 말까지 추가로 개발자 투입될 예정
==============================================================================================================

- 삼성 무한잉크 프린터 설치(18시, 용산 방문)
17:30 석식(김밥, GS25 편의점)
18:00 퇴근(프린터를 카트에 묶어서 끌고 감)
18:20 종로5가 정류장(262번 버스 승차)
19:00 원효로2가 정류장 하차
19:10 서울 용산구 신계동 36-7 도착(프린터 판매점, 2층) ==> 삼성 무한잉크 프린터 설치: 설치비 2만원 지급
19:20 종료
19:40 용산전자상가10동 정류장(505번 버스 승차)
20:00 서울지방병무청 정류장 하차
20:20 대방교회 정류장(동작05번 마을버스 승차)
21:00 보라매공원 입구 정류장 하차
21:10 귀가 
21:30 삼성 무한잉크 프린터 테스트 ==> 잉크 약간 뭍어나지만 성공적으로 설치됨 
23:30 취침
==============================================================================================================

- 삼성 SL-J1660 드라이버 설치방법 잉크하우스
https://m.blog.naver.com/hanjuni225/221412314083
==============================================================================================================

- 프린터 처리 완료(회사에 청구할 것)
1. 윈도우10 정품 인증 키 구입(3,600원)
https://front.wemakePrjce.com/product/227059017
2. MS Office 2013 Pro plus 정품 인증키 구입(3,800원)
https://www.coupang.com/vp/products/2187650770?vendorItemId=71705572467&isAddedCart=
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.10(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 16:30 ==> 설날 연휴 전날, 이발(07:30, 4천원, 공원 이발[종로]), 당뇨 소모품비 청구(12시, 건강보험공단 종로지사 15층)
								, 포항행 (24:30. 강남터미널)
 
- 하나손해보험 Prj[★]
- 메리츠 화재 패기치 (XP) 분석
- 카드BIN관리(/FNGFAIC0010.xfdl) 분석 [입출금 ==> 카드]
1. 조회 결과 나옴 ==> 완료[♥♡] 
==============================================================================================================
 
- 자동차사고접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
==============================================================================================================

- 당뇨 소모품비 제출(12시, 건강보험공단)
1. 건강보험공단 종로지점(15층, 종각역 근처)에 가서 소모품비 청구
==============================================================================================================
 
- 설날 연휴 전날★]
05:00 기상
05:40 조식
06:15 집출발
06:28 신대방역 --> 을지로입구역
07:30 이발(공원 이발, 4천원): 마음에 듬
08:25 사업장(종로 플레이스 10층)
07:40 업무 
11:30 중식(김밥, GS25 편의점)
11:50 도보
12:40 종료 
13:00 업무 
16:30 종료
16:40 퇴근
17:30 귀가
18:00 석식
18:20 실내 도보
19:20 종료 
19:30 인터넷 서핑
22:00 염색
22:30 샤워
22:50 집출발: 행거, 여행용 케리어, 백팩 ==> 짐 엄청 무거움
23:00 신대방역  도착
23:20 교대역 --> 고속터미널역 하차
23:50 고속터미널역 도착(24:00 고속버스 예매 취소함[위약 수수료: 3천 4백원)
00:30 포항행 고속버스 탑승
00:40 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.02.11(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 설날 연휴

- 설날 연휴[★]
04:18 포항 고속버스 터미널 도착
04:20 택시 승차
04:27 우광맨션: 택시 하차(5,600원)
04:30 포항집 도착
05:50 취침
08:00 기상
08:30 조식(수종이와 같이 식사)
09:00 실내 도보
10:00 종료 
12:00 중식 
12:30 실내 도보
13:30 종료
14:20 집출발(엄마, 수종)
14:40 두호주민센터 정류장 --> 죽도시장 정류장
15:15 옷가게: 수종 티, 조끼(총 6만 8천원: 엄마가 6만원에 구입)
15:25 다이소 포항 죽도시장점 ==> 밴드형 2단 도시락(수종)
15:40 종료
15:50 죽도시장 정류장 --> 두호주민센터 정류장
16:10 귀가 
16:20 리플러스: 귤 5kg 구입(7,900원)
18:11 석식
18:20 실내 도보
19:20 종료
22:00 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2021.02.12(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 설날

- 설날[★]
07:40 기상
07:50 차례 준비
08:10 차례 지내기: 수종이와 같이
08:50 종료
09:00 조식
09:30 도보: 영일대 해수욕장 --> 환호해수욕장 --> 환호 등대
10:30 종료
12:30 중식 
13:00 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞
14:20 종료 
18:11 석식
18:20 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 
19:40 종료 
20:10 귀가 ==> 큰누나네 방문: 큰누나에게 이발 기구 선물함
				==> 큰 매형 눈썹, 쌍거풀 수술, 령경 쌍거풀 수술 
20:30 큰 매형이 령경이와 말싸움해서 난리남
23:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.13(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 설날 연휴3

- 설날 연휴3[★]
07:00 기상
07:20 조식 
08:00 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞
08:20 종료
12:30 중식 
13:00 도보: 영일대 해수욕장 --> 환호해수욕장 --> 환호 등대
14:20 종료 
15:13 다이소 두호점 ==> 화장실 칼판 3개 구입
15:30 리플러스: 케찹구입(2,980원)  
18:11 석식
18:20 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 
19:40 종료 ==> 큰누나네 돌아감
20:10 귀가
23:30 취침
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.02.14(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 설날 연휴4(비 조금 옴)

- 설날 연휴4[★]
07:00 기상
07:20 조식 
08:00 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞
08:20 종료 
12:30 중식 
13:00 도보: 영일대 해수욕장 --> 환호해수욕장 --> 환호 등대
14:20 종료 
15:00 작은 아버지 내외 방문 ==> 수종이에게 새뱃돈 2만원 줌 
16:00 수종이 국민은행 통장에 12만원 입금 시킴
17:30 석식
18:00 집출발(도보: 여행용 가방)
19:00 포항 고소버스터미널 도착  
19:10 포항 출발
23:00 서울 강남터미널 도착
23:10 고속터미널역 --> 교대역 --> 신대방역
23:40 귀가
24:00 청소
24:20 샤워
02:30 취침
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2021.02.15(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근 길 비 조금(07:30, 우산 없이 출근), 개발자 4명 투입 (9) 김홍균 부장(65년생, 김제): 바나하나 손해보험 Pri

- 하나손해보험 Prj[★]
- 자동차 사고 접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수] 
==============================================================================================================
    
- 로컬 PC에 하나 손해보험 Rrj eclipse 셋팅
1. 소스 압축 풀기(7Zip 사용)
1) W:\7000 개인별 작업 공간\이경일 WS5_HANA.72: 마우스 우 클릭 ==> 7-Zip ==> 압축풀기 ==> 맙축풀기(새창)
압축 풀(X): C:\, 암호: 1: 클릭 ==> C:\WS5_HANA 폴더에 풀림
==============================================================================================================

- SVN 로그인 정보
1. 5210089/5210089
==============================================================================================================

- 이삿짐 주방짐 포장방법
https://youtu.be/En4D7zIegQE

- 참좋은 이사_접시_종이포장_이사준비
https://youtu.be/9yHOE8Rj7ps
==============================================================================================================
 
- 핸드폰(갤 노트9)으로 모바일 핫스팟 정보 연결[201.02.15(월)]
1. 설정 > 연결 > 모바일 핫스팟 및 테더링 > 모바일 핫스팟: 사용중 터치
==> 00. galN9_3072_0898/05080508
==============================================================================================================

- PC로 실시간 TV 무료 시청하는 방법 [스마트홈 만들기]
https://youtu.be/h_WcDEtVB9E

- 스마트폰 실시간 TV 무료 시청 방법ㅣ무료티비 실시간 TV
https://youtu.be/eOpuiCfHlTA
1. 착한 TV, 온에어 TV
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.16(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 현아트빌 404호 상태 확인 (8시, 낙원 부동산 사장에 전화: 전 주인이 매매 했다고 함, 등본은 깨끗)
								, 쌍봉 의료기 방문(10시. 종로5가역. 케어센스N 보이스 혈당기 무료로 받아홈, 혈당지 개당 220준다고함 [현재 : 
								소모성 재료 서류 가지고 가면 개당 240원에 구입했음]), 오전부터 눈(10시, 당뇨 소모성 재료 청구금 입금
								(14:30, 202,500원[90% 환급]): 마지막 청구태용이한테 마스크 스트랩 얻음(21시, 태용이 차에서 가지고 홈)
 

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지 (XP) 분석
- 자동차 사고 접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
==============================================================================================================
 
- 현아트빌 404호 등기부등본 받음(8시, 낙원부동산)
1. 낙원부동산에 전화해서 등기부등본상 대출 상태 확인 요청
2. 낙원부동산에서 이전 주인(문현철)이 현아트빌 404호를 팔았다고 통보 받음
 1) 대출 이력은 모두 사라졌다고 함
3. 일남이한테 전화해서 문의
 1) 매매가가 2억 8천 5백인데 다운계약 같다고 함(전 주인이 2016년 12월에 2억 2천 5백에 매입함)
 2) 전세보증보험 굳이 들 필요가 없다고 함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.17(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 마지막 한파(7시, 영하 10도), 주간보고 작성(11시, 처음 작성): 주간보고 06 주차_20210219

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지 (XP) 분석
- 자동차 사고 접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
==============================================================================================================
 
- 개발자 회의(10시, 소회의실)
1. 개발 파트 6개로 나눔파트 나눔
 1) 일반보험(CT), 장기보험(CT), 자동차보험(CT), 보상손사(CL), 영업관리(SA), 통합고객, 입출금, 업무공통, 상품(CU/FACN)
2. 내가 보상손사(CL) 파트 맡음(1,457본 개발, 파트 개발자 총 4명)
 1) 개발자 17명 더 투입되어야 함 
3. 업무를 모르고 기초 데이타가 없어서 개발이 어려움
 1) 구종식 부장이 응용팀 섭외해 본다고 함 
4. 다음주부터 개발 시작 
 1) Websquare, XP 전환 고민
==============================================================================================================

- 서울도시가스 사용계약번호 등록(자가검침용)
- 서울도시가스 사용계약번호 등록(자가검침용)
https://www.seoulgas.co.kr/front/mypage/useConNo.do
==============================================================================================================

- USB 선풍기( 탁상용 선풍기 아이보우 IVDF-S400) 구입 
1. 제조사: 아이보우|브랜드: 아이보우|선풍기|스탠드형|탁상용|USB충전식|BLDC모터(브러시리스)|5엽날개|상하각도조절|좌우회전
|바람세기:4단|안전망분리|최대소비전력:5W|3~12시간사용,4시간충전|크기:16.8 x 14.6 x 25.9cm, 가격: 14,990원
http://www.enuri.com/detail.jsp?modelno=38263252
http://www.lotteimall.com/goods/viewGoodsDetail.lotte?goods_no=12653524&infw_disp_no_sct_cd=40&infw_disp_no=0&allViewYn=N
===================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.18(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 가스레인지 판매 실패(20시, 당근 마켓 보고 집에 찾아온 구매자가 구입 후 너무 크다고 반품함), 개발자 1명
								투입(9시, 서일석 부장)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지 (XP) 분석
- 자동차 사고 접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
==============================================================================================================
  
- 가스 신규 등록(10시, 서울가스 콜센터) 
1. 관악구 조원로 159-1 현아트빌 404호, 신한은행 자동이체 등록: 자가 검침할 필요 없음
==============================================================================================================

- 수종 액정보호 필름 구입
1. [C216496375] 핵 방탄 액정 보호 필름 2매 갤럭시A10E A102, 가격: 4,410원
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=C216496375&frm3=V2
==============================================================================================================

- 태블릿 사기 전 꼭 보세요! 가격대별 태블릿 추천제품들 (갤럭시탭, 아이패드 등) [테크몽]
https://youtu.be/7mD8f2UL5rA

- 삼성전자 갤럭시탭A 10.1 (2019) WiFi 32GB [리퍼,해외쇼핑], 가격: 235,820원
http://www.enuri.com/detail.jsp?modelno=51649730
https://www.g9.co.kr/Display/VIP/Index/1864651425?jaehuid=200006435
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.19(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 탁상용 선풍기 도착(16시, 종로 플레이스)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지 (XP) 분석
- 자동차 사고 접수(/FNGCLRK0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
1. Load 처리		 ==> 완료[♥♡] 
function fnOnLoad(obi:Form, e:LoadEventinfo) {
	trace("[/FNGCLRK0100.xml] [fnOnLoad()] ==> [TEST_01] [화면 로딩...@@@]" );
}
==================================================================================================================

- 개발 가이드 교육(09:30, 대회의실)
1. 기본적인 개발 준비는 끝났다고 함
 1) 업무코딩 가이드.pptx 참조

- 글로벌 변수 설정 및 호출 방법
1. 글로벌 변수 설정하기
$xpgv.setValue("gy_LTServicelD","TEST");
2. 글로벌 변수 가져오기
var HeavServNm = gv_LTServicelD;
==> var HeavServNm = $xpgv.getValue("gv_LTServicelD");
==================================================================================================================

- 글로벌 데이터셋 호출 방법
0. Websquare에서는 xplatform과 다르게 글로벌 데이터셋이 없기 때문에 함수를 통해 가져오는 것으로 전환I

1. 글로벌 데이터셋 가져오기
var ds_gdsUrl = $xpgv.getDataList("gdsUrl");

2. 글로벌 데이터셋 이용하기 
var v_gdsUserInfo = $xpgv.getDataList("gdsUserInfo"); 
v_gdsUserInfo.insetRow():

$xplib.gf_SetEmpld($xplib.cf_Trim(dsFNGCMCC00055Out.orgId)); 	// 사원ID 
$xplib.gf_SetOrgDivCd($xplib.cf_Trim(dsFNGCMCC00055Out.orgDivCd)); 	// 사원 조직구분 
$xplib.gf_SetEmpNm($xplib.cf_Trim(dsFNGCMCC00055Out.orgNm)); 		// 사원명
$xplib.gf_SetDptld($xplib.cf_Trim(dsFNGCMCC00055Out.hgrkorgid)); 			// 부서ID 
$xplib.gf_SetDptCd($xplib.cf_Trim(dsFNGCMCC00055Out.hgrkOrgCd)); 			// 부서코드
$xplib,gf_SetDptNm( $xplib.cf_Trim(dsFNGCMCC00055Out.hgrkOrgCdNm)); 	// 부서명

var s_orgId = v_gdsUserInfo.getCellData(0, "orgId"); 	// 사원 ID
var s_orgDivCd = v_gdsUserInfo.getCellData(0, "orgDivCd");	 // 사원 조직구분코드
==================================================================================================================
 
- Alert, Confirm 창 호출 방법 
$xplib.cf_Alert("CLI0067", function(rto Value, btnClose Yn){gcm.log(btnClose Yn)} , "누적 결정 보험금이 있는 경우 삭제 불과후 

$xplib.cf_Comalert("1000자 이내로 작성해주십시오.","" {"popupName": "확인"},"default");

$xplib.cf_Confirm("CTI0045", function(rtnValue, btnClose Yn){},"); 

$xplib.cf_ComConfirm(pf_getAdminMsg("1000039", 1),function(rtnValue, btnClose Yn){},{"popupName" : pf_getAdminMsg("20001");
==================================================================================================================

- popup 호출 방법 
$xplib.cf_OpenPopup("/WF/POP::WF001P.xml", "SM1302", "", "left=-1, top=-1, width=300, height=300, title=false, status=false};
==================================================================================================================

- 서비스 호출 방법 
var sServiceld = "FNGCMCCO0156"; 
var sInds = "body=dsFNGCMCCO0055In"; 
var sOutDs = "dsFNGCMCC000550ut=body":

dsFNGCMCCO0055In.setCellData(0, "srchTp, "01"); 
dsFNGCMCCO0055In,setCellData(0, "srchInp", "114203650"); 
dsFNGCMCCO0055In,setCellData(0, "orgClasDivCd", "1"); 

$xplib,cf_Transaction(sServiceld, "", "", sInDs, sOutDs,"", "cfTranCallback", true, "autoalert=false, automsg=alse");
==================================================================================================================
 
scwn.cfTranCallback = function(sSvcId, nErrorCode, sErrorMsg, JSON) { 
	gcm.log(dsFNGCMCCO0055Out.getAllJSON());	// sSvcId : 호출 서비스ID, nErrorCodel 에러코드, sErrorMsg: 에러메세지)
};
==================================================================================================================

- 서비스 호출 방법2
var subInfo = { 
	svId : "FNGCMCCO0156", 
	sync: true, 
	autoAlert: false
}
var inJSON = {
	"body" : [{
					"parentIndex": "0" 
					, "rowIndex": "C"
					, "srchTp": "01"
					, "srchInp": "101203276" 	// default 사원번호
					, "orgClasDivCd" : "1"
				}]};
var argJSON =null;
var callbackFun = function(subErrCode, nErrorCode, sErrorMsg, syld, JSON) {};

com.ezeService(subInfo, inJSON, argJSON, callbackFun);
---------------------------------------------------------------------------------------------------------------------------------

function(subErrCode, nErrorCode, sErrorMsg,  svId, rtnJSON) { 
	subErrCode: 서버통신에러코드, nErrorCode: 서비에러코드, sErrorMsg: 에러메시지, svId : 서비스 아이디, rtnJSON : 서비스 결과값
}
==================================================================================================================

- 비밀번호(암호) 변경 패턴[2021.02.19(금)]
1. 2020오*h@   --> 2020오*ss@[공인인증] [사용중]
2. 30육*h@  --> 마이크로소프트[사용중]
3. 11사십하나@ 
4. 31육*하나@
5. 41칠*하나@
==================================================================================================================
 
- 파일찾는데 아직도 헤매시나요? 1초만에 파일찾는 프로그램 everything
https://youtu.be/304xF7UUN6M
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.20(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
07:00 기상
07:50 조식(라면 2개)
08:20 실내 도보 ==> 빨래
08:20 종료
10:15 집출발(자전거: LG 모니터 자전거 싣음)
10:40 LG전자 관악서비스 센터 방문 ==> LG 모니터  받침대 고장: 설치 요청(LG 모니터가 10년이 되어서 같은 부품 없다고 함
		--> 받침대는 포기하고 인터넷에서 받침대를 구입에서 구멍에 걸어서 사용하라고 함, 모니터 흠집은 없애줌
11:20 자전거 핸들 가운데 부분 장바구니 설치(7천원) --> 자전거 앞 보조 의자 제거(6년 사용한 수종 자리 없앰)
11:50 다이소 난곡사거리점 ==> 인센스 프리미업 직사각 6호(1.5L, 전자레인지용 반찬통) 구입
12:10 귀가
12:20 중식 
12:30 도보:
13:30 종료 
15:13  
18:11 석식(라면 1개)
18:20 실내 도보
19:40 종료
20:45 집출발(자전거: LG 모니터 자전거 싣음)
20:55 다이소 난곡사거리점 ==> 습기 제거제(4개), 깔창, 단선방지 실리콘 커버, 전선 클립, 고무장갑, 숟가락 세트 등 구입
21:50 귀가
23:30 취침
==================================================================================================================
   
- 교자상 판매(당근 마켓 어플에서, 14:20)
1. 교자상 판매합니다.(3천원) ==> 판매 완료(노인 2명이 직접 집에 와서 사감)
==============================================================================================================
 
- 다이소에서 구입할 것[2021.02.20(토)]
1. 하마, 전자레인지 그릇, 깔창, 단선방지 실리콘 커버, 원형 갤패드, 전선 클립, 접착식 카드 케이스
==============================================================================================================
  
- [다이소 홈쇼핑] 전자레인지 밥찜기, 여행용 미니밥솥 밥찜기 진짜 솔직한 후기 
https://youtu.be/ab5--ORWuYw
1. 쌀을 종이컵에 넣고 물을 부은 후 20분 동안 불리기 ==> 전자레인지에 넣고 7분 동안 불리기 ==> 7분 후에 먹기
==============================================================================================================

- 완벽한 하복부를 위해 집에서 하는 9분 운동
https://youtu.be/KvnOb6VRDmo
==============================================================================================================

- 스마트폰 을 TV 또는 모니터에 연결
https://youtu.be/G4SLZZ6Hs6g

- 요이치 드로우N C타입 to HDMI 넷플릭스 HDCP 지원 미러링 케이블 [2m]
http://www.enuri.com/detail.jsp?modelno=44947096
==============================================================================================================

- 스마트폰 초기화 방법 백업및 복원 방법 배우기[공장 초기화]
https://youtu.be/x9mQt_qerWY
==============================================================================================================

- 인덕션 사용법
https://youtu.be/uge705z5FWg

- 전기레인지(인덕션[십자가], 하이라이트[원형 코일])

- LG전자 디오스 HEI1V9
1. LG전자|브랜드: 디오스|전기레인지|인덕션|1구|프리스탠딩|상판:세라믹글라스|쇼트세란|소비전력:2,000W, 가격: 118,370원
http://www.enuri.com/detail.jsp?modelno=32925878
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.21(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
07:30 기상
08:10 조식(라면 1개)
08:30 실내 도보
09:30 종료
09:40 인터넷 서핑
12:10 중식 
13:30 도보
14:30 종료 
14:40 인터넷 서핑
18:11 석식(라면 2개)
18:20 실내 도보
19:40 종료  
20:00 TV 시청(코미디빅리그)
21:00 행운의 인슐린 펌프 판매 글 올리기(네이버 중고카페)
22:00 축구 스타킹 판매 글 올리기((당근 마켓에 판매)
22:10 인터넷 서핑
23:10 청소
23:20 샤워
23:40 취침
==============================================================================================================

- 갤럭시 S8 포맷(공장 초기화)
1. 착한 TV, 카카오 TV 만 설치해서 집에서 TV 볼 때만 사용할 예정
==============================================================================================================

- 핸드폰 최적화(갤럭시 노트9 기준) [2021.02.21(일)]
1. 배터리 % 퍼센트로 잔량 표시하는 법(설정 ==> 알림)
 1) 상태표시줄 ==> 배터리 용량 표시: 설정 처리
 2) 최근에 알림 보낸 앱 ==> 모두 : 미설정 처리

3. 디스플레이(설정 ==> 디스플레이)
 1) 밝기 최적화: 사용 중 처리
 2) 화면 해상도: FHD*(2220*1080) 처리 
 3) 화면 자동 꺼짐 시간: 1분 동안 사용하지 않을 때: 처리
 4) Edge screen: 미 사용 처리
 5) 내비게이션 바: 버튼 사용 처리
  
4. 잠금화면(설정 ==> 잠금화면)
 1) 화면 자금 방식: 패턴, 홍채 --> 사용 중 처리
 2) Always On Display: 항상 켜기 처리
  
5. 위치(설정 ==> 위치)
 1) 위치 --> 사용 안 함 처리
 
6. 유용한 기능(설정 ==> 유용한 기능)
 1) 빅스비 버튼 ==> 두 번 눌러서 빅스비 열기: 처리
 2) 한 손 조작 모드 ==> 버튼: 처리
    
7. 디바이스 케어(설정 ==> 디바이스 케어)
 1) 배터리 사용 내역(배터리)
  가. 앱 별 사용 시간,백그라운드 확인
 2) 배터리 관리 모드(배터리)
  가. 최적화 모드: 처리
3) 앱별 배터리 사용 관리(배터리)
  가. 배터리 최적화: 처리
  나. 사용하지 않는 앱을 절전 상태로 전환: 처리
 4) 충전(배터리)
   가. 고속 무선 충전: 처리
   
7. 개발자 옵션(설정 ==> 개발자 옵션)
 1) 창 애니메이션 배율: 애니메이션 사용 안함: 처리
 2) 전환 애니메이션 배율: 애니메이션 사용 안함: 처리
 3) Animator 길이 배율: 애니메이션 사용 안함: 처리 
  --> 개발자 옵션 활성화하는 방법 
  (설정 ==> 휴대전화 정보 ==> 소프트웨어 정보 ==> 빌드번호: 여러번 클릭)
    
8. 홈 화면에 바로가기 앱 추가하기
 1) 홈 화면 빈 곳을 길게 누름 ==> 홈 화면 설정 ==> 홈 화면에 앱 추가 ==> ON
==============================================================================================================
 
- 스마트폰 최적화 하는 방법 을 알려드립니다 (핸드폰 속도향상, 상태점검 등) [IB 96]
https://youtu.be/zV0x39EgY2g

- 갤럭시 꺼야하는 설정 9가지 / 배터리,데이터 아끼기, 위치 추적 방지 / 노트20 S20 노트10 S10
https://www.youtube.com/watch?v=66oW7eB_hSA&ab_channel=%EC%97%90%EC%9D%B4%ED%8A%B8ATE
==============================================================================================================

- 스마트폰 과 PC 를 삼성플로우 를 이용해서 간단하게 연결해서 핸드폰 과 컴퓨터 를 편리하게 사용 [IB 96]
https://youtu.be/xv04rHsnnyI
==============================================================================================================

- 축구 스타킹 판매(당근 마켓에 판매)
1. 8컬레 5천원에 올림
==============================================================================================================

- 행운의 인슐린 펌프 판매(펌프 2년 착용 후 당뇨 90% 완치)(네이버 중고 카페)
1. 1,200,000원에 올림
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.22(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 류진영 차장 투입(9시, w-craft), 강은영 책임 투입(9시, 퍼블리셔)

- 하나손해보험 Prj[★] 
- 메리츠 화재 패키지(XP) 분석 
- 자동차사고접수(/FNGCLRK0100.xfdl)
1. 검색 처리
/**
* 검색 버튼 클릭 이벤트 ==> 주석: 2021.02.19, by 진태만
"/
function btnSich_onclick(obj:Button, e:ClickEventInFo) 
{	 
	ds_carAcdRctInfBcVo.setColumn(0, "chngDtm", cobChngDno.value);	// 차수에 대한 변경 일시
	ds_carAcdRctInfBcVo.setColumn(0, "acdNoYy", edAcdNoYy.value);		// 사고년도
	ds_carAcdRctInfBcVo.setColumn(0, "acdNoSeq", edtAcdNoSeq.value);	// 사고순번

	var sInDs = "body=ds_car_cdRctInfBcVo"; 	// INPUT Ds
	var sOutDs = 	// OUTPUT Ds
	"ds_carAcdRictinfBcVo=body"+	 // 자동차 사고접수 정보
	"ds_smovMovpelnfBcVo=body.smovMovpelnfBcVo"+ 	// 현장출동 출동자 정보
	"ds_umovMovpelnfBcVo=body.umovMovpelnfBcVo+ 	//긴급출동 출동자 정보
	"ds_carCtrcoHagGnrInfBcVo=body.carCtrcoHagGnrlnfBcvo + 		// 자동차 계약사항 일반 정보
	"ds_smovDarmMtBcVo=body.smovInfBcVo.smovDamMttBcVo "; 	// 현장출동 피해 사항

	var sArg = "FNGCLRK00007";		//사고접수 조회

	cf_Transaction("FNGCLRK00007", sInDs, sOutDs, sArg, "fnCallback");
}
 
/**
*<p> 콜백 처리 </p> ==> 주석 : 2021.02.19. by 진태만 ■
*/
 function fnCallback(sSvcId, nErrorCode, sErrorMsg) {
	gcm.log("[/SAMPLE.xml] [fnCallback)] ==> [TEST_01] [콜백] [0. 서비스ID]"+ sSvcId +"[1. 에러코드]"+ nErrorCode +"[32. 에러메세지 ]"+ sErrorMsg );
	
	case "FNGCLRK00007":	//사고 조회 
		edtVehcVamt,tooltiptext = edtVehcVamt.value:
		
		fnSmovYnChk(); 	// 현 출정보 조회 
		
		if(ds_smoDamMttBcVo != null) { 		// 현출정보 조회 
			for(var i = 0; i < ds_smoDamMttBcVo.rowcount; i++) {
				ds_smoDamMttBcVo,addColumn("chk", "string");
			}
		}
		
		edtVehcVamt.tooltiptext = edtVehcVarnt.value; : 
		
		rdoPlcstStmYn.value = "2";	// 경찰서 '미신고(2) 기본세팅		
		break: 
}
==============================================================================================================

- 개발자 회의(10시, 소회의실)
1. 개발할 샘플 파일 선정해서 보내기 
2. 개발할 샘플 파일 선정
 1) 실시간접수현황 ==> D: \M_DEV\workspace\ng.ux\cl\r\FNGCLRK0102.xfdl
 2) 보상사 사고접수 자동차사고접수 REQ-CLA-1049 실시간 접수현황[보상 ==> 사고접수]
==============================================================================================================

- 전체 로그 안 보이기 설정(/config.xml 파일에서) 
<!-- 개발 환경에서는 아래와 같이 설정한다. -->
 <!-- <debug value="true" remoteConsole="false" console="true"/> -->
<debug value="true" remoteConsole="false" console="false"/> <!-- 전체 로그 안 보이기 설정 [로컬 서버에서 사용] ==> 수정[2021.02.22, by 진태만]
==============================================================================================================

- 모니터 거치대 구입
1. 카멜마운트 MSH-27 모니터 스탠드형 브라켓 (블랙), 가격: 25,570원
http://www.enuri.com/detail.jsp?modelno=24992946
https://front.wemakePrjce.com/product/252234001
 
- 베사 확장브라켓[VC]1] : 베사 사이즈 200*100, 가격: 8,720원
http://www.enuri.com/detail.jsp?modelno=24037500
http://item.gmarket.co.kr/Item?goodsCode=1943095355  ==> 합산 주문: 34,330원

- 카멜마운트 스탠드형 모니터암 MSH-27 리뷰
 https://youtu.be/M49-scY2RJ4
==============================================================================================================

- 축구 스타킹 판매(당근 마켓에 판매)
1. 8컬레 5천원에 판매 완료: 집에 와서 사감
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.23(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 김홍균 부장, 류진영 차장, 김유리 대리 노트북 포맷 명령(16시, 보안팀에서 불법SW 발견)

- 하나 손해보험 Pri[★]
- 실시간 접수현황(/FNGCLRK0102.xfdl) 분석[보상 ==> 사고접수] 
==================================================================================================================
  
- 자동차사고접수(/FNGCLRA0100.xml) 화면 개발
1. http://localhost:8111/wq/main 	==> 로컬에 셋팅, 퍼블이 안되어서 작업 시작 못 함 
==================================================================================================================
 
- 삼성전자 SL-J1660 [무한잉크(외장,~500ml) 점검..
1. 주민등록등본 1통, 가족관계증명서 2통, 사진 2장 인쇄: 성공
==============================================================================================================
 
- 행운의 인슐린 펌프 판매(펌프 2년 착용 후 당뇨 90% 완치) 판매 글 올림(네이버 중고 카페)
1. 1300,000원에 다시 올림

- 가스레인지 판매 글 올림(네이버 중고 카페)
1. 30,000원에 올림

- 전기 온풍기 판매 글 올림(네이버 중고 카페)
1. 5,000원에 올림

- 어깨 보호기 무료 나눔 글 올림(네이버 중고 카페)
==============================================================================================================

- 노트북 거치대 구입
1. 애니키 F8 접이식 노트북 거치대, 가격: 9,900원
https://www.coupang.com/vp/products/4702677968?vendorItemId=73843771134&isAddedCart=
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.24(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 주간보고 작성 (9시, 7주차 - 20210224)
 
- 하나 손해보험 Pri[★] ]
 -메리츠 화재 패기지(XP) 분석
- 자동차사고접수(/FNGCLRK0100.xfdl) 분석[보상 ==> 사고접수]
1. 등록, 저장 처리
/*
* 피해 입력 등록 버튼 ==> 주석: 2021.02.24. by 진태만 ■
*/
function btnDell01_onclick(obj:Button, e: ClickEventInfo) {
}

/*
* 저장 처리 ==> 주석: 2021.02.24, by 진태만 ■
*/
function fnSave
{ 
	if(saveCheck() == false) {
		return;
	}
	
	var sInDs = 
	"body=ds_carAcdRctInfBcVo " 													+ // 자동차 사고접수 정보
	"body.smovMovpelnfBcVo=ds_smovMovpelnfBcVo "  			 	+ // 현장출동 출동자 정보
	"body.umovMovpelnfBcVo=ds_umovMovpelnfBcVo "   				+ // 긴급출동 출동자 정보
	"body.carCtrcoHagGnrlnfBcVo=ds_carCtrcoHagGnrinfBcVo "  						+ // 자동차 계약사항 일반 정보
	"body.carCtrcoHagGnrlnfBcVo.carCtrCovinfBcVo=ds_carCtrCovinfBcVo" 		+ //  	- 자동차 계약 담보 정보
	body.carCtrcoHagGnrlnfBcVo.carCtrSicInfBcVo=ds_carCtrsicInfBcVo "  		+ //  	- 자동차 계약 특약 정보
	"body carCtrcoHagGnrlnfBcVo, obiLmAmtBcVo=ds_obiLmAmtBcVo "   		+ //  	- 자손 한도 금액
	"body.carCtrcoHagGnrinfBcvo.carCtrCKMHBcVo=ds_carCtrCKMHBCVo "  	+ //  	- 자동차 계약 체크 사항
	"body.carAcdRctAcdMHBcVo=ds_carAcdRctAcdMHBCVo "  						+ // 자동차 사고접수 사고 사항
	"body carAcdRctAcdMttBcVo,acdRelpeCnchBcVo=ds_acdRelpeCnchBcVo "  + // 사고 관계자 연락 채널
	"body.carAcdRctDamMtBcVo=ds_caricdRctDamMHBcVO00 " 						+ // 자동차 사고접수 피해 사항
	"body.gurtBZRItacdInfBcVo=ds_gurtBzBitacdInfBcVo " 								+ // 보장 사업 관련 사고 정보
	"body.acdStdAcdRelpe=ds_acdStdAcdBelpe " 												+ // 사고 관계자
	"body,acdStdAcdRelpe, acdRelpeCnchBcVo=ds_acdRelpeCnchBcVO " 			+ // 	- 사고 관계자 연락 채널
	"body acdStdAcdChrpe=ds_acdStdAcdChrpe  "												+ // 사고 담당자
	"body.cusSchrpelnfBcVo=ds_cus SchrpelnfBcVo "										+ // 고객 CS 담당자 정보
	"body.cusCSchrpelnfBcvo.hmnCoyChrpelnfBcVo=ds_hmnCovChrpelnfEcVo "  + // 	- 담보 담당자 정보인[대]
	"body.cusCSchrpelnfBcvo prdaChrpelnfBcVo=ds_prdaChrpelnfBcVo ";			 + //  - 대물 담당자 정보
	
	var sOutDs = "ds_carAcdRctInfBcVo=body";
	var sArg = "FNGCLBKO0003";
 
	cf_Transaction("FNGCLRKO0003", "", "", sInDs, sOutDs, sArg, "fnCallback");
}

/**
<p> 콜백 처리 <ip) ==> 주석: 2021,02.19. by 진태만 ■
*/
function fnCallback(sSvcld, nErrorCode, sErrorMsg) {

	case "FNGCLRKO0003" : 	// 정상적으로 저장시
		btnSave.enable = false; 
		btnSmov.enable = false; 	// 현출 
		btnUmov.enable = false;	 // 긴출 

	try {
		var smovRctYn = ds_carAcdRcAcdMHBcVo.getColumn(0, "smovRctYn");		// 현장출동
		varumovRctYn = ds_carAcdRcAcdMHBcVo.getColumnto, "umovRctYn");	 	// 긴급출동 접수여부에 1세팅 후 등록	서비스 콜 
 
		if(smovRctYn == "1"){  		
			if(cf_IsEmpty(gl_SmovRctYn) || gl_SmovRctYn != "1") { 
				callSmovCaring(): 	// 케어링 서비스 호출 - 컨텍에서 접수시에만 작동됩니다.
			}	
			cf_Alert("CLI0215", "현장출동접수 및 사고접수 등록");		//alert("현장출동접수 및 사고접수 등록되었습니다. ")
		} else if(umovRctYn == "1") {  
			cf_Alert("CLI0215", "긴급출동접수 및 사고접수 등록");		//alert("긴급출동접수 및 사고접수 등록되었습니다.") 
		}else{ 
			cf_Alert"("CLIO100"):
		}		
		ds_cardcdRctAcdMttBcVo.setColumnlo, "smoyRctYn", ");	 	// 현장출동
		ds_cardcdRctAcdMttBcVo.setColumn(0, "umovRctYn", ); 		// 긴급출동 접수여부에 1세팅 후 등록 서비스 콜
	}catch(e){
	}
	break;
}
==============================================================================================================

- 어깨 보호기 무료 나눔 완료(네이버 중고 카페)
1. 19시 나눔 원하는 사람(어깨 탈구로 수술 준비 중)이 캔커피 하나 주고 받아감
==============================================================================================================

- 모니터 거치대 택배 배송 완료 및 조립
1. LG 모니터에 카멜마운트 MSH-27 모니터 스탠드 설치: 툰툰하고 높낮이가 조절이 잘되어서 만족함
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.25(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 포항행 짐싸기(21시, 집), 돈이 일하게 하라(7시, 존리 메리츠 투자증권 대표)
 
- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석
- 사고접수(상해,질병) (/FNGCLRA0600.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수] : 설계사 사고접수 
1. OnLoad 처리
/**
* OnLoad 시 설정 ==> 주석 : 2021.02.25, by 진태만 ■  ==> 완료[♥♡] 
*/
function FNGCLRA0600_onload(obj:Form, e:LoadEventInfo) { 
	cf_FormonLoad(obj, e); 	// onload

	fnInitCode(); 	// 코드 셋팅 @@@@
	
	fnInitForm} (); 	// set init 
 }

// Init code domain ==> 주석: 2021.02.25, by 진태만 ■ 
function fnInitCode {
	// 신규 접수 
	cf_BindCode(divAcdRct.mainTab.tab2, cobDpcpeRelCd, "201109250088", "선택", false);	// 통보자 관계코드(통보자와 사고와의 관계)
	cf_BindCode(divAcdRct.mainTab.tab2, cobComsCladiCnch1, "201110810005");		// 사고자 관계자 연락 채널 구분코드1
}

// Init form  ==> 주석: 2021.02.25, by 진태만 ■ 
function fnInitForm {
	fnInitDs();
	fnInitPage(); 
}

// Init component   ==> 주석: 2021.02.25, by 진태만 ■ 
function fnInitPage()
{
	divAcdRct.mainTab.tab2.comCustNmS.setCallBackNm("fnCusCallBackNw");	 // 신규 접수 Tab comCustNmS 이름
	// 피보험자 composit 
	divAcdRct.mainTab.tab2.comCustNmS.rsidNo.position = "absolute 0 0 153 24": 
	divAcdRct.mainTab.tab2.comCustNmS.rsidNo.class = "N18_WK_edt_Req"; 
	divAcdRct.mainTab.tab2.comCustNmS.rsidNo.style.align = "left middle"; 
	divAcdRct.mainTab.tab2.comCustNmS.rsidNo.style.font = "나눔고딕, 10, antiallas"; 
	divAcdRct.mainTab.tab2.comCustNmS.rsidNo.style.bordertype = "round 3 3",
}

// 신규 사고 고객 조회 callback  ==> 주석: 2021.02.25, by 진태만 ■ 
function fnCusCallBackNw()
{
	fnClearDataSet("new"); 	// 피보험자 재조회시 모든 데이터셋 초기화 
	
	// 보유 계약 피보험자 체크 
	var cusld = divAcdRct.mainTab.tab2.comCustNmS.dsCusinfResult getColumn(0, "cusld");
	var idfNo = divAcdRct.mainTab.tab2.comCustNmS.dsCusInfResult.getColumn(0, "idfNo");

	if(!cf_IsEmpty(cusld)) { 
		if(!fnChkCladiPInrpsseCtrinspe(cusld, idfNo)) {
			isPsseCtrlnispe = false; 
		} else {
			isPsseCtrlnispe = true;
		}
		fnDefaultSet("new");		// 고객 조회 후 기본 셋팅
	}
}
 
// 고객 조회 후 기본 셋팅 ==> 주석: 2021,02.25, by 진태만
function fnDefaultSet(div) 
{
	if(div=="new"){ 		// 신규 접수 이면
		ds_cladiPinrNewAcdRctMngBcVo.setColumn(0, "cusid", divAcdRct.mainTab.tab2.comCustNmS.dsCusInfResult.getColumn(0, "cusld")); 
		ds_cladiPinrNewAcdRctMngBcVo.setColumn(0,  "cusldfNo", divAcdRct.mainTab.tab2.comCustNmS.dsCusinfResult.getColumn(0, "idfNo"));
		ds_cladiPinrNewAcdRctMngBcVo.setColumn(0,  "cusNm", divAcdRct.mainTab.tab2.comCustNmS.dsCusinfResult.getColumn(0 ,"cusNm"));
		divAcdRct.mainTab.tab2.cobDpcpereld.value = "01";
		divAcdRct.mainTab.tab2.edtDpcpeNm.value = divAcdRct.mainTab.tab2.comCustNmS.dsCusinfResult.getColumn(0 ,"cusNm"));
 
		// 고객 조회 후 신규 접수 통보자명 자동 Sething
		var sCusld = divAcdRct.mainTab.tab2.comCustNms, dsCusinfResult, getColumnco, "cusld");
  
		fnRetrieveCusInfo( {
			SitgrCuslnfPcsCd' : '1`			// 통합 고객 정보 처리코드(1:통합 고객 정보, 2: 영업 고객 정보, 3: 청약고객 정보)
			, 'itgrCustpCd' : '1`				// 통합 고객 유형코드(1: 개인, 2:개인사업자)			 
			, 'itgrCusingTrmDivCd' : '1`	// 통합 고객 조회 항목 구분코드(1: 고객 ID, 2: 식별번호, 3: 고객번호)
			, 'Inq	TrmVal: '1`	 				// 조회 항목값
			, 'fnCallback' : 'fnCallback '	// fnCallback
		}); 

	fnSearchCladilindvInfAgr(): 	// 피보험자 개민 정보 동의 조회
	}
}

// 손사 개인 정보 동의 조회
function fnSearchCladilindvInfAgr()
{ 
	if(cf_IsEmpty(divAcdRct.mainTab.tab2.comCustNmS, dsCusInfResult.getColumn(0, "cusld"))) {
		return;
	}

	ds_cladilndvinfAgrMngBcVo.clearData(); 
	ds_cladilndvinfAgrMngBcVo.addRow()
	ds_cladilndvinfAgrMngBcVo.setColumn(0,  "pcsDivCd", "1");		// 처리구분(1:조회, 2: 저장)
	ds_cladilndvinfAgringBcVo.setColumn(0, "cusld", divAcdRct.mainTab.tab2.comCustNmS.dsCusInfResult.getColumn(0, "cusld"));
 
	var sServiceld = "FNGCLRA00058"; 	// 서비스ID)
	var sInds = "body=ds_cladilndvinfAgrMngBcVo"; 		// INPUT Ds 
	var sOutDs = "ds_cladilndvinfAgrMngBcVo=body"; 	// OUTPUT DS 
	var sArg = ""; 
	
	cf_Transaction(sServiceld, "", "", sInds, sOutDs, sArg, "fnCallback");
}

// 콜백 처리 ==> 주석: 2021.02.25. by 진태만 ■ 
function fnCallback(sSvcld, nErrorCode, sErrorMsg)
{
	switch (sSvcld) { 
		case "FNGCLRA00058" : // 손사 개인 정보 동의 관리
			if(ds_cladilndvinfAgrMngBcVo.getColumn(0, "pcsDivCd") == "1") { 		// 처리구분(1:조회, 2: 저장)
				if(ds_cladilndvinfAgrMngBcVo.getColumn(0, "crdtinfGthUseAgrYn") == "1") { 
					divAcdRct.mainTab.tab2.rdolngDivCd1.value = "1";
					divAcdRct.mainTab.tab2.rdolngDivCd1.readonly = true;
				} 
				
				fnChkAcdRctSpplYn();		// 접수 보완 여부 확인(저장 버튼 Visual 처리)
			} 
			break;
	}	
}

/* 2018.10 사고 접수 보완 여부 체크 */
function fnChkAcdRctSpplYn() {
	var chkSpplYn  = true; 		// 완비 or 처리완료 or 보완 대상 제외 
	var chkAgrSpplYn = true;
  
	// 정보 동의(전체동의) 
	if(ds_cladilndvlnfAgrMngBcVo.getColumn(0, "crdtInfGthUseAgrYn") == "1"
		 && ds_cladilndvinfAgrMngBcVo.getColumn(0. crdtInflngPrausAgrYn") == "1"
		 && ds_cladilndvlnfAgrMngBcVo.getColumn(0, "crdtInfOfrPrausAgrYn") == "1"
		 && ds_cladilndvlnfAgrMngBcVo.getColumn(0, "crdtinfSeninfAgrYn") == "1") { 
			
			chkAgrSpplYn = false; 
			chkSpplYn = false; 	// 완비 or 처리완료 이 보완 대상 제외
	}
	
	// 보완 대상 제외(펫보험 청구)
	if(divAcdRct.mainTab.tab2.chkPetisnYn == "1") { 
		chkSpplYn = false;   // 완비 이 처리완료 or 보완 대상 제외
	}
	
	// 완비 of 처리완료 이 보완 대상 제외
	if(chkSpplYn == false) { 	// 정보 동의(전체 동의) 또는 펫보험 이면 ==> 저장 버튼 보이기
		divAcdRct.mainTab.tab2.btnStr.visible = true; 	// 저장 버튼 visible ■■■
		divAcdRct.mainTab.tab2.btnStr00.visible = false;

	}else{ 	// 미비 
		divAcdRct.mainTab.tab2.btnStr.visible = false; 
		divAcdRct.mainTab.tab2.btnStr00.visible = true; 		// 접수보관 버튼 visible ■■■ 
		divAcdRct.mainTab.tab2..Static06.visible = true;
	}
}
==============================================================================================================

- 쌀 20kg 구입
1. 베트남쌀 20kg/1등급 안남미쌀 2019년/수입쌀/태국쌀, 가격: 32,890원
http://www.enuri.com/detail.jsp?modelno=38263013&condiDelivery=N
http://item.gmarket.co.kr/detailview/item.asp?goodscode=1445417912
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.26(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 노정남 부장(공통), 김현영 차장(개발자), 철수(13시)

- 하나손해보험 Prj[★]
- 메리츠 화재 패기지(XP) 분석
- 사고접수(/FNGCLRA0100.xfdl) 분석[손사 ==> 사고접수 ==> 사고접수]
1. OnLoad 처리
function FNGCLRAO100_onload(obj:Form, e:LoadEventinfo) {
	cf_FormOnLoad(obi, e);
}
==============================================================================================================

- 개발 가이드 교육2(09:30, 대회의실) 
1. 수정된 내용 교육 
2. 개발 일정 
 1) 3월 15일(월)부터 개발 시작 
3. 자리 이동 예정. 
 1) 3월 6일(금) 9층으로 이동: 응용팀과 연계 목적
==============================================================================================================

- 미래에셋 퇴직 연금(IRP) 계좌 개설 신청(11시, 집) 
1. 미래에셋 앱 다운로드
 1) 안녕하세요. 퇴직연금(IRP) 상담 받고 가입하려고 하는데 미래에셋대우 WM센터원에 가면 가능 한가요?
2. 건강보험자격득실확인서 보내기 ==> 0505-085-0012로 팩스 보냄
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.02.27(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 	

- 주말[★]
05:00 기상
05:40 조식
06:15 집출발: 여행용 케리어(밥상), 백팩(그릇) ==> 짐 엄청 무거움
06:25 남서울중학교 정류장 도착
06:30 643번 버스 승차
07:10 고속터미널 하차
08:00 포항행 고속버스 승차
12:00 포항 고속버스 터미널 도착
12:07 고속버스 터미널 정류장(209번 버스 승차)
12:30 두호동 주민센터 하차
12:40 포항집 도착 
12:50 중식 
13:30 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
14:00 종료
15:00 집출발(수종)
15:54 펫 마트 ==> K.J 비딩(톱밥, 2개): 햄스터용, 해바라기씨 500g: 햄스터 양식, 햄스터 버어 하우스 구입
17:23 다이소 두호점 ==> 반찬통, 김보관용기, 숟가락 구입
17:30 대림 변기 판매점 ==> 수면기가 자주 막혀서 스트레스 받음: 주인 아줌마랑 싸움(1년 지났는데 본사 A/S 신청 해주기로 함)
17:35 다이소 두호점 ==> 필립스 형광등 4개 구입
15:25 다이소 포항 죽도시장점 ==> 밴드형 2단 도시락(수종)
15:40 귀가 
18:11 석식
18:30 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
19:50 종료
22:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.02.28(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 16:30 ==> 

- 주말2[★]
07:00 기상
07:10 조식
08:00 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
09:20 종료
09:30 TV 시청
10:30 햄스터 집 조립하기(분홍색, 작고 약함)
12:50 중식 
13:30 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
14:00 종료
15:00 집출발(수종)
15:30 항도 초교 방문: 건물 새로 지움(교무실 이전)
16:00 롯데백화점 포항점 ==> 수종 아디다스 신발(69,000원) 신어보고 다음에 사기로 함
16:35 다이소 두호점 ==> 다이소 두호점
16:50 귀가 
18:11 석식
18:30 도보: 영일대 해수욕장 --> 등대 --> 환호공원 앞 등대 --> 귀가
19:50 종료
22:00 취침
============================================================================================================== 

- 아디다스 신발(6,9000원)
 [[에누리 가격비교]] 슈퍼스타 360 X C (EG3398) http://m.enuri.com/short/ec5QC 
 [[에누리 가격비교]] 슈퍼스타 360 C (S32130) http://m.enuri.com/short/0tcjs
 ============================================================================================================== 
 
- 현아트빌 404호 관리비 송금
1. 반장(김진아 현아트빌 202호) 신한은행: 110-504-967679, 예금주: 김진아
 ============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
