

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2021.10) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2021.10.01(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 가계부 월말 결산

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 테스트
===========================================================================================================================

32. FMMY5200R 하나로 가족고객 - 등급 시물레이션 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMMY5200R.view --> /fmmy 5200r.jsp
 1) 추천상품 TEST ==> AP에서 개발이 안 끝남: COM5201501 (상품추천 조회 서비스) 
 ==> [/fmmy5100ts.java] [getPfmRcmWrsList()]: 추천상품 조회 ==> /fmmy5200r.jsp
 ==> [/fmco1000ts.java] [getPfmRcmWrsList()]: 추천상품 조회 ==> /fmas1211p.jsp
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.02(토) 작업 ■■■■■■■■■■■■■■■■■■ 
------> 07:30 ~ 18:00 ==> 

- 주말2[★]
05:38 기상
05:40 조식
06:10 집출발(자전거)
06:25 신림역 도착 ==> 건대입구역 환승
07:20 군자역 2번 출구 도착
07:30 희망내과 도착(예약 리스트에 이름 작성: 3번째)
07:40 도보
08:40 종료
08:45 희망내과 방문 ==> 당뇨 부작용 검사(11만원 추정) 다시 받으라고 해서 (너무 복잡, 검사 요구: 다른 병원 알아 볼 것)
08:50 혈당 검사: 110(식후 3시간 후 검사)  ==> 혈압: 68 ~ 109
09:30 진료(송필훈 원장): 당화혈색소 검사: 6.1점 ==> 9월 10일 이후 약 안 먹음, 12월 초에 다시 오라고 함(90일치 아침약 받아옴)
09:40 조제(당뇨약: 80일분, 푸른약국)
09:45 종료
10:10 군자역 --> 건대입구역(환승)
10:50 대림역 8번 출구 도착
11:00 다이소 신림3호점 방문 ==> 아령 3kg[5천원], 신축식 핸드폰 거치대: 2개[6천원, 수종, 큰누나 선물], 박스 테이프 커터 2000[2천원]
		, 멀티 정리 박스(6칸) [2천원, 못통으로 활용], 옷장용 수납 걸이(40.5*10.5 cm) [천원, 티셔츠 걸이], PVC 2단 바지 걸이(S형) [천원] 구입
11:25 CU 편의점(신림 사동점) 방문 ==> 우산 구입(만원: CU편의점 교환권[5천원] 사용)
11:35 귀가
12:00 중식 
12:30 실내도보 
13:40 귀가
13:50 인터넷 서핑
15:30 집출발(자전거) 
15:45 이마트 구로점 도착 ==> 필립스 LED 스탠드 윌리 구입(모델명: 66127, 가격: 39,000원): 이마트(신세계) 상품권 4만원(KT 인터넷 신규 
		가입으로 받음)
16:00 소금 창고 ==> T-셔츠 2벌, 바지(99,000원) 구입(이월 상품으로 50% 할인): 39,700원
17:20 귀가
17:25 집출발(자전거) 
17:35 다이소 신림3호점 방문 ==> 멀티 정리 박스(6칸) [2천원, 포항집용], 옷장용 수납 걸이(40.5*10.5 cm) [2개, 2천원, 티셔츠 걸이],
		, 이지 4단 바지 걸이[2천원], 옷걸이 뽕-8P[천원] 구입 
17:40 귀가 
18:10 석식
18:30 실내 도보
19:35 종료
20:00 인터넷 서핑
22:30 취침
===========================================================================================================================

- 경제News
https://www.youtube.com/results?search_query=경제+뉴스
===========================================================================================================================

- [쉬움주의] 스티커 장판으로 바닥 셀프 시공했어요. 총비용 119,900원!!!
https://youtu.be/eP17NFuPcZ8
1. 현대L&C 현대 쉬움 DIY 셀프장판 : https://coupa.ng/b6nVpp

- 셀프로 장판 깔아보기! 시공법은 쉬움~
https://youtu.be/hLACwc9yTBc
---------------------------------------------------------------------------------------------------------------------------

- 나 혼자 현대L&C 쉬움타일을 시공한다면?? l 현대L&C 쉬움타일 유튜버 셀프시공🛠💪🏻
https://youtu.be/W3q_3W6I6i0
---------------------------------------------------------------------------------------------------------------------------

- 접착식 데코타일 셀프시공, 단돈 2만원으로 새집처럼 현관 분위기 바꾸기
https://youtu.be/i-cdEG2eaVY

- 셀프인테리어 사상 최고 간단! [테이프]로 데코타일 붙이기 (3달 사용 후기 포함)
https://youtu.be/KY1DxvS73tY
===========================================================================================================================

- 포항집 거실 장판
1. 크기: 460 × 350 cm
2. 다이소 DIY 바닥 타일 크기: 30 × 30 cm(천원) 
==> 다이소 DIY 바닥 타일 15장(만 5천원) 구이배서 거실 장판 설치 가능할 것으로 추정됨 
===========================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.03(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 개천절

- 주말2[★]
06:40 기상
07:40 조식
08:00 실내 도보 
09:10 종료
09:30 인터넷 서핑 ==> 협의이혼 루옌에게 통보[2021.10.08(금) 8시 30분 서울남부지방법원 1층 로비에서 만나기로 함]
12:00 중식
12:30 실내도보 
13:40 종료
15:10 집출발(자전거) 
15:20 도림천자전거 수리센터 방문 ==> 자전거 공기 주입기 사용(무료: 엄청 편리)
15:30 다이소 신림3호점 방문 ==> 옷장용 수납 걸이(40.5*10.5 cm) [천원, 티셔츠 걸이], 벨벳 바지 걸이(3단) [천원], 옷걸이 뽕-8P[3개, 3천원] 구입 
15:40 신사시장 진흥마트 옆 가게 방문 ==> 오이(5묶음(6개); 총 30개, 만원) 구입
16:00 귀가
17:00 인터넷 서핑 ==> 이혼 서류 작성(1. 협의이혼의사확인신청서(법원제출용)_20111101_00.hwp, 
		 2. 자의 양육과 친권자결정에 관한 협의서(법원제출용)_20111101.hwp, 03. 위자료나 재산분할에 관한 합의서.hwp)
18:00 석식
18:30 실내 도보: 주식의 정석 70강(20210928) 2번 수강 종료
19:40 종료
19:45 청소 
20:10 샤워
20:35 인터넷 서핑 ==> 프린터 출력 에러
22:50 취침
===========================================================================================================================
 
- ‘와버린 미중 급락‘ 10월 변수 터널 추세 하락 오나? [주식투자 와우넷]
https://youtu.be/Za5jyQM2Atg
===========================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.04(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 대체 공휴일(개천절): 법 시행 후 처음 적용된 날

- 주말2[★]
05:00 기상
05:40 조식
06:00 실내 도보
07:10 종료
07:20 인터넷 서핑 ==> 현아트빌 프린터(SL-M2030W) 설정 분석
12:00 중식 
12:30 실내도보
13:30 귀가
14:00 인터넷 서핑 ==> 현아트빌 프린터(SL-M2030W) 설정 오류 해결: 이혼 서류 프린터로 출력
18:00 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
22:50 취침
===========================================================================================================================

-'이것'은 떨어져도 편하게 모으세요 연 40%수익 나옵니다 (박민수 직장인투자고수) [ETF] [신사임당]
https://youtu.be/7aEPwSjXZKY
===========================================================================================================================

- 현아트빌 프린터(SL-M2030W) 사용법[2021.10.04(월)]
- 삼성 프린터 무선 연결(TAMA 현아트빌 404호) 프린터 방법 @@@ 
1. 윈도우10 하단 작업 표시줄(오른쪽) ==> 네트워크 이미지: 클릭 ==> 00. TAMA_WF_HART_404(선택) > 연결 버튼: 클릭
 1) 00. TAMA_WF_HART_404 와이파이 IP 주소: 192.168.0.10(와이파이 IP와 유사)
2. Samsung M203W 프린터 전원 켜기 ==> WPS(Wi-Fi Protected Setup: 장치를 무선 네트워크에 쉽게 연결) 이미지 버튼 누르기(녹색 불빛 확인)
3. 가족관계증명서.jpg 출력
4 정상 출력 여부 확인
==> D:\01. TAMA_DATA\51. TAMA SW\03. 추가 프로그램\99. 삼성전자 SL-M2030W 프린터 드라이버(TAMA-HAart-404))
03. 매뉴얼 M203x_series_korean_0528.pdf 파일 참조
===========================================================================================================================

- 삼성 프린터 무선 연결(TAMA 현아트빌 404호) 설정 @@@
1. 제어판\모든 제어판 항목\장치 및 프린터 ==> 프린터(윈도우 탐색기로 열기)
00. Samsung M203x Series: 마우스 우 클릭 --> 프린터 속성(P): 클릭 ==> 00. Samsung M203x Series 속성(팝업: 새창)
 1) 포트(Tab) --> 192.168.0.9: 선택,  포트 구성(C): 클릭 ==> 표준 TCP/IP 포트 모니터 구성(팝업: 새창)
   가. 포트 이름(P): 192.168.0.9  ==> TAMA 현아트빌 404호 ■■■ ===> 
   나. 프린터 이름 또는 아이피 주소(A): 192.168.0.9 ==> ■■■
   다. 프로토콜: Raw(R)
   라. Raw 설정 포트번호(N): 9100
   마. SNMP 상태 사용(S): 커뮤니티 이름(C): public, SNMP 장치 색인(D): 1
--------------------------------------------------------------------------------------------------------------------------------

2. 와이파이 상태 확인
1) Samsung Easy Printer Manager SW 실행 ==> Easy Printer Manager(팝업: 새창)
1) 홈 --> 프린터
  가. Samsung M203x Series 절전 모드 ==> 연두색으로 체크가 되어 있어야 정상 출력됨 ■■■
  나. 포트: 192.168.0.9  ==> ■■■
===========================================================================================================================

- 삼성 M203x Print Driver,SPL 드라이버 설치
M203x_Series_WIN_SPL_V3.13.59.00.04_CDV1.01.exe
------------------------------------------------------------------------------------------------

- 삼성 Easy Printer Manager SW 설치
M203x_Series_WIN_EPM_V2.00.01.27_CDVV1.00.exe
===========================================================================================================================

- 프린터무선네트워크(액정없고/공유기없이)다이렉트 설정방법(M2030W사용기) [레몬컴퓨터]
https://youtu.be/GcbixBcxLIQ
===========================================================================================================================

- 삼성전자 SL-M2030W [토너포함], 흑백 레이저, 가격: 127,000원  ==> 추천 ■
1. 드라이버 다운로드: https://www.samsung.com/sec/support/model/SL-M2030W
1) M203x_Series_WIN_EPM_V2.00.01.27_CDVV1.00.exe 00. Samsung M203x Series ==> 와이파이로 연결
https://www.coupang.com/vp/products/1131137581?vendorItemId=70097934948
===========================================================================================================================
 
- 협의 이혼 내용
1. 상호 합의하에 재산 분할은 하지 않는다.
2. 상호 합의하에 위자료를 지급하지 않는다.
3. 미성년자가 있는 경우 양육 및 친권자결정 모두 아버지가 맡는다.
===========================================================================================================================  
    
- 협의이혼
1. 협의이혼, 이 영상 하나로 완전 정복 - 변호사가 알려주는 변호사 없이 협의 이혼 하는 방법!! [신의 변호]
https://youtu.be/3PCNS-gzurw

- 협의이혼 절차안내[대한민국 대법원]
https://youtu.be/zqoEVqfz-Vs

- 나의 협의이혼 관할법원
https://www.saevom.com/guide/view/1
1. 협의상 이혼을 하고자 하는 사람은 등록기준지 또는 주소지를 관할하는 가정법원의 확인을 받는다
 1) 강아현(940509 - 6100024) 주소: 서울 구로구 가마산로280 구로2차순영웰라이빌 아파트 304호
 2) 진수종: 130924 - 3067711
------------------------------------------------------------------------------------------------------------------------------

- 협의 이혼 구비서류
1. 주민등록등본 1통(부부가 주소가 다른 경우 각 1통 제출)  ==> 1장 출력
2. 부부 각자의 가족관계증명서 1통 ==> 1장 출력
3. 부부 각자의 혼인관계증명서 1통 ==> 1장 출력
4. 미성년자가 있는 경우 양육 및 친권자결정에 관한 협의서[필수] 1통과 사본 2통  ==> 4장 출력
5. 협의이혼의사 확인신청서 1통(법원 비치)  ==> 2장 출력
 
위 서류를 등록기준지 또는 주소지를 관할하는 가정법원에 접수하고, 숙려기간(3개월) 경과 후 정해진 기일에 법원에 출석하여 판사의 확인을 받음
이혼의사 확인서등본을 교부받은 날로부터 3개월 이내에 당사자 일방 또는 쌍방이 등록기준(본적)지 또는 주소지 관할 시･구･읍･면사무소에 
확인서등본을 첨부하여 이혼신고  
6. 의무 면담 제도(서울 가정 법원)
--> 이혼신고시 구비서류 : (1)이혼신고서 1통 (2)협의이혼의사 확인서 등본 1통
7. 근로소득세 원천징수영수증, 사업자등록증 및 사업자소득금액 증명원 등 소득금액을 증명하기 위한 자료 - 부, 모별로 각 1통  ==> 1장 출력
8. 03. 위자료나 재산분할에 관한 합의서.hwp)  ==> 2장 출력
※ 단 판사가 발부한 확인서의 효력은 3개월이므로 3개월 이내에 신고하지 않으면 효력이 없어지고, 다시 확인을 받아야 함 
======================================================================================================================

- 앱2-삼성레이저프린터 SL-C433W 휴대폰 자료 바로 출력하기(삼성모바일프린트 앱 설치요망)
https://youtu.be/5lhGV7SCrOA
1. 삼성 모바일 프린터
======================================================================================================================

- [A892992164] 패스톤 발열덧신 (기본형) 보온덧신 덧버선 방한양말(2개) [주문번호:1943504918] 사이즈: L, 가격: 7,820원
http://itempage3.auction.co.kr/DetailView.aspx?itemno=A892992164
======================================================================================================================

- LG U+ 카카오 리틀프랜즈폰4(삼성 갤럭시 A10e) 혜택 보호필름(SM-A102): 수종 선물, 가격: 5,990원
http://emart.ssg.com/item/itemView.ssg?itemId=1000056080280&siteNo=6001&salestrNo=6005
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.05(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 농협 Prj 2차 통테[1차], 금융인증서 재발급(발급 은행: 신한은행, 유효기간: 2024-10-05)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[1차] 시작 및 일정 
 0. 1차: 10월5일(화) ~ 10월7일(목) (개발계 진행 후 검증으로 변환해 진행) 
 1. 테스트용 단말기 사용(개발계에서 수행) 
 2. 증척 촬영 => 반입요청(반입요청은 PMO와 얘기 후 다시 안내드리겠습니다.) 
 3. TMS 실적 입력(반입증적은 추후 업로드 가능)
-----------------------------------------------------------------------------------------------------------------------------

- 증적 업로드 및 반입 시기 
1. 일정 상 금일부터 통합테스트 1차(10/5~15) 수행이지만, 기능 적합성 심사(10/5~6) 진행 중이므로 심사가 완료 되면 검증계 이관 
(10/6~7 예상) 이후 증적 작성 및 반입요청 부탁드립니다.(검증계에서! : 10월 8일(금) 이후)
======================================================================================================================

- 소스코드 인스펙션 결과 
1. 102458494_PFM고도화_SPARROW_검출결과 20211005 _1406.xls 파일 수정해서 권영진 선임에게 쪽지 보냄
======================================================================================================================

- clone 함수 제거 
1. fmse3000tS.java 
method명 : getMy Info 
44 Line: IDataSet inDataSet = dataSet.clone();
63 Line: Map favoriteInfoMap = super.send(dataSet.clone(), context, "COM2103501"); 	// 관심사 정보 조회
-----------------------------------------------------------------------------------------------------------------------------

2. fmse 4000tS.java 
method명: getVIPReqList
41 Line: IDataSet datasetClone = dataset.clone(); 
method명: canVIPReq
101 Line: IDataSet datasetClone = dataSet.clone(); 
method명: getVIPReqStatus 
18 Line: IDataset datasetclone = dataset.clone();
======================================================================================================================

- KB 모바일 인증서 발급
1. KB 국민은행 앱에서 발급 --> https://obank.kbstar.com
 1) 03***, U 패턴
2. 타행 금융인증서 등록이 완료(신한은해에서 발급된 금융인증서 사용)
=======================================================================================================================

- 엄마가 만주 고모 국민은행(내 명의) 통장 분실
1. KB종합통장-보통예금 통장(617401-04-092699통장) 12,352,184원 보유
2. 농협 통장으로 변경 검토
=======================================================================================================================

- 예상연금월액(노령연금, 국민연금) [2021.10.05(화)]
1. 예상연금액(현재가치 기준): 2037년07월부터 											
2. 매월: 1,427,320원(연17,127,840원) 수령 예상
3. 총 예상가입기간(납부월수): 1991년 05월 ~ 2032년 06월(총440개월)
4. 총 예상납부보험료: 141,996,060원
------------------------------------------------------------------------------------------------------------------------------------

- 총 납부내역
1. 납부한 연금보험료 
월수		 		금액		    	월수	  			금액	   월수	 	금액
310개월	83,145,060원    1개월	    452,700원     0개월	0원
2. 반납금 납부액: 3,308,770원
3. 추납보험료 납부액 (개월): 32,594,400원(72개월)
======================================================================================================================
 
- PC에서 소리 증폭 방법  
1. 무료 소리 증폭 프로그램 (Equalizer APO) ==> https://ivyit.tistory.com/149
 1) PC, 노트북 스피커 소리 크게 하기, 스피커 소리 증폭 하는 방법 ==> https://youtu.be/710b8M_dlDY
------------------------------------------------------------------------------------------------------------------------------

2. 스마트폰 음질 향상 내 폰도 웅장하게 할 수 있는 이퀄라이저 2개 무료 다운로드 및 사용 방법(2,600원 2,400원 → 무료)
 1) 이퀄라이저 프로 - 볼룸 부스터 및 베이스 부스터
==> https://youtu.be/RcfqJBuFscQ
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.06(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근시에 비 조금(06시, 우산), 신한은행 간편 앱출금(폰으로 ATM에서 30만원까지 출금 가능) 

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[1차] 
1. 핸드폰으로 개발계에서 테스트 후 PFN고도화_2차_통합테스트_시나리오_20210927_v1.03.xlsx 파일 작성
======================================================================================================================

- 통합테스트 2차 통합[1차] 
1. NH TMS+(테스트 관리S) > 통합테스트 실행 화면: http://16.24.103.93:31126/TMSP/executionIntegrationsilist.do
======================================================================================================================

- SE-S001: 설정 서브메인 ==> 완료[♥♡] 
- SE-S002: 공지사항 ==> 완료[♥♡] 
- SE-S003: MY 정보 ==> 완료[♥♡] )
======================================================================================================================

00. FPAS1900R 선불페이 상세(/fmas1900r.jsp) 수정 ==> 완료[♥♡] 
1. http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp --> 선불 페이: 클릭 
 1) 결함 내역: 결세 상세내역에 가맹점명 카카오페이에 금액이 안 보임 
  가. 조치: 카카오페이에 대한 거래유형코드값 추가(5109: 충전(기타)) [2021.10.06, by 진태만] 
  나. 테스트 ID: 봇칠팔 2000629889 EFFM78 사업부 TBD ==> 선불페이 테스트 @@@
======================================================================================================================

1. 가맹점명 및 거래메모 - 전송요구 동의여부 체크 ==> 완료[♥♡]
 1) 거래메모 및 가맹점명 표시 관련 대상 화면: 선블페이 상세(FMAS1900, FMAS1900_1) 
 2) FMAS1900R 선불페이 상세(/fmas1900r.jsp) 수정 
==> [/fmas1901ts,java] [getFranchsendAgrYn()]: 거래메모, 가맹점명 제공 동의여부 체크 추가
======================================================================================================================
 
1. 마이데이터 정보제공 동의(적요가맹점명, 거래메모 등)  수정 ==> 완료[♥♡]  
CASE 1. 입출금, 예적금, 외화, 마이너스 통장 거래내역 적요 - 전송요구 동의여부 체크
 1) 적요 표시 관련 대상 화면: 입출금 상세 (FMAS1310), ==> 완료[♥♡]
마이너스 통장 상세(FRAS1313), ==> 완료[♥♡]
예적금 상세(FMAS1320, FMAS1321), ==> 완료[♥♡]
외화 입출금 상세(FMAS1350),| ==> 완료[♥♡]
외화 예적금 상세(FMAS1351, FMAS1352) ==> 완료[♥♡]
 ==> [/fmas1311tS.java] [getConsptssendAgrYn(()]: 적요 - 전송요구 동의여부 체크 추가 
======================================================================================================================

- 프로그램 PMS 등록 필요여부 확인 
1. 20211006_ 프로그램_등록여부_확인_진태만.xlsx 파일 작성하여 김홍석 부장에게 보냄
======================================================================================================================

- 미래에셋 증권 ID
0. 미래에셋 증권 (https://securities.miraeasset.com),
ID						계좌번호			계좌유형
tamario	010-30-7208987		종합
tamario	010-30-7208988		종합
tamario2	052-99-007971			종합
tamario3	010-30-7208980		퇴직연금
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.07(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 출근시에 비 조금(06시, 우산)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[1차] | 
- SE-S004: VIP 상담 신청내역 조회 ==> 완료[♥♡]
- CO-S002: 영업점 방문상담신청 ==>완료[♥♡]] 
1. FMICO1510R VIP 금융컨설팅 - 서비스안내 에러 발생(최수경 수석에게 개발 서버 재시작 요청: 성능 테스트한다고 
개발 서버 재시작 불가 하다고 함) 
- MY-Se005: 하나로 가족보고서 ==> 완료[♥♡]
- MY-S2006: 등급 시물레이션 ==> 진행 중[☞☜]
1. MY-SC06-002 등급시물레이션 결과
 1) 추천상품 조회: 공통에서 AP와 테스트 데이터 확인 중이라 확인 불가능 [ 2021.10.07(목) 10시 20분 현재 상황] 
 - MY-S0007: 하나로 가족고객 혜택 ==> 완료[♥♡]
======================================================================================================================

- 파일 삭제 
1. /fmco1510tC.java, fnco1510tS.java 파일 삭제
======================================================================================================================

- 계정 관리시스템에서 비밀번호 변경 및 권한 신청 
1. https://16.24.87.59/IMWS --> CS523262/22tadhtigenf! (22ta오십둘!)
======================================================================================================================
 
21-0. FMCO1510R VIP 금융컨설팅 - 서비스안내
1. http://localhost:8088/servlet/FMC01510R.view --> /fmco1510r.jsp
 1) 현상: 로컬 서버는 정상, 개발 서버에서 에러 발생
-----------------------------------------------------------------------------------------------------------------------------
*** ERROR CODE  : WFBZ90101 
*** USER MESSAGE : 이용에 불편을 드려 죄송합니다. 지금은 일시적 오류로 서비스가 불가합니다. 같은 현상이 반복되면 고객행복센터를 
통해 문의해 주시기 바랍니다.
*** ERROR PROGRAM NAME : FMCO1510R:HandlerSelectProcessor 
*** ERROR PROGRAME LINE : 63 
*** ERROR_SERVER_INFO : 16.51 
*** BACKEND GUID			 : 
*** BACKEND SERVICE ID : null
-----------------------------------------------------------------------------------------------------------------------------
*** ORG_ERROR_CODE		: NW20003
*** ORG_ERROR_MESSAGE: 스템 오류 입니다.!!
----------------------------------------------------------------------------------------------------------------------------- 
*** EXCEPTION TYPE : class nexcore.gemini.web.dispatcher.exception. ServiceNotFoundedException
*** BIZ CLASS 			: 
*** BIZ METHOD  		: 
*** BIZ LINE  			: -1
*** EXCEPTION DEBUGING MESSAGE : 서비스 ID 에 해당하는 Biz Controller가 존재 하지 않습니다.
-----------------------------------------------------------------------------------------------------------------------------
======================================================================================================================

00. FMAS1322P 예적금 상세_회차상세정보 ==> 완료[♥♡] 
1. 회차 상세정보(/fmas1322p.jsp) 
2. 예적금 상세(FMAS1320, FMAS1321) (/fmas1320r.jsp, /fmas1321r.jsp)

1. 로그인 조건: 2000629821 EFFM03(박상기 과장) 
 1) 예적금 > 평생우대주니어적금 (평생우대적금) 
 보기: 목록 기본 30개 --> 10개 데이터 호출 
2. 로그인 조건: 2000629889 EFFM78(사업부 TBD) 
 1) 예적금 > 우리 200일 적금 계좌의 상세
-----------------------------------------------------------------------------------------------------------------------------

- 결과: 결함은 없는 것으로 종료하고 아래와 같이 정리 ==> 결함유형: 결함아님 결함상태 - 조치완료 
1. 계좌 상세 조회 > 거래내역 더보기 : 목록 기본 30개 데이터 호출 
2. 회차 상세내역 더보기 목록 기본 10개 데이터 호출
======================================================================================================================

21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력, 휴대폰번호 입력 ==> 
1. http://localhost:8088/servlet/FMC01521R.view --> /fnco15215.jsp
======================================================================================================================

- VIP 금융컨설팅 약관동의 에러 
6 봇공육 2000629826 EFFM06, AT마이 데이터추진팀 TBD
약관동의 AP에서 에러가 남(약관동의 담당자인 최수경 수석에서 처리 요청하니 EAI 문제라고 함: 내일 다시 확인하라고 함 
/* 설명 : 약관동의 ==> /fmco1120tS.java */
public IDataSet agree Terms(IDataset dataset, IBizServiceContext context) throws Exception {
	super.send(dataSet, context, "MSSVSB3200501")	; // 자산관리 서비스 선택 약관 마케팅 등의여부 갱신 서비스 
	return dataset;
}
********************* XCEPTION STACKTRACE  *********************
 nexcore.gemini.commons.exception. Common Exception [errorCode=NC99998, messageCode=NC99998, messageValue = 
 [AP 미등록 오류입니다. AP업무담당자에게 에러코드 등록 요청해주세요., MSSVSB3200501], debuggingMessage={ 
 "msg":"AP 미등록 오류입니다. AP 업무담당자에게 에러코드 등록 요청해주세요.","errCd":"NDFCC001","data":null 
 ,"success":false}, exceptionClassName=com.nhbank.ef.ms.base.EfmsBaseService, exceptionThrowingMethodName 
 =send, exceptionThrowingLineNumber=118]  
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.10.09(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 주말2[★]
05:00 기상
05:40 조식
06:00 실내 도보
07:10 종료
07:45 집출발(자전거): 집 ==> 오목교 ==> 오목교역 ==> 서정초교 ==> 진명여고 ==> 법원 도착
08:35 서울남부지방법원 도착
08:40 루옌 만남(안경씀)  ==> 협의이혼 서류 확인
09:00 가족관계등록계(206호)에 협의이혼 접수
09:10 이혼, 우리아이를 어떻게 지키고 돌볼까요? {법원 이혼 부모교육(자녀양육안내) 동영상} 시청[대한민국 대법원], 41분 소요
		==> https://youtu.be/GMzgrxYseVw
09:20 협의이혼 자녀양육안내 동영상 시청 소감문 작성(루옌꺼 대신 작성해줌)
09:50 양육 및 친권자결정에 관한 협의서 재작성 ==> 면접교섭권 행사일 매월 1째주 토요일 9시 ~ 21시로 인도, 면접 장소: 자녀가 원하는 
		 장소로 변경
10:00 가족관계증명서, 혼인관계증명서 발급(기본 ==> 상세로 재발급): 무인민원발급창구로 발급(총 800원,  신용카드 결제, 지문 사용)
10:20 협의이혼 접수 완료 : 협의 이혼 전문위원 상담일 받음(10월 18일(월) 10시, 협의 이혼 의사 확인 기일(미성년) 받음
10:35 종료
10:40 법원 출발(자전거: 비 조금 옴): 진명여고 ==> 서정초교 ==> 오목교역 ==> 오목교 ==> 안양천 다리 ==> 도림천 ==> 도착
11:20 귀가
12:00 중식 
12:15 실내도보
13:00 종료
13:10 집출발(자전거): 비 조금 옴(우산)
13:30 KB국민은행 보라매종합금융센터 방문 ==> 국민은행 계좌번호: 617401-04-092699(만주 고모) 분실 신고, 비밀번호 변경(52**)
		생체인식 ==> 12,352,184원 신한은행으로 이체 처리
13:45 NH농협은행 보라매타운지점 방문 ==> 진수종 NM 농협 은행 통장 개설,  진태만 계좌 NM 농협 앱으로 계좌 톻합  
14:30 다이소 보라매점 방문 ==> 옷장용 수납 걸이[천원], 옷걸이 뽕-8P[3개, 3천원] 구입
15:20 귀가
15:30 인터넷 서핑 
16:25 집출발(자전거): 비 약간 옴(우산 소지)
16:40 성모 베스트 이비인후과 도착
16:42 코로나19 예방 접종 문진표 작성
16:45 코로나19 예방 접종 ==> 화이자 백신 접종
17:00 종료(15분 대기)
17:10 귀가(비 약간 옴)
17:20 자전거타고 집으로 가는데 여자 피하려다 화단으로 돌진: 무릎에 피남(얼굴은 약간 긁힘)
17:35 귀가
18:00 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
19:45 빨래
22:50 취침
===========================================================================================================================

- 협의이혼 절차 @@@
1. 자녀양육안내 교육[2021.10.09(금)]
 1) 협의이혼 자녀양육안내 동영상 시청(45분 소요)
2. 협의이혼 접수(서류 제출) [2021.10.09(금)]
 1) 숙려기간(약 3개월)
3. 협의 이혼 전문위원 상담[2021.10.18(월) 10시] 
4. 협의 이혼 의사 확인 기일 - 미성년[2022.01.12(월) 13:40]
 1) 확인서등본, 양욱비부담조서정본 받음
5. 이혼 신고[2022.01.12(월) 14시, 관악구청]
 1) 확인서등본 수령 당일 제출 가능(3개월내 신고해야 효력 발생)
--------------------------------------------------------------------------------------------

- 협의 이혼 전문위원 상담(10시, 서울남부지방법원)
1. 2021.10.18(월) 10시 서울남부지방법원 2021호협 2615
1. 2021.10.18(월) 10시 서울남부지방법원 2021호협 2615
2. 준비 서류: 
 1) 상담 전 질문서 작성해서 올 것
 2) 전문위원 상담 확인서
--------------------------------------------------------------------------------

- 협의 이혼 의사 확인 기일 - 미성년(13:40, 서울남부지방법원)
1. 제 1회 확인 기일: 2022.01.12(월) 13시 40분 서울남부지방법원 2층 204호 법정
2. 제 2회 확인 기일: 2022.01.126(월) 13시 40분 서울남부지방법원 2층 204호 법정\
2. 준비 서류:  양육 및 친권자결정에 관한 협의서[필수] 1통 제출
===========================================================================================================================

- 만주고모 통장 변경
1. 국민은행 계좌번호: 617401-04-092699(만주 고모)에서 농협 계좌번호: 713 02 183076, 예금주: 진기숙
 1) 국민은행 (617401-04-092699)에서 신한은행 ==> 농협 계좌( 713 02 183076)로 12,352,184원 송금 처리
===========================================================================================================================

- 진수종 NM 농협 은행 통장 개설
1. 계좌 번호: 302-1627-0273-11, 괸리점: 000396(NH농협은행 보라매타운지점), 고객번호: 2001929270
 1) 이용자ID: soojong202
 1) 진수종(미성년자) 통장 개설 및 서류
	1. 가족관계증명서(미성년자 기준)
	2. 기본증명서(상세)
	​3. 미성년자 도장
	4. 대리인(부모) 신분증
------------------------------------------------------------------------------------------------

- 진수종 NM 농협 은행 웹회원 가입
https://banking.nonghyup.com ==> soojong202/soo05**@
1. NM 농협 스마트 뱅킹 앱에서 간편인증: 05**00
============================================================================================

- NM 농협 스마트 뱅킹 앱으로 계좌 톻합
1. 농협 전 계좌를 NM 농협 앱으로 계좌 통합
 1) 356-1274-9556-83: 자유저축예탁금[태만V수종(수종 동부초교 업무 통장)] 추가(NH농협은행 ㅊ타운지점 직원이 해줌)
===========================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.10.09(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말[★]
04:20 기상
05:18 조식
05:50 집출발: 아령 3kg 4개(큰누나, 포항집), 못통, 반찬통, 나무 행거, 가족관계증명서(진덕근 --> 신화자) ==> 짐 엄청 무거움
06:00 남서울중학교 정류장 도착
06:06 643번 버스 승차
06:40 고속버스터미널 하차
07:20 포항행 고속버스 승차
11:30 포항 고속버스 터미널 도착(연휴여서 차가 막힘): 비옴(우산)
11:40 고속버스 터미널 정류장(209번 버스 승차)
11:52 두호동 주민센터 하차
11:55 포항집 도착
12:00 중식
12:30 수종 노트북 소리 증폭 SW 설치
12:45 실내도보
13:55 종료
14:30 수종 방 형광등 점검(형광등 고장으로 추정됨)
15:00 수종 폰에 농협 스마트 뱅킹 앱 설치
16:00 낮잠 
17:45 기상
19:30 종료
18:00 석식
18:30 실내도보
19:50 종료
20:00 큰누나, 매형 방문 ==> 서울서 가지고 온 아령 2개, 핸드폰 거치대 선물함
20:20 핸드폰 액정 필름 붙이기 분석(유튜브 동영상 시청)
23:10 취침
======================================================================================================================
 
- PC에서 소리 증폭 SW 설치  
1. 무료 소리 증폭 프로그램 (Equalizer APO) ==> https://ivyit.tistory.com/149
 1) PC, 노트북 스피커 소리 크게 하기, 스피커 소리 증폭 하는 방법 ==> https://youtu.be/710b8M_dlDY
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.10.10(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 주말2[★]
06:00 기상
06:20 조식 
06:30 도보: 영일대 해수욕장 --> 등대
07:50 종료 
08:00 인터넷 서핑
10:10 다이소 두호점 방문 ==> 3M스카치 다용도 테이프 디스펜서(12 mm*21 m)/522 (천원), 블랙 헤더 분무기620 ml(천원) 구입
10:35 귀가 
11:00 집출발(큰누나 차, 매형, 수종)
11:30 중명 자연생태 공원 방문(김진협 집 근처)
		--> 포항시 국민여가캠핑장 ==> https://www.pohang.go.kr/camping/web/		
11:35 산책
12:00 야생화원 도착 --> 옥녀봉 갈림길 앞에서 돌아옴
12:43 큰누나 차
13:30 중식(헬로 짜장: 짜장면(생각보다 맛있음)): 큰누나가 쏨
13:55 종료
14:00 형산강 장미원: 사진 촬영
14:20 큰누나 차
15:05 연오랑 세오녀 테마공원 방문
16:53 하차(큰누나 차):
16:55 다이소 포항 우현점 방문 ==> 주방선반 (대) (3천원), 주방선반 (소) (2천원), 스포츠 목욕 가방(3천원) 구입
17:54 귀가 
18:00 석식
18:30 실내도보
19:50 종료
20:50 수종 핸드폰 약정 보호 필름(강화 유리) 교체 ==> 성공
21:10 성철이 외삼촌과 통화: 엄마 토지 재산세 문제(토지는 외할아버지 명의로 되어 있음: 토지세를 엄마가 안내면 문제 없을 것으로 추정됨)
22:40 샤워(수종)
23:10 취침
======================================================================================================================

- 액정 보호필름 완벽 붙이기 / 갤럭시 아이폰 태블릿 / 강화유리 방탄유리 PET 필름 붙이는 방법
https://youtu.be/142Q9hyAxDM
1. 우레탄 필름(일반 강화유리 필름: 탁탁한 비추), PET 재질 곡면 필름 
​======================================================================================================================​

- 벽지 분석
- 디아이디 매직 스티커벽지 시공동영상
https://youtu.be/M4RrPAEeFwc

- 셀프인테리어, 안방 실크벽지위에 벽지도배대신 시트지붙이기 ..?
https://youtu.be/PlfMFqkPZHI
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.11(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 대체 공휴일(한글날): 비옴

- 공휴일[★]
06:13 기상
06:40 조식 
07:00 실내도보: 비옴
08:10 종료
10:00 KT 플라자 방문 ==> 휴무(전화요금 아버지 명의 변경 실패)
10:05 다이소 두호점 방문 ==> 테니스공 체어슈즈 4P(3천원), 알루미늄 자(45 cm)2000(2천원) 구입
10:25 부엌 책상 다리에 테니스공 체어슈즈 4P 끼움
10:05 집출발(우산)
10:25 현주 전기조명 방문 ==> SMPS 남영 LED 클릭 30(만 3천원) 구입
11:00 귀가 
11:20 수종방에 남영 LED 설치: 성공 
12:00 중식 
12:30 집출발(우산)
12:40 다이소 두호점 방문 ==> 테니스공 체어슈즈 4P(3천원) 구입
13:00 두호 전기조명 방문 ==> FOCUS LED FPL 35W(2개) (3만원) 구입
13:30 귀가 
13:35 실내도보: 비옴
14:06 종료
14:20 부엌 의자 다리에 테니스공 체어슈즈 4P 끼움
15:00 거실에 FOCUS LED FPL 35W 설치: 성공
15:20 수종방에 FOCUS LED FPL 35W 설치: 성공
15:30 부엌에 남영 LED 설치: 성공
15:40 종료
16:20 석식
16:40 집출발: 비 옴(우산)
16:53 두호주민센터 정류장 ==> 209번 버스 승차
17:11 포항 고속버스터미널 도착
17:30 포항 출발
21:24 서울 강남터미널 도착: 비 안옴
21:38 고속 터미널 정류장 ==> 643번 버스 승차
22:15 남부초 정류장 하차
22:23 귀가
22:40 청소
22:50 인터넷 서핑
01:50 취침
===========================================================================================================================

- 77. YTN라디오 생생경제
https://www.youtube.com/watch?v=ZghWqboViXY&list=PLMWcf6HwIUthaq7opSRWyvi0rh_mh4MGQ&index=3

- 78. 홍사훈의 경제쇼(KBS1 라디오)
https://www.youtube.com/watch?v=1McACWUFPM4
======================================================================================================================

- 스마트폰 액정 보호필름! 싼게 장땡?? 알고 붙이자!! TPU vs PET (Feat.리얼룩앤컴퍼니) [만능혁키]
https://youtu.be/P3eFf9sM6EA

-스마트폰 강화유리 제대로 붙이기 (먼지 제거 꿀팁 공개) [만능혁키]
https://youtu.be/z6oPcBHEqyU
======================================================================================================================

- 액정 보호필름 없이 쓰는 6가지 이유! [보호필름 필요성] [액정필름 제거]
https://youtu.be/5hS23dKnK9w
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.12(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 잠바 처음 착용 후 출근(6시), 갤럭시 노트9 액정 필름 제거(액정 필름 기스 남), 코로나19 확진자 발생(오전에 
								퇴근하여 자택 대기)

- 농협 PFM 고도화 Prj[★] 
05:00 기상
05:40 조식
06:00 집출발
07:35 출근
07:40 통합 테스트 결함 처리(3건)
09:00 농협 IT 센타 8층 개발자가 코로나19에 확진됨 ==> 8층 모든 인원 코로나19 받고 자택 대기하라는 명령 떨어짐
09:10 퇴근
10:00 H+양지병원 방문 ==> 문진표 적성
10:35 코로나19 검사: 코로나19 검사비(11,000원 결제)
10:45 다이소 신림3호점 ==> 확장형 선반랙(2개): 포항집(만원)
11:05 귀가
12:00 중식 
12:30 실내도보
14:00 종료
14:00 인터넷 서핑 ==> 자택 대기
16:30 H+양지병원에서 코로나19 검사 결과(음성)으로 문자 보내줌
18:00 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
22:50 취침
======================================================================================================================

21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대폰번호 입력 ==>'
1. http://localhost: 8088/servlet/FMC01521R.view --> /fmco1521s.jsp
======================================================================================================================

- 사진합성 최강앱 snapseed 사용법[누나IT]
https://youtu.be/kLtEuyXuw74

- 돈주고 산 어플보다 좋음? 무료 사진 보정 어플 추천!! 제발 스냅시드 하자
https://youtu.be/p5MKj5cB1Vc
======================================================================================================================

- 01. 신화자(혈액 지정헌혈 안내문) 작업
1. MediBang Paint Pro SW로 작업(레이어 사용하여 작업)
 1) 01. 신화자(혈액 지정헌혈 안내문).mdp
 2) 01. 신화자(혈액 지정헌혈 안내문).png
======================================================================================================================

- [본사직영] 현대 쉬움 DIY 셀프장판(오늘의 집): 45,900원(D7140 시나몬)
https://ohou.se/productions/388907/selling?option_id=3246895&utm_source=enuri_shop&utm_medium=cpc&utm_campaign=uc_web-all-web_all-enuri_shop&utm_term=388907-3246895
0. 오늘의 집 로그인 ==> tamario@navercom[네이버로 로그인]
1. 현대 쉬움 DIY 주문 수량 계산 ==> 280 × 260 cm = 72,800 / 33,002 = 2.21 ==> 3개구입: 137,700원
---------------------------------------------------------------------------------------------------------

- 포항집 크기
1. 거실 장판: 460 × 350 cm
2. 수종이방: 280 × 260 cm
3. 주방: 270 × 240 cm 
---------------------------------------------------------------------------------------------------------

 방명 	 								가로(cm) 	 세로(cm) 	 계산 	 제곱미터 	평수 	박스 	가격			총가격
 1. 거실 장판: 460 × 350 cm 	 460 	 			350 	 161,000 	 33,001 	4.88 	 	5 			45,900	 229,500원
 2. 수종이방: 280 × 260 cm 	 280 	 			260 	 72,800 	 33,002 	2.21 	 	3 			45,900	 137,700원 
 3. 주방: 270 × 240 cm 	 		270 	 			240 	 64,800 	 33,003 	1.96 	 	2 			45,900	 91,800원 
 합계 						 																		 9.05 	10 		37,700	459,000원 
============================================================================================================================

- DIY 벽지(도배) @@@
https://www.youtube.com/results?search_query=DIY+%EB%B2%BD%EC%A7%80

- 만능 풀바른벽지 셀프도배 친환경 합지 단색 도배지(월풀)
https://smartstore.naver.com/wallplan/products/344644255?
1. 제품번호: G39346-1 다나 화이트, 참조: H084-2
http://gi.esmplus.com/achim1005/paper2020/trendy/39346-1.html

- 혼자서 풀바른벽지 셀프도배 대성공! 방 전체 합지벽지 도배하기 꿀팁! 이것만 보고 따라하면 실패없음
https://youtu.be/-VB1MwCaVPk

- 11번 정배솔 12인치 도배용정배 전문기술자용공구 연장   ==> 정배솔(12,000원), 꼭지칼(900원), 도배용 롤러(8,000원),
http://www.enuri.com/detail.jsp?modelno=15628806

- 실크도배-실크천정 혼자 도배하는 방법
https://youtu.be/X8PM4rOC5EE

- 신축아파트 34평 천장 혼자 도배하기[신축도배 이반장]
https://youtu.be/T4RA96-DDQ4
---------------------------------------------------------------------------------------------------------------------------------

- 전문가에게 물어보고 알려 주는 초보 셀프도배 실전 노하우! 에코텍스 초배지 사용법, 풀바른 벽지 붙이는 방법
https://youtu.be/tJSzq8424hY

- 풀바른 벽지로 셀프도배하기! 전문가의 실전 꿀팁 (DIY, 셀프인테리어)
https://youtu.be/uKN23lf7GHk

- [폴라베어] 천장도배시공! 실크도배와 합지도배의 차이가 뭔가요? 
https://youtu.be/uykh0s9H2Yk
============================================================================================================================

- LG CNS 파트너플러스(외주관리시스템)에 경력사항 등록 ==> 완료[♥♡] 
1. LG CNS PartnerPlus ==> https://partnerplus.lgcns.com/lpp/home,  DEV109094 / 11사*하@ ==> 22ta오*둘@
2. 개인정보 및 경력사항 등록 
3. 주식회사: 에코소프트 (사업자등록번호 : 132-86-13602)  (회사변경요청중)
============================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.13(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 농협 Prj 자택 대기(코로나19 확진자 발생, 오후에 출근)

- 농협 PFM 고도화 Prj[★] 
05:00 기상
05:40 조식
06:00 실내도보
07:10 종료
07:40 인터넷 서핑 ==> 자택 대기
11:35 조현준 수석이 오후에 출근하라고 함
12:00 중식
12:30 집출발
13:55 출근
14:00 통합 테스트 결함 처리(3건) 
18:10 퇴근
19:13 석식
=================================================================================================

- 결함 수정(DFCT-2021-0000007347) ==> 완료[♥♡] 
- PFM 고도화 2차 단위테스트
1. 결함내용: 생년월일로 나오는게 맞는지, 출생년도만 나오는게 맞는지 확인요청 
2. 결함처리: 출생년월일 (19440701) ==> 출생년도(1944)로 변경 
http://localhost:8088/servlet/FMSE3000R.view --> /fmse3000r.jsp 
 1) 첨부한 파일 (SE-S203-00101 New.png)에서
 2) NHPFM 화면설계서_설정(2차)_v0,02 20210709.pptx 파일에서 12 페이지 W 정보 기준으로 출생년도가 4자리로 되어 있어서 
 출생년월일(19440701) ==> 출생년도 (1944)로 변경 처리 했습니다. 
 ==> 6 봇공육 2000629826 EFFM06 IT 개인스마트뱅킹파트 김정근 Y
======================================================================================================================

- 결함 수정(DFCT-2021-0000007359)
1. 결함내용: 에러 팝업 등급상승 필요금액도 이상해보입니다. 일반등급에서 등급상승 필요금액을 넣었더니 블루가 아니라 그린등급
까지 나옵니다. 
2. 결함처리: http://localhost:8088/servlet/FMMY5200R.view --> /fmmy5200r.jsp 
일반 --> 블루 
월적금: 4500 만원 =
=》 붓칠칠 2000629878 EFFM77 사업부 TBD
-----------------------------------------------------------------------------------------------------------------------------

시뮬레이션 등급 계산 에러 문의 드립니다. 
필요점수 900을 넣고 Map<String, Object gradeUpNeedAmtMap = super.send(dataset, context, "AYP6001501"); 
// 하나로 가족고객 : 등급상승 시물레이션 필요금액 산출 AP 호출를 호출하면

var param = { 
	"ㅍ" : needPoint 	// 1. 현재 점수
};
 
httpSend("FINIY5210R", param, succfmmy5200r); 	// 등급상승 필요금액 처리함
-----------------------------------------------------------------------------------------------------------------------------

월 적금 필요점수가 4500 만원이 나오는데 이걸 입력해서 계산하기를 누르면 일반 --> 블루가 나와야 하는데 (다음추가 첨수 1200점 
미만) 아니라 일반 --> 그린으로 나오고 다음추가 점수가 1,373 점이 나옴) 
확인 부탁드립니다. 감사합니다.
======================================================================================================================

- 결함 수정(DFCT - 2021 - 0000007337) ==> 완료[] | 
1, 결함명 : 휴대폰번호 입력 삭제 오류 
2, 결함내용 : 휴대폰번호 입력 중 삭제를 위해 'X'를 누르면 휴대폰 번호를 올바르게 입력해 주세요. 라는 메시지가 나옴. 정상적으로 
10자리나 11자리 입력후에 X버튼을 누르면 휴대폰번호가 지워지나 그 외의 상태에서는 위 메시지가 나옵니다. 
3. 결함처리: 
 1) 원인: alertPopupDiv가 .btnReset{} 보다 우선 순위가 높아서 휴대폰번호에 대한 에러가 완전히 해결이 되어야 alert이 사라져야 
 입력내용삭제 버튼(.btnReset {})이 사라집니다. (휴대폰번호(예: 010 1234 5678) 입력 후 삭제 '버튼을 클릭하면 휴대폰번호가 삭제됨)
 2) 조치: 
  가, 기존대로 alert 제거 후 사용(아님) 
  나. 에러 메시지로 수정해서 처리함
http://localhost:8088/servlet/FMC01521R.view --> /fmco1521s.jsp

- /nh_base.css 파일에서
.btnReset{overflow:hidden; display:none; position:absolute;right:0;top:0;width: 36px;height:40px;font-size: 1px color:
transparent;background: url(../images/common/btn_input_close.png) no-repeat; background-size: 15px; background-position: 
50% 50%}

- /fmco1521s.jsp 파일에서 
$("#phoneNumber").on("blur", function () { // phoneNumber inputBox를 blur 했을 때 
	alertPopupDiv("휴대폰번호를 올바르게 입력해 주세요. [phoneNumber blur()]", "type02"); 	// 추가[2021.08.04, by 진태만]
 });
 
<strong class="formTit">휴대폰번호</strong>
	<div class="inputList">
		<input type="tel" title="휴대폰번호" name="phoneNumber" id="phoneNumber" placeholder="'-' 없이 번호만 입력하세요.">
		<a href="javascript:" class="btnReset" role="button">입력 내용삭제 </a>
	</div> 
======================================================================================================================

- 키움 영웅문 HTS @@@
- 주식 초보가 공부하는 방법 5가지 [주식초보 강의][주식투자 기초]
https://youtu.be/HE5Fe-yFIk4

- [주식놀이터] 영웅문S 시작하기! HTS사용법 1편[바른경제휴TV]
https://youtu.be/4CEJU2eTCqE
======================================================================================================================
 
- Apple ID(ipad: 뉴아이패드)
https://appleid.apple.com/account/manage, tamario@naver.com / tama339A

1. 새로운 보안 질문과 답변을 선택하십시오. ==> 
보안질문1: 첫번째(10대 시절에 가장 친하게 지냈던 친구의 이름은 무엇입니까?), 답변: tama
보안질문2: 첫번째(꿈의 직업은 무엇입니까?), 답변: 프로그래머
보안질문3: 첫번째(부모님이 처음 만난 도시는 어디입니까?), 답변: 포항
------------------------------------------------------------------------------------------------------------

- 뉴아이패드 업그레이드 
1. IOS 5.1에서 IOS 6.1로 업그레이드 
- 뉴아이패드 탈옥 
http://blog.naver.com/ifixhd?Redirect=Log&logNo=140164875480 
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.10.14(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
-  통합테스트 2차 통합 [2차] 
0. IT/사업부 통합 테스트 시행 (검증계에서 테스트)
1. 핸드폰으로 NM농협 스마트 뱅킹(검증게) 테스트 후 사진 촬영 후 조현준 수석에게 메일로 보낼 것
 1) 01. 증적 파일(1차_통테 2차)_진태만 폴더에 생성할 것
-----------------------------------------------------------------------------------------------------------------------------

- SE-S003: W정보 ==> 완료[♥♡]
- SE-5004: VIP 상담 신청내역 조회 (3개) ==> 완료[♥♡]
- CO S002; 영업점 방문상담신청 (7개) ==> 완료[♥♡] 
======================================================================================================================
 
- 퍼블에서 코드 추가 요청사항이 있어서 팝업페이지내 코드 추가 ==> 완료[1] 
1. 대상: p.jsp 파일 (팝업페이지) 
2. 추가내용: alopexready 상단에 popopenRun(); 함수 호출 추가내용 
3. 예시:
$.alopexready(function() { 
	popOpenRun(); 	// 퍼블에서 요청 함수 추가[2021.10.14, by 진태만]
	.. (생략) ..
}
======================================================================================================================

- 테스트케이스 프로그램 매핑 작업 ==> 완료[♥♡] 
1. 20211014_테스트케이스_프로그램_매핑_v0.1.xlsx
======================================================================================================================
 
- 검증계 소스 반영 요청 처리(배포 요청)
1. 수정한 소스를 eclipse에서 SVN 커밋 
2. /XEFMS/deploy_PFM에서 /20211015_1000.list 파일 열어서 수정한 파일 기입 후 SVN 커밋 
/WebContent/WEB - INF/jsp/service/fm/co/fmco1521s.jsp 
WebContent/WEB-INF/jsp/service/fm/se/fmse 3000r.jsp 
==> http://localhost:8088/deploy/list.jsp?AUTHOR=CS523262
======================================================================================================================
 
00. FMAS1920P 선불페이 상세 자동충전정보 : fmas1920p.jsp ==>완료[♥♡] 
1, 충전금액 단위 '원' 추가 [2021.10.14, by 진태만]
==> 82 봇팔이 2000629809 EFFM82 사업부 유일봉
======================================================================================================================

21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대픈번호 입력 ==> 완료[♥♡] 
1. 이전 버튼 사용함으로 처리 : 
$(".btnPressDefault").on("click", function () { | 
	// alert("[/fmco15215.jsp] [btnPressDefault_click()] ==> [TEST_01] [이전 버튼 클릭 이벤트]" );
	
	navigate("FMC01510R", {"returnPage": "<%= NHBHttpUtil.stripXss (requestMap.getString("returnPage")) %>",
	"noHistory": ""}); 	// VIP 금융컨설팅 - 서비스안내 화면으로 이동
});
-----------------------------------------------------------------------------------------------------------------------------

- 자산(AS) 알고하는 동의 관련 공통적용 사항(1/3) [P. 57] ==> 
1. 마이데이터 정보제공 동의(적요가맹점명, 거래메모 등) 
CASE 1. 입출금, 예적금, 외화, 마이너스 통장 거래내역 적요 - 전송요구 동의여부 체크
 1) 적요 표시 관련 대상 화면: 입출금 상세 (FMAS1310), ==> 완료[♥♡]
마이너스 통장 상세(FRAS1313), ==> 완료[♥♡]
예적금 상세(FMAS1320, FMAS1321), ==> 완료[♥♡]
외화 입출금 상세(FMAS1350),| ==> 완료[♥♡]
외화 예적금 상세(FMAS1351, FMAS1352) ==> 완료[♥♡]
==> [/fmas1311tS,java] [getConsptssendAgrYn()] : 적요 - 전송요구 동의여부 체크 추가
-----------------------------------------------------------------------------------------------------------------------------

==> 61 봇육일 2000629860 EFFM61 수행사(개발) - 화면서비스 권영진 
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.15(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 신한체크카드 재발급 수령 (09시, 사업장)

- 농협 PFM 고도화 Prj[★]
- 결함ID: DFCT-2021-0000007430  ==> 완료[♥♡] 
0. 결함명: (이지원) 15:47 단지정보 데이터 없을 경우 공백 오류 
1. 테스터: 이지원
2. 테스트계정 : EFFM82
3. 테스트기종 : 갤럭시 S21
4. 결함발생위치 : 자산 - 부동산 상세 - 단지정보 보기 
5. 결함명 : 단지정보 데이타가 없을 경우 공백 오류 
6. 결함내용 : 현 설계에는 데이터 없을 경우 -로 노출로 정의도어 있으나 해당 영역 미노출 할 수 있는지 확인부탁드립니다.
-----------------------------------------------------------------------------------------------------------------------------

45. FMAS1812P 단지 정보
1. http://localhost:8088/servlet/FMAS1812P.view --> /fmas1812p.jsp 
 1) 동/세대가 널이면 '/' 제거로 처리
======================================================================================================================

- 결함ID: DFCT-2021-0000007450 
0. 결함명: (장재만) 18:00 다음이자상환일 표기 오류 ==> 권영진 선임이 개발 담당이라 업무 이관함 
1. 테스터 : 장재만 
2. 테스트계정 : EFFM83
3. 테스트기종 : 아이폰 11 pro 
4. 결함발생위치 : 자산 > 상세정보 
5. 결함명 : 다음이자상환일 표기 오류
6, 결함내용 : 첨부 그림 참고
======================================================================================================================

- 결함ID: DFCT-2021-0000007445 
0. 결함명: (김정근) 17:14 VIP금융컨설팅 신청 완료 후 돌아가는 곳 확인요청 ==> 기획자에게 문의 함 
1. 테스터 : 김정근 
2, 테스트계정 : EFFM81 
3. 테스트기종 : LG G7 
4. 결함발생위치 : VIP금융컨설팅 > 신청완료 후 
5. 결함명 : VIP금융컨설팅 신청 완료 후 돌아가는 곳 확인요청 
6. 결함내용 : VIP금융컨설팅 신청 완료 화면에서 뒤로 가기를 누르면 바로 직전의 신청정보 입력하는 화면이 나오며, 상단
에는 스뱅GNB와 홈 밖에 없는데, 기획된 바가 맞는지 확인요청드립니다.
======================================================================================================================

- 결함ID: DFCT-2021-0000007439
0. 결함명: (김정근) 16:45 안내문구 확인요청 ==> 기획자에게 문의 함 
1. 테스터 : 김정근 
2. 테스트계정 : EFFM81 
3. 테스트기종 : LG G7 
4. 결함발생위치 : VIP금융컨설팅 > 영업점찾기 
5. 결함명 : 안내문구 확인요청
6. 결함내용 : 검증쪽 화면과 설계서와 상이 (검색어를 2자 이상.. vs 영업점명, 지하철역명...) 
7. 조치 내용: 1. 영업점 찾기 문구 수정[2021.10.15, by 진태만] 
======================================================================================================================

- 결함ID: DFCT-2021-0000007421 ==> 완료[♥♡]
0. 결함명: (이지원) 14:47 부동산 수정 삭제 후 부등산 목록으로 포커싱 필요. ==> 권영진 선임이 문의한다고 함 
1. 테스터 : 이지원 
2. 테스트계정 : EFFM82 
3. 테스트기종 : 갤럭시 S21
4, 결함발생위치 : 자산 - 부동산 수정 
5. 결함명 : 부동산 수정 삭제 후 부동산 목록으로 포커싱 필요. 
6. 결함내용 : 다른 실물관리와 동일하게 부동산 수정 후 저장 시 & 삭제 시 자산 서브메인 부등산 목록으로 포커싱되게 위치값 확인 
부탁드립니다. ==> 2차 개편때 자산 서브메인 부동산 목록 화면 삭제됨
======================================================================================================================

- 결함ID: DFCT-2021-0000007440 ==> 완료[♥♡]
0. 결함명: (한나리) 16:46 점수 기준일 미노출
1. 테스터 : 한나리 
2. 테스트계정 : EFFM96 
3. 테스트기종 : 갤럭시 510 
4. 결함발생위치 : 하나로 가족고객 
5. 결함명 : 점수 기준일 미노출 
6. 결함내용 : 전일자 점수의 점수 기준일이 노출되지 않음 
==> 96 봇구육 2000629912 EFFM96 기획 한나리 
7. 조치내용: 조회한 고객번호(2000629912)로 조회를 하면 하나로 가족고객 정보 조회가 조회가 되지 않아서 현재 점수기준일 
(CURR DATE: 점수 기준일)이 조회가 되지 않습니다. 하나로 가족고객 정보 조회가 가능한 고객번호로 조회하세요.
======================================================================================================================

- 결함ID: DFCT-2021-0000007441 ==> 완료[♥♡], 10월 18일(월) 오전에 반영 예정 
0. 결함명: (한나리) 16:47 상품추천영역에 회색 박스노출 
1. 테스터 : 한나리 
2. 테스트계정 : EFFM96 
3. 테스트기종 : 갤럭시 510 
4., 결함발생위치 : 하나로 가족고객 > 등급시물레이션 
5. 결함명 : 상품추천영역에 회색박스노출 6. 결함내용 : 상품추천영역에 회색박스가 노출되며 상품추천영역의 타이틀도 보이지 
않습니다. 
7. 조치내용 : 추천상품 수정(공통 소스 변경됨) 
==> 96 봇구육 2000629912 EFFM96 기획 한나리
-----------------------------------------------------------------------------------------------------------------------------

32. FMMY5200R 하나로 가족고객 - 등급 시물레이션 ==> 
1. http://localhost:8088/servlet/FMMY5200R.view --> /fmmy5200r.jsp
======================================================================================================================

- 결함ID DFCT-2021-0000007503 ==> 완료[♥♡], 10월 18일(월) 오전에 반영 예정
0. 결함명: (장재만) 15:56 계산하기 실행시 오류팝업 
1. 테스터 : 장재만 
2. 테스트계정 : EFFM83 
3. 테스트기종 : 아이폰 11PRO 
4. 결함위치 : 등급시물레이션 
5. 결함명 : 계산하기 실행시 오류팝업 
6. 결함내용 : 계산하기 누르면 계속하여 에러팝업 이후 계산결과 화면 나옴. 첨부 동영상 참조
 ======================================================================================================================

- 결함ID: DFCT-2021-0000007465 ==> 완료[♥♡]
0. 결함명: (이지원) 11:27 충전조건 기타일 경우 충전금액 히든 처리 
1. 테스터 : 이지원 
2. 테스트계정 : EFFM82 
3. 테스트기종 : 갤럭시 21
======================================================================================================================

- [신한 체크 카드 재발급] Deep Dream 카드 ==> 2021.10.15(금) @@@
1. 카드번호: 4619 5410 3869 3774(44619541038693774) 2026/10, 665, 비번: ***1 --> 결제일: 25일, 결제은행: 신한은행
2. 연회비: 없음 ==> 신한 직장인통장(저축예금) 전용 현금 체크 카드
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 한파특보 발령(영하 1도, 서울의 10월, 64년 만에 한파)

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
16:00 Windows 11 업그레이드(윈도우 10 --> 윈도우 11)
18:00 석식
18:20 실내 도보 ==> 주식의 정석 72강_대가들의 투자비법(20211012): 총 3번 수강 종료
18:50 종료 
19:10 인터넷 서핑
22:00 취침
======================================================================================================================

- Microsoft(마이크로소프트) 계정 비밀번호 변경[2021.10.16(토)]
https://www.microsoft.com, tamario@naver.com/21ta오*하나@
======================================================================================================================

- 지마켓(G마켓: gmarket) 비밀번호 변경[2021.10.16(토)]
http://item.gmarket.co.kr, tamario/21ta오*하나@
======================================================================================================================
 
- 투자의 선배가 전하는 초보 투자자들을 위한 가이드 [오늘 처음 투자를 시작한 당신에게 1-1부] [삼프로TV_경제의신과함께]
https://www.youtube.com/watch?v=cIvdEC-rQpY&list=PLQvqXcm97CTAf0wGhuP11PZaeUqsHIz44
======================================================================================================================

- MSI 크리에이터 17M A10SD-i7 [SSD 1TB], 17인치, RAM 옵션 / 16GB 추가(총 32GB)], 가격: 1,578,400원 ==> 강추
http://www.enuri.com/detail.jsp?modelno=50504227
1. 43.94cm(17.3인치) / 인텔 / 코어i7-10세대, RAM DDR4 32GB
http://www.interpark.com/mypage/common/MyPage.do?logintgt=mypage&FromLogin=Y
======================================================================================================================

- Windows 11 업그레이드(윈도우 10 --> 윈도우 11)
https://www.microsoft.com/ko-kr/software-download/windows11
1. Windows 11 설치 도우미를 통해 자동 업그레이드 시행
현재 사용 중인 장치에 Windows 11을 설치하는 데 가장 적합한 옵션입니다. 시작하려면 지금 다운로드를 클릭하세요. 
2. Win11_Korean_x64.iso 다운로드 받기 ==> 추후 설치 파일 만들기할 예정
------------------------------------------------------------------------------------------------

- Windows 11 실행 호환성 확인
https://www.microsoft.com/ko-kr/windows/windows-11#pchealthcheck
1. PC 상태 검사 앱9을 사용하여 현재 PC가 Windows 11을 실행할 수 있는지 확인하세요.
 1) TPM(Trusted Platform Module, TPM) : 신뢰할 수 있는 플랫폼 모듈은 PC에 추가되는 보안 칩.
 
- 윈도우 TPM 2.0 활성화 방법 ASUS 아수스
https://comeinsidebox.com/?s=TPM

- 부담 없이 듣는 TPM 이야기☕️ (feat. TPM 유무 확인 및 활성화 방법) [코딩하는거니]
https://youtu.be/UBa1mv6dGHs

- 윈도우11 우회 설치방법] PC 사양, CPU, TPM 낮아도 가능
https://youtu.be/hwcKDdYUgtQ
======================================================================================================================

- 공식적으로 출시 된 윈도우11 우회 설치를 위한 합법적인 부팅 USB 생성 및 설치 방법
https://youtu.be/IMQfpKy3HlA

- [Microsoft 공식 배포] 윈도우11 정식버전, 무료 설치 방법 (MS 공식 홈피 다운로드)
https://youtu.be/RkyTvoidZ3E

- MS 오피스 2021이 포함된 윈도우11 한글판 설치 방법 [영구적으로 사용 가능]
https://youtu.be/oJNfpd_Veow

- 윈도우11 업데이트 방법 및 새로운 기능[누나IT]
https://youtu.be/PN3_f8Guq9c

- 윈도우11 지원하지 않는 PC에서도 설치하는 방법 TPM 필요 없고 UEFI 설정따위 없어도 되는 방법입니다
https://youtu.be/umItvP7sb9M
======================================================================================================================

- 갤럭시PC 만들기 / S20 울트라 노트10 S10 / 듀얼 모니터 / DEX / 안 쓰는 스마트폰 활용
https://youtu.be/2ms1dw-IFhs

- 삼성 덱스 DeX 분석과 한계, 그리고 활용
https://youtu.be/v5CyjAu1RRg
======================================================================================================================

- 모르고 사면 후회! 샤오미 미패드5 VS 레노버 탭 P11 비교 선택 고민 해결
https://youtu.be/KvYunpVGeGw
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 실내 도보 
19:30 종료
20:00 청소(청소기, 밀대)
20:10 인터넷 서핑
22:40 취침
======================================================================================================================

- 악마의 발열덧신 후끈후끈 발열버선 발열패드, 가격: 1,350원(발열덧신_XL, 2개: 5,200원) 구입 ==> 완료[♥♡] 
http://www.enuri.com/detail.jsp?modelno=50919254
http://item.gmarket.co.kr/detailview/item.asp?goodscode=1538263246
======================================================================================================================

- 모니터 구입 검토[2021.10.17(일)]
1. [The Gear 리뷰] 삼성 스마트 모니터 M7
https://youtu.be/UaQgcVF-_-8

- 삼성 스마트 모니터 M7 + 야마하 SR-C20 - 이게 요즘 그렇게 ‘핫’하다면서요?
https://youtu.be/ud6_cBNd-EE

1. 삼성전자 SMART M7 S43AM700, 삼성 107.9cm(43인치) 스마트 모니터, 가격: 645,700원
http://www.enuri.com/detail.jsp?modelno=67489485
2. 삼성전자 SMART M7 S43AM700, 삼성 107.9cm(43인치) 스마트 모니터, 가격: 587,000원(현금가)
https://goodpeopleshop.co.kr/shop/product_detail.html?pd_no=127178&comefrom=enuri

- SAMSUNG 32-inch M7 스마트 모니터, 옵션 :Black / 27-inch FHD, 가격: 406,030원
https://www.11st.co.kr/products/3788298672?xzone=order^list&xfrom=order^list

- SAMSUNG 32-inch M7 스마트 모니터, Black / 32-inch M5 FHD / + 13,900원, 가격: 418,400원
https://www.11st.co.kr/products/3788298672?xzone=order^list&xfrom=order^list
======================================================================================================================

- 에이픽스 높이 조절 스탠딩 모션데스크 MD001 1400, 가격: 172,000원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C396637341&frm3=V2
--------------------------------------------------------------------------------------------------------------------------

- 삼성 모니터가 애플이랑 궁합이 이렇게 좋다고? 삼성 또 사고침 (삼성 스마트 모니터)
https://youtu.be/Sx9CQbQBspg
======================================================================================================================

- 아직도 로지텍 K380이 최고일까? 가성비 블루투스 키보드 3종 비교! (아이노트 38BT, 한성 BK300) [테크몽]
https://youtu.be/CVB2yCkrQCY

- 키스킨 증정 INOTE 38BT 블루투스 키보드 블랙, 가격: 23,400원
http://itempage3.auction.co.kr/DetailView.aspx?itemno=C406910360

- 로지텍 멀티 디바이스 블루투스 키보드(K380/정품), 블루, 가격: 25,810원
http://item.gmarket.co.kr/Item?goodscode=1998660700
====================================================================================================================== 
 
- 블루투스 키보드 구입[2019.08.24(토)] (잚소 구입: 미사용)
1. 삼지아이티 피스넷 Folder: OS전환Key, 충전식(USB), 자동절전, 블루투스3.0, 크기:25.1x8.9x0.6cm, 접은크기:가로14.6cm, 무게:180g, 가격: 34,110원
http://www.enuri.com/detail.jsp?modelno=11984793

- 삼지아이티 피스넷 FolderNote를 구입해야 함
1. 3단 접이식 블루투스 키보드~!, 가격: 45,000원
http://www.enuri.com/detail.jsp?modelno=13057788
====================================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2021.10.18(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 코로나 예방 접종 2차 휴가

- 주말2[★]
05:00 기상
05:40 조식
06:00 실내 도보
07:10 종료
08:35 집출발(자전거): 추움(잠바, 장갑)
08:55 수협 대림점 방문(코노19로 9시 30분에 영업 시작한다고 함: 업무 못봄)
09:05 수협 ==> 오목교 ==> 오목교역 ==> 서정초교 ==> 진명여고 ==> 법원 도착
09:35 서울남부지방법원 도착
09:40 루옌 만남(안경씀)
10:0 협의 이혼 전문위원 상담(가족관계등록계(206호)내 상담실)
		 ==> 나는 이혼 의사가 없다고 하고 루옌은 내가 무관심하고 사랑이 없어서 이혼하고 싶다고 함(3개월 숙려기간 갖기로 함: 사실상 끝) 
10:40 종료
10:45 법원 출발: 진명여고 ==> 서정초교 ==> 오목교역 ==> 오목교 ==> 안양천 다리 ==> 도림천
11:00 신도림 테크노마트 9층 방문 ==> 갤럭시 탭 케이스는 판매 안 함
10:45 수협 대림점 방문 ==> 수협 적금 만기 해약
12:10 귀가
12:15 중식 
12:35 실내도보
14:07 종료 
14:10 인터넷 서핑 
16:30 집출발(자전거)
16:40 다이소 신림3호점 방문 ==> 논슬립 옷걸이(6개씩 총 12개) [4천원], 신축식 핸드폰 거치대[3천원]
		, BH 심플 디자인 디저트 스푼(수종 숟가락): 서울집 보관[옷걸이 뽕-8P와 교환] 구입
17:10 삼성디지털프라자 신림점 방문 ==> 삼성 스마트 모니터 구경(옛날 기종이라 실망하고 돌아옴)	
17:25 귀가
17:30 집출발(자전거)
17:40 신한은행 ATM 방문 ==> 수협 적금 해약 금액(274만원) 입금(예전 신한체크로 처리)
17:50 귀가
18:00 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
20:40 샤워(찬물)
22:50 취침
======================================================================================================================

- 109만원 이동형 모니터 LG 스탠바이미? 47만원으로 직접 만들었습니다! ft.스탠바이허니
https://youtu.be/Pgr68MZhHP8
1. 삼성전자 SMART M7 S43AM700 이동혀 거치대 설치 고민
======================================================================================================================
 
- 삼성계정 로그인  
https://account.samsung.com, tamario@naver.com / 202*오*h@
====================================================================================================================== 

- 수협 적금 만기 해약(수협 대림점)
1. 상품명: Sh보고싶다! 명태야 적금2, 예금주: 진수종  
 1) 계좌번호: 1410-0974-8568, 계좌상태: 만기 해지
 2) 계산기간: 2018-10-17 ~ 2021-10-18, 계약기간: 2018-10-17 ~ 2021-10-17
 3) 연 3.7% 이율(3년 만기) 
A. 지급 명세 >>
1. 원금: 2,600,000원
2. 이자합계: 169,236원
3. 기본이자: 169,236원
4. 지급액 합계: 2,769,236원
B. 공제 명세 >>
1. 세액합계: 26,000원
2. 소득세/법인세: 23,690원
3. 지방소득세: 2,360원
C. 공제 명세 >>
1. 차감액 합계: 26,000원
2. 차감 지급액: 2,743,156원  ■■■
3. 세후 이자 지급액: 143,186원
======================================================================================================================

- 신한은행_자동이체 내역[2021.10.18(월)] [★]
	입금은행		입금계좌;				받는분;	이체금액(원);		이체기간;해지일자;			이체일자;	이체주기;	받는통장메모;	내통장메모
01. 국민			54780104047318;	이은희;	40,000;				2021.08.25~2022.12.25;;	25;			1개월;		진태만;				이은희(현아트빌 관리비)
02. 수협			141008745755;		진수종;	100,000;			2021.11.28~2023.10.28;;	28;			1개월;		수협아이적;		수협아이적
03. 농협			3021035838311;	문태용;	20,000;				2021.02.28~2030.02.28;;	28;			1개월;		태만나눔계비;	나눔계비
04. 농협			3021627027311;	진수종;	5,000;				2021.11.25~2024.10.25;;	25;			1개월;		진태만;				진수종(수종 용돈)
05. 지역농.축협	71302183076;		진기숙;	500,000;			2021.11.25~2024.10.25;;	25;			1개월;		진태만;				 진기숙(수종 양육비)
06. 새마을			9002186547010;	진기숙;	200,000;			2019.03.28~2029.02.28;;	28;			1개월;		부모님용돈;		부모님용돈
======================================================================================================================
  
- 회사 업무용(프리랜서 Prj 개발용) 노트북 구입 ==> 완료[♥♡] 
- MSI 크리에이터 17M A10SD-i7 [SSD 1TB], 17인치, RAM 옵션 / 16GB 추가(총 32GB), 가격: 1,578,400원
http://www.enuri.com/detail.jsp?modelno=50504227
1. 43.94cm(17.3인치) / 인텔 / 코어i7-10세대, RAM DDR4 32GB
http://www.interpark.com/mypage/common/MyPage.do?logintgt=mypage&FromLogin=Y
배송 메세지: 현아트빌 빌딩내 택배함 넣고 비밀번호 설정 후 문자로 비번 보내주세요.
======================================================================================================================

- 삼성이 해냈다! K380 이제 안녕~ 삼성 스마트 키보드 트리오 500 VS 로지텍 K380 블루투스 키보드 비교
https://youtu.be/zhs05VHojPM
1. 삼성전자 스마트키보드 트리오 500 [블랙], 가격: 36,000원
http://www.enuri.com/detail.jsp?modelno=67490115
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합 [2차]
======================================================================================================================
 
 - 전송요구 동의 여부 조회 서비스 AP 호출 수정 ==> 완료[♥♡] 
 1) 거래코드(AP): ASS2002501 [/fmas1311ts.java --> getConsptssendAgrYn() 파일 수정] 
 2) 거래코드(AP): ASS2002S01[/fmas1901ts.java --> getFranchSendAgrYn() 파일 수정]
Map<String, Object> resultMap = super.send(dataset, context, "ASS2002501"); 
// 전송요구 동의 여부 조회 서비스 AP 호출 수정[2021.10.19, by 진태만]

1. 미동의시 배너 노출 
	변경전 : 계좌 - ASS3101S06
				선블페이 - ASS3601S01
	변경후 : 공통 - ASS2002S01
2. 거래내역의 미등의는 기존 유지
======================================================================================================================

- 결함ID: DFCT-2021-0000007421 ==>완료[♥♡] 
0. 결함명: (이지원) 14:47 부동산 수정/삭제 후 부동산 목록으로 포커싱 필요. ==> 권영진 선임이 문의한다고 함 
1. 테스터 : 이지원 
2. 테스트계정 : EFFM82 
3. 테스트기종 : 갤럭시 S21 
4. 결함발생위치 : 자산 - 부동산 수정 
5. 결함명 : 부동산 수정/삭제 후 부동산 목록으로 포커싱 필요. 
6. 결함내용 : 다른 실물관리와 동일하게 부동산 수정 후 저장 시 & 삭제 시 자산 서브메인 부동산 목록으로 포커싱되게 위치값 확인 
부탁드립니다. 
==> 2차 개편때 자산 서브메인 부동산 목록 화면 삭제됨 
==> Back Key 적용을 위해 자산 메인에서 시작할 것 --> http://localhost:8088/servlet/FMMY1000R.view
-----------------------------------------------------------------------------------------------------------------------------

40. 자산(항목별목록) 화면
http://localhost:8088/servlet/FMAS1100R.view --> /fmas1100n.jsp ==> 부동산 1개: 클릭 
44. FMAS1812R 부동산 상세 화면 
1. http://localhost:8088/servlet/FMAS1812R.view --> /fmas181 
47. FMAS1814R 부동산 정보 수정 화면 
1. http://localhost:8088/servlet/FMAS1814R.view --> /fmas1814r.jsp --> 저장 버튼: 클릭 
/* 저장 버튼 클릭시 호출 */ 
function saveBtnFmas1816p() {
	if($("#regBtn").hasclass('disabled')) { |
		console.log("■■■ 등록버튼 비활성화 상태"); 
	} else {
		httpSend("FMAS1814R", params, saveBtnFmas1816pCallBackSucc, saveBtnFmas1816pCallBackFaill); 
	}
}

function saveBtnFmas1816pCallBacksucc() {
	console.log("("■■■ 자산등록 완료"); 
	fnBackPressed(); 		// 자산(항목별목록) 화면으로 이동 수정[2021.09.08, by 진태만]: 공통에서 수정 추정
}
-----------------------------------------------------------------------------------------------------------------------------

(단, 부동산이 1개 있었는데 삭제한 경우는 제외) 
실물+ 금, 외화, 기타에 적용되어 있는 것으로 확인했습니다. 
44. FMAS1843P 외화 관리 화면 
1. http://localhost:8088/servlet/FMAS1843P.view --> /fmas1812r.jsp --> 확인 버튼: 클릭
======================================================================================================================

- 프로그램 주석 확인 및 보완 ==> 완료[♥♡] 
1. 20211015_프로그램_주석체크.xlsx
======================================================================================================================

- 접근성 수청 사항 전달 ==> 완료[♥♡] 
1. 접근성수정사항전달.xlsx 
41. FMAS1310R 입출금 상세 
1. http://localhost:8088/servlet/FMAS1310R.view --> /fmas1310r.jsp ==> 조회 조건 클릭
2. FMAS1312P 조회조건 설정(/fmas1312p.jsp) 
<button type="button" class="sortBtn" onclick="inquery PopupOpen();">
	<!-- <span class="blind" 리스트 보기 유형 선택 </span>	 --->
	<span class="blind">조회조건 선택 설정하기</span> <!--// 대체 텍스트 제공 부척철 수정[2021.10.19, by 진태만]
</button>
 
<div class="inputList">
	<input type="tel" id="stret" value="<%= NHBDateUtil.getFormattedDate(inqstot,".") %>" title="조회 시작일" 
	placeholder="시작일선택" readonly="readonly"> 
	<a href="javascript:;" onClick="javascript:calendarPopup(this, function(res){activateBtn()}, 
	{Y: -1, M: 0, D:0, bind: $('#endDt'), index:1});" class="btnCalendar" title="시작일 날짜선택" 
	role="button"><span class="blind" >날짜선택</span></a>
	<!--// 대체 텍스트 제공 부적절 수정[2021.10.19, by 진태만] //--> 
</div>
======================================================================================================================

- LG전자 27MK430H, 27인치 모니터, 가격: 209,000원 구입(배송 준비 중이라 주문 취소함) ==> 완료[♥♡] 
http://www.enuri.com/detail.jsp?modelno=30169234
https://front.wemakeprice.com/product/110087021

- QX2775F REAL 75 HDR, 가격: 178,500원 ==> 박은경 주임[QNIX QX2775F 모니터]
http://www.enuri.com/detail.jsp?modelno=51620740 
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 구입한 MSI 노트븍 도착(19시, 윈도우10 설치 오류[심각])

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합 [2차]
======================================================================================================================
 
 - 결함ID: DFCT-2021-0000007430 ==> 완료[♥♡] 
0. 결함명: (이지원) 15:47 단지정보 데이터 없을 경우 공백 오류 
1. 테스터 : 이지원 
2. 테스트계정 : EFFM82 
3. 테스트기종 : 갤럭시 S21 
4. 결함발생위치 : 자산 - 부동산 상세 - 단지정보 보기
 5. 결함명 : 단지정보 데이터 없을 경우 공백 오류 
 6. 결함내용 : 현 설계에는 데이터 없을 경우 -로 노출로 정의되어 있으나, 해당 영역 미노출 할 수 있는지 확인 부탁드립니다. 
 --> 데이터 없는 영역은 히든처리로 개선 부탁드립니다. (자산 설계서 p118,119 5번 디스크립션 참고) 
 ==> 82 봇팔이 2000629809 EFFM82 사업부 유일봉
-----------------------------------------------------------------------------------------------------------------------------
45. FMAS1812P 단지 정보 
1. http://localhost:8088/servlet/FMAS1812P.view --> /fmas1812p.jsp
 1) 데이터 없는 영역은 히든처리로 개선
======================================================================================================================

- 자산(AS) 알고하는 동의 관련 공통적용 사항(1/3) [P. 57]
1. 마이데이터 정보제공 동의(적요가맹점명, 거래메모 등) 
CASE 1. 입출금, 예적금, 외화, 마이너스 통장 거래내역 적요 - 전송요구 동의여부 체크
 1) 적요 표시 관련 대상 화면 : 입출금 상세 (FMAS1310) [/fmas1310r.jsp] ==> 완료[♥♡] 
마이너스 통장 상세 (FMAS1313) [/fmas1313r.jsp] ==> 완료[♥♡] 
예적금 상세(FMAS1320, FMAS1321) [/fmas1320r.jsp, /fmas1321r.jsp] ==> 완료[♥♡] 
외화 입출금 상세(FMAS1350)) [/fmas1350r.jsp] ==> 완료[♥♡] 
외화 예적금 상세(FMAS1351, FMAS1352) [/fmas1351r.jsp] ==> 완료[♥♡] 
 ==> [/fmas1311ts.java] [getConsptssendAgrYn()] : 적요 - 전송요구 동의여부 체크 추가
 
CASE 2. 선불페이 거래 내역
1, 가맹점명 및 거래메모 - 전송요구 동의여부 체크 ==> 완료[♥♡] 
 1) 거래메모 및 가맹점명 표시 관련 대상 화면 : 선불페이 상세(FPAS1900, FMAS1900_1)
 2) FMAS1900R 선불페이 상세(/fmas1900r.jsp) 수정 
 ==> [/fmas1901ts,java] [getFranchsendAgrYn()]: 거래메모, 가맹점명 제공 등의여부 체크 추가
==> 63 봇육삼 	2000629862	 EFFM63 	수행사(개발)-AP 	노정희
======================================================================================================================

- 증적 파일 2차(통테 3차) 적용 
1. 통합테스티 시나리오 3차(통합)에 적용 ==> 01. 증적 파일_2차(통테 3차)_진태만 폴더
======================================================================================================================

- 12월, 1월, 2월 제주도 겨울여행 2박3일 여행코스 제주 동백꽃, 유채꽃, 핫플레이스, 맛집, 카페, 신상관광지까지 대박!!!
https://youtu.be/0I2IFiaddIU
======================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.10.21(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합T[2차]
======================================================================================================================

- 결함ID: DFCT-2021-0000007465 ==> 완료[♥♡]
0. 결함명: (이지원) 11:27 충전조건 기타일 경우 충전금액 히든 처리 
1. 테스터 : 이지원 
2. 테스트계정 : EFFM82
3. 테스트기종 : 갤럭시 S21
4. 결함발생위치 : 자산 - 선불페이상세 - 자동충전 정보 
5. 결함명 : 충전조건 기타일 경우 충전금액 히든 처리 
6. 결함내용 : 충전조건 기타인 경우, 충전금액 히든 처리 확인 부탁드려요.
7. 조치내용 : 확인 결과 충전조건 기타인 경우, 충전금액 히든 처리 되는 게 맞습니다. 
==> 82 봇팔이 	2000629809 	EFFM82 	사업부 	유일봉
-----------------------------------------------------------------------------------------------------------------------------

FMAS1920P 선불페이 상세 자동충전정보(/fmas1920p.jsp) ==> 완료[♥♡]
- /fmas1320r.jsp 파일에서(선불페이 상세 화면)
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.22(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합T[2차]
======================================================================================================================
 
- API 변경 대응_WW_프로그램 변경목록 처리 
- 102480660_API변경대응_WW_프로그램 변경목록_20211020.xlsx 파일을 수정 후 김홍석 부장에게 쪽지 보냄 
1. 적요 제공등의여부 반영 수정[2021.10.22, by 진태만]
2. 가맹점, 거래메모 제공동의여부 반영 수정[2021.10.22, by 진태만]
======================================================================================================================

FMAS1920P 선불페이 상세 자등층천정보(/fmas1920p.jsp) ==> 완료[♥♡]
1. 충전계좌기관명 안 보임 ==> AP에서 데이타 못 받아옴(노정희 부장에게 처리 요청)
String ChggAcorgnm = resMap.getString("CHGG_AC_ORGNM"); 	// 충전계좌기관명 
devConsole.log("/fmas1310r.jsp] [alopexready()] ==> [T_01] [선불페이 자동충전정보 팝업 화면]
 [01. 충전계좌기관명 ]"+ "<%=chggAcorgnm%>" +"[02. 충전계좌번호]"+ "<%=chggAcNo%>" );
======================================================================================================================

45. FMAS1812P 단지 정보
1. http://localhost:8088/servlet/FMAS1812P.view --> /fmas1812p.jsp 
 1) 데이터 없는 영역은 히든 처리로 개선
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:20 인터넷 서핑 ==> 제주도 항공권 구입
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 제주도 여행 사전 조사
18:00 석식
18:20 실내 도보
18:50 종료 
19:10 인터넷 서핑 ==> 제주도 여행 사전 조사
22:00 취침
======================================================================================================================

- 항공권 구입(마이 리얼 트립(My Real Trip) 앱에서 구입) 
1. 김포 --> 제주: 117,100원
■ 예약자 이메일 : tamario@naver.com
■ 예약번호 : 3072089 
■ 항공사 : 에어부산
■ 여정 : [편도] 김포-제주 BX8013
■ 출발일시 : 2022-01-06 07:20
■ 탑승객 : 총인원 3명
--------------------------------------------------------------------------------------------------------------

2. 제주 --> 김포: 112,500원
■ 예약자 이메일 : tamario@naver.com
■ 예약번호 : AE8LAM 
■ 항공사 : 진에어
■ 여정 : [편도] 제주-김포 LJ330
■ 출발일시 : 2022-01-08 20:35
■ 탑승객 : 총인원 3명
3. 마이리얼트립(My Real Trip) 앱이 만원 더 싸서 여기서 항공권 예매합 ==> 제주 <--> 제주: 229,600원
======================================================================================================================

- 꿀잼보장 제주도 가족여행코스 총정리 BEST10 | 제주도 아이들과 가볼만한곳 | 제주 동부 여행 | 제주 서부 여행 | 서귀포 여행
https://youtu.be/3wN5z-69Lfw
0:28 아침미소목장
1:07 스누피가든
1:32 보롬왓
2:00 아쿠아플라넷 제주
2:33 도치돌알파카목장
3:06 아르떼뮤지엄
3:26 명월국민학교
3:56 액티브파크 
4:24 하례점빵
4:51 중문 액트몬
======================================================================================================================

- 8월 9월 제주도 여행 2박3일 코스 제주 핫플 TOP 24 가볼만한곳!!!
https://youtu.be/OkRjOTLJBqg
======================================================================================================================
 
 - 항공권 구입[베트남 방문(07:15, 루옌) ■■ 2018.04.24(화) 작업 ■■
0. 웹투어 --> http://www2.webtour.com/GMypage/index.asp,  tamario2, 2020dhtlqh@
1. 김포 <--> 제주: 235,600원 
======================================================================================================================
  
 - 장인, 장모 비행기표 예매(23시) ■■ 2018.01.22(월) 작업 ■■
1. 온라인 투어 ==> http://www.onlinetour.co.kr ==> tamario / 2020dhtlqh@
======================================================================================================================
 
- MSI 개인 업무용 노트북 정보(MSI A10SD-i7) [2021.10.23(토)]
1. 모델명(MKT NAME):  Creator 17 A10SD-1015XKR 
2. S/N: K2101 N0018559
3. Product SKU : GG71075H16GXXDXX 
4. ERP P/N: :9S7-17G312-1015 
======================================================================================================================
 
- 박종훈의 경제한방(RL)
https://www.youtube.com/channel/UCn_38aaCktkBLPv3EtfmiUA/playlists
======================================================================================================================

- 1인셀러 필수 스마트폰 활용법 20강 - 네이버지도 즐겨찾기 활용팁
https://youtu.be/V-eEw4uv2B0

- 네이버 지도 설치 부터 사용법 자세히 설명 드립니다(지도의 설치, 기본 사용법, 길찾기...) [IB 96]
https://youtu.be/QFLszQqvLXo
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★
06:00 기상
06:40 조식
07:00 실내 도보
08:10 종료
08:20 인터넷 서핑 ==> MSI 노트북 점검(MSI DRIVE CD 파티션 삭제됨: MSI 서비스 센터에 가야할 것으로 판단됨)
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 실내 도보
19:30 종료
20:00 청소(청소기, 밀대)
20:10 인터넷 서핑
22:55 취침
======================================================================================================================

- MSI 로그인(노트북 구입)
https://account.msi.com/login, tamario@naver.com/2020오*h@
======================================================================================================================

- 갤럭시 탭 S6 라이트에 블루투스 연결
1. Wireless Bluetooth Keyboard BK 3001 연결
======================================================================================================================

- 윈도우11 구형 PC에 설치하기[OrangeStar]
https://youtu.be/AV8MW57w8lk
======================================================================================================================

- [본사직영] 현대 쉬움 DIY 셀프장판(오늘의 집): 45,290원(D7140 시나몬) 구입  ==> 완료[♥♡] 
https://ohou.se/productions/388907/selling?option_id=3246895&utm_source=enuri_shop&utm_medium=cpc&utm_campaign=uc_web-all-web_all-enuri_shop&utm_term=388907-3246895
0. 오늘의 집 로그인 ==> tamario@navercom[네이버로 로그인]
1. 현대 쉬움 DIY 주문 수량 계산 ==> 280 × 260 cm = 72,800 / 33,002 = 2.21 ==> 3개구입: 135,870원 ■■■■ 
======================================================================================================================

- 만능 풀바른벽지 셀프도배 친환경 합지 단색 도배지(월풀) 구입  ==> 완료[♥♡] 
https://smartstore.naver.com/wallplan/products/344644255?
1. 제품번호: G39346-1 다나 화이트, 참조: H084-2
http://gi.esmplus.com/achim1005/paper2020/trendy/39346-1.html
 1) 제품번호입력 : G39346-1 / 풀바름 종류선택 : 만능풀바른벽지(합지벽지) / 벽높이선택 : 230cm / 12개 (+58,800원), 총 가격: 81,808 원 ■■■■
 2) 추가상품 : 도배부자재 : 10.정배솔 / 1개 (+12,000원), 도배부자재 : 12.꼭지칼 / 1개 (+900원)
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.25(월) 작업 ■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 자체 휴가[★] 
05:00 기상
05:40 조식
06:00 실내 도보
07:00 종료
07:10 인터넷 서핑
08:20 김홍석 부장에게 전화해서 무릎 아퍼서 병원 간다고 함
08:25 조현준 수석에게 전화해서 무릎 아퍼서 병원 간다고 함
09:00 집출발(자전거) ==> 보라매공원 ==> 보라매독서실 ==> 농심 ==> 보라매역 ==> 대방역 ==> 대방지하도(계단)  ==> 여의교
		==> 여의교교차로 ==> 성모병원앞 교차로 ==> 6.3로 ==> 시범아파트앞 교차로 ==> 63빌딩 ==> 원효대교
		==> 원효대교 북단 계단(1.5층) ==> 다리(2층) ==> 용산 
09:45 MSI 서비스 센터 도착
10:05 MSI 크리에이터 17M A10SD-i7 AS ==> 직원이 MSI 홈페이지에서 Wireless LAN Driver다운로드 받아서 설치 해줌(당황)
10:20 대기실에 앉아서 계정신청정보_진태만 부장(LG CNS).xlsx 파일 작성 후 (주) 와이즈인포텍 박원상 부사장에게 메일 보냄
10:40 종료
11:00 힐링쉴드 용산점 찾기 ==> 신용산역 5번 출구 앞 빌딩(용성비즈텔 지하2층)으로 내려 갔는데 없어서 찾기 포기함
11:07 용산 출발
11:40 다이소 대방점 ==> 01. 실리콘 수세미(땅콩), 과일나아 암 디저트 우유 딸기향기 크림(2개), 과일나아 암 디저트 꿀바나나 크림
		==> 총 5천원(현금 결제: KT 인터넷 장애 사건: 대형 사고[전국에서 1시간 동안 인터넷 접속 불가])
12:08 GS25 신대방노블점 방문 ==> 중식(편의점 도시락: 자이언트 함박 스파게티, 5,610원: 맛 별로)
12:40 귀가
12:40 실내 도보
14:15 종료
14:20 인터넷 서핑 ==> MSI 노트북 점검(SW 설치 드라이버 설치)
18:00 석식
18:20 실내 도보
18:55 종료
19:10 인터넷 서핑 ==> MSI 노트북 점검
22:50 취침
======================================================================================================================
 
- LG전자 27MK430H, 27인치 모니터, 가격: 188,500원 구입(조은 사람들) ==> 완료[♥♡] 
http://www.enuri.com/detail.jsp?modelno=30169234
https://goodpeopleshop.co.kr/shop/product_detail.html?pd_no=105408
======================================================================================================================

- 악마의 발열덧신 후끈후끈 발열버선 발열패드, 가격: 13,300원(발열덧신_XL, 8개: 5,200원) 구입 ==> 완료[♥♡] 
http://www.enuri.com/detail.jsp?modelno=50919254
http://item.gmarket.co.kr/detailview/item.asp?goodscode=1538263246
======================================================================================================================

- 윈도우10  정품인증 제품키 구입[MSI 노트북[프로젝트용])
1. [바로발송] 마이크로소프트 윈도우 10 프로/홈 정품인증 제품키 windows 10 pro/home, 가격: 1,500원
https://front.wemakeprice.com/product/1863128582 
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.26(화) 작업 ■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[4차]
======================================================================================================================
 
- 결함ID: DFCT-2021-0000007828 ==> 권영진 선임으로 이관
0. 결함명: (유일봉) 17:07 상세 내역 다건 선택 필요 
1. 테스터 : 유일봉
2. 테스트계정 : EFFM82건 
3. 테스트기종 : 갤럭시 S20 
4. 결함발생위치 : 자산내역 - 선불페이 - 세부조회 
5. 결함명 : 상세 내역 다건 선택 필요. 
6. 결함내용 : 세부 내역(거래 유형) 조회 항목이 단건인데 다건이 선택 되도록 부탁드려요.
 1) 초기 : 전체 (이때 다른 항목은 미선택) 항목 선택하면 선택 다시 누르면 해제되어야 하고 중복 선택되어야 합니다.
======================================================================================================================

45. FMAS1812P 단지 정보 ==> 완료[♥♡]
1. http://localhost:8088/servlet FAS1812P.view --> /fmas1812p.jsp
 1) 데이터 없는 영역은 히든 처리로 개선
======================================================================================================================

- 결함ID: DFCT-2021-0000007909 ==> 완료[♥♡]
0. 결함명: (장재만) 13:57 VIP 휴대픈 번호 초기화 시 활성화 문제 
1. 테스트계정 : EFF183 
2. 테스트기종 : 아이폰11 프로 
3. 결함발생위치 : VIP금융컨설팅 
4. 결함내용: 메뉴 처음 진입 시 "다음 버튼 비활성 -> 휴대폰 번호 입력시 활성 -> 입력 값 초기화 시 비활성화 되어야 하는데 활성화 됨 
7. 조치내용 : 휴대폰 번호 입력 값 초기화 시 다음 버튼 비활성화 처리 
==> 1 봇육일 	2000629860 	EFFIN61 	사업부 	장재만
-----------------------------------------------------------------------------------------------------------------------------

21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대픈번호 입력 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMC01521R.view --> (fmco1521s.jsp 
 1) STEP1) 기본정보입력 휴대폰번호 입력 화면에서 연금진단 정보(은퇴 희망 나이) 입력 되어 있으면 AP에서 연금진단 결과 조회를 
 해야 하는데 소요 시간이 2~3초 가량 걸린다고 합니다. 참고 하세요.
======================================================================================================================
 
- Git 분석 @@@ 
1, 터미널: iTem2(cntr) 
2. Git directory
 1) 로컬[1) working directory 	2) staging area 		3) .git directory] ==> Git Hub
		-->> git add(1 --> 2) -->> git commit(2 --> 3) 
3. Git 명령어
> git config -global 
> git commit 
> git gnore 
> git status
======================================================================================================================

- 갤럭시탭S7 FE 12.4 WiFi 64GB 구입 ==> 완료[♥♡] 
- 삼성전자 갤럭시탭S7 FE 12.4 WiFi 64GB [정품], G마켓(해외 쇼핑), 가격: 523,000원
[화면]12.4인치2560x160016:10TFT-LCD60Hz
[CPU]스냅드래곤778G2.4GHz+1.8GHzAdreno642
http://www.enuri.com/detail.jsp?modelno=71793815
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2234332768 
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.27(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> Memo(2021.05) 작업(0 2021.10), 인수인계(09:40, 하나로 가족고객: 원지은 차장)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[4차]
======================================================================================================================

- 결함ID: DFCT-2021-0000008085 ==> 완료[♥♡]
0. 결함명: (장재만) 11:16 전화번호 자리오버 입력
1. 테스트계정 : EFFM83 
2. 테스트기종 : 아이폰 11 프로 
3. 결함발생위치 : VIP금융컨설팅 
4, 결함내용 : 전화번호 최대 11자리까지만 입력되어야 함 
10/26 정상 확인하였으나 
10/27 검증 반영 후 결함 재발생 
7. 조치내용 : ==> 1 봇육일 	2000629860 	EFFM61 	사업부 	장재만
-----------------------------------------------------------------------------------------------------------------------------

21-1. FMCO1521R VIP 금융컨설팅 - STEP1) 기본정보입력 휴대폰번호 입력 
1. http://localhost:8088/servlet/FMC01521R.view --> /fmco1521s.jsp
 1) STEP1) 기본정보입력 휴대폰번호 입력 최대 11자리까지 만 입력되게 재수정
======================================================================================================================

31. FMMY5100R 하나로 가족고객 ==> 완료[♥♡]
1. http://localhost:8088/servlet/FMMY5100R.view --> /fmmy5100r.jsp
 1) 점수 기준일 (CURR_DATE_TEXT)에 전일자 날짜(어제)가 노출되게 수정 처리
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.28(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 인수인계(13:50, VIP금융컨설팅: 정승호 선임)

- 농협 PFM 고도화 Prj[★]
- 통합테스트 2차 통합[4차]
======================================================================================================================

- 결함ID: DFCT-2021-0000008254  ==> 완료[♥♡]
0. 결함명: (이민숙) 10:47 입력값 없을때 계산하기" 버튼 비활성화 1. 테스트계정 : EFFM84 
2. 테스트기종 : 갤럭시s21 
3. 결함발생위치 : 하나로 가족고객 등급 시물레이션 
4. 결함내용 : 현재 보유자산 더하기에 입력값이 없을 경우 시스템에러 - 최소 하나이상 입력하라고 알럿이 2번 뜨고 있는데, 아예 
"계산하기" 버튼 비활성화가 더 나을 것 같습니다. 
7. 조치내용 : 입력값 없을때 "계산하기" 버튼 비활성화 추가[2021.10.28, by 진태만]
==> 1 봇육일 	2000629860 	EFFM61 	사업부 	장재만
-----------------------------------------------------------------------------------------------------------------------------

32. FMMY5200R 하나로가족고객 - 등급 시물레이션 
1. http://localhost:8088/servlet/FMMY5200R.view --> /fmmy5200r.jsp 
if(txtSavings == "0" && txtDeposit == "O" && txtCreditLoan == "0" 
&& txtMortgageloan == "0" && txtcard == "o") { 	// 입력값이 널이면 ==> 추가[2021.10.28, by 진태만]
	// Add Bookmark 처리(Add Task와 유사): [▶] 입력값 없을 때 계산하기 버튼 비활성화 추가[2021.10.28, by 진태만]
	$("#calcGradeBtn").addClass("disabled"); 		// 계산하기 버튼 Disabled 처리
}
else
{
	$("#calcGradeBtn").removeClass("disabled"); 	// 계산하기 버튼 Enable 처리
}
 ======================================================================================================================
 
- 결함ID: DFG-2021-0000008295 ==> 완료[♥♡]
0. 결함명: (장재만) 13:48 원장처리 오류 
1. 테스트계정 : EFFM83 
2. 테스트기종 : 갤럭시20FE
3. 결함발생위치 : VIP 컨설팅 예약취소 
4. 결함내용 : 시스템오류 팝업 
7. 조치내용 : AP 에러 예약 취소 에러가 남 ==> AP 담당자에 처리 요청함 
==> 1 봇육일 	2000629860 	EFFM61 	사업부 	장재만
-----------------------------------------------------------------------------------------------------------------------------

22. FMSE4000R VIP 신청내역 
1. http://localhost:8088/servlet/FNSE4000R.view --> /fmse4000r.jsp
======================================================================================================================

public IDataset canVIPReq(IDataSet dataSet, IBizserviceContext context) throws Exception {
	Map<String, Object> resMap = super.send(dataset, context, "COM4200001"); 	// VIP금융컨설팅 상담신청 취소
}
-----------------------------------------------------------------------------------------------------------------------------

- AP 에러 내용 
nexcore.gemini.commons.exception.CommonException TerrorCode=NC99998, messageCode=NC99998, messageValue=
 [농협은행 정보 통신 중 오류가 발생했습니다. 잠시 후 다시 시도해주세요. , COM4200001], debuggingMessage {"msg": 
 "농협은행 정보 통신 중 오류가 발생했습니다. 잠시 후 다시 시도해주세요. ","errCd":"ASS00013","data":null 
 "success":false} exceptionclassName=com.nhbank.ef.ms.base.EfmsBaseservice, exceptionThrowingMethodName
 =se exceptionThrowingLineNumber=115] at com.nhbank.ef.ms.base. EfmsBaseService.send(EfmsBaseService.java:115) 
 at com.nhbank.ef.ms.base. EfmsBaseService.send(EfmsBaseService.java:57)
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.29(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>  

- 농협 PFM 고도화 Pr 철수[★]
04:40 기상
05:40 조식
06:10 집출발
07:35 NH농협IT센타 8층 출근
07:40 업무
08:10 종료
11:40 중식
11:50 NH농협IT센타 강당 현관 도보
12:55 종료
14:00 모니터 제거(드라이버: 노란색, 주황색)
15:00 모니터 반출(1층 보안대: 정승호 선인, 장재만 과장[현업])
15:12 퇴근(백팩: 무거움, 모니터: 무거움)
16:20 귀가
16:40 인터넷 서핑 ==> 2021.05(농협 Prj) 파일 정리
18:00 석식
18:05 현아트빌 창문 누수 공사(인부 2명 우리집에서 작엄)
18:15 실내도보
18:20 빨래
18:40 창문 누수 공사 종료
18:55 실내도보 종료
19:10 인터넷 서핑 ==> 윈도우10 최적화 작업(MSI 노트북)
23:35 취침
======================================================================================================================

- 농협 PFM 고도화 Prj 철수(16시) 
1. 철수 인원: 진태만 부장, 정병귀 부장, 박종헌 과장, 김선웅 과장 ==> 총 4명
======================================================================================================================

- USB 512G 구입
- SanDisk Ultra Dual drive Go USB3.1 Type-C [512G], (USB 타입 + Type-C 2개 사용), 가격: 51,800원
http://www.enuri.com/detail.jsp?modelno=49463520
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=1849779574&GoodsSale=Y&jaehuid=200002673
======================================================================================================================
 
- 갤럭시 탭 S7 FE 케이스 구입
- 비스비 갤럭시 탭s7fe 북커버 케이스 S펜수납+필름1매, 가격: 31,930원
http://www.enuri.com/detail.jsp?modelno=71859012
http://itempage3.auction.co.kr/DetailView.aspx?itemNo=C380022720&frm3=V2
======================================================================================================================

- 지마켓(G마켓: gmarket) 비밀번호 변경[2021.10.29(금)]
http://item.gmarket.co.kr, tamario/22ta오*둘@
======================================================================================================================
  
- 옥션 비밀번호 변경[2021.10.29(금)]
http://itempage3.auction.co.kr, tamario/22ta오*둘@
======================================================================================================================

- Microsoft(마이크로소프트) 계정 비밀번호 변경2021.10.29(금)]
https://www.microsoft.com, tamario@naver.com/22ta오*둘@
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
05:00 기상
05:15 조식
05:50 집출발: 다이소에서 구입한 선반 2개 가져감
06:00 남서울중학교 정류장 도착
06:05 643번 버스 승차
06:40 고속버스터미널 하차
07:20 포항행 고속버스 승차
11:00 포항 고속버스 터미널 도착
11:10 매형 만남(차 얻어 타고 감) 
11:40 포항집 도착(령경이 도착)
11:50 다이소 포항 두호점 방문 ==> TH-투톤의자(5천원), 줄자(5m *19mm)(2천원) 구입
12:00 귀가
12:10 중식(매형, 수종)
12:30 수종이 책상 꺼냄(큰누나가 조립을 잘못해서 망가짐): 거실 옆방 식탁으로 교체함
12:40 도배 시작 ==> 월풀 벽지 생각보다 잘 붙고 가성비 좋음(만족): 매형과 령경이가 내가 도배 잘한다고 칭찬함
		  ==> 지저분하고 웅퉁불퉁한 벽지 정리(손 많이 감), 도배 정배솔 사용하니 편리하고 정확함 
15:40 도배 종료
16:20 장판 시공 시작 ==> 현대L&C 현대 쉬움 DIY 셀프장판 칸 맟추기가 힘들고 틈이 발생하면 부풀어 오름(노동이 많이 들어가고 엄청 힘듬)
		: 다시는 하지 말 것(매형도 엄청 힘들어 함)
17:40 장판 시공 종료 
18:00 석식(매형, 수종): 오리
18:10 큰누나 방문
18:50 큰누나네 귀가
19:00 실내도보 
20:00 종료 
20:10 TV 시청
22:30 샤워(수종)
23:00 취침(엄마방에서 수종이랑 같이 잠)
======================================================================================================================

- 만능 풀바른벽지 셀프도배 친환경 합지 단색 도배지(월풀)
https://smartstore.naver.com/wallplan/products/344644255?
1. 제품번호: G39346-1 다나 화이트, 참조: H084-2
http://gi.esmplus.com/achim1005/paper2020/trendy/39346-1.html
--------------------------------------------------------------------------------------------

- 현대L&C 현대 쉬움 DIY 셀프장판 : https://coupa.ng/b6nVpp
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C446771003&frm3=V2
======================================================================================================================
 
- 오주코 가성비 끝판왕 여행용 백팩 구입, 20인치(33 * 51 * 21cm, 허리 조임혐), 가격: 27,820원 
https://www.coupang.com/vp/products/181996508?vendorItemId=4039489643&sourceType=MyCoupang_my_orders_list_product_title&isAddedCart=
1. 생각보다 용량이 큼: 프로젝트용 가방으로 사용할 것
======================================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.10.31(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>
 
- 주말2[★
07:00 기상
07:30 조식
08:00 실내 도보
09:00 종료
09:40 인터넷 서핑 ==> 수종아 노트북 사용(USB로 2020.07(제주은행 모바일 뱅킹 Prj) 소스 복사)
11:30 중식
12:10 집툴발(수종, 엄마)
12:22 두호주민센터 정류장 ==> 207번 버스 탑승
12:35 죽도시장 도착
12:40 개구장이 아동복 방문 ==> 겨울티 2벌, 바지 2벌 구입(11만원 카느 결제)
12:50 죽도시장 정류장 ==> 209번 버스 탑승
13:10 두호주민센터 정류장 도착
13:20 귀가
13:40 실재보도 ==> 주식의 정석 74강_대가들의 투자비법(20211026): 총 4번 수강 종료
14:30 종료, 샤워타올 (하트하트)
14:49 다이소 포항 두호점 방문 ==> 치간칫솔L타입8P, 원형스틸후크(4P/SET), 샤워타올 (하트하트), 올리브 데코 버블 메이커(샤워 타올)
		, 과탄산소다(500g) 세면기 뚫기, 3M 스카치 박스테이프 (90 m)(투명), 3M스카치매직테이프디스펜서(18 mm*10 m/122) 구입
14:47 리플러스 방문 ==>성산별곡 찰흙미 1kg(6,300원) 구입
15:20 귀가
16:15 석식
16:40 집출발(백팩에 김치, 반찬)
16:47 두호주민센터 정류장(209번 버스 탑승) 
17:02 포항 터미널 도착 ==> 터미널 주위 2번 돌길
17:30 포항 출발
22:08 강남터미널 도착(4시간 40분 걸림)
22:20 서울 강남터미널 정류장 도착(643번 버스 승차)
22:25 남부초교 정류장 하차
23:08 귀가
23:30 청소 
23:45 인터넷 서핑 ==> 갤럭시탭S7 FE 셋팅
03:00 취침
======================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 
+----------------------------------------------------// End //----------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
1. OX ↑↓ ↔  ⇒ ⇔  ==> 완료[♥♡]  ==> 개발 중[☞☜]＃＆＠ § ※ ☆ ★ ○ ●◎ ◇ ◆ □ ■ △ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣
