

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022.05) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.05.01(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
09:30 오이(25개) 무침 ==> 양파, 당근 넣음(큰 통으로 2통: 양이 많음)
11:45 종료
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집) 
19:45 귀가
20:40 청소(청소기, 밀대)
21:20 샤워(체중: 65.7kg ==> BMI: 22.60[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================

- 71. 백세인생[rcyLst]
https://www.youtube.com/watch?v=H88f3WVTNaY&list=PLHl-Hd6rdhZzqJPf274JdnsLlstovaPOV
- 행복한 노년을 위한 습관 5가지! | 백세인생[ CTS기독교TV]
https://www.youtube.com/watch?v=H88f3WVTNaY
==============================================================================================================

- 국민반찬 콩자반! 잘 불려서 맛있게 조려보세요[쿡피아]
https://youtu.be/UJ3e88XSp9Y
==============================================================================================================

- 시금치 나물. 고소하고 매콤새콤하게 두 가지 방법으로 즐겨보세요[쿡피아]
https://youtu.be/1Nlg35n-Gik
==============================================================================================================

- 칼질 잘하는 방법! 제대로 배웁시다.[일식조리기술원]
https://youtu.be/QWJzDOUpqZk
--------------------------------------------------------------------------------------------------
 
- 칼질 채소썰기 기본영상 조리기능사동영상 기초잡이 입니다. [마스터박사부 -마스터요리]
https://youtu.be/SpY3oWC8g4I
1. 밀어서 썰기
2. 세부 썰기: 앞날 떼지 안고 밀어서 썰기
 --------------------------------------------------------------------------------------------------

- 당근채썰기, 당근 채써는 법, 당근썰기 동영상[박호근]
https://youtu.be/AI7RXZ_tHzY 
1. 어슷썰기: 칼을 앞으로 서서히 밀면서 썰기 
2. 썬 당근을 눌러서 최대한 길게 펴기
3. 왼손으로 당근을 잘 누르면서 원하는 뚜께로 썰기
--------------------------------------------------------------------------------------------------

- 양파는 이렇게 써세요:: 양파썰기 :: 양파손질 :: 칼질연습 :: 재료썰기[캐삼]
https://youtu.be/-BqnKIy_1HA
==============================================================================================================
 
- 수종 어린이날 선물 구입
1. 기차레고 레고시티 Train 레고기차 고속열차 무궁화호(옵션 02), 가격: 75,800원 ==> 05월 17일(화) 상품 도착예정
 http://www.tmon.co.kr/deal/4981678966?isHistory=Y
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.02(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00 ==> 첫 출근(09시, 백팩, 자전거)

- 신한은행 Prj[★] 
- 신한은행 일본 신단말 Prj 투입(9시, 신한은행 보라매역 금융센터점)  
0. 요청자: (주)제이앤에스팩토리[곽혜진](khj0920@jnsfactory.com)
프로젝트 명 : 신한은행 일본 신단말 재구축 프로젝트
고객사 : 신한은행
수행사 : 신한DS
계약사 : 제이앤에스팩토리(J&S Factory)
계약기간 : 2022-05-01 ~ 2022-10-31 (6개월)
근무장소 : 보라매역 신한은행 건물
프로젝트 내용 : 기존 화면 단말 HTML5(Websquare) 전환 개발
월단가 : 750만원
월용역비 지급일시 : 매 익월 05일 (휴일일 경우 전일지급)
계약방식 : 개인 3.3 % 공제방식 (산재보험료 추가 차감 : 13,780원) 
==============================================================================================================
 
- 신한은행 Prj 첫 출근
1. (주) 제이앤에스팩토리 김정윤 부장이 회사용 수첩과 탁상용 달력 선물에 줌: 기분 좋았음
2. 공통 하누리 주임이 SW 설치 방법 잘 설명해줘서 순서대로 설치함
==============================================================================================================
 
- 신한은행 일본 신단말 Prj(보라매역 금융센터점) 출입문 정보[22.05.02(월)]
1. 1층 현관문 비번: 112701^
2. 3층 현관문 비번: 2580^
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.03(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 워런 버핏의 마지막 유언 내용 l 자산의 90%는 반드시 여기에 투자 하세요 l 더 게으르고 안전하게 더 높은 수익을 누리는 방법
https://youtu.be/Z0rX7uEPHiA
==============================================================================================================

- 프리랜서 종합소득세 신고
1. 텍스나라: http://www.taxnara.co.kr --> 핸드폰: 010-5714-8252
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.04(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 울트라 에디터 프로젝트 생성
1. 01. Memo Prj.prj
 1) D:\01. TAMA_DATA\02. TAMA Project\2022.05_신한은행 일본 신단말 재구축 Prj) [41. JAVA T ■]\01. Memo
2. 14. Ultra Edit Prj.prjj
 1) D:\01. TAMA_DATA\02. TAMA Project\2022.05_신한은행 일본 신단말 재구축 Prj) [41. JAVA T ■]\01. Memo\14. Ultra Edit
==============================================================================================================

- 울트라 에디터 프로젝트 생성
1. 프로젝트 열기 단축키: Shift + Alt + O
2. 대문자 단축키: Alt + F5, 소문자 단축키: Shift + F5
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.05(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  

- 어린이날[★]
04:30 기상
04:40 조식
05:18 집출발
05:25 남서울중학교 정류장 도착
05:30 5413번 버스 승차
06:07 고속버스터미널 하차
06:10 도보(고속버스터미널 실외)
06:40 포항행 고속버스 승차
10:57 포항 고속버스 터미널 도착(휴게소 2번 방문, 차 막힘)
11:00 다이소 학산점 방문 ==> 컬러 패턴 공기(약12 cm, 2개, 4천원) 구입
11:12 고속버스 터미널 정류장(209번 버스 승차)
11:25 두호동 주민센터 하차
11:30 포항집 도착
12:10 중식
12:30 거실에 이스트라 쿠카 TV 설치 ==> 통합 리모콘 설정 못 함
14:00 종료
14:25 집출발(수종)
15:00 환호공원 방문 ==> 스페이스 워크(무료)에서 걷기(수종): 줄 서서 1시간 기다림
15:20 동물 관람
16:00 시립 박물관 방문 ==> 미술품 관람(수종)
17:30 김밥나라 방문 ==> 석식(비빕밥[내 것], 치즈 돈가스[수종]): 밑반찬을 많이 먹어 속이 약간 안 좋음
18:20 귀가
20:30 다이소 두호점 방문 ==> 컬러 패턴 공기(약12 cm, 2개, 4천원), 직사각 리빙 박스(36*25*17 cm, 갤럭시 탭 거치대용, 3천원) 구입
21:10 귀가 
23:00 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.06(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 휴가[★]
06:00 기상
06:10 조식
06:50 집출발(엄마)
07:00 두호동 주민센터정류장(207번 버스 탑승)
07:15 죽도 시장 정류장 도착
07:25 배추 구입(1포기 4천[9포기: 3만 6천원])
07:30 택시 탑승(배추, 엄마)
07:40 포항집 도착(5천 2백원: 내가 계산)
07:42 귀가
07:44 실내 도보
08:00 종료
08:10 인터넷 서핑  ==> 김장하기(9포기: 엄마)
10:10 도시가스 명의자 변경(10시, 포항집): 도시가스 콜센터에 전화해서 아버지에 엄마(신화자(450212-2703413))로 명의자 변경 처리 
12:10 중식 
12:30 실내 도보
14:00 종료
14:00 인터넷 서핑
14:10 현대 HCN AS 기사 방문 ==> 통합 리모콘 설정 해줌(하나의 리모콘으로 통합 가능)
		--> 구글 홈 설정(핸드폰에서 미러링해서 TV로 유투브 시청 가능)
17:00 김장 종료(3통): 엄마가 다함
18:00 석식
18:30 집출발(수종)
19:10 큰 누나 미용실 도착
19:20 이발(수종, 나)
20:10 종료==> 내가 큰 누나 미용실에서 20만주고 판매한 델 노트북 다시 받아옴(스피커 고장이라고 사용 안한다고 함)
20:25 귀가(큰 누나 차)
20:30 인터넷 서핑
22:30 취침(수종)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:40 ~ 19:40 ==> 

- 주말[★]
06:14 기상
06;40 조식
07:00 도보(영일대 해수욕장)
08:30 종료
08:40 인터넷 서핑 
12:08 중식
12:30 실내 도보
14:00 종료
14:10 인터넷 서핑
15:30 집출발(수종): 바람 많이 붐
15:50 마장지(창포지: 연못) 방문
16:00 큰 굴 방문(입구 없어짐)
16:20 다이소 두호점 방문 ==> 컬러 패턴 공기(약12 cm, 2개, 4천원) 구입
16:30 귀가
18:00 석식
18:30 도보(집 => 창포사거리 => 창포지구메트로시티1단지 => 마장지 => 작은굴 우회 도로 => 우현 중해 마루힐 센텀 아파트 => 
		포항 철길숲 => 우창동 주민센터 => 다이소 우현점[마우스 패드 둥근형(3개, 3천원) 구입] => 다이소 두호점[TH-투톤의자(5천원)
		, HJW 뉴 멜라민 쟁반(45X35cm)(5천원) 구입] => 집)
20:00 귀가
20:10 인터넷 서핑
21:30 칼 칼기 ==> 서울집(새 칼) 포항집(새 칼, 헌칼 2개) 갈기: 생각보다 잘 갈았음
22:07 종료
22:00 샤워(수종)
22:30 취침(수종)
============================================================================================================== 

- 폐철도가 휴식공간으로!! 포항 철길숲! [포항 MBC]
https://youtu.be/ejve86G_9qU
============================================================================================================== 

- Windows 10의 소리 문제 해결(스피커, 사운드 테스트)
https://support.microsoft.com/ko-kr/windows/windows-10%EC%9D%98-%EC%86%8C%EB%A6%AC-%EB%AC%B8%EC%A0%9C-%ED%95%B4%EA%B2%B0-73025246-b61c-40fb-671a-2535c7cd56c8
1, 시작  > 설정 > 시스템 > 소리 ==> 사운드 장치 관리(새창)
 1) 출력 장치 --> 스피커[테스트]: 스피커 소리가 깨어지게 들림
============================================================================================================== 

- 진수종 OneDrive(포항 동부초 2-2, 1TB) 로그인 비밀번호 수정
https://r100003650-my.sharepoint.com/personal/soojong_phdongbues_school_gyo6_net/_layouts/15/onedrive.aspx
--> soojong@phdongbues.school.gyo6.net / so*0508@[2021.09.13(월)] --> jong0508@[22.05.07(토)]
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.05.08(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 

- 주말2[★]
06:10 기상
06;30 조식
07:00 도보(집 => 창포사거리 => 마장지 => 작은굴 우회 도로 => 포항 철길숲 => 우창동 주민센터 => 집)
08:30 종료
08:40 인터넷 서핑 
09:00 델 노트북 점검: 와이파이 연결 안됨
11:36 집출발(수종, 엄마)
11:45 큰 누나 차 탑승(매형 만남)
12:07 솔향기 오리촌 도착
12:12 중식(오리 불고기, 오리 삽겹살, 밥 4인분)
13:00 종료(계산: 92,000원 ==> 내가 쏨)
13:20 마장지 근처 도보(큰누나, 매형), 엄마는 혼자 쑥 캠
14:20 종료
15:00 헤이안 커피솦 방문(딸기 쥬스, 빵 1조각(매형이 쏨))
16:00 종료(수종이 핸드폰 음료수대에 놓고 와서 다시 가서 찾아 옴)
16:10 귀가
16:15 큰누나 TV 버리기(매형과 같이 들고 고물상 앞에 갖다 놓음)
14:20 큰누나, 매형 귀가(에어컨 새로 구입해서 바쁘다고 함)
14:25 인터넷 서핑
17:52 석식
18:18 집출발(김치 (1통), 양념장(1통), 콩자반(1통), T셔츠(5벌), 바지(1벌), 칼, 숯돌, 밥그릇(2개), 마우스 패드(2개))
18:21 두호동 주민센터정류장(207번 버스 탑승)
18:30 오거리 정류장 도착
18:30 도보
18:36 포항 고속버스터미널 도착
19:10 포항 출발 
23:45 입장 휴게소 도착(비옴: 화장실 갔다옴)
24:45 서울 강남터미널 도착
01:00 고속 터미널 정류장 도착 ==> N75번 버스(사람 많아서 못 탐ㅂ), 4318번 버스 탑승
01:10 사당역 정류장 하차 ==> 도보(백팩에 담긴 짐이 엄청 무거움)
02:30 귀가
02:50 취침
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2022.05.09(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:30 ~ 18:00 ==> 대방 공원 도보(11:50, 점심 식사 후 도보: 나무 그늘이 많아서 좋음)

- 신한은행 Prj[★] 
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.05.10(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 제 20대 윤석열 대통령 취임식(11시, 국 회의사당)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- Port 8080 was already in use 에러와 원인과 해결 방법
0. https://7942yongdae.tistory.com/m/35
1. 현상: Port 8080 was already in useps -ef | grepJava SpringBootWeb server failed to start 서버 구동 에러
2. 조치:
> netstat -ano | findstr 8080
프로토콜  /    로컬 주소    /  외부 주소   /    상태     /  PID
TCP       0.0.0.0:8080    0.0.0.0     LISTENING             12345

> taskkill /f /pid 12345
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.05.11(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
   
- AcroEdit 프로젝트 설정 방법
1. 프로젝트(P) ==> 새 프로젝트(P) ==> 01. Acro Edit Prj.apj 입력 --> 열기(O):클릭
2. AcroEdit SW 재 시작
3. 프로젝트(P) ==> 프로젝트 열기(O)
 1) 01. Acro Edit Prj.apj 파일이 보임
 2) 01. Acro Edit Prj.apj 파일: 마우스 우 클릭 ==> 폴더 추가(D): 클릭
 3) 미리 생성해 놓은 01. Main 폴더 선택
 4) 01. Main 폴더: 마우스 우 클릭 ==> 파일 추가(A): 클릭
 5) 미리 생성해 놓은 T_01.sql ~ T_10.sql 파일들을 선택
 6) T_01.sql ~ T_10.sql 파일들이 왼쪽 프로젝트 트리에 보여짐
==============================================================================================================

- 당뇨인들에게 최악의 음식 어떤 것들이 있을까요?
https://youtu.be/jpNelId5Mkc
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.12(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 신한은행 Prj[★] 
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 편집기  글꼴(font: 폰트)
0. 돋움체, Regular, 10pt	  ==> 추천 ■■■
1. Verdana, Regular, 9pt	==> 추천 ■■■
2. Courier New, Regular, 9pt  ==> 추천 ■■■
3. Verdan, Regular, 10pt
4. Fixedsys, Regular, 12pt  ==> 너무 큼 ■■■
5. 궁서 Regular 12
6. 굴림체, Regular, 10pt 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.05.13(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 2021년 귀속 종합소득세 신고
1. 텍스나라에 홈페이지에 등록
 1) 수수료 10만원
==============================================================================================================
  
- 윈도우팁, 알아두면 유용한 윈도우 단축키 살펴보기(윈도우키)
https://pepepien.tistory.com/173

- Windows 로고 키 바로 가기 키
https://www.dukgun.com/2019/08/microsoft-windows-10-shortcut.html
==============================================================================================================

- 소프트웨어 설치 없이 "작업표시줄"에서 CPU, RAM, 디스크, 네트워크 사용량 표시하는 방법
https://youtu.be/v1w0L37QrIk
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.14(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:40 ==> 

- 주말
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
08:30 귀가
09:03 집출발(자전거)
09:29 서울 가정의학과 의원 방문 ==> 혈당 측정: 129
09:32 진료 ==> 당뇨 상담(당뇨약, 미세 당백뇨약 처방[5,800원]): 혈당치 보고 좋아 졌다고 함
09:40 래미안 나나 약국 방문 ==> 조제(당뇨약, 미세 당백뇨약: 4주치[9,800원])
09:45 종료
10:00 남구로 시장 방문 ==> 파래 김(100장, 6천원) 구입
10:10 자연을 사랑하는 형제들(남구로 시장 내) 방문 ==> 오이(3천원: 10개[2봉지, 총 6천원]): 20개, 양파(한 봉지, 2천원), 
		마늘(한 봉지, 3천원), 당근(2봉지, 2천원) 구입
10:30 귀가
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
19:50 종료
20:30 귀가
21:00 인터넷 서핑
23:00 취침
============================================================================================================== 
 
- 갤럭시 S22 받자마자 해야하는 26가지 초기 설정 및 꿀팁 활용법[에이트 ATE]
https://youtu.be/nmTnS5B1g9Y
==============================================================================================================

- 갤럭시 스마트폰 사용을 편리하게 도와주는 필수 설치 앱 - Good Lock(굿락) [IB 96]
https://youtu.be/z3gYdee7T_Y
==============================================================================================================

- 스마트폰에 꼭 설치 해서 사용하면 좋은 앱_굿 가디언스 앱[IB 96]
https://youtu.be/wPuYQC383Ss
==============================================================================================================

- 스마트과 TV를 연결하는 쉽고 간단한 여러가지 방법_삼성 Dex(덱스), 키보드, 마우스, 셋탑박스 연결 방법 설명[IB 96]
https://youtu.be/LHslrRTm970
==============================================================================================================

- 먹을때 까지 무르지 않고 아삭한 '오이김치' 정말 맛있어요[엄마의 손맛] 
https://youtu.be/TnezZAbcF9k
1. 오이 썰기(2등분 --> 빗겨 썰기)
2. 커피 포터에 굵은 소금 2큰술 + 물 1리터를 넣고 끓이기
3. 끓은 소금물을 오이에 붓기 ==> 2분 동안 놔두기
4. 2분 후 찬물에 넣기
5. 찬물에서 뺀 후 빈 용기에 넣어서 굵은 소금 1큰술 + 물엿 100g 넣은 후 15분에서 20분 동안 절여주기
6. 찬 물에 행구기
7. 양념하기
==============================================================================================================
 
- 맛있는 오이 소박이 이렇게 담구세요. 틀림없습니다! 우리가족 행복하게 하는 오이 김치[딸을 위한 레시피]
https://youtu.be/uVs5L7iWBJs
1. 천일염: 5큰 술+ 물: 1리터 ==> 1시간 ~ 1시간 반 정도 절여주기
==============================================================================================================
 
- 오이 무침 / '이것' 넣어 물 안 생기고 오래 두고 먹어도... / 제발 소금으로 절이지 마세요 물러짐 NO[함께해요 맛나 요리]
https://youtu.be/D3LVx3EpMK4
1. 천일염:  2큰 술 + 물엿: 반큰 술 ==> 1시간 정도 절이기
==============================================================================================================
 
- 오이 깍두기 무침 이렇게하면 물이생기지 않아요
https://youtu.be/gfBZWqBGJ0E 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.15(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:30 귀가
09:30 인터넷 서핑 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> 마인드 맵 분석
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 66.8kg ==> BMI: 23.11[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================

- 마인드 맵 분석
0. https://www.youtube.com/results?search_query=%EB%A7%88%EC%9D%B8%EB%93%9C+%EB%A7%B5
0. 무료 마인드맵 프로그램 xMind 사용하는 방법 ==> https://mainia.tistory.com/2080
- 평생 썸거는 인생의 무기, 마인드 맵을 배워봅시다. - 필수 생산성 도구 마인드맵 활용법 소개[성장의 지도]
https://www.youtube.com/watch?v=ypKqiIftHLc

- 마인드맵을 활용한 독서법 || 우기의독서법[우기부기TV]
https://youtu.be/M57epJ9Z4qk
  
- XMind(마인드맵) 설치
1. 마인드맵, XMIND 디지털 마인드맵으로 [구기모의 스마트워크 #55]
https://www.youtube.com/watch?v=JWUHTQXPdUo
==============================================================================================================

- 카카오톡 용량 한번에 줄이기/메모리 용량 늘리기(갤럭시, 아이폰, 안드로이드) [B-NOTE 비노트]
https://youtu.be/EX-34TxJWdE
==============================================================================================================

- 평생 썸거는 인생의 무기, 마인드 맵을 배워봅시다. - 필수 생산성 도구 마인드맵 활용법 소개[성장의 지도]
https://www.youtube.com/watch?v=ypKqiIftHLc
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.16(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 나이가 들어도 늙지 않는 비밀, 256년을 산 이청운의 양생술 10가지
https://youtu.be/rISVOqp3Qpg
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.17(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.05.18(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 갤럭시 노트 SLst
https://www.youtube.com/results?search_query=%EA%B0%A4%EB%9F%AD%EC%8B%9C+%EB%85%B8%ED%8A%B8
==============================================================================================================

- 휴대폰 사기 전 꼭 보세요!! 이렇게 했더니 갤럭시S22 현금가 4만원에 샀습니다!!
https://youtu.be/1C-AROYNftI
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.19(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 배상범에게 신한은행 QA 업무(월 470만원) 소개 시켜줌: 내부 협의 결과 면접 하지 않고 취소됨

- 신한은행 Prj[★] 
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- [02. WS] dataMap값 조회(Websquare에서) [JSON.stringify(), WebSquare.xml.serialize(), dataMap, Dlt] 
 /**
 * 조회 버튼 클릭 이벤트
 */
scwin.btn_search_onclick = function() {
	console.log("[/WF001M.xml] [btn_search_onclick()] ==> [TEST_01] [로그인 화면] [초기화] [★] [TEST_01]"); 
	console.log("[/WF001M.xml] [btn_search_onclick()] ==> [TEST_01] [조회 버튼 클릭 Eevntg(@)]" );
	 
	var setJSON = {
			"qqAcN": "",		// 1. 조회 계좌번호 
			"qyCcd": "B"		// 2. 조회 구분(A: 모둔 계좌, I:입금 가능 만, B:입출금 가능만) 
		}; 
		console.log("[/WF001M.xml] [fn_search()] ==> [TEST_50] [setJSON]"+ JSON.stringify(setJSON) );
		console.log("\n\n[/CBSC101P.xml] [btn_Login_onclick()] ==> [TEST_40] [INPUT dataMap값 조회_☆★☆★(@@)] [
		dma_loginCheck]"+ JSON.stringify(setJSON.getJSON()) ); 
		console.log("\n\n[/CBSC101P.xml] [btn_Login_onclick()] ==> [TEST_51] [dlt_Authority, 조회수_☆★☆★(@@)]"+
		dlt_Authority.getTotalRow() +"[dlt_Authority, 조회결과]"+ WebSquare.xml.serialize(dlt_Authority.getAllXML()) );
				
		com.exeService(
			{"ServiceID":"T_WF_0001"},		// Sub Info(1. ServiceID: 서비스 ID, 2. URL: 호출할 URL) ■■■
			setJSON,									// INPUT 값(inJSON)
			scwin.fn_search_callback			// 결과 콜백 함수(callbackFn)
		);
	};
};
==============================================================================================================
 
- Websquare 라이선스 키 등록(라이센스 등록)[22.05.19(목)]  
1. 개발 라이센스 발급 요청
 1) 인스케어 홈 ==> Q&A | 묻고 답하기 ==> https://wtech.inswave.kr/websquare/websquare.html?w2xPath=/ws/index.xml
 &inPath=/ws/qna/qna_list.xml&searchType=title&searchText=&curPage=1

<< 작성자 정보 >>
진행(투입) 프로젝트 : ( 필수 )
신한은행 일본 신단말 구축 Prj
<< 개요 >> 
로컬 서버 테스트
=============================================================================================================

2. eclipse > Help > 웹스퀘어 라이선스 등록 > 라이선스 키(license) ==> 안 보임
2022년 11월 30일 만료 WebSquare Platform, Hybrid, Push 통합 라이선스 (cpu = 64)  
aZCPqVVNQM0g9VVBBPktHUEw4Szg/T0M=
lkR6eatHNe7FhkdfiVphQvmXXSfLrAuhoTnEFy3T8R+Aq1N8wfxQK9Mx1gcHLccVoBHYRtI
zugBJZOTC3yhKF0XUK0JDxRrnszmi04=
--------------------------------------------------------------------------------------------------------

3. Loading License. PATH: D:\91_Git_TAMA\WRM\websquare_home\license\license파일에 복사, 붙여넣기
C:\WEBSQUARE_DEV_PACK\workspace\websquare_home\license파일에 복사, 붙여넣기
aZCPqVVNQM0g9VVBBPktHUEw4Szg/T0M=
lkR6eatHNe7FhkdfiVphQvmXXSfLrAuhoTnEFy3T8R+Aq1N8wfxQK9Mx1gcHLccVoBHYRtI
zugBJZOTC3yhKF0XUK0JDxRrnszmi04=
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.20(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.21(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:40 ==> 

- 주말
06:00 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:30 귀가 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> IRP 분석
17:50 집출발(자전거): 실수로 밥을 늦게 함
18:10 다이소 난곡사거리점 방문 ==> 휴대용 휴대폰거치대 미니 선풍기(H22, 5천원), 칸막이정리함(낮은형, 천원): 화장실 선반용 
		, 엔틱 접이식 꼬리 빗(2개, 천원), 칸막이 정리함(낮은형): 화장실 선반용(천원), BH 심플 디자인 디저트 스푼(천원) 구입 
18:30 귀가
18:40 석식
18:55 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
20:10 귀가
20:50 집출발(자전거)
21:00 다이소 난곡사거리점 방문 ==> 리빙 직사각  바구니 2호(화이트, 2개 교환): BH 심플 디자인 디저트 스푼(5개, 5천원, 포항집, 수종)
		구입
21:20 이마트24 신림 우정점 방문 ==> 유동) 번데기 130g(2,200원) 구입, 남성 중목 마블 네이비(2컬레, 2천원), 스타워즈 블랙(3컬레): 
		헌혈 후 받은 편의점 모바일 쿠폰(만원) 사용
21:30 귀가
21:40 인터넷 서핑
23:00 취침
============================================================================================================== 
  
- 인슐린 저항성이란 무엇이며 왜 생기는가?[기역]
https://youtu.be/2t1U9bo_zJ8

- 당뇨, 혈당조절이 잘 안되는 7가지 이유[기역]
https://youtu.be/Zw4SpsDHXK0
 
(A/S 일반용) 당뇨의 원인과 유형[AS] 
https://youtu.be/Lx8Nou747Fs
============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2022.05.22(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
05:40 기상(주말 기상 시간 변경)
06:00 조식
06:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
07:50 귀가
09:30 오이(20개) 무침 ==> 양파, 당근 넣음(큰 통으로 1통 반: 소금에 절였는데도 물이 나옴)
11:40 종료
12:00 중식
12:30 실내 도보 ==> 주식의 정석 100강 시청 종료(14번 시청 완료),
13:55 종료
14:00 인터넷 서핑 ==> 즐겨찾기(북마크, 브레이브 브라우저) 수정
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 66.8kg ==> BMI: 23.11[표준 체중])
21:30 인터넷 서핑
23:00 취침
==============================================================================================================
 
- 오이 무침 물기 제거 방법
1. 구멍 소쿠리에 절여진 오이 담아서 20분이나 25분 그냥 두면 물기가 저절로 빠짐,
2. 오이 양념해둔 것 버무리기전에 고추가루 조금 전체 오이 살짝 한번 버무러 두면 고춧가루가 물기 많이 잡아주고 색깔도 곱다
==============================================================================================================
 
 -  { 느타리 어묵무침 } 어묵은 제발 더 이상 볶지 마세요. 이 방법이 최고입니다. 누구나 엄지척!! 👍 [강쉪]
 https://youtu.be/bfzNWHfDqKw
 ==============================================================================================================
 
- 어묵에 뜨거운 물을 부어보세요! 놀라운 일이 벌어집니다! [이 남자의 cook]
https://youtu.be/kWdFSrSYlQY
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.23(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 배상범 만남(18:30, 목표수산[신림역]): 2차 호프집(22시) ==> 택시

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 배상범 만남
18:30 목포 수산(신원시장): 방문 ==> 광어회, 오징어 부추전, 매운탕, 해삼, 멍게(총: 70,000원: 내가 쏨)
22:00 호프집(46,000원: 내가 쏨)
01:00 택시
01:30 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.24(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 주식의 정석 1강 시청(14번 시청 시작), 케어센스N 혈당지 구입(20시, 카톡)

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

- 배상범 배신
1. 신한은행 Prj 개발 역할 PL에게 소개 ==> 업체 사장이 750만원에 계약하기로 합의함 ==> 저녁에 배상범에게 전화와서 못하겠다고 함
(엄청 열받음: 다시 만나지 말 것)
==============================================================================================================

- 화면 캡처
0. 저는 이렇게 빠르게 화면캡처 합니다. [누나IT]
https://youtu.be/DncqKYIwXfo
1. 윈도우키 + Shift + S
2. 전체화면 캡쳐 : Print Screen 키 
3. 활성화된 창만 캡쳐 : Alt + Print Screen 키
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.25(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==>  

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 케어센스N 혈당지 구입(10시, 회사)
1. 카톡으로 주문 ==> 케어센스N 혈당지 구입[쌍봉 종합의료기] (1개당 200원에 10(통)): 100,000원 
==============================================================================================================
 
- [로지텍 코리아]로지텍 MK240 NANO 무선 콤보[블랙,화이트][키스킨 포함], 블랙, 가격: 24,900원
http://www.11st.co.kr/products/1187813726/share
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.26(목) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 

- 신한은행 Prj[★] 
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- USB 마우스 구입
1. [쿠팡] 로지텍무소음 M331 무선마우스 정품 2종색깔이 무료배달, 색깔: 그레이, 해외 직구, 가격: 15,000원
 1) AA 배터리 하나로 약 24개월 사용 가능(On/Off 스위치와 스마트 슬립모드로 전원 절약)
https://www.coupang.com/vp/products/6465861299
http://www.enuri.com/detail.jsp?modelno=14732968
https://www.11st.co.kr/products/1598154544
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.05.27(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.28(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 19:40 ==> 

- 주말
05:40 기상
06:00 조식
06:25 집출발
06:30 구립 신사 경로당 도착 ==> 2022 지방선거 사전 투표(서울시간 후보 1번 송영길 후보 찍음)
06:35 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
07:45 귀가 
08:45 종료
09:20 소금창고(남구로 시장 내) 방문 ==> 기능성 정장 바지(Sank mae(코오롱 패션), 32, M, 검정색 43,000원), 기능성 바지(AMERICAN 
		ACTIVE, M, 곤색, 검정색, 31,600원), 기능성 반팔 티(Campground, XL, 회색, 2만원), 여름 잠바(MARZO, 100, 파란색, 19,000원) 구입
		==> 나이스 양말 1컬레 서비스로 받음
09:40 자연을 사랑하는 형제들(남구로 시장 내) 방문 ==> 오이(2천원: 5개[8봉지, 총 만 6천원]): 20개, 양파(2 봉지, 2천원), 
		마늘(2봉지, 5천원), 당근(2봉지, 3천원), 느타리 버섯(한 봉지, 2천원) 구입
10:10 귀가
10:20 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 ==> IRP 분석
17:50 집출발(자전거)
18:30 귀가
18:40 석식
18:55 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
20:10 귀가 
21:30 귀가
21:40 인터넷 서핑
23:00 취침
============================================================================================================== 
 
 - 셀트리온[068270].[ 셀트리온그룹주 반등 시나리오!![여의도 영웅]
 https://youtu.be/i6ayhMnfuoE
 ============================================================================================================== 
 
■■■■■■■■■■■■■■■■■■ 2022.05.29(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
05:40 기상
06:00 조식
06:30 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 승리교 => 도림 도보교 => 집)
07:50 귀가
08:40 오이(30개) 무침 ==> 양파, 당근 넣음(오이 뜨거운 물에 안 넣고 그냥 버무림)
10:50 느타리 어묵 무침(어믁 2kg) 무침: 느타리 버섯 넣음(어믁, 느타리 버섯 뜨거운 물에 넣고 찬물에 식힌 후 버무림)
11:40 종료
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑 
18:00 석식
18:20 도보(집 => 도림 도보교 => 신림3교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:30 귀가
20:50 청소(청소기, 밀대)
21:20 샤워(찬물: 체중: 66.8kg ==> BMI: 23.11[표준 체중])
21:30 인터넷 서핑
22:30 취침
==============================================================================================================

- 할부 6년 계약한 29살 기사님 24시간 따라다녀봤습니다(로망 사라집니다) [갈때까지간 남자-]
https://youtu.be/_hCmNS2vzpE 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.30(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 ==> 회사에서 AA 밧데리(10개) 가지고 와서 현관문에 도어락에 설치

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
 
- 2021년 귀속 종합소득세 신고 결과 메일로 통보 받음
1. 받을 세금(국세: 1 854 000원, 주민세: 185 400원): 총합: 2,039,400원
 1) 국세: 6월말 지급 예정
 2) 지방세(주민세): 7월말쯤 지급 예정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.05.31(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 00:20 ==> 가계부 월말 결산(22시, 집) 

- 신한은행 Prj[★]
- 신한은행 일본 신단말 Prj 분석
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 