

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2022.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 

■■■■■■■■■■■■■■■■■■ 2022.09.01(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 자체 휴가3[★] 
06:45 기상
06:50 조식
07:10 실내 도보
08:50 종료
09:06 카톡으로 한국 U2W 박준영 부장에게 일자리 요청 ==> 없다고 함
09:20 인터넷 서핑: Memo 작업
12:00 중식
12:30 실내 도보
13:40 종료
13:50 인터넷 서핑: Memo 작업
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:45 귀가
19:50 잉크젯 프린터(삼성전자 SL-J1660 [무한잉크(외장,~500ml)]) 버리기(고장남)
20:40 가계부 월말 결산(집)
21:05 인터넷 서핑
22:50 취침
==============================================================================================================
 
- Memo 작업
1. Memo(2010.01).sql ~ Memo(2007.12).sql 작업
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.02(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 자체 휴가4[★] 
06:37 기상
06:40 조식
07:10 실내 도보
08:50 종료
09:00 인터넷 서핑: Memo 작업
10:47 예술과 기술 김승현 전무에게 전화 옴 ==>효성TNS PMS (과제관리) 구축 Prj 면접 제안
11:30 중식
12:00 집출발
12:10 신림역 --> 교대역 --> 수서역(3번 출구)
13:10 효성TNS 본사(서울 강남구 광평로 281) 도착(5층)
13:15 면접: (주)애니 파이브 김빌리 책임(010-6284-1258)
		1. 9월 5일(월)부터 근무하기로 함, 2. 9월 13일(화) 휴무 허락받음
		3. 어렵지 않은 JAVA, JSP 업무, 4. 개발자 3명 리딩(PL 역할은 아님): 위에 공통, PL 존재(71년생)
		5. 간트 차트
13:30 종료
13:40 수서역 --> 종로3가역
13:50 한국 U2W 이호준 이사님와 통화 ==> 시청역에서 조달청 차세대업무 Prj 제안(년 단위 계약): 이미 투입 결정되었다고 거부함
14:40 백승현 차장 만남(KB카드 Prj)
		1. 백차장 9월 8일(목)까지 근무하고 철수하기를 희망함, 2. 이찬호 부장 지인(서버 개발자) 투입 하루 만에 철수 했다고 함
16:00 종료 
16:30 면접: HIS보험중개 Prj: 이현진 차장 010-4061-6383
		1. 마이플랫폼 --> Nexacro 전환 작업, 보험 지식도 상당히 있어야 함: 일이 힘들 것 같다는 느낌이 듬
16:50 종료	
17:04 을지로입구역 정류장(504번 버스 탑승)	 
18:16 귀가
18:20 석식
18:30 PC 나일도 이사에게 전화 옴==> HIS 보험중개 보험중개시스템Prj은 힘들 것 같아서 취소 요청(다음에 다시 일 하기로 함)
18:35 실내 도보
20:40 종료	
20:35 인터넷 서핑: Memo 작업
22:50 취침
==============================================================================================================

-업 무 : 효성 TNS PMS(Project Management Systems: 과제관리) 구축 Prj
-장 소 : 구로디지털단지역 대륭1차
-기 간 : ASAP ~ 1월
-요 건 : JAVA,   
-인 원 : 분석/설계/개발 중고급  2명 ==> 단가: 830
==============================================================================================================

- Memo 작업
1. Memo(2006.01).sql ~ Memo(2005.12).sql 작업
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.03(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
07:31 기상
07:40 조식
08:10 실내 도보
09:20 종료
09:40 인터넷 서핑: Memo 작업
12:00 중식
12:30 실내 도보
13:40 종료
13:50 인터넷 서핑: Memo 작업
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:45 집출발(자전거)
19:50 다이소 낙곡사거리점: 손크림 없음 
20:00 진흥마트 방문: 동원-추억 부산사랑 어묵 1kg(6개[개당: 3,650원], 21,900원) 구입 
20:15 귀가
20:45 인터넷 서핑: Memo 작업 ==> 완료[♥♡]
22:50 취침
==============================================================================================================
 
- Memo 작업 ==> 완료[♥♡]
1. Memo(2004.01).sql ~ Memo(2003.03).sql 작업
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.04(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:06 기상
06:40 조식
07:00 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:45 귀가
09:30 어묵 무침(어묵 6kg) 무침: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림
10:10 종료
10:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
17:40 귀가
18:00 석식
18:30 실내 도보(비옴)
19:45 종료 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 66.6kg ==> BMI: 22.73[표준 체중]) 
21:05 인터넷 서핑
22:00 종료
22:30 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.09.05(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 효성 PMS 구축 Prj[★]
04:34 기상
04:40 조식
05:00 실내 도보
05:50 종료
06:05 집출발(비 옴: 태풍 힌남로 영향 --> 백팩[노트북])
06:20 신림역 --> 교대역 --> 수서역(3번 출구)
07:10 효성TNS 본사(서울 강남구 광평로 281) 도착
07:15 효성TNS 본사 앞에서 앉아서 기다림
09:10 출근(김빌리 책임한테 전화해서 5층 2회의실에 들어감)
09:30 효성TNS 현업과 인사(이상영 팀장, 하지연 부장, 박상규 차장,(교육 중), 길병수 과장)
09:30 윤성훈 차장 도착(73년생, 광명)
09:40 빽다방 수서역점 방문 ==> 아이스 아메리카노(4천원: 윤성훈 차장 --> 내가 쏨)
11:30 중식(짬뽕, 탕수육, 효성TNS 현업, 김빌리 책임, 윤성훈 차장--> 이상영 팀장,이 쏨)
11:50 도보(수서역 지하철 역사[SRT])
12:55 종료
13:00 효성TNS 빌딩 출입증 신청(길병수 과장)
13:10 효성TNS 9층으로 이동 ==> 길병수 과장에게 노트북 포맷 요청(윤성훈 차장 노트북 포함)
13:10 효성TNS 출발(김빌리 책임 차 얻어 탐[비 많이 옴])
14:18 애니파이브 본사 도착(대륭포스트타워1차 1차 1603호 (주)애니파이브 )
14:20 박순철 부장(개발 PL) 만남
14:22 프로세스 설계서 설명: 김빌리 책임
		1. 간트 챠트, 2 IB SHEET : Grid
16:00 신규 애니파이브 프레이워크에서 메뉴 조회 안됨 ==> 박순철 부장이 오라클 DB에 대한 이해 부족으로 DB Table 깨긴 것을
          확인 못해서 일어난 일로 추정됨: 해결됨
17:20 퇴근(비 많이 옴)
17:55 귀가
18:00 석식
18:30 실내 도보
19:45 종료
21:05 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 기본예 제 보기(Basic Examples) - IB Sheet
https://www.ibsheet.com/ibsheet.html
==============================================================================================================

- 간트 차트 개론: 완벽 가이드 • Asana
https://asana.com/ko/resources/gantt-chart-basics
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.09.06(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 태풍 힌남로 7시 포항으로 빠져나감(비 피해)	--> 서울 오전에 비 약간 옴(우산): 포항집 비 약간 들어옴(피해 미미)
								, 중식(보쌈 정식: 9천원, 더치), 9층에서 포맷된 노트북 가져옴(10시), 461번 버스타고 출근

- 효성 PMS 구축 Prj[★]
- 설계 문서 분석
1. PROJ-DE-110-프로세스명세서(발주관리)-v1.0-20220825.pptx
==============================================================================================================

- HOPE(효성 이메일)
1. 진태만: hope.hyosung.com, bp0063912/as**1212!!
2. 김빌리 책임: hope.hyosung.com, bp0063912/Anyfive!2
==============================================================================================================

- 커피(13:20)
1. 빽다방 수서역점 방문 ==> 아아(윤성훈 차장이 쏨)
==============================================================================================================
 
- 면접(13:20)
1. 윤성훈 차장 지인(박우현 차장[중급에 지원] 월 30만원이 안 맞아서 투입 포기함)
==> 개발자 총 5명(4.5M)
==============================================================================================================
  
- 석식(16:50)
1. 18층 커피샵(김빌리 책임, 윤성훈 차장: 이상영 팀장 복지 카드로 샌드위치 시식) ==> 이상영 팀장이 인정함
==============================================================================================================
 
- SW 설치(@효성TNS_서버접근제어_사용자 매뉴얼.pdf)
1. 사용자 클라이언트 설치
- 02. HIWARE
https://tnssac.hyosung.com, bp0063912/bp0063912 --> as**1212!!
2.사용자OTP설치
==============================================================================================================

- HiCloud 권한변경신청 처리
1. 사원 정보 
 진태만  IT서비스실 협력사  부장 bp0063912 

2. 셋팅 및 권한 신청 기간(최소 2일 소요)
   - 당일 사번이 나오면 익일 새벽에 관련 시스템(메신저, NetClient, HiCloud 등)으로 인사정보가  I/F됨
   - 1일차 : 사번신청, 출입증신청, PC 포멧, 기본 프로그램 설치
   - 2일차 : NetClient 사번연동, HIWARE, SVN, VPN, SVN, HiCloud 권한신청(주 효성 보안담당자 협의가 필요) 
 
3. 고정 IP 정보
1) 윤성훈 부장 : IP : 150.73.5.16
2) 진태만 부장 : IP : 150.73.5.17
3) 기타 정보
   - 서브넷 마스크 : 255.255.255.0
- 기본 게이트웨이 : 150.73.5.254
- 기본 DNS : 150.15.101.1
- 보조 DNS : 150.15.101.2
 
4. HIWARE 권한
- 사용자 계정 신청 완료 되었습니다. 
- 이후 서버 접근 신청은 개발자분들이 진행하셔야 합니다. 김책임님 가이드 부탁드립니다.
 
5.  SVN 권한
- 윤성훈 부장 : bp0063913/dbstjdgns12#$
- 진태만 부장 : bp0063912/wlsxoaks12#$
 
6. HiCloud 권한
이름 조직 직위 사번 
 진태만  IT서비스실 협력사  부장  bp0063912
 윤성훈  IT서비스실 협력사  부장  bp0063913
  
신청항목 신청기간 신청사유 
도면드라이브(T:)사용 신청기간 없음(승인시 영구 적용) BASE2 고도화 개발 프로젝트 진행을 위함입니다. 
추가드라이브(X:)사용 신청기간 없음(승인시 영구 적용) BASE2 고도화 개발 프로젝트 진행을 위함입니다.  
==============================================================================================================
  
- 마이크로소프트 비번 변경(예정)
1. https://login.live.com --> tamario@naver.com / 22tadhtlqenf@   --> 2020dhtlqh@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.07(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 중식(11:40, 잠치 김밥[이상영 팀장 카드], 박순철 부장, 윤성훈 차장), 효성 PMS Prj 회식(18시, 투뿔상회 식당
								 이상영 팀장, 임팀장, 길과장, 김책임, 박부장, 윤차장)

- 효성 PMS 구축 Prj[★]
- 설계 문서 분석
1. 2. PROJ-DE-120-화면정의서(프로젝트관리(계획.실적))-v0.80-202200831.pptx
 1) 프로젝트 WBS 계획을 입력하는 화면(P. 13)
  가. WBS 템플릿 작성(간트 차트 사용): 추가 요구 사항 분석
 2) 프로젝트 게이트와 마일스톤을 모니터링 하기 위한 화면P. 21)
 가. Gate, Milestone( IB Sheet 사용): 추가 요구 사항 분석
==============================================================================================================

- 커피(07:20)
1. 18층 커피샵(박순철 부장: 이상영 팀장 복지 카드로 우유 시식)
==============================================================================================================

- 면담(09:40)
1. 18층 커피샵(박순철 부장, 윤선훈 차장 ==> 박부장 역할에 대한 논의)
==============================================================================================================
 
- 개발자 회의(16시)
1. 김빌리 책임이 다국어 개발을 해야 한다고 해서 윤성훈 차장 제동을 걸고 따짐: 내가 개발 가능하다고 했다고 따짐
 1) 윤성훈 차장이 해보지도 않고 애니프레임, 기타 API에 대해서 가이드를 달라고 해서 김빌리 책임이 짜증을 냄
==============================================================================================================

- 윈도우10 에서 파일 설치 중 액세스 및 권한 오류 발생 시 해결 방법
https://iboxcomein.com/how-to-fix-access-and-permission-errors-during-windows-10-file-installation/
==============================================================================================================
 
- 용어 정리
1. QCD: 품질(Quality), 비용(Cost), 납기(Delivery)를 뜻하는 초일류회사의 품질지표
2. WBS(Work Breakdown Structure) : 업무 분업 구조
3. Final DR(Final Draft): 최종 안 
4. 간트 차트: 시간을 기준으로 하여 활동(작업 또는 이벤트)을 표시하는 프로젝트 관리 방법(가로 축에는 날짜, 세로 축에는 프로젝트에서 수행해야 하는 
활동들이 위치하는 형태의 차트). 즉, 프로젝트 스케줄의 시작일/종료일 사이 활동을 의미하는 여러 수평 막대들이 시간 순으로 나열되어 차트를 구성하는 
형태인거죠! 각 막대는 각 활동(작업 및 이벤트)을 의미하며, 막대의 길이는 소요기간을 의미.
작업 종속성, 우선 순위, 소유권 등 모든 단계에서 프로젝트를 시각적으로 표현하여 프로젝트의 범위와 요구 사항을 더 쉽게 이해할 수 있다.
==============================================================================================================

- ASE2 고도화 파일 서버(116번) 접근
1. 파일서버  : \\150.30.5.116\BASE2 고도화 프로젝트
==============================================================================================================
  
- 효성 VPN
https://vpn.hyosung.com/logon/LogonPoint/tmindex.html
==============================================================================================================

- 협업툴 핫이슈 - 아요아 간트차트
https://youtu.be/9pFrkS5NnBA
==============================================================================================================

- DBeaver Community 22.2.0
https://dbeaver.io/download
-------------------------------------------------------------------------------------------------------------------------------

- dbeaver 어두운 테마로 바꾸기 (초간단)
https://toshi15shkim.github.io/articles/2019-09/dvp-dbeaver-theme
-------------------------------------------------------------------------------------------------------------------------------

- DBeaver SQL 실행
0. Ctrl + Enter: SQL문 실행
1. Ctrl + Alt + Shit + X: Execute Statements In Separate Tabs(멀티 SQL문 실행): SQL문 실행 결과가 Result 탭으로 여러개 생성됨
2. Ctrl + Alt + Shit + C: 로우 건수 조회
3. Ctrl + Alt + Shit + A: 전체 결과 조회
==============================================================================================================
 
- 01. 효성VPN
https://vpn.hyosung.com/logon/LogonPoint/tmindex.html
\\150.30.5.116\BASE2 고도화 프로젝트
==============================================================================================================
    
- 개발서버 (오라클): http://tnspmsdev.hyosung.com/?login=1
- 로컬서버: http://localhost:8080/HyosungTNS_E-Brain/?login=1

- 데모 서버(MS-SQL): http://150.73.5.211:8080/Anyfive_E-Brain/viewLogin.do?login=1
==============================================================================================================

- 효성 PMS 구축 Pr 회식
1. 이상영 팀장(70년생), 하지연 부장, 박상규 차장, 길병수 과장, 김빌리 책임(PM, 70년생), 박순철 부장, 윤성훈 차장 
==> 개발자 술 못 마셔 내가 맥주 많이 먹음
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.08(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:50 ~ 16:00 ==> 애니파이브 본사 출근(08:50, 자전거, 백팩[노트북 지참]), 출입문 지문 등록, 노트북에 엑토 노트북 도난방지 처리(15시)
								, 퇴근(16:00, 추석 전이라 일찍 퇴근하라고 함)

- 효성 PMS 구축 Prj[★]
- 로컬서버: http://localhost:8080/HyosungTNS_E-Brain/?login=1, 김아름(201202839), 권한코드: ROLE_RCUSER(연구원)
, 지정그룹명:열경화성/수소탱크(2020120901)
==============================================================================================================

- IB Sheet 분석
1. IBSheetHTML개발자가이드_V7.0.pdf
------------------------------------------------------------------------------------------------------------------

- IB Sheet 7 샘플
/HyosungTNS_E-Brain/src/main/webapp/common/ibsheet/sheet/index.jsp
==============================================================================================================

- 커뮤니티 > 연구소자료실 화면
/HyosungTNS_E-Brain/src/main/webapp/WEB-INF/views/common/bbsctt/BbsContentsListR.form.jsp, BbsContentsListR.script.form.jsp
==============================================================================================================
 
- JSTL을 이용해서 Javascript로 값 전달하는 방법
https://zuyo.tistory.com/347
==============================================================================================================

- (주)애니파이브 본사  IP 정보
1. IP : 192.168.1.165
2. 서브넷 마스크 : 255.255.255.0
3. 기본 게이트웨이 : 192.168.1.1
4. 기본 DNS : 168.126.63.1
 ==============================================================================================================

- eclipse 에러
1. 현상:
 java.sql.SQLRecoverableException: IO 오류: The Network Adapter could not establish the connection
	at oracle.jdbc.driver.T4CConnection.logon(T4CConnection.java:489)
	at oracle.jdbc.driver.PhysicalConnection.<init>(PhysicalConnection.java:553)
 
 2. 조치: /data/datasource.yaml 
  # 효성 개발서버 ==> 주석 처리 @@@
#datasource:
#  main-oracle:
#    driver-class-name: oracle.jdbc.OracleDriver
#    url: "jdbc:oracle:thin:@//150.15.214.80:1592/TNSMLDEV"
#    username: "tnspms"
#    password: "tnspms9876$"
-------------------------------------------------------------------------------------------------------------------------

#  애니파이브 개발서버 ==> Real ■■■
datasource:
  main-oracle:
    driver-class-name: oracle.jdbc.OracleDriver
    url: "jdbc:oracle:thin:@//192.168.1.5:1521/orcl"
    username: "ANYFIVE_E_BRAIN_NEW"
    password: "ANYFIVE_E_BRAIN"
==============================================================================================================

- DBeaver 오라클 연결
0. https://codedragon.tistory.com/6083
1. Settings
 1) Driver Name: Oracle											2) Driver Type: Generic
 3) Class Name: com.tmax.tibero.jdbc.TbDriver 
 4) URL Template: jdbc:tibero:thin:@{host}[:{port}]:{database}
 5) Driver Name: 8629
6) Libaries: D:\01. TAMA_DATA\51. TAMA SW\개발 환경\3.Tibero클라이언트설치\tibero6-jdbc.jar
==============================================================================================================

- KB국민카드 서버 개발자 만남[★]
16:00 퇴근(자전거)
16:20 귀가
15:30 인터넷 서핑
17:10 집출발(반바지, 슬리퍼) 
17:50 신원시장 구경
17:55 목포수산 도착
17:55 노기수 과장 도착
18:10 백승현 차장 도착 ==> 오늘 KB국민카드 Prj 철수 완료
18:14 물회 시식(맥주)
21:00 종료(1차 술값: 노기수 과장이 쏨)
21:20 하노이맥주밤거리 신림점 도착 ==> 생맥, 꼬치(노과장, 백차장과 말놓고 편하기 지내기로 함), 다음주 주말 축구하기로 함 
23:50 종료(1차 술값: 백승현 차장이 쏨)
24:20 귀가 ==> 노과장 우리집에 가지고 했다가 도중에 택시타고 집에 감 
24:30 취침
==================================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.09.09(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 

- 추석 연휴[★]
05:30 기상
05:40조식
06:10 집출발
06:13 남서울중학교 정류장 도착
06:18 6411번 버스 승차
06:48 고속버스터미널 하차
07:20 포항행 고속버스 승차
09;50 옥산 휴게소(차 엄창 막힘)
14:10 포항 고속버스 터미널 도착(7시간 걸림)
14:13 고속버스 터미널 정류장(209번 버스 승차)
14:28 두호동 주민센터 하차
14:34 포항집 도착
14:50 중식
15:10 실내도보
15:30 종료
16:00 TV 시청
17:00 집출발(비 조금 옴): 포항계 회비 6만원 송금(22년 07월 ~ 12월)
17:10 홍승표 집 도착 (승표 만남)
17:15 홍승표 집 출발(승표 차[ 1톤 4륜 구동 트럭 시승]) ==> 이마트 포항집 근처 태풍 '힌남로'로 인해서 피해를 만이 봄
17:40 (주)하누(포항시 남구: 2층) 도착 
17:50 석식(소고기: 맛있음): 봉춘이 차가 태풍에 침수되어 불참, 태정이 와이프 대구행으로 불참
18:25 정철이 도착
18:30 주남이형(벌초하고 옴) 도착  
19:45 종료 ==> 식대 2만원 송금
19:55 주 커피 도착 ==> 딸기 스무디(주남이형이 쏨: 현대 힐스테이트 분양(6억) 받았다고 쏨
20:40 종료
20:45 승표 차
21:20 귀가 
21:25 도보(영일대해수욕장) 
22:00 귀가
23:00 샤워(수종) 
23:30 취침
==================================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022. 09.10(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>

- 추석[★]
07:46 기상
07:50 차례 준비
08:20 차례 지내기: 수종이와 같이
08:50 종료
09:00 조식
09:39 실내 도보
10:50 종료 
10:00 TV 시청
12:00 중식 
12:40 실내 도보
13:30 종료 
14:00 TV 시청
16:40 인터넷 서핑(델 노트북 사용)
18:15 석식
18:30 도보: 영일대 해수욕장 --> 등대 --> 등대2 --> 귀가
19:40 종료
20:10 큰누나네 도착 ==> 태풍 '힌남로'로 미용실 피해 봄(에어컨, 세탁기(버림), 쇼파, 미용 기구 고장 -> 미용실 안쪽방 3 깔기 요청)
20:40 TV 시청
23:20 취침(바퀴벌레 잡기)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.09.11(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>

- 추석 연휴2[★]
07:05 기상
07:25 조식 
07:40 도보: 영일대 해수욕장 --> 등대 --> 등대2 --> 귀가
09:00 종료
09:20 인터넷 서핑
12:00 중식 
12:50 집출발(도보: 수종, 큰누나, 매형)
13:40 누나 가게(꾀꼬리 미용실) 도착
13:50 창고에 앵글(선반) 제작 크기 계산 ==> W345 * D75 * H210mm
13:44 창고에 장판 크기 계산 ==> W384 * D75 * H270mm(2개)
		==> W(Width) * D(Depth) * H(Heght)
14:00 창고 출입문 수해로 인해 문틀 형태가 틀어짐
14:20 수해입은 창고 평상, 장판 걷어내고 청소함
14:46 종료
15:21 다이소 포항 우현점 방문 ==> 주방용 알루미늄 시트(40X90, 2천원), 페인트붓(100 mm)4인치(2천원), 스텐스 크래퍼50(천원)
		, 스텐스 크래퍼100(2천원), 다용도 매직 접착제(천원), 초강력 아크릴 폼 양면 테이프(18 mm*2 m, 2천원), 헬로 베어 알카라인 건전지 
		LR03(AAA) 4개입(천원), 신규 소비자 봉투(대, 천원) 구입		
15:41 다이소 포항 두호점 방문 ==> 노루 벽면용 페인트 0.9L 화이트(5천원) 구입 
17:30 귀가
18:00 석식
18:20 도보: 영일대 해수욕장 --> 등대 --> 등대2 --> 귀가
19:50 종료
20:00 령경이 경주집으로 감(용돈 안줌)
20:40 집출발(큰누나 차: 큰누나, 매형)
20:58 다이소 포항 우현점 방문 ==> 멍키 스패너(8인치), 5천원), BH 와이드 우드 핸들 채반(9.5 cm, 천원), 스텐레스 청소솔(천원)
		, 자동 씽크대 망(新, 천원) 구입
21:10 큰누나 가게(꾀꼬리 미용실) 도착
21:20 창고 출입문 수리: 아랫문 쇠고리 넓히기(사용할 정도로 고침: 큰누나 만족함)
21:30 종료
21:53 다이소 포항 우현점 방문 ==> 바퀴 하우스 6P(6천원: 반품할 것), 페리오 뉴후레쉬 알파치약 (190g, 천원) 구입 
22:00 귀가
23:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2021.09.12(월) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==>

- 추석 연휴2[★]
06:34 기상
06:40 조식
07:10 도보: 영일대 해수욕장 --> 등대 --> 귀가
09:00 종료
09:24 집출발(큰누나 차: 큰누나, 매형) 
09:50 큰누나 가게(꾀꼬리 미용실) 도착
10:00 물청소(세제를 풀어서 물청소함) ==> 주민센터에서 태풍 피해 물품(구호 키트) 나누어줌
10:30 종료 
10:40 큰누나 가게 출발(큰누나 차: 큰누나, 매형) 
10:50 현대 앵글 상사 ==> 휴업
11:30 죽도시장(어시장) ==> 방어, 전어, 고등어 구입(큰누나)
12:00 다이소 포항 죽도시장점 방문 ==> 노루 벽면용 페인트 0.9L 화이트(5통, 2만 5천원), 파워 홈 바퀴 트랩소 12P(5통, 만 5천원)
		  TH파스텔페달휴지통(분리형, 5L, 5천원) 구입
12:30 귀가	  
12:50 중식
13:20 실내 도보
14:00 큰누네 귀가
14:50 종료 
15:00 인터넷 서핑 ==> 수종이 MSI 노트북 셋팅해서 사용(수종이 노트북 사용 안함)
18:00 석식
19:20 도보: 영일대 해수욕장 --> 등대 --> 등대2 --> 귀가
20:40 종료
23:00 취침
==============================================================================================================
  
- 마우스 커서 색, 크기 바꾸기 
1. 컴퓨터나 노트북에서 설정이라고 검색하셔서 설정(단축키: Win + i)에 진입
 1) Blutooth 및 장치 ==> 마우스: 클릭 ==> 마우스(새창)
  가. 관련 설정 ==> 마우스 포인트 ==> 마우스 포인트 및 터치(새창)
   가) 맞춤색: 진한 녹색(선택)
   나) 크기: 2 
   - 마우스 커서 바꾸기 변경 및 포인터 모음 다운받아서 이뿌게 쓰기
https://blog.naver.com/the-woman/222377043596
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2021.09.13(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:30 ~ 18:00 ==> 휴가 냄

- 추석 연휴3[★]
06:00 기상
06:23 조식
06:38 도보: 영일대 해수욕장 --> 등대 --> 등대2 --> 귀가
08:00 종료
08:26 수종이 등교
09:00 인터넷 서핑(수종이 MSI 노트북)
12:00 중식
12:25 도보: 우현동
13:00 다이소 포항 우현점 방문 ==> 바퀴 하우스 6P(6천원): 반품 요청 --> 반품이 안된다고 10분 이상 기다리게 해서 점장에게 화냄
		9월 11일(일)에 2번 구입을하고 2번 반품을 하려고 하니 에러가 나서 반품 처리가 안됨: 2번째 물품은 카카오페이에서 반품 바코드를
		찍어야 결제가 가능
13:40 귀가
13:45 전체 반품하고 천원 결제해야 하는데 5천원 결제가 되어 있어서 전화해서 화냄 ==> 4천원 송금 받음
14:00 집출발(도보: 수종)
14:34 롯데백화점 포항점 도착 ==> MLB 매장(4층): MLB 야구모자(LA 다저스,  3만 6천원: 수종 생일 선물)
14:55 포항 중앙서점(포항여고 앞) 도착 =스카치 테이프(2천원, 큰누나 가게)
15:35 누나 가게(꾀꼬리 미용실) 도착 ==> 이발(수종, 손님, 나)
		무선 전화기 설치, 시계 걸기, 에어컨 정상 가동 여부 확인, 달력에 스카치 테이프 붙이기
16:50 종료
16:55 미용실 출발(도보: 수종)
16:40 현대 앵글 상사 ==> 선반 1개 15만원, 알루미늄 선반 1개 16만원(큰누나 마음에 들어함)
17:15 귀가
17:20 석식
17:50 포항집 바퀴벌레 퇴치기 설치(큰누나) -->< 파워 홈 바퀴 트랩소 12P(5통, 만 5천원), 바퀴 하우스 2P 사용
18:10 집출발(반찬 4통, 삼겹살 2팩): 백팩 약간 무거움
18:55 포항 고속버스터미널 도착
19:10 포항 출발
23:05 서울 강남터미널 도착
23:17 고속 터미널 정류장(643번 버스 탑승)
23:50 남부초 정류장 하차
23:58 귀가
24:20 청소
24:40 염색
02:00 취침
==================================================================================================================

- 집큰누나 가게 창고 앵글(선반) 작업
1. 현대 앵글 상사(남빈동)
==============================================================================================================

- [아라상사] 볼트식 중량앵글 / 620조립식앵글 조립하는 방법 / 조립식가구
https://youtu.be/nSopeWx7azM

- 아라상사
http://www.aracorp.kr
==============================================================================================================

- 저렴하게 직접 앵글 수납장을 만들어 봤습니다! 근데 쉽지 않네요...[앵글 선반][앵글 DIY][조립식 앵글]
https://youtu.be/QuFOfxBUrK0
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.14(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> (주)애니파이브 본사 출근(07:10, 자전거로 모니터 가지고 감)

- 효성 PMS Prj[★]
- 효성 PMS Prj 애니 프레임, IB Sheet 분석 
1. WBS 템플릿 관리(/ProjectWbsTemplateMgtListR.form.jsp) 화면 수정
==> 이클립스 소스 삭제(/HyosungTNS_E-Brain/src/main/webapp/WEB-INF 하위 폴더 삭제됨)
==============================================================================================================

- IB Sheet 분석
IBSheetHTML개발자가이드_V7.0.pdf
------------------------------------------------------------------------------------------------------------------

- IB Sheet 7 샘플
/HyosungTNS_E-Brain/src/main/webapp/common/ibsheet/sheet/index.jsp
==============================================================================================================
 
- 애니파이브 표준프레임워크 소개, 교육 자료 받음
1. (주)애니파이브 편영수 상무(영업) ==> USB로 받음
==============================================================================================================

- 케어센스N 혈당 시험지 
https://m.smartstore.naver.com/taery12/products/5666303285?
1. 상품 가격: 21,100원  ==> 개당 211원(윤성훈 차장 추천: 내가 구입하고 있는 비용(200원) 보다 비쌈)
==============================================================================================================

- 윈도우10 일정앱으로 스케줄 관리하기
https://blog.naver.com/winsweet/220493249246
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.09.15(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> 자리 옮김(09:30, 12층으로 이동), 모니터 셋팅, 이재륭 과장(010-4280-5380), 이현재 대리(010-6471-8718) 투입(10시)
								, 2. 중식(부페, 6,500원): 전체 개발자와 처음으로 식사

- 효성 PMS Prj[★]
1. WBS 템플릿 관리(/ProjectWbsTemplateMgtListR.script.jsp) 화면 수정
<script language="javascript" src="/HyosungTNS_E-Brain/common/ibsheet/sheet/sheet/ibsheetinfo.js"></script>  <!--// 공통함수 js 파일 ■■■ //-->
<script language="javascript" src="/HyosungTNS_E-Brain/common/ibsheet/sheet/sheet/ibsheet.js"></script>   	<!--// IBSheet 엔진 js 파일 ■■■ //-->
==============================================================================================================

- WBS 템플릿 관리(/ProjectWbsTemplateMgtListR.script.jsp) 화면 조회 결과 로그
[@_T] [/ProjectWbsTemplateMgtServiceImpl.java] [readList()] ==> [T_91] [resultHandler.getDataList();]
AnyDataList[RESULT_SET]={
	Meta={_TOTAL_COUNT_=1}
	KeySet=[rowNum, wbsTmplatVerId, tmplatCode, tmplatNm
		, prjctBsnsSe, prjctBsnsSeNm, prjctTy, prjctTyNm, prjctSe, prjctSeNm
		, prjctCharct, prjctCharctNm, tmplatVer, dcsnYn, dcsnYnNm, dcsnPsnNm
		, dcsnDt, useYnNm]
	AnyData[RESULT_SET_0][N]={rowNum=1, wbsTmplatVerId=75SB159IA3E52D0F60, tmplatCode=D-00001, tmplatNm=중장기 로드맵 기본
		, prjctBsnsSe=E, prjctBsnsSeNm=해당없음, prjctTy=null, prjctTyNm=해당없음, prjctSe=null, prjctSeNm=해당없음
		, prjctCharct=null, prjctCharctNm=해당없음, tmplatVer=3, dcsnYn=1, dcsnYnNm=확정, dcsnPsnNm=75IR4B8WYF614D8170
		, dcsnDt=2020-12-07 00:00:00.0, useYnNm=사용}
}
==============================================================================================================

- AnyBuilder소스 백업
1. nyBuilder(22.09.15) ==> 용량: 4.35GB[X:\99. Back_up◀◀\AnyBuilder(22.09.15)]
==============================================================================================================

- 이 앱이 디바이스를 변경할 수 있도록 허용하시겠어요? 안뜨게 하려면(권한 설정)
https://fostjadnpdjqhrrn.tistory.com/84
1. 사용자 계정 컨트롤 설정 ==> 
==============================================================================================================

- MS Slack(슬랙) 설치
https://slack.com/intl/ko-kr/downloads/instructions/windows, tamario@naver.com/as**1212!*
1. Slack의 AnyFive 대륭1 -12
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.09.16금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> 

- 효성 PMS Prj[★]
1. 게시판 관리(/BbsMgtListTest.script.jsp) 화면 수정 
 console.log("[@_T] ■■■ [/BbsMgtListTest.script.jsp] [fnReadList()] ==> [T_02] [게시판 코드]"+ $("#bbsCode").val() +"[게시판 이름]"+ $("#bbsNm").val() ); 
==============================================================================================================

- IBSheet 기술지원 요청
1. 프로젝트명 : 노틸러스효성 통합시스템 Active X Tool 업그레이드
2. 연락처 : 02)2621-2080 ==>( 주) 아이비리더스[서울 구로구 디지털로 242 한화비즈메트로1차, 1501호 (구로동, 한화비즈메트로)
==============================================================================================================

- 사업장(12층 와이파이)
1. Wi-Fi  ID: Anyfive5G, 와이파이 비밀번호: anyfive_pjt
==============================================================================================================

- 개발자 회의(09:40)
1. 애니프레임 문제점 지적
 1) 윤성훈 차장이 proxy를 ajax로 수정해야 한다고 주장 ==> 고민
 2) 애니프레임 문제점 상당히 많음
  가. 대안: AA 개발자 요청, 개발 기간 1 ~  2달 연장
==============================================================================================================
  
- 회의(14시, 회의실): 김빌리 책임
1. 애니프레임 문제점 지적
 1) 윤성훈 차장이 IBSheet 담당자와 연락해서 가이드 요청
2. 개발 담당자 분류
 1) Gant 차트(WBS, 진태만)
 2) 개발 가이드 작성(박순철 부장)
 3) IBSheet(윤성훈 차장)
 4) 개발 시작(이재륭 과장)
 5) 관리자 화면 개발(이현재 대리: 기존 JP GRID 사용)
3. 개발 일정 결정
 1) Prj 개발 일정 22.09.26(월) ~ 23.01.27(금)
 2) 오픈: 23.02.03(수)
4. Prj 계약
 1) 김빌리 책임이 효성TNS와 계약시 박순철 부장, 윤성훈 차장, 내(3명)이 특급으로 계약했다고 주장함
  가. 우리 모두는 이 사실을 전혀 몰랐다고 억울해 함 ==> 내년에 2차 프로젝트때는 (주)애니파이브랑 직접 계약하자고 함
  [올해 Prj 성공하면 내년이 기회]
==============================================================================================================

- 교육(15:20, 회의실): 김빌리 책임
1. 간트 차트(DHTML X 툴 사용: 애니프레임에 이미 적용되어 있음[추가, 수정 작업]) 
2. 수정 내용
 1) 소요일자 추가
 2) 화살표 추가
 3) 3단계(Active): 소요일수(회색 막대)
 4) Gate[네모], Milestone[깃발]: 추가
 5) 휴일 계산(DB 추가 필요)
 6) 조정일수 ==> 임시저장: 클릭 ==> 막대, 데이타 변경 ==> 작성완료[막대 변경시 선후행 표시 변경)
 7) 연계 유형?
 8) 표준 공수: 0.5, 1, 1.5, 2
 9) 스케줄러 돌면서 날짜 체크: 날짜가 지났으면 종료일이 색깔 변경 처리
 10) 실적은 담당자만 등록 가능 
3. DB 처리
 1) 기존 애니프레임에 사용되고 있는 DB(Oracle)에서 Table명, 칼럼명 만 변경(쿼리 기존 것 계속 사용)
4. 참조
 1) DHTMLX ==> https://dhtmlx.com/docs/products/demoApps/
 2) E3PS ==> http://www.e3ps.com/product/product_pms_solution.php
 3) (주) 이쓰리피에스 ==> https://www.youtube.com/channel/UCSxC61wpGBZrrNIf-o2R5zg
==============================================================================================================
 
- 노기수 과장 만남[★]
17:30 퇴근(자전거)
17:48 귀가
18:00 인터넷 서핑
18:45 집출발(반바지, 슬리퍼) 
18:55 포수산 도착
19:10 노기수 과장 도착 
19:14 물회, 전(2개), 매운탕, 소주
22:50 종료
22:20 귀가
24:10 취침
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.17(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
08:23 기상
08:40 조식
09:00 실내 도보
09:00 종료
10:30 집출발(자전거) 
10:35 연세의원(서울 관악구 신원로 23, 신원시장 내) 방문
10:43 당뇨 상담 ==> 건강검진(피 검사, 소변 검사: 39,200원): 혈당치: 176, 혈압: 130(혈압 정상)
10:43 윤약국 방문 ==> 조제(당뇨약: 1주일치: 3,300원)
11:07 다이소 신림점 방문 ==> 인켈 컴퓨터 스피커 5W(2개, 만원), 오릭스 엘레강스 올인원 스킨&로션(410ml, 3천원) 구입
11:40 귀가
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑, 반환점) => 도림 도보교)
20:00 종료 
21:05 인터넷 서핑
22:00 종료
22:30 취침
==============================================================================================================
 
- 하루만 맡겨도 연 3%..파킹통장 경쟁 뜨겁다
https://v.daum.net/v/GqObOC6hHZ
==============================================================================================================

- 중년 내장지방 뱃살 이렇게 해야 싹 다 빠집니다! 1시간 걷기 대신 이 운동을 매일 2분만 하세요.
https://youtu.be/8jY6p2iieZ8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.18(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말2[★] 
07:00 기상
07:30 조식
07:50 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑, 반환점) => 도림 도보교)
09:30 종료
09:00 인터넷 서핑 
12:00 중식
12:20 실내 도보
13:40 종료
14:00 인터넷 서핑 
18:00 석식
18:20 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑, 반환점) => 도림 도보교)
20:00 종료
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 69.2kg ==> BMI: 23.94[표준 체중]) 
21:00 인터넷 서핑
22:50 종료
==============================================================================================================
  
- USB 선풍기 구입 ==> 완료[♥♡]
1. 태성 이앤에스 모노 큐브 TS-8DF45, 4인치 무선 테이블 선풍기(7개 날개), 제품 사이즈: 133 * 113 * 225(mm), 3단 풍속 조절
 , 배터리:리튬이온, 4,500mAh, 접을수 있어서 들고 다니기 좋음, 색상: 화이트, 가격: 18,270원
http://www.tmon.co.kr/deal/10958954910?opt_deal_srl=10960252710
http://www.enuri.com/detail.jsp?modelno=50503205 
-------------------------------------------------------------------------------------------------------------------------------

- USB 선풍기 분석
1. 샤오미 VH 탁상용 무선 선풍기 F6 [해외쇼핑], 3단, 제품 사이즈: 165 * 135 * 285(mm), 3단 풍속 조절
	, 배터리:리튬이온, 4,500mAh, 색상: 화이트, 가격: 14,100원
http://www.enuri.com/detail.jsp?modelno=68114991

2. 태신일전자 SIF-TS2400WH, 3단, 제품 사이즈: 133 * 113 * 225((mm), 5단 풍속 조절
 , 배터리:리튬이온, 4,500mAh, 색상: 화이트, 가격: 28,870원
http://www.enuri.com/detail.jsp?modelno=72241661
==============================================================================================================
 
- 로지텍 MK240 NANO 무선 콤보 구입(포항집 수종 노트북용) ==> 완료[♥♡]
- [로지텍 코리아] 로지텍 MK240 NANO 무선 콤보[블랙] [키스킨 포함], 블랙, 가격: 32,400원
http://www.11st.co.kr/products/1187813726/share
==============================================================================================================

- QCY T13 구입(큰누나에게 선물)  ==> 완료[♥♡]
1. [무료배송_QCY 정품 블루투스이어폰 QCY T13+가죽파우치, 색상: 블랙, 가격: 20,040원  
http://www.tmon.co.kr/deal/8989328142?isHistory=Y
http://www.enuri.com/detail.jsp?modelno=68114337
1. 사용 시간(음악): 8시간 ==> 5분 충전: 약 1시간 재생(완충: 8시간 재생, 충전독: 30시간 사용), 용량: 380mAh(충전케이스)
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.19(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> 사업장에 냉장고, 전자레인지 도착(14시)

- 효성 PMS Prj[★]
- 간트 차트 분석(1일차)
1. DHTMLX ==> https://dhtmlx.com/docs/products/demoApps
2. 71. 간트(DHTMLX) 샘플
http://localhost:8080/HyosungTNS_E-Brain/common/gantt_trial/samples/index.html
http://localhost:8080/HyosungTNS_E-Brain/common/gantt_trial/samples/10_layout/01_rightside_columns.html
==============================================================================================================

- 그래, 바로 이 차트였어! | 업무 진행상황이 한눈에 보이는 엑셀 간트차트 만들기 | 엑셀차트 8강(오빠두엑셀)
https://youtu.be/zdQ-1Qg3w_o
 
- MS Project(T. K. Min)(달력: 휴일 등록): 칸트 차트
https://www.youtube.com/watch?v=2-JQOl7plZI&list=PLVtHvm6Yp_9EguSKIiPylM4P7o0Jsm5wD
==============================================================================================================

- Synchronize 실패(eclispe에서)
Synchronize operation failed.
svn: E155032: The pristine text with checksum '$sha1$5f9f18e3ac7c492ba4637df9f192fae549bca65e' was found in the DB 
but not on disk
==============================================================================================================

- tnsPms 소스 받기
Z:\04. 구현\tnsPms.zip 압축파일을 그대로 로컬에 복사하여서 압축파일을 풀면 됩니다. ==> 취소
src/main/resources/template/common/폴더에 용어사전과 개발자표준정의서
==============================================================================================================

- PDM(Precedence Diagraming Method)
1. 종료부터 시작까지 관계(FS): ■
2. 종료에서 종료 관계(FF)
3. 시작부터 시작까지 관계(SS): ■
4. 처음부터 끝까지 관계(SF): ■
==============================================================================================================

- 카카오 뱅크 세이프 박스(파킹통장) 개설
1. 계좌번호: 3310-12-49266637, 계좌종류: 세이프박스, 계설일: 22.09.19, 연 2.2%, 보관한도: 1억원(천만원에 한도 증설)
 1) 연계 계좌번호 3333-12-38089543(이 계좌에 입금 후 세이프박스에 넣기 처리해야 함 
 2) 2022.09.19(월): 500만원 입금
==============================================================================================================

- [홍사훈의 경제쇼 플러스] 주식 투자 성공도 타고 나는 것! - 그럼에도 불구하고 시행착오를 줄이려면?
https://youtu.be/NwJbHE_p9VM
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.20(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==>

- 효성 PMS Prj[★]
- 간트 차트 분석
1. 데이터 로드
https://docs.dhtmlx.com/gantt/desktop__loading.html
2. 함수
https://docs.dhtmlx.com/gantt/api__gantt_promise.html
==============================================================================================================

- HyosungTNS_E-Brain(Project: 이전)
X:\AnyBuilder\workspace\JavaEE\HyosungTNS_E-Brain
http://localhost:8080/Anyfive_E-Brain/?login=1
-------------------------------------------------------------------------------------------------------------------------

- /tnspms(Project)
X:\AnyBuilder\workspace\JavaEE\tnspms
http://localhost:8080/tnspms
==============================================================================================================

- 효성 PMS Prj 계약서 체결(13:00, 1층 투섬플레이스 커피샵[아아])
0. 협상자: (주)예술과 기술 김승현 전무
1. 계약명: 효성 PMS Prj 프로젝트 
2. 계약기간: 2022년 09월 05일 ~ 2022년 12월 31일(4MM) 
3. 급여일: 매월 10일(Pay: 830)
4. 기타
 1) 김승현 전무가 일만 잘하면 퇴직때까지 같일 일하게 해준다고 함(희망)
 2) 전승진 부장(70년생, KB카드 Prj)과 13년간 같이 일함(가족간에도 알고 지낸다고 함)
==============================================================================================================

- 교육(15:30, 회의실): 김빌리 책임
1. 간트 차트 논의
 1) 1. Project --> 2. Stage ---> 3. Task ---> 4. Activity(Gate[네모, 깃발])
2. 이재륭 과장과 같이 간트 차트 분석하라고 함(이재륭 과장에게 오가다 커피샵에 가서 커피 사줌(3,800원))
==============================================================================================================

- 큰누나 미용실 장판 구입(큰누나에게 선물) ==> 완료[♥♡]
- 편안애272k-10cm 셀프 바닥 시공 모노륨 친환경 장판
https://smartstore.naver.com/mat001/products/5083073250
1. 모노륨) 편안애272k(10cm 단위) 1,100원 ==> 수량: 80개, 총 상품 금액: 88,000원, 주문금액(배송비: 7천원): 95,000원
2. 장판용 본드(2개): 7,000원 ==> 총 금액: 101,855원
==============================================================================================================

- 부엌용 전구 구입
1. 대진디엠피 XLEDs LED 벌브전구 주광색 18W2개), 해성 전기조명, 가격: 10,000원
https://prod.danawa.com/info/?pcode=8843504 
==============================================================================================================

- 10년차 개발자가 말하는 신입 시절 알았으면 좋았을 것들 | 워키토키 x 센드버드 ep2
https://youtu.be/1t6rzoi4vfA
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.21(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> 태성 이앤에스 모노 큐브 TS-8DF45 선풍기 사업장에 가지고 옴(07시, 가볍고 조용해서 대만족), 커피(10시, 
									대박 커피(구디점), 4잔: 4천[내가 쏨])

- 효성 PMS Prj[★]
- 간트 차트 분석
- 71. 간트 샘플(로컬 서버)
http://localhost:8080/tnspms/common/gantt_trial/samples/01_initialization/01_basic_init.html
==============================================================================================================
 
- 개요/추진계획(과제관리 ==> 계획수립)
http://localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=76136XK98EF17B0D90&processStatus=B2
==============================================================================================================

- 추진계획(팝업) 조회(WBS) 에러
1. 현상
Stacktrace:] with root cause
javax.el.PropertyNotFoundException: Property [time] not found on type [java.lang.String]

2022-09-21 09:34:23.916 ERROR 2100 --- [http-nio-8080-exec-7] o.a.c.c.C.[.[localhost].[/tnspms].[jsp]  : Servlet.service() 
for servlet [jsp] threw exception
java.io.IOException: An exception occurred processing JSP page [/WEB-INF/views/common/layout/LayoutCommonBase.jsp] 
at line [23]

20: <script type="text/javascript">any.body().begin();</script>
21: <div>
22:     <div any-container>
23:         <tiles:insertAttribute name="content.form" />
24:     </div>
25: </div>
26: <script type="text/javascript">any.body().end();</script>
2. 원인: time에 데이터가 없음
3. 조치:  iewInfo.beginDe.time} ==> iewInfo.beginDe로 변경
<c:if test="${viewInfo.beginDe ne null}">
	// var prjctBeginDate = new Date(<n:text value="${viewInfo.beginDe.time}" escape="js" />);
	var prjctBeginDate = new Date(<n:text value="${viewInfo.beginDe}" escape="js" />);
	console.log("\n\n\n\n [@_T] ■■■ [/ProjectWbsMainCU.form.jsp] ==> [T_41] [시작일]"+ prjctBeginDate );

	gantt.addMarker({
		start_date: prjctBeginDate,
		css: "status_line",
		text: "Start",
		title: "Project Start: " + any.date(prjctBeginDate).toString("yyyy-mm-dd")
	});
</c:if>
==============================================================================================================

- 알씨 9.229.22 이미지 뷰어 / 사진 편집 프로그램 설치
1. https://www.altools.co.kr/download/alsee.aspx#n

- 화면 캡처 알씨
https://kr.new-version.app/download/alcapture/
==============================================================================================================

- 윈도우용 무료 컬러 피커(Color Picker) 사용하기
https://lifenourish.tistory.com/808
https://lifenourish.tistory.com/808
==============================================================================================================
 
- 회의(15:30): 김빌리 책임
1. 김순철 부장 PL이 아닌 개발자로 프로젝트 수행(비공식적): 공식적으로는 PL 역할 수행해야 함
 1) 김빌리 책임이 PL 역할 같이 맡음(비공식적)
2. 월 1회 휴가 가능(비공식적)
3. 현재 상황이 비상 상황임(집중 근무)
4. 다국어 개발(한국, 영어): 김책임이 가져온 사이트 소스 활용할 것(윤차장 담당)
==============================================================================================================

- DBeaver 클라이언트를 사용하여 SQL 명령 실행
https://youtu.be/xFv-TeIroV8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.22(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30  ==> 커피((16:00, 지하 1층 커피샵: 김빌리 책임이 개발자에게 처음으로 사줌)

- 효성 PMS Prj[★] 
- 개요/추진계획(과제관리 ==> 계획수립) 수정
http://localhost:8080/tnspms/prjct/exec/mst/SumryPrtnPlan/viewTab?prjctMastrId=76136XK98EF17B0D90&processStatus=B2
==============================================================================================================
 
- DB 테이블 변경
01. 프로젝트 마스터(TB_PRJCT_MASTER) ==> 01. 프로젝트 마스터(TB_PJT_MST) 
02. 프로젝트_WBS(TB_PRJCT_WBS) ==> 02. 프로젝트_WBS_계획(TB_PJT_WBS_PLAN)
03. 프로젝트_WBS_실적(TB_PRJCT_WBS_ACMSLT) ==> 03. 프로젝트_WBS_실적(TB_PJT_WBS_PERF)
04. 프로젝트_WBS_산출물(TB_PJT_WBS_OUTPUT)
---------------------------------------------------------------------------------------------------------------------

01. 프로젝트_WBS_템플릿(TB_PRJCT_WBS_TMPLAT) ==> 공통_WBS_템플릿(TB_COM_WBS_TMPL)   
02. 프로젝트_WBS_템플릿_버전(TB_PRJCT_WBS_TMPLAT_VER) ==> 공통_WBS_템플릿_버전(TB_COM_WBS_TMPL_VER) 
03. 프로젝트_WBS_템플릿_코드(TB_PRJCT_WBS_TMPLAT_CODE) ==> 공통_WBS_코드(TB_COM_WBS_CD) 
==============================================================================================================

- 프린터 설정
00. SEC30CDA7A5C390
위치(L): http://192.168.0.150:8018/wsd
==============================================================================================================

- WBS 템플릿 관리(시스템관리 ==> 코드관리) 개발
http://localhost:8080/tnspms/prjct/wbsmgt/tmplatmgt/ProjectWbsTemplateMgt/viewList
1. /ProjectWbsTemplateMgtController.java
2. /ProjectWbsTemplateMgt.jsp
==============================================================================================================
 
 - MS-SQL 설치
https://www.microsoft.com/ko-kr/sql-server/sql-server-downloads

- 10일 만에 마스터하는 MS SQL 실무_1편
https://youtu.be/UjAvuqTVzlE
1. QL Server 2019 Developer 

2. Download SQL Server Management Studio (SSMS)
https://learn.microsoft.com/ko-kr/sql/ssms/download-sql-server-management-studio-ssms?view=sql-server-ver16
==============================================================================================================

- 회의(10:30): 김빌리 책임
1. 김빌리 책임이 자기가 직접 PL 업무 하겠다고 함
 1) 박순철 부장은 자기는 공식, 비공식적 PL 안하겠다고 선언 
 -------------------------------------------------------------------------------------------------

- 회의(15:00): 김빌리 책임
1. 김빌리 책임이 MS-SQL에서 Oracle로 변경하면서 수정된 DB 테이블 알려줌
 1) 테이블명, 칼럼명 수정할 것 
=============================================================================================================

- 환경 설정(DBeaver에서) 
1. 상위 ==> 윈도우(W) --> 설정 --> 환경 설정(P)
 1) User Interface ==> 모양
  가. Enable theming 
   가) 테마(T): System: 체크
 2) User Interface ==> 모양 ==> 색상 및 글꼴
  가. 텍스트 글꼴 ==> 편집(E)
   가) 함초론돋움, 10
 3) 편집기 ==> 문서 편집기
  가. 행 번호 표시(B): 체크 
  나. 배경색 ==> 색상(C): 78,76,194
-------------------------------------------------------------------------------------------------------------------

- 칼럼명 복사 (DBeaver에서) 
1. 조회(Result(Grid내에 있는 왼쪽 Tab) ==> 텍스트: 클릭
1 ) Name: 복사
-------------------------------------------------------------------------------------------------------------------

 - 주석 처리
1. 한 줄 주석: Ctrl + /
2. 블록주석: Ctrl + Shfit + / 
==============================================================================================================

- 01. WRM(WS_인스웨이브) DB 설정(DBeaver에서 mariadb 연결)
<bean id="dataSource" class="org.springframework.jdbc.datasource.DriverManagerDataSource">
	<property name="driverClassName" value="org.mariadb.jdbc.Driver" />
	<property name="url" value="jdbc:mariadb://127.0.0.1:3306/WRM" />
	<property name="username" value="APP" />
	<property name="password" value="APP" />
</bean>
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.23(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 06:00 ~ 17:30  ==> 조식(07:10, 사업장 컵라면, 집 밥 안 됨)

- 효성 PMS Prj[★] 
- WBS 템플릿 관리(시스템관리 ==> 코드관리) 개발
http://localhost:8080/tnspms/prjct/wbsmgt/tmplatmgt/ProjectWbsTemplateMgt/viewList
1. /ProjectWbsTemplateMgtController.java
2. /ProjectWbsTemplateMgt.jsp 
    ) VALUES (
                   #{tbPrjctWbsTmplat.wbsTmplatId}     /* WBS 템플릿 ID */
                 , (SELECT NVL2(MAX(TMPL_CD), 'T' || LPAD(REPLACE(MAX(TMPL_CD), 'T') + 1, 7, '0'), 'T0001')
                    FROM TB_COM_WBS_TMPL)      /* 템플릿 코드(채번) */
==============================================================================================================

- [Oracle]오라클 INSERT시 자동 채번(MAX+1)
https://dpdpwl.tistory.com/84
==============================================================================================================

-  /* [@_T] [T_01] 프로젝트 WBS 템플릿 관리 ==> [/ProjectWbsTemplateMgtMapper.xml.readList()] [22.09.22, by 진태만] */ 
WBS_TMPLAT_ID   --> WBS_TMPL_ID(WBS 템플릿 ID) 
TMPLAT_NM_TITLE   --> TMPL_NM(템플릿 이름 타이틀)
 
DCSN_PSN_ID   --> DCSN_USER_ID(확정자 ID) 
TMPLAT_VER   --> TMPL_VER(템플릿 버전) 
==============================================================================================================

- SQL Server 설치 프로그램 설치 에러(MS-SQL에서)
1. 현상: 디렉토리 'C:\SQL2019/RuleEng'를 삭제할 수 없습니다.
=============================================================================================================

- DBeaver 단축키 2 - SQL 실행 단축키
https://meyouus.tistory.com/119
=============================================================================================================

- [JAVA 프로그래밍.min] 8강-3.사전준비-이클립스 플러그인 ERMaster 설치
https://youtu.be/6fV7cUMEoT0
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.24(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==>  

- 주말[★] 
05:50 기상
06:30 조식
06:50 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 승리교(반환점) => 도림 도보교)
08:20 종료
09:30 집출발(자전거)
10:40 연세의원(신원시장 내) 방문
10:10 당뇨 상담 ==> 혈당치: 181, 혈압: 120.80(혈압 정상)
		1. 건강검진 결과 상담(5,400원) ==> 대체로 정상(콜레스테롤 수치↑{약 복용}): 한 달 후 상태 확인, HbA1c: 6.7
10:20 윤약국 방문 ==> 조제(당뇨약[누메트 엑스 알서방] + 리피토정 10mg[고지혈증 치료제]: 1달치 일치: 15,700원)
10:45 다이소 신림점 방문 ==> 오릭스 핸드로션(350 ml, 2개, 6천원), 메모리폼 방석(약40X40cm, 효성 PMS Prj 사업장용, 5천원) 구입
10:55 귀가 
12:00 중식
12:30 실내 도보
13:55 종료
14:00 인터넷 서핑
18:00 석식
18:20 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 승리교(반환점) => 도림 도보교)
20:00 종료 
21:05 인터넷 서핑
22:00 종료
22:30 취침 
==============================================================================================================
 
- 건강검진 결과(2022.09.17(토) 실시: 연세의원)
1. [D1860003] AST(SG0T), [결과] 29, <= 40 U/L ==> 간기능 정상 ■
2. [D2611003] Cholesterol, Total, [결과] 249, H, 참고치: Desirable[바람직한] < 200
3. [D2614003] LDL-Cholesterol, [결과] 145, H, 참고치: Optimal[최적] < 100 ==> 70이하로 낮출 것(의사 권유, 고지혈증) ■■■
4. [D3063003] HbA1c, [결과] 6.7, H, 참고치:정상] < 5.6  -->  당뇨 >= 6.5% ■■■
6. [D4902023] 25-CH Vitamin D, Total, [결과] 41.47,  ,Desirable[바람직한] < 20.00
7. [D3250013] TSH, [결과] 1.140,  , 0.270 ~ 4.200 u IU/mL ==> 감상선(정상)
==> Deficiency(부족한), Insufficiency(불충분), Sufficiency(충분한), Toxicity(독성)
==============================================================================================================
  
- 연세의원에서 처방한 약(2022.09.24(토))  
1. 자누메트 엑스 알서방[당뇨약, DDP-4 Inhibitors with Biguanid]
https://nedrug.mfds.go.kr/pbp/CCBBB01/getItemDetail?itemSeq=201309417
2. 리피토정 10mg[고지혈증 치료제]
==============================================================================================================

- 스프링 부트(슬기로운코딩생활) 
https://www.youtube.com/watch?v=nrxzK_ky3uc&list=PLvdZg8T1CFZuMZh5PzNUAhDprr0ksjkNp 
==============================================================================================================

- 이미지 뷰어 추천 비교, Xnview, 꿀뷰, Imagine, 패스트스톤
https://startdownload.tistory.com/151
0. 패스트스톤 이미지뷰어 사용법 ==> https://www.faststone.org/FSIVDownload.htm
1. Imagine ==> https://m.blog.naver.com/santadesign/222094975484
2. ACDSee Pro ==> https://ko.all10soft.com/download/401/acdsee-pro
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.25(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 휴일 근무(09:00 ~ 16:40)
06:20 기상
06:30 조식
06:50 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 승리교(반환점) => 도림 도보교)
08:15 종료
08:40 집출발(자전거)
08:55 대륭1차 빌딩 12층 사업장 도착
09:00 휴일 근무
12:00 석식
12:15 도보(대륭1차 빌딩 앞 도로)
13:45 종료
16:40 퇴근(자전거)
16:55 헌혈의집 구로디지털 단지역센터 방문(화장실 비밀번호: 415*)
  1. 사전 상담 및 검사
   1) 혈액 검사(헤모글로빈 정상)
   2) 혈압 측정: 158/ 92(높음)
  2. 헌혈 
   1) 종류: 전혈 320mL
  3. 헌혈 사은품
   1) 음료수(오렌지), 롯데 ZEC(150g)
   2) 2022년 헌혈자 기념품: GS25편의점 또는 CU 편의점 교환권(2장: 5천원) 총 만원
17:40 종료
17:55 귀가
18:00 석식
18:20 도보(도림 도보교 => 신림1교[오른쪽 도로] => 동방1교[반환점] => 도림 도보교 => 승리교(반환점) => 도림 도보교)
19:45 종료
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 69.2kg ==> BMI: 23.94[표준 체중]) 
21:00 인터넷 서핑
22:50 종료
==============================================================================================================
 
- 효성 PMS Prj[★]
- WBS 템플릿 관리(시스템관리 ==> 코드관리) 개발
http://localhost:8080/tnspms/prjct/wbsmgt/tmplatmgt/ProjectWbsTemplateMgt/viewList
1. /ProjectWbsTemplateMgtController.java
2. /ProjectWbsTemplateMgt.form.jsp
==============================================================================================================

- Scheduler(배치) 주석 처리[22.09.25, by 진태만]
:\tnsPms\workspace\JavaEE\tnspms\src\main\java\com\anyfive\ebrain\pms\common\config\ApplicationConfig.java 
@Configuration
public class ApplicationConfig extends WebMvcConfigurerAdapter
{
	//    @Bean   //.Scheduler(배치) 주석 처리[22.09.25, by 진태만]
	//    public Scheduler scheduler()
	//    {
	//        // return SpringQuartzSchedulerUtil.start();
	//    } 
}
---------------------------------------------------------------------------------------------------------------------------

1. anyworks-scheduler.yaml(X:\tnsPms\workspace\JavaEE\tnspms\src\main\resources\application\config\_default) // 참고 
#    "common-email-EmailSendSchedulerJob":    // 메일 발송 Scheduler 주석 처리[22.09.25, by 진태만]
#      name: "메일 발송"
#      job-class: com.anyfive.ebrain.pms.common.email.scheduler.EmailSendSchedulerJob
#      holding-job-continuously-execute: false
#      cron-expression-list:
#        - "0/10 * * * * ?"
#      start-delay: 30000
#      profiles: [dev, prod1]
==============================================================================================================

- 91 막대 차트(IB Sheet 7)
https://www.ibsheet.com/ibchart_gallery.html#column
==> 2. PROJ-DE-120-화면정의서(프로젝트관리(계획.실적))-v0.80-202200919.pptx ==> 14Page(화면 설명: M/M 관리 화면)
==============================================================================================================

- 패스트스톤 이미지뷰어 설치(효성 PMS Prj 사업장 노트북에 설치: 만족)
1. 패스트스톤 이미지뷰어 사용법 ==> https://www.faststone.org/FSIVDownload.htm 
==============================================================================================================

- 윈도우11 작업표시줄 윈도우10 스타일로 변경해 사용하기 ==> 사용 안함
https://zkim0115.tistory.com/2333

- 윈도우 11 작업표시줄 설정 방법  
https://thedayhascom.tistory.com/348

- 윈도우11 작업표시줄 작업 관리자 없어졌나요?
https://lbtest.tistory.com/1185
==============================================================================================================

- 소프시스 위더스 컴퓨터 책상 1260, 가격: 49,900원
http://www.enuri.com/detail.jsp?modelno=1587730

- 가구 박사 탑 데스크 [100x44cm], 가격: 36,130원
http://www.enuri.com/detail.jsp?modelno=13748658
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.09.26(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 17:30 ==> 사업장 인터넷 고장(08:30 ~ 10:30): KT에 전화해서 해결[네트워크 아탑터 재시작 후, 노트북 재시작)

- 효성 PMS Prj[★]
- WBS 코드 관리(시스템관리 ==> 코드관리) 개발 
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtontroller.java
2. /ProjectWbsCodeMgtListR.form.jsp
==============================================================================================================

 - Anyfive_E-Brain 서버 설정 및 MS-SQL 설정
 1. Anyfive_E-Brain 서버 소스
  1) X:\tnsPms\workspace\JavaEE\Anyfive_E-Brain\\n2. SSQL Server 2019 설치
 1) SQL Server 2019 설치 중 에러 발생
   가. Exit code: 2146233079Error description: 프로세스(7908)가 끝났으므로 요청을 처리할 수 업습니다.
3. SSMS-Setup-KOR.exe 설치
 1) MS-SQL 데이타: X:\71. mssql_data  
---------------------------------------------------------------------------------------------------------------------------

- Anyfive_E-Brain(로컬S)
http://localhost:8080/Anyfive_E-Brain
==============================================================================================================

- SQL Server 2019 설치 및 SSMS 설치 - 데이터베이스 학습 개발 환경 구축하기
https://www.youtube.com/watch?v=QeV3EB4DrZY

- MS SQL Server 2019 및 SSMS 설치 방법
https://blueshare.tistory.com/42
==============================================================================================================

- jq Grid 
https://aljjabaegi.tistory.com/322
==============================================================================================================

- [Spring Boot] Spring Boot 환경 구축
https://itjy2.tistory.com/150
1. Boot Dashboard
2. Spring Tools 4
=============================================================================================================

- 회의(09:40)
1. 김빌리 책임이 박순철 부잔을 짤랐다고 함(박부장 오전에 효성TNS(수서역)가서 노트북 포맷 후 철수)
 1) 능력 X, 근무 태만
2. 윤성훈 차장이 API(박부장 업무) 개발하기로 함
 1) 고급 개발자 1명이나 중급 개발자 2명 채용하기로 함
=============================================================================================================
 
- [개발환경 설정] 2. Eclipse 설치 (이클립스 설치) - 옥시젠(Oxygen)
https://elena90.tistory.com/112
 https://www.eclipse.org/downloads/packages/release/oxygen/3a
=============================================================================================================
 
- 법원 경매[1치] (현아트빌 404호) 시작된 사실 확인
1, 매각기일 및 매각결정기일
 가. 제 1회 매각기일: 22.10.06(목) 10시, 매각결정기일: 22.10.13(목) 10시
 나. 제 2회 매각기일: 22.11.10(목) 10시, 매각결정기일: 22.11.17(목) 10시
 다. 제 3회 매각기일: 22.12.15(목) 10시, 매각결정기일: 22.12.22(목) 10시
 라. 제 4회 매각기일: 23.02.02(목) 10시, 매각결정기일: 23.02.09(목) 10시

2, 최적 매각 가격
매각 물건			제 1회						제 2회							제 3회						제 4회
1			 302,000,000원(20%↓)	241,600,000원(20%↓)	193,280,000원(20%↓)	154,634,000원(20%↓)
 가. 제 1회 매각기일: 22.10.06(목) 10시, 매각결정기일: 22.10.13(목) 10시
 
3, 매각 및 매각 결정 장소
가. 서울중앙지방법원 (매각)경매 법정(제4별관 211호), (매각 결정)배당 법정(제4별과 3층 7호) 
============================================================================================================

- 법원 경매[1치] (10시, 현아트빌 404호)
1, 제 1회 매각기일: 22.10.06(10시)  매각 기일(제 4별관 211호) ==> 감정 평가액: 302,000,000원, 최저매각 가격: 302,000,000원
22.10.13(14시)  매각 결정 기일(제4별과 3층 7호)
==> 매각기일에 입찰장소에서 입찰자에게 입찰가격을 기재한 입찰표를 넣고 봉함한 입찰봉투를 제출하게 한 후 
그중에서 최고가의 신고를 한 자를 최고가매수신고인으로 정한 다음 매각결정기일에서 매각허가결정을 하는 방법
==> 전세가: 2억 8백 5백 만원
============================================================================================================
=============================================================================================================
 
- 01. 현민쌤TV 경매 초급반
https://www.youtube.com/watch?v=NtPDw99OWcY&list=PLzlazClX6tYdfV2xxIivcixQNzoYG--sr

- 02. 오늘의 경매
https://www.youtube.com/watch?v=__SFSlVcd5M&list=PL6yIUJctHRm_fpux9ERvKVpDpAa19xqbf

- 03. 부동산 경매 강의 영상(설마 안정일 경매TV)
https://www.youtube.com/watch?v=OCiD55vzfwk&list=PL4ROyJhjz7bX_KnXBwbby3MiZNNyAHb05 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.09.27(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:10 ==> 효성 TNS 현업 투입(10시, 이상영 팀장외 4명), 중식(11:40: (타오[반점]: 짜장면, 개발팀, 효성 TNS 현업)
							, 커피(12:10, 스무디 앤, 아아),	이상영 팀장 면담(15시, 편의점 아이스크림 얻어 먹음), 우편물 찾기(17:40, 관악 
							우체국 4층: 법원 경매 우편물 직접 수령)

- 효성 PMS Prj[★]
- Anyfive_E-Brain(로컬S)
http://localhost:8080/Anyfive_E-Brain/viewLogin.do?login=1
=============================================================================================================

- DBaever에 MSQ-SQL 셋팅
1. 51. 효성(김책임N, 로컬S)
 1) URL: jdbc:sqlserver://192.168.0.26:1433;SelectMethod=cursor;DatabaseName=HanwhaAM_HPMS
 2) username: "HanwhaAM_HPMS",   password: "anyfive1@"
=============================================================================================================

- Anyfive_E-Brain 로컬 서버 연결 에러(eclipse에서)
1. 현상:
2022-09-27 07:18:42.551 ERROR 11340 --- [           main] o.apache.tomcat.jdbc.pool.ConnectionPool : Unable to create initial 
connections of pool.
com.microsoft.sqlserver.jdbc.SQLServerException: 연결 URL이 null입니다.
	at com.microsoft.sqlserver.jdbc.SQLServerDriver.parseAndMergeProperties(SQLServerDriver.java:1023)
	at com.microsoft.sqlserver.jdbc.SQLServerDriver.connect(SQLServerDriver.java:1008)]
2. 원인: TEST 노트북(IP: 192.168.0.27) 인식 못함 ==> 보안 SW나 방화벽 문제로 추정됨
- /datasource.yaml 파일에서
# 효성 PMS Prj 사업장(대륭1차 12층) 개발 DB(TEST 노트북)
  url: "jdbc:sqlserver://192.168.0.27:1433;SelectMethod=cursor;DatabaseName=Anyfive_E-Brain"
  username: "HanwhaTotal_HPMS"
  password: "HanwhaTotal_HPMS"
3. 조치: 김빌리 책임 노트북 MS-SQL DB 연결
# 효성 PMS Prj 사업장(대륭1차 12층) 개발 DB(김빌리 책임 노트북)
    url: "jdbc:sqlserver://192.168.0.26:1433;SelectMethod=cursor;DatabaseName=HanwhaAM_HPMS"
    username: "HanwhaAM_HPMS"
    password: "anyfive1@"
=============================================================================================================

- WBS 코드 관리(시스템관리 ==> 코드관리) 개발 
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtontroller.java
2. /ProjectWbsCodeMgtListR.form.jsp
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2022.09.28(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 17:30 ==> 효성 TNS 박상규 차장, 유지현 대리 사업장 출근, 수요 커피(08:40, 윤 차장이 쏨[7명]), 유대리와 윤차장 충돌(갑질?)

- 효성 PMS Prj[★]
- Anyfive_E-Brain(로컬S) 소스 분석
1. WBS 템플릿 관리(시스템관리 ==> 코드관리) 개발
2. WBS 코드 관리(시스템관리 ==> 코드관리)

3. 과제등록(과제 ==> 과제관리 ==> 과제관리)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
 
4. 개요/추진계획(과제 ==> 과제관리 ==> 계획 수립)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
 
5. 추진계획(팝업) (과제 ==> 과제관리 ==> 계획 수립)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
=============================================================================================================

- 과제등록(과제 ==> 과제관리 ==> 과제관리)
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtontroller.java
2. /ProjectWbsCodeMgtC.form.jsp

-- 프로젝트 상태 조회 @@@
SELECT A.CODE_VALUE "프로젝트 상태 코드", dbo.FN_TITLE(A.CODE_VALUE_NM_TITLE, 'ko_KR',  'ko_KR', NULL) 
			"프로젝트 상태 코드", A.*
FROM TB_SYS_CODE_VALUE A
  INNER JOIN TB_SYS_CODE_GROUP B 
	   ON A.CODE_GROUP_ID = B.CODE_GROUP_ID
WHERE B.CODE_GROUP  = 'PRJCT_STTUS'
-- AND  A.CODE_VALUE = 'A1'    -- 프로젝트 상태 코드  ('B1','B2')   
	AND A.CODE_VALUE IN ( 'A1', 'B1','B2')       -- 프로젝트 상태 코드(A1:과제등록, A2:자원계획 수립요청, B1:개요/계획 작성
	, B2:과제 승인요청, C1:진행중, C2:이월, C3:연장이월, D1:종료, D2:완료, E1:성과종결, E2:성과대상전환요청)
;
==============================================================================================================

- 일반 WBS 등록(팝업) (시스템관리 ==> 코드관리) 개발 
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtontroller.java
2. /ProjectWbsCodeMgtC.form.jsp
==============================================================================================================

- [ERD 따라해보기] 국산제품 eXERD 사용해보기Ⅴ(표준용어사전)
https://m.blog.naver.com/PostView.naver?isHttpsRedirect=true&blogId=tomatosoft&logNo=140138535510
==============================================================================================================

- 배치 교육(09:40, 회의실)
1. 애니파이브 직원이 와서 교육(윤성훈 차장: 문제 해결함)
1. anyworks-scheduler.yaml(X:\tnsPms\workspace\JavaEE\tnspms\src\main\resources\application\config\_default) // 참고 
reloadable: true
anyworks-scheduler:
  enable: false   #  \false에서 true로 변경해서 배치가 돔 ■■■  
  job-interceptor: com.anyfive.ebrain.pms.common.scheduler.interceptor.SchedulerJobInterceptor
  job-details:

#    "common-email-EmailSendSchedulerJob":    // 메일 발송 Scheduler 주석 처리[22.09.25, by 진태만]
#      name: "메일 발송"
#      job-class: com.anyfive.ebrain.pms.common.email.scheduler.EmailSendSchedulerJob
#      holding-job-continuously-execute: false
#      cron-expression-list:
#        - "0/10 * * * * ?"
#      start-delay: 30000
#      profiles: [dev, prod1]   # ==> /profiles.yaml 파일에서 [dev, prod1]  찾아감 --> profiles: [default] 변경 추천 ■■■  
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.29(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 17:30 ==> 

- 효성 PMS Prj[★]
- Anyfive_E-Brain(로컬S) 소스 분석
3. 과제등록(과제 ==> 과제관리 ==> 과제관리) ==> 정정길(200011299)로 로그인할 것 @@@
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
 
 4. Man Year 계획*과제 ==> 과제관리 ==> 계획 수립)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
 
5. 개요/추진계획(과제 ==> 과제관리 ==> 계획 수립)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA) 
 
6. 추진계획(팝업) (과제 ==> 과제관리 ==> 계획 수립)
 1) 과제코드: R20039, 과제명: 신 시스템 개발 Test(TAMA)
=============================================================================================================
 
- 효성 PMS Prj[★]
- Anyfive_E-Brain(로컬S) ==> AS-IS(MS-SQL DB 서버 사용)
http://localhost:8080/Anyfive_E-Brain/?login=1
=============================================================================================================

- Boot Dashboard(Spring)
1. Eclipase 정보(효성 PMS Prj 사업장 개인 노트북에 설치된 버전)
 Eclipase Java EE IDE for Web Developers.
 Version: Oxygen.2 Release (4.7.2)

- Spring Boot 프로젝트 만들기 (Spring Initializer, STS), 프로젝트 실행하기
출처: https://dev2som.tistory.com/133 [Shant:티스토리]
=============================================================================================================

- To-Do List 수정
 TB_COM_MY_JOB: 공통_나의업무 TB에서
1. 생성일자, 만료일자 칼럼 데이타 수정
 1) 22/04/05  ==> 220405
 "CREAT_DE" VARCHAR2(30),	// 생성일자 
"END_DE" VARCHAR2(8), 			// 만료일자
 =============================================================================================================
   
- 개발장애목록(장애관리 ==> 개발장애) 개발 ==> IB Sheet 샘플
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/DevelopMgt/viewList  
B-INF/views/obstacle/developmgt/DevelopMgtListR.script.jsp 
==============================================================================================================
 
- 회의(09:40)
1. 김빌리 책임이 효션 현업이 직접 지시 못 하도록 교육 하겠다고 함(윤성훈 차장 하도급법 위반이라고 강하게 항의)
 1) 유지현 대리에게 감정 상함
2. 김빌리 책임이 12월 9일까지 개발 완료라고 WBS 작성했다고 함
 1) 개발 일정 압박 받지 말라고 함(자기가 책임 진다고 함)
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.09.30(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 06:50 ~ 17:30 ==> 가계부 월말 결산(21시, 집)

- 효성 PMS Prj[★] 
- WBS 코드 관리(시스템관리 ==> 코드관리) 개발 
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtontroller.java
2. /ProjectWbsCodeMgtListR.form.jsp
wbsTmplatId  ==> wbsTmplId    /* WBS 템플릿 ID */
wbsTmplatVerId  ==> wbsTmplatVerId    /* WBS 템플릿 버전 ID */ 
=============================================================================================================
 
- 일반 WBS 등록 화면(팝업)(과제 ==> 과제관리 ==> 과제관리)
http://localhost:8080/tnspms/prjct/wbsmgt/codemgt/ProjectWbsCodeMgt/viewList
1. /ProjectWbsCodeMgtC.form.jsp
=============================================================================================================

-/LayoutCommonBase.jsp 파일에서
<script>
    // TODO : 이재륭 : 개발완료 후 삭제
    // console.log("-------------- [페이지 로드 정보 - START] --------------");
    console.log("\n\n\n\n[@_T] ■■■ [/LayoutCommonBase.jsp] ==> [T_01] [JSP_파일_정보] ■■■ 
	<tiles:getAsString name="content.form"/>\n");
    // console.log("<tiles:getAsString name="content.form"/>");
    //  console.log("<tiles:getAsString name="content.script"/>");
 //  console.log("-------------- [페이지 로드 정보 - END] --------------");
</script>
=============================================================================================================  

- 논쟁(08:40) 
1. 윤성훈 차장이 출근해서 수요일에 일으난 유지현 대리와의 사건이 모욕적이라며 애니파이브 영업 대표와 자기 업체 대표에서
전화해서 항의함
 1) 이대리와 나한테도 우리 업체에 전화해서 효성 고객이 하도급법 위반했다고 보고 하라고 함
 2) 자기와 내가 힘을 합쳐서 부조리에 맞서 싸워야 한다고 주장함
 3) 나는 어제 김빌리 책임이 효성 교육 시키는 것으로 일이 일단락 되었다고 하니 자기는 아직도 너무 분하다고 함
 4) 자꾸 윤차장이 그 일로  무시하는 듯한 말투로 내게 이야기 하기에 내가 짜증을 냄 ==> 다시는 프로젝트 문제로 서로 이야기
안하기로 함
 5) 퇴근해서 내가 김책임과 통화하면서 하소연을 함(둘 다 결정 쉽지 않을 듯)
=============================================================================================================
 
- 카카오 뱅크 세이프 박스(파킹통장) 입금
1. 계좌번호: 3310-12-49266637, 계좌종류: 세이프박스, 계설일: 22.09.19, 연 2.2%, 보관한도: 1억원(천만원에 한도 증설)
 1) 연계 계좌번호 3333-12-38089543(이 계좌에 입금 후 세이프박스에 넣기 처리해야 함 
 2) 22022.09.30(금): 500만원 입금 ==> 총 잔액: 천 만원
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 