

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+-----------------------------------------------// Memo(2022.08) //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2022.08.01(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 한국 U2W 박준영 부장에게 문자 보냄(09:10, 농협 프로젝트 자리 없다고 함)

- KB카드 Prj[★]
- 
==============================================================================================================
 
- 63. 오준석의 안드로이드 생존코딩: 코틀린편(rcLst, 한빛미디어)
https://www.google.com/webhp?hl=ko&sa=X&ved=0ahUKEwi-y7KBvKvsAhXbxYsBHUmqC9gQPAgI
==============================================================================================================

- QCY T13 구입 
1. 무배 QCY 블루투스 이어폰 QCY T13 APP 가죽 파우치 포함, 가격: 19,670원(옥션: Smile Pay 캐시 충전 결제(현금성))
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=C416938215&frm3=V2
http://www.enuri.com/detail.jsp?modelno=68114337
1. 사용 시간(음악): 8시간 ==> 5분 충전: 약 1시간 재생(완충: 8시간 재생, 충전독: 30시간 사용), 용량: 380mAh(충전케이스)

- QCY T13 출시! 만오천원짜리 가성비 이어폰 10일 실사용 장단점 리뷰
https://youtu.be/gTrSsFV2kTg
 ==============================================================================================================

- QCY T13[해외구매, 2개], 가격: 18,450원
http://www.enuri.com/detail.jsp?modelno=68114337
1. 사용 시간(음악): 8시간
2. 용량: 380mAh(충전케이스)

- 만원대 무선 이어폰 QCY-T13, 돈이 아깝지 않은 가성비! 고민은 배송을 늦출 뿐[꿀단지PD]
https://youtu.be/NOt0UehzKfU
==============================================================================================================

- 피에스이벤처스 PENTON TSX 다이아팟, 가격: 38,040원
http://www.enuri.com/detail.jsp?modelno=43786921
1. 사용 시간(음악): 8시간, 600시간(충전케이스 사용시)
2. 용량: 50mAh(이어폰), 600mAh(충전케이스)
==============================================================================================================
 
- QCY HT05 이번엔 추천 합니다!ㅣ2만원대 ANC 노캔 무선이어폰 추천 리뷰
https://youtu.be/RWtoeCOwCMk
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.02(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 서버 개발자 회식(자담 치킨: 치킨, 햄쏘세지, 골뱅이, 맥주, 소주: 노과장, 권부장, 백과장): 내가 쏨

- KB카드 Prj[★]
- 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.03(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 권승기 부장 철수(16시)

- KB카드 Prj[★]
- 
==============================================================================================================
 
-플라이 하이 “보안으로 삶의 질 향상시킨다” - 데이터넷 
- https://www.datanet.co.kr/news/articleView.html?idxno=132677
1. OmniCA(옴니 CA)
==============================================================================================================

- 통합인증 SSO 솔루션 iSIGN+ | 펜타시큐리티시스템
https://www.pentasecurity.co.kr/isign/
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.04(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> QCY T13 블루투스 이어폰 처음 사용(만족), KB카드 Prj 개발자 전체 회식(18:20, 대지식당: 삼겹살)

- KB카드 Prj[★]
- 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.05(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 서버 개발자 회식(18:30, 잉꼬(일식집, 서울역 4번 출구: 후토마끼(왕 김밥, 2.7), 카이센동(초밥, 1.9), 바지락 술찜
									(2.0), 맥주, 소주: 노과장, 권부장, 백과장): 권부장이 쏨

- KB카드 Prj[★]
- 
==============================================================================================================
  
- [서울역] 회사 앞 단골 일식집, 잉꼬
https://m.blog.naver.com/rkawk3226/222504609508
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.06(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
06:00 기상
06:10 조식
06:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:10 귀가  
08:30 샤워  
08:45 집출발(자전거)
08:59 서울 가정의학과 의원 방문 ==> 혈당 측정: 149
09:00 진료 ==> 눈따리끼 약 처방, A1C 검사(7,770원)
09:15 래미안 나나 약국 방문 ==> 조제(눈따리끼 약 처방(3,800원: 3일치)) 구입
		==> 혈압: 111 ~ 77, 74(맥박)
09:30 이마트24 편의점(관악 신림 빌리지) 방문 ==> 오뚜기 컵라면 5개, 햅반 3개 구입(모바일 쿠폰(헌혈) 사용, 200원 카드 결제)
09:40 귀가
09:50  인터넷 서핑
12:00 중식
12:07 중식
12:30 실내 도보
13:40 종료
14:10 샤워
14:00 인터넷 서핑
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
19:50 귀가 
20:00 샤워
21:00 인터넷 서핑
23:00 취침
==============================================================================================================

- QCY T13 구입(노기수 과장에게 선물할 것)
1. 국내 정식 QCY T13 블루투스 5.1 무선 이어폰 화이트, 가격: 19,980원(G마켓: Smile Pay 캐시 충전 결제(현금성))
http://item.gmarket.co.kr/detailview/item.asp?goodscode=2234087716
1. 사용 시간(음악): 8시간
2. 용량: 380mAh(충전케이스) 
 ==============================================================================================================

- 전자레인지로 마른김 간단하게 굽는 방법 알려드립니다!
https://youtu.be/3MhMVxBcIxc
==============================================================================================================
 
- 쌀통 검토
- NEW 3세대 바이오 진공쌀통 20kg (SM-22A20R), 가격: 110,910원
http://www.enuri.com/detail.jsp?modelno=88025764
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2527365162&GoodsSale=Y&jaehuid=200002673

- 미락 진공쌀
https://youtu.be/Ewlh4FNxqyI
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.08.07(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:15 기상
06:40 조식
07:10 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
08:35 귀가 
09:00 샤워
09:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
14:10 샤워
17:40 귀가
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집)
18:35 쌀통 버리기(쌀벌레의 너무 많음): 냉장고를 쌀통으로 사용할 것
19:45 귀가 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 66.6kg ==> BMI: 22.73[표준 체중])
21:00 PC 켜짐
21:05 인터넷 서핑
22:00 종료
22:50 취침
==============================================================================================================
 
- 검은 콩 구입
1. 한끼농산 국산 서리태 [2kg] 속청 2021년산, 가격: 16,070원
1) Smile Pay 캐시 충전 결제(현금성): 16,070원
http://www.enuri.com/detail.jsp?modelno=50822096
https://youtu.be/ahpKXnInFmg 
==============================================================================================================

- 쌀의 모든것! 이것만 숙지하세요(고르는법,종류,보관법,씻는법,짓는법)
https://youtu.be/RY1eosHg1qo
==============================================================================================================

- 쌀 포대 푸는 법
https://youtu.be/EWG87t-pP94
1. 얌전하게 한땀한땀 일정하게 박힌 쪽 끝 부분에  실 끝을 잡아 당기면 약 1~2cm 정도 되는  실토막 뽑힙니다
2. 그 뒷편 푸는 곳 쪽에 두개의 실 중  하나의 실을 살짜기 잡아 당기면 솔솔솔~~~ 풀립니다 
-------------------------------------------------------------------------------------------------------------------------------
 
- 쌀 포대 푸는 법
https://youtu.be/tQOH6QwIrmQ
==============================================================================================================

- 한국인들 우유 절대 마시면 안되는 이유! [방태환원장의 건강강의]
https://youtu.be/HTsanylvSHg
==============================================================================================================
 
- 서울 아파트 낙찰건수 '0' [경매브리핑]
1. https://n.news.naver.com/mnews/article/018/0005285543?sid=101
==============================================================================================================

- 62. 리액트 강의(rcLst, 코딩알려주는 누나)
https://www.youtube.com/watch?v=qcphnSqneE0&list=PLKvVQ9ZQzjVkP0xd30Zi90P4S_rTlm-LH
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.08(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 하루 종일 비(밤에 집중 호우)

- KB카드 Prj[★]
- 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.09(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 하루 종일 비(밤에 집중 호우): 서울 115년 만의 최악의 폭우… 9명 사망·6명 실종

- KB카드 Prj[★]
- 
==============================================================================================================
 
- 서울 가정의학과 의원  당화혈색소 결과 문자 통보
[Web발신] 진태만님 당화혈색소 6.5(평균당 140)로 조절기준 7.0보다 낮게 조절되고 있습니다.
==============================================================================================================

- 롯데타워 관람기 입장료 2.7만원 쌀까? 비쌀가? 과연 가볼만할까?? Seoul Landmark Lotte Tower
https://youtu.be/6TV8HhVuDZc

- 롯데타워 오전 1인권, 18,500원
http://www.enuri.com/search.jsp?keyword=%EB%A1%AF%EB%8D%B0%ED%83%80%EC%9B%8C%EC%A0%84%EB%A7%9D%EB%8C%80 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.10(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==>  

- KB카드 Prj[★]
- 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.11(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 서버 개발자 회식(자담 치킨: 치킨, 맥주, 소주: 노과장, 백과장)

- KB카드 Prj[★]
- 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.12(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 김현삼 전무 휴가, 갤럭시 노트9에 지문 2개 등록(핸드폰 뒷편 지문 트레이 때문에 편리함)

- KB카드 Prj[★]
- 
==============================================================================================================

- 진수종 데리고 옴(20시, 대림역)
17:56 퇴근
18:50 귀가
19:00 석식
19:30 집출발(자전거)
19:40 신림 자전거 수리 센터 방문 ==> 자전거 바퀴 바람 넣기(자전거 주행 속도 빨라짐)
19:50 신한은행 신림역점 ATM기 방문 ==> 5만원권 2장을 만원권 10장으로 교환
20:00 다이소 신림3호점 방문 ==> 직사각 샐러드 도시락(2개, 5천원), 심플 저장 용기(대 2L, 2천원), 계량컵 뚜껑 잡곡 용기 1.2L(천원) 구입
20:30 신림역 => 봉림교 => 신대방역 => 구로디지털역 4번 출구 도착: 수해로 도림천 출입 금지됨
20:32 루엔, 수종 만남
20:34 출발(자전거): 자전거 뒤에 수종 태움(엄청 무거움): 구로디지털역 --> 신대방역
20:50 귀가 
21:20 샤워(수종)
21:30 인터넷 서핑: 수종 내 PC 사용 함
23:00 취침(수종)
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.13(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
06:00 기상
06:10 조식
06:30 도보(집 => 신사 방법대 => 도림천 => 신대방역 => 구로디지털역 => 대림역[반환점] => 도림천 => 신사 방법대 => 집)
08:10 귀가(수종 PC 사용 중): 아침 안 먹음(과자 조금 먹음)
08:30 샤워
09:15 집출발(자전거): 자전거 뒤에 수종 태움: 구로디지털역 => 신대방역 => 대림역 
09:45 서울 가정의학과 의원 방문 ==> 혈당 측정: 100
09:50 진료 ==> 의사가 당뇨약 3개월 처방은 안된다고 함(1개월 고집: 다른 병원 알아 볼 것, 5,400원)  
10:00 래미안 나나 약국 방문 ==> 조제(당뇨약 3개월치 조제(9,800원: 3일치)) 구입 
10:10 남구로 시장 방문 ==> 파래 김(6천원) 구입 
10:20 다이소 남구로점 방문 ==> 구경만 함
10:35 구로 이편한 치과 방문 ==> 수종 치아 염증 치료(10,500원) 구입
10:55 구로 DC 아울렛 방문 ==> 킵 칸칸(반찬통: 3칸, CIMELAX, 2,600원) 구입 
11:10 김밥 천국 방문 ==> 중식(치즈 돈가스(2개, 14,000원))
11:30 출발(자전거): 자전거 뒤에 수종 태움: 대림역=> 도림천=>  신대방역 => 신사 방법대 => 집) 
12:20 귀가 
12:30 실내 도보
13:40 종료
14:00 인터넷 서핑
17:20 맛닭고 신대방점 방문 ==> 갈릭 베이커(11,900원) 포장
17:35 귀가
17:50 석식
18:20 실내 도보
19:50 종료
20:00 집출발(자전거): 수종이와 걸어서 감: 신대방역 => 구로디지털역 4번 출구
20:10 수종이 맡기고 출발 
20:30 동원-추억 부산사랑 어묵1kg(5개[개당: 3,650원], 18,250원) 구입
20:40 귀가
20:00 샤워(수종)
21:00 인터넷 서핑
22:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.14(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
07:26 기상
07:40 조식
07:10 실내 도보 ==> 피곤해서 취침(몸상태 안 좋음: 감기 기운 있음)
12:39 다시 기상
13:00 중식
13:30 실내 도보
13:55 종료
14:10 샤워
14:20 인터넷 서핑
18:00 석식
18:30 도보(집 => 신사 방법대 => 신대방역 => 구로디지털역 앞[반환점] => 신대방역 => 신사 방법대 => 집) 
19:55 귀가 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 68.8kg ==> BMI: 23.81[표준 체중]) 
21:30 취침(몸이 안 좋아서 일찍 잠)
==============================================================================================================
 
- [서울시] 2022년 08월 주민세(개인분) (정기분) 납부
1. 카카오페이로 결제[오후 3:54] 결제가 완료
- 구매처: 서울시 이택스
- 상품명: 서울시지방세
- 결제일시: 2022.08.14 15:54
- 결제금액: 5,750원(일시불)
- 결제수단: 현대카드
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.15(월) ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 광복절  

- 광복절[★] 
07:00 기상(몸상태 안 좋음: 감기 기운 있음)
07:40 조식
07:00 도보(집 => 신사 방법대 => 보라매공원 => 신사 방법대 => 집) 
08:50 귀가 
09:00 샤워
09:30 인터넷 서핑
11:00 어묵(동원-추억 부산사랑 어묵1kg(5개)) 무침: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림
11:45 종료
12:00 중식
12:30 실내 도보
13:55 종료
14:10 인터넷 서핑 ==> 《이상한 변호사 우영우》 시청
18:00 석식
18:30 실내 도보(비 옴)
19:45 귀가
21:05 인터넷 서핑
22:00 종료
22:50 취침
==============================================================================================================
  
- "시청률 신기록" 찍으며 레전드 찍고 있는 《이상한 변호사 우영우》
https://youtu.be/dpWQBX3IWgc
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.16(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 코로나19 확진[8.16 신규 확진자: 180,803명]

- KB카드 Prj[★]
04:30 기상(몸상태 안 좋음: 감기 기운 있음)
04:45 조식
05:00 실내 도보
05:50 샤워
06:02 집출발
06:10 504번 버스(남서울중 정류장)
06:50 을지로입구역 정류장 하차
06:55 청계천 산책
07:30 KB국민카드 출근(7층)
08:40 김현삼 전무에게 8월 19일(금) 휴가 요청(쉽게 수락함)
09:10 개발자 미팅 ==> 서버 개발자들 AA 정인우 차장과 함께 웹 개발하라고 함: PM, 조성훈 과장 코로나19 확진 사실 통보 받음
10:50 서버 개발자와 정인우 차장 미팅: 코로나 19 의심자라고 쫓겨남
11:00 중식(GS25): 김밥
11:20 도보(종로2가 지하도 => 동대문역사문화공원역 => 시청역 => 남대문 => 서울역 => 서울역 선별 검사소)
		선별 검사소에서는 신속항원검사에게 2줄 나와야 만 PCR 검사해준다고 함(노기수 과장에게 속았음)
13:20 귀사
13:30 김현삼 전무에게 신속항원검사 기구 받음(5천원 상당)
13:35 화장실에서 테스트 ==> 신속항원검사 테스트기에서 2줄 나옴(양성 확실)
14:00 을지로입구역 정류장 도착 ==> 506번 버스 탑승
15:30 귀가
15:45 집출발(자전거)
15:55 H+ 양지병원 방문 ==> 문진표 적성(사람 많이 없음: 6번째)
16:00 코로나19 검사: 코로나19 검사비(10,300원 결제)
16:40 귀가
16:50 인터넷 서핑 ==> 자택 대기
18:00 석식
18:30 실내 도보
19:30 종료
19:40 인터넷 서핑
20:40 H+양지병원에서 코로나19 검사 결과(양성)으로 문자 보내줌 
20:50 김현삼 전무, PL, 김정현씨에게 양성 확진 문자 보냄
21:00 루옌에게 토요일 수종이 포항까지 데려다 달라고 부탁함: 수락함
22:30 취침
==============================================================================================================
 
- 코로나19 확진
[H+양지병원] 진태만(21063926)님 검사일자(20220816) 코로나19 PCR 검사결과 "양성"임을 알려드립니다. 
현 시점부터 동네 병의원 및 재택치료 의료상담센터에서 전화 상담·처방이 가능하며, 전화상담·처방이 가능한 의료기관 목록은 
건강보험심사평가원 누리집(www.hira.or.kr)에서 확인 가능합니다.
의료상담 외에 격리시 준수사항, 생활지원금 등과 같은 행정사항은 재택치료 행정안내센터로 문의하여 주시기 바랍니다.
보건소에서 재택치료시 자세한 행동 요령을 빠른 시일내에 안내할 예정입니다.
감사합니다.
==============================================================================================================
 
- 제목 코로나19 확진자 격리 통지 및 확진자조사 안내
[Web발신]
1. 귀하는 코로나19 검사 확진(양성, positive(+))으로 감염병예방법 제41조 및 제43조 등에 따라 격리됨을 통지합니다(45일 이내 이미 
확진 판정을 받은 경우에는 해당 없음). 코로나19 확진자는 감염병예방법 제18조에 따른 역학조사 대상이므로 다음 URL을 접속하여 
확진자 자기기입식 조사서를 작성하여야 합니다.
https://covid19m.kdca.go.kr/selfreport/11700068/173222786 (※ 제출 후 수정 불가)
- 격리대상자: 진태만
- 격리기간: 2022-08-16 ~ 2022-08-22 24:00 (단, 의료기관에서 PCR검사로 확진된 격리자의 격리해제일은 검체채취일을 기준으로 
7일이 되는 날임)
- 격리장소: 자가(입원환자는 병원)

2. 통지기관: 서울특별시관악구보건소 보건소장 (담당자 02-879-7133)
  * 격리명령 위반 시 1년 이하의 징역 또는 1천만원 이하의 벌금에 처해질 수 있으며, 동 조치에 대해 이의가 있으면 본 통지를 받은 
  날로부터 90일 이내에 행정심판이나 행정소송 등을 제기할 수 있습니다.

3. 격리대상자가 중증장애인, 영유아·아동(만11세 이하 또는 초등학생 이하) 등 돌봄이 필요한 경우 가족 등이 공동격리를 신청할 수 
있습니다.(돌봄대상자의 격리기간 내에 관할보건소에 신청)

4. 확진자와 동거인 안내문은 아래 URL에서 확인해 주세요.
   ※ (동거인 권고사항) 3일 이내 PCR검사, 6-7일차에 신속항원검사 / PCR검사 후 자택 대기 권고, 음성이더라도 10일 간 가급적 외출 자제
   * 확진자 및 동거인 안내문 https://c11.kr/wpv5
   * 소아 재택치료 증상별 대응요령 https://c11.kr/xl4y

5. 격리기간 중 발열 등 증상이 있는 경우 원스톱진료기관에서 대면진료 및 먹는치료제 처방을 받을수 있습니다.(포털사이트나 생활
안전지도 앱에서 “원스톱진료기관”검색)

6. 정부24(홈페이지 및 앱)에서 격리통지서 발급 및 생활지원비 신청이 가능합니다. 생활지원비는 기준중위소득 100% 이하 가구에, 
유급휴가비용은 근로자 30인 미만 사업장에 한하여 지원합니다.(격리해제후 90일 이내 신청)
  *생활지원비 및 유급휴가비용 지원 상세안내 https://url.kr/soeajz...
==============================================================================================================
 
- 포항행: 수종, 루옌
1. 22.08.20(토) 서울(13:00) -> 포항(15:33) KTX-산천 241[15호차 13C, 13D], 가격: 77,900원
==============================================================================================================
 
- 서울행: 루옌
1. 22.08.20(토) 포항(16:23) -> 서울(18:57) KTX-산천 248[6호차 3A], 가격: 53,600원
==============================================================================================================

 ■■■■■■■■■■■■■■■ 2022.08.17(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- KB카드 Prj[★]
- 통합 KB Pay에 추가할 "빌링 어드레스" 분석
==============================================================================================================

- Glbal Protect 설치 및 연결
https://itvpn.kbcard.com, MS07220, qwqw1212!! 
1. Glbal Protect 설치
2. VPN 접속
3. 필수 프로그램 설치 
 1) https://remoteworks.kbcard.com 연결
4. 클라우드 포탈 접속
5. 원격 접속 종료
==> 연결 성공(10:40)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.18(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- KB카드 Prj[★]
-
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.19(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- KB카드 Prj[★]
-
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.20(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- 주말[★] 
06:22 기상
06:50 조식
07:20 실내 도보
08:40 종료  
09:30 쌀 포대에서 쌀벌레 나옴: DIOS 통(3개 + 작은 통)에 쌀 20kg 모두 담아서 냉동실애 보관 
10:20  인터넷 서핑
12:00 중식
12:30 실내 도보 
13:00 포항행(수종, 루옌) 22.08.20(토) 서울(13:00) -> 포항(15:33) KTX-산천 241[15호차 13C, 13D], 가격: 77,900원 
13:40 종료
14:00 인터넷 서핑
18:00 석식 ==> 파래 김 가위로 잘라서 통에 담기
18:30 실내 도보
19:50 종료 
20:00 샤워
21:00 인터넷 서핑
21:10 수종이와 채팅: 고모가 포항역에서 마중나와서 미용실에 가서 이발하고 포항집에 잘 도착함
22:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.21(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- 주말2[★] 
06:15 기상
06:40 조식
07:10 실내 도보
08:35 종료 
09:00 샤워
09:30 인터넷 서핑
12:00 중식
12:30 실내 도보
13:55 종료
17:40 귀가
18:00 석식
18:30 실내 도보
19:45 종료 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 68.8kg ==> BMI: 23.81[표준 체중])
21:05 인터넷 서핑
22:00 종료
22:50 취침
==============================================================================================================

- 200조 자가면역질환 셀트리온 잡아먹는다.베그젤마 경쟁 상대 및 원가 경쟁력
https://youtu.be/MuTl8_Fqo9s
==============================================================================================================

- 한번 써보면 절대 못바꾸는, 인생 수세미 추천해 드릴게요~!
https://youtu.be/XX61N27ZsOI

- 다이소 꿀템으로 🚿싱크대 관리 이건 꼭 써보세요/ 이런 🧽수세미 추천 청소 뚝딱
https://youtu.be/IEXgzimv9Kc

- 요놈의 수세미 왜비쌀까?!!! [살림왕 옥주부]
https://youtu.be/6wTqEJ7UwhY
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.22(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 재택 근무(코로나19 자가격리, KB 카드)

- KB카드 Prj[★]
-
==============================================================================================================

- 구글 애널리틱스4 (GA4) 강의 1. 세팅 : GA4 계정 세팅[Plus Zero]
https://m.youtube.com/watch?v=t9X5WDni2_U&list=PLOuj_ONOVmzGvJnNlfLRy1acS7cOMz758&index=1

- 구글애널리틱스 그리고 GA4 깔끔 정리!
https://youtu.be/jN3g7fiqx8E
==============================================================================================================

- 다이소 보라매점 방문(20:50)
1. 쿨맥시 직사각 17호(8.5 L)(손잡이형, 3천원), 차량용 대나무 방석(40*40, 3천원: 식탁용), 아이리버 2포트 충전기 5핀(2.1A, 5천원)
손잡이 스텐레스 채반(소, 천 5백원), BH 스텐 조미료 통, 우레탄 수세미 2P(블랙, 천원) 구입
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.23(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 20:10 ==> 정상 출근(KB 카드), 중식(11:40, 제육볶음, 노과장, 백과장), 석식(18:20, 햄버거: 야근)

- KB카드 Prj[★]
-
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.24(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 21:00 ==> 석식(18:20, 돼지국밥: 야근)

- KB카드 Prj[★]
-
==============================================================================================================
 
- 오른쪽 눈 부움 치료
1. 예본 안과 의원(종로2가) 방문 ==> 진료(오른쪽 눈 부움 진료): 6,000원
2. 예플러스 약국(종로2가) 방문 ==> 처방(오른쪽 눈 부움 약(1주일치), 안약(4개)): 8,100원
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.25(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 노기수 과장 철수 회식(18:30, 종로 정육 식당)

- KB카드 Prj[★]
-
==============================================================================================================

- 노과장 철수 회식(18:30, 종로 정육 식당)
1. 이찬호 부장, 이화승 부장, 박상기 부장, 백승현 과장, 노기수 과장 --> 더치 페이(3만 2천원)
 1) 삼겹살, 라면
==> 2차(자담치킨:  이화승 부장,  백승현 과장, 노기수 과장 --> 노과장이 쏨
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.26(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 노기수 과장 철수(14:30)

- KB카드 Prj[★]
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.27(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 주말[★] 
06:30 기상(날씨 선선해짐: 가을 날씨)
07:05 조식
08:30 도보(집 => 도림 도보교 => 신림1교[반환점] => 관악 도림교 => 신림1교[반환점]  => 도림 도보교 => 집)
		: 신림1교 => 동방1교 수해로 공사 중
08:40 귀가
09:50  인터넷 서핑
12:00 중식
12:30 실내 도보
13:40 종료
13:50 인터넷 서핑
18:00 석식
18:20 도보(집 => 도보(집 => 도림 도보교 => 신림1교[반환점] => 관악 도림교 => 신림1교[반환점]  => 도림 도보교 => 집)
19:40 다이소 난곡 사거리점 방문 ==> 페리오 뉴 후레쉬 알파 치약 (190g, 5개, 5천원), 심직사각 숫돌(2천원) 구입
20:10 다이소 보라매점 방문 ==> 차량용 대나무 방석(40*40, 2개, 6천원: 거실, 책상 의자용) 구입
21:00 인터넷 서핑
23:00 취침
==============================================================================================================
  
- 유튜브 단축키
https://m.blog.naver.com/kimdoolae/221593218630
https://yeobie-kim.tistory.com/165
1. 소리 멈춤, 소리 시작: 스페이스바
2. 소리 높이기:  TAB키(2번 누름) + 방향키 ↑
3. 소리 줄이기: TAB키(2번 누름) + 방향키 ↓
4. 재생 속도 빠르게: shift + .
5. 재생 속도 느리게: shift + ,
6. 전체 화면: F(Full), 탭 화면: T(Tab)
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2022.08.28(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==>  

- 주말2[★] 
06:50 기상(날씨 선선해짐: 가을 날씨)
07:04 조식
07:20 도보(집 => 도림 도보교 => 신림1교[반환점] => 관악 도림교 => 신림1교[반환점]  => 도림 도보교 => 집)
08:50 귀가
09:20  인터넷 서핑
12:00 중식
12:30 실내 도보
13:40 종료
13:50 인터넷 서핑: Memo(2017.01) 작업
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:45 귀가 
20:30 청소(청소기, 밀대)
20:45 샤워(찬물: 체중: 67.9kg ==> BMI: 23.49[표준 체중])
21:00 PC 켜짐
21:05 인터넷 서핑
22:00 종료
22:50 취침
==============================================================================================================
    
■■■■■■■■■■■■■■■■■■ 2022.08.29(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> KB카드 Prj 철수(15시, KB카드 IT청계타워), 예술과 기술 김승현 전무에게 이력서 보냄

- KB카드 Prj 철수[★]
04:30 기상
04:40 조식
05:00 실내 도보 
05:50 종료
06:04 집출발
06:10 남서울중 정류장(504번 버스 탑승)
06:52 을지로입구역 정류장(하차)
06:55 청계천 도보
07:24 KB카드 출근
10:00 회의(김현삼 전무, 개발팀) ==> 1. 9월 1일 주간 보고 때 개발 완료 보고한다고 함, 2. IOS 개발 미흡, 3. 서버 개발자는 개발할
		건수 없음(계속 핸드폰으로 화면 목록 테스트만 하라고 함)
11:30 중식
11:45 도보(을지로3가역 지하 --> 동대문역사문화공원역)
12:40 종료
13:00 오후 근무
13:45 권승기 부장과 통화 ==> 철수하기로 결심함(내일 아침에 김현삼 전무에게 통보할 것) 
14:55 PL인 이찬호 부장이 공동인증서가 완료 되었으니 핸드폰으로 선불카드 테스트하라고 지시함 ==> 선물 카드 테스트 정보를
        요청함 --> 김현삼 전무가 테스트 데이터에서 찾아서 하라고 짜증을 냄 ==> 내가 회의실로 면담 욫어 ==> 서버 개발자로서 할 일
		없으면 철수 시켜 달라고 요청함 ==> 철수 합의 함 ==> SPC 나일도 전무에게 전화로 통보 ==> PL 이찬호 부장이 오늘 철수라고 함
17:00 KB카드 철수(백팩에 짐정리해서 나옴): 백승현 차장도 1주일 후 철수한다고 함
17:10 예본 안과 의원(종로2가) 방문 ==> 진료(오른쪽 눈 부움 진료): 5,500원
17:20 예플러스 약국(종로2가) 방문 ==> 처방(오른쪽 눈 부움 약(1주일치)): 4,900원
17:40 을지로입구역(지하철 탐승)
18:35 귀가
18:40 석식
19:00 실내 도보
19:35 예술과 기술 김승현 전무에게 전화 옴 ==> 잠실 롯데 렌탈 플젝에 9월 1일부터 투입시켜 준다고 함, 이력서 메일로 보내라고 함
20:45 종료
21:05 인터넷 서핑 ==> 이력서 메일로 보냄
22:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2022.08.30(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 하루 종일 비

- 자체 휴가[★] 
06:30 기상
06:50 조식
07:00 실내 도보
08:35 SPC 나일도 이사에게 문자 옴 ==> 농협 정보계 차세대(9월~2023.5), HIS 보험중개 보험중개시스템(Java Nexacro) 제안
08:50 종료
09:20  인터넷 서핑: Memo 작업
12:00 중식
12:30 실내 도보
13:40 종료
13:35 예술과 기술 김승현 전무에게 전화 옴 ==> 1. 잠실 롯데 렌탈 플젝는 주 사업자가 (주)소프트원인데 그쪽에서 나를 거부해서 취소됨
		 2. 종각쪽에 CJ 프로젝트(eXBuilder6[토마토]) 공통에 제안한다고 함
13:50 인터넷 서핑: Memo 작업
18:00 석식
18:30 실내 도보
19:45 종료 
21:05 인터넷 서핑: Memo 작업
23:20 취침
==============================================================================================================

- Memo 작업
1. Memo(2022.08).sql ~ Memo(2014.12).sql 작업
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2022.08.31(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 18:00 ==> 

- 자체 휴가2[★] 
06:45 기상
06:50 조식
07:10 실내 도보
08:50 종료
09:20 인터넷 서핑: Memo 작업
12:00 중식
12:30 실내 도보
13:40 종료
13:50 인터넷 서핑: Memo 작업 
14:02 노기수 과장과 통화 ==> 역삼역 근처 프로젝트 9월 4일(토) 출근예정: 공통, Batch 작업 개발 요청(힘든 프로젝트가 될 거라고
		노과장이 걱정 많이 함) 
14:22 SPC 나일도 이사에게 문자 보냄 ==> HIS 보험중개 보험중개시스템(Java Nexacro) Prj 830에 제안 요청 
18:00 석식
18:30 도보(집 => 도림 도보교 => 동방1교[반환점] => 도림 도보교 => 서원 도보교(시계 탑) => 도림 도보교 => 집) 
19:45 귀가
20:40 가계부 월말 결산(집)
21:05 인터넷 서핑
22:50 취침
==============================================================================================================

- 스프링 부트로 쉽게 배치 프로그램 만들기[Kenu Heo]
https://youtu.be/d-pGQRctmeY
==============================================================================================================
 
- 현대카드 간편인증 등록
1. https://www.hyundaicard.com/index.jsp, 033*0*
==============================================================================================================

- Memo 작업
1. Memo(2013.01).sql ~ Memo(2013.12).sql 작업
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 