

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+----------------------------------------------// Memo(2022년) //----------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 12월 주요 업무 ■■■■
- 모니터 구입  ==> 완료[♥♡]
1. 크로스오버 34LGD77 IPS 커브드 PREMIUM 멀티스탠드 가격: 392,000원
https://www.coupang.com/vp/products/6530646296
http://www.enuri.com/detail.jsp?modelno=85356270
=============================================================================================================
 
- 안방 책상 구입  ==> 완료[♥♡]
https://myg.gmarket.co.kr
http://www.enuri.com/detail.jsp?modelno=9189863
1. 소프시스 H형책상 1460, (티/화)H형, 가격: 94,600원
 1) 캐시충전결제(현금) 
=============================================================================================================
  
- 의자 구입  ==> 완료[♥♡]
[베스트 어워즈] 일루일루 라이트 G-지타이탄 게이밍 체어, 04.블랙(발받침O), 67,120원 
http://www.tmon.co.kr/deal/5649134806?isHistory=Y
http://www.enuri.com/detail.jsp?modelno=49550178

1. 듀오백 DK 2600, 가격: 172,000원
http://www.enuri.com/detail.jsp?modelno=960568

- 에이픽스 게이밍의자 GC001울프, 추천, 가격: 155,820원 ■■■  
http://www.enuri.com/detail.jsp?modelno=59997107
https://smartstore.naver.com/apixgaming/products/4537800837?
============================================================================================================= 

- 내과 병원 검색(3개월치 가능 병원)  ==> 완료[♥♡]
1. 최희정 내과 선택 ==> 건강 검진(10:30, 최희정 내과)
============================================================================================================= 

- 경매 배당(현아트빌 404호)  ==> 완료[♥♡]
 ============================================================================================================= 
  
- 소유권 등기(현아트빌 404호)  ==> 완료[♥♡]
 ============================================================================================================= 
 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 11월 주요 업무 ■■■■
- 경매 참여[22.11.10(목)]
1. 현아트빌 404호 2천 8천 만원에 낙찰 받음 ==> 완료[♥♡]
=============================================================================================================

- 안과 예약 ==> 완료[♥♡]
1. 22.11.12(토) 08:40  망막 검진(08:40, 누네안과병원) 예약
============================================================================================================= 

- 예금 분석
1.
============================================================================================================= 

- 모니터 구입 검토
1 크로스오버 34LGD77 IPS 커브드 PREMIUM 멀티스탠드 가격: 387,340원
http://www.enuri.com/detail.jsp?modelno=85356270
---------------------------------------------------------------------------------------------------

1. 디엑스 DX320HDMI [무결점], 가격: 168,160원
http://www.enuri.com/detail.jsp?modelno=79110957
---------------------------------------------------------------------------------------------------

- 35형 커브드 모니터 구입[2021.03.07(일)]
1. [주문번호 : 3462184048] KXG UNDERDOG QX352RC REAL 200 HOT, 가격: 387,000원
 1) 모니터|89cm(35인치)|커브드(1800R)|해상도:2560x1080(WFHD)|21대9|AMVA3패널(광시야각)|눈부심방지|LED백라이트|픽셀피치:
0.32025mm|밝기:250cd|명암비 2000:1|동적명암비 50만:1|주사율:200Hz|응답속도:4ms|sRGB(115%)|시력보호:로우블루라이트,
플리커프리|게임특화:게임모드,게이밍핫키,조준선표시,FreeSync|단자:DVI,HDMI,DisplayPort|스탠드:틸트(상하)|
VESA홀:100x100|소비전력:53W  ==> 입출력 단자: DL-DVI, HDMI(2.0), DP(1.2), HEADSET
http://www.enuri.com/detail.jsp?modelno=27279398
https://www.g9.co.kr/Display/VIP/Index/1776713216 
- 입출력 단자 케이블 교체[2021.06.27(일)]
1. 기존 HDMI 케이블 제거하고 35형 커브드 모니터 구입할 때 받은 DP 케이블 연결
=============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

- 10월 주요 업무 ■■■■
- 경매 분석 ==> 완료[♥♡]
============================================================================================================== 

- 01. AnyFrame E-Brain 로컬 PC에 설정 ==> 완료[♥♡]
D:\tnspmsEB\bin\eclipse-jee-2022-09-R-win32-x86_64\eclipse\eclipse.exe ==> 01. AnyFrame E-Brain
D:\AnyBuilder\bin\ide\eclipse-jee-64bit \eclipse.exe ==> 01. Anyfive
============================================================================================================== 

- eclipse에 boot dashboard 추가 ==> 완료[♥♡]
1. https://mimah.tistory.com/entry/Spring-Eclipse%EC%97%90%EC%84%9C-Spring-%EC%8B%9C%EC%9E%91%ED%95%98%EA%B8%B0
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 09월 주요 업무 ■■■■
- 집큰누나 가게 창고 앵글(선반) 작업 ==> 완료[♥♡]
- 수납선반 팬트리 모듈 다용도 미니 벽 랙 시스템 조립
https://smartstore.naver.com/lh/products/3429342100?

- 메탈선반 조립 동영상
https://youtu.be/Q8k_ODRB3Yw

- 선반 수납선반 다용도선반 모듈 3단 4단 5단 원터치 벽 폴딩 진열대 루마루 마리포사, 색상: 화이트 / 5단, 가격: 59,900원
https://smartstore.naver.com/adownpour/products/5992510201
==============================================================================================================

- 집큰누나 창고에 장판 구입 ==> 완료[♥♡]
1. 장판 크기 계산 ==> W384 * D75 * H270mm(2개)

- 편안애272k-10cm 셀프 바닥 시공 모노륨 친환경 장판 ==> 수량:80개, 주문금액: 95,000원
https://smartstore.naver.com/mat001/products/5083073250' 
1. 모노륨) 편안애272k(10cm 단위) 1,100원 ==> 수량: 80개, 총 상품 금액: 88,000원, 주문금액(배송비: 7천원): 95,000원
 1) 큰누나 미용실 주소: 포항시 북구 우현동 104-7 번지 대동상가 109호 꾀꼬리미용실
 포항시 북구 중앙로 419번길 16.109호 꾀꼬리 헤어

- 진양 모노륨 장판
https://smartstore.naver.com/mat001/category/38646c5b402848da93269577cfc7e56c?cp=1
==============================================================================================================

- QCY T13 구입(큰누나에게 선물)  ==> 완료[♥♡]
1. [무료배송_QCY 정품 블루투스이어폰 QCY T13+가죽파우치, 색상: 블랙, 가격: 20,040원  
http://www.tmon.co.kr/deal/8989328142?isHistory=Y
http://www.enuri.com/detail.jsp?modelno=68114337
1. 사용 시간(음악): 8시간 ==> 5분 충전: 약 1시간 재생(완충: 8시간 재생, 충전독: 30시간 사용), 용량: 380mAh(충전케이스)
==============================================================================================================
 
- USB 선풍기( 탁상용 선풍기 아이보우 IVDF-S400) 구입 ==> 완료[♥♡]
1. 제조사: 아이보우|브랜드: 아이보우|선풍기|스탠드형|탁상용|USB충전식|BLDC모터(브러시리스)|5엽날개|상하각도조절|좌우회전
 |바람세기:4단|안전망분리|최대소비전력:5W|3~12시간사용,4시간충전|크기:16.8 x 14.6 x 25.9cm, 가격: 14,990원
http://www.enuri.com/detail.jsp?modelno=38263252
http://www.lotteimall.com/goods/viewGoodsDetail.lotte?goods_no=12653524&infw_disp_no_sct_cd=40&infw_disp_no=0&allViewYn=N 
==============================================================================================================

- [로지텍 코리아] 로지텍 MK240 NANO 무선 콤보[블랙] [키스킨 포함], 블랙, 가격: 32,400원 ==> 완료[♥♡]
http://www.11st.co.kr/products/1187813726/share
==============================================================================================================
 
- JAVA 소스 정리
1.  
==============================================================================================================
 
- 마인드 맵 분석
1. 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 08월 주요 업무 ■■■■ 
- JAVA 소스 정리
1.  
==============================================================================================================
 
- 마인드 맵 분석
1. 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 07월 주요 업무 ■■■■  
- C언어, C# 공부 ==> 보류
1.  01. C언어 기초부터(rcLst, 나우캠퍼스 X 아워즈팜)
==============================================================================================================  
 
- 윈도우 7 부팅 USB 만들기(2022.07.16(토)] ==> 완료[♥♡] 
- 윈도우7&윈도우10 USB 부팅 디스크 만들기 - Create Bootable USB Drive for Windows[뇽자 TV]
https://youtu.be/4L8Fdy9l_9Q

- 윈도우7 부팅 USB 만들기 윈도우7 usb 설치 window7 usb dvd download tool
https://webserver1.tistory.com/13
==============================================================================================================

- 2021.05~10_농협 Memo 정리2022.07.03(일)] ==> 완료[♥♡]   
- 프로젝트에서 찍은 이미지 파일 OCR 작업
1. vFlat 어플에서 이미지 생성 ==> Documnets/vFlat 폴더에 생성됨
1) 2021.05~10_농협 Memo(폴더) 생성
2. 2021.05~10_농협 Memo(폴더) 압축하기
 1)  2021.05~10_농협 Memo.zip 파일로 생성됨
3. OCR 작업 및 내보내기( 2021.05~10_농협 Memo 폴더에서)
 1)  내보내기: 2021.05~10_농협 Memo.zip 파일: 내보내기 ==> 구글 드라이브: 선택 ==> 전송됨 
 4. 구글 드라이브 화면(웨일에서 오픈할 것)에서 ■ 05M_01.jpg 파일을 OCR 처리해서 한글화할 것
https://drive.google.com/drive/folders/1HcN0qEowkOZP1odGRCbvbpCWIM8KdFbw
 1) ■ 05M_01.jpg --> Memo(2021.05).sql
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 06월 주요 업무 ■■■■ 
- IRP 투자[2022.06.14(화)] @@@	 
No. 	 주식코드 	 주식명 	 					매입수량 	 매입단가 	 매입금액 	 		현재가 	 	평가금액 	 		평가손익 	 손익률(%) 
 1 	329650		KODEX TRF3070	 		280 	 		10,550 			2,954,000 	 	10,550 	 	2,954,000 			0 	0.00 			
 2 	360750		TIGER 미국S&P500	 	260 	 		12,200 	 		3,172,000 	 	12,300 	 	3,198,000 			26,000 			0.82 			
 3 	133690		TIGER 미국 나스닥100	 32 			65,490 	 		2,095,680 	 	66,280 	 	2,120,960 			25,280 			1.21 			
 4 	395400		SK 리츠	 					100 	 		6,680 	 		668,000 	 	6,720 	 	672,000 			4,000 			0.60 			
						합계 	 						672 	 		94,920 	 		8,889,680 	 	95,850 	 	8,944,960 	 		51,280 	   		   	   
		1.  안전자산■ 	 2,954,000 	 33% 	 2. 위험 자산■ 	 	5,990,960 	 	67%																 
==============================================================================================================
 
- USB 헤드폰 구입 검토
1.로 지텍코리아 H340 USB 스트레오 헤드셋 (정품), 가격: 44,500원
https://www.11st.co.kr/products/2992340902

2. 앱코 HACKER 가상 7.1 RGB 진동 노이즈 캔슬링 마이크 3D 초경량 게이밍 헤드셋: 29,750원
https://www.coupang.com/vp/products/6357733222
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 05월 주요 업무 ■■■■  
- 신한은행 일본 신단말 Prj 투입 ==> 2022.05.02(월) 완료[♥♡]
==============================================================================================================

- 2021년 귀속 종합소득세 신고 ==> 2022.05.13(금) 완료[♥♡]
1. 텍스나라에 홈페이지에서 신청
 1) 수수료 10만원
==> 2021년 귀속 연말정산(2022.01)도 같이 신청
==> 받을세금(국세: 1 854 000원, 주민세:185 400원): 총합:  2,039,400원
==============================================================================================================

- 삼성 Dex(덱스)
1. 핸드폰과 스마트TV연결: 핸드폰 어둡게됨
-------------------------------------------------------------------------------------------------------------------------------

 - 테블릿 Smart View 스마트TV 인식 못 함
 1. 갤럭시 탭 S7에서 Smart View 사용: 스마트TV 인식 못 함
 2. 갤럭시 노트9에서 Smart View 사용: 스마트TV 인식 가능
==============================================================================================================  
 
- 델 노트북 작업
 1. 델 노트북 무선 랜 설정 에러 분석
 2. 델 노트북 포맷할 것(윈도우 10 설치용 USB 지참)
==> 스피커, 이어폰 가지고 갈 것
==============================================================================================================  

- 마인드 맵 분석
0. https://www.youtube.com/results?search_query=%EB%A7%88%EC%9D%B8%EB%93%9C+%EB%A7%B5
0. 무료 마인드맵 프로그램 xMind 사용하는 방법 ==> https://mainia.tistory.com/2080
- 평생 썸거는 인생의 무기, 마인드 맵을 배워봅시다. - 필수 생산성 도구 마인드맵 활용법 소개[성장의 지도]
https://www.youtube.com/watch?v=ypKqiIftHLc

- 마인드맵을 활용한 독서법 || 우기의독서법[우기부기TV]
https://youtu.be/M57epJ9Z4qk
  
- XMind(마인드맵) 설치
1. 마인드맵, XMIND 디지털 마인드맵으로 [구기모의 스마트워크 #55]
https://www.youtube.com/watch?v=JWUHTQXPdUo
==============================================================================================================

- Mind Meister(마인드맵) 
1 온라인 마인드맵 ==> https://www.mindmeister.com/ko
2. 온라인 마인드맵 - 마인드마이스터(MindMeister) 사용법 (한글자막)  ==> https://www.youtube.com/playlist?list=PLe0Fej9AMKkTTiK_0SOA1_nFO0JqWaJUS
==============================================================================================================

- 다운로드 XMind 8 한국어 버전 설치
1. xmind-kr-8-update7-windows.exe 설치
2. 무료 마인드맵 프로그램 xMind 사용하는 방법
 1) https://mainia.tistory.com/2080
3. XMind 제1강 토픽의 생성과 삭제 
 1) https://www.youtube.com/watch?v=-XHajenPW9g&list=PLZoZYL6CMKQIcvyCaNydPyI0rRfS-wbFx&index=1 
4. XMind 제1강 토픽의 생성과 삭제 마인드맵 ==> https://www.youtube.com/watch?v=JWUHTQXPdUo
5. # 마인드맵으로 글을 쉽게 써 보자[공심재] ==> https://www.youtube.com/watch?v=55G6qGLMNto&feature=youtu.be 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


- 2022.01 주요 업무 ■■■■ 
- Git 설정[2022.01.08(수)] @@@  ==> 완료[♥♡] 
==============================================================================================================================

- Websquare 소스 정리 @@@ 
==============================================================================================================================

- 2021.05~10_농협 Memo 정리 @@@
1. 
==============================================================================================================================  

- 경매 분석 @@@ 
1. 현아트빌 404호
==============================================================================================================================
 
- 스켈링 분석 @@@
1.  
==============================================================================================================================

- 이더리움 분석 @@@ 
1.  
==============================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 02월 주요 업무 ■■■■  
- LG에너지솔루션 공모주 수익금 신한은행 계좌로 송금
1. KB증권(종합위틱): 556-857-234 01: 계좌비밀번호: 03**에서 신한은행 계좌로 475,334원 송금(175,334원 수익)
==============================================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 


- 03월 주요 업무 ■■■■ 
- 01. 경력기술 프로필(진태만) 작성[2022.03.26(토)] ==> 완료[♥♡]  
01. 경력기술 프로필(진태만).doc
02. 이력서_20220326(잡코리아).doc
==============================================================================================================
 
- 2021.05~10_농협 Memo 정리 @@@
1. 
==============================================================================================================   

- 크롬, 브레이브 브라우저: 북마크 동기화 설정
1. 
----------------------------------------------------------------------------------------------------------------------------------

- 브레이브 브라우저 동기화
https://kin-archive.tistory.com/421
==============================================================================================================   

- 퇴직 연금 IRP 투자
1. 연간 700만원 투자, 펀드에 70% 투자
==============================================================================================================
 
- 한화손보 질병 보험금 청구 작업: 총 4건 접수 완료[2022.03.13(일)] ==> 완료[♥♡]  
- 의료 실비 등록(17시, 집) @@@
- 실비 보험 청구서 작성(회사, 집) [2022.03.13(일)]   
접수번호 :  
접수일자 : 2022.03.13
사고(진단)일자: 2021.04.17 ■■■
피보험자 : 진태만
청구유형 : 질병
청구금액: 
청구내용: 982,320원(234,750원, 747,570원) 
2021.02.06 지병인 당뇨 막망증 치료한 것에 대한 실비 보험을 청구합니다. 
-------------------------------------------------------------------------------------------------------------------------------

- 보험금청구결과조회
https://www.hwgeneralins.com/fplaza/compensation/result01.do
-------------------------------------------------------------------------------------------------------------------------------
  
- 한화손해보험 앱 설치[2022.03.09(수)] ==> 완료[♥♡] 
1. 카카오페이 공인인증서 발급 ==> 2020오*h@
https://play.google.com/store/apps/details?id=com.hanwhalife.hiw&hl=ko&gl=US
============================================================================================================== 
 
- 반바지 구입 ==> 완료[♥♡] 
- [스마트스토어] 축구반바지 축구바지 운동복바지 4부바지 주머니있음: 선택 01-0603 + 85, 선택 03-0650 + 85), 가격: 18,710원	
https://smartstore.naver.com/danchebok/products/4266881217 
https://search.shopping.naver.com/catalog/22347310112?cat_id=50005247

- 반바지 구입(이전: 판매 종료됨)
1. 축구 반바지(택01) 캡스록 4부 무지: 블랙/105(2XL], 네이비/85(S)), 가격: 14,460원
http://www.enuri.com/detail.jsp?modelno=14113634&cate=&IsDeliverySum=N
http://item.gmarket.co.kr/detailview/item.asp?goodscode=682782971 
==============================================================================================================
 
- PC에 SW 설치
1. SW 설치
2. DB 설치
==============================================================================================================
 
- 스마일클럽-연회비(3만 5천원)
https://canopus1204.tistory.com/entry/스마일클럽-연회비 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 
- 04월 주요 업무 ■■■■ 
- 미래에셋 IRP 투자 분석[2022.04.22(금)]
- IRP 계좌개설 쉽게 따라하기 (ft.상품매수, 한도변경) [할미 언니]
https://youtu.be/Nch1hMk09b0

- [ETF마스터] KINDEX, TIGER 미국 S&P 500 ETF 매일 1주씩 매수했을 때 수익률이 더 높은 것은? 
https://youtu.be/-_4Ya2d0-Gk
==============================================================================================================
 
- SK리츠 분석. 본격적으로 분기마다 배당주는 시대 도래!!
https://youtu.be/AuajZRMxyKw
 =============================================================================================================

- 미래에셋 IRP 투자 분석
1. 예금, SK 리츠, S&P 500(분할 매수)
 1) IRP 900만원 세금 공제 가능
==============================================================================================================
  
- 안방 커텐 구입 및 설치  ==> 2022.04.06(수) 완료[♥♡] 
- 코멧 홈 단열 아일렛 암막 커튼, 다크블루 (작은 창문용), 135 x 170 cm, 색삭: 다크 블루, 가격: 21,280원(안방 창문용)
https://www.coupang.com/vp/products/180352941?vendorItemId=70296014932&isAddedCart=
1. 안방 창문 크기(120*120cm)
==============================================================================================================

- 고추장 어묵 볶음 반찬 요리(09시, 집)  ==> 2022.04.09(토) 완료[♥♡] 
[재료]
어묵 6장(600g),  고추 3개, 양파 1개 반, 홍당무 1개
[양념]
고추장 3숟갈, 올리고당 3숟갈, 다진 마늘 3숟갈, 진간장 1숟갈, 설탕 1숟갈, 참기름 1숟갈
1. 커피 포트에 끓인 뜨거운 물애 어묵 잠깐 담궜다고 차가운 물에 담그기(어묵 연해짐)
2. 그릇에 양념장 재료 넣고 양념장 만들기
3. 불을 켜고 후라이팬에 참기름에 3숟갈 넣고 양파, 홍당무 볶기
4. 어묵 넣고 볶기
5. 불을 끄고 참기름 넣기
--------------------------------------------------------------------------------------------------

- 매콤하고 맛있는 고추장 어묵 볶음 이젠 쉽게 만드세요[엄마의 손맛]
https://youtu.be/i4hs5n_kMFA
[재료]
어묵 4장, 쪽파 5줄, 고추 3개, 양파 반개
[양념]
고추장 2숟갈, 미림 3숟갈, 진간장 1숟갈, 설탕 1숟갈, 참기름 1숟갈, 참깨 1숟갈

- 어묵요리[고추장 어묵 볶음] 절대 불지 않는 찰지고 보들 보들한 밑반찬 오뎅 볶음[양장금 주부]
https://youtu.be/BX7aqR2OD6s
[재료]
어묵 300g, 청양고추 2개, 홍고추 2개, 대파 1뿌리, 양파 작은것 반개, 식용유
[양념]
고추가루 1큰술 반, 고추장 1큰술, 진간장3 큰술, 생수 5큰술, 맛술 2큰술, 양파청 2큰술, 조청 1큰술,마늘 1큰술, 들기름 1큰술, 통깨 약간

- 알콩달콩 어묵볶음 | 함께 요리해요 | 영자씨의 부엌
https://youtu.be/UI27VK5Os2Y

- 매운 어묵 볶음. 저희 집에선 이렇게 해먹어요~ [쿡피아]
https://youtu.be/7jZbrCDlz_4
[준비재료]
어묵(동그란어묵, 막대어묵, 사각어묵) 300g
대파 1/2대, 양파 1/2개,
붉은 고추 1/2개, 청양고추 1/2개 
(양념장)
식용유 3큰술, 간장3큰술, 고춧가루 1과1/2큰술,
다진 마늘 1큰술, 맛술 2큰술, 설탕 1큰술,
통깨 1큰술 

- 평범한 어묵볶음에 유부를 추가하면 벌어지는 일 [귀열이네 반찬가게]
https://youtu.be/RVea64HeNy0
============================================================================================================== 
 
- 브레이브 브라우저 동기화(북마크: 즐겨찾기) ==> 2022.04.01(금) 완료[♥♡] 
https://iboxcomein.com/brave-browser-synchronization
1. TAMA-HAART-404 (이 장치) (태만 PC)
sign amount balcony tell sleep remember enable smooth gauge state search clerk naive tribe client creek flat ski alien husband royal best grace alien
2. SM-N960N(갤럭시 노트9: 태만 폰)
3. SM-T733(갤럭시 탭 S7 FE)
==============================================================================================================   

- 한화손보 질병 보험금 청구 작업: 총 4건 접수 완료[2022.04.09(일)] ==> 완료[♥♡]
- 의료 실비 등록(17시, 집) @@@
- 실비 보험 청구서 작성(회사, 집) [2022.04.13(일)]   
접수번호 :  
접수일자 : 2022.04.13
사고(진단)일자: 2021.04.17 ■■■
피보험자 : 진태만
청구유형 : 질병
청구금액: 
청구내용: 982,320원(234,750원, 747,570원) 
2021.02.06 지병인 당뇨 막망증 치료한 것에 대한 실비 보험을 청구합니다. 
-------------------------------------------------------------------------------------------------------------------------------

- 보험금청구결과조회
https://www.hwgeneralins.com/fplaza/compensation/result01.do
============================================================================================================== 

- PC에 SW 설치
1. SW 설치
2. DB 설치
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
 


■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

==============================================================================================================
■1. OX ↑↓ ↔  ⇒ ⇔  ==> 완료[♥♡]  ==> 개발 중[☞☜]＃＆＠ § ※ ☆ ★ ○ ●◎ ◇ ◆ □ ■ △ ▲ ▽ ▼  〓 ◁◀ ▷▶♤♠♧ ♣ ╊ ■
==============================================================================================================