

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2010.12) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2010.12.01(수) 작업 ■■■■■■■■■■■■■■■■
---> 07:00 ~ 18:30   --> 현대해상 달력, 수첩 수령, 주간보고서 작성, CS회의

- 현대해상 SM
- P20101201-0015[현대자동차 제휴 할인 이벤트 작업의뢰서]
현대자동차 프로모션: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
/happyplus/joinsale/servlet/ContractSearchSvt.java 파일에서
public String isAnyContractExist(String rsn_no) throws Exception {
}
-------------------------------------------------------------------------------------------------------
김희진 사원:  ==> 이행일자: 12.07(화), 오픈일자: 12.08(수) 
무궁화삼천리(680817-1348411) ===> C1201-0000001 

1. 현대자동차 제휴 할인 이벤트: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
2. 쿠폰 인쇄하기(Pop up): http://thome.hi.co.kr/events/hdcar_coupon/promtion_pop.jsp
3. 클릭i e서비스: http://thome.hi.co.kr/hiplanner/clickeservice/coupon.jsp?empNo=307385
4. 쿠폰 출력 여부 조회: /event/hdcarcoupon/dao/hdcarcouponDao.java
5. 계약존재 여부 조회: /happyplus/joinsale/servlet/ContractSearchSvt.java
==============================================================================================================

- DB 테이블 생성 요청
1. 현대차쿠폰이벤트 테이블(HDCAR_COUPON)
→ 쿠폰 출력한 고객명(polhdrPtyKorNm: 계약자명) / 주민번호 / 쿠폰번호 DB저장

번호	SEQ_NO	NUMBER(22,0)
고객명	HNAME	VARCHAR2(20)
주민번호	JUMIN	VARCHAR2(13) 
쿠폰번호	COUPON_NO	VARCHAR2(20)
쿠폰구분	COUPON_GB	VARCHAR2(1)
등록일자	REG_DATE	DATE
수정일자	UP_DATE	DATE

SELECT    (SELECT (NVL(MAX(SEQ_NO),0)+1) FROM HDCAR_COUPON A) SEQ_NO,
		('C'|| TO_CHAR(SYSDATE, 'MMDD') ||'-'|| 
		LPAD((SELECT(NVL(TO_NUMBER(SUBSTR(A.COUPON_NO,7,13)),0)+1)  FROM HDCAR_COUPON A 
		WHERE A.COUPON_GB = 'C'  AND TO_CHAR(A.REG_DATE, 'MMDD')  = '1202')),7, '0')) AS COUPON_NO
FROM DUAL  //---> COUPON_NO MAX값 설정
;
 
쿠폰번호 예시  =====> 고객용 : C1201-0000001
1201: 12월 01일 등록
000001: 12월 01일 생성한 쿠폰 번호(고객용, 하루 999,999까지 생성 가능) 
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.02(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30   --> 아침시스템 당번, 책상에 고무판 설치(2개 9,000원)

- 현대해상 SM
- P20101201-0015[현대자동차 제휴 할인 이벤트 작업의뢰서] 
김희진 사원:  ==> 이행일자: 12.07(화), 오픈일자: 12.08(수)
1. 현대자동차 제휴 할인 이벤트: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
2. 쿠폰 인쇄하기(Pop up): http://thome.hi.co.kr/events/hdcar_coupon/promtion_pop.jsp
3. 클릭i e서비스: http://thome.hi.co.kr/hiplanner/clickeservice/coupon.jsp?empNo=307385
4. 쿠폰 출력 여부 처리: /event/hdcarcoupon/dao/hdcarcouponDao.java
5. 계약존재 여부 조회: /happyplus/joinsale/servlet/ContractSearchSvt.java
==============================================================================================================

 - 메뉴 이름 수정: /xml/newxml/HI_NAV_XML.xml파일 수정(/Appl/hib2c/docs/xml/newxml)
 - 상해/질병/재물보상 -> 상해/질병/재물/배상책임
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.03(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30   --> 회식(인터넷 파트)

- 현대해상 SM
- P20101203-0020[장기 일반 사고접수 개선] 이행 완료 
===> 자원: 2개(JSP: 2) --> (JSP: 4)(산출물 포함) ==> 총 4개
1. 사고접수가능계약조회(일반보험): /amends/damage/care/accident_takeJubsuList_i.jsp
2. 피보험자사항(일반보험 피보험자 확인 에러): /amends/damage/care/accident_takePiboList_i.jsp
 1) 테스트 확인: 8001282017714(일반보험) 
==============================================================================================================

- EDMS 이미지 전송
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
3. 전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp
- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/132.gif
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
==============================================================================================================

 - DB 테이블 생성 요청(운영계) 요청
1. 현대차쿠폰이벤트 테이블(HDCAR_COUPON) 
==============================================================================================================

- 장기사고접수 계약조회 테이블 칼럼 변경 작업
1. 금일(12.03(금)) 21시 30 ~ 22시(30분 가량 예상)
2. EVENT 사건, EVENT_PRACPT 사건가접수 테이블 칼럼 변경 
- 사건가접수 저장 인터페이스 ID(CLRF0100M01I(가접수저장), CLRF0100M02I)
- 상해질병 사고접수 -> 윤종규 사원(보상손사팀): T)721-0265
==============================================================================================================

- 인터넷 파트 회식
18:30 퇴근
18:50 이비스 앰배서더 명동호텔 부페(19층)(인터넷 파트 전원)
18:55 저녁 
21:00 종료
22:00 귀가
23:00 취침(속독 연습 안함)
==============================================================================================================
						
■■■■■■■■■■■■■■■■■■ 2010.12.04(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00
 
- SFR(8째주)
08:00 기상
08:30 속독 연습(금요일 분)
10:30 종료
12:00 중식
13:10 Super Fast-Reading 학원
14:00 강의(혼자 함)  ==> TIME ART STOP WATCH 구매(정성락 기술사에게 구입: 19,000원) --> 열심히 한다고 스피드 인주 선물 받음
17:30 저녁(컵라면 밥)
18:00 강의(흐뭇 --> 느긋)  ==> 독법반 3명과 함께 교회에서 강의함(목사님이 독법 과정 권유)
19:30 종료
20:20 귀가
==============================================================================================================

- 포항집에서 연락없이 김치 택배 보내옴
기업은행 167 08440802 017 이태훈 11000원(H: 010-5650-0433)
==============================================================================================================
		
■■■■■■■■■■■■■■■■■■ 2010.12.05(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00 

▦조기축구
07:40 기상
08:30 신구초등학교
08:50 게임(0:1 패)
10:00 정기 총회(이영민 회원이 차기 회장 당선(비밀 투표))
10:40 게임(0:2 패)
11:20 종료
12:30 문경세제(중식)
12:30 종료
13:30 Super Fast-Reading 학원
14:00 강의 ==> 편함(미소)
17:30 저녁(컵라면 밥)
18:00 강의(5': 114.63P)
19:10 종료
19:30 귀가
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.06(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 18:30

- 현대해상 SM
- EDMS 이미지 전송
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
3. 전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp
- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/132.gif
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
EDMS IP: 144: 개발, 145: 검증
==============================================================================================================

- EDMS 이미지 전송 관련 회의
1. 이규희씨, 정대리님
2. 10:00 ~ 10:30 18층 IT 개발팀
3. EDMS Server Regist Port가 안 열린 것으로 추정됨
==============================================================================================================

- 자동차보험가입증명서(사이버창구 --> 교통사고사항 및 지급결의확인서)
http://thome.hi.co.kr/servlet/hi.cybercenter.motor.servlet.MIC01AGServlet?q=7F000001
(/cybercenter/certifycenter/trafficAccidentView.jsp)
01. 사고접수가능계약조회(장기보험): /amends/damage/care/accident_takeJubsuList.jsp
1. /cybercenter/motor/servlet/MIC01AGServlet.java(파일에서 호출
현재는 종결시에 피해자에게 발송되는 발행물을
향후에는 종결시에 피해자, 피보험자에게 각각 발행물이 발송되도록 해달라는 내용 입니다.(피보험자 추가)
-----------------------------------------------------------------------------------------------------

1. IR_HI-HOME_0070(교통사고사항리스트)에서
1) 요청 전문
<reqDmgobjCd2>7908042019411</reqDmgobjCd2>  //피해자 주민번호
<evntOccrDt12>20071120</evntOccrDt12> //사고일자
2) 응답 전문
//피해자 주민번호로 보상 피해자 조회
---------------------------------------------------------------------------------
2. 수정된 IR_HI-HOME_0070_Edit(교통사고사항리스트) 에서
1) 요청 전문
<reqDmgobjCd2>7908042019411</reqDmgobjCd2>  //로그인 주민번호
<evntOccrDt12>20071120</evntOccrDt12> //사고일자
2) 응답 전문
//로그인 주민번호로 보상 피해자 또는 피보험자를 조회
담당자: 조영우 사원(보상손사팀): T)721-0256
고상태 팀장(보상손사팀): T)721-0266, 홍광기 과장(보상손사팀): T)721-0139
---------------------------------------------------------------------------------
보상 피해자: 서열 기준
피보험자: 사고 기준
서열 기준으로 바꾸어서 개발(새로운 전문 생성), 조회 구분자 필요
담당자: 이경원 사원(개발팀): T)0310
==============================================================================================================

- 통합채널팀 즐겨찾기: http://ts.hi-banca.co.kr/error_tip/banca_index.jsp
==============================================================================================================

- TNS:작동이 중단중 에러
현상: Attempting to contact (ADDRESS=(PROTOCOL=TCP)(HOST=10.18.12.38)(PORT=1588))
TNS-12535: TNS:작동이 중단중입니다 
원인: 오라클이 설치된 XP에서는 TNSPING 또는 SQLPLUS 접속이 원활이 진행되나 다른 원격지 컴퓨터에서 
오라클이 설치된 XP(방화벽)에 접속할경우 "TNS-12535 TNS 작동이 중단입니다" 라는 오류 메시지를 만나게 된다
조치: PC 재시작
--------------------------------------------------------------------------------------------------------
- 통신 채널에 EOF 에러
Connection to 'home_test' failed
ORA-03113: 통신 채널에 EOF 가 있습니다
조치: NAT Control 재시작할 것
==============================================================================================================

- 명동호텔 부페(석식) 식비 송금
국민은행: 878301-01-090624, 권오득 34,650원
- 중식(삼성공제회관: 3,000)
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.07(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30  --> 주간보고서 작성

- 현대해상 SM
- P20101201-0015[현대자동차 제휴 할인 이벤트 작업의뢰서] 이행 완료
===> 자원: 5개(JSP: 3, JAVA: 2) ==> (JSP: 6, JAVA: 4, CLASS: 2)(산출물 포함) ==> 총 12개
-------------------------------------------------------------------------------------------------------
0. 메인: http://thome.hi.co.kr/portal/index.jsp
1. 현대자동차 제휴 할인 이벤트: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
2. 쿠폰 인쇄하기(Pop up): http://thome.hi.co.kr/events/hdcar_coupon/promtion_pop.jsp
3. 쿠폰 출력 여부 조회: /event/hdcarcoupon/dao/hdcarcouponDao.java
4. 계약존재 여부 조회: /happyplus/joinsale/servlet/ContractSearchSvt.java
5. 메인 서브 배너: /inc/newinc/quickmenu_main.jsp
-------------------------------------------------------------------------------------------------------
 
- 삭제됨, 트리 충동(hdcarcoupon  처음부터 제대로 할 것)
(/FG70-PROGRAM설명서_JAVAClass\WEB-INF\classes\hi\event/hdcarcoupon)
1. 해결책: 충동해결
-------------------------------------------------------------------------------------------------------

- Xeure 팝업(보안)
function openCoupon() {  //쿠폰 인쇄하기 함수()
	var f =document.theForm;
	var p_url = "/events/hdcar_coupon/promtion_pop.jsp&p_coupon_print_time="+ cnt_time_3 +"";
		p_url += "&p_coupon_gb="+ f.p_coupon_gb.value +"&jumin_no="+ f.jumin_no.value 
		+"&p_coupon_print_yn="+ f.p_coupon_print_yn.value +"";	
		p_url += "&p_hname="+ f.p_hname.value +"&get_coupon_no="+ f.get_coupon_no.value;
  
	window.open("/common/xecurelinks.jsp?xecure=true&redir="+ p_url +"", "hdcar_coupon_pop", 
		"width=594px,height=505px,left=550px,top=120px,status=no,scrollbars=no,resizable=no");  //Xeure 팝업 
}
==============================================================================================================

- EDMS 이미지 전송
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
3. 전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp
/amends/servlet/EdmsClient.java

- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/132.gif
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
-------------------------------------------------------------------------------------------------------

- EDMS Server Port 확인(김수호 대리)
>  telnet 10.2.11.144 18771
> action=Permit sent=348 rcvd=216 src=10.18.12.84 dst=10.2.11.144 src_port=34202 dst_port=18771
==============================================================================================================

- 채널서비스팀 캘린더 개발
1. 일정 캘린더 개발
2. 당직 현황 개발((2010-09-28) 2010년 당직표10월.xll)
3. 작업일정표 개발(2010년 4월 작업일정_통합채널팀.xll)
4. 기타
 가) 달력 소스 ==> ew_web_diary.zip(http://www.okjsp.pe.kr/seq/37249) 
==============================================================================================================

- 추천 도서(이주일 부장)
1. 소공: 소프트웨어소학/최은만/정익사(보유)
2. DB: 데이터베이스시스템/이석호/정익사(보유)
3. CA: 방통대에서 나온 컴퓨터 구조
4. ITIL기반의 IT서비스 관리 ISTM / 네모
5. 경영 경영혁신을 위한 IT거버넌스/네모(보유)
6. 소프트웨어 아키텍처 이론과 실제/에이콘
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.08(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30  --> CS 회의(TM 명명 규칙)

- 현대해상 SM
- EDMS 이미지 전송
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
3. 전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp
-------------------------------------------------------------------------------------------------------

/deca/client/EdmsClient.java 파일에서
if(filespec[i].getOrgFileName().lastIndexOf(".")!=-1) {
	filespec[i].setImgFileName(infspec.getIndexKey()+"_"+
	EdmsSocketUtil.concatZeroLeft(4,Integer.valueOf(i+1).toString())+filespec[i].getOrgFileName().substring
	(filespec[i].getOrgFileName().lastIndexOf("."),filespec[i].getOrgFileName().length()));       
}
 
발생한 예외 : javax.servlet.ServletException: java.lang.Integer: method valueOf(I)Ljava/lang/Integer; not found
Integer.valueOf(i+1).toString())
==============================================================================================================

--주민번호 별표 보이게 하기(Orange에서는 불가능)
SELECT decode(A.JUMIN, '한국', '') as 주민번호_0, A.JUMIN as 주민번호
FROM HDCAR_COUPON A 
;
==============================================================================================================

- P20101208-0005[현대자동차 제휴 할인 이벤트 추가 요청 사항]
1. 현대자동차 제휴 할인 이벤트: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
2. 첫번째 칸은 한글로 디폴트
3. 두번째 칸(주민번호 앞자리) 입력 후 자동으로 세번째 칸으로 커서 넘어가게 설정 
==============================================================================================================

- PSM 비밀번호 변경
1. PSM 비밀번호: s*j**201001   ===> 주기적 변경 해야 함
http://im.hi-portal.co.kr/IM/user/hmuser/HMUserAuth.jsp?type=LP
실서버 관리자: http://homeadmin.hi.co.kr/portal/index.jsp
실서버 백도어: http://www.hi.co.kr/secure/secureDoor.jsp 
==============================================================================================================

- 향후 예상 작업 목록
1. 교통사고사항 및 지급결의확인서 작업 
 - 종결시에 피해자, 피보험자에게 각각 발행물이 발송
 - CIS 전문 수정 요청(손사보상팀 CIS 작업 완료 후 작업 예정)
 - CIS 담당자: 조영우 사원(보상손사팀): T)721-0256
 - 보상손사팀 일정(예정): 2010.12.08(목) ~ 다음주 초 완료 예정
 - 예상 일정: 2010.12.20(월) ~ 24(금)

2. 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리
 - CIS 작업 완료 후 작업 예정
 - CIS 담당자: 김희수 과장(개발팀): T)721-0314 

3. 가상FAX 번호 작업
 1) 사고접수시 구비서류접수 FAX 전송(FAX 번호가 1개라서 혼란스러움)
    ==> 수정: 접수번호를 기준으로 가상FAX번호 생성(관리자화면에서 가상FAX번호로 사고접수 처리)
 2) CIS 담당자: 윤종규 사원(보상손사팀): T)721-0265 
 3) CIS 담당자 예상 일정: 12월 27일(월) ~ 3주
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.09(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30

- 현대해상 SM
- P20101208-0005[현대자동차 제휴 할인 이벤트 추가 요청 사항] 이행 완료
===> 자원: 2개(JSP: 4) ==> 총 4개
1. 현대자동차 제휴 할인 이벤트: http://thome.hi.co.kr/events/hdcar_coupon/promtion_main.jsp
2. 첫번째 칸은 한글로 디폴트
3. 두번째 칸(주민번호 앞자리) 입력 후 자동으로 세번째 칸으로 커서 넘어가게 설정
==============================================================================================================

- 채널서비스팀 캘린더 개발
1. 일정 캘린더 개발
2. 당직 현황 개발((2010-09-28) 2010년 당직표10월.xll)
3. 작업일정표 개발(2010년 4월 작업일정_통합채널팀.xll)
4. 기타
 가) 달력 소스 ==> ew_web_diary.zip(http://www.okjsp.pe.kr/seq/37249) 
 나) 접속 테스트: http://localhost:8088/
 다) 게시판: http://localhost:8088/error_tip/tip_index.jsp --> (아이디: banca123)
 일정 캘린더: http://localhost:8088/calendar/index.jsp
-------------------------------------------------------------------------------------------------------

- eclipse에서 Tomcat v5.0 설정 방법
1. Eclipse SDK 3.4.0(구글 안드로이드(Android)) 사용(C:\eclipse폴더에 설정)
2. Window --> Open Pespective --> Other: Servers(클릭)
3. Servers(안에서) --> New: Server
4. New Server(새창이 뜸)
 1) Apache: Tomcat v5.0 Server(선택)
   --> Servers Name: Tomcat v5.0 Server at localhost
   --> Servers runtime enviroment: Apache Tomcat v5.0(Add도 확인할 것)
 2) Finish
5. 환경 파일 처리
 1) hibanca\hibancaWeb\config폴더 3개 파일(db.properties, application.properties, configuration.properties) 복사
 --> C:\eclipse 폴더에 붙어넣기
 2) C:\tomcat5.0-hibanca\conf/server.xml 파일복사
 --> C:\workspace\Servers\Tomcat v5.0 Server at localhost-config 폴더에 붙어넣기

Project Name: hibanca --> Directory(Workspace명과 동일): C:\workspace\hibanca ===> http://localhost:8088/calendar/index.jsp
Project Name: cis-hi-b2c --> Directory(Workspace명과 동일):: C:\projects_2  ===> http://localhost:8088/portal/index.jsp
- Workspace 설정: File --> Switch Workspace --> other: Workspace Launcher(새창이 뜸) 
Workspace: C:\workspace\hibanca --> OK
==============================================================================================================

- EDMS 이미지 전송
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
-------------------------------------------------------------------------------------------------------
/deca/client/EdmsClient.java 파일에서
String strCnt = "";  //횟수 
for(int i=0; i<filespec.length; i++) {
	strCnt = ""+ (i+1); //횟수
	//filespec[i].setImgFileName(infspec.getIndexKey()+"_"+
	EdmsSocketUtil.concatZeroLeft(4,Integer.valueOf(i+1).toString())+filespec[i].getOrgFileName().substring
	(filespec[i].getOrgFileName().lastIndexOf("."),filespec[i].getOrgFileName().length()));
	filespec[i].setImgFileName(infspec.getIndexKey()+"_"+
	EdmsSocketUtil.concatZeroLeft(4, strCnt)+filespec[i].getOrgFileName().substring
	(filespec[i].getOrgFileName().lastIndexOf("."),filespec[i].getOrgFileName().length()));
}
 
- 발생한 예외 : javax.servlet.ServletException: java.lang.Integer: method valueOf(I)Ljava/lang/Integer; not found
Integer.valueOf(i+1).toString())   ===> strCnt = ""+ (i+1);로 변경 처리함
-------------------------------------------------------------------------------------------------------

CM09020000IA13080020101209173147908   --> TEST 
CM09020000IA13080020101208154608952   //EDMS서버에서 이미지키를 생성 TEST  ====> 
==============================================================================================================

- USB 사용 방법 
1. 실행(R): %windir%\system32\subst.exe Z: D:\
===> 가상 공간 생성(D\: 실제 USB 드라이브, Z\: 가상 드라이브)
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.10(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 21:00  --> 아침시스템 당번, 공수 등록, 야근(상공회의소 식당(지하: 3,800원): 19 ~ 21시)

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
CM09020000IA13080020101209173147908   --> TEST 
CM09020000IA13080020101208154608952   //EDMS서버에서 이미지키를 생성 TEST  ====> 
-------------------------------------------------------------------------------------------------------
- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/244240.gif
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
http://thome.hi.co.kr/data/edms/sagojupsu/20101210/5401_40_001/244240.gif
-------------------------------------------------------------------------
- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/test4.jpg
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
http://thome.hi.co.kr/data/edms/sagojupsu/20101210/5401_40_002/test4.jpg
[/sendEdmsImage.jsp] 전송 성공 : CM09020000IA13080020101210141748665 
==============================================================================================================

- 업로드 컴포넌트 파일첨부 내역
1. 업로드 컴포넌트 도입 전 후 파일첨부 개수 / 용량 출력
날짜	총 파일 등록 개수	첨부 용량
2010-02	1215	519.09
2010-03	1858	761.71
2010-04	2106	882.58
2010-05	2258	903.42
2010-06	2335	968.19
2010-07	2407	949.56
2010-08	3185	1290.55
2010-09	3056	1240.39
2010-10	3021	1251.04
2010-11	4083	2187.19
2010-12	2129	1626.3 
==============================================================================================================

- 상담원 페이지(원격 지원) 
http://netclinic.hi.co.kr/nc20/login.jsp ==> 309287/H309287
==============================================================================================================
						
■■■■■■■■■■■■■■■■■■ 2010.12.11(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00  --> 속법 종료
 
- SFR(9째주)
08:00 기상
12:00 중식
13:50 Super Fast-Reading 학원
14:00 강의(혼자 함)
17:30 저녁(컵라면 밥)
18:00 강의(흐뭇 --> 느긋)  ==> (목사님이 독법 과정 다시 권유)
19:30 종료
20:20 귀가
==============================================================================================================
		
■■■■■■■■■■■■■■■■■■ 2010.12.12(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00  --> 독법 첫날

▦조기축구
07:40 기상
08:50 신구초등학교
08:50 게임(3:3 무)
10:40 게임(0:2 패)
11:00 종료
11:30 놀부(중식): 회비에게 냄
12:30 종료
13:30 Super Fast-Reading 학원
13:50 독법 과정 수강료 협상(독법: 300만원(60만원 할인 받음)
14:00 독법 과정 첫 강의(3층 예배당) ==> 독법: 정확하고 빨리 장악하며 읽는다.(눈동자 움직이지 말 것)
  ==> 독법Ⅰ교재 수령( 독법Ⅱ,  독법Ⅲ은 한달 후에 나온다고 함: 인쇄 요청)  ==> 망삼사(닮지 말자)
17:30 저녁(컵라면 밥)
18:00 강의
19:50 종료
20:00 귀가
==============================================================================================================

- 광속법 계좌 이체(독법: 300만원(실제 금액: 360만원))
1. 계좌번호: 377 07 037949, 우리은행 예금주: 이정애(H)010-9128-1225)
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.13(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 21:00  --> 야근(석식: 19 ~ 21시)

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
CM09020000IA13080020101209173147908   --> TEST 
CM09020000IA13080020101208154608952   //EDMS서버에서 이미지키를 생성 TEST  ====> 
-------------------------------------------------------------------------------------------------------

- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/244240.gif
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
http://thome.hi.co.kr/data/edms/sagojupsu/20101210/5401_40_001/244240.gif
-------------------------------------------------------------------------

- 업로드 이미지 확인
http://thome.hi.co.kr/data/sagojupsu/201011/test4.jpg
--> /Appl/upload2/hib2c/data/sagojupsu/201011/132.gif
http://thome.hi.co.kr/data/edms/sagojupsu/20101210/5401_40_002/test4.jpg
[/sendEdmsImage.jsp] 전송 성공 : CM09020000IA13080020101210141748665
[/sendEdmsImage.jsp] ====> [sendImageURL]/Appl/upload2/hib2c/data/sagojupsu/201011/132.gif[imgurl]201011[imgupload]132.gif 
[/sendEdmsImage.jsp] ====> [strImg_send_ok]CM09020000IA13080020101213151405734
==============================================================================================================

- 현대자동차 프로모션 진행건 출력 건수 통계 요청
1. 플래너/고객 구분해서 일별로 출력건수
2. 김희진 사원
==============================================================================================================

- 자동차보험 e-book약관 추가 작업
- 판매중인상품 http://thome.hi.co.kr/company/ko/notice/products/productsView04.jsp
- 판매상품목록 등록: http://tmgr.hi.co.kr/manager/company/goods/goods_ins.jsp?DIV=S
- 판매상품목록 수정: http://tmgr.hi.co.kr/manager/company/goods/goods_edit.jsp
- /manager/company/servlet/GoodsSvt.java
GOODS_LIST";	//테이블 이름(E-BOOK: 이북)
E-BOOK경로:  /Appl/upload2/motor_terms/5108/
http://thome.hi.co.kr/motor_terms/5108/MT_POL_5108.swf
==============================================================================================================

- 채널서비스팀 캘린더 개발
1. 일정 캘린더 개발
2. 당직 현황 개발((2010-09-28) 2010년 당직표10월.xll)
3. 작업일정표 개발(2010년 4월 작업일정_통합채널팀.xll)
4. 기타
 가) 달력 소스 ==> ew_web_diary.zip(http://www.okjsp.pe.kr/seq/37249) 
 나) 접속 테스트: http://localhost:8088/
 다) 게시판: http://localhost:8088/error_tip/tip_index.jsp --> (아이디: banca123)
 일정 캘린더: http://localhost:8088/calendar/index.jsp
 라) 하이방카 테스트 DB
IP: 10.18.12.38, PORT:1588 --> SERVICE_NAME: INTRAC2, dphibanca/dphibanca, SERVICE_NAME=INTRAC2
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.14(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 21:00  --> 야근(19 ~ 21시), 주간보고서 작성

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
CM09020000IA13080020101209173147908   --> TEST 
CM09020000IA13080020101208154608952   //EDMS서버에서 이미지키를 생성 TEST  ====> 

 /amends/servlet/RII1AAGServlet.java --> 
1. 해당 접수번호에 대한 담보(req_cover), 서열(req_seq) 조회 요청(CIS 연결), 2. dcmId(doc ID) 조회 
[/RII1AAGServlet.java]  ====> [접수번호]1011003661[담보]30[서열]001
==============================================================================================================

- 현대자동차 제휴 할인 이벤트
출력을 24일까지 제한 설정
==============================================================================================================

- 채널서비스팀 캘린더 개발
1. 일정 캘린더 개발
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.15(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 21:00  -->  야근(석식: 19 ~ 21시), CS 회의

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
CM09020000IA13080020101209173147908   --> TEST 
CM09020000IA13080020101208154608952   //EDMS서버에서 이미지키를 생성 TEST  ====>
 /amends/servlet/RII1AAGServlet.java --> 
1. 해당 접수번호에 대한 담보(req_cover), 서열(req_seq) 조회 요청(CIS 연결), 2. dcmId(doc ID) 조회 
[/RII1AAGServlet.java]  ====> [접수번호]1011003661[담보]30[서열]001
==============================================================================================================

- 자동차보험가입증명서(사이버창구 --> 교통사고사항 및 지급결의확인서)
http://thome.hi.co.kr/servlet/hi.cybercenter.motor.servlet.MIC01AGServlet?q=7F000001
01. 교통사고사항 및 지급결의확인서: /cybercenter/certifycenter/trafficAccidentView.jsp
01. 사고접수가능계약조회(장기보험): /amends/damage/care/accident_takeJubsuList.jsp
1. /cybercenter/motor/servlet/MIC01AGServlet.java
CLMQ3000M02SBean.java  ====> 테스트 (ifId = "IR_HI-HOME_0993";)
아래 주민번호로 테스트:  5302031542639(한정업), 4902201094324(김용섭)

1. IR_HI-HOME_0070(교통사고사항리스트)에서
1) 요청 전문
<reqDmgobjCd2>7908042019411</reqDmgobjCd2>  //피해자 주민번호
<evntOccrDt12>20071120</evntOccrDt12> //사고일자
2) 응답 전문
//피해자 주민번호로 보상 피해자 조회
---------------------------------------------------------------------------------
2. 수정된 IR_HI-HOME_0993(교통사고사항리스트) 에서
1) 요청 전문
<reqDmgobjCd2>7908042019411</reqDmgobjCd2>  //로그인 주민번호
<evntOccrDt12>20071120</evntOccrDt12> //사고일자
2) 응답 전문
//로그인 주민번호로 보상 피해자 또는 피보험자를 조회
담당자: 조영우 사원(보상손사팀): T)721-0256
고상태 팀장(보상손사팀): T)721-0266, 홍광기 과장(보상손사팀): T)721-0139
---------------------------------------------------------------------------------
담당자: 이경원 사원(개발팀): T)0310
==============================================================================================================

- 채널서비스팀 캘린더 개발
1. 일정 캘린더 개발
1) 당직순번정보(TBL_CALDUTYLIST) 생성
2) 작업현황정보(TBL_CALWORKLIST) 생성
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.16(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:20 ~ 18:30 --> 연장근무 양식 제출

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
==============================================================================================================

- P20101216-0010[현대자동차 제휴 프로모션 마감 작업 요청]
1. 현대자동차 제휴 할인 쿠폰 프로모션 마감 작업 요청
  1) 배너 내리기
  2) 12월 24일 오후 12:00 이후 해당 페이지 접수시 알람창 띄우기
  3) 현대자동차 제휴 할인 쿠폰 프로모션 통계 출력
==============================================================================================================

- P20101216-0011[상품공시 자동차보험 E_BOOK약관 추가 요청] 
1. e-book 약관 등록(관리자 화면): http://tmgr.hi.co.kr/manager/company/goods/goods_ins.jsp?DIV=S
2. 판매상품목록 수정: http://tmgr.hi.co.kr/manager/company/goods/goods_edit.jsp
2. e-book 약관 다운로드(판매중인상품 > 자동차 보험): http://thome.hi.co.kr/company/ko/notice/products/productsView04.jsp
- /manager/company/dao/GoodsMgr.java
GOODS_LIST";	//테이블 이름(E_BOOK_URL: E-BOOK경로)
E-BOOK경로:  /Appl/upload2/motor_terms/5108/
http://thome.hi.co.kr/motor_terms/5108/MT_POL_5108.swf 
box.put("remoteIP", request.getRemoteAddr());   //IP 주소 등록(ipaddrss)
==============================================================================================================

- 윤달
양력은 1년이 약 365일인데 비해, 음력은 1년이 약 354일입니다.
약 11일 정도의 차이가 나는데, 이 차이를 메우기 위해 19년에 7번꼴로 음력 윤달이 들어갑니다.
음력 윤달이 있는 해에는 음력으로는 13개월이 됩니다. 윤달 여부는 음력으로 판가름합니다.
예를 들면, 2009년의 음력은 1월, 2월, 3월, 4월, 5월(평달), 5월(윤달), 6월, 7월, 8월, 9월, 10월, 11월, 12월 순으로 
진행됩니다. 이처럼 같은 달이 연달아 올 때 두번째 오는 달을 윤달이라고 합니다.
2009년에는 음력 5월(두번째 오는 5월)이 윤달이었으며, 나머지 달은 모두 평달입니다. 

- 1900년부터 2100년까지의 윤달
1900 (8)  1903 (5)  1906 (4)  1909 (2) 1911 (6)  1914 (5)  1917 (2) 
1919 (7)  1922 (5)  1925 (4)  1928 (2) 1930 (6)  1933 (5)  1936 (3)
1938 (7)  1941 (6)  1944 (4)  1947 (2) 1949 (7)  1952 (5)  1955 (3)

1957 (8)  1960 (6)  1963 (4)  1966 (3) 1968 (7)  1971 (5)  1974 (4)
1976 (8)  1979 (6)  1982 (4)  1984 (10) 1987 (6) 1990 (5)  1993 (3)
1995 (8)  1998 (5)  2001 (4)  2004 (2)  2006 (7)  2009 (5)  2012 (3)

2014 (9)   2017 (5)  2020 (4)  2023 (2)  2025 (6)  2028 (5)  2031 (3)
2033 (11) 2036 (6)  2039 (5)  2042 (2)  2044 (7)  2047 (5)  2050 (3)
2052 (8)  2055 (6)  2058 (4)  2061 (3)  2063 (7)  2066 (5)  2069 (4)
2071 (8)  2074 (6)  2077 (4)  2080 (3)  2082 (7)  2085 (5)  2088 (4)
2090 (8)  2093 (6)  2096 (4)  2099 (3)
==============================================================================================================

- 업무부와 연말 송년회식
18:30 퇴근
18:50 부산 복집
19:40 인터넷서비스팀(모바일 테스트 때문에 늦게 옴)
19:50 석식(정민지씨, 김범정 대리)
22:00 종료
22:20 맥주집(2차)
24:00 종료
24:10 버스
24:20 종로3가역
01:20 낙성대역
01:40 귀가
01:50 취침(속독 연습 안함)
==============================================================================================================

- 도서 구매
1. 소프트웨어 아키텍처 이론과 실제/에이콘, 가격: 33,500원
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.17(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 21:00  --> 눈(지하철: 4-1번 출구), 공수등록

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
==============================================================================================================

- P20101217-0008[장기 사고처리 목록 확대 개선]
1) 기존 노출 보상처리건 10건 → 20건 확대		
01. 사고접수목록조회: /cybercenter/bosangcenter/bosangListView2.jsp
2) 보상처리건 노출 건수 확대에 따른 부하 테스트 실시하여 부하 정도 체크 반영 요망 					
3) 로그인하지 않고 보상처리 조회 클릭시 로그인 화면과 함께 나오는 팝업창 제거
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp  
--> /amends/servlet/ViewSagoListServlet.java에서 err_info2.jsp 팝업 링크 제거
4) Left 메뉴: /docs/xml/newxml/HI_NAV_XML.xml ==> 메뉴 제거(잔존물매각공고, 도난차량매각공고)
http://thome.hi.co.kr/amends/index.jsp
==============================================================================================================

- 주석 표준
<%
/*
	###############################################################
	시스템명 :		사이버창구 ==> 보상창구 ==> 상해/질병보상 ==> 보상처리조회
	파일명	:	/cybercenter/bosangcenter/bosangListView2.jsp
	작성일	:	2010-10-26
	작성자	:	진태만
	설명		:	01. 사고접수목록조회
	------------------------------------------------------------------------
	수정일	:	2010-12-17
 	수정자	:	진태만
	수정사항   :	건수 전시 10건에서 20건으로 변경
	###############################################################
*/
%> 
==============================================================================================================

- 프린터
HP 레이저젯 5200n
IP: 10.81.17.102, 10.81.17.244
==============================================================================================================
					
■■■■■■■■■■■■■■■■■■ 2010.12.18(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00
 
- SFR(10째주)
07:00 기상
07:10 Super Fast-Reading 훈련
08:00 조식
08:50 Super Fast-Reading 학원(혼자 시작)
09:20 전주 장로님 참석
13:00 중식(김밥, 컵라면)
14:00 강의
17:30 저녁(밥)
18:00 강의(흐뭇 --> 느긋)  ==> (목사님이 시험 교재 가지고 오라고 함)
19:30 종료
20:10 귀가
==============================================================================================================
	
■■■■■■■■■■■■■■■■■■ 2010.12.19(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00

▦조기축구
07:00 기상
08:00 신구초등학교
08:50 게임(3:3 무)
10:00 2011년 임원진 소개(회장: 이영민, 총무:구창원, 감독:곽수인)
10:10 게임(2:1 승)
11:20 종료
11:30 중식(운동장에서 김치찌게, 보쌈 해 먹음)
12:30 종료
13:50 Super Fast-Reading 학원
14:00 독법 과정 첫 강의(혼자 나중에 시작 3명 더 옴) ==> 흐뭇 --> 느긋
17:30 저녁(컵라면 밥)
18:00 강의(목사님이 상가 화장실 물이 새서 열 받음)
19:50 종료
20:00 귀가
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.20(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30  --> 지급결의확인서 때문에 정대리과 싸움

- 현대해상 SM
- P20101216-0011[상품공시 자동차보험 E_BOOK약관 추가 요청] 
1. e-book 약관 등록(관리자 화면): http://tmgr.hi.co.kr/manager/company/goods/goods_ins.jsp?DIV=S
2. 판매상품목록 수정: http://tmgr.hi.co.kr/manager/company/goods/goods_edit.jsp
2. e-book 약관 다운로드(판매중인상품 > 자동차 보험): http://thome.hi.co.kr/company/ko/notice/products/productsView04.jsp
- /manager/company/dao/GoodsMgr.java
GOODS_LIST";	//테이블 이름(E_BOOK_URL: E-BOOK경로)
E-BOOK경로:  /Appl/upload2/motor_terms/5108/
http://thome.hi.co.kr/motor_terms/5108/MT_POL_5108.swf 
box.put("remoteIP", request.getRemoteAddr());   //IP 주소 등록
==============================================================================================================

- P20101220-0016[지급결의확인서 조회범위 확대] 
http://thome.hi.co.kr/servlet/hi.cybercenter.motor.servlet.MIC01AGServlet?q=7F000001
01. 교통사고사항 및 지급결의확인서: /cybercenter/certifycenter/trafficAccidentView.jsp
01. 사고접수가능계약조회(장기보험): /amends/damage/care/accident_takeJubsuList.jsp
1. /cybercenter/motor/servlet/MIC01AGServlet.java
아래 주민번호로 테스트: 5302031542639(한정업), 4902201094324(김용섭)
1. IR_HI-HOME_0070(교통사고사항리스트)에서  ==> 피해자 조회
1. IR_HI-HOME_0993(교통사고사항리스트)에서  ==> 피보험자 조회
---------------------------------------------------------------------------------
담당자: 이경원 사원(개발팀): T)0310 
피해자: 6802071114118  8601031047211  7005112791915
피보험: 4902201094324  
피보험+피해자: 6902091548524 
==============================================================================================================

- 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리 작업 요청
1. 사고접수 flow 설명
2. 담당자: 김일선 과장(개발팀)
==============================================================================================================

- 현용 대여금 일부 변제
1. 금액: 300만원(500만원 중)
==============================================================================================================
						 
■■■■■■■■■■■■■■■■■■ 2010.12.21(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:10 ~ 18:30  --> 주간보고서 작성

- 현대해상 SM
- P20101220-0016[지급결의확인서 조회범위 확대] 이행완료
http://thome.hi.co.kr/servlet/hi.cybercenter.motor.servlet.MIC01AGServlet?q=7F000001
01. 교통사고사항 및 지급결의확인서: /cybercenter/certifycenter/trafficAccidentView.jsp
01. 사고접수가능계약조회(장기보험): /amends/damage/care/accident_takeJubsuList.jsp
1. /cybercenter/motor/servlet/MIC01AGServlet.java
아래 주민번호로 테스트: 5302031542639(한정업), 4902201094324(김용섭)
2. IR_HI-HOME_0070(교통사고사항리스트)에서  ==> 피해자 조회
3. IR_HI-HOME_0993(교통사고사항리스트)에서  ==> 피보험자 조회
---------------------------------------------------------------------------------
담당자: 이경원 사원(개발팀): T)0310
피해자: 6802071114118, 8601031047211, 7005112791915, 피보험: 4902201094324
피보험+피해자: 6902091548524
==============================================================================================================

- P20101217-0008[장기 사고처리 목록 확대 개선] 이행완료
1) 기존 노출 보상처리건 10건 → 20건 확대		
01. 사고접수목록조회: /cybercenter/bosangcenter/bosangListView2.jsp
2) 보상처리건 노출 건수 확대에 따른 부하 테스트 실시하여 부하 정도 체크 반영 요망 					
3) 로그인하지 않고 보상처리 조회 클릭시 로그인 화면과 함께 나오는 팝업창 제거
http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp  
--> /amends/servlet/ViewSagoListServlet.java에서 err_info2.jsp 팝업 링크 제거
4) Left 메뉴: /docs/xml/newxml/HI_NAV_XML.xml ==> 메뉴 제거(잔존물매각공고, 도난차량매각공고)
http://thome.hi.co.kr/amends/index.jsp
==============================================================================================================

- P20101216-0010[현대자동차 제휴 프로모션 마감 작업 요청] 이행완료
1. 현대자동차 제휴 할인 쿠폰 프로모션 마감 작업 요청
  1) 배너 내리기
  2) 12월 24일 오후 12:00 이후 해당 페이지 접수시 알람창 띄우기
  3) 현대자동차 제휴 할인 쿠폰 프로모션 통계 출력
==============================================================================================================

- P20101129-0018[장기사고접수 EDMS 연동작업]
1. EDMS 이미지 전송: http://thome.hi.co.kr/amends/damage/care/sendEdmsImage.jsp
2. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
 1) 윤종규 T)0265, 장현석 대리 T)0264
1. 서식코드가 사진(0123)이
- 서식코드 확인: http://dev-edms.cis.co.kr:50401/jsp/edmadm/eCmForm0001m0.jsp 
- 검색번호 코드확인: http://dev-edms.cis.co.kr:50401/jsp/edmadm/eCmMetaNo0001m0.jsp
- 업무중분류 확인: http://dev-edms.cis.co.kr:50401/jsp/edmadm/eCmMapng0000m0.jsp
- 전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp
------------------------------------------------------------------------------------------------------

- EDMS 이미지 전송의 문제점(유성철 대리때문에 스트레스 받음)
1. EDMS 이미지 전송 성공
 1) 자동차보상(CM:자동차보상)쪽으로 EDMS 이미지가 전송됨
2. 손사(CF:손해사정)으로 EDMS 이미지 코드 재조정
 1) 손사에서는 edms_clientv.jar 파일 미 사용
 2) 전자문서 등록 사용으로 코드 재조정 필요
  전자문서 등록(화면): http://dev-edms.cis.co.kr:50401/jsp/edmapp/eCmReg0001m0.jsp  
==============================================================================================================

- SMS 전송
1. /manager/home/event/servlet/ViewEventServlet.java
rse = eventMgr.getSmsList(CommonUtil.getParameter(req, "eventid"));
strMsg = CommonUtil.getParameter(req,"msg");
	import hi.common.util.SmsUtil;			
for(int i=0; i < rse.getRows(); i++) {
	strMobile = rse.getString("mobile", i);
	
	bFlag = SmsUtil.sendSms(strMobile, "02-2116-1004", strMsg);
	
	if(bFlag == true) iCnt = iCnt+1;
}

out.println("<Script language='javascript'>alert('"+iCnt+"건 발송되었습니다.');</script>");
strViewUrl = "/manager/home/event/pop_sms.jsp?eventid="+CommonUtil.getParameter(req, "eventid");
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.22(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30  --> CS회의

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
2. EDMS 이미지 전송: /amends/damage/care/sendEdmsImage.jsp 
3. EDMS 이미지 전송
 1) EDMS 이미지 전송: 홈페이지 ==> 사고접수 ==> 장기보험 사고 가접수 상세 조회(관리자)
 2) EDMS 이미지 전송 확인(http://qa.cis.co.kr, 진원판306961/306961)
  - 전체메뉴 ==> 부가업무 ==> EDMS ==> EDMS 시스템(새창)에서
업무구분: 손해사정, 검색기준: 사고번호(손사), 1011003661(진접수번호) 조회(클릭)
4. 담당자: 1) 윤종규 T)0265
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.23(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 06:40 ~ 18:30

- 현대해상 SM
- P20101129-0018[장기사고접수 EDMS 연동작업]
1. 장기보험 사고가접수 상세조회: /manager/home/care/ViewAccident.jsp
2. EDMS 이미지 전송: /amends/damage/care/sendEdmsImage.jsp 
3. EDMS 이미지 전송
 1) EDMS 이미지 전송: 홈페이지 ==> 사고접수 ==> 장기보험 사고 가접수 상세 조회(관리자)
 2) EDMS 이미지 전송 확인(http://qa.cis.co.kr, 진원판306961/306961)
  - 전체메뉴 ==> 부가업무 ==> EDMS ==> EDMS 시스템(새창)에서
업무구분: 손해사정, 검색기준: 사고번호(손사), 1011003661(진접수번호) 조회(클릭)
4. 담당자: 1) 윤종규 T)0265
5. edms_clientv_new.jar 파일 생성(rhome서버 하루 지나면 적용 됨, rhome 서버 재시작 해야 함)
- /Appl/rhib2c/rhib2c.ear/hib2cWeb.war/WEB-INF/lib폴더에 넣기

- Array 함수 설정
/sendEdmsImage.jsp 파일에서
String[] imgUploadChuArr = new String[5]; // 추가 첨부파일 Array
imgUploadChuArr[0] = (request.getParameter("imgupload16")==null)? "": request.getParameter("imgupload16");// 추가 첨부파일명1
imgUploadChuArr[1] = (request.getParameter("imgupload17")==null)? "": request.getParameter("imgupload17");
imgUploadChuArr[2] = (request.getParameter("imgupload18")==null)? "": request.getParameter("imgupload18");
imgUploadChuArr[3] = (request.getParameter("imgupload19")==null)? "": request.getParameter("imgupload19");
imgUploadChuArr[4] = (request.getParameter("imgupload20")==null)? "": request.getParameter("imgupload20");

 for(int j = 0; j< imgUploadChuArr.length; j++) {   //추가 첨부파일이 존재하면		 
	if(!imgUploadChuArr[j].equals("")) {  //원파일이 존재하면
		imgupload = imgUploadChuArr[j] ;	// 첨부파일명(원파일명)
		sendImageURL = sendURL +""+ imgUrlArr[j]  +"/"+  imgupload;   // 전송파일URL
		 
		strImg_send_ok = SendEdmsImage_act(lctgCd, affairsID, affairsBranchCode, scanUserID, scanBranchCode, 
					sendDate, expireDate, iPAddress, imgupload, sendImageURL, 
					lctg_mctgCd, formCd, formCd_nm, search_no, req_req1_no);	//EDMS에 이미지 전송 처리 함수 호출
	}
}
==============================================================================================================

- 주소용도 조사(진태만)
SELECT count(*) FROM BOSANG_CERT			11
SELECT count(*) FROM SAGO_JUBSU				55837
SELECT count(*) FROM BRCH					444
SELECT count(*) FROM CHILDGUIDE				17204
SELECT count(*) FROM CHILDLOVE				2976
SELECT count(*) FROM CHILD_GOOD				15539
SELECT count(*) FROM COMMONINS				56382
SELECT count(*) FROM COMMONINSURANCE		182
SELECT count(*) FROM CONSULTANT_CHILDGOOD	58
SELECT count(*) FROM POM_TRANSFER_LIST		4694
SELECT count(*) FROM PRIME					619
SELECT count(*) FROM RENEW_CONTRACT			9487
SELECT count(*) FROM REQ_PUBLICATION			2
SELECT count(*) FROM SKIINS					24055 
==============================================================================================================

 - EDMS 도입 효과
1. EDMS로 도입 전
 1) 상해/질병보상 사고접수시(http://thome.hi.co.kr/amends/damage/care/accident_takeDetailView.jsp)
   구비서류 업로드 파일을 thome서버(B2C서버) 폴더(/Appl/upload2/hib2c/data/sagojupsu)에 저장
 2) HI-PORTAL에서 구비서류 업로드 파일 확인시 관리자 화면(http://homeadmin.hi.co.kr)을 다시 띄어서 확인 해야함 
 3) HI-PORTAL과 구비서류 업로드 파일이 연동 안되어 콜센타에서 신속한 고객 응대 및 업무 처리 불가능

2. EDMS로 도입 후
1) 관리자 화면(http://homeadmin.hi.co.kr)에서 해당 파일을 EDMS 파일 전송하여 해당 파일 EMDS 서버에 저장
2) HI-PORTAL에서 구비서류 업로드 파일 즉시 확인 가능
3) HI-PORTAL에서 상해/질병보상 사고접수 업무 일괄 처리 가능
==============================================================================================================

 - 채널서비스팀 캘린더 개발
1. 당번 현황(시스템점검토 출력)
2. 일정 캘린더(calendar)

* 하이방카 테스트 서버 정보 *
서버 IP : 10.10.3.42
서버 계정: hidev01/hidev01
WEB : /Appl/hibancaCis/docs/
WAS : /Appl/hibancaCis/hibancaCis.ear/hibanca.war
http://ts.hi-banca.co.kr/error_tip/tip_index.jsp
http://ts.hi-banca.co.kr/calendar/calendar.jsp, ID:cal123
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.24(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30   --> 센터 성탄절 선물 교환 행사, E-마트(바지 3벌 구입), 독법 훈련 못함(키스)
 
- 현대해상 SM
- 하이카특약 변경
1. 하이카 서비스안내: http://thome.hi.co.kr/amends/hicarservice/info01.jsp
 1) 이미지 변경 : 대상 이미지 경로 : /images/newimages/service/hicarservice/img_hicar_service04.gif
 2) 링크 변경 : http://www.hi.co.kr/happyplus/joinsale/joinsaleView07.jsp
2. 하이체인지 서비스안내: http://thome.hi.co.kr/amends/hicarservice/hichange01.jsp
==============================================================================================================

- P20101216-0011[상품공시 자동차보험 E_BOOK약관 추가 요청] 
1. e-book 약관 등록(관리자 화면): http://tmgr.hi.co.kr/manager/company/goods/goods_ins.jsp?DIV=S
2. 판매상품목록 수정: http://tmgr.hi.co.kr/manager/company/goods/goods_edit.jsp
2. e-book 약관 다운로드(판매중인상품 > 자동차 보험): http://thome.hi.co.kr/company/ko/notice/products/productsView04.jsp
- /manager/company/dao/GoodsMgr.java
GOODS_LIST";	//테이블 이름(E-BOOK: 이북)
E-BOOK경로:  /Appl/upload2/motor_terms/5108/  --> /B2C/upload2/motor_terms
http://thome.hi.co.kr/motor_terms/5108/MT_POL_5108.swf
http://thome.hi.co.kr/motor_terms/5203/MT_POL_5203.swf
==============================================================================================================

- 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리 작업 요청
1. 가접수저장: /cis/cisbean/amends/CLRF0100M01IBean.java 파일에서
try{
	////////////////////////////////////////////////////////////
	// 1. 요청/응답 업무객체 생성 및 데이터 설정
	////////////////////////////////////////////////////////////
	bizVo   = new CisResultObjVO();
	amendVo = new CLRF0100VO();

	//******************* 메인 VO  **************************// 
	CLRF0110VO reqList1 = new CLRF0110VO(); 
	reqList1.setRactInsrdNm(strRactInsrdNm);	//대표피보험자명
	reqList1.setRactInsrdNm(strRactInsrdNm);	//대표피보험자명

	amendVo.setClrf0110voList(new CLRF0110VO[]{reqList1}); //메인 VO 셋팅 ----------------------->

	//*******************사건 VO **************************//
	CLRF0111VO accVo = new CLRF0111VO();//amendVo.getClrf0111vo(); 
 
	accVo.setDptrNm(strDptrNm);               //예금주명
	accVo.setInjptyCnctAraNo(strInjptyCnctAraNo);         //피해자유선연락처지역번호 
	accVo.setInjptyCnctTxNo(strInjptyCnctTxNo);           //피해자유선연락처국번호		

	amendVo.setClrf0111vo(accVo);   //사건 VO 셋팅 ----------------------->
}

/CLRF0110VO.java ==> 메인 VO
private String rqptBnkCd;  //은행코드
private String rqptActNo;  //계좌번호
private String rqptDptrNm;  //예금주명
private String rqptInsrdRlCat;  //예금주와피보험자와의관계

/CLRF0111VO.java ==> 사건 VO
accVo.setEvpaPsnPprExstYn(evpaPsnPprExstYn);	//구비서류 여부
accVo.setEvpaHmpgAcptCat(evpaPsnPprExstYn);	//접수구분
accVo.setEvpaQstn1AnsCd(evpaQstn1AnsCd); 	//설문1답변
accVo.setEvpaQstn2AnsCd(evpaQstn2AnsCd);	//설문2답변
accVo.setEvpaQstn3AnsCd(evpaQstn3AnsCd); 	//설문3답변
accVo.evpaQstn4AnsCd(evpaQstn4AnsCd);		//설문4답변
accVo.setEvpaQstn1OthsAnsCnts(evpaQstn1OthsAnsCnts); 	//설문3답변
accVo.setEvpaQstn2OthsAnsCnts(evpaQstn3OthsAnsCnts);		//설문3_기타답변
==============================================================================================================

- 팩스수신확인(/amends/damage/care/receiveFax.jsp)
1. 하이카 손사 FAX 수신 시스템: http://thome.hi.co.kr/servlet/hi.amends.servlet.ViewFaxServlet?q=7F
==============================================================================================================

 - 스타벅스 상품권(센터 선물 교환): 만원
- 불우이웃돕기: 만원
- T머니 교통카드 충전(잔액: 13,500원)
==============================================================================================================
					
■■■■■■■■■■■■■■■■■■ 2010.12.25(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 10:30 ~ 00:00  --> 성탄절
 
- SFR(11째주)
10:30 기상 
12:00 중식
13:50 Super Fast-Reading 학원(성탄절이라 휴무인데 훈련함)
14:00 훈련(혼자 함)  ==> 읽기하고 있음(읽기 접점 찾기 고민)
17:40 종료
17:40 저녁(피자 먹음) ==> 목사님이 내일 예배 나오라고 해서 거절하기가 귀찮아 그냥 나온다고 함 
18:20 귀가
==============================================================================================================
	
■■■■■■■■■■■■■■■■■■ 2010.12.26(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:30 ~ 00:00 

▦조기축구
07:40 기상
08:30 신구초등학교
08:50 게임(3:2 승) 
10:40 게임(5:4 승)
11:20 종료
11:30 중식(떡라면 끓여먹음)
12:00 만리성(중국집): 임원단 회의
13:50 Super Fast-Reading 학원==> 목사님이 예배 안 와서 삐짐
14:00 훈련(7명 나옴) ==> 복삼 훈련 못 한다고 단체로 개별 평가 및 욕 먹음 ==> 편함(미소)
17:30 저녁(컵라면 밥)
18:00 훈련
19:30 종료
20:10 귀가
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.27(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 18:30  --> 하루웰 식권 구매(은행에서 돈 찾기)
 
- 현대해상 SM
- 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리 작업 요청
1. 가접수저장: /cis/cisbean/amends/CLRF0100M01IBean.java
==============================================================================================================

- P20101216-0011[상품공시 자동차보험 E_BOOK약관 추가 요청] 이행 완료
===> 자원: 6개(JSP: 3, JAVA: 3) ==> (JSP: 6, JAVA: 6, CLASS: 3)(산출물 포함) ==> 총 15개
1. e-book 약관 등록(관리자 화면): http://tmgr.hi.co.kr/manager/company/goods/goods_ins.jsp?DIV=S
2. 판매상품목록 수정: http://tmgr.hi.co.kr/manager/company/goods/goods_edit.jsp
2. e-book 약관 다운로드(판매중인상품 > 자동차 보험): http://thome.hi.co.kr/company/ko/notice/products/productsView04.jsp
- /manager/company/dao/GoodsMgr.java
E-BOOK경로:  /Appl/upload2/motor_terms/5108/  --> /B2C/upload2/motor_terms
==============================================================================================================

- 현대HDS SM 개인 휴가
1. 2011.03.31까지: 3일 발생
2. 2011.04.01 ~ 2012.03.31: 5일 발생
3. 휴가 신청서 제출(12.29(수))
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.28(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 06:40 ~ 18:30  --> 아침 당번, 주간보고서 작성, 눈 많이 옴
 
- 현대해상 SM
- 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리 작업 요청
1. 가접수저장: /cis/cisbean/amends/CLRF0100M01IBean.java 
2. 사고접수시 빠진 CIS 필드 추가
 1) 메인 VO
reqList1.setRqptBnkCd(strBankNm); 	//은행코드(New)
reqList1.setRqptActNo(strActNo); 		//계좌번호(New)
reqList1.setRqptDptrNm(strDptrNm);	//예금주명(New)
reqList1.setRqptInsrdRlCat(strInsrdRlCatNm);	//예금주와피보험자와의관계(New)
reqList1.setRqptDptrRegNo(strBank_rsn_no); 	//예금주주민번호(New)
reqList1.setRqptInsrdJbNm(strInsured_job);	//피보험자직업(New)
 2) 사건 VO
accVo.setEvpaPsnPprExstYn(strEvpaPsnPprExstYn);	//구비서류 여부(New)
accVo.setEvpaHmpgAcptCat(strEvntAcdtTypCat);		//접수구분(01:자동차 02:일반 03:질병)(New)
accVo.setEvpaQstn1AnsCd(strEvpaQstn1AnsCd); 		//설문1답변(New)
accVo.setEvpaQstn2AnsCd(strEvpaQstn2AnsCd);		//설문2답변(New)
accVo.setEvpaQstn3AnsCd(strEvpaQstn3AnsCd); 		//설문3답변(New)
accVo.setEvpaQstn4AnsCd(strEvpaQstn4AnsCd);		//설문4답변(New)
accVo.setEvpaQstn1OthsAnsCnts(strEvpaQstn1OthsAnsCnts);	//설문1_기타답변(New) 
accVo.setEvpaQstn3OthsAnsCnts(strEvpaQstn3OthsAnsCnts);	//설문3_기타답변(New)
==============================================================================================================

- P20101216-0010[현대자동차 제휴 프로모션 마감 작업 요청]
1. 현대자동차 제휴 할인 쿠폰 프로모션 마감 작업 요청
  1) 현대자동차 제휴 할인 쿠폰 프로모션 통계 출력
  2) promtion_pop.jsp에서 이벤트가 종료(24일로 재 설정)
==============================================================================================================

- P20101129-0018[장기사고접수 EDMS 연동작업]의 문제점
1. 장기보험 사고가접수 상세조회(/manager/home/care/ViewAccident.jsp) 관리자)에서 진접수번호를 직접 입력
하는 것은 현실적으로 힘들다고 함(손사기획팀 정세영 과장)
2. 홈페이지 사고접수시 파일 업로드 화면에서 직접 EDMS 이미지 전송 요청
 1) 사고접수시 최종 인증 과정을 마친 후 가접수번호를 생성하기 때문에 파일 업로드 화면 변경 필요
  - 기존: 00. 사고접수 --> 02. 사고사항 입력 --> 03. 구비서류접수(파일 업로드) --> 05. 본인인증 --> 06. 사고접수완료
  - 수정: 00. 사고접수 --> 02. 사고사항 입력 --> 05. 본인인증 --> 06. 사고접수완료 --> 03. 구비서류접수(파일 업로드)
   ==> 수정 이유: 사고접수완료시 가접수번호를 CIS에서 받아 오기 때문(사고접수 업무 flow가 바뀌기 때문에 현업과 협의가 필요)
3. 담당자: 1) 윤종규 T)0265
==============================================================================================================

- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지]
1. Hi 여성 금융아카데미 지원서 신청
2. 이벤트 메인 레이어 띄우기
3. 2010년 1월 5일 이행
hipath=womenacademy1_subroll
당첨자보기: http://thome.hi.co.kr/events/hmfievents/old/lastevents.jsp 
/cybercenter/contractcenter/change/contractInfoView.jsp
EVT_WOMEN_ACA: 하이여성금융아카데미_기본사항
EVT_WOMEN_ACA_2: 하이여성금융아카데미_가족사항
EVT_WOMEN_ACA_3: 하이여성금융아카데미_경력사항
http://thome.hi.co.kr/servlet/hi.cybercenter.cmts.servlet.AddrProxyServlet
==============================================================================================================

- 교통사고사항 및 지급결의확인서 조회
1. 7811071178414(박지훈)으로 조회
 1) 교통사고사항리스트(피해자로 조회): 1건
  - 1010027617(접수번호) 박지훈
 2) 교통사고사항리스트(피보험자로 조회): 1건
  - 1010027617(접수번호) 류준욱
  - 1010027617(접수번호) 임한용
  - 1010027617(접수번호) 박지훈
==============================================================================================================

- 나눔동기 송년회(비공식)
18:40 퇴근
19:40 강남역 7번 출구(태용)
20:00 고기집(현용, 호수): 회비 5만원씩 냄
21:30 당구장(50 놓고 1등 함): 임모 꼴찌
23:00 술집
01:00 일식집(호수는 먼저감)
02:30 종료
02:40 택시(9천원)
03:00 귀가
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.29(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:30  --> 현대해상 SM 휴가
 
- 현대해상 SM
- SFR 훈련
08:00 기상
08:30 Super Fast-Reading 학원
09:00 훈련(이정숙님, 신혜림씨, 윤재)
12:30 중식
13:00 개인 훈련(2층 강의실)
17:00 종료
17:50 이발(5천원)
18:30 귀가
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.30(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:40 ~ 18:30  --> SFR 아침 훈련 시작, 지하철(시청역 9-3 출구)
 
- 현대해상 SM
- 하이손사 홈페이지 사고접수 업무처리화면 하이포탈 이전 처리 작업 요청
1. 가접수저장: /cis/cisbean/amends/CLRF0100M01IBean.java
2. 사고사항 입력 선택시
 1) 통보자가 계약자일 경우 '01', 피보험자일 경우 '02'(선택한 보험에 따라 CIS 전문으로 자동 조회됨)
연락처, 휴대폰번호가 피보험자의 정보인가요? 통보자의 정보인가요?
===> 통보자 정보(통보자가 피보험자냐, 계약자이냐에 따라 틀릴 수 있음)
==============================================================================================================

- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지]
1. Hi 여성 금융아카데미 지원서 신청
2. 이벤트 메인 레이어 띄우기
3. 2010년 1월 5일 이행
Hi 여성 금융아카데미 1기 모집: http://thome.hi.co.kr/events/21101002/hi_finance_academy_sub_2.jsp
당첨자보기: http://thome.hi.co.kr/events/hmfievents/old/lastevents.jsp
/cybercenter/contractcenter/change/contractInfoView.jsp
EVT_WOMEN_ACA: 하이여성금융아카데미_기본사항
EVT_WOMEN_ACA_2: 하이여성금융아카데미_가족사항
EVT_WOMEN_ACA_3: 하이여성금융아카데미_경력사항 
==============================================================================================================

- 사고접수시 이용가능시간 제한한 이유
1. 상해/질병 보험 사고접수시 이용가능시간 : 06:00 ~ 22:00 (주말 및 휴일 포함 365일 가능)
==> 1. 보험금 입금 수령은행 조회(은행 전산망 이용하고 있기 때문), 2. 업부 부서 끼리에서 합의 했음
==============================================================================================================

- 업무분장표 정리(인수인계자: 장민정 사원)
1. 이메일 발송(대량메일, 이벤트메일)
2. 보상처리업무(자동차, 상해/질병, 증명서관리-교통사고사항지급결의확인서)
3. 홈페이지 기업 / 퇴직보험(Hi-B2B), 보상협력업체(Hi-B2B)
4. 마이페이지(무창구서비스)
5. 이벤트(정기이벤트)
6. 정보성컨테츠 관리(회사소개, 공시실, 고객센터)
==============================================================================================================

- P20101129-0018[장기사고접수 EDMS 연동작업] 이행(1월 3일(월))  ==> 팀장이 *소리 함
1. 관리자 화면에서 진접수번호 입력 후 EDMS 이미지 전송 가능(개발 요구 사항 일치)
2. 손사기획팀(담당: 정세영 과장)에서 손사시스템 개발(HI-PORTAL 시스템 사용 안 함)
3. 기존 HI-PORTAL에서는 장기보험 사고 가접수 조회(http://homeadmin.hi.co.kr/servlet/hi.manager.home.care.servlet.JubsuList)이
조회 가능해서 사고접수 업로드 이미지를 볼 수 있었음
4. 개발된 손사시스템에서는 장기보험 사고 가접수 화면을 볼 수 없음(권한 부여 및 새창 띄우기를 해야 함)
==============================================================================================================
					 
■■■■■■■■■■■■■■■■■■ 2010.12.31(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:30  --> 공수 등록, 구매(이마트)
 
- 현대해상 SM
- P20101228-0028[Hi 여성 금융아카데미 1기 모집 안내 페이지]
1. Hi 여성 금융아카데미 지원서 신청
2. 이벤트 메인 레이어 띄우기
3. 2010년 1월 5일 이행
Hi 여성 금융아카데미 1기 모집: http://thome.hi.co.kr/events/21101002/hi_finance_academy_sub_2.jsp 
/cybercenter/contractcenter/change/contractInfoView.jsp
EVT_WOMEN_ACA: 하이여성금융아카데미_기본사항
EVT_WOMEN_ACA_2: 하이여성금융아카데미_가족사항
EVT_WOMEN_ACA_3: 하이여성금융아카데미_경력사항
당첨자보기: http://thome.hi.co.kr/events/hmfievents/old/lastevents.jsp
==============================================================================================================

- 현용 대여금 일부 변제
1. 금액: 200만원(5000만원 완납)
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■ 