

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2023.04) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■

 
■■■■■■■■■■■■■■■■■■ 2023.04.01(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
06:50 기상
07:10 조식(수종: 돈까스)
07:20 실내 도보
07:45 종료
08:00 집 출발(자전거: 수종)
08:05 보라매 공원 도착
08:10 수종이랑 보라매 공원 운동장에서 야구
08:30 종료
08:35 귀가
09:10 인터넷 서핑
10:50 수종 센터로 감
11:30 중식 ==> 빨래
11:50 집 출발(도보): 도림천 ==> 제9회 신대방 어울림 벚꽃 축제(도림천 둑방길: 코로나 19 이후 처음 축제 봄)
13:04 귀가
13:20 인터네 서핑 
15:25 수종 엄마집에 놀러감
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 천연세제 (베이킹소다[염기성], 구연산[산성], 과탄산소다[염기성]) 차이점과 사용법 | 청소, 세탁, 설거지에 활용하기
https://www.youtube.com/watch?v=yTtJIAHA5QM
==============================================================================================================

- [EBS 명의] 뇌졸중[중품], 막히거나 터지거나(뇌경색[혈관 막힘], 뇌출혈[혈관 터짐]) ■
https://www.youtube.com/watch?v=0BYpVtcK188
1. 협착증 --> 경동백 성형 및 스텐트 삽입술 ■■■

- 뇌졸중 환자들이 절대로 해서는 안 되는 것들 [대한뇌졸중학회] / 뇌비게이션 신경과 장민욱, 강동성심병원 신경과 김예림
https://www.youtube.com/watch?v=nR-pbTnIPNc
==============================================================================================================

- 이 4가지만 안먹어도 당뇨와 치매에 안걸린다 [당뇨와 치매가 낫는다] - 1편[닥터쓰리 - 한미일의사의 쉬운 의학]
https://www.youtube.com/watch?v=6ZrsdZostJ0&list=UULPkpAw1Z13syiCKj_igxK_xA
1. 밀가루(글루텐: 뇌혈관 손상)  ==> 달달한 것은 몸에 해롭다.

- 밀가루 글루텐의 문제점[닥터조의 건강이야기]
https://www.youtube.com/watch?v=APbv4gTo2O0

- 당뇨병도 완치가 가능할까? [당뇨 / 인슐린저항성] [닥터조의 건강이야기]
https://www.youtube.com/watch?v=_5sA93wAN-8&list=PLqeYEwcyFC_6bLj8nq4G7tZ_ZW-BZZtyF
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.04.02(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:44 기상
06:00 조식(수종)
06:25 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(반환점) ==> 도림천)
08:00 종료
08:10 인터넷 서핑
12:00 중식
11:50 집 출발(도보): 도림천
13:04 귀가
14:00 인터넷 서핑
15:30 대림 부산어묵 알뜰사각 1kg  6개(19,760원) 구입
17:00 수종 귀가
17:30 석식(수종)
17:45 실내 도보
19:10 종료
20:30 청소(청소기, 밀대)
21:00 샤워(온수: 체중: 70.9kg ==> BMI: 24.91[과 체중])
22:30 취침
==============================================================================================================
 
- [위메프] 대림 부산어묵 알뜰사각 1kg(할인 혜택가: 2,710원 ==> 6개, 19,760원) 구입
https://front.wemakeprice.com/product/882766846
==============================================================================================================

- 결제하고 2500원 받음! 네이버 페이 x 삼성 페이 혜택 최대한으로 뽑아먹기 (+편하게 쓰는 방법) [테크몽]
https://www.youtube.com/watch?v=YzAwGhJSlQ4
==============================================================================================================

- 홍수, 가뭄, 화재.. “지옥으로 가는 길을 돌이킬 수 없을 것이다” [21-22 UHD환경스페셜 기후변화 특집 지구의 경고 8편 그랜드 에필로그 위대한 전환] KBS 211216
https://www.youtube.com/watch?v=R8D64WD02DQ

- [당혹사4 요약] 2050년에 인류는 멸망한다? 지구 종말론의 불편한 진실! (SBS방송) [지구 온난화]
https://www.youtube.com/watch?v=G1Foi5_MZTQ

- 호주 산불의 악몽은 시작에 불과하다! 2℃ 수온 상승이 불러온 공포의 나비효과 #highlight #벌거벗은세계사 EP.75
https://www.youtube.com/watch?v=WP6vx0oC8TE&t=39s
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.03(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 자체 휴가[★]
==============================================================================================================
 
- 나일도(이사, 채용C, SPC 엔터) 이사와 전화
1. 현재 특별한 프로젝트가 없다고 함
==============================================================================================================

- 박원상(부사장, 채용C, 와이즈인포텍)에게 문자, 메일 보냄
 안녕하십니까? 부사장님, 진태만 부장입니다. 
다름이 아니라, 현재 제가 지원 가능한 프로젝트 있습니까?
SM, SI 상관이 없습니다.
------------------------------------------------------------------------------------------

- 이호준(이사, 채용C, U2W, 농협P) 에게 문자 보냄
1. SM 제안 받음
 1) 장소: 한국 거래소(여의도역 5번 출구)
 2) 환경: Linux, jsp, js, node.js, git, java, sql, Shell script, 플로우 젝스 프레임웍(교육 예정)
 3) 단가: 750(SM: 반 프리) 
==============================================================================================================

- WEB2 - Node.js[생활코딩]
https://www.youtube.com/watch?v=3RS_A87IAPA&list=PLuHgQVnccGMA9QQX5wqj6ThK7t2tsGxjm
==============================================================================================================

- 모바일 신분증(PASS앱 운전면허과 차이)
- 모바일 운전면허증과 PASS앱 운전면허 확인서비스는 어떻게 다를까?
https://www.youtube.com/watch?v=X2_T4_oZ6Uo

- “스마트폰만 들고 나가자” PASS 앱 속으로 들어온 주민등록증, 운전면허증 / 14F[모바일 신분증]
https://www.youtube.com/watch?v=80YmXrnD00c
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.04(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 구운 김(5개[개당 8장]: 5천원 --> 6개: 총 3만원) 구입(13:00, 남구로 시장)

- 자체 휴가[★]
==============================================================================================================

- LG U+ GCP 데이터 CRM_PDA 현행화개발 Prj 투입 예정
1. 프로젝트명: CRM 현황화 필요 데이터 적재를 위한 GCP 데이터 CRM_PDA 현행화개발
2. 사업장: 퀸즈파크9 사옥 1층(발산역)
3. 마당ID 신청서 작성 후 유승현 전문에게 메일로 보냄 ==> 유플러스_마당ID_신청_애버커스(진태만).xlsx
4. 기간: 2023.04.10 ~ 06.30
5. 단가: 750
6. 기타
 1) 퀸즈파크9 사옥 1층 출근( 이병욱 팀장님께 010-2798-0775  연락)
 2) 진태만님, 박묘숙님, 전필관님 04월10일(월) 투입 예정
==============================================================================================================
 
- [너무쉬운 금융용어 경제용어 14] 공매도 | 무한대의 손해를 볼 수도 !!
https://www.youtube.com/watch?v=JhOLRd3YhvU
1. 주식을 빌려서 미리 판 후에 주식으로 되갚아야 한다.(주가가 하락할 것을 예상)
==============================================================================================================

- 미성년자 체크카드 발급방법 은행별로 설명해드립니다(신한,국민,우리,농협)
https://youtu.be/Hqebo4vc8KI
A. 농협 은행(만 12 ~13세(부모님동행 필수)): 2025년 9월 24일[진수종 만 12세]
1. 법정대리인 신분증, 2. 미성년 기준의 기본 증명서, 3. 가족관계 증명서
==============================================================================================================
 
- 바다에서 건져올린 생선이 어묵이 되기까지
https://www.youtube.com/watch?v=P_KG8sELrMA
1. 어묵 재료: 작은 갈치, 연육(명태나 생선을 갈아서 덩어리로 만든 것)

- 어묵 하면 부산어묵! 하루 60톤을 만드는 어묵 명가 '부산어묵공장'
연육(명내타 생성을 갈아서 덩어리로 만든 걸
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.05(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 하루 종일 비(06시 ~ ), 도보(11:50, 도림천: 비 많이 옴[비옷 상의 착용])

- 자체 휴가[★]
==============================================================================================================

- 어묵 무침[★]
1. 재료: 어묵 무침 6kg[6개), 양념(간장, 고추가루, 올리고당)
2. 요리법
 1) 반찬통(큰 것) 2개에 어묵을 2번 담기
 2) 커피 포터에 뜨거운 물을 끓어서 어묵을 반찬통에 넣고 30초 정도 데워줌
 3) 어묵을 건져서 찬물이 들어 있는 반찬통에 넣어 식혀 줌
 4) 어묵을 채반에 건져내서 물기를 뺀 후 반찬통에 넣음 ==> 3kg씩 2개의 반찬통 만듬(2번 반복)
 5) 양념을 넣고 버무림(간장이 너무 적게 들어가서 싱거움)
==============================================================================================================

- 엄마 경동맥 수술(14시, 에스 포항 병원)
1. 수술 부위는 경동맥 색전술
 1) 경동맥 3/4 막힘 ==> 뇌경색 협착증 --> 경동백 성형 및 스텐트 삽입술 ■■■ 
 2) 그냥 방치하면 1년 내에 뇌졸중 진행된다고 함
=============================================================================================================

- 2023년 1.4학년 학생 정서·행동 특성 검사 실시
https://eduro.sen.go.kr/spe_see_sm01_000.do
1. 남부초 4학년 1반 22번 진수종

- [초등학교 학부모용] 2023년 학생정서·행동특성검사 동영상 설명자료[학생건강]
https://www.youtube.com/watch?v=YIPC3Yxpcq8&t=2s
==============================================================================================================

- CPU는 어떻게 작동할까?
https://www.youtube.com/watch?v=Fg00LN30Ezg

- 전기자동차 모터는 어떻게 작동할까?
https://www.youtube.com/watch?v=OcYdo3-Tx_o&list=PLDyNXNTVeXjpdXP5ZPjhy1tZDRdtTIGyv
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.06(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>

- 자체 휴가[★]
==============================================================================================================

- 자체 휴가[★]
05:05 기상
05:10 조식
05:25 실내 도보
07:00 종료
07:30 인터넷 서핑
11:35 중식 
11:41 도보 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
13:04 귀가
14:00 생애 최초 주택 구입자 취득세 환급 신청 안내 분석 및 신청서 작성
17:00 집 출발(도보)
17:05 신사동 주민센터 방문 ==> 가족관계 증명서, 주민등록 등본 무료 발급(무인발급기에서 주민번호, 지문[우 엄지] 입력)
17:10 귀가
17:15 석식
17:40 실내 도보
17:55 종료
18:00 집 출발(자전거, 수종)
18:05 착한 미용실 원투쓰리(신림역 1번 출구 방문 ==> 대기 0명
18:08 이발(수종, 커트: 6천원)
18:45 귀가(비 조금 옴)
18:50 실내 도보
19:35 종료
20:00 인터넷 서핑
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.07(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 23.05.07(월) 서울행(19:21) -> 서울(21:59), KTX-산천 252] 예매(05시)

- 자체 휴가[★]
==============================================================================================================

- 자체 휴가[★]
05:05 기상
05:10 조식
05:25 실내 도보
07:00 종료
07:30 인터넷 서핑
11:35 중식 
11:45 집 출발(도보) => 도림천 => 신림2교 => 신림2교 교차로 => 쑥고개(경사 급함)
12:11 관악구청 재산 취득세과(2층) 방문 ==> 생애최초 주택 구입자 취득세 환급 신청 제출
12:30 담당 공무원 도착 ==> 생애최초 주택 구입자 취득세 환급 신청서 확인(2,200,000원 1주일 내로 확급해 준다고 함)
12:55 다이소 보라매점 방문 ==> 1. 실리콘 수세미 장갑(양손)(설겆이용, 3천원), 2. 실리콘 흡착 칫솔 걸이(화장실용, 천원), 
		3. 알뜰 치약 짜개(2개입, 천원), 4. 과탄산 소다(용기): 직사각형, 2천원), 4. 옷걸이 겸용 바지 걸이(수종, 천원)
13:20 귀가
14:00 인터넷 서핑
17:25 석식
17:40 실내 도보
20:00 인터넷 서핑
22:00 취침
==============================================================================================================

- 생애최초 주택 구입자 취득세 환급 신청(13시, 관악구청 재산 취득세과)
1. 취득세(3,080,000원) ==> 환급금: 2,200,000원[신한은행 계좌로 입금 받을 예정]
---------------------------------------------------------------------------------------------------------------

- 생애최초 주택 구입자 취득세 환급 신청 안내[관악구청]
https://www.gwanak.go.kr/site/gwanak/ex/bbs/View.do?cbIdx=239&bcIdx=138343
▣ 대상자
   - 2022.6.21. 이후 생애최초 주택을 취득하여 납세의무가 성립한 자
   - 주택취득가액 12억 원 이하의 생애최초 주택을 유상거래로 취득한 자
 ▣ 신청 방법
   - 해당 취득세를 신고·납부한 시·군·구청 세무부서에 신청 ==> 관악구청 재산 취득세과(김도연: 02-879-5417)
   - 제출 서류
      ① 생애최초 주택 구입 취득세 감면 신청서
      ② 지방세 과세표준 및 세액 등의 결정 또는 경정 청구서
      ③ 지방세 환급청구서, 지방세 환급금 지급청구서
      ④ 주민등록 등본[주민센터 ■], 가족관계증명서[주민센터 ■]
		
- 생애최초 주택 구입 취득세 감면 200만원 경정청구 신청하고 왔습니다!
https://www.youtube.com/watch?v=V1Ey7jQW5y0
==============================================================================================================
 
- 2023.03.30(목) 혈액 검사 결과(최희정 내과)
1. 당화혈색소(Hemoglobin A1c, HbA1c): 6.6
2. 빈혈 수치가 낮아짐: 13g/gL --> 10.5g/gL
 1) 위장 대장 내시경 해보라고 함(김민아 원장이 전화로 상담해줌, 09:30)
 2) 빈혈 수치: 피의 헤모글로빈(Hb) 수치를 측정하는 항목, 혈색소의 정상 범위: 13g/DL 이상
------------------------------------------------------------------------------------------------------------------

- 빈혈수치 낮을 때 체크해야 할 습관 3가지, 정상빈혈수치와 빈혈수치가 내려가는 원인
https://www.youtube.com/watch?v=f1yAGHrbo5I

- [황성수TV] 빈혈, 느낌으로 판단하지 말고 검사 수치로
https://www.youtube.com/watch?v=3WRkEfI4VDs
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.04.08(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
07:05 기상
07:10 조식(수종: 돈까스)
07:30 실내 도보
08:15 종료
08:00 집 출발(자전거: 수종)
08:20 보라매 공원 도착
08:30 수종이랑 보라매 공원 운동장에서 야구
08:50 종료
09:00 귀가
09:10 인터넷 서핑
10:50 수종 센터로 감
11:30 중식
11:50 집 출발(도보): 도림천
13:04 귀가
13:20 인터네 서핑 
15:25 수종 엄마집에 놀러감
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.04.09(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:44 기상
06:00 조식(수종)
06:25 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(반환점) ==> 도림천)
08:00 종료
08:10 인터넷 서핑
12:00 중식
11:50 집 출발(도보): 도림천
13:04 귀가
14:00 집 출발(도보) => 도림천 => 서울대 벤처 타운역(반환점)
14:20 다이소 신림점 방문 ==> 1. 맥스틸_HDMI 케이블(2 m, 5천원), 2. 스텐 비누 받침대(2천원), 3. 마우스 패드 둥근형( 천원) 구입
15:00 귀가
15:10 인터넷 서핑
17:30 석식(수종)
17:45 실내 도보
19:10 종료
20:30 청소(청소기, 밀대)
21:00 수종 귀가
21:20 염색(실패: 흰 머리 보임)
21:55 샤워(온수: 체중: 70.1kg ==> BMI: 24.91[과 체중])
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.10(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> LG U+ GCP 데이터 CRM_PDA 현행화개발 Prj 투입, 엄마 퇴근(12시, 저녁에 전화 함)

- LG U+ CRM_PDA 현행화 Prj[★]
- LG U+ GCP 데이터 CRM_PDA 현행화개발 Prj 투입
04:50 기상
05:00 조식
05:25 실내 도보
06:00 종료
06:15 집 출발(노트북, 모니터)
06:26 신대방역 => 영등포구청역 => 발산역
07:30 발산역 9번 출구 도착
07:30 LG 사이언스 파크(LG U+(E11) 지하 도착
08:50 퀸즈파크10 7층(716호)에서 김묘숙 책임 만남 ==> 이병욱 팀장(010-2798-0775, 현장 관리인)에게 연락
09:00 출근
10:00 회의 ==> (주)에버커스 미래사업본부 Data 서비스 운영팀 김일기 수석(PM)이 프로젝트 계요 설명
12:00 중식(김묘숙 책임, 전필관 책임)
12:20 종료
12:25 LG 사이언스 파크(LG U+(E11) 지하에서 도보
12:55 종료
13:00 근무
18:00 퇴근
18:10 다이소 방화점 방문 ==> 구입 
18:50 귀가
19:00 석식(
19:20 집 출발(도보)
19:30 다이소 난곡 사거리점 방문 ==> 1. 네오셀 알카라 인건전지 LR6(AA) 10개입, 2천원), 2. 세척솔(대, 천원) 구입
19:45 귀가
19:30 대문 도어락 건전지 교체
19:35 실내 도보
20:30 종료
20:40 인터넷 서핑 
22:00 취침
==============================================================================================================

- LG U+ CRM_PDA 현행화 Prj 정보
1. 와이파이: Airport 5G/abcd1234ok!
2. 도어락: 0130*
==============================================================================================================

- U+ U Cloud
1. https://ucloud.lguplus.co.kr, tamario/8a60d5c85c 
2. 외부 접속 IP: 211.44.220.135
-----------------------------------------------------------------------------------------

- 결제 신청
1. Cloud PC 신청
https://ucloud.lguplus.co.kr/vmCube/Management/Desktop/RequestCreate
 1) 협력사 보안 Cloud PC (W10_IT)

2. 외부접속/모바일앱사용 신청
https://ucloud.lguplus.co.kr/vmCube/Management/VPN/VPNRequest
==============================================================================================================

- LG U+ CRM_PDA 현행화 Prj 정보
1. 구글 BigQuery ==>  
==============================================================================================================

- BigQuery를 효과적으로 사용하는 방법
https://www.youtube.com/watch?v=y1mcayr1G_4&t=264s

- 갈아먹는 BigQuery [1] 빅쿼리 소개
https://yeomko.tistory.com/27
1. 구글 BigQuery는 이름에서 알 수 있듯이 엄청나게 큰 데이터에 대한 SQL 쿼리를 빠르게 수행해주는 google cloud platform의 
서비스 중 하나입니다. 
==============================================================================================================
 
- IBM Netezza 데이터 웨어하우스 어플라이언스를 Oracle Autonomous Data Warehouse로 이전
https://docs.oracle.com/ko/solutions/migrate-netezza/index.html
1. PDA 솔루션(IBM) 
 1) Google Bigquery ==> IBM PDA(PureData Analysis) DB(Netezza)
==============================================================================================================

- IBM Netezza에서 마이그레이션 
https://cloud.google.com/bigquery/docs/migration/netezza?hl=ko

- IBM Netezza SQL 변환 가이드
https://cloud.google.com/bigquery/docs/migration/netezza-sql?hl=ko
==============================================================================================================

- 테이블 데이터 내보내기
https://cloud.google.com/bigquery/docs/samples/bigquery-add-column-query-append?hl=ko

- GCP 빅쿼리(BigQuery) 코딩없이 데이터 전송하기ㅣ 실전! 구글 클라우드(GCP) 가이드 - Data & AI 편 01.
https://www.youtube.com/watch?v=oz2rEEq_aI0
==============================================================================================================

- 생애최초 주택 구입자 취득세 환급(13시, 관악구청 재산 취득세과)
1. 취득세(3,080,000원) ==> 환급금: 2,203,680원[신한은행 계좌로 입금 받음]
---------------------------------------------------------------------------------------------------------------

- 생애최초 주택 구입자 취득세 환급 신청 안내[관악구청]
https://www.gwanak.go.kr/site/gwanak/ex/bbs/View.do?cbIdx=239&bcIdx=138343
▣ 대상자
   - 2022.6.21. 이후 생애최초 주택을 취득하여 납세의무가 성립한 자
   - 주택취득가액 12억 원 이하의 생애최초 주택을 유상거래로 취득한 자
 ▣ 신청 방법
   - 해당 취득세를 신고·납부한 시·군·구청 세무부서에 신청 ==> 관악구청 재산 취득세과(김도연: 02-879-5417)
   - 제출 서류
      ① 생애최초 주택 구입 취득세 감면 신청서
      ② 지방세 과세표준 및 세액 등의 결정 또는 경정 청구서
      ③ 지방세 환급청구서, 지방세 환급금 지급청구서
      ④ 주민등록 등본[주민센터 ■], 가족관계증명서[주민센터 ■]
		
- 생애최초 주택 구입 취득세 감면 200만원 경정청구 신청하고 왔습니다!
https://www.youtube.com/watch?v=V1Ey7jQW5y0
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.04.11(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 출근할 때 이어폰 가져옴(07시), 중식(11:50, 김밥: GS25 강서 LG 사이언스점, 비 약간 옴)

- LG U+ CRM_PDA 현행화 Prj[★]
- BigQuery 분석 
- BigQuery를 효과적으로 사용하는 방법
https://www.youtube.com/watch?v=y1mcayr1G_4&t=264s 
==============================================================================================================
  
- GCP 빅쿼리(BigQuery) 코딩없이 데이터 전송하기ㅣ 실전! 구글 클라우드(GCP) 가이드 - Data & AI 편 01[클루커스].
https://www.youtube.com/watch?v=oz2rEEq_aI0
1. GCP
https://console.cloud.google.com
==============================================================================================================

- 실전! 구글 클라우드(GCP) 가이드[클루커스]
]https://www.youtube.com/watch?v=dTt3Nknsq68&list=PLQ1xZQIEWsHcBRoR0eGnU1TMJMP26dSdV
==============================================================================================================

- BigQuery 시작하기[SKplanet Tacademy]
https://www.youtube.com/watch?v=MILy4dzSGk4&list=PL9mhQYIlKEhc42aoo-zvaSVOFCqGBD4ev
==============================================================================================================

- BigQuery를 활용한 구글 클라우드 기반 데이터 분석[토크아이티 웨비나] [kIT]
https://www.youtube.com/watch?v=zugzsyTavik
==============================================================================================================

- 주 모니터 만들기
1. 디스플레이 확장 ==> 주 모니터 만들기
-----------------------------------------------------------------------------------------------

- 윈도우10 듀얼모니터 주모니터 설정 방법
https://extrememanual.net/35728
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.04.12(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 중식(11:40, 바나나[루옌이 어제 수종이 편으로 갖다 줌]), PM, PL 서울역 Prj 견학(09:00 ~ 13:00)

- LG U+ CRM_PDA 현행화 Prj[★]
- BigQuery 분석  
==============================================================================================================

- Cloud PC 재 신청(결재 처리)
1. Cloud PC 사양: 업무 Cloud PC(통합OSS-WIN10)
[업무클라우드 신청]
신청사유 : CRM 데이타 현행화 프로젝트 수행

[보안클라우드 신청]
신청사유 : CRM 데이타 현행화 프로젝트 수행
• 접근제어시스템 : DB
• 접근제어시스템 ID : tamario
• 담당업무: CRM 데이타 현행화 프로젝트 수행
-------------------------------------------------------------------------------------------------------------------------------

- 외부접속/모바일앱사용 재 신청(결재 처리)
1. 요청사유(상세히) : CRM 데이타 현행화 프로젝트 수행
==============================================================================================================

- Cloud PC 결재 후 조치
1. 업무 클라우드 실행
 1) 정보보안 교육(17시)
 2) 메신저 실행(M Messenger)
2. 보안 클라우드 실행
==============================================================================================================

- CPU 잡아먹는 완전 하마 3개 파일[노트북 팬 소음]
https://answers.microsoft.com/ko-kr/windows/forum/all/cpu-%EC%9E%A1%EC%95%84%EB%A8%B9%EB%8A%94/15cbe383-154a-4686-ba86-2775da78b2ad  
-----------------------------------------------------------------------------------------------------------------------------

- 윈도우 프로세스 searchprotocolhost.exe 설명 및 중지 방법
https://cloud-information.tistory.com/12
1. Microsoft Windows Search 인덱서 ==> SearchIndexer.exe
1) 파일, 전자 메일 및 기타 콘텐츠에 대한 콘텐츠 인덱싱, 속성 캐싱 및 검색 결과를 제공
==============================================================================================================

- 개발시 데이터베이스 선택 가이드 (총정리)
https://www.youtube.com/watch?v=ZVuHZ2Fjkl4
==============================================================================================================
 
- 2시간만에 웹서버 쉽게 개발하기(Node.js + MongoDB)) [코딩애플]
https://www.youtube.com/watch?v=-zOfTS1HQTc&list=PLfLgtT94nNq1qmsvIii_CAxFlD7tvB5NE

- (Next.js 0강) 요즘 프론트엔드만으로 먹고살기 힘든 이유[코딩애플]
https://www.youtube.com/watch?v=jYJ3ygUfPrU
==============================================================================================================

- [Korea] Cloud OnBoard -Google Cloud Fundamentals (Jan 2022) [Google Cloud APAC]
https://www.youtube.com/watch?v=eZCnpzMPnpw&list=PLWYw-NqNglu78PvB3PmUBbaCBAom6spTT
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.13(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★]
- BigQuery 분석  
==============================================================================================================
 
- 결재 신청 관련 교육(10시, LG U+ CRM Prj)
1. 강사 : 이병욱 책임 
==============================================================================================================

- 결재 신청 
12-1. 방화벽 신청 ==> 완료[♥♡]
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유 : CRM 데이타 현행화 프로젝트 수행
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.18.195.34 		6. TCP: 6005~6009,6014-6114
7. 사용 목적: INFORMATICA 관련 방화벽 해제 요청
==> 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
==============================================================================================================

- DB 교육(13:30, LG U+ CRM Prj, 임원실)
1. 강사 : 정지은 책임
2. 내용 : GCP에서 Outbound로 보내는 작업에 대한 교육
==> 내용이 방대하여 강사가 내용 정리 후 다시 교육 하기로 함
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.14(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 휴무(LG 그룹 창립 기념일)

- 휴무[★]
05:51 기상
06:06 조식
06:15 실내 도보
07:40 종료
08:00 집 출발(자전거: 수종)
08:10 보라매 공원 도착
08:15 수종이랑 보라매 공원 운동장에서 야구
08:30 종료
08:35 귀가
09:00 인터넷 서핑
11:30 중식
11:50 집 출발(도보): 도림천
13:04 귀가
13:20 인터네 서핑
17:30 석식
17:45 실내 도보
19:10 종료
20:00 수종 엄마집에 놀러감(이번주 토요일 센터 휴무[월 4주 만 근무])
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 키움히어로즈 유니폼 가격
https://blog.naver.com/yangllll/222885428895
1. 일반형 유니폼(버건디 색상｜L 사이즈) : 59,000원
2. 이정후 선수 마킹 비용 : 20,000원 ===> 총: 79,000원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.04.15(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
06:09 기상
06:18 조식(돈까스 2개)
06:38 집 출발 ==> 도보(도림천 => 서울대 벤처 타운역(반환점) ==> 도림천)
08:10 종료
08:20 인터넷 서핑
11:30 중식(컵라면, 돈까스 1개)
12:30 청소(청소기, 밀대)
12:50 종료 
13:00 집 출발(도보, 비옷 상의 착용[칫솔, 핸드폰 충전기]: 비 그침) => 신대방역 => 도림 사거리 => 신풍역
13:46 영등포역(2번 출구) 도착
14:17 영등포역 출발[무궁화호 1215]
18:09 동구역 도착(5분 연착)
18:10 동구역 출발(도보) => 범어네거리 => 수성구청 => 수성 경찰서
18:30 언제나 좋은날 도착(4기형들 만남(제헌이형, 용호형, 명걸이형, 종환이형))
		==> 5기들 만남(종윤이, 성호, 현구, 인표, 광영이, 일현이, 현노, 상진) --> 술, 만담
		==> 1. 4기, 5기 만남 정례화 합의(1년에 한번), 2. 회장: 최종윤  --> 모임 회비 5만원씩 납부
20:55 종료
21:10 노래방(5기들, 3인[팁 만원 줌]): 인표 집에 감
22:38 막창집(4기형들, 5기들): 광영이 집에 감
23:30 모임 공식 종료
23:35 택시(종윤이, 현노, 현구), 택시2(상진이, 성호)
23:55 모델 도착(호텔 플레이 22)
24:10 곰장어집(종윤이, 현노, 현구, 상진이, 성호)
01:30 모델 도착(종윤이, 현노, 현구, 상진이)
02:00 샤워
02:10 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.04.16(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
08:05 기상
08:30 프로야구 하이라이트 시청
09:00 샤워
09:20 모텔 출발(현구와 헤어짐)
09:30 조식(누리 마을 감자탕 동대구점, 뼈 해장국[맛 없음], 현노, 상진): 현노가 쏨
10:00 종료(상진와 헤어짐)
10:10 동대구역 도착 ==> 서울행 입석 구입[17,500원] --> 현노와 헤어짐
10:15 도보 ==> 동대구역 -> 동대구로 => 신청4동 주민센터 => 동대구터미널
11:00 종료
11:31 동대구역 출발[무궁화호 1212] ==> 4호차에서 앉아서 감
13:17 영등포역 도착
13:17 영등포역 출발(도보)
14:17 귀가
14:20 인터넷 서핑
17:30 석식(컵라면, 돈까스 1개)
17:45 실내 도보
19:10 종료
19:15 수종 귀가
19:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 서울행 입석 구입
1. 서울행[23.04.16(일) 무궁화 동대구(11:31) -> 영등포(15:15), 영수액: 17,500원]
==============================================================================================================
 
- 무궁화호 입석 이용시 꼭 들를 4호차 타고 여유와 멋을 경험하기
https://www.youtube.com/watch?v=22OskMjJkJY
==============================================================================================================

- 학생검진 문진표 작성하기(클릭!)
https://www.eo-m.com/2023/HSP/HSP_student.asp?hNo=11101288
1. 남부초 4-1 22번 진수종
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.17(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>

- LG U+ CRM_PDA 현행화 Prj[★]
- BigQuery 분석
==============================================================================================================

11-4. PDA Client Tool(Aginity) 설치 설치 ==> 완료[♥♡]
[ 전사 공요 소프트웨어(보안망용) ] -> [ 03.업무용 SW ] -> [ 04.BDP ] -> [ PDA 어질리티 ]의 
AginityWorkbenchSetupx86.exe 실행 후 계속 다음 클릭하여 설치 완료 
1. Conmnec to PureData System for Analytics(새창)
 1) Saved: PDA_DEV
 2) Server: 172.18.192.65(개발계),  172.18.192.55(운영계),			Ssl Mode: Allow
 3) User ID: METASEL, PW: metasel2021
 4) Database:   ---> 2개 중에 선택
 5) Port: 5480
==============================================================================================================

- 주피터: 파일 열기
https://nomad-programmer.tistory.com/18
==============================================================================================================

- Airpoort: 배치 스케줄러
==============================================================================================================

- Part1 회의(09:40, 회의실)
1. 최성오(책임, PL), 오재영(책임, 신림), 박묘숙(책임), 전필관(책임)
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.18(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 포항행[서울(20:37) -> 서울(23:07), KTX-산천 251]: 태정 상

- LG U+ CRM_PDA 현행화 Prj[★]
- GCP 교육(15:30, LG U+ CRM Prj)
1. 강사 : 정지은 책임
2. 내용 : GCP에서 Outbound로 보내는 작업에 대한 교육
===========================================================================================================

- GCP 비밀번호 초기화(Data Lake에서)
1. GCP 계정 상태 --> 비밀번호 초기화 
==> https://console.cloud.google.com, tamairo@lgupluspartners.co.kr
==============================================================================================================

13-1. GITLA 방화벽 신청 ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: GITLAB 접근을 위한 방화벽 해제 요청
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.20.45.201 		6)서버 포트: 5480■
7. 사용 목적: GITLAB 접근을 위한 방화벽 해제 요청
==> http://gilab.lguopuls.co.kr
==============================================================================================================
 
- Google Cloud BigQuery의 Data Transfer Service 설정
https://console.cloud.google.com/bigquery/transfers/configs/create?project=galvanic-asset-383407
1. 소스 유형: Google Cloud Storage ■
2. 전송 구성 이름: sample_test 
3. 일정 옵션
 1) 반복 빈도: 커스텀
 2) 반복 간격: every 15분
==> 지금부터 "every 15분" 커스텀 일정으로 실행되도록 예약되었습니다.

4. 대상 위치 설정(전송 데이터의 대상 위치 선택)
 1) 데이타 세트: sample_test ==> 목적지 ■
5. 데이터 소스 세부정보
 1) 목적지 tabel: startC_table  ==> 미리 만들어 놓음 ■
 2) Choose Storage URI: chocus_sample_test/DTS_smaple>test/*_c*   ==> Cloud Storage에서 가져올 URI(미리 만들어 놓음) ■
 3) Write preference: MIRROR
 4) File Format: CSV  
-----------------------------------------------------------------------------------------------------------------------
   
- GCP 빅쿼리(BigQuery) 코딩없이 데이터 전송하기ㅣ 실전! 구글 클라우드(GCP) 가이드 - Data & AI 편 01[클루커스].
https://www.youtube.com/watch?v=oz2rEEq_aI0
==============================================================================================================

- 다시 그리는 데이터 웨어하우스 그리고 BigQuery[Google Cloud APAC]
https://www.youtube.com/watch?v=JT52dzuBpPE
==============================================================================================================
 
- 미국 상위 1% 부자들이 늙지 않기 위해 하는 일 | 건강 습관, 노화 방지[책식주의] 
https://www.youtube.com/watch?v=6moz0JNvU1Y
1. 걷기 운동(종아리 강화↑) --> 스쿼트(허벅지 강화 ↑)
==============================================================================================================

- 포항행(태정 상) [★]
04:57 기상 
05:00 조식 
05:25 집 출발(도보: 비 조금 옴[비옷 상의 착용]) ==> 도림천
06:17 신대방역 -> 영등포구청역 
06:50 발산역(9번 출구)
07:00 출근
11:40 중식(김밥: GS25 강서 LG사이언스 점[LG CNS: 지하])
11:50 도보
12:40 귀사
13:00 업무
18:00 퇴근
18:40 귀가
18:45 석식 
19:17 집출발(도보)
19:29 504번 버스 탑승(남서울 중 정류장) 
20:05 서울역 도착
20:37 서울역 출발(포항행[23.04.18(화)  KTX 서울(20:37) -> 포항(23:07), 53,600원])
23:08 포항역 도착 
23:10 택시(포힝역 => 시티병원 장례식장), 8,100원)
23:21 시티병원 장례식장 도착
23:25 태정 조문 ==> 오경이형, 진오 만남, 태정 와이프, 아들 면담(태정 와이프 계좌에 5만원 송금)
		--> 태정 뇌출혈로 사망(고혈압, 술, 담배, 무지)
		--> 포항계 계원 조문(주남이형, 진호형, 승표, 봉춘, 정철)하고 갔다고 함
24:07 종료
24:10 시티병원 장례식장 출발(도보)
01:00 포항집 도착 ==> 엄마가 내부에서 문 잠가놔서 전화하고 초인종 누르고 난리 침
01:30 취침
04:30 기상
04:40 조식(밥, 계란) ==> 카카오 택시 호출
05:00 집출발
05:03 카카오 택시 탑승(리플러스 마트 앞) ==> 택시(포힝집 => 포항역): 73,00원
05:13 포항역 도착 ==> 도보
05:37 포항역 출발(서울행[23.04.19(수) KTX 포항(05:37) -> 서울(08:00), 53,600원])
08:00 서울역 출발(공항 철도)
08:30 마곡 나루역 하차(4번 출구)
08:45 출근
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.04.19(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:45 ~ 18:00 ==> 주간보고(15시), 포항집 수종방 재 도배(5월 5일)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
==============================================================================================================

16-1. DBeaber 접속  ==> 결재 완료[♥♡]
■ 마당 > See All > IT지원 > 시스템계정통합관리(IT) > 신청/승인 > 공용계정 신청 > DBMS 접속 신청(화면)
==> 미등록 시스템 신청(버튼): 클릭 > 미등록 시스템 신청(DBSAFER 접속권한 신청)
1. 시스템명: PEDC 					2. 시스템 유형: ALTIBASE(선택)
3. 시스템 계정: usr_dags_own
4. 미등록 시스템 접속 신청
1) 승인자 선택: 홍진경(책임)
 2) 신청사유: CRM 데이타 현행화 프로젝트 수행
 3) 요청IP: 172.28.185.187(보안 클라우드 IP) 
5. DBMS 접속 신청 정보
 1) 시스템명: PEDC					2) 시스템 유형: ALTIBASE
 3) 계정명: usr_dags_own			4).서버 IP: 172.31.94.7
 5).사용자 IP: 172.28.185.187(보안 클라우드 IP)	 	6).서버 포트: 10001
   
■ 요청처리 결과 조회
1. 요청구분 ==> 요청구분: DBMS 접속, 시스템 타입: DBMS, 승인상태: 요청(1) 
==> DB명: db_dags, 시스템 계정: usr_dags_own, PW: own@1234
==============================================================================================================

- Pair 프로그래밍 회의(14:30, LG U+ 지하 커피샵)
1. 박묘숙(책임), 전필관(책임) ==> 커피 3잔(2,980원: 내가 쏨)
2. 출입증 수령( LG U+ 업무 지원 센터: 1375)tamairo@lgupluspartners.co.kr
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.20(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 김영식 책임 투입(계대 경영학과 91학번: 총 10명)  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
==============================================================================================================
 
- 중식
11:40 삼계탕(마곡 삼계탕: 유승현 전무): 박묘숙, 전필관 책임 ==> 유승현 전무가 쏨
 --> LG U+ CRM_PDA 현행화 Prj 3개월 단위로 재계약 --> 잘하면 12월까지 간다고 함
12:00 커피(뜨아): 박묘숙, 전필관 책임 ==> 유승현 전무가 쏨
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.21(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
==============================================================================================================
 
02. DLK(Data Lake)   ==> 완료[♥♡]
1. https://gitlab.dlk.lguplus.co.kr, tamario@lgupluspartners.co.kr/8a60d5c85c(마당 최초 비밀번호)
 --> #dlk1234 --> as**12**!!로 변경
 1) dlk_old2new ===> project/nedp[/dlk_old2new 
2. 새 비밀번호 설정에서
 1) 현재 비밀번호:#dlk1234
 2) 새 비밀번호: as**12**!!
 3) 비밀번호 확인:  as**12**!!
-------------------------------------------------------------------------------------------------------------

03. GitLab ==> 완료[♥♡]
1. http://gitlab.lguplus.co.kr, tamario/as**12**!!로 변경
 1) dlk_airflow_01   ===> project/nedp[/dlk_airflow_01
=============================================================================================================

- 보안 클라우드 파이썬 환경 설정(/py_upload_dsgn_v1.0.xlsm 파일 내용)  ■■■
01. DLK(Data Lake) --> 연결
1. https://gitlab.dlk.lguplus.co.kr   1) project/nedp[/dlk_old2new 
 1) dlk_old2new/py_src/ 템플릿/py_upload_dsgn_v1.0.xlsm 파일 다운로드로 받음  ==> 파일 작업
 
 1) 파이썬 인프리터 설치  ==> 안함 
 2) Git 소스 다운로드
 3) 파이썬 라이브러리 설치
 4) GCP CLI 설정
==============================================================================================================
 
 ■■■■■■■■■■■■■■■■■■ 2023.04.22(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
06:06 기상
06:36 조식(수종: 돈까스 4개)
07:00 실내 도보
08:20 종료
08:30 집 출발(자전거: 수종)
08:35 보라매 공원 도착
08:35 수종이랑 보라매 공원 운동장에서 야구
08:52 종료
09:00 귀가
09:10 인터넷 서핑
10:40 수종 센터로 감
11:30 중식
11:50 수도 검침 --> 2022년 04월지침[2023.04.22(토)]: 0648 / 사용량 2 ㎥  --> 2022년 05월분 예상요금	7,310 원(감면: 600원) 
		===> 모바일 아리수 웹에서 처리
11:45 집 출발(도보): 도림천
13:04 귀가
13:20 인터네 서핑
15:40 수종 엄마집에 놀러감
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 리코더(피리) 구입(수종 음악 준비물)
- 엔젤 AWR AP 알토 리코더 음악준비물 학습용, 독일식(G), 가격: 11,300원 
http://item.gmarket.co.kr/Item?goodscode=1428776929
https://www.enuri.com/detail.jsp?modelno=11074405
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.04.23(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:06 기상
06:15 조식
06:30 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:51 귀가
07:20 인터넷 서핑
11:30 중식
11:50 집 출발(도보): 도림천
12:51 CU 신림4동점 방문 ==> 우산 구입(캐시워크 모바일 쿠폰(만원), 카드 500원 결제)
13:04 귀가
12:45 스쿼트 챌린지 앱 설치 및 운동 테스트 ==> AI 코칭: 대만족(첫날 500개 연습 함)
14:00 인터넷 서핑
14:10 집 출발(자전거)
14:15 다이소 난곡 사거리점 방문 ==> 로션 없음
14:20 GS25 신대방노블점 방문 ==> 총 18,400원(부족한 금액(400원) 현대카드로 결제)
14:15 다이소 보라래점 방문 ==> 바세린 데일리 모이스쳐 로션(180ml): LG U+ Prj용, 2천원), 모던 비누 케이스(2천원) 구입
15:25 수종 귀가 ==> 수종이 엄마한테 오이(한 봉지), 메추리 알(마이산 메추리알 장조림: 1kg) 받아옴
17:30 석식(수종)
17:45 실내 도보
19:10 종료
20:15 청소(청소기, 밀대)
21:00 샤워(온수: 체중: 69.5kg ==> BMI: 24.05[과 체중])
22:30 취침
==============================================================================================================

- 2023.04.23(일) 캐시워크(걷기 어플) E-쿠폰으로 CU 편의점에서 물건 구입(14:20, GS25 신대방노블점
1. 캐시워크 앱 ==> 내 쿠폰함
2. 2022.03.24(목) 캐시워크 CU 모바일 상품권 구입
1) CU 모바일 상품권 5천원권(7,000캐시) 2장 구입
 2) GS25 모바일 상품권 5천원권(7,000캐시) 3장 구입
 3) 기타: 서울 중앙 혈액원(헌혈) GS25 3천원 쿠폰
==> 총 25,000원(35,000 캐시 사용)
3. CU 편의점에서 구입한 물건(GCU 신림4동점에서 구입)
1) 우산 만원
==> 총 10,500원(부족한 금액(500원) 현대카드로 결제)
3. GS25 편의점에서 구입한 물건(GS25 신대방노블점에서 구입)
1) 작은밥 150G(3개): 3,400원
2) 오뚜기밥 210G(흰밥, 3개): 4,000원
3) 매운 고추 참치: 4,400원
4) 엄마 깻잎(2개), 6,600원
==> 총 18,400원(부족한 금액(400원) 현대카드로 결제)
==============================================================================================================

- 스쿼트 챌린지 - AI코칭 홈트 운동습관 PT 다이어트
https://play.google.com/store/apps/details?id=ai.hnh.squat_challenge&pcampaignid=pcampaignidMKT-Other-global-all-co-prtnr-py-PartBadge-Mar2515-1

- 스쿼트 챌린지
https://www.hnh.ai/docs/products/squatChallenge
==============================================================================================================

- 마이산 정기담은 메추리알 장조림(냉장) 1kg, 가격: 7,900원
https://www.enuri.com/detail.jsp?modelno=82464864
==============================================================================================================

- 비만도 계산(옥천군청 보건소)
https://www.oc.go.kr/health/contents.do?key=1487&
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.24(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
1. 파이프 라인 및 작업 절차
2. 메타 작성하기
2.1. 테이블 정의서 작성
2.2. ETL 정의서 작성
2.3. L1 정의서 작성하기

3. 설계서 업로드
 1) \L0BIM_DCT_CALENDAR.xlsx에서 1, 4 Tab 작성
  가. D:\ob_dsgn\L0BIM_DCT_CALENDAR.xlsx 파일을 해당 폴더에 붙여넣기
  2) \L0BIM_DCT_CALENDAR.xlsx파일에서 테이블 정의서 업로드를 템플릿(작업 화면 Tab)에서
   가. OB 설계서 업로드: 클릭 ==> 설계서 업로드 처리 완료
 
4. 자동화 웹 사용
4.1. SQL 생성
4.2. DAG 생성
4.3  테이블 생성

5. 수집 자동화
5.1. 테이블 정의서 작성
5.2. ETL 정의서 작성
==============================================================================================================

- python 환경 변수 설정
0  python
1. 윈도우 Tray > 찾기: 환경 변수: 조회 ===> 계정의 환경 변수 편집: 클릭 ==> 환경 변수(새창)
 1) 편집(E): 클릭 ==> 새로 만들기(N): 클릭 ==> Python 설치된 폴더(/Scripts)
C:\Python\Python38
C:\Python\Python38\Scripts
> set
> python ==> Python SW 설치 여부 확인  ■■■  
------------------------------------------------------------------------------------------------------------------

- python 내부 또는 외부 명령 실행할 수 있는 프로그램 또는 배치 파일이 아닙니다
https://studyhard24.tistory.com/232
==============================================================================================================
 
- 회의(09시, 주초 회의, 회의실)
1. 업무 전반 설명(PM)
==============================================================================================================

- 커피(09:30, 최성호 PL)
1. 매머드 익스프레스 마곡 보타닉 파크 타워 2차점(뜨아[1,200원]: 최 PL이 쏨)
==============================================================================================================
  
- 교육(13:30, 회의실)
- DLK OB 작업 교육((주)인포젠 이병욱 챔책임)
==> DLK OB 작업 샘플 테스트 완료
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.25(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 중식(11:40, 오유미당 마곡점: 등심 돈까스(2개), 순두부 짬뽕 쌀국수: 30,500원: 박묘숙, 김영식 책임: 내가 쏨)
									--> 도보(12:15, 퀸즈파크10 빌딩 3층, 4층[비 조금 옴]), LG U+ 홍진경 책임(PM) 방문(16:30)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
==============================================================================================================

- BigQuery 연결(DBeaver에서)
1. 드라이버 관리자
 1) BigQuery 드라이버 설정
  가. Libraries  Simba....zip 파일 추가
  나. Drive Properties > User Properties
ProxyHost:  172.31.88.7
ProxyPort: 3128

 2) ODBC드라이버 설정
  가. Libraries  jdbcOdbc.dll/jdbc-odbc-bridge-jre7.jar 파일 추가

  3) Window ODBC 설정
   가. OAuth Mechanism ==> Catalog: gcp-prod-edp-lake  ==> OK
------------------------------------------------------------------------------------------------------------

- DBeaver 사용 가이드 (1) 설치 및 데이터소스 연결
https://velog.io/@2innnnn0/dbeaverguide
1. Google BigQuery와 연동하기
==============================================================================================================

- User Properties
ProxyHost:  172.31.88.7
ProxyPort: 3128
==============================================================================================================

- Git 명령어 @@@
$ git init 	- 저장소 만들기

$ git status   - 현재 상태 확인
 
$ git commit -m 'Add test[by tamario]"

$ gitcommit -am 'Add f1.txt' 	 -- add와 commit 동시에 사용

$ git push
 
$ git log  		-- 파일 로그 보기(역사)
$ git log -p  	-- 파일 로그 보기(역사): 소스상의 차이점 분석

$ git diff commit_01..commit_02		-- 차이점 분석
-----------------------------------------------------------------------------------------------

$ git add . 			-- 해당 폴더의 전체 파일 add
$ git add f1.txt .  -- f1.txt 파일 commit 대기 상태에 들어감(stage area에 올라감)
==> 1. stage area: commit 대기하는 곳, 2. repository: 저장소(commit한 결과가 가는 곳)
$ git commit add f1.txt

$ git branch <브랜치이름>   			-- 새 브랜치 생성 (local로 만듦)
$ git checkout -b <브랜치이름>	-- 브랜치 생성 & 이동
-------------------------------------------------------------------------------------------------------------

- [GitHub] Git 명령어 모음
https://velog.io/@delilah/GitHub-Git-%EB%AA%85%EB%A0%B9%EC%96%B4-%EB%AA%A8%EC%9D%8C
==============================================================================================================

- 제대로 파는 Git & GitHub - 깃 끝장내기
https://www.youtube.com/watch?v=1I3hMwQU6GU
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.04.26(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주간보고 작성(10:30)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
==============================================================================================================

- 비밀번호 변경 패턴[2023.04.26(수)]
1. asas12*2!■, qwqw223*@■, zxzx334*#■
==============================================================================================================
 
- 회의(09:30, 회의실)
1. GCP 추출 작업
 1) 변경 분 적재(376건: GCP에서 PDA로 운영 중) ==> 특정 일자(6/9) 이후 적재되도록 처리 --> 예) 6/9 ~ 6/25
 2) 초기 적재(100건: PDA 미존재 파일) ==> 테이블 파악 후 신규로 처리
==============================================================================================================

- 인포메디카 교육(13:30,LG U+ CRM Prj)
1. 강사 : 이상용 책임
2. 내용 : 인포메디카 교육 --> 교육이 두서가 없고 준비가 안되어 이해하기 힘듬
==> PDA 적재 작업: 김일기 PM이 최성오 책임(PL), 오재영 책임이 전담해서 PDA 개발하라고 함
==============================================================================================================

- Pair 프로그래밍 회의(16:00, 매머드 익스프레스 마곡 보타닉 파크 타워 2차점)
1. 박묘숙(책임), 전필관(책임) ==> 커피 3잔(8,000원: 박묘숙 책임이 쏨)
2  개발 협의
==============================================================================================================

- 피부 노화를 예방하는 방법은 무엇일까? [EBS 컬렉션 - 사이언스]
https://www.youtube.com/watch?v=r2E-33PHycE
==============================================================================================================
  
- 청와대 방문(13:30 ~ 15:00)
https://reserve1.opencheongwadae.kr/reserved/76dc2db445a44f579eddc5aba1efa08f

- 청와대 관람 포인트 10가지
https://www.youtube.com/watch?v=tM2mNqYYnCo
==============================================================================================================

■■■■■■■■■■■■■ 2023.04.27(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 이병욱 책임 가족 코로나 확진

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
1. OIF 코드: DL_EP_009(개발 서버), DL_EP_010(운영 서버)
==============================================================================================================

- cherry-pick(체리픽)
https://zakelstorm.tistory.com/29
1. 정의: 다른 브랜치 위에 있는 커밋을 선택적으로 내 브랜치에 적용시킬 때 사용하는 명령어  
 1) 다음과 같이 commit 상황을 가지는 Master 브랜치와 Feature 브랜치가 있다. 
 a - b - c - d   Master
         \
           e - f - g Feature
 2) Master 브랜치에 Feature의 e와 g를 뺀 f 커밋만 merge 하고 싶다.
1. $ git checkout master
2. $ git cherry-pick 76ae30ef 			// 76ae30ef: Feature f commit의 id
 a - b - c - d   Master - f
         \
           e - f - g Feature
==============================================================================================================

- 모바일 POP 충전(GS 25 편의점) [23.04.27(목)] ■[E] 
1. MY > 결제 장보 > 모바일앱 충전기 > 모바일앱(새창)
1) 충전하기(버튼): 클릭 ==> 간편 충전 --> 신용카드: 현대카드(5만원 결제) --> 잔액: 54,066원
==> GS 25 편의점에서 중식 결제용으로 주로 사용(우리동네 GS 앱에서)
==============================================================================================================
  
■■■■■■■■■■■■■ 2023.04.28(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 분석
1. OIF 코드: DL_EP_009(개발 서버), DL_EP_010(운영 서버)
==============================================================================================================

- 어린이란 선물
20:00 집 출발
20:05 자전거 타이어 바람 꺼짐
20:15 도림천 자전거 수리 센터 도착 ==> 타이어 공기 주입(자동 자전거 타이어 공기 주입기 사용): 바람 잘 들어감
20:30 이마트 구로점 방문(자전거, 수종)  ==> 아디다스 센들 240m(39,900원, 수종 어린이날 선물),  야구 방망이(11,000원),  빗자루(6,000원)
노브랜드 짧은손목 고무장갑 3켤레(1,800원) ==> 수종이와 자전거타고 돌아 올 때 소나기 조금 맞음
 ==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.04.29(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 비 옴

- 주말[★]
006:43 기상(비 옴)
06:55 조식(수종: 돈까스 4개)
07:10 실내 도보
08:30 종료
09:20 인터넷 서핑
10:25 수종 센터로 감
11:30 중식 
11:45 집 출발(도보:비 조금 옴[우의 상의 착용]): 도림천
13:12 수종 엄마집에 놀러감
13:15 귀가
13:20 인터네 서핑
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑 ==> 험학습신청서(학습계획) 작성
22:30 취침
==============================================================================================================

- 체험학습신청서(학습계획) 작성(2023학년도 교외 체험 학습 신청서 및 보고서.hwp)
1. 체험명: 은천지역아동센터 어린이날 행사
2. 장  소: 서울랜드
3. 학습계획
- 안전수칙을 잘 지키며 다양한 놀이시설을 즐겁게 체험한다.
- 공공장소에서 지켜야 할 질서를 숙지하고 실천한다.
---------------------------------------------------------------------------------------------------------------------------

- 한컴오피스 한글 표 데이터 가로/세로/가운데 정렬하는 방법
https://mainia.tistory.com/4038
1. 셀에 커서를 두고 오른쪽 마우스를 눌러 문단 모양 메뉴를 선택합니다. 
2. 문단 모양 대화상자에서 기본 탭으로 이동합니다. 그리고 6가지 정렬 방식 중 하나를 선택합니다. 양쪽 정렬, 왼쪽 정렬, 가운데 정렬, 
오른쪽 정렬, 배분 정렬, 나눔 정렬 이 있습니다. 
==============================================================================================================

- 세계적 명의가 제시하는 당뇨병 예방과 완치에 이르는 강력한 도구 ㅣ 당뇨 코드 ㅣ 제이슨펑 ㅣ라이팅하우스
 https://www.youtube.com/watch?v=XE0phsG5D7w&list=WL&index=1
 1. 당뇨 완치 방법(약물 요법X, 식이 요법O)
 1) 당을 적게 먹어라.(체중 감량)
 2) 남은 당을 태워라.(단식, 운동)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.04.30(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:02 기상
06:10 조식
06:30 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:50 귀가
08:00 인터넷 서핑
11:30 중식 
11:45 집 출발(자전거): 뒷바퀴 타이어 공기 빠져서 끌고 감 
12:00 도림천 자전거 수리 센터 도착 ==> 타이어 공기 주입
12:05 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
12:55 다이소 신림점 방문 ==> 1. 오릭스 올데이 선크림 플러스 65ml(3천원), 2. 과일 나라 아프리카 아보카도 핸드 크림(80 ml, 천원) 구입
13:00 도림천 자전거 수리 센터 도착 ==> 타이어 점검 교청(타이어 주입구 고무 무료로 교체 해줌)
13:15 귀가
14:00 인터넷 서핑
16:40 가계부 월말 결산
17:30 석식(수종)
17:45 실내 도보
18:40 수종 귀가(넘어져서 얼굴에 상처 났다고 함: 약 바름)
19:10 종료
20:20 청소(청소기, 밀대)
21:00 샤워(온수: 체중: 70kg ==> BMI: 24.05[과 체중])
22:30 취침
==============================================================================================================
 
- 부모님 편지 작성
- 사랑하는 우리 아들 수종이에게 
수종아, 쌍큼한 봄바람이 새생명을 더욱 싱그럽게 하는 5월이 왔구나.

올 봄 새로  전학온 학교에서 잘 적응해줘서 고맙구나.
수종이는 착하고 따뜻한 어린이인데 성격이 내성적이라 다른 친구에게
먼저 다가가지 못 한 것 같아 안타깝구나,

친구란 먼저 마을을 터놓고 다가가야 얻을 수 있는 소중한 보물이란다.
아빠는 수종이가 좀더 적극적이고 씩씩한 어린이가 되었으면 좋겠다.

매사에 주어진 환경에 감사하고 열심히 살아가는 수종이가 되었으면
좋겠다.

아빠가.....
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 