

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2023.03) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.03.01(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 삼일절[★] 
05:50 기상
06:30 조식(수종: 돈까스)
07:10 집 출발(수종)
07:32 신림역 => 선릉역 => 선릉역 => 기흥역 => 전대.에버랜드역 하차
09:37 전대.에버랜드역 3번 출구
09:50 일현 차 도착(일현, 박인규 만남) ==> 차 탑승
10:00 에버랜드 도착 ==> 일현이가 회사(도로공사)에서 에버랜드 자유 이용권 신청해서 구입(4명: 핸드폰 앱으로 가지고 옴)
10:10 놀이기구 탐
		1. 썬더 폴스, 2.  매직 스윙, 3. 비룡 열차, 4. 비룡 열차, 5. T 익스프레스(시속 104km의 최고 속도와 낙하각 77도 등을 자랑:
		엄청 무서움) ==> 스마트 줄서기 예약(2개까지 가능: 비룡 열차, 5. T 익스프레스 에약)
13:00 중식(핫도그, 치킨, 과자): 박인규가 쏨(3만 2천원)
13:40 사파리 월드(사자, 하이에나, 호랑이, 곰)
15:40 놀이기구 탐 
		1. 콜럼버스 대탐험(바이킹과 비슷) ==> 수종이가 더블 락스핀, 트위스트  무서워서 안 탄다고 함(수종 놀이 기구 잘 탐)
16:50 에버랜드 종료
17:10 일현이 차
17:30 뽕사부 도착 ==> 특수전 학교 입구
17:40 석식(짜장면2[15,000원], 짬봉2[22,000원]: 37,000원): 내가 쏨
18:55 종료
18:00 박인규 차(그랜처) 탑승
18:36 성균관대역 도착 ==> 인규가 태워줌
18:40 성균관대역 => 신도림역 => 신대방역
19:45 귀가
20:00 집 출발(자전거: 수종)
20:20 이마트 구로점 도착 ==> 카카오프렌즈 야구글러브_대(17,900 원), 카카오프렌즈 야구글러브_중(15,900원), 윌슨 안전 야구공 2입(8,800원) 
		, 헬로 키티 - 학생 실내화(9,980원) 구입
20:00 귀가
20:20 인터넷 서핑
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.02(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==> 수종이랑 도림천에서 야구(07:40,. 처음)

- 자체 휴가[★]
1. MSI 노트북 설치 및 환경 설정
=============================================================================================================

- 수종 전학 처리(08:30, 남부초)
- E알리미 회원 가입
https://www.ealimi.com, tamario@naver.com, as**s1212!!
1. 진수종: 남부초 4학년 1반 22번
 1) 담임: 가인영 선생님
------------------------------------------------------------------------------------------

- 수종이한테서 우리반 우체통 받음(20시, 집)
1. 남부 가정 통신
2. 하이 클래스 앱 설치
 1) 활용 동의서 작성
3. 학습 환경 조사서 작성
=============================================================================================================
 
- 다이소 보라매점 방문(20:00)
1. 수종 속옷 구입
 1) 남성 소프트 드로즈(95, 3천원), 남성용 냉감 런닝(95, 3천원)
2  수종 파자마 구입
 1) 패턴 파자마 상의(M, 5천원)
3. 수종 양말 구입
 1) 신사 단목 양말(7컬레, 7천원)
4. 수종 모자 구입
 1) 배색 투톤 캡 모자(3천원) 
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.03.03(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==>

- 자체 휴가[★]
- NexacroN 분석
1. NexacroN_SetupStudio_x64.exe 설치
==> C:\EduProjectN\EduProjectN.xprj
==> C:\EduProjectN\00. Document\
============================================================================================================

- [정기] 넥사크로 N
https://www.youtube.com/watch?v=wGrGZ48xKrc&list=PLgoHUQa-ZzHA8TEIwVYspbaosEtItwNK9 
=============================================================================================================

- 용산 방문[★]  
12:00 중식
12:30 집 출발(자전거:)
13:30 MSI 노트북 A/S 센터 방문(용산) == > MSI 노트북 소음 점검(A;S 직원이 부하 테스트 했는데 소음 안남: 소음은 원인은 메인보드,
		팬이 문제 인데 팬을 교체하면 20만원 비용 발생: 포기), 노트북 DDR5은 현재의 노트북에 장착 불가능하다고 함)
13:45 용산 출발(자전거: MSI 노트북) => 노들역 ==> 노량진역 => 신대방삼거리역
14:30 다이소 보라매점 방문 ==> 1. 수종 속옷 구입 3벌식 구입, 타월 팔꿈치 밴드(3개): 아령용 구입
15:15 귀가
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.03.04(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==>

- 주말[★] 
05:22 기상
05:30 조식
05:45 실내 도보
07:10 종료
07:10 조식(수종)
07:50 집 출발(자전거: 수종)
07:55 보라매 공원 도착
08:00 수종이랑 보라매 공원 운동장에서 야구
08:50 종료
09:00 귀가
09:20 집 출발(자전거: 수종)
09:35 서울 하이안 치과 방문
10:30 진료(수종: 수종이 왼쪽(윗쪽) 어금니거 덮어쓰운게 불편....다시 덮어 씌우기(1년 후 다시 난다고 함)
		==> 덮어 씌우기 치료(15,500원)
10:50 종료 ==> 수종 센터로 감
11:05 다이소 보라매점 방문 ==> 패턴 파자마 상의(L, 5천원), 스판 수영모(수종, 2천원) 구입
11:20 귀가
12:00 중식 
12:20 집 출발(도보) 
13:34 다이소 보라매점 방문 ==> 패턴 파자마 하의(L, 5천원) 구입
14:10 귀가 ==> 수종 엄마집에 놀러감
14:20 인터네 서핑
16:30 수종 귀가
17:30 석식(수종: 돈까스)
17:45 실내 도보
19:10 종료 
20:00 집 출발(자전거)
20:20 롯데 시네마 신림점 도착 ==> 10층 팝콘 점원에세 롯데시네마 영화 관람권 비밀번호 틀린 것, 앱으로 직접 넣어 달라고 부탁
	     --> 롯데시네마 영화 관람권 4장을 마이 -> 쿠폰함에 넣기 성공 ==> 탑건: 매버릭 2장 예약 성공
20:40 다이소 보라매점 방문 ==> 펠리칸 박스(39*37.5*28 cm): 서랍장(장롱 내부용, 5천원) 구입
21:10 귀가
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 롯데시네마 영화 예약
0. 탑건: 매버릭(2D), 27,000원, 예매번호: 6067066
1, 상영일시: 2023.03.05(일)18:50 ~ 21:10
2. 상영관: 신림 아카데미 상영관 (5관)상영관보기
3. 관람인원:성인1, 청소년1
4. 좌석: I9, I10  
----------------------------------------------------------------------------------------------------------------

- 롯데시네마 영화 관람권(기업고객 전용) 4장[헌혈해서 받은 것]
1. 교환권 번호: 1122015658133, Password: zehlzav --> 비밀번호 틀림
2. 교환권 번호: 1122015658331, Password: bvoqseeg --> 비밀번호 틀림
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2023.03.05(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==>

- 주말2[★] 
06:44 기상
06:00 조식(수종)
06:25 집 출발(수종) 
06:30 도보(도림천 => 서울대벤처타운역(반환점) ==> 도림천)
08:00 종료
08:10 인터넷 서핑
12:00 중식(수종: 짜파게티, 컵라면)
12:30 실내 도보
13:50 종료
14:00 인터넷 서핑
17:30 집 출발(자전거: 수종)
17:40 GS25 신대방노블점 방문
17:45 석식(수종: 삼각 김밥, 샌드위치, 돈까스: 9천원)
18:00 종료 
18:20 롯데 시네마 신림점 도착 ==> 12층 5관 I9, I10
18:50 탑건: 매버릭(2D) 관람
20:00 종료 
21:10 귀가
21:15 청소(청소기, 밀대)
21:50 샤워(온수: 체중: 71.5kg ==> BMI: 24.91[표준 체중])
22:30 취침
==============================================================================================================

- 2022년 가성비 벽걸이 에어컨 추천 5 | 6평 7평 10평 13평 16평 | 엘지 휘센, 캐리어 에어컨, 삼성 무풍 에어컨 |
https://www.youtube.com/watch?v=Q3rrBPfEDgU

- 엘지휘센 SQ07BCAWBS 인버터 벽걸이에어컨 7평, 가격: 523,000원
https://www.coupang.com/vp/products/6410171791

- LG휘센 인버터 가정용 벽걸이 에어컨 9평, 가격: 832,000원 ■■■ ==> 8.67평(28.66m)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.06(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==>

- 자체 휴가[★]
06:00 기상
06:10 조식
08:50 집 출발(수종) 
09:00 최준호 내과의원 방문 ==> 진료(수종 감기(코, 기침): 5,2000원)
		==> 진수종 BMI: 22.1(체중: 45.7kg, 신장: 143,9cm)
09:20 조제(클라비 오건조 시럽 125ml, 콜민-에어시럼(비염약), 시네츄리 시럼(기침 가레약), 5,2000원)
09:30 귀가
10:00 어묵(6kg, 6개[5개: 봉 어묵 1개])무침, 고추가루, 간장, 올리고당 사용: 어묵 뜨거운 물에 넣고 찬물에 식힌 후 버무림 
11:00 종료
11:30 중식
30:45 실내 도보
13:00 종료
13:00 인터넷 서핑
16:30 집 출발(자전거) 
16:45 헌혈의집 구로디지털 단지역센터 방문 ==> 전혈 320mL(15번째)
17:10 종료
17:40 귀가
17:45 석식
18:00 종료 
18:10 실내 보도
19:20 종료 
20:00 인터넷 서핑 
22:00 취침
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.07(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==>

- 자체 휴가[★]
============================================================================================================

- 수종 노트북 재 설치
14:00 MSI 노트북: 액정 깨짐(2015.03.07 구매한 물품 ==> MSI 노트북을 HDMI로 모니터 연결해서 모니터만 사용하게 처리
============================================================================================================

- 대형폐기물 배출신청_신청내용확인 및 결제 
1. 대형폐기물 배출안내(관악구) ==> https://www.gwanak.go.kr/site/gwanak/foffice/ex/bigWaste/doBigWasteApprovalForm.do
 1) 소파(3천원), 여행가방(20인치 이상, 2천원)	, 여행가방(20인치 미만, 천원): 수수료 6천원 납부 
============================================================================================================ 

- 드래그 프리(마우스 드래그 & 마우스 우클릭 해제)
https://chrome.google.com/webstore/detail/drag-freemouse-drag-mouse/cnfngpgfjllafbghaimjcmailafcdhod?hl=ko
============================================================================================================
 
- 01. 홍사훈의 경제쇼(KBS1 라디오)
https://www.youtube.com/watch?v=_5JDRTHRvDQ&list=PLFnESzVU01TG3D5Gj2yrv21vkLiHS7If8

- 02. 손에 잡히는 경제 & 플러스[MBC 라디오 시사]
https://www.youtube.com/watch?v=n3FbuMqJnQw&list=PLqCB8pKLc7swJt6lx4jTdq6ObZN7_RI9n

- 03. 경제현장 오늘[SBS Biz 뉴스]
https://www.youtube.com/watch?v=S8_PsCFwlcQ&list=PLwLxLaKRlpvvUhqXgI7PPuxcQn0XQfaDC&index=1
============================================================================================================
 
- 51. YTN라디오 생생 경제
https://www.youtube.com/watch?v=ZghWqboViXY&list=PLMWcf6HwIUthaq7opSRWyvi0rh_mh4MGQ&index=3
 ?v=1McACWUFPM4
============================================================================================================

- 투자의 선배가 전하는 초보 투자자들을 위한 가이드 [오늘 처음 투자를 시작한 당신에게 1-1부] [삼프로TV_경제의신과함께]
https://www.youtube.com/watch?v=cIvdEC-rQpY&list=PLQvqXcm97CTAf0wGhuP11PZaeUqsHIz44
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.08(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==> 대형폐기물 배출(20시, 소파(3천원), 여행가방(20인치 이상, 2천원): 2개만 버림)

- 자체 휴가[★]
============================================================================================================

- 수종 노트북 SW 설치
1. HD에 윈도우 11 설치하여 부팅 속도 느림(SSD에 OS 설치해야 하는데 실수로 함)
============================================================================================================

- 윈도우 11 USB 부팅 디스크 만들기 
- 윈도우11 설치 USB 만들어서 초보자도 실수 없이 설치하기
https://www.youtube.com/watch?v=OFvlkFv-C1E&t=962s
1. Boot Override: UEFI: Boot Override : 부팅순서와는 상관없이 시모스를 빠져나가면서 선택한 장치로 부팅을 시작 
(Boot Option Priorities: 사용 안함: 재부팅시 다시 설치하게 됨)
============================================================================================================== 

- 컴퓨터 최신 윈도우 11 설치 방법[IB 96]
https://www.youtube.com/watch?v=p8_tuB8pMOw
==============================================================================================================

- 컴퓨터 윈도우 11 설치 후 나에게 꼭 맞는 최적화[IB 96]
https://www.youtube.com/watch?v=FzCpchVC3A8
============================================================================================================== 

- 삼성전자 노트북 DDR4-3200 (32GB), 가격: 97,960원 == > 197,960원(2개)
https://prod.danawa.com/info/?pcode=10881360&keyword=DDR4&cate=112752
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2023.03.09(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 05:11 ~ 17:30 ==> 망막 검진 재 예약(08:40, 누네안과 병원), WBC 1차전(12:00, 호주 8: 7 한국)

- 자체 휴가[★]
- NexacroN [기본] 교육 동영상 시청
1. 코드 스누핏
 1) Name: gfn_cmd_02
 2) Shortcut: gfn_cmd_02
 3) Description:
/***********************************************************/
/* 프 로 그 램 : /$FILE_BASE$.xfdl
/* 작 성 일 자 : $DATE$
/* 작  성   자 :  진 태 만
/* 설       명 : 
/***********************************************************/
============================================================================================================

- [정기] 넥사크로 N
https://www.youtube.com/watch?v=wGrGZ48xKrc&list=PLgoHUQa-ZzHA8TEIwVYspbaosEtItwNK9
=============================================================================================================

- 넥사크로 단축키
https://blog.naver.com/PostView.nhn?blogId=jjjhygo91&logNo=221498434956
============================================================================================================
 
- NexacroN 컴포넌트 활용 과정 교육 신청
1. http://support.tobesoft.co.kr/Support/?menu=Education_Condition&page=
=============================================================================================================

- play nexacro
1. https://www.playnexacro.com, tamario@naver.com/asas12**!! 
=============================================================================================================

- 알PDF 모든기능 사용법 강의 PC 활용팁 배우기[IB96]
https://www.youtube.com/watch?v=u89TEDdTrz8
=============================================================================================================
 
- 포지션 제안 받음
1. 수신: (주) 아이엑세스 김주영
2. 내용: 외교부 재외공간 회계시스템 구축(SI) 
 1) 근무지: 광화문 앞
3. 기간: 즉시 ~ 8월말
4. 기술 : java, 전자정부 F/W, exbuilder (공통경험 우대)
5. 단가: 830
=============================================================================================================
 
- WBC 중계(아프리카TV)
https://sports.afreecatv.com/2023wbc/?menu=highlight&subMenu=highlight
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.10(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>

- 자체 휴가[★]
04:35 조식
04:40 조식
05:00 실내 도보
06:20 종료
07:14 집 출발(자전거) => 보라매 공원 => 노량진역 => 노들역 => 동작대교 => 반포 종합운동장 ==> 신논현역 => 언주역
	=> 경복 아파트 사거리  => 르네상스 호텔 사거리 => 선릉역
08:34 누네안과 병원 도착
08:38 15층 도착 ==> 접수, 시력 검사(오른쪽 눈: 0.9, 왼쪽 눈: 0.8)
09:15 13층 망막 센터 도착 ==> 안약 투여, 4가지 안과 검사 
09:30 진료(왼쪽 망막이 약간 부어 있어서 4개월 후 다시 오라고 함[6개월 후 안됨], 백내장 증상이 약간 있다고 함)
09:20 수납(79,600원) ==> 예약(23년 07월 08일(토) 08:40)
09:40 종료
09:47 안과 출발(자전거) ==> 르네상스호텔 사거리 => 강남역(시력이 희미해져 자전거에서 넘어져서 자전거 브레이크 손잡이 깨짐
		, 우측 정강이 깨져서 피 약간 남) => 신논현역 => 반포 종합운동장=> 동작대교 => 노들역 => 노량진역 => 보라매 공원
11:14 도림천 자전거 수리 센터 방문 ==>  자전거 브레이크 손잡이 재고 없음(신규 4만원 예상)
11:21 귀가
11:35 중식
12:00 집 출발(자전거)
12:20 도보(도림천[구로1교])
13:05 종료
12:50 대림 종합 자전거(문영 APT 1806호 근처) 도착 ==> 오른쪽 자전거 브레이크 손잡이 교체(중고, 15,000원) 
13:40 귀가
13:50 인터넷 서핑
17:45 석식
18:00 종료 
18:10 실내 보도
19:20 종료 
22:10 취침
==============================================================================================================

- 엄마 팔순 모임(09시, 경주 누아르 블랑)
1. 9월 30-10월1일(1박)
 1) 70평 복층 ==> 예약 가능 금액: 현금가 85만원
2. 120만원 큰누나 새마을 금고 통장에 송금 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.11(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 주말[★] 
06:50 기상
07:15 조식(수종: 라면)
07:30 실내 도보
09:10 종료
09:15 집 출발(자전거: 수종)
09:20 경성 약국 방문 ==> 조제(수종 발목 삐임 약, 3,000원) 
09:35 보라매 공원 도착
09:40 수종이랑 보라매 공원 운동장에서 야구(포수: 받침대 주워 앉아서 봄)
10:16 종료
10:20 귀가
10:20 수종 센터에 감
12:00 중식 
12:20 집 출발(도보) => 도림천 => 관악 도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점)
		=> 신대방역(화장실) => 신사 시장
14:00 진흥 마트(신사 시장 내) 방문 ==> 동원 프라임 돈까스(560g, 4,980원) 구입
14:10 귀가 ==> 수종 엄마집에 놀러감
14:20 인터네 서핑
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

- 동원F&B 프라임 돈까스 560g (2개), 가격: 8,730원
https://prod.danawa.com/info/?pcode=3102793

- 동원F&B 프리미엄 돈까스 840g (1개), 가격: 6,760원
https://prod.danawa.com/info/?pcode=1971203

- 동원F&B 프리미엄 돈까스 840g(3개), 가격: 11,640원 ■■■

- 하림 텐더 스틱 1kg[2개], 가격: 18,530원
https://www.enuri.com/detail.jsp?modelno=2071402

- 하림 프로라인 안심 통살치킨 1kg[2개], 가격: 17,960원 ■■■
https://www.enuri.com/detail.jsp?modelno=34862761
==============================================================================================================

- 카카오 뱅크 세이프 박스(파킹통장)에 추가 입금
1. 2023.03.11(토): 400만원 입금 --> 합계: 1,100만원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.12(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> WBC 3차전(12:00, 체코 3:7 한국) 

- 주말2[★] 
06:07 기상(흐림)
06:10 조식
06:30 실내 도보
08:00 종료
09:00 프로젝트 가방 정리
10:00 부엌 찬장 정리
11:35 중식
12:20 집 출발(도보: 비 조금 옴, 비옷 상의 착용) => 도림천 => 관악도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리
		(반환점) => 구로교(반환점) => 신대방역(화장실) => 신사 시장
13:13 귀가
14:00 인터넷 서핑
17:35 석식 
17:50 실내 도보
19:10 종료
19:50 수종 귀가
20:20 청소(청소기, 밀대: 수종)
20:40 샤워(온수: 체중: 72kg ==> BMI: 24.91[과 체중])
22:30 취침
==============================================================================================================

- 라스트 패스 비밀번호 변경[2023.03.12(일)]
1. https://lastpass.com/?ac=1&from_uri=/otp.php --> tamario@naver.com, zx**12**!!AA
==============================================================================================================

- 가성비 게이밍 의자 추천 인기 BEST 5
https://www.youtube.com/watch?v=3QWC7kZ4puo
- ROZI 라텍스 프리미엄 게이밍 체어 GP-999, 가격: 137,880원[와우쿠폰할인가]
https://www.coupang.com/vp/products/6095464203
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.13(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> WBC 4차전(19:00, 한국 22:2 중국) ==> 2승 2패로 예선 탈락(일본, 호주 8강 진출)

- 자체 휴가[★]
- NexacroN [컴포넌트 활용] 교육 동영상 시청  
1. Dataset
2. Grid & PopupDiv
3. Form & Dynamic Creation
============================================================================================================

- 업무 생산성을 높여주는 최고의 프로그램(Notepad++) [나도코딩]
https://www.youtube.com/watch?v=r1lpBGlIzY0
1. 파일 비교: 플러그 인 => Compare
2. 매크로

- NotePad++ 10배 활용하기 (Plug-in) [업무의 잔머리]
https://www.youtube.com/watch?v=BlJavPXoOpo&t=301s
02:49 JSON Tools, XML Tools 플러그인

- [SWTT] Notepad++ 설치방법과 유용한 팁들
https://www.youtube.com/watch?v=S6OKiRnu1go
============================================================================================================

- [코딩만화] Scope가 뭔가요? (feat: let, const, var의 차이) [얄팍한 코딩사전]
https://www.youtube.com/watch?v=HsJ4oy_jBx0
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.14(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 자체 휴가[★]
- Nexacro N
1. 2019.08.20_미래신용 정보 LMIS_OffLine, 2018.04_AP QMS_OffLine, 2019.09_GQMS_Tst 복사, 백업
D:\01. TAMA_DATA\03. TAMA Project Source\2019\
==> D:\51. Nexacro\18.04_AP QMS_OffLine
==> D:\51. Nexacro\19.08_LMIS_OffLine
==> D:\51. Nexacro\19.09_GQMS_Tst
============================================================================================================

- 다이소 보라매점 방문(13:00)
1. IN스텐다용도믹싱볼(약16 cm, 천원), IN스텐유광양푼이(약16 cm, 천원), C TO C 케이블(1.8 m, 3천원, 충전기 고장으로 
'사용 불가) 구입
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.15(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 수종이랑 보라매 공원 운동장에서 야구(08:00 ~ 08:25): 수종 영어 노트 구입(08:30, 천원: 문창초 근처 
								바른손 신대방역점)

- 자체 휴가[★]
- [투비소프트 2021 온라인 컨퍼런스] 넥사크로 N - 세부 소개 및 시연 프리세일즈팀_이창현책임,이하영선임
https://www.youtube.com/watch?v=8C5XDvw8yuA
1. 호환성
 1) 넥사크로 17  ==> 넥사크로 N 번환(migration 필요 없음)
2. 생산성
 1) Form Template, Component Preset
  2) Instpector: 목록 표시
  3) Code Assist: 툴값 표시
  4) Code Snippet: 스크립트 자동 완성
3. 편의성
 1) MLM(Multi Layout Management)
 2) STEP
 3) Position
4. 확장성
 1) Module Developer
 2) App Builder
 3) Screen Emulator
============================================================================================================

- 포지션 제안 받음
1. 수신: (주) 마이플랫] 이도경 사원
2. 내용: 동행복권 자금관리업무, 대내외 연계, 데이터 이행(SI) 
 1) 근무지: 서초구 남부터미널
3. 기간: 2023.04.01 ~ 2024.03.31
4. 기술 : Java,, Websquare(예정)
5. 업무: 자금관리, 대내외 연계, 데이터 이행
6. 단가: 780
=============================================================================================================

- 굶지않고 뱃살 내장지방 빼는 방법! 팔 다리는 가는데 유독 배만 튀어나온 복부비만 이라면 꼭 보세요!
https://www.youtube.com/watch?v=YGEFmWodTXo
1.내장 지방: 올챙이배, 피하 지방
============================================================================================================

- 피하지방 vs 내장지방, 어떤 차이가 있을까? [닥터유의 건강이야기]
https://www.youtube.com/watch?v=w_rO0iSBQqA
============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.16(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>  (주)예술과 기술 유승현 전무에서 전화 옴(18:40, NexacroN 강남역 근처 Prj에 지원, 일자리 너무 없다고 함)

- 자체 휴가[★]
- Nexacro N
============================================================================================================== 
 
- 노화를 늦추고 오래 살려면 운동보다 이것을 먼저 하세요[건나물TV]
https://www.youtube.com/watch?v=eUMNEfI-KVo
1. 치매 예장(머리 쓰기)
2. 면역력을 증진해 염증성 질환 관리 
3. 대사 촉진을 위해 비타민과 미네랄, 효소가 풍부한 음식, 유산균 섭취
 1) 유산균: 발효 물질
4. 근력 운동하기
5. 소식
============================================================================================================== 
 
- 쌀 구입
- 홍천 철원 물류 센터 2022 햅쌀 영양쌀 20kg [1개], 가격: 41,980원(현미 쌀 구입할 것)
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=2545461974  ==> 운송장 번호: 35106180336
https://www.enuri.com/detail.jsp?modelno=100887652
=============================================================================================================

- 검은 콩 구입
1. 삼원 농산 서리태 5kg [1개], 가격: 30,630원 
http://item.gmarket.co.kr/DetailView/Item.asp?goodscode=1719212926
https://www.enuri.com/detail.jsp?modelno=41980071
==============================================================================================================
 
- 파인 - 금융감독원(연금)
https://fine.fss.or.kr/main/index.jsp
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.17(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 자체 휴가[★]
- Nexacro N
- NexacroN [기본] 교육 동영상 시청(2번째)
============================================================================================================== 

■■■■■■■■■■■■■■■■■■ 2023.03.18(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 주말[★] 
06:52 기상
07:10 조식(수종: 돈까스, 라면)
07:30 실내 도보
08:00 종료
08:41 집 출발(자전거: 수종)
09:35 남구로 시장 방문
09:16 명동 프라자 방문 ==> 봄옷 한벌(연 회색, 가격: 49,000원, 수종)
09:35 월드 아울렛(엣 소금 창고) 방문 ==> 봄옷 상의(파란색, 가격: 29,800원, 수종)
09:45 명동 프라자 방문 ==> 봄옷 한벌(검정색, 가격: 49,000원, 수종)
09:45 명동 프라자 방문 ==> 겨울옷 한벌(검정색, 가격: 48,000원, 수종)
09:55 종료
10:17 귀가
10:20 수종 센터에 감
12:00 중식
12:20 집 출발(도보) => 도림천 => 관악 도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점)
		=> 신대방역(화장실) => 신사 시장
14:10 귀가 ==> 수종 엄마집에 놀러감
14:20 인터네 서핑
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.19(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 주말2[★] 
07:22 기상
07:30 조식
07:50 도보(도림 도보교 => 동방1교[반환점] => 도림 도보교)
08:20 종료
09:00 인터넷 서핑
11:35 중식
12:00 집 출발(도보) => 도림천 => 관악도림교 => 신대방역 => 구로교(반환점) => 보라매 공원 => CU 관악 신사로점
13:00 귀가
14:00 인터넷 서핑
17:30 석식(라면, 밥)
17:50 실내 도보
19:10 종료
19:50 수종 귀가
20:00 청소(청소기, 밀대: 수종)
20:40 샤워(온수: 체중: 72.3kg ==> BMI: 24.91[과 체중])
22:30 취침
==============================================================================================================

- 냉동 돈까스 구입
- 동원F&B 프리미엄 돈까스 840g(3개), 가격: 11,470원(22,940원[6봉])
http://item.gmarket.co.kr/Item?goodscode=2361712833
https://www.enuri.com/detail.jsp?modelno=2384630
==============================================================================================================

- 오뚜기 오쉐프 돈까스소스 2kg [3개], 가격: 13,720원 ==> 실제 가격: 8,720원[5,000원 웰컴백 할인쿠폰]
https://www.coupang.com/vp/products/1114658907?vendorItemId=79027091286&isAddedCart=
https://www.enuri.com/detail.jsp?modelno=23505882
==============================================================================================================

- 이마트(SSG.COM)
1. https://www.ssg.com, tamario/20**오*h@
==============================================================================================================

- [3분차이] 반도체란 무엇일까? | 반도체 제조공정 | 웨이퍼
https://www.youtube.com/watch?v=2DHAGw274U4

- [3분차이] 메모리 반도체와 비메모리 반도체, 어떤 차이가 있을까? | D램 | 낸드플래시 | 시스템 반도체
https://www.youtube.com/watch?v=nP7JvCjihcA
1. 메모리 반도체(정보 저장)
 1) 휘발성(DRAM(Dynamic Random Access Memory)은 커패시터에 데이터를 저장)): 컴퓨터(Memory: DDR5 64G), 모바일 부품
 2) 비휘발성(낸드 플래시): USB, SSD
 3) 종합 반도체 회사(IDM): 구조 단순
   가. 설계 ==> 제조 ==> 조립/포장
2. 비메모리 반도체(시스템 반도체: 정보 처리)
 1) 컴퓨터의 중앙처리 장치(CPU), 모바일의 중앙처리 장치(AP), 각종 전자 장치
  ) 종합 반도체 회사(IDM): 고도의 설계 기술 필요
   가. 펩리스(설계) ==> 파운드리(제조) ==> 패키지(조립/포장)
---------------------------------------------------------------------------------------------------------------------------

- 비전공자를 위한 반도체 공정 / 제일 쉬운 설명! /삼성전자 SK하이닉스 (Eng sub)
https://www.youtube.com/watch?v=ONXBN9zDVoQ

- 메모리반도체 / D램, 낸드/ 삼성전자 SK하이닉스 (Eng)
https://www.youtube.com/watch?v=9a5fv9OJ2fQ
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.20(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>  

- 자체 휴가[★]
- NexacroN [컴포넌트 활용] 교육 동영상 시청(2번째)
============================================================================================================

- 자체 휴가[★]
05:06 기상
05:10 조식
05:30 실내 도보
07:00 종료
07:10 인터넷 서핑  
08:47 집 출발(수종) 
08:52 최준호 내과의원 방문 ==> 진료(수종 감기(코, 기침): 3,700원)
		==> 진수종 BMI: 21.7(체중: 44.2kg, 신장: 142,7cm)
09:10 조제(클라비 오건조 시럽 125ml, 콜민-에어시럼(비염약), 시네츄리 시럼(기침 가레약), 세토렌정 325mg(해열 진통제)
	    , 뮤크라제정(소염 효소제): 5,4000원)
09:25 귀가 
09:30 인터넷 서핑  
10:00 화장실 세면기 막힘 수리: 물 잘 안 내려감 ==> 1. 세면기 밑에 있는 호스 관(길이 30cm)를 손으로 빼냄, 2. 호스 윗 부문을
		손을 돌려서 안에 있는 이물질 제거, 3. 호스 관 제결합
10:10 화장실 세면기 PUSH 안 눌러짐 ==> 손톱으로 가장 자리 눌러서 뺌
11:35 중식
11:55 집 출발(도보) => 도림천 => 관악도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
		=> 신대방역(화장실) => 신사 시장
13:00 종료
13:00 인터넷 서핑
14:00 집 출발(자전거)  
14:10 보라매 공원: 쓰레기(생선 뼈)
14:20 대림 자전거 방문 ==> 자전거 브레이크 점검(패달 밝을 때 진동, 소리가 나고 속도가 느림): 양호하게 수리됨
14:45 이마트 구로점 방문 ==> 이마트 노브랜드 노블 3겹 화장지 33m [30롤 x 1팩]., 가격: 9,900원(9,980원: 80원 포인트) 구입 
15:12 귀가
15:20 인터넷 서핑
17:45 석식
18:00 종료 
18:10 실내 보도
19:20 종료 
20:00 인터넷 서핑 
22:00 취침
============================================================================================================

- 수종 팬티 구입
- TRY 트라이 남 키즈키오 삼각 3매, 사이즈: 85, 가격: 7,206원(7,510원 + L.POINT: 304P)
https://www.lotteon.com/p/product/LO1431242340?sitmNo=LO1431242340_1431242341
https://www.enuri.com/detail.jsp?modelno=28530448
=============================================================================================================
 
- 스마일 페이 해지
https://club.gmarket.co.kr
 [스마일페이] [오후 3:38] [스마일페이] 스마일클럽에서 결제하신 금액이 취소 되었습니다.
- 결제 수단 : 현대카드
- 결제 금액 : 30,000원
- 결제일 : 2023-03-20
카드사에서 결제일 기준 5일 이내 취소가 정상적으로 진행될 예정입니다.
=============================================================================================================
   
- 삼성 갤럭시 스마트폰 화면 캡처 단축키 해제
1. 설정 ==> 유용한 기능 ==> 화면 캡처 및 화면 녹화 ==> 화면 캡처(새창)
1) 화면 캡처 툴바: 체크 해제
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.03.21(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 수종 줄넘기 구입(08:40, 천원: 문창초 근처 바른손 신대방역점)

- 자체 휴가[★]
- NexacroN [컴포넌트 활용] 교육 동영상 시청(2번째)
=============================================================================================================

- [토크멘터리 전쟁史] 29부. 몽골전쟁사 2 몽골제국의 정복전쟁[국방TV]
https://www.youtube.com/watch?v=-LVCtbWaM80&list=PLMVkaEHUCNifZmtAbntsh2QWizZosBhsg&index=29
=============================================================================================================
 
- OSB 저축은행 예금 만기 해약(부모님 돈) [22023.03.21(화)]
1. 예금명: 복리정기예금 ==> 계좌번호: 00321-24-0821479 ==> OSB 저축은행 앱으로 예금 해지 처리
==> OTP 인증 실패로 0311-13-0065099(E-보통예금) 통장에서 출금 실패[직접 방문해서 처리할 것]
2. 가입일자: 2022년 03월 21일
3. 만기일자: 2023년 03월 21일
4. 가입기간: 12개월
5. 이율: 2.4% ■■■
6. 예치금액: 16,232,816원 ==> 만기예상지급액: 16,566,835원
7. 출금계좌번호: 00311-13-0065099(E-보통예금), 예금주: 진태만
 1) 해지계좌 비밀번호: 5201
8. 인터넷으로 가입 ==> https://ibs.osb.co.kr/ib20/mnu/BNK00047?ib20_wc=WID00056:WID00057
https://www.osb.co.kr/ib20/mnu/HOM00091
9. OSB 저축은행 앱으로 예금 신청 
=============================================================================================================
  
- 웰컴 저축은행 PLUS 보통 예금 가입(부모님 돈) [2023.03.21(화)] ==> 실제 사용 안함
1. 예금명: PLUS 보통 예금 => 계좌번호: 066-01-13-2181439(06601132181439)
2. 가입일자:  
3. 만기일자: 
4. 가입기간: 12개월 
5. 간편 비밀번호: 033912 
=============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.03.22(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 2023 WBC 결승(08:00, 미국 2 vs 3 일본): 일본 우승[세기의 대결 오타니 vs 트라웃! 오타니 승]

- 자체 휴가[★]
- NexacroN [컴포넌트 활용] 교육 동영상 시청(2번째)
=============================================================================================================

- 자체 휴가[★]
05:10 기상
05:20 조식
05:30 실내 도보
07:00 종료
07:30 인터넷 서핑 
11:35 중식
11:44 집 출발(수종이 자전거[잘 나감]) => 신림역 => 사당역 => 이수역 5번 출구
12:30 OSB 저축은행 이수지점(미송타워 12층) 도착 
12:35 은행 업무 ==> OTP 발생기 신청(신규 발급은 무료(이후 비용 5천원 발생):한국정보인증 OTP 발생기 무료로 수령
		--> OTP 등록(은행원이 해줌), 타행 공인인증서 등록(앱에서 등록) --> 예금된 돈 신한은행으로 이체 성공
12:52 은행 업무 종료
13:40 귀가 
14:00 인터넷 서핑 
14:30 OSB 저축은행 예금(부모님 돈) 16,232,816원[3.7%]
17:30 석식
17:50 실내 보도
19:05 종료
19:30 인터넷 서핑
22:00 취침
=============================================================================================================

- OSB 저축은행 예금(부모님 돈) [2023.03.22(수)]
1. 상품명: 인터넷 복리정기예금 ==> 계좌번호: 00311-24-1841347
2. 가입일자: 2023년 03월 22일
3. 만기일자: 2026년 03월 22일
4. 가입기간: 36개월 
5. 예금 이율: (수익율: 3.906%) 3.7% ■■■
6. 예치금액: 16,566,825원 ==> 만기예상지급액: 16,232,816원
7. 과세구분: 일반
8. 출금계좌번호: 00311-13-0065099(E-보통예금), 예금주: 진태만
 1) 해지계좌 비밀번호: 52**
9. 자동 만기 연장: 원금 연장 
10. OSB 저축은행 앱으로 예금 신청 
=============================================================================================================

- OTP 등록(웰컴 저축은행 앱에서 처리) ==> TEST
1. 업체명: 한국정보인증(구. 미래테크놀리지)
2. S/N(일련번호): 500279101 
=============================================================================================================

- OSB 저축은행
https://ibs.osb.co.kr/ib20/mnu/BNK00177, tamario/20**오*h@
=============================================================================================================

- 디지털 OTP는 무엇일까요?(모바일 OTP)
https://www.youtube.com/watch?v=55CbpRDp2Vk
=============================================================================================================
 
- 모바일 운전면허증의 모든 것! 담당자가 알려드립니다. [행정안전부]
https://www.youtube.com/watch?v=xntwdBPyioo
- 모바일 운전면허증 발급 방법 및 주의사항, 블록체인 DID, NFC IC 면허증
https://www.youtube.com/watch?v=XqRvKzj0sMY
- 모바일 운전면허증 발급 방법 / 효력 / 사용처 / 발급비용
1. IC운전면허증으로 교체 재발급할 경우 한글 전용은 13,000원(경찰서 방문)
=============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2023.03.23(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 자체 휴가[★]
- NexacroN [컴포넌트 활용] 교육 동영상 시청(2번째)
=============================================================================================================

- 4세대실손보험 설계사도 잘 모르는 치명적인 단점! 주의하세요
https://www.youtube.com/watch?v=WYAem1fqHZg

- 4세대 실비보험/실손보험 전환 절대 고민하지마세요!
https://www.youtube.com/watch?v=-p0r8lNxVEk
=============================================================================================================

- 싱크대 배수구 청소방법/ 냄세 악취도 제거할수 있는 대박 청소방법/ 매직청소TV
https://www.youtube.com/watch?v=EuzXmGxkKVA

- 싱크대 배수구 청소 악취제거
https://www.youtube.com/watch?v=bVgv44zmxVg

- 8개월 동안 별짓을 다해도 냄새가 나던 화장실
https://youtu.be/byuSORk_tgM
=============================================================================================================

- 보령약국에 전화
1. 스트립지(케어센스N 혈당지) 가격: 13,000원(1통: 50개): 개당 260원 ==> 너무 비쌈 
=============================================================================================================
 
- 남부초 4학년 1반 수종 담임 선생님 상담(16시)
1. 선생님께 수종이 가정 환경 설명
2. 선생님 조언
 1) 수종이와 같이 수학 공부
 2) 수종이 독서 지도
  가. 학교 도서관 개방 
=============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2023.03.24(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 자체 휴가[★]
- [특강] 넥사크로 N Quick Code
https://www.youtube.com/watch?v=Ev62oMWInXY&list=PLgoHUQa-ZzHACLhqV6Cyz3P9OlYfZU4s1&index=1
1. Quick Code: 코드-블럭화(Code-Block)를 통해 개발 기간을 획지적으로 낮추고, 쉽고 빠른 애플리케이션 구축
==============================================================================================================  
 
- 다이소 추천템ㅣ시들지 않아 공간의 아름다움을 채우는 프리저브드 플라워&블랙체리향 디퓨저ㅣ오늘도 다이소 가시나요? daiso
https://www.youtube.com/watch?v=P5HmEhyASGs
=============================================================================================================  

- 자체 휴가[★]
05:20 기상
05:30 조식
05:40 실내 도보
07:00 종료
07:30 안방 책상 위치 변경(07:30, 창문 정면에서 창문에서 90도로 변경[장롱과 나란히 정렬)
08:10 도보(집 근처에서 책상위에 고정할 나무 받침대 2개 주워옴)
08:20 귀가
08:25 나무 받침대 2개로 책상 위 모니터 받침대로 사용(책상 조립 후 남은 받침대 2개도 같이 사용함)
08:55 종료
09:00 인터넷 서핑 
11:30 중식
11:55 집 출발(도보) => 도림천 => 관악도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
		=> 신대방역(화장실) => 신사 시장
13:05 종료 ==> 집 근처에서 나무 받침대 1개(흰색) 주워와서 책상 위(우측)에 받침
13:35 수종이 하교
12:40 집 출발(자전거: 수종) => 신사동 주민센터 입구 => 디지털단지 입구 교차로 => 이마트 구로점 => 영서초 => 구로리 어린이 공원
		=> 구로 구청 => 구로역 => 구로 교차로 => 고척역
14:20 고척 스카이돔 도착
14:28 야구장 입장(티켓팅한 앱 보여줌: 시범 경기 평일 무료): 처음 야구장에서 야구 관람
14:30 원정 관중석(3루석): 17T(D-13, 14)에 착석 ==> 시범 경기 키움: 삼성 전 7회말 진행 중
15:44 종료 ==> 키움 3: 4 삼성
15:50 야구장 출발(자전거: 수종) => 고척역 => 구로 교차로 => 구로역 => 구로 구청 > 거리공원 오거리 => 도림천 => 대림역 => 신대방역
16:48 보라매 공원 
16:50 수종이랑 보라매 공원 운동장에서 야구
17:20 종료
17:33 다이소 보라매점 방문 ==> 알레 디퓨저 50ml(엘레강스 라벤더향, 안방용, 천원), 디퓨 저용액(리필) (150ml)(블랙 체리, 2천원)
		DIY 두꺼운 섬유 스틱10P(블랙, 천원), DIY 심플 원형 디퓨저 유리병(200 ml, 천원), 수종 팬티 3벌(95, 9천원) 구입
17:50 귀가
18:00 석식(수종, 돈까스)
18:20 실내 보도
18:20 수종 엄마집에 놀러감
19:35 종료
19:40 인터넷 서핑
22:00 취침
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.25(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 주말[★] 
06:52 기상
07:10 조식(수종: 돈까스)
07:30 도보
08:00 종료
08:41 인터네 서핑
10:17 귀가
11:00 중식
12:20 집 출발(도보) => 도림천 => 관악 도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점)
		=> 신대방역(화장실) => 신사 시장
13:06 귀가 ==> 수종 엄마집에서 센터 종료 후 귀가
14:20 인터네 서핑
17:30 석식(수종, 돈까스)
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 에덴 디지털향 분사기(방향제 자동 분사기)사용 방법-에덴의 향기(방향제)
https://www.youtube.com/watch?v=tWmRL0m2eUA
==============================================================================================================  
 
■■■■■■■■■■■■■■■■■■ 2023.03.26(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 

- 주말2[★] 
07:22 기상
07:30 조식(수종: 짜파게티, 라면)
07:50 실내 도보
08:20 종료
09:00 인터넷 서핑
11:35 중식(수종, 돈까스)
12:00 집 출발(도보) => 도림천 => 관악 도림교 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점)
		=> 신대방역(화장실) => 신사 시장
13:05 귀가
14:00 집 출발(자전거, 수종) => 보라매 공원 => 보라매역 => 대방역 => 여의교 = > 여의교 오거리(샛강역) => 성모병원앞 교차로
	   => 여의도 한강 공원 => 원효 대교 => 여의 나루역 => 마포 대교 => 서강 대교(휴식)
14:60 여의도 출발(자전거, 수종) =>국회 의사당 => 여의 하루 IC 교차로 => 여의2교 => 서울교 => 여의도 샛강생 태공원 문화 다리
		=> 여의교 오거리(샛강역) => 대방역 
15:40 다이소 대방점 방문 ==> 오리온 후라보노 용기(62g, 2천원: 수종 껌), TPR 걸이형 수세미 받침(천원) 구입
16:25 귀가
16:30 인터넷 서핑
17:30 석식(수종)
17:50 실내 도보
19:10 종료 
20:00 청소(청소기, 밀대: 수종)
20:40 샤워(온수: 체중: 71.3kg ==> BMI: 24.91[과 체중])
22:30 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2023.03.27(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 엄마 에스 포항 병원(19시, 경동맥 3/4 막힘)

- 자체 휴가[★]
- [특강] 넥사크로 N Quick Code
https://www.youtube.com/watch?v=Ev62oMWInXY&list=PLgoHUQa-ZzHACLhqV6Cyz3P9OlYfZU4s1&index=1
1. Quick Code: 코드-블럭화(Code-Block)를 통해 개발 기간을 획지적으로 낮추고, 쉽고 빠른 애플리케이션 구축
- [QuickCode]활용(play nexacro에서)
https://www.playnexacro.com
1. Learn ==> 조회: Quick Code: 클릭
==============================================================================================================  
 
■■■■■■■■■■■■■■■■■■ 2023.03.28(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>  

- 자체 휴가[★]
- 넥사크로 소스 정리
==============================================================================================================  

■■■■■■■■■■■■■■■■■■ 2023.03.29(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>  

- 자체 휴가[★]
- 넥사크로 소스 정리
==============================================================================================================  

- 자체 휴가[★]
05:15 기상
05:20 조식
05:10 실내 도보
07:00 종료
07:30 인터넷 서핑
11:35 중식
11:45 집 출발(자전거) ==> 도림천
12:00 대림 종합 자전거(010-5398-6720: 문영 APT 1806호 근처) 방문 ==> 수종 자전거 핸들 바구니 달기(만 3천원)
12:35 종료
12:41 도보 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
13:31 귀가
14:20 집 출발(자전거) ==> 도림천
14:33 대림 종합 자전거 방문 ==> 기존 중고 자전거 교체[Black Cat: 2번째, 2만원): 기존 자전거에서 핸들 바구니, 뒷 안장, 따릉이 
		옮겨서 달아 줌 --> 집에 가다가 패달 낡아서 떨어짐(다시 와서 패달 중고로 교체: 패달 보호대(3찬원)은 서비스로 해줌)
15:35 종료 
15:55 귀가
16:00 인터넷 서핑
17:30 석식
17:50 실내 도보 
19:05 종료
22:00 취침
==============================================================================================================
 
- 최강볼펜
https://www.youtube.com/watch?v=9WdXyYCLuew&list=UULFKAUgJoPB6gddAnkcyRWQSw

- 야구부장의 크보 핵인싸
https://www.youtube.com/watch?v=ZdVffRID-90&list=UULFgIArNc-zdwFDmZm0X9QE_A

- 파비슈
https://www.youtube.com/watch?v=Tp-YHEfrnZw&list=PLiKwuy4PmXvYxkgnV8Vz7JUqh_W7TEYiU&index=1

- 뭐니볼TV
https://www.youtube.com/watch?v=6r5Uu1T2omg&list=UULF3UqLOQCkW8rI8Pl9doGWsQ

- DKTV Daniel
https://www.youtube.com/watch?v=qHcYCekM9CM&list=UULFZeHMSqeusVpF1hBOtnxIoA
==============================================================================================================  

■■■■■■■■■■■■■■■■■■ 2023.03.30(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==>  

- 자체 휴가[★]
- 넥사크로 소스 정리: 안 하고 놈
============================================================================================================== 

- 자체 휴가[★]
05:05 기상
05:10 조식
05:20 실내 도보
07:00 종료
07:30 인터넷 서핑
11:35 중식 
12:41 도보 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
13:31 귀가
13:40 집 출발(자전거) ==> 도림천
13:58 착한 미용실 원투쓰리(신림역 1번 출구 방문 ==> 대기 3명
14:15 이발(커트: 6천원)
14:45 최희정 내과 방문 
14:52 진료: 김민아 원장(당뇨약 3개월치 처방 받음[고지혈약 제외 요청]) ==> 혈압: 160/90
15:00 혈약 검사 ==> 총 21,500원
15:02 5층엔 약국 방문 ==> 조제(당뇨약[누메트 엑스 알서방]: 3달치 일치: 28,300원)
15:06 다이소 신림점 방문 ==> 엘라스틴 살롱드 컬러 염모제(밝은 갈색, 5천원: 염색약), 스텐레스 골드 플라워롱 스푼(2종, 천원) 구입
15:30 귀가
15:50 다이소 신림점 재방문 ==> 이동식 라운드 MDF 상, 5천원): 반품(책상에 안 울리고 흔들거림 심함)
16:20 귀가
16:30 인터넷 서핑
17:30 석식
17:50 실내 도보
19:05 종료 ==> 포항 병엽이 아제(포항 금방)한테 전화 옴
19:50 염색(실패: 흰 머리 보임), 샤워
22:00 취침
==============================================================================================================

- 다이소 염색약 흑색 가격이 다른 이유는? 궁금해서 반반씩 셀프염색 | 임파 IMPA
https://www.youtube.com/watch?v=gXacj8A_1h0

- 시크릿투톤 지겨워서 블랙 염색🖤다이소 염색 하나로 끝😎
https://www.youtube.com/watch?v=oXLsyQpfE4w

- 2천원 짜리 다이소 염색약으로 염색하기
https://www.youtube.com/watch?v=ZQXp8tfm6Yw
==============================================================================================================

- 화장실 세면대 과탄산 소다로 청소하기
https://www.youtube.com/watch?v=E0cbSNfMHCs

- 과탄산소다로 손쉽게 세면대뚫기 - 세면대 막힘 뚫기
https://www.youtube.com/watch?v=um3oLWLSM5o

- 세면대 막힘 초간단 해결방법 찌든때와 머리카락이 제거됩니다/세면대 막힘 뚫기/세면대 배관청소
https://www.youtube.com/watch?v=0Iob8g6juj8

- 10년 더 쓰는 세면대 청소/관리 방법 - 하루 1분 깨끗한 세면대 만들기
https://www.youtube.com/watch?v=Bh9yixbNdLc

- 세면대 어떻게 청소하세요? / 가장 경제적인데 효과는 최고! 세면대 청소꿀팁
https://www.youtube.com/watch?v=FCc--gkn_PU 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.03.31(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 17:30 ==> 세면대, 싱크대 청소(14시, 과탄산 소다 사용)

- 자체 휴가[★]
- 넥사크로 소스 정리: 안 하고 놈
============================================================================================================== 

- 자체 휴가[★]
05:05 기상
05:10 조식
05:20 실내 도보
07:00 종료
07:30 인터넷 서핑
11:35 중식 
12:41 도보 => 신대방역 => 구로교(반환점) => 보라매역 입구 다리(반환점) => 구로교(반환점) 
13:31 귀가
16:45 집 출발(자전거) ==> 도림천
16:55 다이소 신림점 방문 ==> 원터치 치약 짜개(2천원), 실리콘 흡착 칫솔 걸이(천원), 혀 크리너 부착 칫솔 5P(2천원) 구입
17:22 귀가
17:30 석식
17:50 실내 도보
19:05 종료
22:00 취침
==============================================================================================================

- 다이소 추천템ㅣ깔끔하고 위생적인 칫솔 걸이 원터치 치약 짜개(2천원)
https://www.youtube.com/watch?v=KoKhM07gXCE

- 정품 자동 치약 짜개 디스펜서 치약통 치약디스텐서 치약절약, 가격: 6,350원
https://www.coupang.com/vp/products/6487372466?itemId=14226943967
 
- 리빙차트 양치컵 칫솔 꽂이 거치대 멀티 수납 홀더 욕실 칫솔컵 걸이 세트 자석 치약짜개, 치약 디스펜서
https://www.coupang.com/vp/products/1523827874
1. 치약 디스펜서 가격: 4,700원, 3컵 홀더 가격:9,800원 
============================================================================================================== 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 