 

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2023.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.06.01(목) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 노트북 받침용 박스 주어 와서 설치(07시, 사업장), 류대영(GCP), 이재만(PDA) 책임 투임

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
=============================================================================================================

- DLK_OB 교육(15:30, 내자리)
1. 대상: 류대영 책임 --> 14:시 커피(3천원: 버거킹 마곡점: 내가 쏨)
2. 내용: 01. LOBIM_DCT_CALENDAR(■LOBIM 통합정보시스템_DCT_달력) 샘플을 실행하면서 진행
==> 류대영 책임에게 LG  U+ 출입증 빌려줌(16:30, 출입증 나올 떄까지 식사용으로 사용 하라고 함)
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2023.06.02(금) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업(1, 2 순위 45개 수정)
1. 52번, 169번 완료
2. 1 ~ 10번 수정  완료
=============================================================================================================

 ■■■■■■■■■■■■■■■■■ 2023.06.03(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
06:00 기상
06:33 조식(수종: 돈까스 3개)
06:55 실내 도보
06:55 종료
08:00 집 출발(자전거: 수종, 반팔, 반 바지)
08:10 보라매 공원 도착
08:10 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
08:25 종료
08:35 귀가
09:10 집 출발(자전거)
09:30 최희정 내과 방문 ==> 진료(김민아 원장), 대장 내시경 검사 약 구입(01. 플렌뷰산 복용 안내문): 7,700원
		==> 대장 내시경시 어두워서 잘 안 보였다고 함:(음식물 조절 안 함[현미], 용종 하나 발견 후 제거 했다고 함)
09:50 귀가
10:40 수종 센터로 감
11:30 중식 
12:00 집 출발(백책[갤럭시 탭, 핸드폰 충전기, 수면 도구, 수건, 반바지, 선크림]): 맑은 날씨(선크림 바름)
13:00 영등포역 도착(1시간 소요):
13:15 영동행[영등포(13:15) -> 영동(15:42), 무궁화호1213(5호차 15)] 기차 탑승
15:36 영동역 도착
15:50 택시 탑승(영동역 -> 아이 힐링 펜션[충북 영동군 용산면 동화길 49-14]), 19,000원
16:22 펜션 도착
16:25 화공과 90 동기들 만남 ==> 정진욱(회장), 김기돈(총무), 구자호, 박창규(펜션 주인), 김봉수, 김성열, 김충태, 손재익, 현상훈
		, 황병국, 허진수, 이상훈[수원], 강경환, 이태헌(총 17명)
		==> 스쿼트 챌린지 앱 소개(스쿼트 자세 허진수가 가장 정확함)
17:10 맨발로 재기 차기 ==> 편 나눠서 내기해서 짐(웃통 벗고 물 벼락)
17:30 신발 던지기 ==> 40점 타켓에 던져서 상금(2만원) 받음
18:10 석식(소고기, 맥주) ==> 별보기, 불멍
19:00 기건우 도착
20:00 박귀환 도착
21:00 종료
21:20 방에서 한잔(라면) ==> 현상훈, 황병국, 허진수. 김봉수 귀가
22:30 종료 ==> 설겆이, 정리
24:30 샤워(뜨거운 물)
24:18 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.04(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:00 기상
06:19 조식(햇반, 김치, 쥐포)
07:00 펜션 정리
07:36 펜션 철수(귀환이 차 얻어 탐): 수건 2개, 김치 1통 선물로 받아 옴
08:00 안성 식당(충북 영동군 황간면 영동 황간로 1618) 도착
08:20 조식(나는 안 먹음): 총 8명[정진욱(회장), 김기돈(총무), 구자호, 박창규, 김성열, 박귀환, 이태헌, 이상훈)
08:50 종료
09:00 식당 출발(귀환이 차 얻어 탐)
11:12 귀가(귀환이 때문에 편하게 옴)
12:00 중식
12:20 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:44 귀가
14:00 인터넷 서핑
17:30 석식(햇반, 김치)
17:50 실내 도보
19:00 수종 귀가
19:05 종료
22:00 플렌뷰산 1차 복용(망고향): 30분간 천천히 먹음
22:10 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.05(월) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  

- 휴가[★]
06:00 기상
06:00 플렌뷰산 2차 복용(사과향): 80분간 천천히 먹음
07:00 집 출발(자전거)
07:30 관악구 봉림 공중화장실 방문 ==> 검체 채취(변)
08:00 귀가
09:10 집 출발(자전거)
09:21 최희정 내과 방문 ==> 진료(김민아 원장), 대장 내시경 검사와 당화혈색소 검사 같이 시행: 193,700원
10:00 대장 내시경과 검사
12:00 종료
12:10 진료(김민아 원장): 대장에 큰 문제는 없다고 함, 내시경이 화면이 어두워서 안 보인다고 함
12:20 GS25 보라매 타워점 방문  
12:20 중식: 아침엔 본죽 쇠고기죽(4,500원) 구입
13:00 귀가 
13:30 인터넷 서핑
14:00 낮잠
17:00 기상
17:30 석식
17:50 실내 도보
20:00 수종 귀가
20:10 수종 엄마집에 감
19:05 종료
20:15 청소(청소기, 밀대)
22:10 취침
=============================================================================================================

- 대장내시경 검사과정[한국건강관리협회]
https://www.youtube.com/watch?v=PUOzB5rdcmU&t=2s

- 대장내시경 장 비우는 약 먹기ㅣ플렌뷰산 복용법 및 리뷰
https://www.youtube.com/watch?v=xU9WvHAm0tA

- 대장 [내 몸 둘러보기] (서울아산병원)
https://www.youtube.com/watch?v=vWso599T7LM

- 대장내시경 전 후 주의사항 꼭 보세요 - 음식 식사 조절, 약 복용법, 용종, 검사[약사설명 약짱TV]
https://www.youtube.com/watch?v=3zLm8IurJhs
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.06(화) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 

- 현충일[★]
06:54 기상
07:00 조식
07:20 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
08:43 귀가 
08:45 수종 귀가후 조식 ==> 수종 엄마집에 다시감
09:30 인터넷 서핑
11:30 중식
11:50 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
12:50 진흥 마트 방문 ==> 무화과 왕 구이(1.6kg, 11,800원), 적 상추(1,260원), 동원 프리미엄 돈가스(5,850원), 총:18,600원) 구입 
13:04 귀가 
14:00 인터넷 서핑
17:30 석식(버너에 무화과 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
19:00 수종 귀가 
19:05 종료 
21:00 샤워(온수: 체중: 69.6kg ==> BMI: 24.08[과 체중])
22:10 취침
=============================================================================================================

- Desmos | 사칙 연산 계산기
https://www.desmos.com/fourfunction?lang=ko
=============================================================================================================

- 플렌뷰산
https://nedrug.mfds.go.kr/pbp/CCBBB01/getItemDetailCache?cacheSeq=201905631aupdateTs2022-11-09%2011:19:45.0b
=============================================================================================================

- 여행 고수들만 아는 구글맵으로 여행 계획을 짜기[누나IT]
https://www.youtube.com/watch?v=jAet8ana_X0&list=WL&index=6
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.07(수) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
2. 11 ~ 30번 수정  완료(20개 PDA 기준 칼럼 정렬 수정)  ==> 완료[♥♡]
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.08(목) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 포항집에서 김치 택배로 도착(19시, 집)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
2. 31 ~ 48번 수정  완료(18개 PDA 기준 칼럼 정렬 수정)  ==> 완료[♥♡]
=============================================================================================================

- [SQL] LEFT JOIN, INNER JOIN 차이(조인)
https://velog.io/@profile_exe/SQL-LEFT-JOIN-INNER-JOIN-%EC%B0%A8%EC%9D%B4

1. INNER JOIN - 교집합
2. OUTER JOIN - 합집합
 1) LEFT JOIN은 왼쪽의 모든 행을 조회
 2) RIGHT JOIN은 오른쪽의 모든 행을 조회
=============================================================================================================

- [Oracle] 오라클 조인 방법 쉽게 설명 (ANSI JOIN, Oracle Join)
https://gent.tistory.com/469

1. 안시 아우터 조인(LEFT OUTER JOIN)
SELECT A.EMPNO, A.ENAME, A.DEPTNO, B.DNAME
FROM EMP A
LEFT OUTER JOIN DEPT B
	ON A.DEPTNO = B.DEPTNO
WHERE A.JOB = 'MANAGER'
 ;
2. Oracle Join(LEFT OUTER JOIN)
SELECT A.EMPNO, A.ENAME, A.DEPTNO, B.DNAME
FROM EMP A, DEPT B
WHERE A.JOB = 'MANAGER'
   AND A.DEPTNO = B.DEPTNO(+)
 ;
 1) 조인 조건을 ON절에서 WHERE 절로 위치가 변경되었고 조인 칼럼에 (+)이 붙어있다.
 2) 조인 칼럼에 (+)를 붙이면 해당 칼럼의 테이블이 조인 테이블이 된다.
 3) 아우터 조인의 핵심은 메인 테이블의 데이터는 무조건 조회가 되고 조인 테이블은 참조 용도로만 사용된다.
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.09(금) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. LEFT OUTER JOI 수정
 1) Oracle INNER JOIN ==> 안시 LEFT OUTER JOIN	==> 완료[♥♡]
============================================================================================================

- 김일기 PM 면담(10:30, 커피(김 PM이 쏨))
1.김일기 PM이 계약 맺은 업체(애버커스 아래 업체)와 8월 부터 계약 되도록 도와 줄 수 있다고 함(8월 계약 후 1주 재택 후 출근 고민)
 ==> 전필관 책임, 박묘숙 책임 때문에 신중하게 행동할 것: 모든 일은 극비로 붙일 것
==============================================================================================================
    
- 나눔 서울 동기 모임(19시, 강남역 회장님댁)
18:00 퇴근
18:10 발산역 => 여의도역 => 신논현역
19:00 회장님댁 강남역점(서울 강남구 테헤란로1길 28 지하) 도착 ==> 현용, 호수, 태용
19:10 석식, 맥주 ==> 태용이가 쏨
20:08 종료
20:19 대동집 강남역점 방문 ==> 보쌈 모둠 , 오뎅탕, 맥주: 7만원 나옴(내가 쏨)
		==> 현용이 서강대 석사 졸업(소프트웨어 공학 전공): 학벌 빵빵해서 수주 딸 때 유리하다고 함
21:20 종료 ==> 태용이 한테 더 바싹 치즈 돈가스, 더 바싹 통 등심 돈가스 얻어옴(스티로폼 박스, 얼음)
21:30 강남역 => 신림역 
23:07 귀가 
24:00 취침
=============================================================================================================

- 대체 스쿼트는 어떻게 하는 건가요? || 스쿼트 제대로 하기[강경원]
https://www.youtube.com/watch?v=QyAH8O5X6g0
1. 골반(고관절) 수축: 중심은 약간 뒤로, 무릎과 골반 동시에 사용 

- 스쿼트 허리 말리고 끝까지 앉을 수 없는 진짜 이유!! 이걸 모르니깐 결국에는 다치는 겁니다
https://www.youtube.com/watch?v=sdbD-L4eftQ&list=WL&index=6

- 세상에서 가장 쉽게 배우는 스쿼트!🚀ㅡ김명섭과 함께 하는 스쿼트동작(발바닥을 이용하라!!)
https://www.youtube.com/watch?v=ovlkehevVMs

- 160cm 이하 키작녀들 필수 시청! 여자 스쿼트 자세교정 방법을 알려드릴게요[핏블리 FITVELY]
https://www.youtube.com/watch?v=BUDYtauRfMU
1. 다리 어깨 넓이로 V자로 벌리기(무릎이 상대적으로 덜 나옴)
2. 어꺠에 손(팔꿈치를 위로 올리기)
3. 배에 힘을 주고 엉덩이를 뒤로 쭉 더 뺌(가능하면 90도 보다 더 내려갈 것) ==> 무게 중심을 발 뒤꿈치에 줄 것
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.10(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
07:33 기상
07:42 조식(수종: 돈까스 1개, 더 바싹 치즈 돈가스) 
08:05 집 출발(자전거: 수종, 반팔, 반 바지)
08:16 보라매 공원 도착
08:20 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격): 낚시 의자 처음 사용
08:35 종료
08:42 물통에 물 떠 옴(보라매 공원 놀이터)
08:50 귀가
09:30 샤워(찬물)
10:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가
15:40 수종 엄마집에 놀러감
13:20 인터넷 서핑
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:00 취침
==============================================================================================================

- 리눅스에서 폴더 통째로 복사하기
https://zetawiki.com/wiki/리눅스에서 폴더 통째로 복사하기
1. mv 원본폴더 목적지폴더 =
 1) $  mv a /test/b  ==> /test/b 폴더가 있으면 a폴더를 b폴더 아래로 이동. => /test/b/a
 ==============================================================================================================
 
- [1+1] (고리타올 C형 1P+1P) 목욕 샤워 타올 등밀이 때타올 때수건 손잡이 롱 이태리 타올 등밀이 타월,  가격: 2,550원(7,550원, 할인가)
https://www.coupang.com/vp/products/7047821473
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.11(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
07:08 기상
07:15 조식
06:30 실내 보도(비 옴)
07:51 종료
08:20 인터넷 서핑
11:30 중식
11:58 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:00 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(1,250원), 총:13,050원) 구입
13:11 귀가
13:20 인터넷 서핑
15:36 수종 귀가
17:30 석식(수종): 버너에 돼지 왕 구이 구워 먹음(맛있음)
18:10 실내 도보
19:35 종료
20:05 청소(청소기, 밀대)
21:00 샤워(찬물: 체중: 70kg ==> BMI: 24.22[과 체중])
22:30 취침
==============================================================================================================

- 2023년 사업용 계좌 신고 안내
- 사업용계좌 신고 하셨나요? l 6월30일까지에요!
https://www.youtube.com/watch?v=uSbnvMldHBk
1. 사업용 계좌: 사업적인 모적으로 사용하는 계좌
2. 사업용계좌 신고 대상 
 1) 개인사업자 중에서 복식 부기 장부 작성 의무자(수입이 7천 7백 만원 이상)
3. 사업용계좌 등록하는 방법
 1) 홈택스 로그인 > 신고/납부 > 일반신고 > 사업용계좌(공익법인계좌) 개설 개설
4. 계좌 등록 
 1) 계좌번호: 110-437-783130(110437783130), 예금주: 진태만
5., 신청결과
 1) 조회/발급 > 기타조회 > 사업용계좌신고현황]에서 조회
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.12(월) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 차큐브 Prj 한 달 연장(07말 오픈), 트래킹화 왼쪽 끈 떨어짐(12시. LG 지하 식당): 운동화 끈으로 교체(20시, 집)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. 전체 수정 작업
=============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.13(화) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- 23년 03월 데애타 조회수 0건 테이블 조사
1. 15건: 김일기 PM에게 메일로 보냄
=============================================================================================================

- Hisoty 데이타 초기 적재( 23년 03월) 쿼리 수정
=============================================================================================================

- [Oracle] 오라클 BETWEEN ~ AND 범위 검색 사용법 (날짜, 문자)
https://gent.tistory.com/282 
① 컬럼명 BETWEEN 시작일자 AND 종료일자 
② 컬럼명 >= 시작일자 AND 컬럼명 <= 종료일자

SELECT EMPNO , ENAME , HIREDATE 
FROM EMP 
WHERE HIREDATE BETWEEN TO_DATE('1981-01-01', 'YYYY-MM-DD') 
	AND TO_DATE('1981-12-31', 'YYYY-MM-DD') + 0.99999
-  날짜 컬럼에 시간이 포함되어 있다면 종료일자에 0.99999를 더하여 해당일자의 마지막 시간(1981-12-31 23:59:59)으로 변환 후 조회 한다.	   
;
=============================================================================================================

- 카카오 뱅크 세이프 박스(파킹통장)에 추가 입금
1. 연계 계좌번호 3333-02-3808954(3333023808954)이 계좌에 입금 후 세이프박스에 넣기 처리해야 함
2023.06.13(화): 1,000만원 입금 --> 합계: 21,027,567원(연 2.4%) 
=============================================================================================================

- 최성오 PL 면담(10:--, emart 24 박카스(최 PL이 쏨))
1. 최성오 PL, 권용성 PL 이번달 철수 한다고 함(PM하고 일 못 하겠다고 함): 철수 쉽지 않을 듯
2. 8월부터 계약을 최성오 PL 업체와 하자고 나에게 제안함(단가 맞으면 긍적적으로 생각해보겠다고 함)
==============================================================================================================

- 트래킹 샌들 구입
- 남여공용 아쿠아슈즈 워터슈즈 트레킹화 남자 여성 여름 운동화,  [옵션:블랙(남)/260], 가격: 26,800원(결제 금액: 23,553원)
https://with.gsshop.com/prd/prd.gs?prdid=37609639 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.14(수) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(09:30)

- LG U+ CRM_PDA 현행화 Prj[★]
- CRM 데이타 추출
1. 01 ~ 20 ==> 완료[♥♡]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.15(목) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==>  트레킹화

- LG U+ CRM_PDA 현행화 Prj[★]
- CRM 데이타 추출
1. 21 ~ 43 ==> 완료[♥♡]
2. ETL 서버에서 파일 삭제
 1) $ mv  LOBIM_DCT_CALENDAR_2023015.csv LOBIM_DCT_CALENDAR_Back_2023015.csv 	-- 01. 파일명 변경 ■■■
 2) $ rm -f "LOBIM_DCT_CALENDAR*.csv			-- 02. 파일명 삭제  ■■■
 3) $ mv  LOBIM_DCT_CALENDAR_Back_2023015.csv LOBIM_DCT_CALENDAR_2023015.csv 	-- 03. 파일명 변경 ■■■
 4) $ du -hs *LOBIM_DCT_CALENDAR*				-- 04. folder, file 용량 조회  ■■■
 5) $ df -h 		 -- 서버 용량 확인  ■■■ 
==============================================================================================================

 -윈도우 탐색기 대체 대안 프로그램 8가지
 https://m.blog.naver.com/woolssi210/222285571226 
 1, NexusFile 넥서스 파일
 2. Freecommander XE ==> 전필관 책임 추천
 3. Q-Dir ==> 주로 사용
==============================================================================================================

- FreeCommander (뛰어난 무료 파일 관리 툴)
https://www.youtube.com/watch?v=k3Gf-XfcEgg
1. 경로 편집
 1) FreeCommander > 경로 탭 URL: D:\01. TAMA_DATA\01. TAMA Work --> 마우스 우 클릭 ==> 드롭다운 메뉴: 경로 편집(Alt + G): 클릭
 ==> 경로명이 Enable 됨 ==> 새로운 경로 입력: D:\01. TAMA_DATA\01. TAMA Work\40. 업무 Enter: 경로가 변경됨
=============================================================================================================

- git add, commit 명령어
$ git add -A  		-- 모든 변동사항을 add 처리
$ git commit -m "메세지"
$ git push
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.16(금) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 최희정 내과에 전화(09:30, 당화혈색소: 6.8, 빈혈 회복 되고 있다고 함[헌혈 원인으로 추정함]), 최성오 PL 오후 병가

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출
1. 3개 추출 완료 
==============================================================================================================

- 개발 테스트 데이타 다시 추출
1., CRM 데이타 추출  ==> 개발 테스트 데이타 추출(46개 테이블 추출: 4시간 소요)
 1) q-dir-10-41.zip SW 보안 클라우드에 설치: 업무가 휠씬 빨라짐
 2) FreeCommanderXE SW 보안 클라우드에 설치: 생소해서 사용 안함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.17(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>  

- 주말[★] 
06:22 기상
06:30 조식(수종: 돈까스 1개, 더 바싹 등심 돈가스) 
06:51 실내 도보
08:10 종료
09:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가 
13:20 인터넷 서핑 ==> 94. csv 파일 삭제 작업
17:30 석식(수종)
17:45 실내 도보
18:15 수종 엄마집에 놀러감
19:10 종료
21:20 인터넷 서핑
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.18(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:11 기상
06:15 조식
06:32 집 출발
06:33 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:59 귀가
08:20 인터넷 서핑
11:30 중식
11:58 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역  
13:11 귀가
13:20 인터넷 서핑
15:00 집 출발(자전거: 수종, 반팔, 반 바지) 
15:10 다이소 보라매점 방문 ==> 1. 진 하얀 손 뷰티 고무 장갑(중, 천 5백원), 2. 진 하얀 손 뷰티 고무 장갑(중, 라텍스, 천원)
		3. 올리브 샴푸 & 린스 겸용(750ml)(3천원) 구입
15:25 보라매 공원 도착 ==> 물통에 물 떠 옴(보라매 공원 놀이터)
15:35 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(1,250원), 총: 13,080원) 구입
15:45 진로 마트 방문 ==> 오뚜기 맛있는 밥(10번들, 01,500원)구입
15:55 귀가
16:40 수종 귀가
17:30 석식(수종): 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
19:05 종료
19:35 청소(청소기, 밀대) ==> 빨래
20:00 샤워(찬물: 체중: 68.7kg ==> BMI: 23.77[과 체중])
20:30 인터넷 서핑
22:30 취침
==============================================================================================================

- [리눅스] 쉘 스크립트 파일 실행 방법
https://csdaniel.tistory.com/144
$ ./test.sh
==============================================================================================================
 
- 수종 트래킹 샌들 구입
- 남여공용 아쿠아슈즈 워터슈즈 트레킹화 남자 여성 여름 운동화,  [옵션:블랙(여)/230], 가격: 26,800원(결제 금액: 25,430원)
https://with.gsshop.com/prd/prd.gs?prdid=37609639 
==============================================================================================================

- 어묵 구입[23.006.18(일)] 
- [대림선 사조 부산어묵 알뜰사각 1kg 오뎅 핫바 식자재: 2,770원 ==> 6개, 20,960원(2,220원 할인))
http://item.gmarket.co.kr/Item?goodscode=1772045184
https://www.enuri.com/detail.jsp?modelno=16983913
==============================================================================================================

- 경제 방송[■■]
- 01. 홍사훈의 경제쇼(KBS1 라디오)
https://www.youtube.com/watch?v=_5JDRTHRvDQ&list=PLFnESzVU01TG3D5Gj2yrv21vkLiHS7If8

- 02. 손에 잡히는 경제 & 플러스[MBC 라디오 시사]
https://www.youtube.com/watch?v=n3FbuMqJnQw&list=PLqCB8pKLc7swJt6lx4jTdq6ObZN7_RI9n

- 03. 경제현장 오늘] 전체 다시보기[SBS Biz 뉴스]
https://www.youtube.com/watch?v=wJdWc6Eek6A&list=PLwLxLaKRlpvvUhqXgI7PPuxcQn0XQfaDC&index=1
==============================================================================================================
 
- 51.  YTN라디오 생생 경제[YTN 라디오]
https://www.youtube.com/watch?v=ZghWqboViXY&list=PLMWcf6HwIUthaq7opSRWyvi0rh_mh4MGQ&index=3?v=1McACWUFPM4
==============================================================================================================

- 71. 부(富)티나는 인터뷰 | 고품격 투자토크쇼🍷[한국경제TV]
https://www.youtube.com/watch?v=dXcI_O1QkoI&list=PLh6kUo7pqm_4lnIaRsWhbdU7E1J1mwCmz

- 71. [경제전쟁 꾼 LIVE]매주 금요일 오후 5시~! 경제꾼들의 치열한 전쟁이 시작된다] [한국경제TV]
https://www.youtube.com/watch?v=pHJ8De4_CDE&list=PLh6kUo7pqm_4y2aVsdZiJACeCMnYgmtsl

- 72. [유튜브 오리지널 콘텐츠] [매일경제TV]
https://www.youtube.com/watch?v=yaSuo_ng5Vg&list=PL0dOq2-5pHmiA3LH0Cqy7z96z4g9UA0EQ
==============================================================================================================

- 91. 김프로의 미스터마켓 [삼프로TV_경제의신과함께]
https://www.youtube.com/watch?v=cDVukNr5lrU&list=PLQvqXcm97CTBfwBI0urh64HY52C2C9oYy&index=1

- 91. 투자의 선배가 전하는 초보 투자자들을 위한 가이드 [오늘 처음 투자를 시작한 당신에게 1-1부] [삼프로TV_경제의신과함께]
https://www.youtube.com/watch?v=cIvdEC-rQpY&list=PLQvqXcm97CTAf0wGhuP11PZaeUqsHIz44
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.19(월) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 주식 예수금(미래에셋 증권, 634,580원): 신한은행 계좌로 이동, 갤럭시 노트 9 펜 분실

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출
1. 71 ~ 290(모두 완료): 4건 에러 발생(SQL 파일 찾기 실패)
==============================================================================================================

- 삼성 갤럭시 노트 9 S 펜 스타일러스 터치 펜, 노트 9 N960F EJ-PN960 S펜 터치, 가격: 3,672원
https://ko.aliexpress.com/item/1005005043509125.html?spm=a2g0o.order_list.order_list_main.5.21ef140fxzPz1l&gatewayAdapt=glo2kor
==============================================================================================================

- 이호준 이사와 통화(13:00, 사업장)
 현재 재프로젝트 7월말까지로 한달 연장되었습니다..
좋은 프로젝트 있음년 소개 부탁 드립니다. 감사합니다
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.20(화) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출
1. 71 ~ 290(모두 완료): 4건 에러 발생(SQL 파일 찾기 실패): 문제 해결
 1) 원인: l2폴더 하위단은 해당 폴더가 아니라 /00 폴더에 .sql 파일을 넣어야 함 
  ==> L2EKT_EGGM_SCOR_RANK_MM_M:  /l2/ek/  --> /l2/00/
2. PDA에 없는 Table 개발 보류할 것(총 6개)
==============================================================================================================

- 무료 터미널 프로그램 강자! 'MobaXterm'
https://sethlee.tistory.com/53

- 원격 관리 프로그램 MobaXterm
https://www.youtube.com/watch?v=F8m3N_nccdY
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.21(수) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(13:30), 형광등 불 안 옴(19시, 집: 일괄 소등 스위치 확인), 어묵 무침(19:30, 집)

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출 
1. 전체 데이타 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.22(목) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> MobaXterm(SSH) 보안 클라우드에 설치(08시)

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출 
1. 전체 데이타 수정
==============================================================================================================

- 브레이브 브라우저 동기화(북마크: 즐겨찾기)  
A. 태마 PC 브레이브 브라우즈 환경 @@@
brave://settings/braveSync/setup
1. 설정 > 동기화 > 동기화된 장치 관리

2. 장치 목록(새창)
아래의 장치 목록에 귀하의 동기화 체인의 모든 장치들이 포함되어 있습니다. 각 장치들은 모든 다른 장치들로부터 관리될 수 있습니다.

장치 이름									마지막 활성						삭제
TAMA-HAART-404 (이 장치)		Thu Jun 22 2023

 1) 동기화 코드 보기: 클릭
 2) 동기화 코드 보기(새창: 팝업):
  가. QR 코드 보기: 클릭 ==>  동기화 체인 QR 코드  ==>  
==============================================================================================================

B. 태마 핸드폰 브레이브  브라우즈 환경 @@@ 
1. 설정 > 동기화 > 동기화: 큻릭
 1) 동기화(새창) 
  가. 기기가 존재하면 모두 삭제하고 동기화 코드 스캔 또는 입력할 것
  나. 동기화 코드를 스캔하거나 입력하세요.: 클릭 ==> 동기화 코드를 스캔: 태마 PC 브레이브 브라우즈 환경 동기화 체인 QR 코드 촬영  
	TAMA-HAART-404
	SM-N960N(이 기기)
==> 2개 자동 생성됨
==============================================================================================================

- 원데이디지털 Brave Browser 동기화와 확장프로그램 Language Reactor
https://www.youtube.com/watch?v=TZlExZ5PvsI&t=205s&ab_channel=windboss%EC%96%B4%EB%8A%90%EA%B0%80%EC%9E%A5Mr.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.23(금) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 종합소득세 환급금 입금(2,423,280원, 관악 세무서)

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출 
1. 개발 데이타 추출 완료(PDA 미존재 테이블 5개 제외): 전체 데이타 수정
==============================================================================================================
 
- 배치 작업 문제 발생
1. dag_id가 root_d0201_odl_cr_002_003이 일배치가 안돔
1) dag_id가 root_d0201_odl_cr_002_001,  root_d0201_odl_cr_002_002는 정상 작동함
==============================================================================================================

- 농협 Prj 면접[★] 
13:40 퇴근(김일기 PM에게 당뇨 검진 받으로 간다고 이야기하고 퇴근)
13:50 마곡동로사거리(중) 정류장 도착
13:55 605번 버스 승차
14:30 삼환아파트 정류장 하차
14:34 옛 영등포 전화국 자리 주변 산책(영동 초, 서울특별시교육청 영등포평생학습관, 리마크빌 영등포[오피스텔])
14:40 KNK디지털타워 1층 도착 ==> (주) U2W 이호준 이사 만남
15:00 이디야 커피 영등포 KNK 점 방문   ==> 농협 Prj 면접:PM, PL
		--> 8월달 부터 개발(11월에 완료), 개발자 3명(250본 개발), JAVA로 개발, DB 사용 --> 고개사: 농협, 수주사: 웹캐시
15:20 신화병원 정류장 도착
15:25 6514번 버스 승차
15:56 신림동 별빛거리 입구 정류장 하차
16:10 귀가 
16:20 인터넷 서핑 
17:30 석식
17:45 실내 도보
19:10 종료 
21:20 인터넷 서핑
22:00 취침
==============================================================================================================
 
- 농협 Prj 면접(15시)
1. 프젝트명: NH농협 데이터 바우처 고도화 프로젝트
2. 일시: 6/23(금), 15:00~
3.. 장소: KNK디지털타워 1층[서울시 영등포구 영신로 22)
4. 내용:
 1) 8월달 부터 개발(11월에 완료), 개발자 3명(250본 개발), JAVA, 전자정부프레임웍으로 개발, DB 사용 --> 고개사: 농협, 수주사: 웹캐시
 2) 단가: 800 
==============================================================================================================
 
- 여름 양말 구입
- 아놀드파마 여름용 매쉬 남성캐주얼양말 스니커즈 1켤레 AP5101 여름양말, 13켤레[켤레 당: 2,160원] (총 가격: 28,080원)
1. 필수선택:AP5101_13결레
https://www.lotteimall.com/goods/viewGoodsDetail.lotte?goods_no=1316906986
https://www.enuri.com/detail.jsp?modelno=61252660
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.06.24(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==> 22년 06월지침[23.06.24(토)]: 0652 / 사용량 4㎥ -> 76,160원(감면: 600원) 

- 주말[★] 
05:50 기상
06:30 조식(수종: 돈까스 2개) 
06:51 실내 도보
07:55 종료
08:00 집 출발(자전거: 수종, 반팔, 반 바지)
08:10 보라매 공원 도착
08:10 수종이랑 보라매 공원 운동장에서 야구(수종 타격): 투수 야구공 안 가지고 옴
08:33 종료
08:40 물통에 떠 옴(보라매 공원 놀이터)
08:45 귀가
09:00 샤워(찬물)
09:30 인터넷 서핑
10:40 수종 센터로 감
11:00 야구 애매 시도 ==> 실패: 07.01 KIA : LG 잠실 경기
11:30 중식 
11:45 실내 도보
12:55 종료
12:30 수종 엄마집에 놀러감
13:20 인터넷 서핑
17:30 석식
17:45 실내 도보 
19:10 종료
19:45 집 출발(자전거: 수종, 반팔, 반 바지) 
20:00 다이소 보라매점 방문 ==> 1. 야외용 등받이 접이식 의자(소, 야구 포수), 3천원), 2. 스텐레스 찜기(소, 2천원)
		3. 올베이직 밴딩 드로즈(95) 등 --> 수종 팬티 10벌(95, 3만원) 구입
20:20 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(1,250원), 총: 13,080원) 구입
20:50 귀가
21:20 인터넷 서핑
22:00 취침
==============================================================================================================

- 야구 애매
- A. 티멧 링크
https://www.ticketlink.co.kr/sports/baseball/59#reservation
1, 가능한 팀: LG 트윈스, SSG 랜더스, kt wiz, KIA 타이거즈, 삼성 라이온즈, 한화이글스
- 페이코(티켓 링크)
https://id.payco.com, tamario@naver.com, hptnwhd1601@ --> asas1212!!
--------------------------------------------------------------------------------------------------------

- B. 인터파크
https://ticket.interpark.com/Contents/Sports/Bridge/baseball
1, 가능한 팀: 키움, 두산
--------------------------------------------------------------------------------------------------------

- 잠실야구장 프로 야구 예매 안내
https://opengov.seoul.go.kr/civilappeal/2896926
--------------------------------------------------------------------------------------------------------

- 잠실꿀팁] 나에게 꼭 맞는 잠실야구장 자리는!? 편!!
https://www.youtube.com/watch?v=sefFcIcS0og
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.25(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>  

- 주말2[★]
06:11 기상
06:15 조식
06:32 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:55 귀가
08:30 샤워(찬물)
09:00 인터넷 서핑
11:00 야구 애매 시도 ==> 실패: 07.02 KIA : LG 잠실 경기
11:45 실내 도보
12:55 종료
13:20 인터넷 서핑
14:54 야구 애매 시도 ==> 성공: 07.01 18:00, KIA : LG 잠실 경기(1루 레드석, 2매: 38,000원)
17:30 석식: 버너에 돼지 왕 구이 구워 먹음(맛있음)
17:50 실내 도보
18:10 수종 귀가
19:05 종료 
19:20 청소(청소기, 밀대)
20:00 샤워(찬물: 체중: 68.2kg ==> BMI: 23.53[과 체중])
20:25 인터넷 서핑
22:30 취침
==============================================================================================================
 
- 트래킹 샌들 구입(2번째 구입)
- 남여공용 아쿠아슈즈 워터슈즈 트레킹화 남자 여성 여름 운동화,  [옵션:블랙(남)/260], 가격: 26,800원(결제 금액: 25,415원)
https://with.gsshop.com/prd/prd.gs?prdid=37609639 
==============================================================================================================

- 프로야구 예매(수종)
1. 프로야구 예매[07.01 18:00, KIA : LG 잠실 경기(1루 레드석, 2매: 38,000원)]
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.26(월) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 출근할 때 비(05:30, 우산, 장마 시작), [U2W] NH농협 데이터 바우처 고도화 프로젝트 투입 서류 처리.

- LG U+ CRM_PDA 현행화 Prj[★]
- 개발 데이타 추출
1. 오늘 일배치가 모두 안돔
==============================================================================================================

- POA에 미존재 테이블 작업(6건)
==============================================================================================================

- root_d0202_odl_cr_002_001 재설정(25개) ==> 완료[♥♡] 
1. dag_id가 root_d0202_odl_cr_002_001 생성(사실상 root_d0201_odl_cr_002_003을 수정함): No. 52 ~ No. 290 
==============================================================================================================

- Apache 에어플로우(Airflow) 시작하기
https://lsjsj92.tistory.com/631

- 데이터엔지니어링 with Airflow[슬기로운통계생활]
https://www.youtube.com/watch?v=SXGBun6qZug&list=PLKtLBdGREmMl7zsmCDW_YHDNBgIy24zp-
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.27(화) 작업 ■■■■■■■■■■■■■■■■■■    
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★] 
- 개발 데이타 추출
- root_d0203_odl_cr_002_001 재설정(29개) ==> 완료[♥♡] 
1. dag_id가 root_d0203_odl_cr_002_001 생성(사실상 root_d0201_odl_cr_002_001을 수정함): No. 01 ~ No. 30
==============================================================================================================

- root_d0204_odl_cr_002_001 재설정(19개) ==> 완료[♥♡] 
1. dag_id가 root_d0204_odl_cr_002_001 생성(사실상 root_d0201_odl_cr_002_002을 수정함): No. 31 ~ No. 48
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.28(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 진수종 감기로 혼자 병원 진료(09시), 수종 은천 문화 센터에서 잠실 야구장 관람(18:00 ~ 22:00): 22:40: 은천 교회 마중

- LG U+ CRM_PDA 현행화 Prj[★] 
- CRM 데이타 추출
- root_d0207_odl_cr_002_001 설정(29개) ==> 완료[♥♡] 
1. dag_id가 root_d0207_odl_cr_002_001 생성: No. 01 ~ No. 30
==============================================================================================================

- root_d0208_odl_cr_002_001 재설정(19개) ==> 완료[♥♡] 
1. dag_id가 root_d0208_odl_cr_002_001 생성: No. 31 ~ No. 48
==============================================================================================================

- root_d0209_odl_cr_002_001 재설정(25개) ==> 완료[♥♡] 
1. dag_id가 root_d0209_odl_cr_002_001 생성: No. 52 ~ No. 290
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.29(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 출근 후 비, 중식 때 비(08:40, 우산 소지)

- LG U+ CRM_PDA 현행화 Prj[★] 
- CRM 데이타 추출 
1. ETL 서버 풀 나서 배치가 안됨
 1)  CRM 데이타 추출 결과물 Airflow에서 배치 돌리지 말 것
==============================================================================================================

- 캐리지 리턴 처리
1. 오재영 책임 요청
==============================================================================================================

- BDP_LOAD_USER_ID 미존재 확인
1. 오재영, 이재만 책임에서 데이타 생성 쪽지 보냅
==============================================================================================================
 
- 치약 압착기 주문
- 자동 치약 디스펜서, 치약 압착기 디스펜서, 어린이 및 가족용 벽걸이, 가격: 2,199원
https://ko.aliexpress.com/item/1005004564896765.html
==============================================================================================================
  
- 삼삼성전자 갤럭시 노트 20 울트라 5G 256GB (공기계) [리퍼], 가격: 535,920원
https://www.enuri.com/detail.jsp?modelno=61280541

- 삼성전자 갤럭시 노트 20 울트라 5G 256GB (공기계) [상태S급 중고], 가격: 468,580원
https://www.enuri.com/detail.jsp?modelno=56278037
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.06.30(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 ==> 오전, 중식 시간에 비 약간(우산X), 중식(11:30, 김밥[GS25 발산 파크점]), 가계부 월말 결산(21시, 집)

- LG U+ CRM_PDA 현행화 Prj[★] 
- 개발 데이타 수정
1. A. d0203 배치 안돔  --> LOBIM_DCT_CALENDAR_20230628.csv 기준 확인할 것
2. 01.데이터마이크_진행현황(DEV).xlsx 작업
==============================================================================================================

SELECT COUNT(*) AS TOT CNT ==> 0 건
FROM gcp-prod-edp-lake.DLKL2JU22 L2JU_TRG_CMPN_TRGT_DLST_H A 
WHERE 1 = 1
	AND A.P_YYYYMMDD between CURRENT DATE() - 3650 and CURRENT_DATE()    -- 기준일(파티션키) Test
LIMIT 100
-- Add to 237_L2JU_TRG_CMPN_TRGT_DLST H 아웃바운드[(T_0626_2), by 진태만]
;
==============================================================================================================
 
SELECT COUNT(*) AS TOT CNT ==> 전체 25772454 행
FROM gcp-prod-edp-lake.DLKL2EF22.L2EF_FMIL_SGMT_IDVL_INFO_MMLY_H A 
LEFT JOIN gcp-prod-edp-lake. DLKC1CO_L1COM_ENTR_NO_KEY_REL_CZ M 
	ON A ENTR_NO = M.ENTR_NO 
LEFT JOIN gcp-prod-edp-lake DLKC1CO_LICOM_CUST_NO_KEY_REL_CZ N 
	ON A CUST_NO=N.CUST_NO 
WHERE 1 = 1
	AND A.P YYYYMM = cast('202305' as int64) 			 -- 기준월(파티션키) Test @@@
	-- AND A.P_YYYYMM = cast(@p_from as int64) 	 -- 기준월(파티션키) 
LIMIT 100 
-- Add to 257_L2EF_FMIL_SGMT_IDVL_INFO_MMLY_H 아웃바운드[(T_0630), by 진태만]
;

--> TEST로 100건 ETL 서버에 등록
finf -name "*L2EF_FMIL_SGMT_IDVL_INFO_MMLY_H*"; 
cat L2EF FMIL SGMT_IDVL_INFO_MMLY_H_20230630.csv | wc - l;
==============================================================================================================
 
06. LOCR_TB_CMCE_CMPN_RSPN_RSLT_H(■LOCR_CMCE_캠페인응답겨과이력): H,복호화 ==> 완료[♥]
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_h_001_bq2gcswithfin.sql --> Duration: 12Min 1Sec, (100) 
cat LOCR_TB_CMCE_CMPN_RSPN_RSLT_H_202303.csv | wc - l;
==============================================================================================================
 
10. LOCR_TB_CMCE_CUST_CALL_ACTN_H(LOCR_고객콜활동이력): H ==> 완료[♥] 
=> grape_odl_cr_002_10cr_tb_cmce_cust_call_actn_h_001_bq2gcswithfin.sql --> Duration: 4Min, (1731,514 --> 100) 
cat LOCR_TB_CMCE_CUST_CALL_ACTN_H_20230630.csv | wc - l;
==============================================================================================================
 
- 파이썬 강의 수강
- 파이썬 코딩 무료 강의 (기본편) - 6시간 뒤면 여러분도 개발자가 될 수 있어요 [나도코딩]
https://www.youtube.com/watch?v=kWiCuklohdY&list=RDCMUC7iAOLiALt2rtMVAWWl4pnw&index=1
1. python 다운로드 및 설치
 1) python-3.11.4-amd64.exe  
2. VisualStudio Code 설치
 1) VSCodeUserSetup-x64-1.78.2.exe
3. PythonWorkspace 폴더 생성 및 설정
 1) D:\PythonWorkspace
  2) \helloworld.py 파일 생성  
  ==> python
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 
 
 
 