

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2023.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2023.05.01(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 노동절[★] 
05:02 기상
05:10 조식
05:35 집 출발(도보): 도립첨 -> 신대방역  --> 구디역 -->  신대방역 
06:35 귀가
06:45 집 출발(자전거: 끌고감[펑크남])
06:50 도림천 자전거 수리 센터 도착 ==> 타이어 공기 주입기로 뒷 바퀴에 공기 주입(1. 던롭형)
06:55 도보(집 근처에서 책상위에 고정할 나무 받침대 1개[큰 것] 주워옴)
07:00 귀가
07:20 인터넷 서핑
09:35 집 출발(자전거: 수종): 펑크 안 남
09:55 대림 종합 자전거(문영 APT 1806호 근처) 도착 ==> 뒷자전거 뒷 바퀴 펑크 수리(펑크 부분 확인 후 접착 스티커 붙임, 3천원)
10:25 종료
10:25 자전거점 출발(자전거: 수종) 
10:55 CU 신대방 센터점 방문 ==> 교통 카드 충전(수종, 만원)
11:00 노량진역 => 노들역 => 신용산역 => 서울역 => 시청역 => 청계천 => 종로5가역
12:20 광장 시장 도착(사람들이 많고 빈대떡, 김밥 같은 것 밖에 없음)
12:35 BHC 치킨 종로 5가 광장점 방문 ==> 중식(순살 양념, 21,900원): 수종
13:15 종로 5가 출발(자전거: 수종) => 종로 3가역 => 종각역 => 경복궁 사거리 => 삼첟동길
13:32 춘추관 도착
13:40 청와대 관람(관람신청 예약 바코드 확인) ==> 상춘재 => 본관 =>  관저
14:20 종료
14:30 청와대 출발(자전거: 수종)
16:30 귀가(피곤함)
16:40 인터넷 서핑
17:45 석식(수종): 버너에 냉동 삼겹살 구워 먹음(맛있음: 배고파서 과식함)
18:30 실내 도보
19:15 종료 
19:40 인터넷 서핑
22:00 취침
==============================================================================================================
    
■■■■■■■■■■■■■ 2023.05.02(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. OIF 코드: DL_EP_009(개발 서버), DL_EP_010(운영 서버)
==============================================================================================================

- 현아트빌 큰방 LED 등 고장[23.05.02(화)] 
- LED등 나갔을때 "모듈"교체로 수리하기! 동일한 방법으로 형광등 ☞LED로 작업 가능!!! [철물박사 TV]
https://www.youtube.com/watch?v=kZN4hQ0QS9c

- 램프대체용 LED 모듈 50W (주방등36Wx2등 대체용) LED기판
http://item.gmarket.co.kr/Item?goodscode=1784279190
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.03(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(15:30): 이번주 5개 완료

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. OIF 코드:DL_EP_010에서 DL_CR_002로 변경 ==> 모든 엑셀 재 작성
==============================================================================================================

-세상에 이런 일이..?! [삼겹살 해동하는 법] 꿀팁 공개! MBN 210718 방송
https://www.youtube.com/watch?v=xq8M5cy9oe8

- 꽝꽝 언 냉동고기도 생고기처럼 부드럽게 먹을 수 있는 해동 꿀팁
https://www.youtube.com/watch?v=Uvfdi8XbR3Q

- 얼린 돼지고기를 10분만에 해동하는 방법
https://www.youtube.com/watch?v=g03FU8CE4Gc
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.04(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>   

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
==============================================================================================================

- LG U+ DLK Prj 회의(09시,  최성우 책임과 통행)
1. 장소: 연세 대학교 세브란스 빌딩(서울 중구 통일로 10 (남대문로5가 84-11번지) 17충
2. 최학식 책임(PML) 만남(10:20)
 1) Airfllow애서 배치 서버 재시작 방법 조언
 2) BCP에서 SFTP를 이용해서 ETL 서버로 전송하는 과정에서 에러 발생
  가. 255 코드 에러 발생: 파일이 없을 때 발생(버킷에서 파일을 못 찾은 아님)
  나. EP_009에서 EP_010으로 변경함 ==> 그래도 계속 SFTP 에러 발생: 최학식 책임 다른 회의 들어가서 포기하고 16시경에 철수함
  다. (주) 에버커스 이성진 담당(영업) 만남
------------------------------------------------------------------------------------------------------------------------

- 플라곤 17층 와이파이 설정
1. ID: FLAGONE_17F_GUSET, flagone123
==============================================================================================================
    
- 협정 세계시(協定世界時, 영어: Coordinated Universal Time/Universal Time Coordinated, UTC)는 
1. 1972년 1월 1일부터 시행된 국제 표준시이며, 1970년 1월 1일 자정을 0 밀리초로 설정하여 
기준을 삼아 그 후로 시간의 흐름을 밀리초로 계산한다. UTC는 국제원자시와 윤초 보정을 기반으로 표준화되었다.
UTC는 그리니치 평균시(GMT)에 기반하므로 GMT로도 불리기도 하는데, UTC와 GMT는 초의 소숫점 단위에서만 
차이가 나기 때문에 일상에서는 혼용된다. 기술적인 표기에서는 UTC가 사용된다. 한국(KST)은 UTC+9 시간임.
---------------------------------------------------------------------------------------------------------------------------

- 현재 UTC 시간
https://www.rapidtables.org/ko/calc/time/utc-time.html

-  UTC 시간 KST로 변환
http://www.timebie.com/timezone/universalkorea.php
==============================================================================================================

04:40 기상
04:50 조식
05:20 집 출발(도보): 도립첨 -> 신대방역  --> 구디역 -->  신대방역 
07:00 출근
07:20 김일기 PM이 LG U+ DLK Prj에 가  SFTP 에러 발생하는 거 문의하고 오라고 함, 최성오 책임과 같이 출발
08:50 사업장 출발(도보, 최성오 책임) ==> 마곡 나루역 --> 서울역 4번 출구(지하철비: 1,450원)
10:09 세브란스 빌딩 17충 도착
10:20 학식 책임(PML) 만남
10:30 17층 직원 커피샵
10:35 17층 BASE 1701로 이동 ==> 문 입구쪽 2개 자리에 앉음
12:10 CU 남대문로5가점 반문 ==> 참치 김밥(2,800원) 주문(최성오 책임이 쏨)
12:32 도보(서울역 지하: 괜찮은 편)
13:10 종료
13:30 업무
16:15 퇴근
16:32 서울역 버스 환승 센터 도착 ==> 500번 버스 탑승
17:35 남부초 정류장 하차
17:40 가야 전기 조명 방문 ==> LED 방등 50W 3만원에 구입하라고 함(LED 모듈 2만 6천원)
18:00 귀가
18:01 석식
18:15 도보 ==> 빨래
19:00 종료 
19:40 인터넷 서핑 ==> 포항집 갈 준비(짐싸기)
22:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.05.05(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 어린이날[★]
04:00 기상
04:35 조식(수종: 돈가스: 3개, 햅반 1개)
05:01 집출발(도보, 수종, 흐림, 백팩[반찬통 3개, 체육복 하의, 우산])
05:15 643번 버스 탑승(남서울중 정류장)
05:45 강남 터미널 도착
06:00 서울 출발
10:19 포항 고속버스 터미널 도착
10:25 다이소 포항 해도점 방문 ==> 모던 비누 케이스(2천원), 스텐레스 골드 플라워 롱 스푼(2종, 천원), 이모티콘 칫솔 걸이 3P(천원) 구입
10:37 209번 버스 탑승(고속버스 터미널 정류장)
10:50 하차
11:00 귀가(포항집)
12:00 중식(수종) ==> 수종 핸드폰 모바일 핫스팟 설정: 01. galS22_5479_0898./soojong0508
12:20 실내 도보(비 조금 옴)
13:25 종료(수종)
13:30 TV 시청 ==> 장판 시공 준비(커터 칼, 자 분실)
17:30 석식(수종)
18:00 집출발(수종, 비 조금 옴[우산])
18:25 오피스 디포 북포항점 방문 ==> 프리미엄 블랙 컷트(대/ CB1B-BK/프린터) (장판용, 3,800원), 지움 연필 세트(B/5자루/1000) 
		모닝 글로리(900원) 구입
18:45 꾀꼬리 미용실 도착 ==> 큰누나 미용실에 델 노트북 재 설정(무선 콤보 아무스 밧데리 소진되어 사용 불가)
18:50 이발(수종, 나), 누나한테 염색약 얻어옴
19:45 꾀꼬리 미용실 출발(큰누나 차, 수종)
19:58 귀가(큰누나가 수종이에게 용돈[5만원] 줌)
20:00 TV 시청
22:00 염색(누나가 준 염색약 사용), 샤워
23:00 취침(수종: 큰방)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.05.06(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==>

- 주말[★] 
06:50 기상
06:56 조식 
07:20 실내 도보(비옴)
08:46 종료 
09:56 수종방 장판 시공 ==> 이음매 시공 안함
		1. 장판을 180cm *  300cm 자름, 2. 장판 깔기, 3. 장판에 풀 붙이기
		 1) 남은 장판 180cm *  300cm을 반으로 자름 ==> 90cm * 300cm만 사용(머지는 나중을 위해 보관함)
11:35 종료
12:12 중식(수종)
12:30 실내 도보(비옴)
13:49 종료 
14:00 TV 시청 ==> 삼성 청소기 점검: 강 위치에 두면 필터 점검 빨간 불 들어 오고  엄청난 굉음 남
17:48 석식
18:09 실내 도보(비옴)
19:36 종료
20:00 TV 시청
20:20 델 모니터 박스 처리(LG 모니터 박스 사용)
21:00 삼성 청소기 필터 청소(필터, 부품을 드라이버 사용해서 꺼내서 물로 깨긋히 씻음)
22:45 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.05.07(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==>

- 주말2[★]
05:38 기상
06:00 조식
06:25 도보(비 온 후 쌀쌀함하고 바람이 많이 붐)
08:00 종료
08:30 TV 시청
큰누나 미용실 와이파이...iptime꾀꼬리 
11:30 큰 누나네 도착
11:40 집 출발(큰 누나 차, 비 조금 옴): 매형, 엄마, 수종
12:11 수가성 순두부 도착
12:20 중식(순두부 정식, 파전, 고갈비, 제육볶음, 큰누나가 쏨): 배가 너무 부름
12:50 종료
13:00 가게 출발(큰 누나 차, 비 조금 옴)]
13:11 야생화 일기 커피샵(강동) 도착
13:20 커피(따아, 큰누나가 쏨), 고양이
13:56 종료
14:34 귀가 
15:00 큰누나네 귀가(매형이 수종이에게 용돈[만원] 	==> 엄마도 수종이에게 용돈[5만원] 줌)
15:40 실내 도보
16:00 화장실 세면대 막힘 처리: 과탄산소다 2뚜껑 뿌리고 뚜거운 물 뿌림, 1시간 후 물 잘 내려감
16:40 종료 
17:30 석식(수종)
18:00 삼성 청소기 부품 청소 후 재 조립 후 테스트: 정상
18:20 카카오 택시 호출
18:30 집출발(수종: 델 모니터, 백팩(반찬 4통], 비 온 후 쌀쌀함)
18:49 포항역 도착 ==> 도보
19:21 포항역 출발(수종)
22:05 서울역 도착(10분 연착)
22:15 504번 버스 탑승(서울역 환승 센터)
22:50 남부초 도착
23:10 귀가
23:53 취침(수종)
==============================================================================================================
  
■■■■■■■■■■■■■ 2023.05.08(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 어버이날, 현아트빌 큰방 LED 등 다시 켜짐(22시, 원인 불명)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. BCP에서 SFTP를 이용해서 ETL 서버로 전송하는 과정에서 에러 발생
 1) 255 코드 에러 발생: 파일이 없을 때 발생(버킷에서 파일을 못 찾는것이 아님) 
 ==> SFTP 에러 테스트 후 최학식 팀장에게 메일 5통 주고 받음: 해결 못 함
==============================================================================================================

- QCY T13 이어폰을 MSI 노트북(업무용)에 셋팅
1. QCY T13 ANC 이어폰 ==> 갤럭시 노트 9에 샛팅
-----------------------------------------------------------------------------------------------------------------------------

- QCY-T13 노트북 Bluetooth 연결 끊김 오류 해결
https://m.blog.naver.com/PostView.naver?blogId=rhkddj78&logNo=222952935769&targetKeyword=&targetRecommendationCode=1
-----------------------------------------------------------------------------------------------------------------------------

- QCY T13 초기화 방법ㅣ와이엘사이언스
https://www.youtube.com/watch?v=6uw5fYYMbcE
==============================================================================================================

- 확실한 듀얼모니터 연결 3가지 방법(HDMI TO DVI / RGV 케이블)
https://blog.naver.com/aldus_06/222132332392
==============================================================================================================
  
■■■■■■■■■■■■■ 2023.05.09(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 2022년 귀속 종합소득세 신고 준비, 중식(12:00, 개발팀 회식[1층 특삽겹] 모듬구이(600g, 6만원), 삽겹살(150g, 
								만7천원), (주)에버커스 이성진 담당이 쏨), 김일기 부장 반차(13:12, 퇴근)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. BCP에서 SFTP를 이용해서 ETL 서버로 전송하는 과정에서 에러 발생
 1) 255 코드 에러 발생: 파일이 없을 때 발생(버킷에서 파일을 못 찾는것이 아님) 
==============================================================================================================

12-1-2. 방화벽 신청[23.05.09(화)] ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: CRM 데이타 현행화 프로젝트 수행
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.18.195.34 		6. TCP: 6005~6009,6014-6114  --> 기존에 신청함  
5. 직접입력: 172.18.195.34 		6. TCP: 8321, 8325   --> 개발
5. 직접입력: 172.18.196.41 		6. TCP: 8321, 8325   --> 운영
5. 직접입력: 172.18.194.101 		6. TCP: 8321, 8325   --> 운영
7. 사용 목적: 외부 대이타 수집을 위해 방화벽 해제 요청
============================================================================================================== 

- 타겟 경로 변경(No. 05) ==> 성공(17:30)
1. /data/INBOUND/CR ==>  /data/INBOUND/TEST
----------------------------------------------------------------------------

- 타겟 경로 재 변경(No. 06) ==> 성공(18시)
1. /data/INBOUND/TEST ==>  /data/INBOUND/CR
============================================================================================================== 

- Visual Studio Code에서 Git으로 협업하기[생활코딩]
https://www.youtube.com/playlist?list=PLuHgQVnccGMD-XRW1zlqC7U2uCzOxyT8u
$ pull 		# pull = fetch(가져옴) + merger(병합)

- Visual Studio Code 기본 사용법[생활코딩]
https://www.youtube.com/watch?v=K8qVH8V0VvY
1. 언어 설정: Ctrl + Shift + P로 커맨드 팔레트 실행 후 language로 검색해서 Configure Display Langage를 선택
-------------------------------------------------------------------------------------------------------------------

- git4 - cherry-pick & rebase[생활코딩]
https://www.youtube.com/watch?v=b4E03UJqPK8&list=PLuHgQVnccGMAb_nOiego7BqfKTRcXsUrB
==============================================================================================================
  
■■■■■■■■■■■■■ 2023.05.10(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> (주)예술과 기술: 04월 급여 송금됨(10시, 4,966,140원[월 740[), LG U+ CRM_PDA 현행화 Prj 계약서 작성[22시, 집]
									. 주간 보고서 작성(10시)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
01. L0BIM_DCT_CALENDAR(■LOBIM 통합정보시스템_DCT_달력): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dct_calendar_001_bq2gcswithfin.sql 
02. L0BIM_DKV_GC_PP(■LOBIM_통합정보시스템_DCT_GC_요금제): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dkv_gc_pp_001_bq2gcswithfin.sql
03. L0BIT_OHW_DCF_SBGN_MART(■통합정보시스템_개통마트): 암호화: ==> 완료[♥♡]  
==> grape_odl_cr_002_10bit_ohw_dcf_sbgn_mart_001_bq2gcswithfin.sql 
04. L0BTM_ORG_USER(■LOBIM_사용자마스터) ==> 완료[♥♡]
==> grape_odl_cr_002_l0bit_obw_dct_sbgn_mart_001_bg2gcswithfin.sql 
05. L0CPT_CC_APP_WASLOG_V3(■고객센터APP_고객센터이용내역3.0): 파티션을 나눈 테이블  ==> 완료[♥♡]
==> grape_odl_cr_002_10cpt_cc_app_waslog_v3_001_bg2gcswithfin.sql
==============================================================================================================
   
 12-1-2. 방화벽 반려 후 재 신청 ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: CRM 데이타 현행화 프로젝트 수행
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.18.195.34 		6. TCP: 6005~6009,6014-6114
7. 사용 목적: 8321, 8325 : 외부 데이타 수집을 위함
5. 직접입력: 172.18.195.34 		6. TCP: 8321, 8325   --> 개발
5. 직접입력: 172.18.196.41 		6. TCP: 8321, 8325   --> 운영
============================================================================================================== 

- 코로나 엔데믹' 선언…비대면 중단·마스크 해제[32.05.10(수)]
https://www.dailypharm.com/Users/News/NewsView.html?ID=300078
1. 정부가 오늘(11일) 코로나19 방역 조치를 대부분 해제하며 사실상의 엔데믹(endemic·풍토병으로 굳어진 감염병)을 선언
2. 격리 의무를 해제하는 내용의 방역 완화 조치를 발표
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.11(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 중식(11:30, 육계장[카드: 4천 5백원: 박묘숙 책임이 쏨], LG 사이언스 파트 빌딩 지하 식당)
								, 현용 만남(18:30, 구디역 2번 출구, 삼통 치킨[치맥, 30,500원]), 수종 용돈(내일 섽터에서 서울랜드 방문)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
06. L0CR_TB_CMCE_CMPN_RSPN_RSLT_H(■L0CR_CMCE_캠페인응답결과이력): 암호화  ==> 개발 중[☞☜] 
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_h_001_bq2gcswithfin.sql 
07. L0CR_TB_CMCE_CMPN_RSPN_RSLT_M(■L0CR_CMCE_캠페인응답결과기본): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_m_001_bq2gcswithfin.sql 
08. L0CR_TB_CMCE_CNSL_ADRE_RSLT_D(■L0CR_CMCE_상담예약결과상세): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cnsl_adre_rslt_d_001_bq2gcswithfin.sql  ==> 완료[♥♡]  
09. L0CR_TB_CMCE_CRM_CMM_CD(■L0CR_CMCE_CRM공통코드) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_crm_cmm_cd_001_bq2gcswithfin.sql 
10. L0CR_TB_CMCE_CUST_CALL_ACTN_H(■L0CR_고객콜활동이력) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cust_call_actn_h_001_bq2gcswithfin.sql
==============================================================================================================

11 LOCR_TB_CMCE_ENTR_INIT_CSCR_D(■LOCR_CMCE_가입초기케어상세) ==> 완료[♥♡]  
12. L0CR_TB_CMCE_ENTR_INIT_CSCR_M(■LOCR_CMCE_가입초기케어기본): 암호화 ==> 개발 중[☞☜]   
13. L0CR_TB_CMCE_EVET RQST_AGR_RSLT_D(■LOCR_이벤트 신청 동의 결과 상세): 암호화 ==> 완료[♥♡]  
14. L0CR_TB_CMCE EVET RQST_RSPN_RSL_D(■LOCR_이벤트 신청 응답 결과 상세) ==> 완료[♥♡]
15. L0CR TB_CMCE_HM_MLIN_BIZ_ACTN_H(■LLCR_홈 다회선 영업 활동 이력) ==> 완료[♥♡]
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.12(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 2022년 귀속 종합소득세 신고 수수료 송금(10시, 텍스나라[양성희], 사업장)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
06. L0CR_TB_CMCE_CMPN_RSPN_RSLT_H(■L0CR_CMCE_캠페인응답결과이력): 암호화  ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_h_001_bq2gcswithfin.sql
1. 에러 내용:
sorry, we cannot cherry-pick the commit automatically. This commit may already have  been cherry-pick, or a more
recent commit may have updated some of its content.
죄송합니다. 커밋을 자동으로 선별할 수 없습니다. 이 커밋은 이미 선별되었거나 그 이상일 수 있습니다.
최근 커밋이 일부 콘텐츠를 업데이트했을 수 있습니다.
2. 조치: master 브랜치와 develop 브랜치의 LOCR_TB_CMCE_CMPN_RSPN_RSLT_H을 비교하여 cherry-pick이 안된 부분을
순서대로 cherry-pick 처리함
==============================================================================================================

- 파일 삭제하기 @@@
$ git rm test.sql
git commit -m "Add to 01. test.sql 파일 삭제[05.11(T_01)], by 진태만]"; 		# 01. 해당 파일을 저장에서 모두 삭제, 2. 커밋 메시지를 편집(commit -m) ■■

$ git push 						# 02. git 서버로 추가(push) ■■

$ cat test.csv wc-l 			# 03. 삭제된 파일 확인 ■■
==============================================================================================================
 
 ■■■■■■■■■■■■■■■■■■ 2023.05.13(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
06:06 기상
07:10 조식(수종: 돈까스 3개)
07:35 실내 도보
08:20 종료
08:30 집 출발(자전거: 수종, 반팔, 반 바지)
08:35 보라매 공원 도착
08:35 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
09:15 종료
09:17 물통에 물 떠 옴(보라매 공원 놀이터)
09:24 귀가
09:30 샤워(찬물)
10:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가
13:10 수종 엄마집에 놀러감
13:20 인터네 서핑 ==> 비주얼 스튜디오 코드 분석
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:00 취침
==============================================================================================================
 
- Visual Studio Code 계정 로그인
1. Microsoft(마이크로소프트) 계정으로 로그인: tamario@naver.com/asas12**!!
==================================================================================================================
 
- 비쥬얼 스튜디오 코드 설치 및 웹개발을 위한 필수 익스텐션 10개 추천 | 프론트엔드 개발자 입문편: HTML, CSS, Javascript
https://www.youtube.com/watch?v=bS9yTI2fC0w 
04:46 - Material theme  ==> one dark pro 설치함
05:00 - Material icon theme
05:20 - Prettier
06:56 - bracket pair colorizer
07:28 - Indent-rainbow
08:00 - Auto rename tag 
09:00 - CSS PEEK
09:43 - HTML CSS SUPPORT
10:00 - Live Server
0. 환경 설정: Ctrl + ,
==================================================================================================================

- 비주얼 스튜디오 코드 폰트 변경
https://bny9164.tistory.com/37
1. vscode 설정(editor) > 텍스트 편집기(text editor) > 글꼴(font) > Font family 설정
/settings.json 파일에서(C:\Users\TAMA_HAart_404\AppData\Roaming\Code\User\)
{
    "workbench.startupEditor": "none",
    "security.workspace.trust.untrustedFiles": "open",
    "editor.fontFamily": "함초롬돋움",	// 01. 함초롬돋움 폰트 설정 ■■  
    "editor.fontLigatures": false,
    "editor.tabSize": 10,
	"workbench.colorTheme": "Visual Studio Dark"	 // 테마 설정  ■■
} 
-------------------------------------------------------------------------------------------------------------------

/settings_02.json 파일에서
{
	"workbench.startupEditor": "none",
	"security.workspace.trust.untrustedFiles": "open",
	"editor.fontFamily": "함초롱돋움",	    // 01. 함초롬돋움 폰트 설정 ■■  
	"editor.fontLigatures": false,
	// "workbench.colorTheme": "Quiet Light" 
	// "workbench.iconTheme": "vs-minimal",    // 40. vs-minimal 아이콘 테마  설정  ■■ 
	"workbench.iconTheme": "material-icon-theme",		 // 41. Material 아이콘 테마  설정설정 ■■■  

	// "workbench.colorTheme": "Visual Studio Dark",   // 50. Visual Studio 검정색 테마 설정 ■■ 
	// "workbench.colorTheme": "Material Theme Lighter High Contrast",	 // 52. Material Theme에서흰색 High Contrast 테마 설정 ■ 
	// "workbench.colorTheme": "Material Theme Darker High Contrast",	// 51. Material Theme에서 검정색 High Contrast 테마 설정 ■■■ 
	// "workbench.colorTheme": "green spring froggy theme",		 // 53. reen spring froggy theme에서green spring froggy theme 설정 ■ 
	// "workbench.colorTheme": "Atom One Dark",	// 55. Atom One Dark Theme에서 Atom One Dark 테마 설정 ■■■ 	
	// "workbench.colorTheme": "Evergreen Dark",	// 56. Adapta Evergreen Theme에서 Evergreen Dark 테마 설정 ■■■ 
	// "workbench.colorTheme": "One Dark Pro Darker",	// 54. One Dark Pro Darker에서 One Dark Pro Darker 테마 설정 ■■■ 
	// ===========================================================================================================================>
	
	"workbench.colorTheme": "Default Light+",	// 57. Default 테마 설정 ■■■ 
	
	"workbench.colorCustomizations": {	// 색상 테마 커스텀
		"activityBar.background": "#162e1a", // 액티비티 바 배경색 설정 ■■■ 
		"breadcrumb.background": "#d0e0cf", // top path
		"button.background": "#162e1a",
		// "editor.background": "#d7e4d6",	// 02. 배경색 설정(밝은 녹색: d7e4d6) ■■■ 
		"editor.background": "#C0DEBE",	// 02. 배경색 설정(녹색: C0DEBE) ■■■ 
		"editor.lineHighlightBackground": "#d0e0cf",
		"editor.selectionBackground": "#c1d1c2",
		"editorGroupHeader.noTabsBackground": "#c1d1c2",
		"editorGroupHeader.tabsBackground": "#c1d1c2",
		"editorGutter.background": "#d0e0cf",
		"editorWidget.background": "#c1d1c2", // cmd + p, editor hover
		"input.background": "#d7e4d6",
		"list.activeSelectionBackground": "#d0e0cf",
		"list.activeSelectionForeground": "#162e1a",
		"list.focusOutline": "#d0e0cf",
		"list.hoverBackground": "#d0e0cf",
		"list.inactiveSelectionBackground": "#d0e0cf",
		"list.inactiveSelectionForeground": "#162e1a",
		"minimap.background": "#d0e0cf", // right end
		"peekViewEditor.background": "#d0e0cf",
		"peekViewResult.background": "#c1d1c2",
		"sideBar.background": "#c1d1c2",
		"statusBar.background": "#3f833f",		
		"tab.activeBackground": "#d0e0cf",
		"tab.border": "#c1d1c2",
		"tab.inactiveBackground": "#c1d1c2",
		"terminal.background": "#d7e4d6"
	},
	 
	"editor.minimap.enabled": false		// 90. mini map.설정(사용안함)  ■■
}
-------------------------------------------------------------------------------------------------------------------

- Visual Studio Code 연두색 테마
https://thinkforthink.tistory.com/366
==================================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.05.14(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
06:10 기상
06:15 조식
06:30 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:51 귀가
08:00 인터넷 서핑
11:30 중식
11:50 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가 
14:00 수종 귀가 
14:00 인터넷 서핑 ==> 비주얼 스튜디오 코드 분석 
14:00 수종 귀가
17:00 집 출발(자전거: 수종, 반팔, 반 바지)
17:10 보라매 공원 도착
17:15 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
17:51 종료
18:06 LED리폼모듈  방문 ==> 김헤자 도시락(5,500원), 삼겹살(5,900원), 생수(700원)
18:08 GS25 신대방 노블점 방문 ==> 석식(수종: 김헤자 도시락(5,500원), 삼겹살(5,900원), 생수(700원): 만원
12:55 다이소 난곡 사거리점 방문 ==> 1. 진드기 차단 고밀도 베개 커버(약 40x60cm: 2개, 만원), 2. C 완전 자동 3단 우산 55 cm(5천원)
		 3. 보우 맥스 알카라인 건전지(LR03) 4P(천원) 구입
18:40 귀가
18:45 실내 도보
19:35 종료
20:15 청소(청소기, 밀대)
21:00 샤워(온수: 체중: 70.8kg ==> BMI: 24.4[과 체중])
22:30 취침
==============================================================================================================

- 현미 쌀 주문
- 가가호호종합미곡처리장 2022 농사꾼 양심쌀 찹쌀 현미 20kg [1개], 가격: 40,700원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=B492924502&frm3=V2
https://www.enuri.com/detail.jsp?modelno=10170505
=============================================================================================================

- 김 상온에 보관하고 계시면 당장 냉동실에 옮겨주세요
https://www.youtube.com/watch?v=NvwPj4mUt34&t=1s
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.15(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 유승현 전무에게 단가 관련해서 전화(08시, 750 수정 합의)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
01. L0BIM_DCT_CALENDAR(■LOBIM 통합정보시스템_DCT_달력): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dct_calendar_001_bq2gcswithfin.sql 
02. L0BIM_DKV_GC_PP(■LOBIM_통합정보시스템_DCT_GC_요금제): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dkv_gc_pp_001_bq2gcswithfin.sql
03. L0BIT_OHW_DCF_SBGN_MART(■통합정보시스템_개통마트): 암호화: ==> 완료[♥♡]  
==> grape_odl_cr_002_10bit_ohw_dcf_sbgn_mart_001_bq2gcswithfin.sql 
04. L0BTM_ORG_USER(■LOBIM_사용자마스터) ==> 완료[♥♡]
==> grape_odl_cr_002_l0bit_obw_dct_sbgn_mart_001_bg2gcswithfin.sql 
05. L0CPT_CC_APP_WASLOG_V3(■고객센터APP_고객센터이용내역3.0): 파티션을 나눈 테이블  ==> 완료[♥♡]
==> grape_odl_cr_002_10cpt_cc_app_waslog_v3_001_bg2gcswithfin.sql
06. L0CR_TB_CMCE_CMPN_RSPN_RSLT_H(■L0CR_CMCE_캠페인응답결과이력): 암호화  ==> 개발 중[☞☜] 
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_h_001_bq2gcswithfin.sql 
07. L0CR_TB_CMCE_CMPN_RSPN_RSLT_M(■L0CR_CMCE_캠페인응답결과기본): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_m_001_bq2gcswithfin.sql 
08. L0CR_TB_CMCE_CNSL_ADRE_RSLT_D(■L0CR_CMCE_상담예약결과상세): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cnsl_adre_rslt_d_001_bq2gcswithfin.sql  ==> 완료[♥♡]  
09. L0CR_TB_CMCE_CRM_CMM_CD(■L0CR_CMCE_CRM공통코드) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_crm_cmm_cd_001_bq2gcswithfin.sql 
10. L0CR_TB_CMCE_CUST_CALL_ACTN_H(■L0CR_고객콜활동이력) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cust_call_actn_h_001_bq2gcswithfin.sql
==============================================================================================================

11 LOCR_TB_CMCE_ENTR_INIT_CSCR_D(■LOCR_CMCE_가입초기케어상세) ==> 완료[♥♡]   
13. L0CR_TB_CMCE_EVET RQST_AGR_RSLT_D(■LOCR_이벤트 신청 동의 결과 상세): 암호화 ==> 완료[♥♡]  
14. L0CR_TB_CMCE EVET RQST_RSPN_RSL_D(■LOCR_이벤트 신청 응답 결과 상세) ==> 완료[♥♡]
15. L0CR TB_CMCE_HM_MLIN_BIZ_ACTN_H(■LLCR_홈 다회선 영업 활동 이력) ==> 완료[♥♡]
==============================================================================================================

01. L0BIM_DCT_CALENDAR(■LOBIM 통합정보시스템_DCT_달력): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dct_calendar_001_bq2gcswithfin.sql 

1. 폴더 설정: cd /D/ob_dsgn/01_LOBIM_DCT_CALENDAR_TB명_LOBIM_통합정보시스템_DCT_달력
--> 01_LOBIM_DCT_CALENDAR_00TB명_LOBIM_통합정보시스템_DCT_달력
==============================================================================================================

01_LOBIM_DCT_CALENDAR_00_TB명_LOBIM 통합정보시스템_DCT_달력 ==> 완료[♥♡] 
01_LOBIM_DCT_CALENDAR ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dct_calendar_001_bq2gcswithfin.sql 

02_LOBIM_DKV_GC_PP_00_TB명_LOBIM_통합정보시스템_DCT_GC_요금제 ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dkv_gc_pp_001_bq2gcswithfin.sql
-------------------------------------------------------------------------------------------------------------------------

TAMA_HAart_404@TAMA-HAart-404 MINGW64 /D/ob_dsgn/01_LOBIM_DCT_CALENDAR
$ cd /C/Users/TAMA_HAart_404/Downloads		 # 다운로드 폴더 경로 ■■■ 
==============================================================================================================

- 파일 복사, 이동, 삭제(리눅스[터미널]에서) 
- 리눅스 / 명령어 / cp - 복사하는 명령어, mv - 이동하는 명령어
$ cp abc.txt def.txt			# abc.txt 파일을 def.txt로 이름을 바꾸어 복사 ■■■  

$ mv abc.txt xyz/def.txt		# abc.txt 파일을 xyz 디렉토리 안으로 def.txt로 이름을 바꾸어 이동■■■  .

https://www.manualfactory.net/10805
==============================================================================================================
 
12-1-2. 방화벽 신청[23..05.15(월)] ==> 완료[♥♡]
■ 마당 > See All > IT지원 > IT서비스요청(U Cloud 사용자) > U Cloud 사용자 방화벽 > 정책 신청 내역
1. 신청 제목 : CRM 현행화 프로젝트
2. 신청사유: CRM 데이타 현행화 프로젝트 수행
3. cloudpc\tamario 					4. 목적지: SECURITY_CLOUDPC
5. 직접입력: 172.18.195.34 		6. TCP: 6005~6009,6014-6114  ==> 완료[♥♡] 
5. 직접입력: 172.18.195.34 		6. TCP: 8321, 8325   --> 개발 ==> 완료[♥♡]
5. 직접입력: 172.18.196.41 		6. TCP: 8321, 8325   --> 운영 ==> 완료[♥♡]
5. 직접입력: 172.18.194.101 		6. TCP: 8321, 8325   --> 운영 ==> 신청 완료
7. 사용 목적: 8321, 8325: 외부 대이타 수집을 위해 방화벽 해제 요청
============================================================================================================== 

- QCY T13 ANC 구입[23.05.15(월)]
- QCY T13 ANC [정품, 해외구매] 색상: 화이트, 가격: 18,200원
https://www.enuri.com/detail.jsp?modelno=101646908
http://www.tmon.co.kr/deal/18323836002?isHistory=Y
=============================================================================================================

- 개인통관고유부호 재발급 [23.05.15(월)]
0. 개인통관고유부호(진태만): P190020517082,   ===> JIN TAEMAN
1. 이름: 진태만,                 2. 주민번호: 720625-1******
3. 주소: 서울특별시 관악구 조원로 159-1, 현아트빌 404호
4. 전화번호: 010-3072-0898,   5. 이메일: tamario@naver.com 
6. 사용여부: 사용
==============================================================================================================

- LG U+ DLK Prj 회의(14시, 개발실)
1. Airfllow애서 배치 서버에 Dag 데이타 안 보임 ==> 이슈 제기(최학식 팀장에겨 요청)
2. BCP 작업 요구 사항 변경 ==> 06월 4일(일)까지 개발 서버에 적재 완료할 것
 1) 메인 테이블: 전체 데이타 적재(LIMIT 100 제거)
 2) 로그 테이블: 2023년 3월 데이타 적재
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.16(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업  
12. L0CR_TB_CMCE_ENTR_INIT_CSCR_M(■LOCR_CMCE_가입초기케어기본): 암호화  ==> 완료[♥♡] 
16. L0CR_TB_CMCE_INTG_RGU_CUST_D(■LOCR_통합 단골 고객 상세) ==> 완료[♥♡] 
17. L0CR TB_CMCE_INTG_RGU_CUST_D_H(■LOCR_통합 단골 고객 상세 이력) ==> 완료[♥♡] 
18. L0CR TB_CMCE_INTG_RGU_CUST_M(■LOCR_통합 단골 고객 기본) ==> 완료[♥♡] 
19. L0CR_TB CMCE_LNDG_PAGE_LEDN_H(■LOCR_랜딩 페이지 인입 이력) ==> 완료[♥♡] 
20. L0CR_TB_CMCE_MMS_SEND_FNSH_D(■LOCR_MNS 발송 완료 상세) ==> 완료[♥♡] 
==============================================================================================================

- VsCode
D:\01. TAMA_DATA\01. TAMA Work\01. Memo\91. VsCode
==============================================================================================================

- LG U+ DLK Prj 회의(09시, 개발실)
1. BCP 메인, 로그 테이블 문제로 김일기 PM와 이병욱 책임 싸움
2. 고객 요구사항이 변경됨
==============================================================================================================

- 어묵 구입
- [위메프] 대림 부산어묵 알뜰사각 1kg(할인 혜택가: 2,770원 ==> 6개, 20,120원) 구입
https://www.enuri.com/detail.jsp?modelno=16983913
https://front.wemakeprice.com/product/882766846
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.17(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 주간 보고서 작성(10시), 에어컨 때문에 집에서 패딩 가지고 옴, 박묘숙 책임 휴가, 화공과 6월 모임 참석 검토(
								13시, 영동 창규 펜션: 건우, 영수, 경진에게 전화함)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업  
21. L0CR_TB_CMCE_MMST_SEND PRSS D	==> 완료[♥♡] 
22. L0CR_TB_CMCE_NOTR_SBRN_ADDR_D.	==> 완료[♥♡] 
23. L0CR_TB_CMCE_OCMP_CMP_DEN_CUS_D_H	==> 완료[♥♡] 
24. L0CR_TB_CMCE_OCMP_CMPN_RSPN_RSL	==> 완료[♥♡] 
25. L0CR_TB_CMCE_RCMD_CUST_LTTR_SEN_H	==> 완료[♥♡] 
26. L0CR_TB_CMCE_RGU_CUS_HM_SOH_PRO_D	==> 완료[♥♡] 
==============================================================================================================

- 형변환(BigQuery)
 https://cloud.google.com/bigquery/docs/reference/standard-sql/conversion_functions
CAST(expression AS INT64)
CAST(expression AS STRING)
CAST(expression AS DATE [format_clause])
 -------------------------------------------------------------------------------------------------------
 
- Big Query - 날짜 형식 : PARSE_DATE, EXTRACT, DATE_ADD, DATE_SUB, DATE_DIFF
https://steadiness-193.tistory.com/251

1. PARSE_DATE(format_string, STRING)    // 텍스트를 날짜로 변환
 1) PARSE_DATETIME("%d/%m/%Y", DateTime) --> 2008-12-25

2. FORMAT_DATE(format_string, STRING)    // DATE를 날짜로 변환
 1) FORMAT_DATE("%Y-%m-%d", BQ_LOAD_DTTM) --> 2008-12-25
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.18(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 전필관 책임과 빌라 사기 상담(15시, 회의실)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
26. L0CR_TB_CMCE_RGU_CUS_HM_SOH_PRO_D	==> 완료[♥♡] 
27. L0CR_TB_CMCE_RGU_CUST_GRP	==> 완료[♥♡] 
28. L0CR_TB_CMCE_RGU_CUST_GRP_MAPG_D	==> 완료[♥♡] 
29. L0CR_TB_CMCE_RGU_CUST_MBL_PROD_D	==> 완료[♥♡] 
==============================================================================================================

- 김일기 PM 면담(09시,  김영식 책임과 통행):  커피(김 PM이 쏨)
1. (주) 예술과 기술이 단가 80으로 줄이고 프로젝트 투입 후 1개월 만에 계약 후 구두로 합의한 단가 보다 10만 적게 지급함
 1) 05.15(월)에 김승현 전문에게 이의 제거 했고 김 전문가 조치를 취해준다고 함
 2) 05.18(목) 현재 아무 조치도 없음
2. 김일기 PM이 예술과 기술 끊고 다른 업체 컨텍 도와 주겠다고 함.
==============================================================================================================
    
 - [Excel] 연결의 자동 업데이트를 사용할 수 없도록 설정했습니다 (보안 경고: 콘텐츠 사용) 해결법 
 https://dorudoru.tistory.com/1034
 1. 원인: 엑셀에 외부 파일을 불러오는 시트가 포함되어 있는 경우에, 외부파일이 복사되지 않아서 생기는 메시지 
 2. 조치: 엑셀 ==> 데이터 -> 연결 편집 -> 연결 끊기
  1) 시작할 때 확인 메시지 표시
   1) 알림 표시 없이 자동 연결 업데이트 안함 (D)
---------------------------------------------------------------------------------------------------------

- 엑셀 파일 열때 업데이트 문제 해결하기
https://m.blog.naver.com/tan131/221907128266
1. 파일 > 옵션 ==> Excel 옵션(새창) ==> 보안 센터(Tab)  
 1) 보안센터 설정(T): 클릭
 2) 외부 콘텐츠
   가. 데이터 연결에 대한 보안 설정 ==> 데이터 연결 모두 사용 안 함(D): 체크
   나. 통합 문서 링크에 대한 보안 설정==> 통합 문서 링크 자동 업데이트 사용 안함(I): 체크
==============================================================================================================
 
- PuTTY / 사용법 / 자동 로그인하는 방법
https://www.manualfactory.net/10889
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.19(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 예술과 기술 유승현 전무에게 단가 수정 메일 보냄(08시, 사업장), 이병욱, 송재혁 책임 철수(14시, PM이 철수 지시)
								, 최성오 책임 휴가, 김일기 PM 반차 내고 오후에 퇴근, 4월 급여 소급분(740 --> 750) 67,220원 송금 됨

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
31. L0CR TB_CMCE_SOHO_STRY_TRGE_RUL_M	==> 완료[♥♡] 
32. L0CR_TB_CMCE_SOHO_TRGET_IMP_REQ_D	==> 완료[♥♡] 
33. L0CR_UA_CAMPAIGN	==> 완료[♥♡] 
34. L0CR_UA_FLOWCHART ==> 완료[♥♡] 
35. L0CR_UA_OFFER ==> 완료[♥♡] 
36. L0CR_UA_OFFERATTRIBUTE ==> 완료[♥♡] 
37. L0CR_UA_TARGETCELLS ==> 완료[♥♡] 
38. L0CR_UAA_ALLOC_SLF_MO ==> 완료[♥♡] 
39. L0CR_UAA_BEFO_TRGT ==> 완료[♥♡] 
40. L0CR_UAA_BEFO_TRGT_DUP_RMV ==> 완료[♥♡] 
==============================================================================================================

- 커피 타임(14:30, 버거킹)
1. 전필관 책임, 아아: 박묘숙 책임이 쏨
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2023.05.20(토) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말[★]
05:50 기상
07:00 조식(수종: 돈까스 3개)
07:20 실내 도보
08:25 종료
08:30 집 출발(자전거: 수종, 반팔, 반 바지)
08:35 보라매 공원 도착
08:35 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
09:10 종료
09:12 물통에 물 떠 옴(보라매 공원 놀이터)
09:16 귀가
09:30 샤워(찬물)
10:00 인터넷 서핑
10:40 수종 센터로 감
11:30 중식 
11:45 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
12:45 진로 마트 방문 ==> 샘표 진간장 금S(1.7L, 6,980원) 구입
13:04 귀가
13:10 수종 엄마집에 놀러감
13:20 인터네 서핑 ==> 
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:00 취침
==============================================================================================================

- SSH 접속 프로그램 사용법 (PuTTY, MTPuTTY)
https://www.youtube.com/watch?v=N7PAAc4gqxw
01. MT PuTTY v1.6
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.05.21(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 

- 주말2[★]
05:50 기상
06:00 조식
06:38 집 출발(빗 방울[우산 소지], 쌀쌀함)
06:40 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
08:00 귀가
09:30 어묵 무침
10:16 종료 
10:20 인터넷 서핑
11:30 중식
11:50 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가 
14:00 인터넷 서핑 ==> 01. VS Code에서 Git 사용법 분석
17:30 석식
17:50 실내 도보
19:00 수종 귀가 
19:05 종료
20:15 청소(청소기, 밀대)
21:00 샤워(온수: 체중: 69.6kg ==> BMI: 24.08[과 체중])
22:10 취침
==============================================================================================================

- 어묵 무침[★]
1. 재료: 어묵 무침 6kg[6개), 양념(간장, 고추가루, 올리고당)
2. 요리법
 1) 스텐 양동이에 어묵을 썰어서 담기
 2) 커피 포터에 뜨거운 물(2번)을 끓어서 어묵을 반찬통에 넣고 30초 정도 데워줌
 3) 어묵을 건져서 찬물이 들어 있는 스텐 양동이에 넣어 식혀 줌
 4) 어묵을 채반에 건져내서 물기를 뺀 후 반찬통에 넣음
 5) 간장 10번 뿌림, 고추장 3큰 술 넣고 버무림
==============================================================================================================

- BMI 계산
https://search.naver.com/search.naver?ie=UTF-8&sm=whl_nsg&query=bmi+%EA%B3%84%EC%82%B0%ED%95%98%EA%B8%B0
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.22(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
 41 LOCR_UAA_CMPㅋㅎN_CHNL ENV  ==> 완료[♥♡] 
42. L0CR_UAA_CMPN_EXEC_TRGT 	 ==> 완료[♥♡] 
43. L0CR_UAA_DIRT LEDN_TRGT_INFO 	 ==> 완료[♥♡] 
44. L0CR_UAA_DIRT_LEDN_TRGT_INFO_INS	 ==> 완료[♥♡] 
45. 46. L0CR_UAA_DVCH_MGMT_DUP_RMV 	 ==> 완료[♥♡] 
47. L0CR_UAA_EXCL 	 ==> 완료[♥♡] 
48. L0CR_UAA_IPSB_SHOP_DATA ==> 완료[♥♡] 
==============================================================================================================

- 23년 LG 유플러스 정보 보안 교육(법정 필수) 
1. 인터넷 강의 시청(14시 ~ 14:30)
 1) 교육기간 : 5/22(월) ~ 5/26(금) *PC/모바일 모두 수강 가능합니다. 
 2) 교육방법: U+ 배움마당(https://edumadang.lguplus.co.kr/) 온라인교육
 3) 수강경로: U+ 배움마당 > My > 사내강좌 > 내강좌> 수강중인 강좌(총 30분) 
2. 강좌 소개
'23년도 정보보안 필수 교육'입니다.
개인정보보호법 제26조에 따른 법정 필수 교육으로, 아래 동영상을 모두 100% 들으셔야 이수로 처리됩니다.

■ 강의내용
1강 정보보안교육 : 정보보안 사고 사례
2강 정보보안교육 : 업무 정보보안(UCloud, PC, 스마트폰 등)
3강 개인정보보호교육 : 개인정보, 가명정보, 익명정보
4강 보안사고교육 : 사고발생시 신고절차, 개선대책수립 등
==============================================================================================================

- PuTTY SW 확인
- SSH 접속 프로그램 사용법 (PuTTY, MTPuTTY)
https://www.youtube.com/watch?v=N7PAAc4gqxw
01. MT PuTTY v1.6(사용 안함)
1. 버전 안 맞아 설치 불가 ==> 보안 클라우드 PC 사양: 윈도우 서버 2019
---------------------------------------------------------------------------

02. MT PuTTY Manager SW 설치(향후 사용할 것)
1. 설정 안됨
 1) 현상: Remote side unexpectedly closed network connection

PuTTY Session
PuTTY Cofiguration
-----------------------------------------------------------------------------------------------

- puttycm (putty connection manager) 멀티원도우 프로그램 공유
https://blog.naver.com/PostView.naver?blogId=kletgdgo&logNo=222479020187&redirect=Dlog&widgetTypeCall=true&directAccess=false
==============================================================================================================
  
- VisualStudio CodeSW 확인  
1. 대용량이여서 다운로드 불가
==============================================================================================================
  
- Q-Dir SW 확인
1. 버전 안 맞아 설치 불가 ==> 보안 클라우드 PC 사양: 윈도우 서버 2019
==============================================================================================================
 
- 7zip 분할 압축 방법 및 풀기
https://seogilang.tistory.com/1209
1. Daum 메일: 첨부하신 파일들의 용량 총합이 25MB를 넘으면 이후 첨부 파일들은 대용량 첨부 형식으로 변경되어 발송
2. 20M씩 분할 압축해서 메일 보냄
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.23(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 중식(11:40, 바삭하게: 돈가스[과식]: 박묘숙, 김영식 책임[쏨])

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
 01. L0BIM_DCT_CALENDAR(■LOBIM 통합정보시스템_DCT_달력): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dct_calendar_001_bq2gcswithfin.sql 
02. L0BIM_DKV_GC_PP(■LOBIM_통합정보시스템_DCT_GC_요금제): ==> 완료[♥♡]  
==> grape_odl_cr_002_10bim_dkv_gc_pp_001_bq2gcswithfin.sql
03. L0BIT_OHW_DCF_SBGN_MART(■통합정보시스템_개통마트): 암호화: ==> 완료[♥♡]  
==> grape_odl_cr_002_10bit_ohw_dcf_sbgn_mart_001_bq2gcswithfin.sql 
04. L0BTM_ORG_USER(■LOBIM_사용자마스터) ==> 완료[♥♡]
==> grape_odl_cr_002_l0bit_obw_dct_sbgn_mart_001_bg2gcswithfin.sql 
05. L0CPT_CC_APP_WASLOG_V3(■고객센터APP_고객센터이용내역3.0): 파티션을 나눈 테이블  ==> 완료[♥♡]
==> grape_odl_cr_002_10cpt_cc_app_waslog_v3_001_bg2gcswithfin.sql
06. L0CR_TB_CMCE_CMPN_RSPN_RSLT_H(■L0CR_CMCE_캠페인응답결과이력): 암호화  ==> 개발 중[☞☜] 
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_h_001_bq2gcswithfin.sql 
07. L0CR_TB_CMCE_CMPN_RSPN_RSLT_M(■L0CR_CMCE_캠페인응답결과기본): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cmpn_rspn_rslt_m_001_bq2gcswithfin.sql 
08. L0CR_TB_CMCE_CNSL_ADRE_RSLT_D(■L0CR_CMCE_상담예약결과상세): 암호화 ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cnsl_adre_rslt_d_001_bq2gcswithfin.sql  ==> 완료[♥♡]  
09. L0CR_TB_CMCE_CRM_CMM_CD(■L0CR_CMCE_CRM공통코드) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_crm_cmm_cd_001_bq2gcswithfin.sql 
10. L0CR_TB_CMCE_CUST_CALL_ACTN_H(■L0CR_고객콜활동이력) ==> 완료[♥♡]  
==> grape_odl_cr_002_10cr_tb_cmce_cust_call_actn_h_001_bq2gcswithfin.sql
11 LOCR_TB_CMCE_ENTR_INIT_CSCR_D(■LOCR_CMCE_가입초기케어상세) ==> 완료[♥♡]  
12. L0CR_TB_CMCE_ENTR_INIT_CSCR_M(■LOCR_CMCE_가입초기케어기본): 암호화 ==> 개발 중[☞☜]   
13. L0CR_TB_CMCE_EVET RQST_AGR_RSLT_D(■LOCR_이벤트 신청 동의 결과 상세): 암호화 ==> 완료[♥♡]  
==============================================================================================================

- DA Data 회의(15시, LG U+ CRM Prj)
1. 강사 : (주)애버커스 최학식 팀장
2. 장소: LG U+ 6층 중회의실 E11-04
3. 내용 : 
 1) 암복호화 문제
 2) GCP와 PDA간 DB 데이타 Type 문제 논의
 ==> 19시까지 있다가 도중에 퇴근 함
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.24(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> GCP(송도윤, 차혜연) 2명, PDA DBA(유규식) 투입(09시, 사업장), 주간 보고서 작성(13시), 이앤티 컨버전스
								심경수 전무에게 프로필 메일로 전송(20시, 신한은행 기업뱅킹 웹개발 업무, 월 800), 22년 귀속 종합소득세 
								신고 정리(20시, 집)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
14. L0CR_TB_CMCE EVET RQST_RSPN_RSL_D(■LOCR_이벤트 신청 응답 결과 상세) ==> 완료[♥♡]
15. L0CR TB_CMCE_HM_MLIN_BIZ_ACTN_H(■LLCR_홈 다회선 영업 활동 이력) ==> 완료[♥♡]
16. L0CR_TB_CMCE_INTG_RGU_CUST_D(■LOCR_통합 단골 고객 상세)  ==> 완료[♥♡]
17. L0CR TB_CMCE_INTG_RGU_CUST_D_H(■LOCR_통합 단골 고객 상세 이력)  ==> 완료[♥♡]
18. L0CR TB_CMCE_INTG_RGU_CUST_M(■LOCR_통합 단골 고객 기본)  ==> 완료[♥♡]
19. L0CR_TB CMCE_LNDG_PAGE_LEDN_H(■LOCR_랜딩 페이지 인입 이력)  ==> 완료[♥♡]
20. L0CR_TB_CMCE_MMS_SEND_FNSH_D(■LOCR_MNS 발송 완료 상세)  ==> 완료[♥♡]
21. L0CR_TB_CMCE_MMST_SEND PRSS D	==> 완료[♥♡] 
22. L0CR_TB_CMCE_NOTR_SBRN_ADDR_D.	==> 완료[♥♡] 
23. L0CR_TB_CMCE_OCMP_CMP_DEN_CUS_D_H	==> 완료[♥♡] 
24. L0CR_TB_CMCE_OCMP_CMPN_RSPN_RSL	==> 완료[♥♡] 
25. L0CR_TB_CMCE_RCMD_CUST_LTTR_SEN_H	==> 완료[♥♡] 
26. L0CR_TB_CMCE_RGU_CUS_HM_SOH_PRO_D	==> 완료[♥♡] 
27. L0CR_TB_CMCE_RGU_CUST_GRP	==> 완료[♥♡] 
28. L0CR_TB_CMCE_RGU_CUST_GRP_MAPG_D	==> 완료[♥♡] 
29. L0CR_TB_CMCE_RGU_CUST_MBL_PROD_D	==> 완료[♥♡] 
30. L0CR_TB_CMCE_SOHO_POS_DSTB_RULE_D	==> 완료[♥♡] 
==============================================================================================================

- (주)애버커스 이성진 담당 면담(07시, 사무실)
1. 프로젝트 한 달 연장(07월까지 연장 요청: 업체에 보냈다고 함)
2. 23년 08월부터 새로운 프로젝트 수행 예정(직계약은 불가하다고 함)
3. emart 24 편의점에서 캔커피 얻어 먹음
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.05.25(목) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> PDA 개발자(신석만 책임) 투입(09시)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. 최종 수정 작업 ==> 완료[♥♡] 
==============================================================================================================

- QCY T13 이어폰을 MSI 노트북(업무용)에 셋팅
1. 윈도우키 + X : 빠른 링크(Quick Link) ==> 시스템(Y): 장치(조회 클릭) ==> Bluetooth 및 다이비스 기타 장치
 1) Bluetooth 및 기타 장치 추가: 클릭
  가. 디바이스 추가(새창)
   가) Bluetooth: 클릭
   나) QCY T13 ANC: 보이면 클릭
	==> QCY T13  이어폰에서 이어폰 양쪽 유닛을 케이스에서 모두 넣은 뒤, 케이스 가운데 하단부 버튼을 약 15총 이상 꾸욱
	누르고 있으면 파란/빨간빛이 교차로 들어오면서 보랏빛이 깜빡이게 되는데 이는 초기화가 진행되고 있다는 듯이며,
	보랏빛이 멈추면 초기화가 완료됨(이어폰 유닛에 붙어있는 노란색 씰 제거 후 케이스에 유닛을 다시 꽃아 페어링 진행할 것) 
  다) 오디오 ==> QCY T13 ANC: 페어링 됨
==============================================================================================================

- dbeaver 사용 가이드 (1) 설치 및 데이터소스 연결(Google BigQuery)
https://velog.io/@2innnnn0/dbeaverguide
==============================================================================================================

- MP Manager Putty(Multi PuTTY Manager): SSH, 터미널
https://sourceforge.net/projects/multiputtymanager/
==============================================================================================================

- 커피 타임(15시, 버거킹 마곡점)
1. 전필관 책임,  박묘숙 책임, 송도윤 대리, 차혜연 대리 ==> 내가 쏨(7,100원)
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.05.26(금) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> CRM PDA 프로젝트 이슈회의(14시, 5층 소회의실 E9-01): PCA 개발자 만 참석

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
42. L0CR_UAA_CMPN_EXEC_TRGT ==> 완료[♥♡] 
12. L0CR_TB_CMCE_ENTR_INIT_CSCR_M(■LOCR_CMCE_가입초기케어기본): 암호화 ==> 에러 발생
1. 신규 merge file명을 못 가지고 옴
==============================================================================================================

- 커피 타임(08:20, emart24)
1. 최성오 책임: 업무 재할당, DB Table 칼럼 수정 요청 ==> 06달 철수 문제 논의
==============================================================================================================

- DLK_OB 교육(09:30, 임원실)
1. 대상: 송도윤, 차혜연 대리
2. 내용: 42. L0CR_UAA_CMPN_EXEC_TRGT 샘플을 실행하면서 진행
==> 송도윤 대리에게 LG  U+ 출입증 빌려줌(16:50, 출입증 나올 떄까지 식사용으로 사용 하라고 함)
==============================================================================================================
 
- (주) 예술과 기술 유승현 전무에게 전화 옴(15시, 사업장)
1. 이번 프로젝트 1달 연장(23년 07월까지): 박묘숙 책임 포함(전필관 책임 06월까지) ==> 동의함
2. 다음 프로젝트 LG 헬로비전 예정(23년 08월부터): JAVA 개발
 1) 상암디지털드림타워 6층(집에서 너무 멈: 수색역에서 도보 17분)
 2) 박묘숙 책임, 전필관 책임(선발대) 08월부터 같은 참여
 3) 단가를 현실적으로 맞춰 달라고 요구 함(800이하 불가)
==============================================================================================================
  
■■■■■■■■■■■■■ 2023.05.30(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업
1. 
==============================================================================================================

 ■■■■■■■■■■■■■■■■■■ 2023.05.27(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 07:00 ~ 17:30 ==> 부처님 오신 날, 오전 부터 비

- 주말[★] 
06:10 기상
06:15 조식
06:30 집 출발
06:30 도보(도림천 => 서울대 벤처 타운역(동방1교: 반환점) ==> 도림천)
07:51 귀가
08:00 인터넷 서핑
11:30 중식
11:45 실내 보도
13:04 종료
13:20 인터네 서핑
17:30 석식
17:45 실내 도보
19:10 종료
21:20 인터넷 서핑
22:00 취침 
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2023.05.28(일) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 하루 종일 비

- 주말2[★]
07:08 기상
07:15 조식
06:30 실내 보도
07:51 종료
08:20 인터넷 서핑
11:30 중식
11:45 실내 보도
13:04 종료
13:20 인터네 서핑  ==> 2022년 귀속 종합소득세 신고 결과(23.05).xls 파일 작성
17:30 석식
18:50 수종 귀가  
19:35 종료
20:15 청소(청소기, 밀대)
21:00 샤워(찬물: 체중: 70kg ==> BMI: 24.22[과 체중])
22:30 취침
==============================================================================================================

- 쿠쿠 트윈 프레셔 마스터셰프 CRP-LHTR0610FW(IH 압력 밥솥) 사용 설명서 
https://manuall.kr/cuckoo-crp-lhtr0610fw-pressure-cooker/
1. 예약 취사 설정 @@@
1. 예약(왼쪽 메뉴): 클릭 ==> 예약 시각 설정: 메뉴/선택으로 시각 조정 ==> 확인
-------------------------------------------------------------------------------------------------------------

2. 현재 시각 설정 @@@
1. 설정 버튼 2회 누름 2. 선택 버튼으로 시, 분 변경, 3. 설정 버튼 누름
-------------------------------------------------------------------------------------------------------------

3/ 음성 볼륜 조절 @@@ 
1. 설정 버튼 3회 누름 2. 선택 버튼으로 숫자 변경, 3. 설정 버튼 누름 
==============================================================================================================
 
- 쿠쿠 전기밥솥 예약 취사 방법
https://www.youtube.com/watch?v=gy8vgu32mUs
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2023.05.29(월) 작업 ■■■■■■■■■■■■■■■■■■  
---> 07:00 ~ 17:30 ==> 대체공휴일(부처님 오신 날)

- 주말2[★]
06:15 기상
06:20 조식
06:30 실내 도보
07:30 종료
08:00 집 출발(자전거: 수종)
08:15 보라매 공원 도착
08:15 수종이랑 보라매 공원 운동장에서 야구(수종 투구, 타격)
08:45 종료
08:45 물통에 물 떠 옴(보라매 공원 놀이터)
08:55 귀가
09:00 집 출발(자전거: 수종) => 이마트 구로점 =>  디지털단지 오거리 교차로 => 현대아울렛 가산점
09:25 롯데 시네마 가산디지털 도착(가산디지털 2관)
09:26 빅트립2: 아기곰 배달 대작전(2D더빙, 만화 영화) 관람
10:50 종료
11:10 다이소 구로디지털 2호점 방문 ==> 페리오 뉴 후레쉬 알파 치약(190g), 5개, 5천원), 3M 세이프 그립 다목적 안전 장갑L(2천원)
		, 디자인 시트(23X100) 타일B(천원) 구입
11:22 GS25 신대방 노블점 방문 ==> 중식(수종: 혜자) 너비아니 도시락(4,900원): 2개, 오) 콘셀러드(2,500원), 총:11,470원) 구입
		==> 모바일 POP 5만원[현대카드[충전(GS 25 편의점)
11:55 귀가 
11:58 집 출발(도보): 도림천 => 신대방역 => 구디역 => 보라매 공원 입구 => 신대방역 => 구디역 => 신대방역
13:04 귀가 
13:14 빨래 
13:40 인터넷 서핑
15:36 집 출발(자전거) => 도림천 => 구로디지털단지역 옆길 => 구로교
15:52 헌혈의집 구로디지털 단지역센터 방문 ==> HGB: 11.4g/gL로 나와서 헌혈 못함(12g/gL 이상 전혈 가능)
		==> 혈색소 수치(HGB): 남성은 13g/dL, 여성은 12g/dL 이하인 경우 빈혈로 정의
16:20 진흥 마트 방문 ==> 돼지 왕 구이(1.6kg, 11,800원), 적 상추(950원), 동원 프리미엄 돈가스(5,850원), 총:18,600원) 구입
16:30 귀가
17:30 석식(수종): 버너에 돼지 왕 구이 구워 먹음(맛있음)
18:10 실내 도보
19:20 종료 
20:00 샤워(찬물)
20:30 인터넷 서핑
22:30 취침
==============================================================================================================

■■■■■■■■■■■■■ 2023.05.30(화) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==> 최성오 PL 병가

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
==============================================================================================================

- GROUP_CONCAT IN NETEZZA
https://everyething.com/group_concat-in-netezza

SELECT COL1, GROUP_CONCAT(COL2,',')  ==> 세로출력행을 가로로 합치기(cf. STRING_AGG)
FROM YOURTEST_GC 
GROUP BY COL1 
ORDER BY COL1
;
==============================================================================================================

- notepad++ compare plugin으로 코드 비교하기 
https://yuricoding.tistory.com/17
1.  compare플러그인 가져오기
 1) notepad++에서 '설정 - 가져오기 - 플러그인 가져오기'를 클릭하고 좀 전에 dll파일을 가져 옴
-----------------------------------------------------------------------------------------------------------

- Notepad++ Compare plugin
https://sourceforge.net/projects/npp-compare/
==============================================================================================================

- 남자의 빈혈은 암 때문일 수 있다 - 류영석 원장
https://www.youtube.com/watch?v=6efWJqypjgk
1. 남자 빈혈 원인: 소화기, 위나 대장에 암이 있을 때 발생
2. 빈혈의 원인
 1) 피가 잘 만들어 지지 않음, 	2) 재료(철분: 영양 부족)가 부족한 것
 3) 피의 유실 ==> 장 쪽에 암이 있는 경우
==> 위내시경, 대장 내시경 권유(건보 공담: 23년 대장 내시경 대상자)
----------------------------------------------------------------------------------------------------------

- 빈혈, 오해를 풀어드립니다!(상계백병원 혈액종양내과 유영진)
https://www.youtube.com/watch?v=OERJ4m__j9E&t=23s
==============================================================================================================
 
■■■■■■■■■■■■■ 2023.05.31(수) 작업 ■■■■■■■■■■■■■■■■■■  
---> 08:00 ~ 18:00 ==>  주간 보고서 작성(14:30): 이번주 18개 완료, 가계부 월말 결산(22시, 집)

- LG U+ CRM_PDA 현행화 Prj[★]
- DLK OB 작업 
==============================================================================================================

- 엑셀 SUBTOTAL 함수 사용법 및 실전예제 총정리 :: 수학 함수
https://www.oppadu.com/%EC%97%91%EC%85%80-subtotal-%ED%95%A8%EC%88%98/
1. SUBTOTAL 함수는 필터링 후 화면에 보이는 범위의 부분 합계를 계산하는 함수
 1) = SUBTOTAL ( 계산방식, 범위1, [범위2], .. )
 에) =SUBTOTAL(3, Z6:Z80)    	===> 계산방식: 3( COUNTA (값 개수): 필터링 된 범위 제외(숨겨진 셀은 포함))	■
 ==============================================================================================================

 - [Spring] @Scheduled 정해진 시간에 맞춰서 모듈 실행하기
 https://huskdoll.tistory.com/819
 
/**********************************************************************
스케쥴링 할 메소드위에 @scheduled 어노테이션을 입력한 후에 시간설정하면 끝
시간 설정 @scheduled(cron=" ")  * 리눅스 crontab 과 같은 설정방법
<예제>
   @Scheduled(cron="0 0 05 * * ?") = 매일 5시에 실행
   @Scheduled(cron="0 0 02 2,20 * ?") = 매월 2일,20일 새벽2시에 실행
***********************************************************************

 ---  cron 양식 ---
 -초 0-59 , - * / 
 -분 0-59 , - * / 
 -시 0-23 , - * / 
 -일 1-31 , - * ? / L W
 -월 1-12 or JAN-DEC , - * / 
 -요일 1-7 or SUN-SAT , - * ? / L # 
 -년(옵션) 1970-2099 , - * /
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //----------------------------------------------------------+ 
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■  
 