

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2014.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2014.06.01(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->

▦조기축구 
06:45 기상
07:00 국민은행 봉천동지점 앞(태훈이형 차)  
07:30 신구초등학교   
08:30 숏게임(2:0 승)
09:00 게임(9:7 승) ==> 40대, 50대 게임(수인이 형이랑 한세창형이랑 싸움)
       --> 조기회에서 수박 3통 쏨
10:40 종료
11:30 중식(설렁탕, 하늘 식당): 만원 냄
12:20 종료
13:20 귀가
15:00 낮잠
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.02(월) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 공차장에게 전화(6월 9일(월) 투입 예정이라고 함, 장모 금산 농장으로 다시 감(다오 인솔)
 
- 재충전
==============================================================================================================

- 땡처리 해외 항공권 추천 사이트 BEST 3
1. 웹투어 : (www.webtour.com) 
 2. 대명 투어몰 : (www.daemyungtourmall.com)
3. 땡처리닷컴 : (www.072.com)
==============================================================================================================

- 아시아나 오즈 드림페어(매주 화요일 9시 ~18시)
http://flyasiana.com/I/KO/ViewMainDreamFare.do
==============================================================================================================

- Apple ID(ipad: 아이패드)
tamario@naver.com/ssjtm3390A 

- 네이버(루옌)
1.  luyen94@naver.com / lul*3*90
----------------------------------------------------------------
- 네이버(루옌)
1.  https://www.naver.com  ==> luyen94@naver.com / lul*3*90
----------------------------------------------------------------
1. 구글(크롬[crome]): 루옌
https://www.google.com  ==> luyen9405@gmail.com / l*fndPs1*1*(러브*루*1*1*)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.03(화) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 비, 도서관 책 반납

- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.04(수) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 2014 전국동시지방선거(투표): 박원순 서울 시장 재선, 이마트 구로점 방문
 
- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.05(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 -->

- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.06(금) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 현충일
 
▦조기축구 
06:45 기상
07:00 국민은행 봉천동지점 앞(태훈이형 차)  
07:30 신구초등학교   
08:30 게임(2:0 승): 도곡 조기회
09:00 게임(2:2 므)
10:40 종료 
11:50 귀가
13:20 중식
15:00 낮잠
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.07(토) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 -->
 
- 한강 나들이 
13:20 중식
16:20 집출발
16:50 포마토 분식집(김밥 3줄, 주먹밥), 닭강정
17:00 서울대입구역
17:30 동작역
17:40 동작대교
18:00 김밥 먹음
18:40 한강 반포 지구(세빛 둥둥섬)
19:00 중식(컵라면, 아이스크림)
20:00 종료
21:00 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.08(일) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 -->
 
▦조기축구 
06:45 기상
07:00 국민은행 봉천동지점 앞(태훈이형 차)  
07:30 신구초등학교   
08:30 게임(2:3 패): 프렌즈 조기회
10:00 게임(1:0 승)
11:00 게임(4:1 패)
11:40 종료 
12:50 귀가
13:20 중식
15:00 낮잠
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.09(월) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 삼성 서비스센타(봉천점) 방문: 휴대폰 2대 A/S 요청(제리빈으로 업그레이드함)
 
- 재충전
==============================================================================================================

- 휴대폰 A/S 받음
1. 갤럭시 S3(루옌폰): 젤리빈으로 재 설치
2. 갤럭시 S2(공기계): 젤리빈으로 재 설치
==============================================================================================================

- 신사조기회 회비 납부(2014년) 
1. 2014.06.09(월) 송금: 진태만(1~6월): 12만원 ==> 납부 완료 
2. 신한은행 110.*2870, 예금주: 서정홍 
==============================================================================================================

- 나눔 회비 정산
1. 2014.06.09 기준 총 계비: 5,644,511원
==============================================================================================================

- 공차장에게 전화
1. 기상청 프로젝트 사실상 물 건너 갔다고 함 ==> 적극적으로 구직 알아 볼 것
==============================================================================================================

- 베가 R3 휴대폰 케이스 구입
1. 베가 R3 아리움 플립커버 케이스(베가 R3 IM-A850K용) A850 구입, 가격: 5,700원
2. http://www.interpark.com/product/MallDisplay.do?_method=detail&sc.shopNo=0000100000&sc.dispNo=016001&sc.prdNo=1951845213
3. 아리움 플립커버 케이스 갤럭시 S3용 ==> 검토
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.10(화) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- 만주 고모 TV 구입
1. LG전자 27MT55D(27인치), 가격: 272,000원: http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A571944839&frm3=V2
2. 주문번호: 18536 --> http://junicom.co.kr/bbs/login_jumun.php?url=/shop/mypage.html?incurl=mypage_orderlist.php
1) 농협 312-0115-2432-21 이장주, 송금액: 272,000원
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A883129103&frm3=V2
==============================================================================================================

- [아이코리아][모던체어]유아식탁의자: 11번가
http://buy.11st.co.kr/order/OrderList.tmall
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.11(수) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 --> 공차장 만남(가산디지털역, 18시): 식사 ==> 기상청 플젝 민원 파트 추천해준다고 함
 
- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.12(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 이마트 방문(12시: 5천원 할인권 사용)

- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.13(금) 작업 ■■■■■■■■■■■■■■■     
---> 06:30 ~ 18:00 --> 공차장 전화 ==> 기상청 플젝 민원 파트 불가능, 다른 플젝 찾아 준다고 함: 가능성 희박

- 재충전
==============================================================================================================

- 2014년 브라질 월드컵 개막
1. 개막전 ==> 6월 13일(금) 5시: 브라질(개최국) 3 VS 1 크로아티아
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.14(토) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 -->
 
▦조기축구
00:00 기상
04:00 브라질 월드컵 축구(스페인 1:5 네덜란드)
06:00 국민은행 봉천동지점 앞(태훈이형 차)
06:30 신구초등학교   
06:40 숏게임(2:3 패)
08:00 종료
09:00 귀가
09:30 낮잠
14:00 기상
14:20 중식
15:00 낮잠
19:00 석식
==============================================================================================================

- 경조비 송금(다오 통장으로 20만원 송금)
1. 송금 내역: 070_099875_01_014, 기 업 은 행, 예금주: 츠앙티따오, 20만원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.15(일) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 -->
 
▦조기축구
06:45 기상
07:00 국민은행 봉천동지점 앞(태훈이형 차)  
07:30 신구초등학교
08:30 게임(2:3 패)
09:00 게임(1:0 승)
10:00 게임(4:1 패)
10:40 종료 
11:30 중식(갈비탕, 문경새재): 조기회에서 냄(연합회장기 시합 출정식)
13:10 귀가
13:20 쇼핑(쌀국수, 람부탄, 드레스(선물)) ==> 루옌이 란 딸(예진) 생일 초대 받아 감
15:00 낮잠
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.16(월) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- PCA 프리미어 변액유니버셜보험 Ⅲ(예치식) 가입
1. 가입금: 4천 5백 만원
 1) SC 은행 통장잔액: 25,188,361원
 2) [국민은행] KB Smart폰 예금 만기 해약: 실수령액: 30,761,400원
2. 초회 가입비
 1) 최초 가입금: 4천 5백이면 1억 3천 5백까지 가입 가능
 2) 2억까지 무이자로 입금 가능
 3) 중도 인출시 수수료 없음(최소 100만원만 입금되어 있으면 해지가 안됨)
==============================================================================================================

- KB Smart폰 예금 만기 출금(인터넷 뱅킹) ==> 2013.06.16(월) @@@@@@
1. 계좌번호: 349415-2365569
2. 예금주: 진태만
 1) 원금: 30,000,000원, 실수령액: 30,765,581원
 2) 이자율: 연3.0%, 예치기간: 12개월, 만기일자: 2014/06/14
 URL: http://www.woorifgsb.com
==============================================================================================================

- 상환 결혼 축의금 송금
1. 결혼 축의금: 30만원
 1) 2013년 10월 나눔계비 자동이체가 안된 2만원 제외 ==> 총 28만원 송금
2. 송금 계좌: 신한은행 45913034957 홍상환
==============================================================================================================

- 진주 나눔모임(진주, 18시)
1. 일자: 2014년 06월 21(토) 18시
2. 장소: 진주시청소년수련관(진주시 남강로651번길 12) 앞
 1) 진주고속버스터미널(250, 262, 284, 296번 버스) -> 롯데시네마 -> 진주시청소년수련관
3. 참석: 태만, 현용, 상환, 태용, 일남, 광석(총 6명)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.17(화) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.18(수) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 브라질 월드컵 본선 한국 1: 1 러시아(7시)

- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.19(목) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================
 
- 면접(아리츠, 16시)
- [★_00] 면접(아리츠, 16시)  @@@@ - [★_51]
1. 면접 장소: SDS수원사업장 위드 커피숍(경기도 수원시 영통구 삼성로 172-3)
2. 서울대입구역 -> 낙성대동(9-3번) ->사당역(7000번) -> 신나무실APT -> SDS수원사업장 위드커피숍
---------------------------------------------------------------------------------------------------------

인터뷰 일시 : 06월 19일(목) 오후 4시
인터뷰 장소 : SDS수원사업장 위드커피숍(경기도 수원시 영통구 삼성로 172-3)
연락처 : 아리츠테크놀로지 이 은지 과장: 010-4788-7560
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.20(금) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.21(토) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 

▦조기축구
05:30 기상
05:40 국민은행 봉천동지점 앞(태훈이형 차)
06:10 신구초등학교  
06:20 숏게임(2:3 패)
08:00 종료
09:00 귀가
09:10 조식
11:00 중식
11:30 집출발
12:10 낙성대동(643번 버스)
12:40 강남터미널
13:00 서울 출발
16:45 진주 도착(비 조금 옴)
17:30 진주시청소년수련관(진주시 남강로651번길 12) 앞 도착
17:40 진주성 촉석루 구경
18:00 홍상환 도착
18:30 여관 예약(주차할 것): 호텔 POP 209호 ==> 방 1개(5인실: 7만원)
19:00 옛날장어(진주성 앞): 162,000원  ==> 호수, 현용, 태용, 일남 도착, 상환이 처 도착
21:00 햬안선(횟집): 108,000원
22:30 당구(꼴찌: 8천원)
23:30 종료
23:50 진주 고속터미널
24:00 진주 출발
==============================================================================================================

- 진주 나눔모임(진주, 18시)
1. 일자: 2014년 06월 21(토) 18시
2. 장소: 진주시청소년수련관(진주시 남강로651번길 12) 앞
 1) 진주고속버스터미널(250, 262, 284, 296번 버스) -> 롯데시네마 -> 진주시청소년수련관
3. 참석: 태만, 현용, 상환, 태용, 호수, 일남(총 6명)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.22(일) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 -->
 
▦조기축구
03:30 강남터미널 도착
03:50 택시(고속터미널 -> 낙성대역: 8,7000원)
04:00 취침
05:30 기상
05:40 국민은행 봉천동지점 앞(태훈이형 차)  
06:10 신구초등학교
06:30 수도공고 도착
06:40 몸풀기
07:30 게임(신사 0:4 개원 패) ==> 후보로 대기
08:30 종료
09:00 개막식(중동고)
09:30 종료
12:00 현대고 도착
12:30 게임(신사 9:0 도곡FC 승) ==> 후반에 교체됨(도곡이 9명이서 시합해서 참패 당함)
13:30 50대 게임(신사 1:4 도곡FC 패) 
13:30 50대 게임(신사 2:1 개원 승) ==> 4, 50대 모두 4강 탈락
17:00 종료
18:00 귀가
19:00 루옌, 친구(뚜엣)랑 같이 옴 ==> 고속터미널역에 옷 사러 갔다옴
20:00 중식(닭강정, 떡)
21:00 루옌하고 싸움 것 화해 함
23:00 취침
==============================================================================================================

- 나눔동기회 결산 ==> 2014.06.21(월)
옛날장어: 162,000원 
햬안선(횟집): 108,000원
여관비: 7만원 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.23(월) 작업 ■■■■■■■■■■■■■■■
--> 06:30 ~ 18:00 --> 첫 출근

- SMART TV App Mgt Prj1. 노트북 포맷하고 가서 고생함
==============================================================================================================

- SMART TV App Mgt Prj 첫 출근
06:00 기상
06:15 낙성대동(9-3번 버스)
06:40 사당역 도착
06:55 사당역(7000번 버스)
07:55 신나무 주공 APT 정류소
08:00 삼성전자 SDS 사업장 도착 ==> 출근 장소 잘못 암
08:30 삼성전자 정문 데스크 도착 ==> https://www.sdigitalcity.com 에서 회원 가입 하라고 함 
==> 기존 회원 가입 되어 있어서 아이디, 비밀번호 찾기해서 김태혁 책임에서 문자로 보냄 
10:00 김태혁 책임이 방문 신청 해줌 ==> 노트북 반출증 작성하고 가지고 들어옴
10:30 DMC 별관 도착(남문, 야구장 옆 건물) ==> OTS 정책임과 인사
10:40 노트북 포맷하고 와서 OS 빌려서 재 설치 ==> 절대 OS 포맷하지 말것(반출할 때 규정이 엄격함)
 ==> MSI 노트북 네트워크 드라이버 안 잡혀서 고생함
11:30 중식(구내식당: 5,900원)
17:50 퇴근
20:00 귀가
20:10 석식
22:00 취침
==============================================================================================================

- 경조비 송금(다오 통장으로 21만원 송금)
1. 송금 내역: 070_099875_01_014, 기 업 은 행, 예금주: 츠앙티따오, 10만원
2. 작은 처남 용돈(통장에서 차감할 것)
==============================================================================================================

- 장모님 선불폰 충전[2014.06.23(월)] ==> ☎ 010-2649-1964 
1. 요금제: KTF 충전카드(월 만원차감 예상)
==> http://freephonephone.co.kr/front/php/product.php?product_no=92&main_cate_no=33&display_group=1 
입금자명: 진태만, 선불폰번호: 010-2649-1964(장모님), 충전카드 종류: KTF 충전카드 20,000원
==> 010-8071-3990로 문자 보낼 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.24(화) 작업 ■■■■■■■■■■■■■■■ 
--> 08:30 ~ 18:00 --> 

- SMART TV App Mgt Prj
1. MSI 노트북 유틸리티 CD 가지고 와서 네트워크 드라이버 해결함
==============================================================================================================

- svn 계정 생성
svn://165.**/SAPPHIRE
svn://165.**/SE_DEV
id : Element-tamario2jin
pw : *
==============================================================================================================

- IP 정보
IPv4 주소 . . . . . . . . . : 10.*.*,*(임시)
서브넷 마스크 . . . . . . . : *.*.*.0
기본 게이트웨이 . . . . . . : *.*.*.1
DNS: *
---------------------------------------------------------------------------------------------------------

- 자료실
\\165.213.225.172, ==> esdm/*
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.25(수) 작업 ■■■■■■■■■■■■■■■ 
--> 08:30 ~ 18:00 --> 생일(루옌이 생일 잔치, 선물(슬리퍼) 줌, 고영범 차장(☎010-2252-4655) 투입

- SMART TV App Mgt Prj
1. App Info 수정
==============================================================================================================

- 전자 보안 프로그램 설치 후 에러 발생
1) 현상: "(IE8000) 화면 보호기가 설정되어 있지 않아 재설정했습니다."라고 하면 2초 단위로 알람 뜸
2) 원인: 윈7 설치시 스크린 세이버 파일(.scr)이 설치 안됨.
3) 조치: 데스크 직원이 자기 피시에서 파일(.scr) 찾아서 C:\Windows\System32 폴더에 붙여넣기함. 
--> Bubbles.scr, Mystify.scr 파일이 생김
==> SDS 이나경 선임 이 임시로 받은 IP와 ID(nakyung1.lee)로 escort 등록 --> NASCA는 정현태(ht777.jung) 걸로 등록
==> 인터넷 가능, eclipse 셋팅 후 SVN으로 데이타 받아옴(DB ID 승인이 안나서 완전하지 않음)
==============================================================================================================

- 삼성전자 헬프데스크
1 escort 조치(☎ 031-**) ==> 2 ==> escort 상담원
 1) 원격지원 --> escort 프로그램 삭제 해줌 --> 재시작 ==> 화면 보호기가 문제 없어짐(escort 프로그램 다시 설치하면
    화면 보호기가 문제 다시 발생함
2. 삼성전자 Help Desk(☎ **) ==> 전자(1) ==> PC 도움방(1) ==> 화면 보호기가 문제 해결해줌
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.26(목) 작업 ■■■■■■■■■■■■■■■
--> 08:00 ~ 18:00 --> OTS 나윤호 책임(인수자) 철수(16시)

- SMART TV App Mgt Prj
1. App Info 상세화면 json 방식으로 바꾸기
/appmgmt_detail.jsp 파일에서 @@@
<script type="text/javascript"> 
$(document).ready(function() { 
	$.ajax({
	url: "/${pageInfo.site.sysId}/app/registration/detail/info/data.json",
	    type: 'POST',
	    data: {
		    appId: $("#appId").val(),
		    appVerSeqNo: $("#appVerSeqNo").val()
	    },
	    dataType: "json", 
	    success: function (response) {
		appInfoProc(response.resultMap);//appInfoProc() 함수 호출
	    },
	    error: function () {
		alert("error");
	    }
	});  
});
----------------------------------------------------------------------------------

function appInfoProc(response)
{
	$("#spAppId").text(appDetailInfo.APPID);
}

${requestScope['appInfo'].APP_ID}
 ==> 
==============================================================================================================

- 에버 노트 설치(http://evernote.com/intl/ko/download)
1) https://www.evernote.com/Login.action ==> taemario@gmail.com/l*fndPs1*1*(러브*루*1*1*)
==============================================================================================================

- debug 걸기 ==> 로그 찍기(log)
logger.debug("[AppManagementController.java][appDetailForm()] ==> [appVerSeqNo]"+ appVerSeqNo );
log.debug("[verifyTNCRequest()] ==> [사용자의 최근 약관 동의 여부] [isAcceptedPrivacy]"+ isAcceptedPrivacy);  
System.out.println("[AppManagementController.java][appDetailForm()]==> [test]"); 
System.out.println("[AppManagementController.java][appDetailForm()]==> [mdlGrpId]"+ mdlGrpId); 
------------------------------------------------------------------------------------------------------
   
out.println("[/spceExpertAdminHome.jsp] [test] 
");     ===> jsp에서 
out.println("[/spceExptMainDtlR.jsp] [forumId]"+ request.getParameter("forumId") +"[blbdClasNm]"+ request.getParameter("blbdClasNm") +"
");  
==============================================================================================================

- 기타 정보
1. 사파이어 login : http://localhost:8080/member/backdoor  ==> yoonho35.na/*
2. 앱인포 상세 : http://localhost:8080/Sapphire/app/registration/detail/view/KFDRHVLRITNCNPTS/1
==> http://localhost:8080/Sapphire/app/registration/detail/view/KFDRHVLRITNCNPTS/1/001
3. 사내버스 : http://samsung.u-vis.com/sec/index.html
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.27(금) 작업 ■■■■■■■■■■■■■■■
--> 07:50 ~ 18:00 --> 

- SMART TV App Mgt Prj
1. App Info 상세화면 json 방식으로 바꾸기
==============================================================================================================

# DIAMOND DB(DB 설정)
webapp.driverClassName=net.sf.log4jdbc.DriverSpy
webapp.url=jdbc:log4jdbc:oracle:thin:@*:DIAMOND
webapp.username=*
webapp.password=*
==============================================================================================================

 - 사파이어 실행
1. http://localhost:8080/Sapphire/member/backdoor ==> yoonho35.na/*
2. http://localhost:8080/member/backdoor  ==> yoonho35.na/*

- AppInfo 상세 조회
1. http://localhost:8080/Sapphire/app/registration/detail/view/KFDRHVLRITNCNPTS/1
2. http://localhost:8080/Sapphire/app/registration/detail/view/KFDRHVLRITNCNPTS/1/001
==============================================================================================================

- 개발 서버
http://207.36.93.29/Sapphire/backdoor
http://207.36.93.29/Sapphire/portal/main
==============================================================================================================

- my single(임시) 
http://www.samsung.net/portalWeb/ep/portal/login/LogoutSuccess.jsp --> 
==============================================================================================================

- 빌드 시작 에러(처음 설정시)
/com.samsung.element/src/main/resources/query/element/skeleton-query.xml
/com.samsung.element.filemanager/src/main/resources/query/element/skeleton-query.xml 파일 수정
<update id="updateEntity">
parameterType="com.samsung.element.common.generator.skeleton.entity.SkeletonEntity">]
==> <update id="updateEntity">
parameterType="com.samsung.element.generator.skeleton.entity.SkeletonEntity">]로 변경

/com.samsung.element/src/main/resources/query/element/userfile-query.xml
/com.samsung.element.filemanager/src/main/resources/query/element/userfile-query.xml  파일 수정
<update id="updateEntity">
parameterType="com.samsung.element.common.generator.skeleton.entity.SkeletonEntity">]
==> <update id="updateEntity">
parameterType="com.samsung.element.generator.skeleton.entity.SkeletonEntity">]로 변경
==============================================================================================================

- 출퇴근 정보(지하철)
1. 서울대입구역(5-2) -> 선릉역 -> 선릉역(분당선) -> 매탄권선역
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.28(토) 작업 ■■■■■■■■■■■■■■■
--> 06:30 ~ 18:00 -->

주말
09:30 기상
09:50 조식(라면)
11:00 낮잠
17:00 기상
17:20 집출발
17:40 석식(돌솥, 철판볶음밥, 김밥): 포마토
18:00 서울대입구역
18:40 잠실역(롯데월드: 3번 출구)
18:55 롯데월드(AFTER4-자유이용권, 2장[22,000원]): 7시 이후 할인(6월 이벤트)
19:00 브라질 삼바 축제(롯데월드)
19:20 3D 슈팅 게임
20:00 4D 슈팅 게임
21:00 공연 관람
21:20 풍선 타기
22:30 종료
23:30 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.29(일) 작업 ■■■■■■■■■■■■■■■
--> 06:30 ~ 18:00 -->

▦조기축구 
06:15 기상
06:30 국민은행 봉천동지점 앞(태훈이형 차) 
07:00 신구초등학교 
07:30 숏게임(2:3 패)
08:30 게임(1:0 승) ==> 강남구 연합회 감사패 받음
09:00 게임(6:4 승)
10:20 종료(수박 먹음)
10:30 문경새재(종업원이 불친절하다고 싸우고 나옴)
10:50 류명국 해장국(부대찌게)
11:50 종료
12:50 귀가 
13:00 낮잠
16:00 기상
17:00 쇼핑(봉천역 근처: 수박, 바나나, 참외, 죽부인 구입)
19:00 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.06.30(월) 작업 ■■■■■■■■■■■■■■■
--> 07:50 ~ 18:00 --> 

- SMART TV App Mgt Prj1. App Info 상세화면 목업 작업
http://localhost:8080/Sapphire/app/registration/detail/view/1404070000001/14001/10TV
@RequestMapping(value = "/{siteId}/app/registration/detail/view/{appId}/{appVerSeqNo}/{mdlGrpId}", method = RequestMethod.GET)
==> /front/application/appmgmt/appmgmt_detail
-------------------------------------------------------------------------------------------------------

http://localhost:8080/Sapphire/app/registration/list
@RequestMapping(value = "/{siteId}/app/registration/list", method = RequestMethod.GET)
==> /front/application/appmgmt/appmgmt_list 

http://localhost:8080/Sapphire/app/registration/m_app_version_info
@RequestMapping(value = "/{siteId}/app/registration/m_app_version_info", method = RequestMethod.GET)
==> /front/application/appmgmt/modal_app_version_info
==============================================================================================================
 
--SELECT CODE_NAME_ENG
SELECT *
-- INTO v_CODE_NAME
FROM TN_CF_SYS_CODE    --> 공통 테이블 수
WHERE 1=1
    --AND CODE_ID = 'AP.RATE.4'
    -- AND IS_DELETE = 0
;  
-----------------------------------------------------------------

-- 01. AP.AGE.0: ALL-->  존재
-- 02. AP.RATE.12: 12+   --> 추가
-- 03. AP.RATE.18: 18+   --> 추가
==============================================================================================================

- build.xml 파일에서 에러(Run as > Ant Build)
[javac] D:\sapphire\workspace\com.samsung.sapphire\src\main\java\com\samsung\sapphire\ui\admin
\app\cnstv\controller\CnsTvAppsController.java:20: 
error: package com.samsung.element.common.util does not exist

/CnsTvAppsController.java 파일에서
//import com.samsung.element.common.util.CommonUtil;   //에러 남
==> import com.samsung.element.util.CommonUtil;   // .common을 빼는 것으로 변경해야 함

1. 원인: 공통 함수에서 에러
2. 조치: 공통 함수 모두 Update 받고 Clean Up((Run as > Ant Build)
==============================================================================================================

- 빌드 에러
org.springframework.beans.factory.BeanCreationException: Error creating bean with name 'mySingleApprovalTask': Injection of autowired dependencies failed; 
nested exception is org.springframework.beans.factory.BeanCreationException: Could not autowire field: private com.samsung.element.manager.system.service.ApprovalService 
com.samsung.element.engines.mysingle.task.MySingleApprovalTask.approvalService; nested exception is org.springframework.beans.factory.BeanCreationException: 
Error creating bean with name 'ElementApprovalServiceImpl': Injection of autowired dependencies failed; nested exception is org.springframework.beans.factory.BeanCreationException: 
Could not autowire field: private com.samsung.element.engines.file.service.AttachFileService com.samsung.element.manager.system.service.impl.ApprovalServiceImpl.fileService; 
nested exception is org.springframework.beans.factory.BeanCreationException: Error creating bean with name 'ElementAttachFileServiceImpl': Injection of autowired dependencies failed; 
nested exception is org.springframework.beans.factory.BeanCreationException: Could not autowire field: private com.samsung.element.engines.file.dao.AttachFileDao 
com.samsung.element.engines.file.service.impl.AttachFileServiceImpl.attachFileDao; nested exception is org.springframework.beans.factory.BeanCreationException: 
Error creating bean with name 'ElementAttachFileDao': Injection of autowired dependencies failed; nested exception is org.springframework.beans.factory.BeanCreationException:
Could not autowire method: public final void org.mybatis.spring.support.SqlSessionDaoSupport.setSqlSessionFactory(org.apache.ibatis.session.SqlSessionFactory); 
nested exception is org.springframework.beans.factory.BeanCreationException: Error creating bean with name 'sqlSessionFactory' defined in file 
[D:\sapphire\webapp\WEB-INF\classes\spring\context-common.xml]: Invocation of init method failed; nested exception is org.springframework.core.NestedIOException: 
Failed to parse mapping resource: 'file [D:\sapphire\webapp\WEB-INF\classes\query\calendar\Calendar-Event-query.xml]'; nested exception is java.lang.RuntimeException: Error parsing Mapper XML. 
Cause: org.apache.ibatis.builder.BuilderException: Error resolving class. Cause: org.apache.ibatis.type.TypeException: Could not resolve type alias 'com.samsung.element.calendar.entity.EventVo'.  
Cause: java.lang.ClassNotFoundException: Cannot find class: com.samsung.element.calendar.entity.EventVo
at org.springframework.beans.factory.annotation.AutowiredAnnotationBeanPostProcessor.postProcessPropertyValues(AutowiredAnnotationBeanPostProce
ssor.java:289)
---------------------------------------------------------------------------------------------------------

1. 현상: mySingleApprovalTask 에러 뜨고 /Calendar-Event-query.xml 파일에서 ==> EventVo 파일 인식 못함
 2. 조치: D:\sapphire\webapp 폴더 삭제 후 다시 받고 Clean Up((Run as > Ant Build)
==============================================================================================================

- eclipse debug 단축키
http://blog.naver.com/musasin84/60189868045
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■