

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2014.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2014.01.01(수) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

▦조기축구   
07:00 기상   
07:25 국민은행 봉천동지점 앞(태훈이형 차)   
07:45 신구초등학교   
08:00 숏게임(1:1 무)   
09:30 게임(2:1 패)  
08:00 숏게임(3:2 승) 
11:00 종료   
11:30 중식(국밥, 뚝심한우식당): 회장님이 쏨 
12:30 종료  
12:50 귀가   
14:00 응아 부부 방문(옷 한벌 사옴) 
15:00 영화 친구2 다운로드 받음(만 천원 결제): 파일조 
17:00 석식(베트남 쌀국수) 
18:30 종료 
21:30 가계부 월말 결산(2013년 12월) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.02(목) 작업 ■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00   

- 개인 정비 
08:00 기상   
08:20 조식(떡) 
10:00 연세에이플러스 치과 방문(목요일 14시 30분에 오픈): 돌아옴DW 
10:30 귀가 
11:00 마트(루옌, 장인): 보온병, 음식 
11:30 잠바 구입 시도(장인 잠바 구입 안 함) 
12:00 귀가 
12:10 중식 
14:30 신경치료3(윗니2개, 연세에이플러스): 의사가 기존 오른쪽 윗니2개 띁어 낸다고 고생함  
15:20 귀가 
15:30 장인어른 인솔(봉천 새문B => 봉원중(641번, 650번, 5517번) => 노량진역(6-4) => 동두천역(2번출구) 
17:40 동두천역 => 노량진역(641번, 650번, 5517번) => 봉원중 => 봉천 새문B 
20:00 귀가 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.03(금) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- 개인 정비 
09:00 기상   
08:20 조식(떡) 
10:10 연세에이플러스 치과 방문 
10:30 신경치료4(윗니2개, 연세에이플러스) 
11:00 귀가 
11:30 중식 
14:30 집출발 
15:00 이마트 구로점 방문 
15:30 WK2011B 전기포트 구입, DU 남성 셔츠 NY 90(루옌)으로 바꿈 
16:00 이마트 출발(걸어서 옴) -> 신대방역 -> 보래매공원 -> 롯데백화점 
17:00 롯데백화점 방문 
17:20 석식(돌솥비빕밥, 철판볶음밥, 루옌): 롯데백화점 지하 2층 
18:30 귀가 
19:00 간식(떡, 만두) 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.04(토) 작업 ■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00   

- 개인 정비 
09:00 기상   
08:20 조식(떡) 
09:45 연세에이플러스 치과 방문 
10:10 신경치료5(윗니2개, 연세에이플러스): 신경치료 종료 
10:50 귀가 
11:30 중식 
13:30 마트 방문  
14:00 프엉 부부 방문(옷 선물) 
14:10 영화 관람(관상): 집에서 
15:10 종료 
15:50 프엉 부부 귀가 
18:30 석식 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.05(일) 작업 ■■■■■■■■■■■■■■■   
---> 09:00 ~ 18:00   

▦조기축구   
07:00 기상   
07:25 국민은행 봉천동지점 앞(태훈이형 차): 김영배 고문, 구창원형 같이 탐 
07:45 신구초등학교  
08:00 숏게임(2:1 승)   
09:30 게임(7:2 승): 2014년 임원진 발표(총무: 권영석 형) 
11:00 종료   
11:30 중식(국밥, 뚝심한우식당): 회비 만원 냄 
12:30 종료  
12:50 귀가   
13:00 집출발 => 봉원중(501번) => 숭실대입구역(7-3) => 수락산역(3번 출구) => 72-1번 버스 => 홈플러스(하차)  
14:50 플로렌스 파티하우스 의정부점(의정부시 금오동 473-4) 플래티넘 프라자 2호 7층 도착 
15:00 허우씨 부부 만남(이해든 돌잔치) ==> 부주 10만원 허우씨에게 줌 
15:10 식사 
15:30 현용한테 대우증권 프로젝트 제의 받음(월 5백만원) 
16:20 이해든 돌잔치 행사 
17:10 종료 
17:20 의정부 북부청사역(의정부경전철) 
17:35 1호선 회룡역 
18:45 신도림역 
19:25 서울대입구역 
19:45 귀가 
01:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.06(월) 작업 ■■■■■■■■■■■■■■■
---> 13:00 ~ 18:00  --> 프로젝트 투입 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- 프로젝트 투입 
09:00 기상   
09:`0 조식(떡) 
09:45 베버리힐스 희망치과 방문 
10:10 오른쪽 윗니 2개 덮어 씌우기(도자기: 60만원(10만원 할인 받음)) 
11:50 종료 
12:10 중식 
12:30 집출발 
13:00 KDB 대우증권 연수원 도착(경기도 과천시 관문로 90) 
13:10 현용 만남 
13:20 PM, PL 개발자 인사 
15:50 개발 회의(SNS 업무 할당) 
16:00 개발 환경 설정(eclipse, db) 
18:50 종료 
19:50 귀가 
20:00 석식 
23:50 취침 
==============================================================================================================

- 치과 치료 
1. 오른쪽 윗니 2개 덮어 씌우기(도자기: 60만원(10만원 할인 받음)): 베버리힐스 희망치과 ==> 본 뜨기 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.07(화) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 23:30 --> 회식(개발팀, 영업대표): 1시 종료, 택시(현용이 냄) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- SNS 소스 분석 
-------------------------------------------------------------------------------------------------------- 

- Proj 인력 
PM 김용설 부장 
PL 조의현 차장 
김윤진 차장(대우증권) - 업무 PL 
노진석 대리(대우증권) - SNS 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.08(수) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 22:00 --> 출근 안함(PM 자리에서 Chart 개발자가 작업해서 못함) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- SNS 소스 분석(집에서 서핑) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.09(목) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 02:00 --> 택시비(9,240원) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- SNS 개발 
1. SNS Station: http://210.92.6.77/hmpg/custSvc/sns/sns-twitter.do?noti_seq=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.10(금) 작업 ■■■■■■■■■■■■■■■ 
---> 08:30 ~ 17:10 --> 치과 치료(18시, 희망치과): 덮어 쓰우기(도자기): 60만원(2개) ==> 모두 종료 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- SNS 개발 
1. SNS Station: http://210.92.6.77/hmpg/custSvc/sns/sns-twitter.do?noti_seq=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.11(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 휴무 

- 개인 정비 
09:00 기상   
09:10 조식(떡) 
12:00 중식 
13:30 휴식 
17:20 마트(온누리상품권 사용 가능) 
17:50 귀가 
18:50 석식 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.12(일) 작업 ■■■■■■■■■■■■■■■
---> 11:20 ~ 22:00   

▦조기축구   
07:00 기상   
07:25 국민은행 봉천동지점 앞(태훈이형 차)   
07:45 신구초등학교  ==> 회원 모집 현수막 달기(2개), 월례회의 
08:00 숏게임(1:1 무)   
08:30 게임(9:8 승): 호균이형에게 정강이 차여서 아팠음 
11:00 종료  
11:30 대우증권(과천) 도착(정홍이 차) 
13:00 중식(분식): 회사에서 쏨  
13:30 SNS 개발 수정  
20:00 석식(햄버거): 회사에서 쏨  
22:00 종료 
22:40 귀가 
23:50 취침 
==============================================================================================================

- Quote SNS 개발 
1. Quote: http://210.92.6.77/hmpg/quote/quoteMain.do 
2. Quote Comparison: http://210.92.6.77/hmpg/quote/quoteCmprn.do 
-------------------------------------------------------------------------------------------------------- 

- SNS 글 등록(한겨레 신문) 
http://www.hani.co.kr/arti/international/international_general/619255.html?_fr=mt1  
==============================================================================================================

- 소셜댓글 라이브리(LiveRe): http://www.livere.com 
http://www.livere.com/intro/test_livere_basic.jsp  ==>1.  contact@cizion.com 혹은 02-333-1710  
http://blog.naver.com/bridgeperson?Redirect=Log&logNo=50186424771 
http://blog.naver.com/lolsh0793?Redirect=Log&logNo=80204125613 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.13(월) 작업 ■■■■■■■■■■■■■■■
---> 08:35 ~ 19:30 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- FACEBOOK Graph api 사용하기 
http://dhrod0325.blog.me/140161451059 
https://developers.facebook.com/docs/graph-api/using-graph-api/#fieldexpansion 
https://developers.facebook.com/tools/explorer/?method=GET&path=1242880231%3Ffields%3Did%2Cname  
-------------------------------------------------------------------------------------------------------- 

- Graph API Explorer 
https://developers.facebook.com/tools/explorer/?method=GET&path=1242880231%3Ffields%3Did%2Cname 
http://www.facebook.com/페이지ID  
  
1. [main] -> App ID: 1242880231 --> https://www.facebook.com/kdbdwsecindo 
https://graph.facebook.com/1242880231/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 // 원본(1242880231) 
https://graph.facebook.com/kdbdwsecindo/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8   

2. KDB Daewoo Securities Indonesia  --> App ID: 620635977981901 --> https://www.facebook.com/kdbdwsecindonesia 
https://graph.facebook.com/620635977981901/feed?access_token=CAACEdEose0cBAHVYIR8cjdfNCGnsmRARucsfwVLllzGLx
DKccDk6P3WMEWqQeisfIj2vkKRFp9xLzd21KuUb4CgHeGAwAVQ0GFFuUc9f3AS3p3mC320PZC3oCRGNhZC6tGgZBDh
PNsBZCpPQoNZBaunelX4ZAxI0A0RdZAkN8XbghMA8KyifcA8I3vete9rghsZD 
==> The session is invalid because the user logged out. 
https://graph.facebook.com/kdbdwsecindonesia/feed?access_token=CAACEdEose0cBAICJ6h7EIBeWogZAbXCuy4
WxWkFSwXqQTAWx4251nmmQw1ZCt0tkSgln3Kr7GjFZAoTLO6KSuYe7qIz1b2ZBWxP3anCbXOUw377ks06DzH7LgIgY
xyLuINwG5EzuM0XZBZCxfm5F4vYHJIWAPZBuGBEA0kqi1EYwINFaHITLjcOwPHZBCii0gcIZD 

https://graph.facebook.com/620635977981901/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 

https://graph.facebook.com/620635977981901/feed?access_token=1453842791503308Cvt-kDYZs9Ys7pVLm6VocqLqe40 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.14(화) 작업 ■■■■■■■■■■■■■■  
---> 08:25 ~ 18:00 --> 심성구 대리 투입, 중식(jtree 이사님이 Prj 팀원들에게 사줌), 회식(고기집, 화난 치킨) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj 
- SNS 개발 
- App 등록(https://developers.facebook.com/x/apps/186095240962/settings/basic/)  
0. Daewoo Securiites[main](User ID: 1242880231) 
General Account Settings ==> https://www.facebook.com/settings -> https://www.facebook.com/kdbdwsecindo  

0. eTrading HD(App ID: 381109098660976, App Secret: **** , User ID: 1242880231) 
https://graph.facebook.com/1242880231/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 
https://graph.facebook.com/kdbdwsecindo/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 

1. KDB Daewoo Securities Indonesia(App ID: 1453842791503308, App Secret: 1234 , User ID: 1242880231) 
--> https://www.facebook.com/kdbdwsecindonesia --> 831 likes[리얼] 
==> Access Token 받아 오기 -> 1453842791503308Cvt-kDYZs9Ys7pVLm6VocqLqe40 
https://graph.facebook.com/620635977981901/feed?access_token=1453842791503308Cvt-kDYZs9Ys7pVLm6VocqLqe40 ==> NO 
https://graph.facebook.com/kdbdwsecindonesia/feed?access_token=1453842791503308Cvt-kDYZs9Ys7pVLm6VocqLqe40 ==> NO 

https://graph.facebook.com/kdbdwsecindonesia/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 ==> NO 

https://graph.facebook.com/1242880231/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 ==> OK 
==============================================================================================================

- [우리은행] 저축예금(우리직장인재테크통장) 가입 ==> 2014.01.14(화) @@@@@@
1. 계좌번호: 1002-650-302844(1002650302844), 예금주: 진태만
2. 기타: 과천역지점((주)jtree 급여 통장)  ==> tamario/ l*fndPs1*1*(러브*루*1*1*)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.15(수) 작업 ■■■■■■■■■■■■■■■
---> 08:05 ~ 16:00 --> 중식(돈가스: 회식 때 게임 내기한 돈으로 먹음), Chart 개발자 와서 일찍 퇴근 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- SNS 개발 
1. SNS Station: http://210.92.6.77/hmpg/custSvc/sns/sns-twitter.do?noti_seq=1 
http://210.92.6.77/hmpg/main/main.do 
http://210.92.6.77/hmpg/quote/quoteMain.do 
==============================================================================================================

- Space for Export 개발 관련 회의 
1. 심성구 대리 외 투입될 1명 개발 참여 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.16(목) 작업 ■■■■■■■■■■■■■■■ 
---> 08:05 ~ 24:00 --> 조성우 대리 투입, Proj 이행(택시 타고 감: 4,650원) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- SNS 개발 
1. Page 설정된 kdbdwsecindonesia가 access_token 안 맞아서 고생함(해결 안됨) 
KDB Daewoo Securities Indonesia(App ID: 1453842791503308, App Secret: 1234 , User ID: 1242880231)  
--> https://www.facebook.com/kdbdwsecindonesia --> 831 likes[리얼] 
==> Access Token 받아 오기 -> 1453842791503308Cvt-kDYZs9Ys7pVLm6VocqLqe40 
==============================================================================================================

- DW 메신저 
1. s0140003 / DAEWOO 
==============================================================================================================

- Erwin 7.2 설치 
1. PJ3VL QCFGP DVGNU GHPKD EV4DA 
2. computerAssociates 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.17(금) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 21:00 --> 출입 카드(번호:2195) 나옴 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export DB 설계 
==============================================================================================================

- kdbdwsecindonesia page 설정 에러(조성우 대리가 해결함) 
1. 현상: https://www.facebook.com/kdbdwsecindonesia  page 에러남 
https://graph.facebook.com/kdbdwsecindonesia/feed?access_token=381109098660976LQTtY8QZRVfhdJ7usqAj9tVxZI8 
2. 해결책: https://www.facebook.com/kdbdwsecindonesia2 page 설정 
https://graph.facebook.com/kdbdwsecindonesia2/posts?access_token=13913335877916583wH5shT2XbiMEMEdb-Q5S-iJ4eo 
3. 결과: /kdbdwsecindonesia를 kdbdwsecindonesia2로 바꾸라고 해야 함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.18(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 17:00 --> 토요 근무 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export DB 설계 
==============================================================================================================

# 컨텐츠 분류 코드(CTNS_CLAS_CD)   
- 2자리 : 시스템 구분(01: 홈페이지, 02: 관리자 페이지) 
- 3자리 : 게시판 구분(001: 뉴스, 002: , 004:포럼 , 005:관리자)  
  
# 카테고리 ID(CATEGORY_ID)  ==> 잘못 됨 ==> 실직적인 게시판명 
- 2자리 : 시스템 구분(01: 홈페이지, 02: 관리자 페이지) 
- 3자리 : 게시판 구분(001: 뉴스, 002: , 004:포럼 , 005:관리자)  
# 카테고리 ID(CATEGORY_ID)  ==> 00001(10개 자동 소트)  
==============================================================================================================

- 새문빌라 모임(17시) 
17:00 퇴근 
17:40 오거리 닭 한마리 식당(회비 인당 만 2천원) 
      501호, 201호 네팔 부부, 302호 아줌마(딸 20113년 4월에 출산) 
      ==> 총무 201호로 넘기기로 함 
19:00 종료 
19:10 귀가 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.19(일) 작업 ■■■■■■■■■■■■■■■ \
---> 11:20 ~ 22:00   

▦조기축구   
07:00 기상   
07:25 국민은행 봉천동지점 앞(태훈이형 차) ==> 태훈형 어제 야근해서 피곤하다고 함 
07:45 신구초등학교 
08:00 숏게임(2:0 패)   
08:30 게임(7:2 패): 박준석 회원(한의사) 다시 서울로 옴 
11:00 종료  
11:30 버스: 태훈형 회사로 감 
12:20 분식집(주먹밥 3개) 
12:40 귀가 
12:50 중식(라면, 주먹밥) 
14:00 낮잠 
16:00 기상 
16:30 장보기(온누리상품권) 
18:00 석식 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.20(월) 작업 ■■■■■■■■■■■■■■■ 
---> 08:00 ~ 23:00 --> 눈(5cm) 내림, 대우증권 ID proj 1차 오픈(완료), 맥주 회식(김윤진 차장, 개발팀, 01시까지) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert 리스트(/spceExptListR.jsp) 개발 
/kdbdw/src/main/webapp/WEB-INF/jsp/hmpg/stkCm/spceExpt/spceExptListR.jsp  
/kdbdw/src/main/webapp/WEB-INF/jsp/hmpg/stkCm/spceExpt/spceExptMain.jsp 
==============================================================================================================

- 컨텐츠 URL DB 설정 
1. /hmpg/stkCm/spceExpt/spceExptListR.do 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.21(화) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:30 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert 리스트(/spceExptListR.jsp) 개발 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.22(수) 작업 ■■■■■■■■■■■■■■■
---> 07:50 ~ 22:00 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert 리스트(/spceExptListR.jsp) 개발 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.23(목) 작업 ■■■■■■■■■■■■■■■
---> 07:50 ~ 22:00 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert 메인(/spceExptMain.jsp) 개발  ==> 완료 @@@ 
==> /hmpg/stkCm/spceExpt/spceExptMain.do 

3. Space for Expert Profile(/spceExptMainProf.jsp) 개발  ==>   
==> /hmpg/stkCm/spceExpt/spceExptMainProf.do 

4. Space for Expert Information(/spceExptMainInfo.jsp) 개발   ==>   
==> /hmpg/stkCm/spceExpt/spceExptMainInfo.do 

5. Space for Expert Profile Mgmt(/spceExptMainProfMgmt.jsp) 개발   ==>  
==> /hmpg/stkCm/spceExpt/spceExptMainProfMgmt.do 

6. Space for Expert Profile Mgmt(/spceExptMainlDtlR.jsp) 개발   ==>   
==> /hmpg/stkCm/spceExpt/spceExptMainlDtlR.do 
==============================================================================================================

- eclipse 시작 에러 
원인: Chakra Max Client(DB) Start 안한 것으로 추정됨 
2014. 1. 23 오전 11:32:35 org.apache.catalina.core.StandardContext listenerStart 
심각: Exception sending context initialized event to listener instance of class org.springframework.web.context.ContextLoaderListener 
org.springframework.beans.factory.BeanCreationException: Error creating bean with name 'sqlSessionFactory' defined in file 
[C:\indonesia\project\workspace\.metadata\.plugins\org.eclipse.wst.server.core\tmp1\wtpwebapps\kdbdw\WEB-INF\
classes\spring\context-sqlmapper.xml]: Cannot resolve reference to bean 'dataSource' while setting bean property 'dataSource';
nested exception is org.springframework.beans.factory.CannotLoadBeanClassException: Cannot find class [dwsec.id.cmmn.bean.
RoutingDataSource] for bean with name 'dataSource' defined in file [C:\indonesia\project\workspace\.metadata\.plugins
\org.eclipse.wst.server.core\tmp1\wtpwebapps\kdbdw\WEB-INF\classes\spring\context-sqlmapper.xml]; nested exception 
is java.lang.ClassNotFoundException: dwsec.id.cmmn.bean.RoutingDataSource 
at org.springframework.beans.factory.support.BeanDefinitionValueResolver.resolveReference(BeanDefinitionValueResolver.java:328) 
==============================================================================================================

- eclipse 시작 에러 
원인: /SpceExptMapper.xml 설정 잘못해서 나는 에러 
ERROR: dwsec.id.cmmn.service.impl.CtnsAuthServiceImpl - Invalid bound statement (not found): dwsec.id.cmmn.mapper.CtnsAuthMapper.selectCtnsRoleList 
java.lang.Exception: Invalid bound statement (not found): dwsec.id.cmmn.mapper.CtnsAuthMapper.selectCtnsRoleList 
at dwsec.id.cmmn.service.impl.CtnsAuthServiceImpl.selectCtnsAuthInfo(CtnsAuthServiceImpl.java:88) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.24(금) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 야근 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert Profile Mgmt(/spceExptMainlDtlR.jsp) 개발 ==> 완료 
==> /hmpg/stkCm/spceExpt/spceExptMainlDtlR.do 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.25(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 17:00 

- 주말  
09:00 기상(비옴) 
09:10 조식(라면) 
10:00 낮잠 
13:50 중식 
14:00 낮잠 
16:00 기상 
16:30 장보기 
18:00 석식 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.26(일) 작업 ■■■■■■■■■■■■■■■
---> 11:20 ~ 22:00   

▦조기축구   
07:00 기상   
07:20 국민은행 봉천동지점 앞(태훈이형 차) 
07:45 신구초등학교(삼성 조기회, 도곡 조기회 초청) 
09:00 게임(삼성 1 :신사 0 패) 
10:00 게임(삼성 4 :신사 1 패) 
11:00 게임(삼성 4 :신사 0 패) 
12:00 종료 
12:20 중식(뚝심 한우 식당, 소고기 국밥): 회에서 쏨 
13:00 귀가  
12:20 낮잠 
15:00 기상 
15:30 이발(블루클럽, 7천원): 1번 감 
16:20 관악 프라자 사우나(목욕, 7천원) 
17:30 귀가  
18:00 석식 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.27(월) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 21:30 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert Profile Mgmt(/spceExptMainlDtlR.jsp) 개발 ==> 보류 
==> /hmpg/stkCm/spceExpt/spceExptMainlDtlR.do 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.28(화) 작업 ■■■■■■■■■■■■■■■
---> 07:00 ~ 19:00 --> 회식(강녹수: 삼겹삽(36만원 나옴)) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert Profile Mgmt(/spceExptMainlDtlR.jsp) 개발 ==> 완료 
==> /hmpg/stkCm/spceExpt/spceExptMainlDtlR.do 
==============================================================================================================

- 건강보험 재등재(루옌, 장인, 장모) 
1. 필요 서류: 가족관계증명서(루옌), 외국인등록증 사실확인서(출생 증명서), 외국인증 
2. 건강보험료(지역, 1월) 납부: 38,290원 
3. 자동이체 신청(SC은행, 말일) ==> 임의 가입자 2년 유지 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.29(수) 작업 ■■■■■■■■■■■■■■■
---> 06:50 ~ 17:30 --> 설 연휴 전날, 장인 어른 도착(마이씨가  모시고 옴) 

- 대우증권 인도네시아법인 홈페이지 재구축 Prj
- Space for Export 개발 
1. Space for Expert Profile(/spceExptMainProf.jsp) 개발  ==> 완료 
==> /hmpg/stkCm/spceExpt/spceExptMainProf.do 
==============================================================================================================

2. Space for Expert Profile Mgmt(/spceExpertAdminProf.jsp) 개발   ==> 완료 
==> /hmpg/stkCm/spceExpt/spceExpertAdminProf.do  
==============================================================================================================
   
3. Space for Expert Information(/spceExptMainInfo.jsp) 개발   ==>   
==> /hmpg/stkCm/spceExpt/spceExptMainInfo.do 
==============================================================================================================

- AP 소스 
1. MGM pgmRank 페이지(//hmpg/myPage/mgmMgmt/pgmRank.do) 
/MgmtController.java, /hmpg/myPage/mgmMgmt/evntPstat.jsp 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.01.30(목) 작업 ■■■■■■■■■■■■■■■ 
---> 09:00 ~ 17:00 

- 설 연휴 
05:50 기상 
06:10 집출발 
06:20 5413번 버스 
06:40 고속터미널(경부선)  
06:55 서울 출발 
13:50 포항 도착(7시간 걸림) 
14:00 101번 버스 
14:20 포항집 도착 
15:00 낮잠 
17:20 기상 
17:45 주남이형 차(SMS5, 집앞) 
18:20 진호형 가게(왕손짜장일번지: 포항시 남구 효자동길 5번길 21)  
18:30 포항계 모임(모임 회비: 2만원): 동형형, 주남이형, 진호형, 태정, 정철 
       ==> 중국집 오픈하는데 1억 필요(수습 3개월) 
20:40 종료 
20:50 귀가(주남이형 차) 
23:50 취침 
==============================================================================================================    

■■■■■■■■■■■■■■■■■■ 2014.01.31(금) 작업 ■■■■■■■■■■■■■■■  
---> 11:20 ~ 22:00   

- 설
08:00 기상    
09:00 차례  
09:30 종료  
09:40 중식   
13:00 집출발  
13:30 포항 공원  
14:30 이모집(이모부 아팠다고 함 -> 다시 인도 간다고 함) 
17:20 대게 먹음(내기 섯다) 
19:30 외가집(규호 이모 가족, 외삼촌)   
20:00 귀가(이모, 이모부 방문), 큰누나 방문 
20:50 종료 
23:50 취침   
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■