

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2014.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2014.10.01(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 ==> 호환성 개발 회의(15시, 302호)[개발 시연] 

- SMART TV App Mgt Prj
1. 전체 테스트
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.02(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==>  

- SMART TV App Mgt Prj
1. 전체 테스트
 1) 조회 조건 확인
 2) Proc 확인
 3) 전체 Flow 돌리기
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.03(금) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:30 ==> 개천절

- ▦조기축구
06:15 기상
06:40 국민은행 봉천동지점 앞(태훈이형 차)  
06:50 신구초등학교
07:20 숏게임
08:10 게임: 역삼 조기회(연합회 회장단) ==> 3게임함
12:10 종료
13:00 귀가
13:10 낮잠
13:50 기상
14:20 지히철(서울대입구역 -> 잠실역(7번 출구))
15:00 버스(1670 직행버스: 잠실역 -> 토평IC): 유모차 큰거 가지고 와서 겨우 탐(루옌 버스 탔다고 짜증냄)
16:00 구리 코스모스 축제(구리 한강 시민 공원)
16:30 사진 촬용(코스모스)
17:00 간식(옥수수, 떡볶기, 순대): 9천원
17:50 루옌이 버스타는 곳을 아는 척해서 토평 정수장 정류소로 감 ==> 옥수수 큰거 버려라고 해서 화냄(루옌 삐짐) 
18:30 버스(1650 직행버스: 토평 정수장 -> 강변역)
19:00 지하철(강변역 -> 서울대입구역)
20:00 귀가
21:00 석식(루옌 찌져서 밥도 안 차려줌)
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.04(토) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00 ==>

- 주말
09:00 기상
09:15 석식(식빵)
09:30 TV 시청
12:00 처가 통장 정리할 것(551만원 인출해서 SC은행 통장에 넣음) 
12:30 중식
13:00 낮잠
18:00 NH 농협증권프로젝트 제안 
==>다온정보기술 홍승병 전무(610 불렀는데 580으로 이야기함, 채권에 넣어 본다고 함)
19:00 석식
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.05(일) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00 ==> Smart Proj 오픈[Front, Back](22시)

- ▦조기축구
06:25 기상
06:30 머리감는데 코피 많이 남
06:50 버스(643번): 버스타고 감
07:40 신구초등학교(창원이형 다시 옴)
07:50 게임: 일원 조기회 ==> 3게임함 
==> 이재상 고문과 회장님이 운동장에서 싸움
12:10 종료
12:20 중식(비빕밥 3그릇, 물냉면): 문경새재 ==> 회에서 쏨
14:00 종료
15:00 당구(구경): 현태형, 정욱이형, 병룡(꼴찌함)
16:00 종료
16:10 치친뱅이(회장님, 창원이형, 영민이형, 수인이형, 병규형 등등): 창원이형이 쏨
17:00 종료
18:00 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.06(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 ==> 커피(강현태 책임이 사줌), Smart Proj 오픈[Front, Back](Back 부분 방화벽 문제로 오픈 못 함)

- SMART TV App Mgt Prj
1. 전체 테스트
 1) 조회 조건 확인  ==> 완료
 2) Proc 확인
 3) 전체 Flow 돌리기
==============================================================================================================

- fnRowCallback - 각 테이블의 draw에 의해서 화면에 그려진 후에, 생성된 각 row에 대해 다음처리를 가능하
게 한다. row의 클래스명등을 설정하는데 사용 
- OnLoadComplete  메서드는 페이지 로드 단계가 끝날 때 호출됩니다. 페이지 주기의 이 단계에서는 모든 포스
트백된 데이터 및 뷰 상태 데이터가 페이지의 컨트롤에 로드됩니다

- parent 문제(/comp_assign_verification.jsp 파일에서)
function initEvnt(){
	'$(body).find("button[name=btn_AssignTester]").click( function() {   // 02. Assign Tester Click()
	 
	var el = $(datatablesUiVeri.getDataTables()).find(".tr_hidden").find("input[type=checkbox]:checked").parent();
	// 1개 이상 체크
	 
	for(var i=0; i<el.length>; i++){
		var statCd = $.trim($(el[i]).find("input[name='PLTFRM_STAT_CD']").val()); 
		//alert("[/comp_assign_verification.jsp] [btn_AssignTester_click()] ==> [statCd]"+ statCd );
	}
}

function initTable(initColumnDef, params){ 
var columnDefs = initColumnDef;
var opt = {
 fnRowCallback: function( nRow, aData ) { 
if( aData.ORDERING == "0" ) {
$(nRow).addClass("tr_parent");
$("td:eq(0)" , nRow).html("View/Close");

} else {
$(nRow).addClass("tr_hidden dp_none");   // 반드시 필요함
$("td:eq(0)" , nRow).html("");
} 
}
}
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.07(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 ==> 어제밤에 루옌과 화해함

- SMART TV App Mgt Prj
1. 전체 테스트
 1) 조회 조건 확인  ==> 완료
 2) Proc 확인
 3) 전체 Flow 돌리기
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.08(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 ==> 

- SMART TV App Mgt Prj
1. 전체 테스트
 1) Tab 없애기 ==> 완료
==============================================================================================================

- 비행기표 예약 사이트
01. 땡처리닷컴 ==> http://www.072.com
02. 와이페이모어 ==> http://www.whypaymore.co.kr  --> tamario / l*fndPs1*2!*
03. 스카이 스캐너(App) ==> http://www.skyscanner.co.kr 
04. 온라인투어(App) ==> http://www.onlinetour.co.kr
05. 제주항공(App) ==> http://www.jejuair.net
==============================================================================================================

- 베트남 비행기표 예매
1. 출발 --> 베트남항공(417편): 인천[02/08(일) 10:35]  ==> 하노이[02/08(일) 13:30], 일반석 2석 OK 
2. 도착 --> 베트남항공(414편): 하노이[04/05(일) 10:35] ==> 인천[04/05(일) 16:30], 일반석 2석 OK 
==============================================================================================================

- Allfusion Erwin Data Modeler 7.2 Serial CD-KEY
GA6VY-SLMHT-GVUQC-NHKND-CXLGA
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.09(목) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00 ==> 한글날

- ▦조기축구
06:35 기상
06:50 버스(643번): 버스타고 감
07:40 신구초등학교(종순이 나옴)
08:00 숏게임
08:30 게임: 역삼 조기회 ==> 3게임함  ==> 유속이 친구가 역삼팀하고 싸움
12:10 종료
12:20 중식(비빕밥 3그릇면): 문경새재 ==> 1만원 냄
13:20 종료
14:30 귀가
14:50 낮잠
16:20 기상
16:50 집출발
17:20 신림역(지하철)
17:30 옷(바지, 루옌): 페이지원
18:30 석식(물냉면, 루옌): 육쌈냉면
19:00 신림역 출발(걸어서 옴)
20:00 귀가
22:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.10(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:30 ==> 

- SMART TV App Mgt Prj
1. 전체 테스트
 1) Tab 없애기 ==> 완료
 2) Proc 확인 ==> 완료
 3) 전체 Flow 돌리기
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.11(토) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00 ==>

- 주말
08:00 기상
08:40 조식(식빵)
09:15 모태산부인과(독감 예방 접종 1차)
	==> 수두 1차, MMR(홍역. 볼거리. 풍진) 1차, 독감 예방 접종 1차(2만원)
10:50 종료
12:30 중식
13:00 낮잠
16:00 기상
16:30 현관에 201호 애가 자전거 주차한 걸로 시비가 붙음(내가 짜증나게 전화 했다고 201호가 욕함)
17:00 사이다, 홍차, 쥬스: 어린왕자 서울대점(만 천원 냄) 
	==> 13개월 이상 입장료 7천원[보호자 4천원(또는 음료수 4천 5백원 먹어야 함)]
18:00 석식(돌솥, 소고기, 라뽁이): 포마토 서울대점
19:40 시계 밧데리 바꿈
20:00 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.12(일) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 18:00 ==>

- ▦조기축구
06:15 기상
06:40 국민은행 봉천동지점 앞(태훈이형 차)
06:50 신구초등학교
07:70 숏게임
08:20 게임: 프렌즈 조기회 ==> 3게임함(전력 많이 보강됨), 용길이 나옴
10:20 월례회의: 10월 25일(토) 한민족 체육대회 참석 결정
11:40 종료(태훈이형 주차장에서 접촉 사고 냄)
12:00 중식(돌솥: 문경새재) ==> 조기회에서 쏨
13:30 귀가
13:50 루옌 고속터미널역에 옷 사러 감
14:30 낮잠(수종 우유 먹여서 재움)
17:00 기상
17:40 루옌 귀가
19:00 석식
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.13(월) 작업 ■■■■■■■■■■■■■■■
---> 08:10 ~ 21:00 ==> 핸드폰 알람 못 들어서 늦게 출근

- SMART TV App Mgt Prj
1. 전체 테스트
 1) Excel Export: 완료
 2) 권한별 조건 수정: 완료
 3) Reject 수정: 완료
==============================================================================================================

- 집 프린터 확인(21시)
03. 집 프린터(삼성 CLX-3175K) 출력 확인
1. 주민등록 등본 출력 여부 확인 ==> 출력 가능(확인)
2. 가족관계 증명서 출력 여부 확인 ==> 출력 가능(확인)
 1) 이용 시간 ==> 09 ~ 22시(평일), 09 ~ 19시(토요일)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.14(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> (주)아리츠 이윤주 과장이 12월까지 연장 제안, (주)IL4U 김팀장에게 전화(마이싱글 Proj 사실상 실패)

- SMART TV App Mgt Prj
1. 전체 테스트
 1) 호환성 추가 로직 및 개선사항(20141013).xls 파일 수정
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.10.15(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 ==> (주)아리츠 이윤주 과장와서 커피 사줌

- SMART TV App Mgt Prj
1. 전체 테스트
 1) 전체 Flow 돌리기
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■