

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2014.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2014.09.01(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: //Diamond/comp/assign/list --> /app_assign_list.jsp, /CompAssignController.java
 1) Assign List Tab[호환성] 
1. Doc Review
2. Verification
3. Launch(=Release)
==============================================================================================================

- 인증 단계 코드(AP.CS)
AP.CS.DR : Doc Review
AP.CS.VF : Verification
AP.CS.FR : Defect Review
AP.CS.CR : Contents Review
AP.CS.RL : Releas

기타1 (정의중..) : SP
기타2 (정의중..) : 호환성
==============================================================================================================

- 선불폰 구입
==============================================================================================================

- 귀성(KTX, 19:30)
1. 9월 6(토) 19:30 ==> 173열차, 11호차, 입석: 서울(19:30) --> 동대구(21:18), 가격: 36,100원 
2. 9월 6(토) 23:01 ==> 4413열차, 입석, 동대구(23:01) --> 포항(00:57), 가격: 5,600원
- 동부정류장(동대구 --> 포항행)
1. 06:30 ~ 21:00 까지 10분 간격, 심야: 22:25, 22:45, 23:05, 24:00, 가격: 7,000원
==============================================================================================================

< Code Review Center 저장 로직 >
1. S_CP_APP_VER Table에 CD_RVW_CNTR_ID 컬럼,
   CD_RVW_CHRGR_ID 데이터 초기화

2. S_CP_APP_TST Table에 CD_RVW_CNTR_ID 컬럼
   CD_RVW_CHRGR_ID 데이터 초기화 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.02(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 강현태 차장이 음료수 사줌

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign:  /CompAssignController.java, /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.03(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 비옴, 호환성 개발 회의(10시, 301호), 중식(아리츠, 12시)

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign:  /CompAssignController.java, /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review
==> app_assign_list 조회 성공
==============================================================================================================

- 호환성 개발 회의(10시, 301호)
1. 개발 관련 애로 사항 토의
==============================================================================================================

- Golen(DB) 설치
1. 설치 후 연결 에러 ==> 해결 못 함 --> Golen(DB) 삭제 처림함
Initialization error. SQL*Net not properly installed
OracleHomeKey: SOFTWARE\ORACLE
OracleHomeDir: 
==============================================================================================================
 
- 오라클 DB 연결
1. SAPPAD(IP: 207.36.93.30): SAPPHIRE DB(DEV) -> SPPHR_W / spphrwas4!  ==> 신규 DB 서버(느려서 검증에만 사용)
2. DIA_DEV(IP: 203.***) ==> DIAMOND -> SPPHR_W / spphrwas4! ==> 기존 DB 서버(사용)
==>Orange for Oracle v6.0 설치
==============================================================================================================

- 중식(아리츠, 12시)
1. (주)아리츠 영업 담당 이윤지 과장이 제안
==> 2단지 뒷편 중국집
2. SMART TV App Mgt Prj 10월말 종료 예정 ==> 11월 부터 TA로 투입되게 해준다고 함
==> 아이엘포유 my single 우선으로 생각하고 차선으로 준비할 것
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.04(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review
==> Comp. Assign Center
==============================================================================================================

- Caused by: java.sql.SQLException: 부적합한 열 유형 에러
1. 현상: [Mybatis 에러] Error setting null parameter (java.sql.SQLException: 부적합한 열 유형) - Oracle 연동 시, 
에러 Mybatis를 이용해 Oracle과 연동 시, 다음과 같은 에러가 발생할 때가 있다. 
Error setting null parameter (java.sql.SQLException: 부적합한 열 유형)
2. 에러 원인: Mybatis를 이용해 Insert/Update를 할 때, Insert/Update되는 컬럼의 타입이 지정되지 않았고 Null 값이
입력 되었을 때 발생 
3. 해결 방: Insert/Update되는 컬럼에 아래와 같이 jdbcType을 지정 해주면 된다.
#{HOLD_EXCEPTION_FLAG, jdbcType=VARCHAR}
X.APP_VER_SEQ_NO = #{appVerSeqNo, jdbcType=INTEGER} 
==============================================================================================================

- AS IS(Assign Center)
08. S_CF_CERT_CHRG_CNTR(30_인증담당센터 TB)  =========> @@@  ---> 처리
08_21. S_CF_CERT_CHRG_CNTR_CHRGR(30_인증담당센터담당자 TB) =========> @@@  ---> 처리

08_02. S_CF_DOC_RVW_CHRG_CNTR(30_다큐먼트리뷰담당센터 TB)
08_03. S_CF_DFCT_RVW_CHRG_CNTR(30_결함리뷰담당센터 TB) =========> @@@  ---> 처리

- TO BE(Assign Center)
51. S_CM_CNTR(50_센터 TB)
51_02. S_CP_APP_TEST_CNTR(31_호환성앱버전테스트센터 TB)  =========> @@@    ---> 처리
51_03. S_CP_APP_TEST_TSTR(31_호환성앱버전테스트센터테스터 TB)  =========>  @@@    ---> 처리
==============================================================================================================

- 전체 회의(16:30, 301호)
1. 내용
 1) 9월 30일(월) 22시 오픈
 2) 9월 16(화): 전체 회식
 ==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.05(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review
==> Assign Center
==> Assign Tester
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.06(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->

▦조기축구 
05:45 기상
06:10 국민은행 봉천동지점 앞(태훈이형 차)  
06:40 신구초등학교(총무, 부총무 모두 휴가 감)
08:00 숏게임(2:0 승)
09:00 게임(1:0 패): 도곡조기회 
10:20 게임(1:0 패) ==> 4게임 함(힘이 되살아 났다고 칭찬 받음)
10:40 종료
11:30 중식(돌솥, 문경새재): 조기회에서 쏨
12:20 종료
13:30 이발(블루클럽 봉천6동)
14:20 귀가(태훈이형 고향 내려가서 버스타고 옴)
19:00 석식
23:00 집출발
24:00 강남터미널(현용 만남)
24:10 서울 출발
04:20 포항 도착
04:30 택시(포항고속터미널 -> 포항집): 택시비: 4,900원
04:50 포항집 도착
05:00 귀가
05:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.07(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->

- 추석 연휴
09:30 기상
10:00 조식
12:00 택시(포항집-> 죽도시장): 루옌이 죽도 어시장 보고 싶다고 함 ==> 꽃개 (5마리) 구입
13:10 택시(죽도시장 -> 북부해수욕장)
14:10 북부해수욕장 구경
15:00 귀가
18:10 주남이형이 태우러 옴 
18:30 손짜장 일번지(진호형 가게) 도착
19:00 포항계(동형이형, 주남이형, 진호형, 봉춘이, 태정이, 진철이, 승표(새로 가입) 참석)
        ==> 루옌, 수종, 봉춘이 가족, 주남이형 가족 참석 --> 추석 선물로 롯데 백화점 상품권 7만원 받음
21:00 종료 --> 진호형이 돌잔치 부주 5만원 함 --> 주남이형이 수종이게 만원 줌 --> 주남이형 딸에게 다시 줌
21:30 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.08(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- 추석
07:30 기상 
07:30 차례 준비
08:10 차례(루옌, 수종 처음 추석에 와서 차례 지냄)
08:30 조식
15:00 택시(포항집 -> 용흥동 경태집) ==> 이모부, 성희 없음(수종 젊잖다고 인기 많았음)
17:10 귀가 ==> 큰누나네 집에 와 있음
19:00 석식
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.09(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 

- 추석 연휴
09:30 기상
10:00 조식 ==> 루옌 월남쌈 만들어 줌 
12:00 루옌 큰누나 차로 샌달 사러 감 ==> 샌달2개 사옴
18:00 석식
19:00 큰누나네 집에 감
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.10(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 

- 추석 연휴
09:30 기상
10:00 조식
11:00 큰누나가 루옌 파마, 염색 해줌 ==> 내머리도 염색 해줌
13:00 중식
17:00 옛날 포항집 나들이(수종, 유모차): 대규 과수원, 감, 작은 굴
18:00 토와집 방문
19:30 귀가
19:00 석식
24:00 집출발
24:05 택시(포항집 -> 포항고속터미널)
24:15 포항고속터미널
24:40 포항 출발 ==> 루옌, 수종 데리고 탐(수종 안고 타니 무거웠음)
04:40 서울 도착 
04:40 택시(강남터미널 -> 서울집): 택시비: 7,500원
05:10 서울집 도착
06:00 출근 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.11(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review
==> Assign Center
==============================================================================================================

- 셀카봉 블루투스 인식 안됨
1) 옥션에 문의 글 올리니 판매자게 맞교환 해준다고 함.
- 수종 돌잔치 사진 촬영(10시)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.12(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review
==> Assign Center 등록, 수정: 완료
==============================================================================================================

- 공차장 취업 제의(취업 활동)
1. 고급 SM으로 월 550만원에 근무(토, 일에 비전 프로젝트 같이 참여)
==> 9월 17일(수)에 결정 난다고 함.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.13(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  

주말 
05:45 기상
06:10 643번 버스(태훈형 회사팀으로 감)
06:50 신구초등학교   
07:00 숏게임 ==> 유석이가 말이 많고 팀플레이 해쳐서 형들이 퇴장시킴
08:00 종료
09:50 종료
10:30 진료(풀독, 주사): 김재준피부과
11:10 글빛도서관 ==> 수종이라 처음으로 도서관 감(책읽어 주는데 울어서 나옴) 
12:00 귀가
12:10 중식
13:30 낮잠
17:00 기상
18:00 쇼핑 ==> 다이소에서 돌잔치 이벤트 선물 구입(저금통, 시계)
19:00 3석식(소고기덮밥, 돈가스 김밥, 냉면): 포마토 서울대점
20:00 귀가
22:00 돌잔치 성장 동영상 준비(동영상, 사진 고르기) ==> 완료해서 dejavu(http://dejavu.or.kr/xe/index.php?mid=basic_movie&document_srl=274085)
에 zip 파일 올림
01:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.14(일) 작업 ■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  

▦조기축구 
06:50 기상(새벽에 늦게 자서 알람 소리 못 들음)
07:20 국민은행 봉천동지점 앞(태훈이형 차)
07:40 신구초등학교 
08:10 숏게임
08:50 게임(3게임함) ==> 삼성 조기회(축구공에  얼굴에 맞아서 눈 멍들고 코피 남)
09:50 월례회의
10:20 전술 회의(한동이가 작전판으로 설명함)
11:40 종료  
12:00 중식(조기회에서 쏨)
13:30 귀가
14:00 돌잔치 안내 문자 보냄(휴대폰 주소록 참조)
13:50 낮잠
17:00 귀가
19:00 석식
22:00 돌잔치 사진 인화 주문(스마일캣에서 주문함)
23:00 장인, 장모님 돈관리 정리
23:30 장인, 장모님 선불폰 충전(KTF 충전: 3만원씩 충전)
02:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.09.15(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->  아리츠 이윤지 과장이 고차장에게 10월까지 연장 제의(확정적)

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록
==============================================================================================================

- SC은행(환전, 13시)
1. 환전(천 달러): 100만원 찾아서 환전할 것
==> 1,000천 달러(1,046,430원) 환전(1달러: 1,046.43)[환율우대 적용: SC은행 신영통점]
==> 다음부터 SC은행 홈페이지에 80% 환율우대 쿠폰 출력해가지고 갈 것
2. 20만원 찾아서 5만원으로 바꿈
3. 처가 통장에서 116만원 찾아서 입금할 것
-----------------------------------------------------------------------------------------------------

- SC제일은행 80% 환율우대 쿠폰
1. 로그인 > 쿠폰받기 ==> http://lovely-days.co.kr/1508
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.09.16(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 전체 회식(SMART Proj, 19시): 취소, 치실 처음 사용(좋음: 중식, 석식 후 매일 사용할 것)

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료
==============================================================================================================

- 치실 사용법
1. 올바른 치실 사용법(뉴 연세 치과): http://www.youtube.com/watch?v=775cW-tee1k
2. 올바른 치실 사용법2(뉴 연세 치과): http://www.youtube.com/watch?v=F6Gau6LFRS0
==============================================================================================================

- 공차장 취업 제의(취업 활동)
1. (주)아이엘포유 김성채 팀장이 연락 ==> 삼성전자 마이 싱글 프로젝트가 10월초에 단계적으로 모듈별로 투입
된다고 함(장담 못함) ==> 9월 17일(수)에 결정 난다고 함.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.17(수) 작업 ■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 --> 6시 15분 기상(06:40 사당역에서 통근 버스 탐) 

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.18(목) 작업 ■■■■■■■■■■■■■■■
---> 07:40 ~ 20:00 --> 호환성 개발 회의(14시, 305호)

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /omp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.19(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 인천 아시안 게임 개막

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /comp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료

1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Assign Reviewer 등록, 수정: 완료 ==> Verification
==============================================================================================================

- [ibatis] 주로 쓰는 쿼리 빼서 공통으로 사용하기  
<sql id="selectItem_fragment">
FROM items
WHERE parentid = 6
</sql>  
위와같이 주로 쓰는쿼리를 정리해논뒤 (쿼리 일부분,완성된쿼리가 아니라도 상관없음)
아래와 같이 include refid 를 줘서 사용하면 된다~
 
SELECT id, name<include refid="selectItem_fragment" />
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.09.20(토) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->

- 주말
05:45 기상
06:15 국민은행 봉천동지점 앞(태훈이형 차)  
06:40 신구초등학교
07:00 숏게임
08:10 종료(한상봉 회장님, 총무, 기홍씨, 용길이가 돌잔치 부주해줌)
08:40 귀가
09:50 집출발
10:00 버스(낙성대동 -> 강남터미널): 수종 같이 감
10:30 강남터미널(장모님 마중): 짐 많음
10:40 택시(강남터미널 -> 서울집): 장모님 마중
11:30 귀가
11:20 집출발
11:30 버스(낙성대동 -> 강남터미널): 혼자 감
12:30 강남터미널(어머니 마중)
12:40 택시(강남터미널 -> 서울집): 어머니 마중
13:10 귀가 
13:30 버스(봉원중 -> 신림역): 다문화 축제
  ==> 뚜이 남편 만남: LG CNS 프리랜서(오라클 ERP, 물류 업무), 하이퐁 50일 출장
14:00 다문화 축제(봉림교 근처 도림천 행사장): 루옌 베트남 춤 공연 
14:40 큰누나, 매형 도착(옷 선물해줌)
15:30 종료
15:40 버스(신림역 -> 봉원중): 큰누나, 매형
15:50 귀가
18:30 뼈찜(대): 할매순대국디케 --> 포장
18:40 작은 누나 도착(옷, 운동화 선물해줌)
19:00 석식
21:00 맥주 파티(3병 먹음)
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.21(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 수종 돌잔치

- 주말
08:30 기상
09:20 조식
11:00 집출발(돌잔치 이벤트 선물 들고 감)
11:40 워터플라워 지하 2층 SU 한복 도착
12:00 신부 화장
13:30 수종 머리 다침(책꽃이 모서리 부딪침) ==> 후시딘 연고 바름
      --> B형 돌잔치 촬영을 취소하고 최소 촬영으로 변경(15만원)
13:40 한복 갈아 입음
14:00 신랑 머리, 화장함
14:30 스냅 사진 촬영(최소) ==>  워터플라워 3층 포토 존
14:40 은아, 호수 도착
14:50 첼로품 도착
15:00 손님들 입장
16:00 돌잔치 행사(수종 돌잡이에서 연필 잡음)
16:40 종료
16:50 식사
17:20 행사 종료
17:30 워터플라워 첼로룸 이용 금액 결산(1,630,000원)
17:50 SU 한복, 사진 이용 금액 결산(310,0000원) ==> 총 금액: 1,940,000원
18:00 SU 한복, 사진 이용 금액 결산(310,0000원) ==> 총 금액: 1,940,000원
16:40 종료
16:50 택시(신림역 -> 서울집): 돌잔치 후 집 복귀
19:00 귀가
19:20 뎁 부부 같이 옴
20:30 뎁 부부 대전으로 감
21:00 돌잔치 정산
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.22(월) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 월요일 통근 버스가 많이 막힘, 허우씨에게 520만원 송금(베트남 보냄)

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /comp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료 
1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Assign Reviewer 등록, 수정: 완료 ==> Verification
==============================================================================================================

- 수정
1. Code Review  ==> 02. S_CP_APP_TEST(31_호환성앱버전테스트 TB)  TB 사용(수정할 것)
2. Verification  ==> S_CP_APP_TEST_CNTR(31_호환성앱버전테스트센터 TB) TB 사용
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.23(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 

- SMART TV App Mgt Prj
- 호환성 개발
1. Assign: /app_assign_list.jsp, /comp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료 
2. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Assign Reviewer 등록, 수정: 완료 ==> Verification
==> Return to T/L 등록, 수정: 완료 ==> Verification
==============================================================================================================

- 로보폼RoboForm 7.9.9.1 설치 ==> 30일 버전(설치하지 말 것)
http://www.roboform.com/download
==============================================================================================================

- 마이 싱글(my single) 비밀번호 변경
1. SDS 인증서: s*pe*m8**1 --> hp태**ks1*!*
==============================================================================================================

- my single Communicator 에러
1. 에러 내용: 서버에서 인증서를 확인하는 동안 문제가 발생했습니다.
2. 원인: PC의 날짜와 시간이 현재시간으로 맞게 설정되지 않으면 인증서 문제가 발생됩니다. 
날짜와 시간을 현재시간으로 맞추면 정상 동작 됩니다. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.24(수) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 18:00 --> 호환성 개발 회의(15시, 305호), 수종 생일(케익)

- SMART TV App Mgt Prj
- 호환성 개발 ==> 테스트
1. Assign: /app_assign_list.jsp, /comp_assign_code_review.jsp: Code Review 
==> Assign Reviewer 등록, 수정: 완료 
1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Assign Reviewer 등록, 수정: 완료 ==> Verification
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.25(목) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 -->  

- SMART TV App Mgt Prj
1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Reject 등록, 수정: 완료 ==> Verification 
2. Proc Call(프로시저 호출)
==============================================================================================================

- // 4. Proc Call ( 기존 : 초기000,110  , 초기이외110,110 )
HashMap<String>, Object> procMap = new HashMap<String>, Object>();

procMap.put("prjId", compProject.getPrjId());
procMap.put("prjIdto", "");
procMap.put("appId", model.getAppId());
procMap.put("appVer", model.getAppVerInfo());
procMap.put("TestId", "");
procMap.put("cntrId", "");
procMap.put("Actor", compProject.getUserId());
procMap.put("inStatus", CompStatusCdEnum.READY_TO_SUBMIT.getValue());
procMap.put("toStatus", CompStatusCdEnum.READY_TO_SUBMIT.getValue());

procStatusChg.ProcedureStatusChg(procMap);
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.26(금) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 21:00 -->  

- SMART TV App Mgt Prj
1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Reject 등록, 수정: 완료 ==> Verification ==> 42. Defect 삭제 처리 여부 향후 처리할 것 @@@
==============================================================================================================

1. 현상 
java.lang.Exception: You don't have permission.
2. 조치방법 ==> /com.samsung.sapphire/src/main/resources/config.properties 파일의 아래 변수 값 false로 설정
siteinterceptor.checkauthority = false
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.27(토) 작업 ■■■■■■■■■■■■■■■
---> 10:00 ~ 17:30 --> 토요 근무

- 주말
06:15 기상
06:20 국민은행 봉천동지점 앞(태훈이형 차)  
06:50 신구초등학교(병규형이 돌잔치 부주 5만원 줌)
07:00 숏게임
08:10 종료
08:30 선릉역(태훈이형이 태워줌)
09:50 망포역
10:00 삼성전자 2단지(출근)
12:00 중식(압구정 뷔페)
17:30 종료
18:00 중앙문 터미널(토요일 통근 버스 탐)
19:20 사당역 도착
19:50 귀가 
20:10 석식(알탕, 갈비탕): 포마토 봉천점 
24:00 취침
==============================================================================================================

- SMART TV App Mgt Prj1. Assign: /app_assign_list.jsp, /comp_assign_verification.jsp: verification
==> Reject TESTER 등록, 조회: 완
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.28(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 제35회 국민생활체육 강남구청장기 시합

- 주말
06:15 기상
06:40 국민은행 봉천동지점 앞(태훈이형 차)  
07:20 수도공고 도착
09:00 준결승 ==> 09:00 ~ 10:00  신사 4: 0 개원(구경만 함) ==> 실력보다 운이 좋았음
10:00 종료 후 중동고로 이동
10:20 중동고
12:30 결승 ==> 12:00 ~ 13:00  신사 2: 2 일원 --> 중동고 == >40대 준우승(공 못 참: 다시는 시합에 참석하지말 것)
	==> 송정욱형, 이영민형, 이규남형, 서정홍이 돌잔치 부주 해줌
14:00 종료
15:00 낮잠
17:00 기상
17:30 꼬망스2(수종 기능성 잠바, 행사): 라붐아울렛
17:50 아가방4(신발 반납, 잠바, 내복): 라붐아울렛
19:00 귀가
19:30 어머니 안경 택배 보내기
20:00 석식(알탕, 갈비탕): 포마토 봉천점 
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.29(월) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 --> 호환성 개발 회의(15시, 302호)[수요일에 개발 시연]

- SMART TV App Mgt Prj
1. 전체 테스트
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.09.30(화) 작업 ■■■■■■■■■■■■■■■
---> 07:30 ~ 20:00 -->   

- SMART TV App Mgt Prj
1. 전체 테스트
==============================================================================================================

- 3줄 데이타 한줄 칼럼으로 조회 처리
-- 01. TIER정보 조회 @@@  ==> 3줄 조회 
SELECT A.APP_TR_TYP_CD, A.*
 FROM S_CP_PRJ_TIER A
 WHERE A.PRJ_ID = '1426900117'
;

-- 02. TIER정보 조회 @@@ ==> 1줄 조회
SELECT (SELECT SUBSTR(XMLAGG (XMLELEMENT (NM, ',', APP_TR_TYP_CD)).EXTRACT ('//text()'), 2) as tier
          FROM S_CP_PRJ_TIER
         WHERE PRJ_ID = '1426900117') as TIER
 FROM DUAL
; 

-- DDL Script was generated by Orange for ORACLE
-- using session 'SPPHR_W@DIA_DEV' on '2014/09/29 18:09:56'.
CREATE OR REPLACE function SYS.SYS_IXMLAGG wrapped
a000000
1
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
abcd
8
56 85
FCIzhYpZhiKGtnCH9k8SF/cOC6Awg8eZgcfLCNL+XudKdEr+X6WBUvW/saXSmeey+/R9+0Tm
Zh1xKpSscYTm1uTIlVOpxdZxVaSEcZTm1gBzaJSpzw6JsCCpKh2mlrkEWw==;
/

GRANT EXECUTE ON SYS.SYS_IXMLAGG TO PUBLIC WITH GRANT OPTION; 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■