

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2014.05) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2014.05.01(목) 작업 ■■■■■■■■■■■■■■■
---> 08:30 ~ 11:30 -->  첫 출근
 
- BK기업은행 POST차세대 계정계시스템 재구축 Prj
- IBK기업은행 POST차세대 계정계시스템 재구축 첫 출근
- 업무 : 대행-어음관리
- 스킬 : JAVA, Oracle, Anyframe, Batch
- 기간 : 4월 28일 ~ 4개월
- 등급 : 중급 5명
- 장소 : 수지IT센터
==============================================================================================================

- 첫 출근
06:45 기상
07:00 조식(식빵)
07:30 집출발
07:40 낙성대동(416번 버스)
08:10 뱅뱅사거리(8201번 버스)
08:30 머내 기업은행 도착(이혁 팀장에게 전화): 추가 투입 인력 인사(이완희 차장, 전상환 과장)
08:40 노트북 Mac address 확인(노트북이 부팅 안되서 내일 하기로 함) ==> 노트북 캐비넷에 보관
09:30 머내 기업은행 대강당(16층) ==> IBK 시스템 직원들과 인사
10:30 문서 보기
11:30 종료 
12:00 이완희 차장 차 얻어탐
12:20 신논현역(643번 버스)
13:00 귀가(루옌 한국어 공부하고 있음)
14:00 중식
14:30 낮잠
17:00 기상
17:20 봉원중(5513번 버스)
15:50 서울대 > 법대앞 > 두레문예관 B105호(루옌 장구 교육 신청함)
18:20 석식(서울대 식당)
19:00 서울대앞(750A번 버스)
19:20 관악구청
19:50 쇼핑
20:20 귀가
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.02(금) 작업 ■■■■■■■■■■■■■■■
---> 08:20 ~ 22:00 --> 
 
- BK기업은행 POST차세대 계정계시스템 재구축 Prj 
- 문서 분석
==============================================================================================================

- 노트북 에러
06:30 기상
06:40 조식(식빵)
07:00 집출발
07:25 숭실대입구역(2번 출구 빠리바케트 앞): 아시아나관광 탑승
08:20 머내기업은행 도착
09:00 머내기업은행 16층
09:30 1층 로비에서 노트북 OS 셋팅 ==> Windows7 Enterprise 32bit 설치
11:40 중식(지하 1층 식당): 3천 5백원
13:30 노트북 에러 발생
      1) 현상: OS 재설치를 하면 속도가 엄청 느리게 설치가 됨 ==> 그 이후에 Windows7 화면을 못 봄
14:00 용산에 MSI A/S 센터에 가기로 결정
14:10 머내기업은행(M4101번 버스)
14:50 북창동(505번 버스)
15:20 용산 도착
15:30 산에 MSI A/S 센터 점검 요청
   ==> 진단: D 드라이브 하드가 배드 섹터가 났다고 함
   ==> 조치: D 드라이브 하드 750 GB SATA 제거 함 --> 정상적인 속도가 남
16:00 종료
17:20 머내기업은행 도착
18:00 퇴근
19:00 맥주(대행-어음관리팀)
20:30 종료
21:00 머내기업은행(8201번 버스)
22:40 귀가
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.03(토) 작업 ■■■■■■■■■■■■■■■  
---> 08:30 ~ 11:30

- 주말
06:45 기상
07:00 조식(식빵)
10:00  PCA 담당(추임순) FC 만남(집 찾아 옴)
10:10 보험 상담  ==> 01. 자녀 VUL 보험, 02. 신부 VUL보험, 03. 종신암보험, 04. 의료실비, 05. 프리미엄(예금)
13:30 중식(추임순 FC와 같이 집에서 식사)
14:00 종료
15:00 낮잠
17:00 기상
17:20 봉천중앙시장(5524번)
17:50 롯데백화점(보라매점): 루옌 반지 사고 싶다고 해서 안된다고 함
18:50 석식(토마토)
19:20 신림역
19:50 서울대입구역
20:10 쇼핑
20:20 귀가
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.04(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구

06:45 기상
07:10 낙성대동(5524번 버스)
07:50 광림교회
08:00 신구초등학교 
08:30 게임(5:5 무) 
10:20 종료
12:00 중식(부대찌게, 류명국해장국) ==> 회에서 쏨
12:10 종료
12:20 당구장 ==> 병규형하고 50 놓고 1:1로 비김
13:20 종료
14:00 귀가
15:00 낮잠
19:00 석식
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.05(월) 작업 ■■■■■■■■■■■■■■■ \
---> 09:00 ~ 18:00 --> 어린이날

▦조기축구
06:45 기상
07:10 낙성대동(5524번 버스)
07:50 광림교회
08:00 신구초등학교
08:30 게임(5:6 패): 도곡 조기회
10:20 종료
11:30 귀가
12:30 중식
13:00 마트
14:00 라붐아울렛(양산, 선글라스: 루옌 생일 선물)
15:20 서울대입구역
15:50 삼성역
16:20 코엑스 아쿠아리움(입장료: 22,000원(인당))
17:30 종료
18:30 석식(포몬스서울대점)
19:20 종료
20:00 귀가
23:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.06(화) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 16:40 --> 부처님 오신날, IBK 시스템에서 중식 제공
 
- BK기업은행 POST차세대 계정계시스템 재구축 Prj
- 문서 분석
==============================================================================================================
 
- 단말기 지정  
서비스 및 설정 > 전자금융사기예방> 단말기(PC)지정 관리
https://open.standardchartered.co.kr/service/H86001?menuid=OIB04080100000000&langCode=KR
 
1. PC별명 등록(봉천동 새문빌라 MSI GE60-2OE Lite 노트북)  ==> 2014.05.06
 1) PC별명: 01. 새문B(MSI)_2014.05
 2) Mac Address: 54-27-1E-68-87-C6
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.05.07(수) 작업 ■■■■■■■■■■■■■■■ \
---> 08:20 ~ 18:00 --> 철수(13시)
 
- BK기업은행 POST차세대 계정계시스템 재구축 Prj 
- 노트북 OS 새로 설치, 보안 프로그램 설치 ==> 노트북 데이타 삭제(OS 삭제됨)
- 철수 사유
IBK 시스템 이혁 팀장님이 말씀 하시는데 다른 팀과 연계하는 일이 있어서 다른 팀으로 트레이드 시켰는데 그 팀에서 
저를 알든 사람이 저를 거부해서 철수 결정을 내리게 되었다고 함.
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.08(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00
 
- 재충전
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.09(금) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 루옌 생일
 
- 재충전
08:45 기상
09:00 조식(식빵)
09:40 예방 접종(수종) 2차 ==> 모태 산부인과
10:10 KB국민행복적금 가입 해지(실수령액: 6,205,647원) ==> 국민은행
10:30 KB국민행복적금 가입 재가입(실수령액: 6,205,647원) ==> 국민은행
11:30 종료
11:50 중식(순대국, 황태해장국): 할매순대국(봉천점)
13:00 종료
14:00 귀가
15:00 낮잠
17:00 기상
18:50 석식(V3 월남쌈 커플): 포몬스서울대점
19:30 미니 생과일 생크림 케익: 파리바케트 행운점
20:00 귀가
22:00 생일 파티 ==> 루옌 생일
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.10(토) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 
 
- 주말
08:45 기상
09:00 조식(식빵)
09:40 PCA 담당(추임순) FC 만남(집 찾아 옴)
10:10 보험 가입
	1. PCA 스타트 어린이 변액유니버셜보험2 ==>  보험료: 월 340,4400원
	2. 무배당 한아름행복플러스종합보험1404(의료실비 보험, 한화손해보험) ==> 보험료: 월 43,000원
	3. PCA 프리미어 변액유니버셜보험3 ==> 보험료: 35,000,000원 예치(6월 14일 가입하기로 함)
12:00 중식(추임순 FC와 같이 집에서 식사)
13:00 종료
15:00 낮잠
17:00 기상
18:50 석식
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.11(일) 작업 ■■■■■■■■■■■■■■■ \
---> 06:30 ~ 18:00

▦조기축구
06:45 기상
07:10 낙성대동(643번 버스)
07:50 신사중
08:00 신구초등학교
09:00 게임(2:2 무): 프랜즈 조기회
10:30 게임(3:2 승): 유감독이 내 컨디션 좋았다고 칭찬함
11:20 종료
12:30 귀가
12:50 중식
13:50 낮잠
17:00 기상
18:50 석식
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.12(월) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00
 
- 재충전
07:30기상
08:00 조식(식빵)
11:00 집출발
11:10 봉원중(506번 버스)
11:50 가산디지털단지역(5528번 버스, 5번 출구)
12:00 중식(낚지 정식, 공형근 차장이 쏨: JE PLAZA 빌딩)  ==> 공차장이 5월말 기상 프로젝트에 투입되어
	협력해서 소프트웨어 개발하자고 제안(긍정적으로 제고하겠다고 함)
13:00 종료
13:20 가산디지털단지역(5528번 버스, 6번 출구)
14:00 한화생명 관악 고객센터 ==> 한화생명 하이드림연금 보험 해지
       --> 지급금액: 22,930,613원, 공제금액: 3,816,540원, 실수령액: 20,114,073원
14:20 종료
15:00 관악구 보육정보센터 방문 ==> 장난감도서관(꿈놀이터) 신청 안내 받음 
       --> 구비 서류: 주민등록등본, 신분증, 입금증(만원 송금 --> 우리은행, 1006-301-359643, 서울관악구육아종합지원센터
15:30 세월호 희생자 조문
15:50 다이소 쇼핑
16:30 종료
17:00 귀가
19:30 석식
24:50 취침
==============================================================================================================

- 베가 R3 SD카드 연결 방법(http://ollehgenius.com/110150331576)
1. 베가 홈페이지에서 내 폰에 맞는 USB드라이버를 찾아 정상적으로 다운 받습니다.
(http://www.vegaservice.co.kr/down/software/main.sky#resultArea)  
2, 알집 파일의 압축을 풀고 설치합니다.
3. MTP usb 드라이버 설치 오류 사례 해결방법 ==> http://blog.naver.com/shinhosb6?Redirect=Log&logNo=100200126193
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.05.13(화) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00
 
- 재충전
1. 글빛 도서관 방문
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.05.14(수) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 --> 서울 대공원 방문
 
- 재충전
==============================================================================================================

- 서울 대공원 방문
08:45 기상
09:00 조식(식빵)
11:30 중식
14:00 서울대입구역
15:20 대공원역
15:30 서울대공원
16:00 서울동물원(입장료: 3천원)
18:00 종료
18:50 귀가
19:00 석식
24:50 취침
==============================================================================================================

- 화면캡처 스크롤 처리 
01. SnagIt.v10 ==> http://yyht.tistory.com/1355
1) CD-KEY: ZEN5H-24LZK-TNYET-2EGKJ-MMCE4
2)  SnagIt.v10 사용법 ==> http://blog.naver.com/premium512?Redirect=Log&logNo=130101405619  
01. SnagIt.v10 ==> http://blog.daum.net/4s6f4cb5f/27   
==============================================================================================================
 
05. 수종 전자여권 만들기
1) 준비 서류: 친권자분 신분증과 자녀분이름의 "가족관계증명서" " 기본증명서" 한통씩, 자녀분 여권 사진 1장
수수료는 5년 복수여권의 경우 33,000원
2) 여권 증명사진
http://jellyyr.blog.me/20204497897
http://www.passport.go.kr/issue/photo.php
3) 증명사진 인화 요청(장당 5천원): 호감 스튜디오: hogam4779@naver.com, ☎ 6498-4779, 
서울시 관악구 봉천동 1598-20 4층
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.15(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> (주)제이트리에서 급여 절반만 수령(2,659,250원)
 
- 재충전
==============================================================================================================

- [★_00] 선불폰 충전
- 장인 어른  중고폰(선불폰) 충전[2014.05.15(목)]  ==> ☎ 010-2696-1964
1. 요금제: KTF 충전카드(월 만원차감 예상)
==> http://freephonephone.co.kr/front/php/product.php?product_no=92&main_cate_no=33&display_group=1
------------------------------------------------------------------------------------------------------

- 장모님 중고폰(선불폰) 충전[2014.05.08(목)]  ==> ☎ 010-2649-1964
1. 요금제: KTF 충전카드(월 만원차감 예상)
==> http://freephonephone.co.kr/front/php/product.php?product_no=92&main_cate_no=33&display_group=1
------------------------------------------------------------------------------------------------------

- 장모님 중고폰(선불폰) 구입[2013.11.20(수)]  ==> ☎ 010-2649-1964
1. 기종: SPH-W7100  충전기=충전기, 색상=핑크
http://freephonephone.co.kr/front/php/product.php?product_no=460&main_cate_no=30&display_group=1
2. 금액: 23,000원(선불카드 3만원 포함, 충전기 포함)
3. 요금제: KT (3G폰) SHOW 선불 충전라이트 요금제(월 5천원 차감 예상)
------------------------------------------------------------------------------------------------------

- 장인 어른 중고폰(선불폰) 구입[2013.11.28(목)] ==> ☎ 010-2696-1964
1. 기종: SPH-W7100  충전기=충전기, 색상=핑크
http://freephonephone.co.kr/front/php/product.php?product_no=460&main_cate_no=30&display_group=1
2. 금액: 19,00원(선불카드 3만원 포함)
3. 요금제: KT (3G폰) SHOW 충전라이트 요금제(월 5천원 차감 예상)
4. KT가입 신청서:  tama339" target="_blank"> tama339" target="_blank">http://online.olleh.com/Main.jsp --> tama339
-------------------------------------------------------------------------------------------------

- 장인 어른 중고폰(선불폰) 구입[2013.08.14(수)]
1. 기종: 삼성폰(폴더폰): 충전기=충전기, 색상=검정
2. 금액: [총 3만원 ==> 단말기: 2만원, 충전: 만원]: 
3. 요금제: SK 선불 요금제(월 6천원 차감 예상)
4. 안산역 다문화거리에서 SK 대리점에서 구입(폰 상태 별로 안 좋음) ==> 문자 MMS 안됨
==============================================================================================================

- KTF 선불폰 잔액 확인 (요금 부과 되지 않습니다만 잔액이 있어야만 확인이 가능합니다)
1) 다른 전화기 : 016 + 1500 + 통화 + 1(한국어) + 휴대폰번호 + 비밀번호(기본 0000) + 2
2) 자신의 휴대폰 : 1500 + 통화 + 1(한국어) + 휴대폰번호 + 비밀번호(기본0000) + 2 
3) Free T 선불폰(자신의 휴대폰)
단축키(# # 9 6 + SEND)를 통해 잔액을 확인하실 경우, 통화료가 부과되지 않습니다.
==============================================================================================================

1. 사용 방법
주문 및 입금 하신 후 010-8071-3990번으로 입금자명, 선불폰번호, 충전카드종류
문자 보내주시면 입금 확인후 바로 충전 해드립니다.
충전시간은 오전 9시부터~ 오후 8시까지

- 휴대폰 결제 후 문자 보내기(010-8071-3990)
1) 입금자명: 진태만, 선불폰번호: 010-2696-1964(장인 어른 폰), 충전카드 종류: KTF 충전카드 20,000원
2) 입금자명: 진태만, 선불폰번호: 010-2649-1964(장모님 ), 충전카드 종류: KTF 충전카드 20,000원
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.16(금) 작업 ■■■■■■■■■■■■■■■ \
---> 06:30 ~ 18:00 --> 수종 여권 신청
 
- 재충전
==============================================================================================================

- 관악구 영유아 플라자(꿈놀이터) 가입(11시)
1. 구비 서류: 주민등록등본, 신분증, 연회비 입금증(만원 송금 --> 우리은행, 1006-301-359643,
   서울관악구육아종합지원센터(입금증)
2. 가입비(연회비): 만원(1년)
3. 장남감 대여
 1) 장난감은 한가정에 2점, 대여기간은 14일 이내
4. 이용 시간 ==> 점심시간 12시 ~ 13시
 1) 월, 수, 금: 10시 ~ 17시
 2) 연장 근무: 화: ~ 21시, 목: ~ 20시
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.17(토) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 주말
08:45 기상
10:00 조식
11:30 집출발
11:40 아가방4(원피스, 프엉딸 선물): 라붐아울렛
12:00 서울대입구역
12:30 신도림역(천안행)
14:00 오산역
14:10 오산역(1번 출구): 프엉 남편(공종현) 차 탐
14:30 공종현씨집(프엉 부모님 만남): 선물 받음
18:00 석식(공종현씨집에서 얻어 먹음)
19:30 종료
19:40 공종현씨집 출발
20:50 오산역
21:50 귀가
24:50 취침
==============================================================================================================

- 프엉씨집 방문 @@@@
1. 주소: 경기도 오산시 가수로 33번지 늘푸른 오스카빌 105동 703호
2. 서울대입구역(4-2) -> 신도림역(천안, 신창 행) -> 오산역(1번 출구) -> 오산역(7-5번) -> 늘푸른오스카빌(하차): 
가수 초교 맞은편-> 프엉집
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.18(일) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00

▦조기축구
06:45 기상
07:10 낙성대동(643번 버스)
07:50 신사중
08:00 신구초등학교
09:00 숏게임(4:1 승)
10:30 종료
10:50 중식(창원이형이 모친상 답례로 쏨)
11:30 종료
11:40 정홍이 차
12:20 사당역(5524번 버스)
12:40 귀가
13:30 낮잠
15:30 기상
17:30 쇼핑
19:00 석식(짜장면 2, 주먹밥): 포마토 ==> 포장에서 집에 와서 먹음
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.19(월) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 

- 채무불이행자등재 신청(법원, 14시)
08:45 기상
09:30 조식(식빵)
10:30 서울중앙지방법원 도착
11:00 법률 상담
11:10 집행문, 송달증명원, 확정증명원 신청(인지대 1,500원)
11:30 교대역
11:55 남한산성입구역(4번 출구) -> 수원 지방법원 성남지원(3별관 3층)
12:30 지대(천원), 송달료(32,500원) 납입 ==> 우리은행
13:00 채무불이행자명부등재 신청
13:10 종료
14:30 귀가
19:00 석식
24:50 취침
==============================================================================================================

- 채무불이행자등재 신청(법원, 14시)
1. 사건: 2013 가단 218819 대여금
2. 판결문 득한 후 6개월: 2014년 5월 14일
3. 우편 접수: 수원 지방법원 성남지원
http://cafe.naver.com/kdiresl2000/59
http://cafe.naver.com/ykjhscjc/2767
4. http://blog.daum.net/ffrogprince/6026114
http://blog.naver.com/PostView.nhn?blogId=casa100&logNo=70157221785
------------------------------------------------------------------------------------------------------
 
- 채무불이행자명부등재 신청절차 및 준비 서류 @@@@
가. 신청절차: 신청서 제출 후에 심사 후 결정을 내림
나. 준비서류
① 채무불이행자명부등재신청서  ==> 완료(수원 지방법원 성남지원에서 신청)
② 판결 등 집행권원 정본  ==> 완료
③ 송달증명원, 확정증명원 ==> 완료(서울중앙지방법원에서 신청)
④ 채무자 주민등록초본  ==> 완료
③ 집행문 사본(정본 첨부)  ==> 완료(서울중앙지방법원에서 신청)
다. 우편 접수 ==> 서울중앙지방법원에 가서 문의할 것
1) 수원 지방법원 성남지원: 경기 성남시 수정구 산성대로 451
2) 새문B -> 서울대입구역(1-1) -> 잠실역(8호선) -> 남한산성입구역(4번 출구) -> 수원 지방법원 성남지원(3별관 3층)
3) 인지대(천원), 송달료(32,500원)
------------------------------------------------------------------------------------------------------

- 채무자:  (이름) 조남권 (주민등록번호 610424 - 1025515)
     (주소) 경기도 성남시 중원구 황송로 77 107동 2406호(금광동, 래미안금광아파트)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.20(화) 작업 ■■■■■■■■■■■■■■■ \
---> 06:30 ~ 18:00 --> 수종 여권 수령, 루옌 다오집에 놀러 가서 20시 30분에 귀가
 
- 재충전
==============================================================================================================

- 2014년(2013년 귀속) 종합소득세 신고확인 ==> 인화 세무회계에서 2014-05-19 신고함
종합소득세			지방소득세			환급(납부)예상액
-1,407,625			-140,758 			-1,548,383원(환급 받을 예상액)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.21(수) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 작은 엄마(대규) 부고, 현용 만남(신촌역, 19시)
 
- 재충전
==============================================================================================================

- 현용 만남(신촌역, 19시)
18:00 집출발
18:10 서울대입구역
19:00 신촌역(3번 출구)
19:20 현용 만남
19:40 당구장(2:1 패): 9,400원
20:30 치킨집(현용 쏨)
22:00 호수 도착
22:10 당구장(2등): 15,000원
23:30 소주집(호수 쏨)
03:00 종료
03:10 택시(신촌역 -> 신도림역): 호수
04:30 신도림역(기다림)
05:30 지하철(신도림역)
06:10 귀가
06:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.22(목) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- 투입인력 이력사항 작성
1. 국가기후자료관리 및 서비스체계 구축(4차)
==============================================================================================================

- 작은 엄마(대규) 부고
16:00 석식
16:20 집출발 
16:30 낙성대동(643번 버스)
17:00 고속터미널
17:30 서울 출발
21:40 포항 시청 정류장 도착
21:50 포항 성모병원 도착
22:00 작은 엄마(대규) 박명순 조문(부주 10만원) ==> 양복 갈아 입음(어머니가 가지고 옴)
22:30 석식(대규, 선주, 선미, 선주 누나 및 자녀, 병오, 병일 아제, 판섭)
02:00 취침		===> 2014.05.23(금) @@@
08:00 기상
08:40 조식
09:20 철상
10:20 미사(덕수동 천주교회)
11:50 경주 공원 묘원(천주교 묘지)
12:30 장례
13:00 종료
13:20 중식(경주 공원 묘원 식당)
14:00 포항 성모병원 도착
14:45 포항 고속버스터미널(대규차로 옴)
15:00 포항 출발
20:00 서울 도착
20:30 귀가
23:30 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.23(금) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- iRODS 테스트베드 구축 분석
http://irods.org/
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.24(토) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 
 
- 주말
08:45 기상
10:00 조식
13:00 낮잠
13:30 취침
14:30 기상
16:00 집출발
16:10 까치공원
17:20 석식(철판볶음밥, 모듬사리): 유가네닭갈비
18:00 쇼핑(라붐아울렛): 반바지, 티
19:00 귀가
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.25(일) 작업 ■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00

▦조기축구  
06:45 기상
07:00 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교 
09:00 게임(3:1 승)
10:00 게임(6:3 승)
10:50 종료
11:30 중식(갈비탕, 문경새재): 오세림 고문이 쏨 
12:30 종료
13:00 이발(블루클럽)
13:40 귀가
14:00 낮잠
16:00 기상
19:00 석식(비 많이 옴)
23:00 취침 
==============================================================================================================

- Korail 철도 회원 카드
1. KTX 패밀리 체크 카드(철도회원) ==> 카드번호: 0550566830/l*fndPs1*1*(러브*루*1*1*)
http://www.korail.com/bt/pr11100/w_pr11110.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.26(월) 작업 ■■■■■■■■■■■■■■■   
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- [국민은행] KB종합통장-저축예금[루옌]: 루옌 전용 통장 ==> 2014.05.26(월) 가입 @@@@@@
1. 계좌번호: 037402-04-29921(0374020429921)
==> DINH THI ＬUYEN, lueyen94 / 0**8  ==> https://obank.kbstar.com, lueyen94 / t*m*0**8
------------------------------------------------------------------------------------------------------

- [국민은행] KB종합통장-저축예금[루옌]: 장인, 장모 급여 통장 ==>2013.05.08(금) 가입 @@@@@@
1. 계좌번호: 037402-04-279851(03740204279851)
==> DINH THI ＬUYEN, lueyen94 / 0**8  ==> https://obank.kbstar.com, lueyen94 / t*m*0**8
==============================================================================================================

- POST BOX 택배(회원 500원 할인) 예약
http://www.cvsnet.co.kr/_ver2/board/ctod_status_new.jsp?pageNum=3&subNum=1&ssNum=0		==> tamario / 0**8
1. CU 편의점 택배와 연계됨 ==> https://www.bgfcucard.com/member/login.asp ==> tamarr / t*m*0**8
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.27(화) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 --> 도림천 나들이(17시)
 
- 재충전
1. 노트북 셋팅
1) MSI GT683DX-i7 Imperial 노트북 무선 설정, 프로그램 설치
2) DELL Studio XPS 16 Full-HD2 노트북 프로그램 설치
==============================================================================================================

- 노트북 무선 기능 켜기
1. 무선기능 켜기(FN키 누르고 F8(위성 안테나 표시) 누룸
2. MSI MSI GT638DX-i7 노트북(업무용으로 사용하는 노트북) 무선 확인 
 1) Intel® Centrino® Wireless-N 130 ==> http://www.intel.com/p/ko_KR/support/detect/wireless
3. MSI MSI GT638DX-i7 노트북 무선이 연결 안될 때
 1) 장치관리자 > 네트워크 어댑터에서 무선 네트워크 드라이버가 설치되어 있는지 확인
 2) 무선 네트워크 드라이버를 설치하고 재시작하면 무선기능 켜기(FN키 누르고 F8(위성 안테나 표시) 누룸 ==>
	WIFI(01_iptime_TAMA)가 자동으로 보임
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.28(수) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 
 
- 재충전
==============================================================================================================

- 루옌 의류 반품 택배 보내기(착불)
1. 주소: 충북 충주시 수안보면 온천리 64 원지빌라 A동 309호, 이향기(010-4197-3925) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.29(목) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 --> 다오집 방문(20시, 맥주): 장모님 회사 급여 문제 논의
 
- 재충전
==============================================================================================================

- 국민연금 계산
금액						개월수	연수			총금액
1. 납부한 연금보험료 	   	   						20,955,060원
2. 납부한 연금 개월수 			149 		12.42 	   
3. 총 납부할 연금 개월수 		355 		29.58 	
4. 납부할 연금 개월수 			206 		17.17 	
-----------------------------------------------------------------------------------------------

1. 예상연금액(현재가치 기준): 2037 년07월부터 매월 593,200원 (연 7,118,400원) 수령예상  
2. 총 예상가입기간(납부월수) 1999년 04월 ~2032년 06월 (총 355 개월 ) 
3. 총 예상납부보험료 38,835,360 원 
-----------------------------------------------------------------------------------------------

- 4대보험 자동이체 이메일 고지서, 자동이체 신청
1. ☎: 1577-1000
2. 국민연금 동작관악지사(낙성대역): ☎: 02-6934-2076
-----------------------------------------------------------------------------------------------

- 국민연금 납부
전자납부번호 번호: 1003909404544, 부과년월: 2014.04, 납부금액: 91,770원(체납)
전자납부번호 번호: 1003909404544, 부과년월: 2014.05, 납부금액: 89,100원 
==============================================================================================================

- iRODS 테스트베드 구축 분석
http://irods.org/
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2014.05.30(금) 작업 ■■■■■■■■■■■■■■■ 
---> 06:30 ~ 18:00 -->
 
- 재충전
==============================================================================================================

- 장모님 근무지에서 모시기(금산)
1. 주소: 충남 금산군 군북면 가목길 6-2(충남 금산군 군북면 두두리 379-3) --> 사장: 010-3218-8522
---------------------------------------------------------------------------------------------------

- 고속버스 예약 
1. 서울경부 --> 포항: 05.30(금) 06:30, 삼화(일반, 좌석: 1),11,700원
==============================================================================================================

- 장모님 근무지 주소
1. 주소: 충남 금산군 군북면 가목길 6-2번지 --> 사장{김천열) 전화: 011-1705-4345
2. 낙성대동(643번) -> 강남터미널 -> 금산행 -> 금산터미널 -> 택시 -> 군북초교 -> 군북 면사무소 맞은편 
-> 장모님 근무지(깻잎 농장: 옛 중대본부 자리)
3. 장모님 회사(군북면 두두리) -> 택시 -> 인삼랜드 휴게소(매표, 3장) -> 강남터미널 -> 낙성대동(643번) 
> 신림역(4번 출구) -> 관악05 -> 현대 아파트 후문 -> 코사마트  -> 다오집 도착
==============================================================================================================

- 장모님 금산 근무지에서 모시기
05:00 기상
05:10 조식(식빵)
05:30 집출발
06:00 강남 터미널
06:30 서울 출발 ==> 서울경부 --> 포항: 05.30(금) 06:30, 삼화(일반, 좌석: 1),11,700원
09:00 금산터미널 도착
09:10 택시 출발
09:30 금산군 군북면 가목길 6-2 도착 ==> 주소 잘못 되어서 택시 기사가 헤멤
09:40 깻잎 농장 도착(장모님, 다오 엄마 만남)
09:40 깻잎 농장 출발
09:50 인삼랜드 휴게소 도착: 택시비 3만 5천원
10:00 인삼랜드 휴게소 매표(인당 15,400원)
12:00 강남 터미널 도착
12:10 버스(643번)
12:50 신림역(관악05번 마을버스)
13:10 현대 아파트 후문
13:15 다오집 도착
13:30 중식(다오집에서 얻어 먹음)
14:30 귀가(혼자 옴)
24:50 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2014.05.30(토) 작업 ■■■■■■■■■■■■■■■  
---> 06:30 ~ 18:00 --> 

- 주말
08:45 기상
10:00 조식(장모님과 같이 집에서 함)
13:00 낮잠
13:30 취침
14:30 기상
15:00 중식(김밥, 닭강정, 순대 사와서 먹음)
18:00 장모님 다오씨집으로 감(루옌 배웅, 집에서 수종 돌봄)
19:00 석식(닭강정)
24:50 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■