

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.09) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.09.01(일) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
07:30 기상 
08:10 서울대입구역(태훈이형 속초 휴가) 
08:40 대청역(3호선) 
08:45 중동고 
09:30 강남 연합회장기 대회 계회식 
10.00 4:2 패): 전반 20분 부터 교체되어 들어감 
        --> 도곡이 기권(2:0 승): 1승 1패, 승점 3점, 득실 0점으로 4강 탈락 
14:00 번외 게임 --> 도곡(3:2 패) 
15:00 개원:대원(3:0 승)  ==> A조 일원, 개원 4강 진출 
15:30 종료 
16:00 석식(문경세재: 갈비살, 꽃등심, 삼겹살) 
18:00 종료 
19:05 귀가 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.02(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직(오승현 과장과 변경) 

- ChatON 운영 Prj
- buddy 가입불가 분석 건 분석 
1. 8월 28일 발생한 DB query로 소스 분석 방법 숙지 
==============================================================================================================

- ChatON 운영서버 접속정보 조사 
1. 운영서버 접속정보 조사 및 확인 메일 보냄 
==============================================================================================================

- Buddy로 업무 숙지 
1. buddy 문서 분석(2.3 Multi Device Management: WorkFlow, module 산출물 분석) 
==============================================================================================================
  
- java Decompiler(jd-gui-0.3.3.windows) 
http://code.google.com/p/innlab/downloads/detail?name=jd-gui-0.3.3.windows.zip&can=2&q= 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.03(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 소송 보정권고 우편 받음, 새문B 401호에 가서 밤에 시끄럽다고 항의함 

- ChatON 운영 Prj
- buddy 가입불가 분석 건 분석 
1. 8월 28일 발생한 DB query로 소스 분석 방법 숙지(buddycommondao-dbd-dao-v2.7.103-rc08073.jar 파일 디컴파일) 
----------------------------------------------------------------------------------------------------------------------- 

- eclise 에러 
에러 줄: List queryResult = this.jdbcTemplate.query(query, new Object[] { uid, ip, Integer.valueOf(accessType) }, rowMapper); 
Error: The type org.springframework.dao.DataAccessException cannot be resolved. It is indirectly referenced from required .class files   
해결법: RowMapper 선언할 때 spring-jdbc.jar파일만 import할 경우 하위 method인 mapRow 선언시 에러 발생.  
spring-tx.jar가 추가로 필요함 
----------------------------------------------------------------------------------------------------------------------- 

- bug 수정 
/buddy_local_db/src/com/sec/ssm/contact/dao/BuddyDAO.java 파일에서 
(C:\chaton\workspace\buddy_local_db\src\com\sec\ssm\contact\dao\BuddyDAO.java) 
(  
//public boolean insertFollow(String id, String suid) 
public boolean insertFollow(final String id, final String suid) 
{ 
	//Integer rtn = (Integer)this.transactionTemplate.execute(new TransactionCallback(id, suid) 
	Integer rtn = transactionTemplate.execute(new TransactionCallback<Integer>()  
	{ 
	public Integer doInTransaction(TransactionStatus arg0) 
	{ 
		String sql = "insert into specialuserfollower (suid, id, status, rowcreatemsec, rowupdatemsec)  
		values (?,?,'on',unix_msec(),unix_msec()) on duplicate key update status='on', rowupdatemsec=unix_msec()"; 

		Object[] log_args = { sql, id, suid }; 
		BuddyDAO.logger.debug("[Before Executing Query] SQL : insertFollow: '{}'", log_args); 
		//int result = BuddyDAO.this.jdbcTemplate.update(sql, new Object[] { this.val$suid, this.val$id }); 
		int result = BuddyDAO.this.jdbcTemplate.update(sql, new Object[] { suid, id }); 

		return Integer.valueOf(result); 
	} 
	}); 

	return rtn.intValue() > 0; 
} 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.04(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 소송 보정신청서 작성(집에서), 갤럭시 노트3 공개. 새문B 401호에 밤 10시 30분에 시끄럽다고 항의함(2번째) 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.2.1. Register to SSM Server: WorkFlow, module 산출물 분석) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.05(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 소송 보정신청서 우편 발송 

- ChatON 운영 Prj
- SMS GW 신규 deploy 요청 점검 
1. pkr2sm001m, pkr2sm002m  ==>  ssh -p 2022 chaton@14.63.167.99 ()  
==============================================================================================================

- 외주업체 점검 
1. SDS PE(인력 관리 담당) 나와서 (주)오픈타이드, (주)IST 직원들에게 설문지 받고 감 
2. 업무 분장표, 업무 조직도 작성 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.06(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.2.1. Register to SSM Server: WorkFlow, module 산출물 분석) 
==============================================================================================================

- PreProduction 배포시 Service 서버 문제점  
1. 2013년 5월 경에 PreProduction 서버 설치시 Service > PostON 부분에 있는 443 포트(https)를 80 포트(http)로 
변경하여 개발을 했습니다.(https를 사용하려면 비용을 많이 든다고 해당 소스를 수정을 한 것으로 알고 있습니다.)  
그래서 정확한 테스트를 위해서는 443 포트(https)를 열어야 할 것으로 판단됩니다. 

예) 1.4.1. Read PostON List 호출 에러 
1. 기존(443 포트) 
https://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:443/poston/list?buddyid=8210.*637790000 
2. 수정(80 포트) 
http://lb-rue1px-359881617.us-east-1.elb.amazonaws.com:80/poston/list?uid=c2ff99af-10.*637790000 

1.4. PostON Management API 
Read PostON List 
Write PostON 
Delete PostON 
Blind PostON 
Get Blind PostON List 
Read PostON Comment List 
Write PostON comment 
Delete PostON Comment 
==============================================================================================================

- 갤럭시 R 젤리빈 업그레이드 
http://blog.naver.com/PostView.nhn?blogId=wodms0930&logNo=30160974822 
http://blog.naver.com/hodol98?Redirect=Log&logNo=80182936351 
http://blog.naver.com/kmg971125?Redirect=Log&logNo=140181514140 
==============================================================================================================

- 층간 소음 
http://cafe.naver.com/happyparagon/4449 
http://lifeismoney82.tistory.com/117 
http://paranikid.blog.me/80189197580 
==============================================================================================================

- 다문화가정 저축 정보 
1. 우리은행 희망드림 통장, 연 7.5%, 최대 적금 30만원, 총 월 60만원(1년, 아내, 남편) 
2. 기업은행 신서민섬김 통장, 연 7%, 최대 예금 500만(1년, 아내) 
3. 외환은행 10.* 나눔 통장, 연 5.5%, 최대 적금 30만원, 총 월 60만원(1년~3년, 아내, 남편)  
4. 국민은행 KB국민행복적금, 연 7.5%, 최대 적금 50만원, 총 월 50만원(1년, 아내, 남편) ==> 가입함 
--------------------------------------------------------------------------------------------------------------------------

- 필요한 서류  
1. 가족관계증명서, 혼인관계증명서, 신분증 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.09.07(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말  
05:30 기상 
06:30 국민은행 봉천동지점 앞(버스) 
06:30 신구초등학교 
06:40 숏게임(2:1 패) 
07:40 종료 
08:30 귀가 
09:20 집출발 
09:30 진료(태동검사: 모태산부인과): 이건영 원장으로 의사 변경됨  
	==> 태동검사실에서 제대혈 보관 권유(15년 124만원): 현재 36+5일 --> 37주 이후는 언제든지 출산 가능하다고 함 
10.*0 쇼핑(라붐 아울렛) 
11:10 귀가 
12:00 중식 
12:40 낮잠 
18:10 기상 
18:30 석식(포몬스: 쌀국수) 
19:30 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.08(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 패) 
08:00 월례회(회장님이 회원 참여 각성 촉구 ==> 저번주 대회 참석 인원 부족) 
08:30 게임(4:2 승) 
10:30 종료 
11:30 중식(문경세재: 갈비탕): 오고문님이 쏨, 경훈이가 유영혁 감사와 싸워 조기회 안나온다고 했다고 함 
12:50 귀가 
13:10 샤워  
13:40 낮잠 
18:00 기상 
18:40 석식(소고기덮밥(2개), 설렁탕): 포마토 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.09(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- my single에서 OPT 요구 
1. https://www.samsung.net/portalWeb/idefault.jsp에서 OPT 요구 
2. 원인: PC 바이러스 감염 가능성(체크할 것) 
3. 조치: SDS Help 데스크에 전화(☎02-3429-2000 -> 2번, ☎1577-6114[ARS])함 ==> LAN 설정 수정함 
- 네트워크 예외를 위한 웹프락시 설정 
1. 프락시(Proxy) 서버 설정 
[인터넷옵션] → [연결] → [LAN 설정] 
’자동으로 설정 검색(A)’ 체크박스 체크 
’자동 구성 스크립트 사용(S)’ 체크박스 체크 --> 주소(R): http://70.10.5.20/sds.pac 
4. 추가 에러 
  1) CN지역(https://27.*) 접속하면 주소(R): http://70.10.5.20/sds.pac에서 http:/70.*:8080로 강제로 변경됨 
  2) 해결책: [LAN 설정]> 예외 url 추가, DNS 주소가 틀렸다고 함(수정함: 203.*, 203.*) 
 가. 예외 url(이전 꺼로 바뀜): localhost;27.10.*2.168.2* 
 나. 예외 url(수정된 것): *.samsung.net;*.samsungosp.com;account.samsung.com;auth.samsung.com;*.smart-office.co.kr;*
 .sbc-cloud.com;*.samsungcic.com;33.*.*.*;70.*.*.*;spcs*;ebiz*;10.*2.168.2* 
==============================================================================================================

- EU Gluster 추가작업을 긴급하게 진행  
alias  grep fi ==> pew1fi001m 
alias  grep im ==> pew1im001m 
alias  grep gl  ==> pew1gl001m 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.10(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Prj
- W37 정기 배포 문서 점검 
1. 작업절차서, changelist 확인 
- mCloud UCS IO모듈관련이슈 확인 
1. 관련 서버 영향도 확인 
==============================================================================================================

- 가족관계증명서 인터넷발급(무료): 최신 
1. http://efamily.scourt.go.kr ==> 본인 확인을 위한 추가 정보 입력에서 등록기준지를 선택할 것  
 1) 등록기준지조회 > 도로명주소(tab) 
시: 경상북도, 시군구: 포항시 남구 
도로명: 기림로(조회: 클릭) 
건물번호: 지상 138의 빈칸(확인: 클릭) 
2. 등록기준지: [790-901] 경북 포항시 남구 오천읍 기림로 1392번길 138[경북 포항시 남구 진전리 16] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.11(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W37 정기 배포(2조), SAMS 교육(13시), 정병인 과장 라오스 여행감 

- ChatON 운영 Prj
- ChatON_경위서_1차대응 경위서 작성 
1. pue1ms001 AMQ가 다운되어 2일 동안 서비스를 못 했다고 함 
==============================================================================================================

- 포항계 회비 송금 완료 
1. 농협: 352-0489-5410-13, 예금주: 진봉춘 
2. 기간: 2013년 3월 ~ 9월, 회비: 7만원  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.12(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- chaton_elb 조사 
1. Service 서버 chaton_elb 조사 
==============================================================================================================

- W37 정기 배포(2조) US지역 웹챗온 장애 발생 관련 회의(16~18:30, 최인택 책임) 
1. 임정현 과장이 pue1wb001m 서버 배포 후 tomcat이 올라오지 않았는데 pue1wb002m 서버를 배포해서 웹채온 
장애 발생 ==> 김PM 출근해서 장애보고서 작성 지시[대형 사고로 진화됨] 
==============================================================================================================

- ChatON Proj 회식(아이엘포유)  
1) 일시: 2013.09.12(목) 18시 30분 
2) 장소: 서래 갈매기(강남역 12번 출구) 
3) 참석: 김성채 팀장, 조대형 과장, 장성율 과장, 서영우 과장, 이종진 과장 
4) 서래 갈매기(갈매기살), 당구장(22시 49분 종료) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.13(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 보안 교육(PM), 진료(장모님, 김상현 이비인후과 검사) 

- ChatON 운영 Prj
- ChatON 1차 대응 매뉴얼 숙지 
1. 서비스별 1차 대응 매뉴얼 분석 및 숙지 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.09.14(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말  
08:30 기상 
08:50 조식(식빵)  
09:30 집출발(비옴) 
09:40 진료(모태산부인과), 태동검사, 독감 주사) 
==> 빈혈 수치 올라가고 다음주에 진통오면 출산 가능하다고 함(애기 몸무게: 3.2kg) 
10:50 관악 보건소(빈혈약은 출산 후 애기 검사(출산 2주 후) 후 우울증 검사하면 준다고 함(2통)  
11:10 귀가 
12:00 중식 
14:20 삼성 A/S 센터 방문(갤럭시 R 젤리빈으로 업그레이드(속도 빨라짐) --> 어플 재 설치) 
15:00 이발(봉천동 빅맨) 
15:30 귀가 
15:30 낮잠 
19:30 석식 
19:30 귀가 
23:00 취침 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.09.15(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:40 요가(홍성주 회원 아내)  
08:10.* 승) 
10:30 종료 
11:30 중식(문경세재: 갈비탕) 
12:50 귀가 
13:10 샤워(염색) 
13:40 낮잠 
18:00 기상 
18:30 석식(해물탕(소), 대호아구집): 루옌, 장모 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.16(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 셀 중식(시웬: 남선임이 쏨) 

- ChatON 운영 Prj
- Buddy 중복 가입자 확인 
지난 번 account에서 처리했다고 하지만 아무래도 동일 문제가 발생하고 있는 것 같습니다. 
1. Production 서버에서의 작업은 피해주시고 S3에서 로컬로 다운 받아서 로그 파악해주세요. 
   S3에서 Jumphost로 다운 받아 로그 확인은 가능해 보이나 서버에 부하가 갈수 있으니 가능하시다면 로컬로  
   다운받아서 분석진행해주세요  
2. 동일 계정(email id)에 대해서 다른 지역으로 가입된 것 확인 (다른것 탭) 
3. 동일 계정(email id)에 대해서 지역별 가입된 것 확인 (같은것 탭) 
4. "다른것" 탭에 아래 내용은 반드시 추가 확인 
5. 작업 결과 
 1) 전체 작업 건수가 8874 건 ==> 너무 많음(추려서 준다고 함) 
 2) web.log.2013-08-09.gz  ==> 30분 소요 
----------------------------------------------------------------------------------------------------------------------------- 

- Buddy 중복 가입자 확인 
1. 문제점: S3에서 다운 받은 파일이 용량이 너무 커서 열리지가 않음 
==============================================================================================================

- /mnt 사용량 확인 
업무서버명 instance        /mnt 사용량  
bd pcn1bd001m 40% 
bd pcn1bd002m 41% 
==============================================================================================================

- 작명 책 대여(성은동작은 도서관) 
1. (우리 아이)바른 작명법[이정재 저, 한솜] 
2. 좋은 이름 짓는법[정용빈 저, 삶과벗] 
3. 성명학, 바로 이 이름[정담 선사 저, 삼한출판사] 
----------------------------------------------------------------------------------------------------------------------------- 

- 작명 
1) 陳 銖 
陳: 베풀 진, 銖: 저울눈 수 = 무게단위 수 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.17(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy 중복 가입자 확인 
(connect)chatonop@ip-10.*-100:/$ cd /extdisk/bak_logs 
(connect)chatonop@ip-10.*.tgz s3://prd.eu.bd.bkup/bd1/ 
==> S3에서 파일 받기 @@@ 
(connect)chatonop@ip-10.*.log -A90 
==============================================================================================================

- VDI 환경 설정 수정 
1. 모란씨 VDI에서 jumphost, CN 연결 확인 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.18(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 추석 연휴 

- 추석 연휴  
07:30 기상 
07:40 조식(식빵) 
08:10 집출발 
09:20 서울대입구역 
11:30 허우씨 부모님집(장인, 허우 아버님 지인(다오, 신림동) 만남) 
11:50 허우씨집(세라 용돈 만원 줌, 닭고기 구입(10마리: 5만원)) 
12:00 허우씨집 출발(마을 버스 --> 의정부역 --> 신도림역 --> 서울대입구역) 
14:00 귀가 
14:10 중식 
15:00 허우 아버님 지인(신림동) 사위 찾아 옴  
15:30 낮잠 
18:00 501호 주인이 햄세트 선물함(송편 선물 답례) 
19:30 석식  
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.19(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 추석 

- 추석  
07:30 기상 
07:40 조식(식빵)  
08:10 집출발 
09:20 강남 고속버스터미널(부모님이 보낸 음식 찾아옴) 
	==> 강남고속버스 터미널 수하물센터( http://www.exterminal.co.kr/baggage/baggage01.asp?pageNum=3) 
10:30 귀가 
14:10 중식 
15:00 허우 아버님 지인(다오, 신림동), 손주 놀러 옴  
15:30 낮잠 
19:30 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.20(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 추석 연휴 

- 추석 연휴 
07:30 기상 
07:40 조식(식빵)   
11:00 마이, 마이 아버지 놀러 옴 
12:00 중식 
13:30 낮잠 
19:30 석식 
23:00 취침 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.09.21(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말 
07:30 기상 
07:40 조식(식빵)   
11:00 마이, 마이 아버지 놀러 옴 
12:00 중식 
13:30 낮잠 
17:00 선불폰 충전(010.*)[2만원]: 장인 
18:00 교통카드(T머니), 충전[2만 2천 5백원]: 장인 
19:30 석식(해물탕, 부부신도해물탕): 루옌, 장인, 장모 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.22(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:15 기상 
06:30 국민은행 봉천동지점 앞(태훈이형 차) 
07:00 신구초등학교 
08:00 게임(5:4 패) 
10:30 종료 
11:30 중식(문경세재: 갈비탕): 회비에서 쏨 ==> 종록이형 돕기 조기회에서 100만원 모금 
13:00 귀가 
13:10 샤워 
13:20  장인어른 택시태워 보냄 
        1. 통합콜센터 ☎02)722-5000에 전화해서 콜 택시 신청(다오 (남편: 010-2691-3881) 장인 3만원 냄) 
        2. 택시 기사(010.*15-3881)가 동두천 공장까지 미터기로 가자고 함 
        3. 1시간 후 택시 가사가 요금 5만 2천원 나왔다고 함 ==> 요금 더 달라고 해서 5만 5천원으로 합의 
13:40 낮잠 
18:00 기상 
18:40 석식 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.23(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy 중복 가입자 확인 
1. 02. 다른 지역 작업 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.24(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 애기 출산 
03:00 기상 
03:30 모태신부인과 도착(가족분만실) 
03:40 태동검사 
10:00 출산 시작(옆에서 분만 도움) 
10:32 아들 출산(3.72kg, 53cm): 탯줄 끊기 
11:00 입원실(307호)로 옮김(1인실: 10만원) 
12:00 중식(불고기덮밥, 주먹밥: 포마토): 장모  
12:30 루옌 한국어 선생님 방문 
13:30 애기 돌봄 
19:30 석식(불고기덮밥: 포마토): 장모님에게 사다 드림 
21:40 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.25(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 스튜디오 엔콕에서 애기 사진 촬영하고 감 

- ChatON 운영 Prj
- Buddy 중복 가입자 확인 
1. 총 점검 
==============================================================================================================

- 1차대응 매뉴얼 재검토 
1. Service 서버에서 5.3  Service 서버의 Cassandra 관련 Time Out 발생 부분 삭제 요망 
==============================================================================================================

- 01. 작은 지역 
중복가입자오류(20130923[77, 1339135701@**.com] ==> NO ==> OK 
중복가입자오류(20130923[2264, ddeans@*.ca] ==> OK 
중복가입자오류(20130923[2925, flashmojo@*l.com]  ==> OK ==> OK 
중복가입자오류(20130923[3594, info@*.nl] ==> OK 
중복가입자오류(20130923[7628, tariq.aziz@*.com] ==> OK 
- 02. 다른 지역 
중복가입자오류(20130923[97, akidalover@*.com] ==> OK 
중복가입자오류(20130923[205, liucot@*.com] ==> OK 
중복가입자오류(20130923[257, satabdi.itsme@*l.com] ==> OK 
==============================================================================================================

- 귀체온계 구입 
1. 브라운 IRT-4520, 가격: 53,400원 
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A707725041&cc=AA02&keyword=%ba%ea%b6%f3%bf%ee%20BET-1000&scoredtype=0&frm2=through&acode=SRP_SV_0301  
==============================================================================================================

- 상하수도 요금 납부[2013.09.25] 
1. 기간: 2013년 09월분 상.하수도 요금(06.23~08.22) 
2. 요금: 31,250원 
3. 납부 방법: 서울시 S-Tax[스마트폰으로 결제])  
4. 고객 정보 
 1) 고객번호: 3696446.*인 
5. 참조: 아리수(https://i121.seoul.go.kr/egoji/jsp/front/member/login.jsp) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.26(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 애기 출산2 
07:00 기상 
07:30 조식(송편) 
08:00 모태신부인과 도착 
09:00 307호 철수 
09:30 퇴원 정산(입원료, 주사료, 초음파 진단료): 387,700원 
10:00 BCG(결핵예방접종), 선천성 대사 이상검사 59종: 157,800원[모태소아과] 
10:20 택시(모태산부인과 -> 새문B) 
11:30 쇼핑[아폴로 보온병, HAP794 듀얼락 물병 2.6L] 
12:30 대규 부부 방문(내복 선물 받음, 외장하드 돌려 받음) 
13:30 중식 
15:30 낮잠 
17:30 짱집에 애기 침대 가지러 감(자전거로 2번, 대우 푸르지오 201호 1806호) 
19:30 석식 
19:40 쇼핑[디펜드 일자형 30매(성인 기저귀), 탯줄 소독용품, 꿀] 
20:30 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.27(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 산모 도우미 시작 

- ChatON 운영 Prj
- W39 정기 배포 확인 
1. W39_작업계획서(W39_작업계획서_130927.v1.0.xls) 내용 확인 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.09.28(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말 
06:10 기상 
06:15 조식 
06:30 봉원중학교(처음 감, 회비 2만원, 토욜만 나갈 예정) 
06:50 숏게임(4:1 승) 
07:55 종료 
08:10 귀가 
09:40 모태 소아과(눈꼽 끼여서 감 ==> 눈물 딱아주면 괜찮다고 함): 사람 많음(50명 대기) 
11:10 귀가 
11:30 프엉, 란 놀러 옴 
13:30 중식 
14:30 집출발 
15:10 강남터미널 
15:30 어머니 포항에서 도착 
16:20 귀가  
19:00 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.29(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:15 기상 
06:45 국민은행 봉천동지점 앞(태훈이형 차) 
07:20 신구초등학교(비옴) 
08:30 게임(3:0 승): 프랜즈 연예인 축구단 
08:30 게임(1:1 무) 
08:30 게임(3:0 패) 
11:30 종료 
11:50 중식(문경세재: 갈비탕): 회비에서 쏨, 득남 축하금(10만원, 한상봉 회장님) 
13:30 귀가  
14:40 짱집(관악 푸르지오 201동 1806호): 애기 침대 나사 받으려감 
18:00 귀가  
18:00 애기 침대 조립(성공)  
18:40 석식 
19:10 빨랫줄, 매트 조립 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.09.30(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 서영우 과장(DBA) 철수 

- ChatON 운영 Prj
- log4j 확인 
$ cd /home/chaton/buddy/log 
$ ll -S web.log.* -h    ==> web.log 파일들을 내림차순 정렬  @@@ 

$ cat /home/chaton/buddy/conf/ssm-server.logging.properties ==> logging 레벨 설정 확인 @@@ 
#log4j.rootCategory=INFO, stdout, rolling   --> 원 소스 
#log4j.rootCategory=ERROR, stdout, rolling 

$ cd /home/chaton/buddy/tomcat/webapps/ROOT/WEB-INF/lib ==> log4j 설치 위치 @@@ 
log4j-1.2.14.jar 

$ cd /home/chaton/buddy/tomcat/webapps/ROOT/WEB-INF/classes ==> log4j xml @@@ 
log4j.xml 
==============================================================================================================

- 프로젝트 외주인력 대상 온라인 보안교육 실시 
1. 보안과 함께하는 프로젝트 수행(온라인과정, 2시간 과정) 
2. 삼성SDS파트너사: http://secupartner.e-campus.co.kr, tamario / ss태만99!@, ssil4u2011!@(2순위) 
==============================================================================================================

- 신사조기회 회비 납부(2013년) 
1. 2013.09.30(월) 송금: 진태만(7~12월): 12만원 ==> 납부 완료 
2. 신한은행 110.*2870, 예금주: 서정홍 
==============================================================================================================

- 아이핀 발급(i-pin) 
발급기관: 한국신용평가정보(https://ipin.siren24.com/i-PIN/jsp/ipin2_j21.jsp) 
tamario/ssp***8*1@ --> tamario/*fndPs12*@ 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■