

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.11) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.11.01(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W44 정기 배포(사전 작업)  

- ChatON 운영 Proj
- W44 정기 배포 준비  
1. 서버 change : 17건, DB change : 3건, Config change : 4건  
2. 담당 서버: bd, ob, os ==> 총 30개 서버  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W44 정기 배포(본 작업), 나눔 모임  

- ChatON 운영 Proj
- W44 정기 배포  
18:00 퇴근  
18:30 귀가  
18:40 석식  
19:00 야구 시청(KS 7차전, 삼성 7:3 두산 ==> 4승 3패로 삼성 한국시리스 3연속 우승)  
22:00 집출발(여행 배낭 소지)  
22:30 출근(23시까지 집합하라고 함)  
22:40 배포 사전 준비  
00:00 준비 ==> 2013.11.02(토) W44 정기 배포(본 작업)
00:02 시작[JP(GLD)]  
00:30 US지역 시작[US -> EU -> SG -> KR -> CN]  
01:50 US지역 종료 ==> US지역 공격 의심 트래픽이 들어와 배포 지연됨(wf, ws, wb  서버)  
02:10 EU지역 시작(image 서버 배포 때문에 늦어짐)  
03:18 SG지역 시작  
05:45 배포 종료  
06:00 상황 종료  
05:45 W44 디플로이 사후 점검 리스트 작성   
06:00 퇴근  
06:10 강남역  
06:30 사당역(태훈이형 차 타고 축구하러 감)  
07:00 게임(3:2 승): 2골 넣음  
08:00 종료  
08:30 귀가  
08:40 석식(라면)  
08:50 집출발  
09:00 주유소 화장실(설사)  
09:35 643번 버스탐  
10:05 강남터미널도착  
10:20 서울 출발(금호고속(일반, 만 7천원), 5번 좌석)  
13:20 금강 휴게소  
14:30 서대구 고속터미널(일남 전화 안 받아 열받음)  
15:00 동대구 고속터미널 도착  
15:10 일남차 탐  
15:20 광석이 만남(북대구 서변동)  
15:30 대구 출발  
16:30 해인사 주차장(6명: 2만 6천원)  
16:40 상환, 태용, 현용 만남(부산에서 한 차로 옴)  
17:00 해인사 관람  
17:50 동동주(3만 3천원 나옴)  
18:00 해인사 출발  
19:20 에이치플러스 모델 도착(예약금 6만원 돌려 받음)  
19:50 석식(유성가든식당): 상환, 태용, 현용, 일남, 광석, 태만 ==> 총 6명  
22:00 종료  
22:20 술자리(에이치플러스 모델) ==> 내년 모임: 상환이 봄 결혼식(4~5월 예상)때 부산에서 하기로 함  
01:20 종료  
01:30 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- 나눔 모임2  
08:30 기상  
08:40 조식(컵라면)  
09:20 에이치플러스 모델 출발  
09:30 황매산(입장료 6천원)  
11:00 합천댐 관람  
11:30 중식(메기탕, 황태찜, 원조황태촌)  
13:30 종료  
13:40 합천 출발  
15:00 대구 보훈병원 도착  
16:00 어머니, 작은 아버지, 판섭 고모 도착  
16:20 문상(7촌 할아버지[병오 아제 부] 별세, 부주 10만원)  
16:30 석식(장례식장)  
16:40 종욱 아제네 도착  
17:00 종료  
18:00 동대구역  
18:14 서울행(입석: 36,400원)  
20:00 서울역 도착  
20:20 501번 버스  
20:50 귀가  
21:20 TV 시청(개그콘서트)  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- 관악산 산행(루옌)  
09:00 기상  
09:20 조식(식빵)  
12:00 집출발  
12:30 동진부페(거부 -> 평일 예약 안하면 안됨)  
13:00 중식(부대찌게, 900 통술집): 루옌  
14:00 관악산 입구  
16:00 종료  
16:20 501번 버스  
16:40 귀가  
19:00 석식(집)  
21:30 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Proj
- EV 테스트  
==============================================================================================================

- 안드로이드 개발  
0. 관악구통합도서관: http://lib.gwanak.go.kr/menu/mypage/sub03.php ==> tamario/s*p**8**1  
1. 서적  
 1) 안드로이드 프로그래밍 정복. 1(한빛미디어  김상형 저  2013.04.01)  
 2) Do it 안드로이드 앱 프로그래밍(이지스퍼블리싱  정재곤 저  2013.03.11)  
http://147.46.109.56:9090/board/board-read.do?boardId=notice&boardNo=132876381857148&command=READ&page=1&categoryId=-1  
http://www.android-town.org
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Proj
- EV 테스트  
==============================================================================================================

1. [육아정보] 생후 1개월 아기 돌보기 Tip   
http://misomom.kr/gnuboard4/bbs/board.php?bo_table=0504&wr_id=18  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W44 정기 배포[사후 작업: sm 서버 배포, config 수정(10개 서버)]  

- ChatON 운영 Proj
- EV 테스트
==============================================================================================================

- 노트북 구입 고려 ==> 2013.11.07(목) 기준  
01. MSI CX70-2OD Arion (1TB + SSD 120GB), 가격: 1,209,000원  
코어i7-4세대 / i7-4702MQ (2.2GHz) / 43.94cm (17.3인치) / 1920x1080 / 1TB / 8GB / DDR3  
http://prod.danawa.com/info/?pcode=2132321&cate1=860&cate2=869&cate3=12734&cate4=0  
-------------------------------------------------------------------------------------------------------  

02. MSI CX70-i5 Irish (SSD 250GB), 가격: 993,000원  
코어i5-3세대 / i5-3230M (2.6GHzz) / 43.94cm (17.3인치) / 1920x1080 / 250GB (SSD) / 8GB / DDR3  
http://prod.danawa.com/info/?pcode=2132321&cate1=860&cate2=869&cate3=12734&cate4=0   
-------------------------------------------------------------------------------------------------------  

11. MSI GS70-i7 Stealth (1TB + mSATA 128GB), 가격: 1,803,000원  
코어i7-4세대 / i7-4700HQ (2.4GHz) / LED백라이트 / 눈부심방지 / 43.94cm (17.3인치) / 1920x1080 / 1TB / 16GB / DDR3   
http://prod.danawa.com/info/?pcode=2181612&cate1=860&cate2=869&cate3=12734&cate4=0  
-------------------------------------------------------------------------------------------------------  

12. MSI GS70-i7 Stealth (1TB + mSATA 256GB), 가격: 2,056,000원  
코어i7-4세대 / i7-4700HQ (2.4GHz) / LED백라이트 / 눈부심방지 / 43.94cm (17.3인치) / 1920x1080 / 1TB / 16GB / DDR3   
http://prod.danawa.com/info/?pcode=2181627&cate1=860&cate2=869&cate3=12734&cate4=0   
==============================================================================================================

- Dell 노트북에 SSD 설치(집 노트북) ==> 2012.11.03(토)  
1. SSD로 변경: 삼성전자 830 Series 노트북 패키지(64GB, MZ-7PC256N/KR) 설치(기존 히타치 500GB 하드를 교체)  
2. 윈도우 7 Professional K 64 Bit 설치  
==============================================================================================================

- 고속버스 예약[2013.11.07(목)]  
1. 서울경부 --> 포항: 2013.11.16[토] 17:30, 천일(일반, 좌석: 5), 21,400원  ==> 예약  
2. 포항 --> 서울경부: 2013.11.17[일] 17:00, 동양(일반, 좌석: 5), 21,400원  ==> 예약  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> Gluster 교육(미림B 5-3, 15시): 조순용 선임(MSC)  

- ChatON 운영 Proj
- EV 테스트
==============================================================================================================

- 안드로이드 환경 설정  
1. http://www.oracle.com > java SE D Kit 7 ==> jdk17  
--------------------------------------------------------------------  

- Eclipse 설정  
00. Eclipse Standard 4.3.1, 199 MB ==> 최신 버전  
01. eclipse_ChatON(indigo)  ==> C:\chaton\eclipse-3.7.2\eclipse.exe  
02. eclipse _EV(JUNO) ==> C:\eclipse\eclipse.exe --> eclipse-jee-juno-SR1-win32.zip    
==============================================================================================================

- ChatON 운영 Pro PM 교체  
1. 김원기 수석에서 이길형 수석(챗온 구조 개선팀)으로 교체  
==============================================================================================================

- BK월드 월트디즈니 WDH-151(가습기), 가격: 33,900원  
http://shopping.naver.com/detail/detail.nhn?nv_mid=4093313227&cat_id=40002447&frm=NVSCPRO&query=%EA%B0%80%EC%8A%B5%EA%B8%B0  
- LG 전자 LG전자 가습기 H-68HSW 스티머(가습기), 가격: 106,390원  
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A819715283  
==============================================================================================================

- 쌀 구입  
[다시농협]생명의 땅 나주의 향기를 가득 담은 나주쌀 20kg(2013년 햅쌀)[네이버체크아웃], 가격: 39,900원  
http://shop.naver.com/hyundaihmall/products/177553033?NaPm=ct%3Dhnqm2io8%7Cci%3D7a3ab63cf38b455ca5cde9
755e63eec71d4c8258%7Ctr%3Dslsl%7Csn%3D210861%7Cic%3D%7Chk%3Db9fee1e36f5768abd3fbd28fd5bc38ff9bd92d97  
==============================================================================================================

- 방안 습도  
1. 가정집 적정습도는 50~65%  
2. 우리나라는 일년중 대략 10월 부터 3월 까지는 건조 하기 때문에 가습기를 사용 해야 합니다. 가습기물은   
정수된 물로 해주어야 호흡기에 좋구요, 가습은 대략 30-40%로 맞추어 놓으면 자동으로 유지 됩니다. 가습기를   
쓸 때는 더욱 환기를 자주 해 주어야 합니다. 습기가 충분하면 침대 등 방안에 미생물이 번식하기 쉽거든요.   
가습기 청소는 자주 해 주어야 합니다. 윗분 말씀대로 빨래를 널어 놓거나 수족관 을 설치하는 것도 좋은 방법입니다.   
==============================================================================================================

- 인호진 과장 결혼(청량리역, 14:30)  
1. 일시: 11월 23일(토) 14:30  
2. 장소: 파티움 앨리스 2층(서울시 동대문구 용두동 26-14(2호선 용두역 3번 출구)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- 주말  
05:45 기상  
06:00 태훈이형 차(늦게 일어남)  
06:20 신구초등학교(병규형한테 작전판 내려 주고 옴)  
06:40 뚝섬 운동장(태훈이형 직장팀)  
07:10 게임1(1:1) 무  
08:00 게임2(2:2) 무  
09:00 게임3(1:0) 패  
09:40 종료  
10:00 중식(삼겹살, 태훈이형 직장팀에서 쏨 )  
10:40 종료  
11:30 귀가  
12:00 낮잠  
14:00 기상  
14:10 책 대여 반납 ==> 반납: "Hello! 아빠육아" 외 2권, 대여: "안드로이드 프로그래밍 정복. 1"  
14:30 집출발  
16:00 남대문시장(루엔 코트, 아기옷 구입) ==> 비 옴   
17:00 석식(왕 돈가스: 명동점)  
18:00 명동(TOP TEN: 루엔 코트 구입)  
19:00 2013 서울 등 축제(청계천)  
19:30 종료  
20:10 귀가  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- 주말2  
08:00 기상(피곤해서 축구하러 못 감)  
08:20 조식(호떡)  
11:00 장보기(루옌, 장모, 어머니 내복 구입): 봉천중앙시장  
11:40 귀가  
13:00 중식  
14:00 아기 돌보기(루옌, 장모님 외출 ==> 응우엔[호치민시 고향] 어머니 공장 견학)  
16:00 아기 분유 먹이기, 기저귀(바지) 갈기  
18:50 루옌, 장모님 귀가  
19:10 이발  
19:50 석식  
22:00 염색(루옌)  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- ChatON 운영 Proj
- EV 테스트
==============================================================================================================

- 여성용 오리털 잠바(장모님)  
1. 아식스 121244851-25 여성용 덕다운 오리털 자켓, 가격: 89,760원  
http://www.istyle24.com/Display/ProductDetail.aspx?ProductNo=4867948&cid=linkprice  
- 여성용 장갑(장모님, 루옌)  
1. 파코라반 여성 가죽장갑 PW-3118, 가격: 18,810원  
http://prod.danawa.com/info/?pcode=1862976&cate1=1824&cate2=15252&cate3=15286&cate4=&keyword=%BF%A9%BC%BA%BF%EB+%C0%E5%B0%A9  
2. 크리스챤리봇 여성용 양가죽장갑 CRW111, 가격: 18,910원  
http://prod.danawa.com/info/?pcode=1785688&cate1=1824&cate2=15252&cate3=15286&cate4=&keyword=%BF%A9%BC%BA%BF%EB+%C0%E5%B0%A9  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 당직, 새문빌라 대문 도어락 밧데리 교체(4개)  

- ChatON 운영 Proj
- 웹 챗온 공격의심에 따른 특정 계정에 대한 행동 확인  
1. 10월 4일 ~ 6일간 발생했던 웹 챗온 공격 의심에 따른 특정 계정에 대한 행동 확인  

2. s3에서 log 파일 다운 ==> service(pue1sv001 번 서버)  
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ cd /home/chatonop/war/sv    
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ s3cmd -c  ~/.plog.s3cfg/plog.ue1.s3cfg -f 
get s3://chaton-ue1-logs/prd/sv/pue1sv001/web.log.2013-10-05.gz /extdisk/bak_logs/sv_log/pue1sv001  
==> 1. S3 데이타를 JumpHost로 가져오기(sv 서버) @@@  
s3://chaton-ue1-logs/prd/sv/pue1sv001/web.log.2013-10-04.gz -> /extdisk/bak_logs/sv_log/pue1sv001/web.log.2013-10-04.gz  [1 of 1]  
 54040656 of 54040656   100% in   28s  1855.70 kB/s  done  

(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ cd /extdisk/bak_logs/sv_log/pue1sv001
==> JumpHost 서버에서 확인 @@@  
-rw-r--r-- 1 chatonop chatonop 54040656 2013-11-12 01:31 web.log.2013-10-04.gz  

(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ gzip -d web.log.2013-10-05.gz ==> 2. gzip 압축풀기 @@@  

(connect)chatonop@ip-10-132-84-100:/extdisk/bak_logs/sv_log/pue1sv001$ grep -A3 -B3 -e
'59892b41-99c5-4df9-9b62-64dfd9325f53' -e '25e47e54-4736-46f9-b74c-f433c107e22d'  web.log.2013-10-04  
==> uid 조회('59892b41-99c5-4df9-9b62-64dfd9325f53' 또는 '25e47e54-4736-46f9-b74c-f433c107e22d' 조회) @@@   

(connect)chatonop@ip-10-132-84-100:/extdisk/bak_logs/sv_log/pue1sv001$ grep -A3 -B3 -e
'59892b41-99c5-4df9-9b62-64dfd9325f53' -e '25e47e54-4736-46f9-b74c-f433c107e22d'   
web.log.2013-10-04 > pue1sv001_2013-10-04.txt ==> uid 조회 후 pue1sv001_2013-10-04.txt 파일 생성 @@@   
==============================================================================================================

- W 46 ChatON 긴급 업그레이드  
1. 점심시간에 wf 배포  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 임호수 딸 돌잔치 축하금(10만원) 나중에 만나서 줄 것(호수랑 통화함)  

- ChatON 운영 Proj
- ChatON 구조개선을 위한 마이그레이션 분석  
==============================================================================================================

- 갤S3 중고폰 구입 ==> 2013.11.13(수)  
1. LGT 갤S3 LTE 화이트 32G 17만, 총가격: 177,600원  
http://cafe.naver.com/joonggonara/186186098  
-------------------------------------------------------------------------------------------------------  

- 유니크로 안전결제  ==> 수수료: 7,600원  
https://www.unicro.co.kr ==> tamario/l*fn**1*!*  
==============================================================================================================

- Java SE Development Kit 7 Downloads  
http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html  
32bit: jdk-7u45-windows-i586.exe  
64bit: jdk-7u45-windows-x64.exe  
-----------------------------------------------------------------------------------------------------  

- java 버전 확인   
C:\Users\TAMA> java -version  
java version "1.7.0_45"  
Java(TM) SE Runtime Environment (build 1.7.0_45-b18)  
Java HotSpot(TM) Client VM (build 24.45-b08, mixed mode, sharing)  
==> C:\Program Files\Java\jdk1.7.0_45\bin\java.exe  
-----------------------------------------------------------------------------------------------------  

- Android 버전  
Android 4.4  ==> 킷캣(KitKat)  
Android 4.1 ~ 4.3  ==> 젤리빈(JellyBean)  
Android 4.0  ==> Ice Cream Sandwich  
Android 2.2  ==> 프로요(Froyo)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- ChatON 운영 Proj
- ChatON 구조개선을 위한 마이그레이션 분석  
==============================================================================================================

- Android 설치  
1. JDK 설치  
 1) JDK 1.7 설치 환경변수 설정 ==> C:\Program Files\Java\jdk1.7.0_45   
http://www.oracle.com/technetwork/java/javase/downloads/jdk7-downloads-1880260.html  
Windows x64(64bit) --> jdk-7u45-windows-x64.exe  ==>  설치  
Windows x86(32bit) --> jdk-7u45-windows-i586.exe  
 2) JRE 설치 ==> Default C\Program Files\Java\jre7\   
 3) 환경변수 설정(제어판\모든 제어판 항목\시스템\고급 시스템 환경 > 고급 > 환경변수(N) > 시스템 변수(S))   
 가. JAVA_HOME 설정  
변수 이름: JAVA_HOME  
변수 값: C:\Program Files\Java\jdk1.7.0_45\bin;  
 나. Path 설정  
C:\Program Files\Intel\WiFi\bin\;.......C:\Program Files\Java\jdk.1.7.0_45\bin;C:\Program Files\Java\jre7\bin;  
JDK: C:\Program Files\Java\jdk.1.7.0_45\bin;  
JRE: C:\Program Files\Java\jre7\bin;  
 다. android-sdks 등록(path 환경변수에 등록)   
C:\android\android-sdks\tools\  
 라. 확인  
C:\Users\TAMA> java -version  
java version "1.7.0_45"  
Java(TM) SE Runtime Environment (build 1.7.0_45-b18)  
Java HotSpot(TM) Client VM (build 24.45-b08, mixed mode, sharing)  

C:\Users\TAMA> javac  
Usage: javac <options> <source files>  
where possible options include:  
  -g                         Generate all debugging info  
  -g:none                    Generate no debugging info  
------------------------------------------------------------------------------------------------------------------------  

2. 이클립스(eclipse) 설치 및 셋팅  
 1) Eclipse IDE for Java EE Developers, 247MB  ==> Eclipse Kepler(http://www.eclipse.org/downloads/)   
------------------------------------------------------------------------------------------------------------------------  

3. SDK Tool 다운로드 및 셋팅  
 1) 이클립스에서 Help -> Install New Software > 우측 상단에 Add 버튼을 누르고 아래와 같이 작성하고 OK 누름  
가. Add Repository  
Name : ADT  
Location : https://dl-ssl.google.com/android/eclipse  
나. AVD(Create new Android Virtual Device) 설정(http://hyeonstorage.tistory.com/130 참조)  
1. AVD Name: Android4.4  
2. Device: Nexus S  
3. Target:  
4. SD Card: 128  
다. eclipse 줄번호 설정  
1. Window[상단 메뉴] > Preferences[새창] 에서, General > Editors > Text Editors에서 "Show line numbers"를 체크  
라. eclipse font 설정  
1. Window[상단 메뉴] > Preferences[새창] 에서, General > Appearence > Color and Fonf > Basic  
> Tet Font ==> Edit > 글꼴[새창]: "돋움", "10"(설정)  
마. Window > Preferences[새창] 에서, Run/Debug > Console(클릭): Background color: 배경색(녹색: 86, 78, 194)  
------------------------------------------------------------------------------------------------------------------------  

- SDK Manager 다운로드 에러  
1. SDK Manager 에서  
 1) Packages[새창] > Android4.4 > SDK Platform: 체크,   
> ARM EABI v7a System Image: 체크 ==> Install packages(클릭): 다운로드 안됨  
 2) 에러 내용: Download interrupted: Connection to https://dl-ssl.google.com refused  
 Failed to fetch URL https://dl-ssl.google.com/android/repository/addons_list-2.xml, reason: 
 Connection to https://dl-ssl.google.com refused  
 3) 보안 프로토콜 문제로 접속이 되지 않을 경우 이 항목을 체크해 준다.    
  SDK Manager 에서 Tools[Tab] > Options... > Force https:// ... source to be fetched using http://...   
 ==> http://sulac.egloos.com/5619119  
==============================================================================================================

- Android 버전  
Android 4.4  ==> 킷캣(KitKat)  
Android 4.1 ~ 4.3  ==> 젤리빈(JellyBean)  
Android 4.0  ==> Ice Cream Sandwich  
Android 2.2  ==> 프로요(Froyo)  
==============================================================================================================

- LG 에어워셔  
1. LG 에어워셔 LAW-S048AW, 가격: 301,070원  
http://prod.danawa.com/info/?pcode=2279312  
2. LG 에어워셔 LAW-A048AS, 가격: 330,000원  
http://prod.danawa.com/info/?pcode=2237256  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v3 2_20131111.doc  
==============================================================================================================

- SW 라이센스 부문 모니터링 자체 점검 및 결과 제출  
1. ERWin 재설치 오류 및 삭제시 오류(http://skql.tistory.com/492)  
ERwin을 재설치하는 경우 특정 파일(mmopn32.exe)에서 에러가 발생하면서 실행이 되지 않는다.   
제네시스 사이트에서 확인한 바에 따르면 프로그램의 빌드차이와 같은 이유로 발생한다고 한다.   
번거롭더라도 앞서 설치되었던 ERwin에 대한 정보를 모두 제거한 후에 다시 설치하여야 한다.  
1. 프로그램을 삭제한다.  
    [제어판 > 프로그램 추가/제거]  
2. 해당 폴더를 삭제한다.  
    [Program Files > CA], [Program Files > CA_LIC]  
    - CA_LIC 폴더가 특정 파일의 공유 및 사용으로 삭제가 되지 않는 경우 해당 파일을 사용하는 프로세스를   
      종료한다. [작업관리자 > 프로세스 > LogWatNT.exe]  
3. 관련 파일을 삭제한다.  
   시스템폴더(Windows)에 있는 Erwin*.*, RTBPreferences.pref, SCAPI.ini   
4. 서비스를 종료한다.  
   제어판 > 관리도구 > 서비스 > CA_LIC*  
5. 레지스트리를 정리한다.  
   검색을 통해서 관련 키워드로 설정된 값을 삭제한다.  
   Erwin, AllFusion, CA_LIC  
6. 리부팅한다.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- 주말  
05:45 기상  
06:00 태훈이형 차(어제 태훈형 갑을아파트 32평 전세(3억)로 이사감[병규형이 포장이사함])  
06:20 신구초등학교(일찍 도착해서 태훈형이랑 편의점에서 빵, 두유 먹음[내가 쏨])  
07:10 게임1(2:0) 패  
08:00 종료  
08:30 귀가  
08:50 조식(식빵)  
09:30 집 출발(수종, 루옌, 장모님)  
09:40 영기형 차(지나가는 길에 만남)  
10:00 엔콕(서울시 관악구 인헌동 1659-2 청동빌딩 8층(낙성대역 4번 출구) 도착  
10:30 수종 50일 촬영(15만원)  
11:20 수종 50일 촬영 비용 설명(돌잔치 촬영: 59만원[44만원에 해준다고 함])  
11:20 남성 코트(5만 5천원, 내 것)  
12:00 여성 코트(12만원, 장모님 것) ==> 총 158,900(목도리 포함)  
12:20 장갑, 모자(3만원, 장모님 것)  
13:00 중식(갈비탕, 알탕, 만두국, 주먹밥 2개): 포마토  
13:50 귀가  
16:00 집출발  
16:50 강남 터미널(참치 주먹밥, 두유)  
17:30 서울 출발  
22:10 포항 도착(4시간 40분 걸림)  
22:30 101번 버스  
23:00 포항집 도착  
23:20 석식  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- 묘사  
08:00 기상  
09:00 묘사 준비(사과, 배 깍기)    
12:00 묘사(작은 아버지 부부(대규), 중욱(중협) 아제, 종근 아제, 병일 아제 부부(아들 2명), 판섭 고모)  
       ==> 병일 아제가 하기스 기저귀(2단계)와 물티슈 선물, 아들에게 1만원씩 용돈 줌  
       ==> 시사 조문 쓰기 배우기[작은 아버지], 묘사 비용(결혼 집당 5만원 냄)  
15:00 종료  
16:10 포항집 출발(베낭[사과, 떡, 김, 미역, 기저귀])  
16:45 포항고속터미널 도착(101번 버스: 12만 걸림)  
17:00 포항 출발  
22:10 강남터미널 도착(5시간 10분 걸림)  
22:20 버스(643번)  
23:00 귀가  
01:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W47 정기 배포  

- ChatON 운영 Proj
- W47 정기 배포 준비  
1. 서버 change: 5건  
2. 서버 통합(1. WB+OB, 2. WS+OS, 3. CS+CO, 4. SA+MC, 5. WF+LM)  
 1) WB+OB 통합 확인  
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ pue1wb001  
[chaton@pue1ws#1:~]$ cd wb ==> wb 확인 @@@  
[chaton@pue1ws#1:~]$ cd ob ==> ob 확인 @@@  
 2) WS+OS 통합 확인  
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ pue1ws001  
[chaton@pue1ws#1:~]$ cd ws ==> ws 확인 @@@  
[chaton@pue1ws#1:~]$ cd os ==> os 확인 @@@  
==============================================================================================================

- 선불폰 ==> 기본료: 월 6,050원  
1. 선불폰 프리폰 http://www.freephonephone.co.kr/front/php/category.php?cate_no=29  
2. 외국인선불폰 프리폰월드 http://www.freephoneworld.co.kr/front/php/product.php?product_no=580&main_cate_no=1&display_group=2  
==> 23,000원(SKT선불폰충전: 2만, 충전기)     
3. SKmvno 외국인선불폰 http://skmvno.com/front/php/product.php?product_no=239&main_cate_no=43&display_group=1   
==> 32,000원  
4. 우체국 알뜰폰 요금제 종류(선불폰): http://10story.tistory.com/3402  
==============================================================================================================

- 아기 예방 접종  
A. 필수  
1. B형 간염 예방 접종(2차) ==> 서울 김정아 소아과[2013.10.26(토)]  
2. DPT[디프테리아(diphtheria), 백일해(pertussis), 파상풍(tetanus)](1차) ==>   
3. 뇌수막염(PRP-OMP)(1차) ==>   
4. 소아마비(폴리오)(1차) ==>   
----------------------------------------------------------------------------------------------------------------  
B. 선택  
1. BCG(결핵예방접종) ==> 모태소아과[2013.09.26(목)]  
2. 선천성 대사 이상검사 59종 ==> 모태소아과[2013.09.26(목)]  
3. B형 간염 예방 접종(1차)  ==> 모태소아과[2013.09.26(목)]  
4. 로타 바이러스(로타릭스)(1차): 12만원 ==>   
5. 폐구균(13가 백신)(1차): 12만원 ==>   
==============================================================================================================

- 사진인화, 액자  
http://www.photomon.com/store/view_all.asp?intnum=154&Seq=39  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 당직  
   
- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v2 8_201308141_서버통합ver_2.doc  
==============================================================================================================

- Sevice 서버 Deploy 이후 3차 점검(W47 정기 배포)  
$  ll /home/chaton/service/tomcat/webapps  
$  ll /home/chaton/war/service-dsv-v3.3.0-rc10292.war  grep '21049186'     
$  curl localhost:10080/VersionTracking/version/getversion  
$  tail -f clog    grep 'Exception'   
1. 제니퍼 확인 ==> 01. EU2[~ALL], http://54.217.246.229:9900  
==============================================================================================================

- WS, WB 통합(log 보기)  
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ pas1ws001m  
[chaton@pas1wb001m:~/]$ cd /home/chaton/ws --> ws 서버 @@@  
[chaton@pas1wb001m:~/]$ cd /home/chaton/os --> os 서버 @@@  
[chaton@pas1wb001m:~/]$ cd /mnt/ws/logs --> ws 서버 로그 @@@  
[chaton@pas1wb001m:~/]$ cd /mnt/os/logs --> ob 서버 로그 @@@  

(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ pas1wb001m   
[chaton@pas1wb001m:~/]$ cd /home/chaton/wb --> wb 서버 @@@  
[chaton@pas1wb001m:~/]$ cd /home/chaton/ob --> ob 서버 @@@  
[chaton@pas1wb001m:~/]$ cd /mnt/wb/logs --> wb 서버 로그 @@@  
[chaton@pas1wb001m:~/]$ cd /mnt/ob/logs --> ob 서버 로그 @@@    
==============================================================================================================

- ISAMS DEV/STG2 신청내역파일 및 결재경로  
1. Pre-Production 신청 방법  
 1) 메일로 받은 (ChatON)-사용자계정-일괄등록-DEV_STG_v0.91@20131105.xls 파일에서  
진태만 과장을 필터링하여 #serverName 부분(i-515a2a2b 등)을 복사(31줄)하여 서버계정 정보.cvs 파일을 생성  
 2) ISAMS 포털(http://isams.sec.samsung.net) 접속  
 3) 권한신청[Tab] 클릭 > 공용/관리자계정사용 신청(큰 화면)  
  가. 서버계정 정보 > 서버계정 정보.cvs 파일을 찾아보기하여 업로드 후 일괄등록함  
  나. 서버계정 정보 > 서버식별자에서 chaton(입력) 후 추가 클릭  
  다. 서버계정 정보 > 로그인계정: WB967 ==> 자동 입력  
  라. 서버계정 정보 > 사용계정: chaton ==> 검색  
  마. 서버계정 정보 > 사용기간: 2013-11-25 00:00 ~ 2014-02-22 23:59  
  바. 추가 정보 > 신청사유: chaton 운영  
 4) 결재라인   
   - 결재1 : SDS PM/PL결재(이길형 수석님)   
   - 결재2 : PL 결재(이효성 책임님)   
   - 통보1: AWS어드민
 5) 신청(클릭)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 수종 밤에 자는 거 깨워서 새벽 1시까지 재운다고 고생함  
   
- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v2 8_201308141_서버통합ver_2.doc  
==============================================================================================================

- 장모님 중고폰(선불폰) 구입  
1. 기종: SPH-W7100  충전기=충전기, 색상=핑크  
http://freephonephone.co.kr/front/php/product.php?product_no=460&main_cate_no=30&display_group=1  
2. 금액: 23,00원(선불카드 3만원 포함, 충전기 포함)  
3. 요금제: KT (3G폰) SHOW 선불 충전라이트 요금제(월 5천원 차감 예상)  
==============================================================================================================

- 대여금청구소송(남권형)  
1. 채무불이행자등재 - 법원에 신청하실 수 있지만 신용불량자라면 효과가 없음.  
 1) 판결문(판결확정일로부터 기산)을 득한 후 6개월이 지난 이후에나 등재 가능 ==> 2014년 5월 14일  
 2) 채무불이행자명부등재 신청시 금액 ==> 인지대 1,000원, 송달료 32,500원  
 3) 채무불이행자명부등재 신청절차 및 준비 서류  
   가. 신청절차: 신청서 제출 후에 심사 후 결정을 내림  
나. 준비서류  
① 신청서  
②판결 등 집행권원 정본  
③ 송달증명원, 확정증명원  
④ 개인일 경우 채무자 주민등록초본  
2. 재산명시신청 - 법원에 신청 : 채무자에게 자신의 재산을 밝히라고 하는 신청으로  
                      실효성은 적지만 채무자를 귀찮게 하는 효과는 있음.  
3. 재산조회 - 재산명시신청 이후 법원에 신청할 수 있음.  
                비용이 많이 들지만 보험사를 조회할 수 있음.  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  
   
- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v3 3_20131121.doc  
==============================================================================================================

- 통합, 해킹 관련 회의(16:00 ~ 16:30)  
1. 해킹 관련 정보 5천여개 uid 확인로 접속 여부 확인  
==============================================================================================================

- 상하수도 요금 자동이체 신청[2013.11.21(목)]  
1. 납부자번호(자동납부번호): 036964464, 수용가명: 추연대외1인   
2. 서울시 E-Tax: https://utax.seoul.go.kr ==> 짝수 월 말일에 자동이체 됨  
==============================================================================================================

- 동영상 편집 하는 법  
http://blog.naver.com/sdh2112?Redirect=Log&logNo=120122383859  
1. 프리미어 프로 CS 5.5 한글판(어도비사, 64 bit) ==> 포토샵, 일러스트와 호환 됨  
2. 아기 성장 동영상  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  
   
- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v3 3_20131121.doc  
==============================================================================================================

- Service서버 sg --> cn으로 포트체크 확인  
1. portCheck 모니터링 체크방법  
(connect)chatonop@ip-10-132-5-204:~$ pas1sv003  
(pas1sv003)chaton@ip-10-128-205-227:~$ cd /home/chaton  
(pas1sv003)chaton@ip-10-128-205-227:~$ ./pcheck.sh  ==> pcheck.sh로 체크 @@@  
==============================================================================================================

- 인호진 과장 결혼(용두역, 14:30)  
1. 일시: 11월 23일(토) 14:30  
2. 장소: 파티움 앨리스 2층: 서울시 동대문구 용두동 26-14(2호선 용두역 3번 출구)  
3. 길 찾기 방법(1시간 소요)  
 1) 봉천 새문B --> 서울대입구역(4-4) --> 성수역(3-4) --> 용두역(2번 출구) --> 파티움 앨리스   
 2) 파티움 앨리스 --> 용두역(4-4) --> 성수역(7-3)  --> 서울대입구역 --> 봉천 새문B  
==============================================================================================================

- 중고 유모차(카펠라): 구입  
http://cafe.naver.com/joonggonara/187633874 ==> 5만원  
주소: 관악구 중앙동 1515-10 우성베스트빌 501호  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- 주말  
06:15 기상  
06:30 태훈이형 차(차 사고 나서 보험회사에서 차 렌트 했다고 함)  
07:00 신구초등학교   
07:10 게임(2:1) 패 ==> 1골 넣음  
08:10 종료  
08:40 귀가  
09:20 중고 유모차(카펠라): 구입(5만원): 루옌하고 같이 감  
09:50 귀가  
10:00 조식(짜장면)  
12:00 집출발  
12:30 라붐아울렛 => 아기 조끼, 털모자(아가방3) 구입(7만 3천원)   
13:10 서울대입구역  
14:10 용두역  
14:20 파티움 앨리스 2층(축의금 5만원) ==> 루옌  
14:30 2층 식당(인정현 과장, 장성율 과장(딸), 홍영민 과장) ==> 부페 음식 많이 먹음(스테이크)  
15:30 종료  
16:30 귀가  
16:40 집출발 ==> 장모님 짐 많음(용돈 20만원, 교통카드 2만원 충전 해드림)  
16:50 501번 버스  
17:30 종각역( --> 의정부역 --> 206번 버스 --> 세아APT --> 허우 엄마집)  
19:00 허우 엄마집 도착  
18:20 출발  
18:50 의정부역  
19:50 종각역  
20:10 501번 버스  
20:50 귀가  
21:50 큰방으로 짐 옮김(루옌 울고 있음)  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

▦조기축구  
07:15 기상  
07:30 국민은행 봉천동지점 앞(태훈이형 차)  
07:50 신구초등학교(회장님이 장갑 나눠줌[못 받음]) ==> 회의 열어서 조끼하기로 결정(한동이 용품사 꺼로 함)  
08:00 게임(1:1 무)  
09:30 게임(1:0 승): 윈드 FC와 친선 게임  
11:30 게임(1:1 무)  
12:00 종료  
12:30 중식(갈비탕, 문경새재): 만원 냄  
13:50 귀가  
19:00 석식(배달시킴) ==> 간장다리+날개치킨[펩시 콜라(캔), 처음 배달 쿠폰 2천원 할인(만 4천원]: 계동치킨  
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- ChatON 운영 Proj
- privjob 사용법  
WA967@ec2-54-204-34-13:~$ privjob chaton ==> chaton 계정 전환하는 경우 @@@   
WA967's Password: hpxoaks12$ ==> 개인 password 입력 @@@  
[SECUVE] Input Job ID    
: C7QdyzY% ==> 발급 받은 Ticket 번호 입력: C7QdyzY%(sv), C7QdyzY%(sm), C7QdyzY%(bd) @@@  
sh: who: Permission denied  
chaton@ec2-54-204-34-13:~$ ll  
---------------------------------------------------------------------------------------------  

(connect)chatonop@ip-10-132-84-100:~$ su - tamario2.jin ==> chatonop 서버로 권한 변경 @@@  
Password: l*fndPs1**@ --> password 입력 @@@  

(connect)chatonop@ip-10-132-84-100:~$ su - chatonop ==> chatonop 서버로 권한 변경 @@@  
Password: cotdhs+dnsdud!@# --> password 입력(챗온+운영!@#)  @@@   
==============================================================================================================

(connect)tamario2.jin@ip-10-132-84-100:~$  jumpto rue1sv001   ==> rue1sv001 서버 연결(/home/chatonop/alias/jumpto.sh rue1sv001 WA967를 줄임) @@@   
WA967@ec2-54-204-34-13.compute-1.amazonaws.com's password: hpxoaks12$ --> password 입력 @@@   
==============================================================================================================

- 서울대입구역 국공립 어린이집(2015년 12월에 원아모집, 2016년(4살) 3월에 입학)  
1. 구립 성현 햇살 어린이집(서울시 관악구 봉천동 40-12), ☎ 878-6633  
2. 낙성대 어린이집(  관악구 봉천동 1614-6), ☎ 872-0726  
3. 서울시 보육정보센터: http://seoul.childcare.go.kr, tamario12/l*fn***1*!*  
 1) 원아모집: 보육시설의 원아모집은 수시모집과 매년 12월에 이루어지는 정규적인 모집 방법이 있다  
 2) 입소순위: http://seoul.childcare.go.kr/ccis/seoul/content_431.jsp  
4. 녹색장남감 도서관: http://seoultoy.or.kr  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 당직, W48  비정기Depoly 작업(sm, am): 조대형 과장, 안미현 선임  

- ChatON 운영 Proj
- 사용자계정-소유계정목록 작업(PRE)  
==============================================================================================================

- 백 스페이스(Backspace) 적용(터미널에서)  
1. (connect)tamario2.jin@ip-10-132-84-100:~$  cd chaton/users/tamario2.jin  
2. vi .vimrc ==> 아래 내용 입력 @@@  
set t_kb=^?  
3. 재시작  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 당직  

- ChatON 운영 Proj
- 1차 대응 매뉴얼 분석  
1. ChatON_1차 대응 매뉴얼_v3 3_20131121.doc  
==============================================================================================================
   
- 유모차 바람막이  
1) 카펠라 유모차 커버, 가격: 26,500원 ==> 주문 완료  
http://www.interpark.com/product/MallDisplay.do?_method=detail&;sc.shopNo=0000100000&firpg=01&sc.prdNo=682726221&sc.dispNo=016001&sc.dispNo=016001  
==============================================================================================================

- 서울대입구역 국공립 어린이집  
0. 서울시 보육포털 서비스(어린이집 입소신청): http://iseoul.seoul.go.kr ==>  
구립성현햇살어린이집, 구립원당어린이집, 구립낙성대어린이집, 구립선봉어린이집 입소신청  
1. 구립 성현 햇살 어린이집(서울시 관악구 봉천동 40-12), ☎ 878-6633  
2. 낙성대 어린이집(  관악구 봉천동 1614-6), ☎ 872-0726  
3. 서울시 보육정보센터: http://seoul.childcare.go.kr, tamario12/l*fn***1*!*  
 1) 원아모집: 보육시설의 원아모집은 수시모집과 매년 12월에 이루어지는 정규적인 모집 방법이 있다  
 2) 입소순위: http://seoul.childcare.go.kr/ccis/seoul/content_431.jsp  
4. 녹색장남감 도서관: http://seoultoy.or.kr   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- ChatON 운영 Proj
- W49 정기 배포 준비  
1. 서버 change : 16건, DB change : 5건, Config change : 0건  
2. 담당 서버: sv, ws, os  ==> 총 30개 서버  
==============================================================================================================

- CN지역 단말서비스 불가  로그 분석   
1. 발생일시: 11.28 01:35(KST)   ==> 11.27 16:35(UTC)    
2. pcn1sv001, pcn1sv002 서버 로그  
[chaton@pue1wb#1:~]$ grep '2013-11-27 16:35' /mnt/log/web.log.2013-11-27 -A10 -B10   less == '16:35분대'조회 @@@  
[chaton@pue1wb#1:~]$ grep 'Exception'  /mnt/log/web.log.2013-11-27   grep '2013-11-27 16:3' -A10 -B10   less ==> 'ERROR'와 "16:30분대" 조회 @@@  
[chaton@pue1wb#1:~]$ grep 'Exception'  /mnt/log/web.log.2013-11-27   grep '2013-11-27 16:4' -A10 -B10   less ==> 'ERROR'와 "16:30분대" 조회 @@@  
==============================================================================================================

- 장인 어른 중고폰(선불폰) 구입  
1. 기종: SPH-W7100 , 색상=흰썍  
http://freephonephone.co.kr/front/php/product.php?product_no=460&main_cate_no=30&display_group=1  
2. 금액: 19,00원(선불카드 3만원 포함)  
3. 요금제: KT (3G폰) SHOW 충전라이트 요금제(월 5천원 차감 예상)  
4. KT가입 신청서: http://online.olleh.com/Main.jsp --> tama339   
5. 인터넷 구입(다음날 택배로 배송됨)   
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00   

- ChatON 운영 Proj
- W49 정기 배포 준비2  
1. 서버 change : 16건, DB change : 5건, Config change : 0건  
2. 담당 서버: sv, ws, os  ==> 총 30개 서버  
==============================================================================================================

- W49 정기 배포 회의(15시)  
1. 9.Deploy사전점검, 9.Deploy사후점검 리스트 메일로 발송  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.11.30(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- 주말  
09:00 기상  
09:10 조식(라면)  
11:00 집출발(유모차 커버 씌움)  
11:30 부츠 구경(영림종합시장): 3만 3천원(루옌 싫어함)  
13:00 롯데백화점(관악점): 기저귀 갈기, 모유 수유  
14:00 보라매 공원(축구, 공연, 개 구경)  
16:00 종료  
16:10 5524번 버스(롯데백화점 --> 우성 아파트)  
16:50 여성 레깅스, 티 구입: 루옌  
17:00 부어 치킨(8천 5백원)  
17:10 귀가  
19:00 석식  
23:00 취침  
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■