

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.10) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.10.01(화) 작업 ■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직 

- ChatON 운영 Proj
- 당직 대응 
1. US 지역 웹, 단말 이미지 업로드 불가(2번 발생) 
2. US 지역 WebChatON 로그인 불가(2번 발생) 
==============================================================================================================

- 프로젝트 외주인력 대상 온라인 보안교육 실시 
1. 보안과 함께하는 프로젝트 수행(온라인과정, 2시간 과정) 
2. 삼성SDS파트너사: http://secupartner.e-campus.co.kr, tamario / ss태만99!@, ssil4u2011!@(2순위) 
==============================================================================================================

- 화면 스크롤 글자 수 늘이기(수퍼 뿌띠) 
1. PuTTY Configuration(새창) > Window > Lines of scrollback: 20000(입력) > Save 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.02(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Proj
- 통합빌드서버 숙지 
1. Jenkins 설치, 기타 S/W 설치(1. Maven 설치, 2. Ant 설치, 3. Nexus 설치, 4. P4 command line client 설치, 
5. sshpass 설치, 6. s3cmd 설치, 7. 기타 sh) 
==============================================================================================================

- Maxgauge 교육 
1. 일시: 9시, 장소: 7층 1회의실 
2. mySql 모니터링 툴: Active Session 및 Slow Query 확인 
----------------------------------------------------------------------------------------------------------------------- 

- SAMS(모니터링 툴 --> nagio 대체) 
1. sams.sec.samsung.net 
==============================================================================================================

- 노트북 구입 고려 
1. MSI CX70-2OD Arion (1TB + SSD 120GB), 가격: 1,213,000원 
코어i7-4세대 / i7-4702MQ (2.2GHz) / 43.94cm (17.3인치) / 1920x1080 / 1TB / 8GB / DDR3 
http://prod.danawa.com/info/?pcode=2132321&cate1=860&cate2=869&cate3=12734&cate4=0 
----------------------------------------------------------------------------------------------------------------------- 

- Dell 노트북에 SSD 설치(집 노트북) ==> 2012.11.03(토) 
1. SSD로 변경: 삼성전자 830 Series 노트북 패키지(64GB, MZ-7PC256N/KR) 설치(기존 히타치 500GB 하드를 교체) 
2. 윈도우 7 Professional K 64 Bit 설치 
==============================================================================================================

- 베가 R3 이미지 캡쳐 
1. 왼쪽 아래, 오른쪽 아래 버튼 동시에 누름 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.03(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:45 기상 
07:00 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교 
08:30 숏게임(3:0 승) 
08:30 게임(1:0 무) 
08:30 숏게임(2:0 승): 2골 
10:00 종료 
10:30 중식(효순이형 가게: 부대찌게): 만원 냄 
12:30 귀가  
13:00 생리대 나와서 루옌이 난리 침 
13:30 강남터미널(어머니 배웅)  
14:30 철물점(철사, 변기 나사): 지갑 분실(면허증, KB신용카드(분실신고), SC은행 직불카드) 
15:00 귀가 
18:40 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.04(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- 당직 대응 
1. US 지역 웹, 단말 이미지 업로드 불가(2번 발생) 
2. US 지역 WebChatON 로그인 불가(2번 발생) 
 1) wb1-ws1-wb2-ws2-wb3-ws3 순으로 리스타트 진행 
 pue1wb1, 2, 3번 모두 Out of Service 로 나옵니다. 
==============================================================================================================

- 로그 분석(운영일지 작성시) 
$ grep "2013-10-04 07:00:00" -n /home/chaton/webapi/tomcat/logs/catalina.out ==> 16시 00분 데이타 조회 @@@ 
1741122 --> 1번 줄 선택 @@@ 
$ grep "2013-10-04 07:15:00" -n /home/chaton/webapi/tomcat/logs/catalina.out ==> 16시 15분 데이타 조회 @@@ 
1061007 --> 2번 줄 선택 @@@ 
1741122-1061007=680115    --> 시작 줄과 끝 줄 계산[1번 줄 - 2번 줄]@@@ 
$ tail -n+1061007 catalina.out  head -680115 > weget_1004.log ==>  head 줄 번호에서 tail 줄번호 사이를 조회 @@@ 
$ cd /home/chaton/webapi/tomcat/logs  
$ cat weget_1004.log  less ==> cat으로 조회[vi weget_1004.log] @@@  
$ rm weget_1004.log ==> 파일 삭제 @@@ 

$ grep 'Exception' /mnt/log/web.log -B10   less ==> Exception 조회(페이지 다음: f, 페이지 전: b, 조회: /, 중지: q) @@@ ==> 로그 분석 
==============================================================================================================

- 배포 관련 회의 
1. 배포 순번제로 운영(조별 폐지)[2번] 
2. 배포(1차) --> 배포(2차) --> 주간당직자(3차) 
==============================================================================================================

- 공격성으로 추정되는 IP 및 Samsung Email 계정 정보 획득 방법 
1. 장애문구 : wf - Log Critical (chatonweb_catalina.2013-10-xx.log) 
2. 장애인지 경로 : Nagios Alram 
3. 에러메시지 : APICallException 
4. 확인할 로그 
    1) [wf] tail -f ~/logs/chatonweb_portal_log.log  grep "APICallException" 
    2) [ws] tail -f ~/webapi/tomcat/logs/localhost_access_log.yyyy-MM-dd.txt  grep "1.1\" 403 "  <--- yyyy-MM-dd 대신에 2013-10-04 등을 입력 
    3) 지속적으로 에러문구가 출력되면, 이 중 반복되는 email 혹은 IP address가 있는지 확인할 것. 
    4) 예시 
        10.* - - [30/Sep/2013:10:53:23 +0000] "GET /sessioninfo?emailsamsung=hannajuarez1385@**.com HTTP/1.1" 403 5 4 

 1) [wf] tail -f ~/logs/chatonweb_portal_log.log  grep "APICallException" ==> 실시간 조회 @@@ 
grep 'APICallException' //home/chaton/logs/chatonweb_portal_log.log -B10   less  ==> 로그 분석 조회 @@@ 
2) [ws] tail -f ~/webapi/tomcat/logs/localhost_access_log.yyyy-MM-dd.txt  grep "1.1\" 403 " ==> 실시간 조회 @@@ 
tail -f /home/chaton/webapi/tomcat/logs/localhost_access_log.2013-09-30.txt  grep "1.1\" 403 " 
tail -f /home/chaton/webapi/tomcat/logs/localhost_access_log.2013-09-30.txt  grep "10.*" 

grep 'hannajuarez1385@**.com' /home/chaton/webapi/tomcat/logs/localhost_access_log.2013-09-30.txt  
grep '1.1\" 403' /home/chaton/webapi/tomcat/logs/localhost_access_log.2013-09-30.txt  
grep '10.*' /home/chaton/webapi/tomcat/logs/localhost_access_log.2013-09-30.txt  less  
==============================================================================================================

- 9월 Nagios 데이터 수집 및 임계치 조정  
1. Noti 분석방법 
01. 싱가폴 
Total 0 67 3 0 0 548 7 2 9 1 46.* 825 28 4 2 0 807 
Total 0 13 1 0 6 702 0 5 49 0 3 23 0 0 1 1 1 1 0 1 0 807 
02. 유럽 
Total 39 38 0 0 0 919 4 2 709 620 1 2268 0 0 2 2 1 254 32 1 0 0 4892 
Total 1 49 75 1 4 1034 30 4 784 940 5 1947 1 0 1 0 0 0 32 3 0 0 4911 
03. 미주 
Total 1 6 0 1 427 1 0 2 10 3 20 0 0 1 2 1679 17 2 0 0 0 2172 
Total 5 60 0 0 697 158 0 2 7 0 12 0 0 0 4 0 28 294 13 14 0 1294 
04. 한국 
Total 0 111 1 0 3 4015 30 0 1 45 329 2 0 0 0 0 121 7 20 10 0 4695 
Total 0 389 6 2 0 16 0 0 0 11 122 0 0 1 1 0 5 0 11 0 0 564 
05. 중국  
Total 54 44 0 0 0 2349 1 0 0 0 6 0 0 0 1 0 0 0 0 0 2455 
Total 1 6 1 2 0 287 3 0 6 1 4 0 0 0 29 2 1 0 2 0 345 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.05(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말 
08:10 기상(루옌, 어제밤에 웬티하씨에게 통역 부탁하여 오해를 품) 
08:30 조식(잡채) 
10:00 택시(콜택시 전화 ==> 배차 실패) 
10:30 진료(출산 1주일 검진, 비타민D 주사): 모태산부인과 
11:00 택시 
11:10 귀가 
11:30 작명 책 대여 반납(성은동작은 도서관) 
12:10 정글만리1, 2 대여 반납(글빛 도서관) 
13:00 귀가 
14:00 장롱 배송, 설치 
14:10 중식 
14:30 낮잠 
18:40 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.06(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:45 기상 
07:00 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교 
08:30 숏게임(3:0 승) 
08:30 게임(2:0 패) 
08:30 숏게임(2:0 승) 
10:30 종료 
11:00 중식(문경새재: 설렁탕): 만원 냄 
12:30 귀가 
15:00 낮잠 
17:00 독서(정글만리1) 
18:40 석식 
21:20 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.07(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- SAMS 분석 
1. SAMS_교육자료_V1.52.ppt 파일 분석 
==============================================================================================================

- 운전면허증 분실 재발급 
1. 준비물: 사진 1장, 주민등록증, 6,000원(발급 수수료) 
2. 장소: 면허시험장 
3. 주민등록증 분실 ==> 주민등록발급신청확인서 발급(역삼1 주민센터) 
4. 운전면허증 분실 신고(완료): http://dls.koroad.or.kr/jsp/ool/olr/OL_LoseNtfyCnclU.jsp 
==============================================================================================================

- 주민등록증 재발급 
1. 준비물: 주민등록증용 반명함판 사진 1매(3CmX4Cm, 흰색 무배경, 최근 6개월 이내에 촬영한 탈모 상반신), 
수수료: 5,000원(2006년 이전 주민증은 무료로 재발급 해줌: 업무편람) ==> http://cafe.naver.com/goseocheon/17834 
2. 장소: 전국 주민센터 ==> 주민등록증 발급신청 확인서 발급(운전면허증용) 
3. 처리기간 : 신청일로부터 2~3주 정도 소요 
4. 발급번호: 2013004311, 발급신청일자: 2013.10.08, 유효기간: 2013.11.07 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- SAMS 분석 
1. SAMS_교육자료_V1.52.ppt 파일 분석 
==============================================================================================================

- SAMS 프로그램 RoboForm과 충돌 
1. RoboForm 완전히 사용 안하고 SAMS 실행할 것 
2. SAMS: http://sams.sec.samsung.net/scop-fds --> tamario2.jin /s*jt**8*1 
3. mysinle: http://www.samsung.net/portalWeb/ptmanager/ep/desktop --> tamario2.jin /s*jt**8*1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.09(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 한글날(공휴일) 

- 한글날 
06:45 기상 
07:00 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교  
08:30 게임(5:4 승) 
10:30 종료 
11:00 중식(갈비탕, 문경새재, 조기축구): 만원 냄 ==> 성주 부부 참석 
12:30 귀가(산후 도우미 아줌마 만남) 
13:00 낮잠 
16:00 401호 비 가림막 공사(401호 남자가 와서 시끄러워 미안하다고 쥬스 주고 감) 
16:30 보일러실 밸브 라벨링 
17:00 야구 시청(준PO 2차전 --> 넥센 3:2 두산) 
18:40 석식 
20:00 독서(정글만리2) 
22:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.10(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 책 대여 반납(정글만리2, 3, 글빛도서관), 기저귀 발진약 구입(산후 도우미 아줌마, 더마 로얄 크림: 4천원) 

- ChatON 운영 Prj
- SAMS 분석 
1. SAMS_교육자료_V1.52.ppt 파일 분석 
==============================================================================================================

- my single(마이 싱글) 
1. http://www.samsung.net/portalWeb/ep/portal/login/LogoutSuccess.jsp --> tamario2.jin /  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.11(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- SAMS 분석 
1. SAMS_교육자료_V1.52.ppt 파일 분석 
2. SAMS 수정 요청 사항 작성 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.10.12(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말 
08:10 기상 
08:00 조식(식빵) 
08:40 집출발(루옌, 애기) 
08:50 모태소아과(대기 11명) 
09:50 진료(선천성 대사 이상검사 59종 추가 검진: 애기 발에서 피 뽑음) 
10:20 신신파스 아렉스(2개, 소망약국) 
10:50 귀가(산모 도우미 아줌마 와 있음) 
11:00  TV 시청 
13:10 중식 
14:00 야구(준PO 3차전 --> 넥센 3:4 두산)  
18:40 석식 
21:10 독서(정글만리3: 다 읽음)  
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.13(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:45 기상 
07:00 국민은행 봉천동지점 앞(태훈이형 차) 
07:30 신구초등학교[월례회의 --> 모범회원 시상(홍성주)] 
08:30 게임(3:2 승)  
10:30 종료 
11:00 임원회의(토욜 일어난 상요형이 병룡이 상해 사건 징계 회의 --> 사건 추의 지켜 보기로 함) 
        ==> 병룡 고소 준비 중이라고 함 
12:30 귀가(식사 안하고 옴) 
13:00 쇼핑(이마트 에브리원: 실망) 
13:40 석식 
15:00 낮잠 
16:40 정글만리 2, 3 반납(글빛 도서관) ==> 도서 대여[(요절복통)아빠의 육아일기] 
18:40 석식 
21:20 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.14(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 분실 지갑 찾기(19시, 관악 경찰서 방문) 

- ChatON 운영 Prj
- 배포 회의 
1. OB, OS, CS(special buddy = Live Server) 
2. ChatON W42 정기 deploy 작업계획 review(17시, 수원사업장, 참석: 최인택 책임, 인호진 과장) 
3. pre-prd 배포(수요일) 
==============================================================================================================

- 프로젝트 외주인력 대상 온라인 보안교육 실시 
1. 보안과 함께하는 프로젝트 수행(온라인과정, 2시간 과정) ==> 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.15(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- 배포 준비 작업 
1. 작업전 체크리스트 작성 (10/15(화) ~11시까지): 13시 
  : 첨부의 작업 계획서([W42] ChangeList_20131014.xlsx) 검토 후 문제되는 부분에 대하여 회신 주시기 바랍니다.   
2. 작업후 체크리스트 작성 (10/16(수) ~ 11시까지): 15시 
: [ChatON_작업후 모니터링 체크리스트_20131017.xlsx] 파일의 [9.Deploy사후점검] 시트에 작성하여 작성자와  
작업자간 공유까지 완료하셔야 합니다 
3. Pre-PRD 배포 (10/15(화) 13시~ 18업, 오전에는 DB 작업).  
4. Config 파일 작성: 서버, 임시파일, MSC담당자 
 1) 서버: Open API Session,  
 2) 임시파일: /home/chaton/openapi/conf/ssm-session-server.properties_W42_old,  
/home/chaton/openapi/conf/ssm-session-server.properties_W42_new 
 3) MSC담당자: 홍영택 선임 
==============================================================================================================

- .bashrc 파일 변경(alias명 변경) 
접속한 root 폴더에 보시면 .bashrc 라는 파일이 있는데..  
vi로 여신 다음에 맨 아래에 다음을 입력하고 저장하시고 재 접속하시면 됩니다.  
(connect)tamario2.jin@ip-10-132-5-204:~$ ll  
drwxr-xr-x  3 tamario2.jin osdssup   87 2013-06-12 00:14 ./ 
-rw-r--r--  1 tamario2.jin osdssup 3103 2010-04-19 02:15 .bashrc 
  
(connect)tamario2.jin@ip-10-132-5-204:~$ vi .bashrc  ==> .bashr 파일에 아래 내용 추가하고 재시작할 것 @@@@ 
# alias info 추가 
. /home/chatonop/alias/pue_alias.txt 
. /home/chatonop/alias/pew_alias.txt 
. /home/chatonop/alias/pas_alias.txt 
. /home/chatonop/alias/pan_alias.txt 
. /home/chatonop/alias/pkr_alias.txt 
. /home/chatonop/alias/rue_alias.txt --> .bashr 파일(Pre-PRD) @@@@ 
. /home/chatonop/alias/nonfunction_alias.txt 

(connect)tamario2.jin@ip-10-132-5-204:~$ cd /home/chatonop/alias  
(connect)chatonop@ip-10-132-84-100:~/alias$ vi rue_alias.txt 
alias rue1sv001='ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 chaton@**.com 
--> AWS(https://console.aws.amazon.com/ec2/v2/home?region=us-east-1#Instances:instancesFilter
=all-instances;instanceTypeFilter=all-instance-types;search=rue1sv001) 
에서 Public DNS(ec2-54-224-224-5.compute-1.amazonaws.com)명을 기존 rue1sv001 alias에 적용 
alias rue1sv001='ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 chaton@**.com' 
(connect)chatonop@ip-10-132-84-100:~/alias$  .bashrc 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 07:00 --> W42 정기 배포(2번), 석식(돈가스+쌀국수: 최인택 책임이 쏨) 

- ChatON 운영 Prj
- 배포 준비 작업 
1. 작업전 체크리스트 작성 (10/15(화) ~11시까지): 13시 
  : 첨부의 작업 계획서([W42] ChangeList_20131014.xlsx) 검토 후 문제되는 부분에 대하여 회신 주시기 바랍니다.   
2. 작업후 체크리스트 작성 (10/16(수) ~ 11시까지): 15시 
: [ChatON_작업후 모니터링 체크리스트_20131017.xlsx] 파일의 [9.Deploy사후점검] 시트에 작성하여 작성자와  
작업자간 공유까지 완료하셔야 합니다.  
------------------------------------------------------------------------------------------------------------------- 

- SG reboot 추가 
진태만 : pas1os001m  ==> pas1fi001m, pas1ha001m, pas1im001m, pas1os001m, pas1wb001m 
==============================================================================================================

- MySQL DB 문제 확인(JDBC Connection Exceptoin: DB 연결 문제) 
$ netstat -an  grep 5306 ==> 명령을 실행하여 결과를 확인 @@@ 
tcp6       0      0 10.*:52231     10.*:5306      ESTABLISHED 
tcp6       0      0 10.*:50457     10.*:5306      ESTABLISHED 
tcp6       0      0 10.*:38163     10.*:5306       ESTABLISHED 
tcp6       0      0 10.*:36523     10.*:5306       CLOSE_WAIT --> CLOSE_WAIT 항목이 다수 확인되는 경우 에러 @@@ 
==============================================================================================================

- 작업계획서 리뷰(22:00) 
1. 각자 작업할 서버에 작성된 내용 설명 
2. 담당 서버: ob, os, lm ==> 28개 서버 
==============================================================================================================

- putty 자동 alert 설정(10초 마다 서버에 사용 중으로 알림) 
1. putty > Connection > Seconds : 0 --> 10으로 변경 
==============================================================================================================

- 배포 시작 
1. 시작(02:30 ~ 07:30) ==> 퇴근: 08:30 
2. ssm-session-server_us.properties_W39 수정할 것[중요 --> 완료]  
==============================================================================================================

- 배포시 OB서버(배포_상황실) 표준 문구 
0. OS서버, OB서버, LM서버 담당 진태만 입니다. 
1. 디플로이 시작 전  
ex) KR지역 OB서버(1/2) 디플로이 작업 시작합니다 
2. 디플로이 중 이슈 발생  
ex) US지역 OB서버(1/2) 이슈 발생하였습니다. 버전 체크가 안됩니다. 
 1) 현상 
chaton@pkr1lm002m:~$ curl --header 'Host: livemw.samsungchaton.com' http://localhost:80/VersionTracking/version/getversion/jarName=ROOT.war 
The program 'curl' is currently not installed.  To run 'curl' please ask your administrator to install the package 'curl' 
cat /home/chaton/apps/live/webapps/ROOT/META-INF/MANIFEST.MF  grep Revision-Number 
 2) 긴급 대응: cat 명령어를 실행하여 버전 확인 
chaton@pkr1lm002m:~$ cat /home/chaton/apps/live/webapps/ROOT/META-INF/MANIFEST.MF  grep Revision-Number 
Revision-Number: 3.1.929521 
3. 디플로이  완료 
KR지역 OB서버(1/2) war배포 및 설정파일 변경 완료, 이슈 없습니다. 
------------------------------------------------------------------------------------------------------------------- 

- 실제 배포시 표준 문구 
US지역 OS서버(1/2) 디플로이 작업 시작합니다. 

CN지역 OS서버(1/2) war배포 및 설정파일 변경 완료, 이슈 없습니다. 
CN지역 OS서버(1/2) 디플로이 작업 시작합니다. 
..... 
..... 
CN지역 OB서버(2/2) war배포 및 설정파일 변경 완료, 이슈 없습니다. 
==============================================================================================================

- buddy 서버 에러 
1. 내용: WebApplicationExceptionMapper.java:55       - WebApplicationException has been caught : no cause is available 
2. 원인: 노드 제거 하는데 이미 연결되어있던 connection에서 나는 에러이고   동작중인 auto discovery 통해서 주기적으로  
계속 찾도록 되어있습니다 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.17(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 -->  W42 정기 배포(2번) 휴무 

- 주말 
07:30 W42 정기 배포 종료 
08:00 W42 정기 배포 회의(작업후 모니터링 체크리스트 수정) 
08:20 퇴근 
09:00 귀가 
09:20 취침 
11:30 기상 
11:40 중식 
12:20 취침 
14:30 기상 
15:50 애기 출생신고(행운동 주민센터),  영유아 보유 수당 신청 
16:20 관악보건소(산모 우울증 검사 --> 빈혈약 2통 받음) 
17:00 쇼핑(핸드폰 케이스, 액정(갤S3) 구입[루옌]) 
17:20 귀가 
17:30 TV 긁힘 해결(지우개로 지움, LG 시네마 3D 스마트 TV 55LM6100(스탠드형)) 
18:40 석식 
19:00 야구 시청(PO 2차전 --> LG 2:0 두산) 
22:20 새문B 401호에 가서 쇠구슬 떨어지는 소리에 열받아 항의함(아줌마 결백 주장) 
23:00 취침 
==============================================================================================================

- 애기 출생신고(15시)  
1. 출생신고 기간: 태어난 지 30일 전에 신고 
2. 출생신고 하는 곳: 행운동 주민센터 
3. 준비물: 아빠의 신분증과 도장 
4. 완료 후 가족관계증명서 출력(대규: 태아 등재용) 
5. 애기 정보 
 1) 이름: 진수종(陳 銖 宗) --> 2013년 9월 24일 10시 32분 출생 
 2) 주민번호: 1309**-**** 
------------------------------------------------------------------------------------------------------------------- 

- 영유아 보유 수당 신청(행운동 주민센터) 
1. 주민등록 신고 후 복지과에서 신청(월 20만원 준다고 함) 
2. 사용 중인 통장 제출(SC은행 두드림통장) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.1018(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 휴일 당직 근무 파악(담당자, 장소) 

- ChatON 운영 Prj
- 배포 파일 분석 
1. Service 서버 sscp.sh 파일 생성(cd /home/chatonop/war/sv), deploy.sh 분석 
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$  cd /home/chatonop/war/sv 
(connect)chatonop@ip-10-132-5-204:~/war/sv$ ./deploy.sh service-dsv-v3.0.0-rc10070.war all; ==> 모든 region으로 war 파일 copy @@@ ==> 2. PRD 
(connect)chatonop@ip-10-132-5-204:~/war/sv$  ./deploy.sh service-dsv-v3.3.0-rc10070.war eu; ==> 각 region으로 war 파일 copy(eu, sg, us, kr) @@@ ==> 2. PRD 
(connect)chatonop@ip-10-132-84-100:~/war/sv$  ./sscp.sh r all sv ./service-dsv-v3.3.0-rc10070.war; ==> Pre-PRD서버로 war 파일 copy(1번 방법) @@@ ==> 1. Pre-PRD 
==============================================================================================================

- AWS instance reboot 및 stop->start 시 local disk 자동 마운트 방법  
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ rue1sv001 ==> service 서버 @@@  
chaton@ec2-54-224-224-5:~$ cd /mnt 
total 40 
drwxr-xr-x  7 chaton chaton  4096 2013-10-16 04:27 ./ 
drwxr-xr-x 21 root   root    4096 2012-10-10 06:08 ../ 
drwxr-xr-x  4 chaton chaton  4096 2013-10-16 04:27 deploy/ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-17 00:48 log/ 
drwx------  2 chaton chaton 16384 2013-07-01 21:12 lost+found/ 
drwxr-xr-x  3 chaton chaton  4096 2013-10-15 07:30 ssm/ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-18 00:00 tomcat_log/ 
------------------------------------------------------------------------------------------------------------------- 

(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$ rue1bd001 ==> buddy 서버 @@@ 
chaton@ec2-54-205-244-56:~$ cd /mnt 
total 52 
drwxr-xr-x 10 chaton chaton  4096 2013-10-15 06:46 ./ 
drwxr-xr-x 21 root   root    4096 2013-05-16 05:29 ../ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-15 06:46 clientlog/ 
drwxr-xr-x  4 chaton chaton  4096 2013-10-15 06:42 deploy/ 
drwxr-xr-x  3 chaton chaton  4096 2013-10-18 00:01 log/ 
drwx------  2 chaton chaton 16384 2013-08-07 22:35 lost+found/ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-16 13:23 oom/ 
drwxr-xr-x  3 chaton chaton  4096 2013-10-15 06:45 ssm/ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-18 00:00 tomcat_log/ 
drwxr-xr-x  2 chaton chaton  4096 2013-10-15 06:44 war/  
==============================================================================================================

- sscp.sh에서 pue1sv002 서버 alias명이 변경 되었을 경우 
(connect)chatonop@ip-10-132-84-100:~/war/sv$ cd /home/chatonop/alias 
total 144  
-rw-r--r--  1 chatonop chatonop 71217 2013-10-18 06:09 production_alias_130616.txt --> production_alias 파일 @@@ 
-rw-r--r--  1 chatonop chatonop  5839 2013-10-17 08:44 rue_alias.txt --> prd-production_alias 파일 @@@ 

(connect)chatonop@ip-10-132-84-100:~/alias$ cat production_alias_130616.txt  grep 'pue1sv002' ==> production_alias 파일에서 pue1sv002 조회 @@@  
alias pue1sv002='ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1sv.pem chaton@*.com' 

AWS(https://console.aws.amazon.com/ec2/v2/home?&region=us-east-1#Instances:)에서 instance명으로 pue1sv002 조회 
Instance: i-4415e03ePublic DNS: ec2-23-21-7-142.compute-1.amazonaws.com --> alias pue1sv002와 맞는 지 확인 @@@ 

(connect)chatonop@ip-10-132-84-100:~/war/sv$ vi production_alias_130616.txt ==> 틀리면 production_alias_130616.txt 파일에서 수정  @@@  
/pue1sv002 
alias pue1sv002='ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1sv.pem chaton@*.com' 
==> alias pue1sv002='ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1sv.pem chaton@*.com'로 수정 
==============================================================================================================

- 가족관계증명서 인터넷발급(무료) 
1. http://efamily.scourt.go.kr ==> 본인 확인을 위한 추가 정보 입력에서 등록기준지를 선택할 것  
 1) 등록기준지조회 > 도로명주소(tab) 
시: 경상북도, 시군구: 포항시 남구 
도로명: 기림로(조회: 클릭) 
건물번호: 지상[콤보박스] 138의 빈칸(확인: 클릭) 
2. 등록기준지: [790-901] 경북 포항시 남구 오천읍 기림로 1392번길 138[경북 포항시 남구 진전리 16] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.19(토) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00 

- 주말 
08:00 기상 
09:00 조식 
09:10 산후 도우미 아줌마 방문 
10:00 쇼핑(베트남 여성의 날 선물 사러 감) ==> 팔찌(14k, 25만원 ==> 라붐 아울렛 1층): 너무 비싸 못 사고 옴 
11:20 귀가 
11:20 허우씨 부부 방문[애기 내복 선물 받음, 허우 부모님 돈 3만원 선물 함(해라에게 만원 줌)] 
13:00 중식 
14:00 낮잠 
16:00 기상 
16:10 야구 시청(PO 4차전, LG 4:5 두산) 
19:00 석식 
20:30 401호 방문(소란 사과하고 밤 10시 이후 애 재우라고 함) ==> 남편 삼성물산 다님, 부인 중국 사람(중국 유학중 
	대학원에서 만났다고 함, 401호 매매가 2억 4천) 
21:00 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.20(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구 
06:40 기상 
06:50 태훈이형 차(늦게 일어남) 
07:20 신구초등학교 
07:40 요가(강사: 홍성주 처, 몸풀기) 
08:40 게임2(1:1) 무 ==> 역삼조기회 
09:50 게임4(1:0) 패 
11:10 게임5(2:0) 패 
11:40 종료 
12:10 중식(삼겹살, 문경새재): 회에서 쏨 
12:30 병룡이 와서 상요형하고 화해함 
13:10 종료 
13:30 귀가 
13:40 축구화 딱기(옥상) 
14:00 낮잠 
16:00 기상 
16:10 야구 시청(PO 5차전, LG 1:5 두산 ==> 3승 1패로 두산 한국시리스 진출) 
19:00 석식 
20:00 집출발 
20:30 강남역 8번 출구(지하 가기 전) --> 삼성전자(지하) 내부 통로 --> 삼성생명(후문) 
20:40 삼성생명 빌딩 1층 안내데스크: 방문증 받기(신분증 보관) --> 인호진 과장에게 전화해서 20층에서 만남 
20:45 삼성생명 빌딩 20층 상황실에 들어 옴(mysingle 모름 ==> 외부 메일로 비밀번호 찾기(성공), jumphost 비밀번호 모름 ==> 하민규 과장껄로 사용) 
20:48 챗온 1차대응으로 근무 신고 
20:50 인호진 과장 설명 ==> 1. 출입증(오상협 과장꺼)로 화장실 갔다 오는 방법 설명, 2. 앞문 키 비번(6 ok --> 7015 ok) 
03:00 ChatON EU, KR지역 다수 호스트 checkPort 서비스에서 크리티컬 발생[로그 분석] ==> 장애 총 10건 정도 터짐 
09:00 근무 종료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.21(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 21:00 ~ 09:00  

- 당직 휴무 
09:00 퇴근 
09:30 귀가 
09:40 취침 
12:40 기상(흐엉[낙성대역 근처 살고 있음, 하이증 고향] 방문) 
13:20 중식 
15:00 다문화가정 저축 가입  
1. 우리은행 희망드림 통장, 연 7.5%, 최대 적금 30만원, 총 월 60만원(1년, 아내, 남편) ==> 가입함(연 7.5%, 1년): 2013년 10월 21일(월) 
1) 위치: 우리은행 서울대입구역지점(서울입구역 4번 출구: 서울 관악구 봉천4동 869-12번지 대연빌딩1층) ==> 500만원 입금 
2. 기업은행 신서민섬김 통장, 연 7%, 최대 예금 500만,(1년, 아내) ==> 가입함 가입함(연 6.55%, 2년): 2013년 10월 21일(월) 
1) 위치: 기업은행 서울대역지점(서울입구역 4번 출구: 서울 관악구 봉천동 875-7번지) ==> 60만원 입금 
16:30 롯데리아(햄버거) 3개 사와서 집에 와서 먹음 
17:00 귀가 
19:00 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.22(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- EV 테스트 
1. EV pre-product config 정보 
<config> 
 <gld address="23.*" port="80"/> 
 <connect name = "provisioning" address= "46.*44" port = "5223" ssl = "true"/> 
</config> 
==============================================================================================================

- 근무 관련 회의 
1. 야간 당직자(오상협 과장)이 입원으로 인해 1달간 주간 근무자가 야간 당직 대신 서야함 
==============================================================================================================

- Nasca 문서점검 
1. 금주 보안점검으로 인해 아래 Nasca 문서점검 메일 전송 ==> 박민선 사원에게 메일로 보내기 
2. Nasca > Nasca 문서로 일괄 변환 
==============================================================================================================

- PuTTY Fatal Error 
1. Network error: Software cased connetion abort 
----------------------------------------------------------------------------- 
- PuTTY 로그인 su chatonop 자동 설정(Super PuTTY) 
1. PuTTY > Connection > SSH > Data to send to the server 
==> Remote command: su chatonop 
Password:     ===> su chatonop 안 적고 바로 비밀번호만 입력하면 로그인됨 
==============================================================================================================

- Shock StartUp 설정(현재 사용자) 
A. Windows 탐색기 설정 
1. 프로그램 추가 
 1) 이름: 01. Windows 탐색기 
 2) 데이터: C:\WINDOWS\explorer.exe 
----------------------------------------------------------------------------- 
B. EditPlus 설정 
1. 프로그램 추가 
 1) 이름: 02. EditPlus 
 2) 데이터: C:\Program Files\EditPlus 3\editplus.exe 
----------------------------------------------------------------------------- 
C. IE 설정 
1. 프로그램 추가 
 1) 이름: 03. IE 
 2) 데이터: C:\Program Files\Internet Explorer\iexplore.exe 
==============================================================================================================

- 서울에서 합천 해인사 가는 방법   
1. 서울남부터미널 → 고령 
10:08 12:00 14:00 15:00 16:45 
합천 20,900원 4시간 30분 걸립니다. 
2. 고령 -> 해인사 ==> 35분소요 
3. 숙박은 http://www.hc.go.kr/culture로 가면 알 수 있습니다.(합천군 주변지역 관광도 알 수 있습니다.)  

- 해인사관광호텔 
http://www.haeinsahotel.co.kr/01_intro/contact.asp 
1. 주소: 경남 합천군 가야면 치인리 1230-112, T) 055-* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.23(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> MSC 보안 점검(이정재. 김양호(TA), 장성율 과장(DBA) 무작위로 뽑여서 보안 인터뷰 함),  
				김성태 팀장 방문(챗온 연말 이후 계속 간다고 함) 

- ChatON 운영 Prj
- EV 테스트 
1. EV pre-product config 정보 
<config> 
 <gld address="23.*" port="80"/> 
 <connect name = "provisioning" address= "46.*44" port = "5223" ssl = "true"/> 
</config> 
-----------------------------------------------------------------------------------------------------------------------------

91. Pre-PRD: rue1sv001   
Status = HTTP/1.1 503 Service Unavailable: Back-end server is at capacity ==>  Back-end server (full) 가동 중.. 

(rue1sv001)chaton@ec2-50-19-49-170:~$  netstat -an  grep '5306' ==> MySQL DB 연결 여부 확인 @@@ 
(rue1sv001)chaton@ec2-50-19-49-170:~$  tail -f clog    grep 'Exception' ==> 로그 확인 @@@ 
(rue1sv001)chaton@ip-10-248-111-93:/mnt/log$  cat /mnt/log/web.log  less ==> 전제 로그 조회 @@@ 
==============================================================================================================

1. EV pre-product config 정보(이전 꺼) 
<config> 
 <gld address="54.*" port="80"/> 
 <connect name = "provisioning" address= "46.*44" port = "5223" ssl = "true"/> 
</config> 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.24(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 야간 당직자(오상협 과장) 근무 3일 서는 것으로 결정남(2주 입원 후 재근무함) 

- ChatON 운영 Prj
- Privacy-i 작업 
1. 모든 패턴을 설정하여 검색, 수정 처리 
==============================================================================================================

- Escort 시스템을 이용하여 보안점검 ==> 결과 캡처 후 박민선 사원에게 메일 전송(완료) 
==============================================================================================================

- buddy 서버 401 에러 관련 회의(15:30 ~ 16:00) 
1. uid가 존재하는 단말 탈퇴자가 upload address list, get all buddy API에 지속적으로 접속해서 나는 에러 코드 
==> 정식 에러가 아니고 서버 운영에 영향 없음 
2. pew1bd001m 서버에서 5월 8일에 5** 건, 10월 23일 현재 4만 6천 건 발생(401 에러: login interceptor) 
3. 결론 
 1) 남선임이 buddy 서버 2차 담당자인 전자 신규현 책임에게 메일 보내서 확인 후 작업일지에 버디 서버 result code  
모니터링 건 조사 작성을 안 하는 방향으로 한다고 함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.25(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- EV 테스트 
91. Pre-PRD: rue1sv001 서버 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.10.26(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- 주말 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
06:40 숏게임 
07:00 게임(0:0 무) 
08:00 종료 
08:50 종료 
09:30 서울 김정아 소아과 (대기 11명): B형 간염 예방 접종(2차): 무료, T) 872-8276, 페디오키디(비타민D) 구입(2만원) 
	- 아기 예방 접종 예정(9시) 
1. 2013.11.24(토): DPT(1차) --> 무료(필수), 2. 2013.11.24(토): 로타릭스(1차) --> 12만원 
10:30 종료 
10:50 귀가 
13:10 중식  
15:00 책 반납, 대여(글빛도서관) ==> 1. Hello! 아빠육아, 2. 좋은 아빠의 자격 : 아마추어 아빠에서 프로 아빠가 되는 길잡이 
        3. (덜렁이 엄마 변정수의)야무진 육아 
17:00 귀가 
18:40 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.27(일) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 09:00 ~ 18:00 --> 신사 조기회 제 33주년 창립기념식 

▦조기축구 
06:45 기상 
07:10 국민은행 봉천동지점 앞(태훈이형 차) 
07:40 신구초등학교(창립기념식 준비 끝남) 
08:00 게임(1:1 무) ==> 프랜즈팀, 가락동 수산시장팀 초청 
09:00 기념식 
10:00 게임(1:0 패)  
12:30 중식(육계장, 보쌈 고기, 떡) ==> 운동장에서 
14:00 종료 
14:20 뒷정리(주전자에 육계장 얻어옴) 
16:00 영기형 차 얻어타고 집에 옴 
17:00 귀가 
18:40 석식 
21:20 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.28(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 21:00 --> 당직 

- ChatON 운영 Prj
- rue1sv001 서버 AWS instance reboot 및 stop -> start 시 local disk 자동 마운트(rue1bd001 서버) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.29(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Prj
- EV 테스트 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.30(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> (주)IST 임기택 과장 철수 

- ChatON 운영 Prj
- EV 테스트 
(connect)chatonop@ip-10-132-84-100:/chaton/users/tamario2.jin$  cd /home/chatonop/war/sv
==> 디플로이할 war 파일을 MSC개발자가 upload 했는지 확인 @@@ 
91. Pre-PRD: rue1sv001 서버 ==> alias  grep rue1sv001 
Status = HTTP/1.1 503 Service Unavailable: Back-end server is at capacity ==> Back-end server (full) 가동 중.. 

(rue1sv001)chaton@ec2-50-19-49-170:~$  cd /home/chaton/service/bin 
chaton@ec2-107-22-125-48:~/service/bin$ ./re.sh ==> 서버 재시작 @@@ 

(pue1os001)chaton@ec2-50-19-49-170:~$  cd /home/chaton/service/conf 
(pue1os001)chaton@ec2-50-19-49-170:~$  vi /home/chaton/service/conf/ssm-server.properties 

(pue1os001)chaton@ec2-50-19-49-170:~$  cat /home/chaton/service/conf/ssm-server.properties  
grep 'mysql' ==> 내용 확인 @@@ 

(rue1sv001)chaton@ec2-50-19-49-170:~$  curl http://127.*:10080/dummy3
==> 서버가 정상적으로 떳는지 확인함(DB 정상 연동 여부 확인) @@@ 
dummy 1382933786 

(rue1sv001)chaton@ec2-50-19-49-170:~$  netstat -an  grep '5306' ==> MySQL DB 연결 여부 확인 @@@  
tcp6       1      0 10.*:57290       10.*:5306       CLOSE_WAIT 
tcp6       0      0 10.*:57315       10.*:5306       ESTABLISHED --> 마지막에 ESTABLISHED면 성공 @@@ 
(rue1sv001)chaton@ec2-50-19-49-170:~$  tail -f clog  grep 'Exception' ==> 로그 확인 @@@ 
(rue1sv001)chaton@ip-10-248-111-93:/mnt/log$  cat /mnt/log/web.log  less ==> 전제 로그 조회 @@@ 
----------------------------------------------------------------------------------------------------------------------------- 

92. Pre-PRD: rue1bd001 서버  ==> alias  grep 1bd 
$ tail -f  /home/chaton/buddy/log/web.log 
$ cat  /home/chaton/buddy/conf/ssm-server.properties  grep 'mysql'  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.10.31(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00  

- ChatON 운영 Prj
- W44 정기 배포 준비 
1. 서버 change : 17건, DB change : 3건, Config change : 4건 
2. 담당 서버: bd, ob, os ==> 총 30개 서버 
==============================================================================================================

- eclipse 실행시 Failed to create the Java Virtual Machine. 에러 발생 
1. 조치: 
 1) C:\eclipse\eclipse.ini 파일을 열어서 아래 내용 추가 
-vm 
C:\Program Files\Java\jdk1.6.0_26\bin\java.exe 
==============================================================================================================

- 에이치플러스 모텔 예약 
1. 농협: 352-0593-3751-53, 예금주: 이기덕, 17만원 송금 ==> 당일가서 6만원 돌려 받을 것 
2. 경남 합천군 대병면 유전리 180-1, T)055-933-7888(010-7234-4242), http://www.hplusmotel.com  
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
