

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.01) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.01.02(수) 작업 ■■■■■■■■■■■■■■■
---> 06:25 ~ 19:00 --> ChatON 추가 투입(2명): 장성율 과장(011-9522-0), 조대형 과장(010-6679-0) 

- ChatON 운영 Proj
- ChatON 분석 문서 작성  
1.6.9. Delete All Itemsm ==> Done 
==============================================================================================================

- 당직 근무 확정 ==> 김팀장님은 임시 근무라고 함  
1. 평일(저녁): 09 ~ 21시(회사에서 대기) 
    평일(야간): 21 ~ 09시(집에서 대기) 
2. 주말(오전): 09 ~ 21시(회사에서 대기) 
   주말(야간): 21 ~  09시(회사에서 대기) 
==============================================================================================================
  
- 비자서류준비[1월 4일(금)까지 작성] @@@@@@ 
1. 혼인관계증명서, 가족관계증명서, 주민등록등본, 주민등록증 앞뒤복사, 여권복사, 인감증명 2부 ==> 확인 @@@ 
2. 재직증명서(재직중인 회사) ==> 확인 @@@ 
3. 근로소득원천징수영수증==> 확인 @@@ 
4. 사업자등록증명원(재직중인 회사꺼) 인터넷 국체청에 들어가면 무료발급가능 ==> 확인 @@@ 
5. 집등기부등본, 전세계약서 ==> 확인 @@@ 
6. 건물, 토지등기부등본, 각종 보험가입확인서, 국민연금가입서, 자동차등록증, 적금 및 주식 등  
01. 01. KB미래펀드[국민은행] 9,141,941  ==> 일반 출력  
02. SC은행  29,123,882 ==> 일반 출력  
03. 메리츠증권 CMA 43,651,555 
04. 동양펀드 9,161,561 
05. 미래(미래에셋KorChindia) 4,623,861 
05. 미래(미래에셋브라질) 4,270,655 
06. 삼성펀드[SC은행] 5,202,539 ==> 일반 출력 
07. MET종신 6,920,000 
08. PCA변액 24,000,000 
09. 대생연금 17,800,000 
==> 서울시 강남구 역삼동 825-22 미림타워 4층 ChatON 운영팀 
7. 납세영수증, 자동차등록증원부(해당사항 없음) ==> 확인 @@@ 
8. 이혼사유서(해당사항 없음)(제외) ==> 확인 @@@ 
9. 1년간 통장거래내역서, 회사원이면 월급 입금되는 통장(SC 은행에서 발급) ==> 확인 @@@ 
10. 본인신용정보조회서(전국은행협회: http://www.credit4u.or.kr ==> tamario/tama339@  ==> 확인 @@@ 
11. 건강진단서 ==> 확인 @@@ 
12. 
 1) 범죄경력조회 회신서(최근 10년이내의 금고이상의 형에 해당하는 범죄경력) 유효기간 3개월 
 2) 범죄경력. 수사경력조회 회보서(2개 발급 받을 것) ==> 확인 @@@ 
13. 초정장 3장(견본과 문서는 회사에서 줌) ==> 확인 @@@ 
 14. 교제경위서(별도로 회사대표가 씀) - 쓴후 인감도장찍고 인감을 첨부해야 함 ==> 확인 @@@ 
15. 신원보증서(뒤에 인감증명 부착)(견본과 문서는 회사에서 줌) - 보장기간은 3년 ==> 확인 @@@ 
16. 국제결혼프로그램이수증 ==> 확인 @@@ 
17. 혼인관계입증자료(통화내역서(전화카드 사용하면 편리함)) ==> 확인 @@@ 
18. 결혼사진 1매 ==> 확인 @@@ 
19. 가원커플 국제결혼 등록증, 사업자등록증 또는 사업자등록증명원 ==> 확인 @@@ 
20. 소개경위서(소개인이 있을 경우) - 소개인을 쓰고 신분증, 혼인관계증명서(??) (별도로 회사대표가 씀) ==> 확인 @@@ 
21. 사증심사시 참고자료(한국인 배우자가 기재): 하노이 지역 ==> 확인 @@@ 
==============================================================================================================

- 교재 경위 
저는 2012년 2월 경에 국제결혼을 결심하고 가원웨딩에서 운영하는 카페를 통해서 
여러번 정기모임에 참석하여 국제결혼을 해서 행복해하는 부부들을 직접  
눈으로 보면서 착실하게 사전 준비를 했습니다. 4개월간의 준비 과정을 거쳐서  
6월 30일 가원 직원분과 베트남에 가서 천사같은 아내와 결혼을 했습니다.  

그 이후 거의 매일 하루에 2시간 정도 야후 화상통화를 하면서 사랑을 키웠으며 베트남어 
공부를 다름 열심히 했습니다.  
9월 추석 기간 동안 1주일 간 하이퐁 처가를 방문하여 화목한 가족을 이루며 재미있게  
살고 있는 처가 식구들을 보며 많이 행복했었습니다.  
12월 말에 2차 인터뷰를 다녀와서 더욱 돈독한 서로의 사랑을 확인 했습니다. 

저는 가난한 농부의 아들도 태어났지만 열심히 노력하여 서울에서 
어느 정도 기반을 잡았습니다. 비정규직이지만 삼성SDS 1차 협력업체인 
(주)아엘포유에 근무를 하고 있으며 프로그래머라는 전문 직종이여서 
월급도 한달에 500만원 정도 받습니다. 신부가 한국에 입국하면 서울에서 
아파트 전세를 얻어서 행복하게 살 정도의 돈도 모았습니다. 

저는 사랑하는 저의 부인인 루옌을 행복하게 해줄 정신적, 물질적 조건을 
다 갖추었다고 생각합니다. 앞으로 닥쳐올 현실이 아무리 어렵고 힘들더라도 
한 가정의 가장으로서 부인을 믿고 사랑하며 힘든 현실을 함께 이겨 나갈 것을 
제 이름을 걸고 맹세를 합니다. 큰 행복과 큰 물질보다는 작은 행복이 많이  
모여서 사랑이 가득 찰수 있도록 신부와 항상 대화하고 서로를 이해하며 
살겠습니다. 

2차 인터뷰를 떠나올 때 눈물을 흘리든 우리 신부가 아직 눈에 아려 옵니다.  
저의 신부의 한국에 와서 행복하게 살수 있도록 최선의 노력을 다할 생각입니다. 
서류가 잘 진행되어 한국에 나올수 있도록 도움주십시요.  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.03(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 조대형 과장 휴가, 팔 탈골된 것 같음 

- ChatON 운영 Proj
- ChatON 분석 문서 작성   
 1.7.1. Add Comment ==>     
==============================================================================================================

- ChatON 1차 대응을 위한 교육 
1. Nagios(이정모 선임): 서버 모니터링(SGMP로 변경할 예정) 
01. Nagios_ap-NE(Tokyo) 
02. Nagios_eu-W(Ireland) 
03. Nagios_ap-SE(Singapore) 
04. Nagios_us-E(N. Virginia) 
2. AMS(김명성 사원): App 서비스 모니터링 
------------------------------------------------------------------------------------------------------ 

- ChatON 1차 대응 당직 근무의 문제점(개발자 회의) 
1. 주말 회사 출근하여 대기는 문제가 있음 ==> 집에서 대기 희망 
2. 평일 저녁 2명 근무를 1명으로 줄이기를 희망 
3. sms g/w, dba의 근무 시간이 너무 많음 
==============================================================================================================

- ChatON 접속 
01. ChatON 중계서버 SSH 접속 
 --> 50.19.93.226: 22, ID : ubuntu 
02. ChatON 중계서버 SSH 접속 
 -->  46.51.247.21: 22, ID : chaton/m0daebak 
==============================================================================================================

- 주남이형 노트북 고장(삐 3번) 
1. http://kin.naver.com/qna/detail.nhn?d1id=1&dirId=10102&docId=155488663&qb=64W47Yq467aBIOyCkCAz67KI&enc
=utf8&section=kin&rank=1&search_sort=0&spq=0&pid=RMgTL35Y7uNssvFw4Ghssssssud-170102&sid=UOTWK3JvLDMAADWYEPo 
2. 노트북 뒷커버 램장착하는 부분을 열고 램을 뽑았다가 다시 끼워주시고 
그래도 비프음이 계속된다면 AS받으셔야 합니다. 램 문제가 아니라면   
노트북은 모든 부품이 메인보드에 붙어 있으므로 메인보드 문제입니다.. 
http://kin.naver.com/qna/detail.nhn?d1id=1&dirId=10102&docId=125270622&qb=64W47Yq467aBIOyCkCAz67KI&enc=utf8&section=
kin&rank=10&search_sort=0&spq=0&sp=1&pid=RMgTL35Y7uNssvFw4Ghssssssud-170102&sid=UOTWK3JvLDMAADWYEPo 
3.  
http://kin.naver.com/qna/detail.nhn?d1id=1&dirId=10102&docId=70081270&qb=64W47Yq467aBIOyCkCAz67KI&enc
=utf8&section=kin&rank=3&search_sort=0&spq=0&pid=RMgTL35Y7uNssvFw4Ghssssssud-170102&sid=UOTWK3JvLDMAADWYEPo 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.04(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 21:00 --> ChatON 추가 투입: 하민규 과장(*), 당직 시작 

- ChatON 운영 Proj
- ChatON 분석 문서 작성   
1.7.1. Add Comment ==>     
==============================================================================================================

- PCA 무배당 PCA드림링크 변액유니버셜보험 해약 및 중도 인출 
1. 예상 해지환급금: 22,433,330원(2012-12-31일 접수시) 
2. 중도인출가능금액: 13,450,000원 
3. 납입금액: 24,000,0000원 
==============================================================================================================
   
■■■■■■■■■■■■■■■■■■ 2013.01.05(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 21:00 

- 허우씨집 방문 
06:30 기상  
06:40 신봉천 주유소(태훈이형 차)  
07:10 신구초등학교    
07:30 제설작업(눈이 안 녹고 얼어서 공 못 참)  
08:30 종료  
08:40 조식(콩나물 해장국: 조기회에서 쏨) 
       - 조기회 홍보부장으로 임명되었다고 함(사진 촬영, 카페 홈페이지 관리) 
       - 신사통장 계좌번호:신한은행 110-379-742870, 예금주: 서정홍 
09:20 종료 
10:20 귀가 
12:20 중식(라면) 
13:30 집출발(낙성대역 -> 창동역 -> 낙양역) 
15:00 낙양역 앞에서 35번 버스 
15:20 세아아파트(의정부 성모병원 근처) 도착 
15:30 허우씨 도착(의정부시 금오동 80-20 세아아파트 101동 203호: 바나나 사감) 
        허우씨 어머니, 딸 세아, 시어머니(다리 골절) 
18:10 석식(삼겹살: 허우씨가 쏨): 딸 세아에게 용돈(만원) 줌 
19:00 종료 
19:10 206번 마을버스 
19:30 의정부역 도착(의정부역 -> 창동역 -> 사당역 -> 낙성대역): 정코드임 
20:40 낙성대역 
21:00 귀가 
21:20 루옌(부인)과 화상통화(간단하게 함) 
22:00 종료 
23:00 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.06(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:35 ~ 21:00 

- ChatON 운영 Prj
- ChatON 당직근무 
1. 미주 message2 Disk usage 문제 발생(09:10) 
2. 싱가포르 buddy1 cpu usage 문제 발생(09:50) ==> 임광기 과장에게 전화 
> alias  grep buddy  ===> 서버 검색(buddy)   
> prod-ap-southeast-1-buddy1 ===> alias 빼고 바로 집어 넣음: 싱가포르 buddy1번 서버  
3. 기타:  
 1) 남선임에게 전화해서 SDS직원이 OTP 대기 안 한다고 함 
 2) 미림타워 관리실(2054-7990)에 전화해서 난방 요청 
==============================================================================================================

- 주말 당직 근무 
08:00 기상  
08:35 출근 
09:10 상황실에서 미주 message2 Disk usage 문제 발생 전화 통보 받음 
09:50 상황실에서 싱가포르 buddy1 cpu usage 문제 발생 전화 통보 받음 ==> 임광기 과장에게 전화함 
12:20 중식(빵) 
14:30 남선임에게 전화해서 SDS직원이 OTP 대기 안 한다고 함 
14:50 미림타워 관리실(2054-7990)에 전화해서 난방 요청 
20:50 인호진 과장 커피 사들고 옴(빵 2 개 얻어 먹음) 
21:00 종료 
21:20 DMB 시청(개그콘서트) 
22:50 종료 
23:00 퇴근  
23:20 석식(도시락, 라면: 편의점) 
23:30 올림피아 사우나(야간: 만원): 02-566-1892, 서울 강남구 역삼동 828-10  
23:40 목욕 
24:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.07(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- AMS 서버 DB 쿼리 관련 회의  
1. 문제 DB 쿼리 분석해서 작성할 것(Serviece API 없음) 
==============================================================================================================

- ChatON 운영 및 개발 계약(아이엘포유) 
1. 수행업무:  ChatON 운영 및 개발 
2. 기간: 2013.01.01 ~ 02.28(2개월) 
3. 내용: 정규직(1,200,000원), 프리랜서(*,700,000원) 2가지 계약 체결(총: 5,900,000원), 4대보험, 퇴직금 
4. 계약 대행: (주)아엘포유 SI 사업부 김성채 팀장(H: 010-2352-0): http://www.il4u.co.kr 
5. 갑: 주식회사 솔루션허브 대표이사 노영식(서울시 마포구 공덕동 404 풍림브이아이피텔 4층 411호) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.08(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:20 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.7.1. Add Comment ==>  
==============================================================================================================

- 종민씨집(지히철로 2시간 걸림) 
주소: 경기도 고양시 일산동구 정발산동1188-8호 
==============================================================================================================

- 집 구하기(관악구)(19시) 
1. 태양부동산 방문 
2. 빌라 3개 구경 
 1) 봉천동 31평, 신축, 주차 가능 ==> 2억(1억 9천에 하자고 해서 거부 당함) 
 2) 신림동 24평, 신축, 주차 가능 ==> 2억(구조가 안 좋음) 
 3) 쑥고개 24평, 신축, 주차 가능 ==> 1억 7천(교통 나쁨, 언덕, 길가라 시끄러움) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.09(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 정기총회(신사조기회), 양정훈 과장 투입(메드인 헤븐) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성   
1.7.1. Add Comment ==>   
1.7.2. Remove Comment ==>  
1.7.3. Get Comment List ==> Done 
==============================================================================================================

- 정기총회(신사조기회) 
1. 장소: 부옹성(5434-1778): 서울 강남구 신사동 590-12(서초03번 마을버스): 강남역에서 걸어서 35분 걸림 
2. 안건 
 1) 추리닝: 춘추복으로 맞추고 구입 방법은 전체 회원 의견 뭍기로 함 
 2) 운동장에서 음주, 흡연 금지 
 3) 명예 실추 회원 제명 
3. 참석인원 
1) 한상봉 회원, 이병규 총무, 서정홍 재무, 이승렬 코치, 유영혁 감사, 이규남 섭외, 진태만 홍보, 권영석  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.10(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:30 ~ 18:10 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.7.1. Add Commen t==> Done 
1.7.2. Remove Comment ==> 소스 불충분 
==============================================================================================================

- 집 구하기(관악구)(19시) 
1. 태양부동산 방문 
2. 빌라 3개 구경 
 1) 봉천역 근처 31평, 주차 가능 ==> 1억 8천, 4층, 개 키우고 엄청 지저분함. 
 2) 봉천역 근처 31평, 주차 가능 ==> 1억 3천, 언덕있고 4층(너무 멀고 언덕, 건물 낡았음) 
 3) 봉천역 근처 24평, 주차 가능 ==> 1억 3천, 언덕있고 2층(언덕, 건물 낡았음) 
 4) 낙성대역 근처 30평, 주차 가능 ==> 1억 8천, 언덕있고 2층(신혼 부부라 깨끗하게 사용 ==> 마음에 듬) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.11(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:40 ~ 18:00 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.11.1. Get SNS ID ==> Done 
1.11.2. Post SNS ID ==> Done 
1.11.3. Poist SNS friend List ==> Done 
==============================================================================================================

- [ChatON Proj 회식(아이엘포유)] 
1. 일시: 2013년 1월 11일 (금) 18:30 ~ 21:30 
2. 장소: 마린쿡(양재역 3번출구: 강남구 도곡1동 953-1번지 SK허브 지하2층, 해산물 부페) 
3. 참석: (주)아이엘포유 김팀장님, 프리랜서 등(전원 참석) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.15(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 

- 집 구하기 
09:00 기상(눈옴) 
10:00 새문빌라 근처 답사(봉천초교) 
10:40 태아부동산(새문빌라 301호에 대해서 세밀한 분석) ==> 전세 1억 9천 5백에 계약하기로 함 
11:30 계약서 작성(주인 임대길씨 도착) ==> 아들에게 증여 후 다시 계약서 작성하기로 함 
13:20 종료 
14:00 귀가 
14:10 계약금 2천 만원 송금 
14:30 중식(라면)  
15:30 루옌과 화상통화(아이패드) 
15:30 집출발 
19:10 베트남 신랑 모임 ==>일산 화정역 2번 출구(응아 남편, 홍 남편) 
19:20 문구점(인감 안 찍어와서 A4지 구매) 
19:30 고기부폐(회비 3만원씩 냄) 
20:40 종료 
20:50 소주집 
22:00 종료 
22:10 화정역 출발 
23:30 귀가 
23:40 취침 
==============================================================================================================
  
- 빌라 전세 계약[2013년 1월 12일] @@@ ==> 태양부동산 윤실장(서울대입구역 8번 출구)  
1. 주소: 서울시 관악구 봉천동 28-22 새문빌라 301호(서울시 관악구 행운1바길 19) 
2. 태양부동산에서 계약 체결(대표: 정무준, T) 02-874-8200 
3. 계약금 송금: 농협(772001-04-139583 임대일(*)), 2천만원 ==> 송금 완료 
 ==> 전세 1억 9천 5백에 계약(잔금: 1억 7천 5백 만원 이사 완료 후 지급) 
4. 주소: 서울시 동작구 사당로 16사길 52 302호, 임대인: 임대일(*) 
5. 주인 계좌번호: 국민은행 772001-04-139583, 예금주: 임대일 
6. 면적: 72.12m2(21.5평) ==> 실제 32평이라고 함 
7. 특약 사항 
  1) 기본 및 현 시설 상태에서의 임대차 계약임. 
  2) 등기부등본, 중개대상 확인 설명서, 공제증서 설명하고 교부함. 
  3) 2013년 2월 28일 소유권이 변경되며 변경시 계약서를 재작성한다. 
  4) 등기부등본상 채권최고액 금 294,000,000원이 우리은행에 설정되어 있으며 2013년 2월 28일까지 말소조건임. 
  5) 관리비는 월2만원임(공동관리비) 
  6) 기타 사항은 임대차 관리법에 따른다. 
8. 기타 
- 중계 수수료: 585,000원(미납): 이사시에 지급할 것 
- 수도세7만(월 5천원) 
- 이사일: 3월 2일 
- 이사 1주일 전 주인에게 전화: 보일러 틀어줌 
------------------------------------------------------------------------------------------------------------------------- 

- 구입해야 품목(혼수) 
1. 42인치 LED TV, TV 다이, 김치냉장고, 에어컨. 청소기 
2. 침대, 화장대, 이불, 커텐(3개), 3단행거, 쇼파, 식탁, 빨래건조대, 양복, 한복(신부) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.13(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
06:30 기상(눈 많이 옴) 
07:20 신봉천 주유소(태훈이형 차) 
07:50 신구초등학교  
08:20 게임(0:1 패): 광진구팀 초청경기 
09:30 게임(1:3 패) 
11:25 게임(1:1 무) => 진병룡 더티 매너 
12:50 중식(문경세재: 갈비탕 ==> 조기회에서 쏨)  
13:30 종료 
14:00 강남터미널(태훈이형 차) 
15:00 터미널 수하물(김치, 반찬 등) 
16:20 귀가 
19:40 낮잠 
20:00 석식 
21:10 루이엔(부인)과 화상통화(TV 잠깐 봤다고 삐져서 나감) 
22:20 종료 
23:40 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.14(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.10.2. Get Compatibility Buddy List  ==> Done  
==============================================================================================================

- elipse 다운로드(juno) 
http://www.eclipse.org/downloads/download.php?file=/technology/epp/downloads/release/juno/SR1/eclipse-jee-juno-SR1-win32.zip 
1. ChatON 운영 Proj 설치후 svn > NewDocumnet > 01. Design > 01. Install > chaton.zip 파일 다운 받아 설치할 것 
==============================================================================================================

▦ 펀드 해지 @@@@@@ 
- 펀드 가입(SC은행: 월 10만원 적립(25일 자동이체)) ==> 2011년 01월 10일 @@@@@@ ==> 매도, 3일후 입금됨 
1. 계좌번호: 275-61-029206(고객번호: 0607042) 
2. 펀드명: 한국골드적립삼성주식C1 
3. 펀드유형: 추가형(개방): 자유적립식 
4. 만기일: 2016년 1월 11일   
==> 해지 환금급: 5,054,287원 
-------------------------------------------------------------------------------------------------------- 

- 동양모아드림주식1호Class @@@@@@ ==> 2006년 05월 11일 @@@@@@  ==> 매도 신청(인터넷), 3일후 입금됨 
1. 계좌번호: 710-01-003202 계좌비밀번호: 5*** 
2. 국민은행 가상계좌: 801390-60-429074(80139060429074) 
3. 동양 CMA 통장 @@@@@@ ====> 나눔동기계, 포항계 전용 통장으로 용도 변경 됨(2006.9월 부터) 
1) 이용자ID: tamario 이용자 비밀번호: ss***8** 
2) 계좌번호: 710-71-016414 계좌 비밀번호: 5*** 이체 비밀번호: 103**(339) 
3) 국민은행 가상계좌: 801390-60-429087(80139060429087) 
4) 연락처: 금융센타 대구본부 T) 053)256-0900 
==> 해지 환금급: 9,030,768원 
-------------------------------------------------------------------------------------------------------- 

- 미래에셋 3억만들기 인디펜던스 증권투자신탁 K-1호(주식)-C5 ==> 2005.02.24 @@@@@@   ==> 매도 신청(인터넷) 
1. 계좌번호: 275-612-029206(고객번호: 0607042) 
2. 펀드명: 미래에셋 3억만들기 인디펜던스 증권투자신탁 K-1호(주식)-C5 
3. 펀드유형: 추가형(개방): 자유적립식 
4. 만기일: 2016년 1월 11일 
 ==> 해지 환금급: 9,209,880원 
-------------------------------------------------------------------------------------------------------- 

- 미래에셋펀드  ==> 2005.02.24 @@@@@@  ==> 1월 23일(수) 미래에셋펀드에 전화(3475-0700) 08시에 할 것 
1. 미래에셋 브라질업종대표 자1(주식)종류A , 계좌번호: 052 99 007971, SC은행에서 가입 
2. 미래에셋 코친디아포커스7 1(주식)종류A, 계좌번호: 052 99 007971, SC은행에서 가입 
 ==> 해지 환금급:  
==============================================================================================================

- 나눔동기회 계좌 정리 ==> 1,360,000  
2012.12.29 16:40:09  전자금융 장종환  200,000 1,320,000  단위농협  
2012.12.10 13:34:40  전자금융 장광석  400,000 1,060,000 SC은행  
2012.11.15 10:36:18  전자금융 장광석  400,000 600,000  SC은행  
==============================================================================================================

- 집 구하기(관악구)(19시) 
1. 101호 주인(정평순)에게 전화해서 3월 1일(금) 이사 통보 
 1) 주인이 부동산에 가서 101호를 월세 보증금 1,000만원에 월 45만원에 내놓으라고 함 
2. 태양부동산 방문해서 윤실장에게 주인의 월세 조건 전달 
 1) 101호 열쇠 전달 
 2) 101호 월세 그 조건이면 빠지기 힘들다고 함 
3. 퇴근해서 1시간 가량 집 청소함 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.15(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 이승민 과장하고 근태 문제로 다툼, (주)아이엘포유 전체회의 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.10.2. Get Compatibility Buddy List ==> Done  
==============================================================================================================

- 설 차표 예매(11시) 
1. 예매일시 및 장소 
 1) 경부, 충북, 경북, 대구, 경전, 동해남부선  
--> 07:00~09:00: 역ㆍ대리점(세중나모 강남: 서울시 서초구 서초동 1321-15 삼성생명빌딩7층, T)02-3288-1919) 
--> 11:00~12:00: 인터넷 
2. 대상 승차권 : 2013. 2. 8.(금) ~ 2.10.(일, 설) ~ 2.12.(화), 5일간  
3. 명절승차권은 1인당 2건, 1건당 최대 6매 이내(왕복제한 없음, 최대 12매)로 제한하고 있습니다. 
4. 예약 완료된 승차권은 2013.1.16.(수) 14:00부터 결제가 가능하고 2013. 1. 23.(수) 24:00까지 결제하지 않은  
승차권은 자동으로 예약이 취소됩니다.  
==============================================================================================================

- 현용 만남  
1. 명동역(19시 30분) 
2. 석식(콩나물국밥) 
3. 소주(22시 종료) ==> C9 폐업, 현용 신불자 해제 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.16(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> 김팀장 면담(차오름: 고구마 라떼), 설 연휴 휴가 문제로 개발자 회의(11일(월) 오전 근무 지원) 
			--> 한일평 과장 낙상사고로 결근 처리(SDS에 휴가 신청) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.10.2. Get Compatibility Buddy List ==> Done  
==============================================================================================================
  
- 설 고속버스 예약(2013.01.16(수)) 
1. 서울경부 --> 포항: 02.08(목) 13:20, 천일(일반, 좌석: 1), 20,500원 
1. 서울경부 --> 포항: 02.08(목) 19:20, 천일(일반, 좌석: 5), 20,500원 
2. 포항 --> 서울경부: 02.11(월) 01:00, 한일(야간우등, 좌석: 16), 33,400원 
2. 포항 --> 서울경부: 02.12(화) 01:00, 동양(야간우등, 좌석: 14), 33,400원 
==============================================================================================================

- SVN 요청 
양정훈 과장 ==> j.hoon.*@*.* 
남현종: hyunjong.nam pager015 
svn://70.4.121.240/CHATON ==> hyunjong.nam/sds2012 
==============================================================================================================

- TF 솔루션(전용길) 
http://www.pop-corn.co.kr ==>  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.17(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> PM 면담(설 연휴 당직): 거부 당함, 배과장 만남(갈비살: 내가 쏨) 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.10.2. Get Compatibility Buddy List ==> Done 
==============================================================================================================

- ChatON 서버 연결 
01. ChatON 중계서버 ==>  
--> 인증방법(M): Pubic Key, 사용자 이름(U): ubuntu, 사용자 키(K): chaton.us.east.ppk 
51. ChatON 중국서버 ==>  
--> 인증방법(M): Password, 사용자 이름(U): chaton, 비밀번호(P): 
71. SPCS[검증서버] ==>  
--> 인증방법(M): Pubic Key, 사용자 이름(U): chaton, 사용자 키(K): ssk1adm.ppk 
--------------------------------------------------------------------------------------------------------------------- 

02. SPP 중간서버 --> 
03. jira 서버 -->  
==============================================================================================================

- putty puttygen 사용  
1. putty puttygen 다운로드 
http://www.chiark.greenend.org.uk/~sgtatham/putty/download.html 
2. putty puttygen 사용법 
http://mcchae.egloos.com/5204051 
 1) putty puttygen > iosp-dev-auth: Action: load --> iosp-dev-auth.pem(Save private key 클릭) ==> auth.ppk 생성됨  
Xshell용 public key를 생성해야 함  ===> ssk1adm_public.ppk 
==============================================================================================================

- 설 연휴 근무 지원자 
1. 09(토) 주간 ==> 김홍원 --> 대체휴일: 12일(화) 
1. 09(토) 야간 ==> 조대형 --> 대체휴일: 12일(화) 
2. 11(월) 주간 ==> 진태만 --> 대체휴일:  9일(금) 
2. 11(월) 야간 ==> 이승민 --> 대체휴일: 12일(화) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.18(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 -->  전해성 과장 결근 

- ChatON 운영 Prj
- ChatON 분석 문서 작성 
1.10.2. Get Compatibility Buddy List ==> Done 
==============================================================================================================
  
- PM 전체 호출 
1. 출퇴근 시간 철처히 준수할 것 
2. 단체로 몰려 다니지 말고 불만 있으면 직접 PM 면담 요청할 것 
==============================================================================================================

- 미주지역 
현재 미주지역 파일, 이미지, 글러스터 로드에버리지 수치가 올라가면서 ev및 단말기 파일테스트가안되고있습니다. 
자주 뜨는현상이라 전자담당자에게 연락을 드린상황입니다. 
==============================================================================================================

- 도시가스 청구서 
91. 한빌(청구서) http://www.hanbill.com 
==============================================================================================================

- 싱가포르 지역 에러 통보(18:53) 
1. 현상: 
SG지역 EV테스트 해보았는데 메세지 전송 불가 현상 / 단말기는 이상 없습니다. 나기오스 이상없습니다. 
2. 조치: 싱가포르 메세지 서버(prod-ap-southeast-1-message1) 서버점검 
> tail -f Chaton_message_server 
> vi Chaton_message_server 
안녕하세요? 당직 근무자 입니다. 싱가포르 메세지 서버쪽 점검을 
해봤는데 서버 이상이 없고 로그도 별 이상이 없습니다. 
임광기 과장님에게 전화를 하니 오늘 오후에도 발생한 현상이라고 
합니다. 전자에 요청을 해야될 것 같습니다.  
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.19(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 21:00 
  
09:30 기상 
12:20 중식 
13:30 봉천중앙시장(구두 주걱 구입) 
18:10 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.20(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
07:00 기상  
07:50 신구초등학교(버스 타고 감: 태훈형 서버 이전 작업) 
08:20 숏게임(0:1 패) 
09:10 게임(2:1 승): 가양동팀 
10:25 게임(2:1 승) 
12:20 중식(문경세재: 갈비탕 ==> 조기회에서 쏨)  
13:30 종료 
13:20 버스 
15:10 봉천초등학교(여자 야구팀 연습함: 잘함) 
16:30 관악중학교(조기축구팀) 
17:20 귀가 
17:30 낮잠 
19:30 기상 
20:00 석식 
21:20 루이엔(부인)과 화상통화(장인어른 일 갔다가 옴) 
22:00 종료 
22:10 TV시청(개그콘서트) 
22:50 종료 
23:10 낙성대역 
23:50 올림피아 사우나(야간: 만원): 02-566-1892, 서울 강남구 역삼동 828-10  
23:40 목욕 
24:30 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.21(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> 당직 근무(21시 ~ 익일 09)  

- ChatON 운영 Prj
- 1차대응조치내역 분석 
1. 상황별 체크 
==============================================================================================================

- alias명 조사 
1. 김상봉 과장에게 메일로 전송 완료 
==============================================================================================================

- 당직  
1. 일시: 21 ~ 익일 09 
2. 장소: 집 대기(퇴근 전 백인출씨 휴대폰 번호를 내 폰번호로 변경하고 갈 것) 
------------------------------------------------------------------------------------------------------ 

- 당직 근무 결과  
1. 유럽 서버(pew1bd001m, pew1bd002m) 서버 분석 요청 ==> 2013.01.22(화) 07:00 
2. 분석 결과: 서버에 접속자가 많아서 imsi(휴대폰 번호 코드)를 못 받아 오거나 잘못된 형식으로 받아와서  
Registration Service(등록 서비스)에서 등록시 에러가 나는 것으로 추정 됩니다.  
3. 조치: 아마도 서버 세팅시 사용자 부하를 면밀히 판단 안하고 서버를 구성해서 나는 에러로 판단됩니다. 
해당 서버 내리고 다시 리스타트하면 문제가 없을 듯 합니다. 
4. 호출 
 1) 12:00 호출 
 2) 07:00 CHATON-pew1bd001m 서버 로그 분석 호출 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.22(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 

- ChatON 운영 Prj
- 1차대응조치내역 분석 
1. 상황별 체크 
==============================================================================================================

- 회의 결과 
1. SPCS 서버 모든 API 작동되도록 db값, 환경설정 값 확인/수정 등 작업 필요 
   - 산출물(flow chart, class 분석) 완료된 팀에 한하여 시작 
   - web (김홍원 과장님) 쪽은 금요일까지 산출물 완료 후 시작. 확인은 EV가 아닌 브라우저 또는 다른 툴로 확인 
   - 최대한 모든 API가 작동하도록 노력  
2. SPCS 서버 기능 확인하면서 산출물 보강 작업 진행 
   - SPCS 서버 기능 확인하면서 미진했던 산출물에 대해서 보강 작업 진행  
3. 산출물 완료 
   - Flow chart, class 분석은 금요일까지 100% 완료  
4. 시나리오 목록 작성 
   - 업무 프로세스 도출을 위하여 기능별로 시나리오 목록 구상 
   - 금요일 오전까지 목록 도출 후 다시 토의 예정 
==============================================================================================================

- 파일 저장 
> tail -f web.log  grep  '(ERROR)' > web_output.log  
> tail -f 20050711.log  grep  '(POP)' > 20050711_pop3.log  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.23(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:20 --> 루옌 임신 3주라고 함(부모님 기뻐함) 

- ChatON 운영 Prj
- 검증 서버(SPCS) 분석 
1. 분석 및 작성 
> java -jar SSMEV2.jar 
/SSMEV2/src/ssm/emulator/window/CommandWindow.java 
==============================================================================================================

- SPCS - EV 설정  
1. New Device 
IMEI: 111111111111111 
IMSI: 222222222222222 
MSISDN: 821043211234 
client version: 3.7.5 
Model: SCH-1234 
2. Config 
gld address: 182.194.5.64, port: 80 
gld address: stg.gld1.samsungchaton.com, port: 80  ===> stg 서버(stage: 실서버) 
gld address: gld1.samsungchaton.com, port: 443   ===> product 서버 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.24(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 

- ChatON 운영 Prj
- 검증 서버(SPCS) 분석 
1. SPCS 서버 Trunk 에러 분석 
 1) 결론: SPCS 서버에서 파일전송 후 Get Trunk List에서 response값을 못 받아옴(서버에 문제가 있는 것으로 추정됨) 
==============================================================================================================

- ChatON Deploy(서비스 서버) 
(us-connect)ubuntu@:~$ alias  ==>서버 확인  @@@ 
(us-connect)ubuntu@:~$ pkr1sv001  ==>  한국 1번 서버 조회 
pkr1sv001, pkr1sv002,  ==> 한국 
pas1sv003, pas1sv006,  ==> 싱가포르 
pew1sv001, pew1sv004, pew1sv007,  ==> 유럽 
pue1sv001,pue1sv002,  ==> 미국 

2. Deploy 수행 
> /production/service/de.sh pd ./war/XXXXX   ===> 서버 binary 를 각 region 별 서버에 전송하는 script 

3. Server server 재시작 확인 
> /home/chaton/service/bin 
> de.sh ===> kill.sh => copy.sh => run.sh 
==============================================================================================================

- ChatON Proj 회식(18:30) 
1. 일시 : 01월 24일 (목요일) 18시 30분 
2. 장소 : 옛골토성 강남점(강남역 11번 출구 CGV인근)[서울 강남구 역삼동 814-5] 
3. 참석: (주)삼성SDS, 프리랜서 등(PM 불참) 
4. 하민규 과장이랑 오리고기 훈제 바베큐 10인분 먹고 옴(배탈나서 잠 설침) 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.25(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:25 ~ 18:00 --> 전해성 과장 철수 

- ChatON 운영 Prj
- alias명 확인 
1. alias명 확인하여 메일 보냄 
==============================================================================================================

- 장성율 과장 모니터 S/N 
1. S/N: ZX90HTND10067, LS24C45KBSS 
==============================================================================================================

- 모태산부인과의원(서울대입구역 8번 출구) 
http://place.map.daum.net/17766927 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.01.26(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 21:00 
  
09:30 기상 
12:20 중식 
13:30 영화 감상 
18:10 석식 
21:20 루이엔(부인)과 화상통화 
16:00 낮잠  
19:30 기상 
20:00 석식  
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.27(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

▦조기축구
07:00 기상 
07:45 신봉천 주유소(태훈이형 차) 
08:10 신구초등학교  
08:40 게임(1:3 패) 
09:30 게임(6:2 승) 
10:40 종료 
11:20 중식(주코식당: 설렁탕 ==> 회비 5천원)  
12:30 종료 
13:30 하이마트(LG 42  LED TV(42LS3450, AKR) 구입, 송창우 T)874-8522, 3월 1일 13시에 새문빌라 301호로 배송 요청)  
14:20 귀가 
20:00 석식  
23:40 취침  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.28(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 21:00 --> 당직 근무(18시) 

- ChatON 운영 Prj
- 업무 프로세스 정의 작성  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.29(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> LG 42  LED TV 카드 결제 취소(하이마트 방문) 

- ChatON 운영 Prj
- 업무 프로세스 정의 작성  
==============================================================================================================

- 연말정산 자료 작성 및 취합(완료) 
1. 4장 출력하여 작성해서 (주)아이엘포유 김성채 팀장님에게 줄 것  
==============================================================================================================

- 01. 윈도우 7 정품 인증 패치 방법(windows 7) 
1. A.I_1003H.exe 더블 클릭 
2. 윈도우7 정품인증 패치 시스템32(파란 새창)이 뜸 
3. 7 ==> 4 ==> 1   
4. 확인: 제어판\시스템 및 보안\시스템 > 
Windows 정품 인증: "Windows 정품 인증을 받았습니다"라고 나옵니다. 
==============================================================================================================

- 우체국 EMS 국제특송(역삼1동 우체국) 
1. 씨티카드(0509) 하이퐁 루옌집에 보냄 ==> 참똑똑한 A+통장(제축예금) 
2. 3~4일 만에 도착(도착 후 알림 메세지 발송) ==> 비용: 13,200원 
3. 찾을 때 금액에 상관없이 무조건 1달러 수수료 
4. 보낸 날짜: 01.29(화), 받은 날짜: 02.01(금)  
5. 기타: http://hotjungboworld.net/245 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.30(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:20 --> 전병인 과장 만남(토즈) 

- ChatON 운영 Prj
- 업무 프로세스 정의 작성 
==============================================================================================================

- 휴대폰 캡처하는 방법(갤럭시 S2) 
1. 휴대폰 아래 가운데 버튼 + 휴대폰 오른쪽 버튼(동시에 누름) 
2. "클립보드에 복사되었습니다."라는 메세지 뜸 
3. 갤러리 > Screenshots에 보임 
4. 이미지 ==> 전송 --> 이메일: 사진 첨부하여 메일로 보냄 
==============================================================================================================

- ChatON 1차 대응 관련 교육 자료 작성 
1. 2월 7일(목) 발표 
2. 15시 ChatON 서버별 소개 및 1차 조치 교육 : 각 서버 담당자 
 1) Mobile B (service, buddy, msgctx, content : 한일평, 진태만, 나영철 과장)  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.01.31(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:20 --> 이승민 과장 철수 

- ChatON 운영 Prj
-  ChatON 1차 대응 관련 교육 자료 작성 
1. 참조할 것 
==============================================================================================================

- 삼성웰빙클럽: www.samsungwbc.co.kr 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■