

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.08) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.08.01(목) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 당직 

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.02(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 대한법률구조공단 방문(11:30) 

- ChatON 운영 Prj
- CRON 정리 작업 
1. 테스트 
==============================================================================================================

- 대한법률구조공단 상담(강과장 자전거로 감) 
0. 장소: 대한법률구조공단 서울중앙지부 구조1팀[서울 서초구 서초동 1703-10] 
1. 재판(남권형 형수와 할 수 있음: 형수 연대 보증인 서명이 안된 것으로 판단됨) --> 승산 없음 
2. 공증 집행 
 1) 공증 정본 분실 신고(파출소) --> 공증 재발급 --> 공증 집행 
 2) 재산 조회(고민) 
-------------------------------------------------------------------------------------------------------------------------- 

- 공증 후 강제 집행(재산내역 파악 못 할 경우) 
1. 재산명시신청(채무자가 재산현황 작성 제출) 
2. 재산조회(재산명시신청 전차를 거친 이후에만 가능) 
3. 채무불이행자 명부등재 신청(판결 후 6개월 관할 법원에 채무불이행자 명부등재 신청) 
4. 법무법인 한중(공증): ☎ 588-8538, 김영도 실장: 010.*5, 이문재 변호사 
==============================================================================================================

- sky라이프 3D 편성표 
http://www.skylife.co.kr/channel/ch_program.jsp?mNum=2&sNum=1 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.03(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
05:40 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
06:40 숏게임(4:2 승) 
07:20 종료 
08:10 조식(화정식당, 닭조리탕) 
09:20 종료 
09:10 집출발 
09:25 모태산부인과(초음파 검사:), 백신 주사(신랑, 장모님) ==> 195,800원 사용[87,400원 남음]  
11:10 귀가 
13:00 중식 
13:40 집출발(지하철, 장인, 장모님 모시고 감) 
15:40 허우씨집(의정부시 금오동 세아아파트 101동 203호) ==> 허우씨 부모님과 만남 
16:00 삼겹살 파티 
18:10 종료 
20:30 귀가(피곤함) 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.04(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
06:10 기상 
06:20 국민은행 봉천동지점 앞(태훈이형 차) 
07:10 신구초등학교 
07:20 숏게임(2:0 승) 
08:30 게임(6:4 승) ==> 최회장님 방문 
10:30 종료 
10:20 중식(문경세재: 갈비탕): 회비 만원 
12:00 종료 
12:40 귀가(돌솥 비빕밥 사가지고 감) 
13:10 낮잠 
16:00 기상   
19:30 종료 
20:00 석식(포마토 식당: 해물밥, 갈비탕) 
21:40 귀가 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.05(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> ChatON Proj 회식(BSS셀)(18:30), Buddy로 업무 변환 

- ChatON 운영 Prj
- applog(bklog) 작업 
1. buddy proxy 서버 작업 
02. EU(유럽): pew1bp001m, pew1bp002m   
04. KR(한국): pkr1bp001m, pkr1bp002m    
cd /mnt/log 
cd /mnt/tomcat_log 
cd /home/chaton/bklog  --> vi bklog.log 
crontab -l  
==============================================================================================================

- ubuntu 버전확인(리눅스 서버에서) 
chaton@pkr1bp001m:~$ cat /etc/issue 
Ubuntu 10.* LTS \n \l 
- python 버전 확인(리눅스 서버에서) 
chaton@pkr1bp001m:~$ python -V 
Python 2.6.5 
------------------------------------------------------------------------------------------------------------------------ 

- ubuntu 버전확인(리눅스 서버에서) 
chaton@pkr1bp002m:~$ cat /etc/issue 
Ubuntu 10.* LTS \n \l 
- python 버전 확인(리눅스 서버에서) 
chaton@pkr1bp002m:~$  python -V 
Python 2.6.5 
==============================================================================================================

- 선불 휴대폰 
http://www.prepia.co.kr 
http://www.phone1009.co.kr 
http://www.ppsnara.com 
==============================================================================================================

- ChatON Proj 회식(BSS셀)(18:30)  
1) 일시: 8월 5일(월) 18시 30분 
2) 장소: 예쁜집(삼겹살 부페, 신논현역 근처, 서울시 서초구 서초동 1302-34): http://blog.naver.com/ewan123/10.*600 
==============================================================================================================

- 공증증서 분실 처리 
1. 분실신고(경찰서) --> 재권판결(법원, 3~4개월 소요)--> 공증증서 재발금(만원) --> 공증 집행 
http://kin.naver.com/qna/detail.nhn?d1id=6&dirId=60211&docId=62019521&qb=7J6s6raMIO2MkOqysA==&enc=utf8&section=kin&rank=3&search_sort=0&spq=0 
 1) 재권판결 신청 
  가. 법원 민사신청과에 접수(분실신고접수증명서, 미지급증명서) --> 공시최고절차 --> 해당기간동안 신고가 없으면 무효화됨 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.06(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- ChatON 운영 Prj
- applog(bklog) 작업 
==============================================================================================================

- 파일 복사 
1. 지역서버에서 jumphost(GLD)서버로 파일 복사 
 가. jumphost(GLD)서버에서 작업(사용) 
(connect)chatonop@ip-10.*-100:~/war/sv$  alias  grep pue1sv001 
alias pue1sv001='ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/fa-pue1app-chaton-pue1cs.pem chaton@**' 

 (connect)chatonop@ip-10.*9-170.compute-1.amazonaws.com:/home/chaton/service/log/web.log.2013-08-05 /home/chatonop/war/sv/web.log.2013-08-05 
===> pue1sv001 서버에서 Jumphost (GLD 서버) 서버로 파일 복사 @@@ 
--> $ scp -옵션 [옮길파일(/home/chatonop/war/sv/weblog-05.tgz)] [서버계정@서버아이피:/저장공간(/mnt/log)]  
(connect)chatonop@ip-10.*-100:/chaton/users/tamario2.jin$  cd /home/chatonop/war/sv ===>  Jumphost (GLD 서버) 서버에서 파일 확인 @@@  
(connect)chatonop@ip-10.*-100:/chaton/users/tamario2.jin$ pue1sv001 ===> pue1sv001 서버에서 @@@ 

(pue1sv001)chaton@ec2-50-19-49-170:~/$  cd /home/chaton/service/log 
(pue1sv001)chaton@ec2-50-19-49-170:~/service/log$  rm -rf web.log.2013-08-05  ===> web.log.2013-08-05 파일 삭제 @@@ 
(pue1sv001)chaton@ec2-50-19-49-170:~/service/log$  cd /home/chaton/service/bin 
(pue1sv001)chaton@ec2-50-19-49-170:~/service/bin$  ./re.sh 
(pue1sv001)chaton@ip-10.*2-202:~$  df -h 
------------------------------------------------------------------------------------------------------ 

2. jumphost(GLD)서버에서 지역 서버로 파일 복사(사용 중) 
(connect)chatonop@ip-10.*:~/war/sv$  alias  grep pas1sv006 
alias pas1sv006='ssh -p2022 -o StrictHostKeyChecking=no -i /home/chatonop/keys/pd.aps.pem chaton@**' 

(connect)chatonop@ip-10.*-100:/chaton/users/tamario2.jin$  cd /home/chatonop/war/sv 
(connect)chatonop@ip-10.*:~/war/sv$ scp -i /home/chatonop/keys/pd.aps.pem  -P 2022 /home/chatonop/war/sv/web.log.2013-08-05 chaton@@**' 
===> jumphost(GLD)서버에서 pas1sv006 서버로  파일 복사 @@@ 
$ scp -옵션 [옮길파일] [서버계정@서버아이피:/저장공간] ===> $ scp -r /home/search/test search@10.*:/home/solution 
$ scp -P 복사된 포트번호 -r /원본 데이터 경로/ username@200.*:복사된 데이터 경로  

(connect)chatonop@ip-10.*-100:/chaton/users/tamario2.jin$ pas1sv006 
-rw-r--r--  1 chaton chaton 72565081 2013-01-20 12:40 web.log.2013-08-05 --> 복사된 파일이 보임 @@@ 
==============================================================================================================

- 사원증 발급현황 확인 요청 메일(배수현 책임) 
1. 김성채 팀장에게 전달(아는 바 없다고 함) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.07(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 13:00 ~ 18:00 --> 장인, 장모 체류자격변경허가 신청 업무(서울 출입국관리소) 

- ChatON 운영 Prj
- Italy Verification 인증 관련 인입 급증 확인 요청(인증 받았지만 잘못된 PIN) 
1. MSISDN 변경(패치 전: 3928615166 --> 패치 후: 393928615166) 
2. 로그 확인 
 1) countryCallingCode(39) + convPhoneNumber(39) = msisdn(3939...) 
==============================================================================================================

- 장인, 장모 체류자격변경허가 신청 업무 
07:00 기상 
07:40 조식(칼국수) 
08:10 집출발 
08:30 서울대입구역 
09:20 양천구청역(2번 출구로 잘못 나옴) --> 목동 13단지 --> 목동 14단지 사거리 --> 목동공원 
09:30 서울 출입국관리소 도착 
09:20 1층 업무(신청서(별지34호 서식), 신원보증서, 여권 원본, 사진, 혼인관계증명서, 주민등록등본, 사유서(A4용지에 
각각 1장씩 작성) 제출 --> 장인, 장모 2분 신청 했기 때문에 모든 서류는 2개여 함 
09:40 2층(외국인등록증 수수료(2만원), 택배(3천원) 신청, 수입인지(5만원), 호구부, 출생증명서 복사(900원)  
--> 총: 146,900원 
10:50 1층 업무(처리 업무 확인증 제출, 장인, 장모 지문 등록) ==> 완료(2주정도 소요) 
11:10 양천구청역 
11:40 서울대입구역 
12:00 중식(베트남 쌀국수, 포몬스): 장인, 장모, 루옌 
12:30 귀가 
13:05 출근(강남 823빌딩)  
==============================================================================================================

- 서울 출입국관리소 가는 방법 
1. 지하철 
 1) 서울대입구역(6-2) --> 신도림역() --> 양천구청역(1번 출구) 
 2) 양천구청역(4-2) --> 신도림역() --> 서울대입구역 
2. 버스 
1) 봉원중(650번 버스) --> 목동역(7단지 앞) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.08(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- 1차 대응 범위 확대를 위한 매뉴얼 작업 검토 
1. buddy proxy 
==============================================================================================================

- jps 
jps는 java process search를 하는 프로그램으로, 현재 프로세스 중 자바 프로세스를 찾아, pid(프로세스아이디)를  
출력해줌. 
- jstack 
jstack.exe라는 응용프로그램을 이용하여, Thread Dump를 실행해 보도록 하겠습니다.  
Thread Dump는 JVM에서 동작하는 각 Thread의 stack trace를 찍어주는 프로그램입니다. 
jstack pid를 입력하시면, 쉽게 Thread Dump를 확인할 수 있습니다. 
==============================================================================================================

- SMS GW VOC 
1. 해당 번호에 대한 SMS 인증 시간 및 Token 정보 확인(3939912898, 3939009528) 
==============================================================================================================

- 윤성호 모친 상(17:30) 
1. 포항e병원 장례식장 
2. 강남역(1-1) --> 교대역(5-4) --> 고속터미널역(2번 출구) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.09(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 17:00 --> 포항행(17:30 버스, 포항e병원 장례식장[윤성호 모친상]) 

- ChatON 운영 Prj
- KR 지역 SMS 전송 에러 관련 회의[2013.08.07(수) 11시경에 발생] 
1. 현상 
 1) nagios에서 
다수 서비스에서 Connection refused or timed out 발생 
 2) 터미널 로그에서 
CHATON-pkr1sm001m, CHATON-pkr1sm002m 서버 응답이 안됩니다. 
2. 원인 
 1) KT ucloud에서 Virtual Router(Master) 장애 발생 
3. 조치  
 1) KT ucloud에서 장애 공지 전화받고 Virtual Router(Slave)로 변경 
4. 문제점 
 1) 우리 문제가 아니지만 장애 전파가 혼선이 있고 늦었음 
==============================================================================================================

- guid: s account 
uid 
단말 ==> 삼성 A(tamario@**.com) ==> 
단말(+821030720898) ==> uid 
단말 ==> 삼성 A ==> guid 
------------------------------------------------------- 
단말 ==> uid 
웹챗온 ==> uid 
device id 
imei 
==============================================================================================================

- 쌀 구입 
1. [8월특가 1000포 한정]늘 처음 처럼 쌀 20kg[11번가] ==> 38,500원[구입] 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=677266088 
2. 생명의땅 나주쌀 20kg[11번가] ==> 40,9000원[보류] 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=651709267 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.10(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 포항행 
16:50 퇴근  ==> 2013.08.09(금) 
17:15 강남고속버스터미널 
17:30 서울 출발 
21:50 포항 도착[4시간 20분 소요] 
22:00 포항e병원 장례식장[윤성호 모친상] 
22:10 문상(부의금 5만원) 
22:10 석식(병주형, 재헌이형, 용호형, 명걸이형, 일현, 인표, 두영, 현구, 종윤, 광영) 
02:00 종료 ==> 2013.08.10(토) 
02:30 광영이집[포항시 남구 이동 그린빌 105동 1607호] 
02:40 술자리 
04:00 취침 
09:30 기상 
10:30 조식(조마루 해장국): 일현이가 쏨 
11:20 서울출발(종윤이 차: 2만원 냄) 
02:00 괴산 휴게소[종윤이한테 호두과장 선물로 받음] 
16:20 서울 도착[5시간] 
16:30 지구대(분실 신고) 
17:10 귀가(피곤함) 
22:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.11(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 승) 
08:30 게임(6:4 승) ==> 최회장님 방문2(축구공 10개 선물, 서울시축구협회회장), 상요형 정홍이와 부딪쳐서 얼굴 화상 입음 
10:30 종료 
10:20 중식(문경세재: 갈비탕): 오세문 고문님이 쏨 
12:00 종료 
12:30 귀가 
13:10 샤워 
13:30 집출발(장인 어른 짐) ==> 모자, 부채 선물 
15:30 동두천역 도착 
15:50 허우씨 아버지 만남(우연) 
16:00 (주)동광실업(염색공장) 도착[기숙사 시설 안 좋음, 방 배치 문제로 갈등(월욜 해결)] --> 부사장과 인사     
        ==> 동두천시 동두천동 550(강변로 730번길 43-38) 
	- (주)동광실업 가는 방법 
	1. 서울대입구역(2-3) --> 신도림역(6-4) --> 동두천역(2번출구) --> (주)동광실업 
	1. (주)동광실업 --> 동두천역(2-3) --> 신도림역(5-3) --> 서울대입구역[2시간 반 소요]  
17:00 동두천역 도착 
19:10 귀가 
19:50 석식 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.12(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 21:00 --> 당직 

- ChatON 운영 Prj
- Buddy로 업무 숙지 (~8.23) 
1. buddy 문서 분석 
==============================================================================================================

- 모의 장애훈련 
[역할] 
8/12(월) 
주제 : Web ChatON US 지역 로그인 불가 (7/24일 장애건) 
원인 : US 지역 DB 노드의 security group에서 5306 Port Anyopen 룰 삭제 작업 후 DB 접속이  
       안되는 현상 발생하여 서비스 불가(WebAPI wb, ws서버에 대한 5306 port 등록 누락) 
조치 : US 지역 DB security group에 Webapi Biz, Session서버의 5306 port 등록함으로 서비스 정상화 
담당 : 1차대응 담당자(나영철, 진태만 과장), DBA(서영우 과장), 통합운영상황실 -> 당일담당자 
위험관리자 : 김방현 책임(위험관리자) 
하민규 과장(임형진 수석) 
오승현 과장(MSC wb,ws 담당자 - 안형진 책임, 서애선 책임)  
조대형 과장(채상호 그룹장) 
---------------------------------------------------------------------------------------------------------------------- 

- 모의 장애훈련 조치 내용 
1. 예, 확인하고 연락 드리겠습니다. 
2. AWS에서 확인해 본 결과 lb-pue1wb lb가 Out of Service 확인 되었어요. 2차 Wb 담당자에게 연락 바랍니다. 
==============================================================================================================

1. 재권판결 신청  
  1) 법원 민사신청과(☎ 530-1828)에 접수(분실신고접수증명서, 미지급증명서) --> 공시최고절차 --> 해당기간동안 신고가 
없으면 무효화됨 
2. 분실신고(경찰서) --> 재권판결(법원, 3~4개월 소요)--> 공증증서 재발급(만원) --> 공증 집행 
http://kin.naver.com/qna/detail.nhn?d1id=6&dirId=60211&docId=62019521&qb=7J6s6raMIO2MkOqysA==&enc=utf8§ion=kin&rank=3&search_sort=0&spq=0 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 휴가 

- 휴가 
08:00 기상 
10:00 조식 
11:10 집출발 
11:30 서울대입구역 
12:30 서초역(5413번 버스) 
12:35 서울중앙지원(서관: 민사) 
12:40 재권판결 접수(1층 접수대)[인지대, 송달료 수납(우리은행)] ==> 접수 거부(약속어음 문제) 
13:40 법률상담(재권판결을 받으면 약속어음이 무료로 됨) 
14:00 법무법인 한중 방문(사무장이 대여금청구 소장을 써줌) 
15:20 서울중앙지원(서관: 민사) 재방문 
15:30 대여금청구 소송 소장 제출[인지대(140,000), 송달료(97,500원) 수납(우리은행)] 
15:40 조남권형 전화 안 받음 ==> 승열이형에게 전화 
15:50 종료 
16:00 서초역(5413번 버스) 
17:00 서울대입구역 
17:30 귀가 
18:30 석식 
22:40 취침 
==============================================================================================================

- 대법원(대여금청구 소송(남권형)) 
1. 사건번호: 2013가단218819 
2. 재판부 : 민사84단독( ) (전화:530-2766 (본관13층 단독2과)) 
http://www.scourt.go.kr/portal/information/events/search/search.jsp ; 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.14(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 휴가 

- 휴가2 
08:00 기상 
08:40 조식 
12:40 중식 
16:30 집출발 
16:40 서울대입구역 
17:50 안산역 
18:10.*7))[총 3만원]: 장인 
18:30 장보기 
18:50 베트남고향식당(쌀국수, 정식): 루옌, 장모 
19:10 안산역 
20:20 서울대입구역 
20:30 귀가 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.15(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 광복절 

▦조기축구 
06:15 기상 
06:30 국민은행 봉천동지점 앞(태훈이형 차) 
07:00 신구초등학교  
08:00 게임(2:0 승)  
08:50 숏게임(2:0 패) 
09:30 종료 
09:50 중식(부대찌게: 만원 냄) 
10:20 종료 
11:10 이발(봉천동 빅맨): 염색약(5천원) 구입 
11:30 귀가(흐엉(하롱베이), 란씨(하이퐁) 방문) 
12:00 샤워 
12:10 낮잠 
15:00 기상 
15:20 서울대입구역(흐엉, 란씨) 
15:50 신림역(흐엉, 란씨) 
16:20 봉천동 흐엉 친구집(서울 관악구 봉천동 647-90, 용주사 근처, 매트 2개 얻어옴) 
17:30 택시(루옌, 매트 2개): 3,100원 
18:30 석식 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.16(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy로 업무 숙지 (~8.23) 
1. buddy 문서 분석 
==============================================================================================================

- W34 정기 배포 관련 회의(09:30) 
1. 사후 점검 강화 
 1) 사후 점검 ==> 1차 점검(본인), 1차 점검(다음 조) 
 2) 사후 TC(상황실 업무) 
2. CN지역 자원 효율화 
 1) Heap size 조정 ==> CN지역 Service /mnt 용량 체크: df -h 
(pcn1sv001)chaton@cnsy1:~$ df -h 
Filesystem            Size  Used Avail Use% Mounted on 
/dev/xvdb1            493G   17G  451G   4% /mnt 

(pcn1sv002)chaton@cnsy3:~$ df -h 
Filesystem            Size  Used Avail Use% Mounted on 
/dev/xvdb1            493G   17G  451G   4% /mnt 
==============================================================================================================

- 중국 효율화 작업 관련 회의(14:30) 
1. 작업계획서의 서비스 stop, start 검증하셔서 회신주세요.(작업한 cell 색 다르게 해서) - 4시까지  
(pcn1sv001)chaton@cnsy1:~/service/bin$ cd /home/chaton/service/bin  
(pcn1sv001)chaton@cnsy1:~/service/bin$ ./kill.sh 
(pcn1sv001)chaton@cnsy1:~/service/bin$ ./run.sh 
2. instance boot 시 자동으로 서비스 스타트 되는 부분 있는지 확인해 주세요. - 5시까지 
(pcn1sv001)chaton@cnsy1:~$  cd /etc/init.d   ===> 폴더 내 파일들의 내용 중에서 run.sh이 존재하는 지 확인 
(pcn1sv001)chaton@cnsy1:/etc/init.d$ cat  bootlogd 
(pcn1sv001)chaton@cnsy1:/etc/init.d$ cat  glusterd  
 1) 해당 Run Level에 대한 /etc/rcX.d 디렉토리에 서비스 관련 이름의 파일이 있는지 찾아보면 될 것 같습니다. 
즉, who -r  명령어에 나오는 Run Level에 해당하는 숫자의 /etc/rcX.d 디렉토리 아래에 서비스 이름의 파일이 있으면 
부팅 시에 자동으로 수행되는 것으로 나와있습니다.  
(pcn1sv001)chaton@cnsy1:/etc$ cd rc0.d   ==>  rc1.d ~  rc6.d까지 확인 @@@ 
(pcn1sv001)chaton@cnsy1:/etc/rc0.d$ ls  
==============================================================================================================

- KR 지역 문자 발송 안됨 
1. 원인: DB 디플로에 작업 중 에러가 발생 
2. 조치: DB 서버 재시작 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.17(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
08:00 기상 
08:40 조식 
10.*0 매트(2개) 말리기 : 옥상(소나기) 
12:00 중식 
18:40 석식 
22:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.18(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 승) 
08:30 게임(7:4 패)  
10:00 종료 
12:30 귀가(정홍이 차: 병룡) 
12:10 샤워 
12:40 희원 애 돌잔치 ==> 르네상스 쇼핑몰(신림역 7번 출구), 나우베베 10층 지아니홀(루옌 같이감, 5만원 부주) 
       --> 기남이형, 태훈형, 병룡, 정홍 
14:20 종료 
14:30 신림역(태훈이형 차) 
15:00 귀가 
15:30 낮잠 
18:00 기상 
18:40 석식(포마토: 장모님, 루옌) 
19:50 귀가 
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.19(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- W33 긴급 배포 관련 회의 
1. Service, Social Analytics 서버 담당 
---------------------------------------------------------------------------------------------------------------------------- 

- W33 긴급 배포 
18:00 퇴근 
18:10 석식(최인택 책임이 배포 1조 조원들에게 사줌) 
19:00 귀가 
22:00 집 출발(자전거) 
22:30 출근 
23:00 시작 
23:20 버디 db 테이블 생성 때문에 문제가 생김(dba가 테이블 생성)  
02:00 JP GLD 배포시 lb가 떨어짐 
04:10 배포 종료 
04:15 Account 장애 
04:25 web chaton 에러 
04:40 상황 종료 
04:45 W33 디플로이 사후 점검 리스트 작성 
04:58 종료 
05:00 퇴근 
---------------------------------------------------------------------------------------------------------------------------- 

- Service(sv) 
/home/chatonop/war/sv/service-dsv-v3.0.0-rc08090.war 
- Social Analytics(sa) 
/home/chatonop/war/sa/ChatON_Social_Analytics_Server-v1.13.1-rc0808.war 
---------------------------------------------------------------------------------------------------------------------------- 

- W33 긴급업그레이 작업계획서의 SA 서버의 작업절차에서 
(/home/chaton/service/conf/ssm-server.properties mysql.url에서 "&characterEncoding=utf8" 제거)  
/home/chaton/service/conf/ssm-server.properties파일에서 
1. mysql.url=jdbc:mysql:loadbalance://ec2-175-41-151-82.ap-southeast-1.compute.amazonaws.com:5306,ec2-46.
*.compute.amazonaws.com:5306/chaton?loadBalanceBlacklistTimeout=5000&useUnicode=true&characterEncoding=utf8&autoReconnect=true 
2. mysql.recommend.url=jdbc:mysql://ec2-54-251-63-231.ap-southeast-1.compute.amazonaws.com:3306/chaton
?useUnicode=true&characterEncoding=utf8&autoReconnect=true 
==============================================================================================================

- Deploy 후 체크리스트 작성 
1. 점검 사항 작성 
==============================================================================================================

- 소속부서/업무파트   
1. MS운영2그룹/BSS셀 ==> 사용자 ID: tamario2.jin 
==============================================================================================================

- 파일 비교 
1. 파일비교 프로그램 (소스코드 비교) : http://ki79david.blog.me/80169501887 
==============================================================================================================

- pre produciont   cronadm 패스워드 
cron12!@# 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.21(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 12:30 ~ 04:00 --> 긴급 상황 발생[1조 모두 출근(12:30 ~ 04:00), 재출근(13:40 ~ 18:00)] 

- ChatON 운영 Prj
- 이슈1: Web ChatON 특정사용자 메세지 전송실패  
1. 현상:  
 1) 웹 대화방 참여자중 폰번호 인증한 사용자가 한명이라도 존재할 경우 웹에서 메시지 발신 실패 
 2) EU지역 Web ChatON 접속불가 발생(추가 확인 내역)  
2. 원인:  
 1) Web client용 MSISDN 암호화  로직이 MsgCtx 서버에서 중복적용  
 2) DB 서버 CPU 자원사용률 100% 점유상황 
3. 조치:  
 1) 신규 바이너리 지역별 단계적용(MsgCtx서버 재 배포) 
 2) DB 테이블 인덱스 생성 
---------------------------------------------------------------------------------------------------------------------------- 

- 이슈2: EU, SG 지역 에러 발생관련 회의(김원기 수석) 
1. 현상:  
 1) EU 지역 Web ChatOn 로그인 시 Internet Service Error 발생, 단말은 정상 서비스 중이나 메시지 전송 지연 
 2) SQL 에러 발생 : INSERT INTO usr_leave, Registering Duplication 에러 
 3) 대량의 풀 스캔 쿼리 발생(DB CPU 100%)  
2. 원인: usr_leave 테이블에서 index가 안 걸려 있음 
3. 조치:  
 1) SG 지역 DB 부하 분산 
 2) Proxy 서버 restart 
 3) Device_leave 테이블에 Index 생성 
---------------------------------------------------------------------------------------------------------------------------- 

- Service 로그 체크 
1. 장애일자: 08.20 5시 ~ 08.21 01시[UTC: 08.19 20시 ~ 08.20 16시] 
- 로그 분석 
$ cd /mnt/log 
$ grep 'Exception' web.log.2013-08-19  more ==> 12시 데이타 찾기 @@@@@ 
$ grep 'Exception' web.log.2013-08-1*  more 
$ grep 'Exception' web.log.2013-08-0*  more 
2. Service 서버 점검 후 결과 보내기(최인택 책임) 
==============================================================================================================

- 네트워크 예외를 위한 웹프락시 설정 
1. 필수 네트워크 예외 
[인터넷옵션] → [연결] → [LAN 설정] → [고급] 
2. 예외 프록시 서버 주소 
 1) 개인 PC 
*.samsung.net;*.smart-office.co.kr;*.sbc-cloud.com;*.samsungcic.com;33.*.*.*;70.*.*.*;spcs*;ebiz*;gld.push.samsungosp.com;10.*2.168.2*;*.osp2.com 
 2) 이종진 과장 PC 
*.samsung.net;*.smart-office.co.kr;*.sbc-cloud.com;*.samsungcic.com;33.*.*.*;70.*.*.*;spcs*;ebiz*;gld.push.samsungosp.com;10.*2.168.2* 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.22(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(기본설계서_BuddyServer.pdf 파일 분석) 
==============================================================================================================

- 중국 효율화 작업 관련 회의 
1. Service 서버 중국 효율화 작업 다음주 예정  
==============================================================================================================

- 적법도급 현장점검 관련 사전검토 
1. 위임장을 출력하여 서면으로 보관 
2. 근태관리대장 관리 
---------------------------------------------------------------------------------------------------------------------------- 

[사업부 주관 적법도급 현장점검] 
□ 점검일정 : 8.23(금) ~ 8.26(월) 
   - 세부일정은 별도로 안내 예정 
□ 중점 점검항목 
   - 팀별 서면 실태조사 결과 이슈 항목 현장확인 및 대처방안 제시 
   - 고객사 사업장 공간분리 진행경과 확인  
   - 소규모 PJT 대상 독립업무 수행 여부 확인 
   - 현장관리자/PM 인터뷰 실시 
==============================================================================================================

- 소장 주소 보정 신청 
1. 법원에 주소변경 또는 송달장소 변경 신청서를 작성해 제출 
2. 민사84단독( ) (전화:530-2766 (본관13층 단독2과)) ==> 사건번호: 2013가단 218819 
 http://kin.naver.com/qna/detail.nhn?d1id=6&dirId=60211&docId=160362336&qb=7IaM7J6lIOyjvOyGjOuzgOqyvQ==&enc=utf8
 &section=kin&rank=11&search_sort=0&spq=0&sp=2&pid=RmSft35Y7vssssmjvY8sssssstZ-114078&sid=L3vToCEVC1IAADNwwlUAAAAe 

- 대법원(나홀로 소송): http://pro-se.scourt.go.kr/wsh/wsh000/WSHMain.jsp, tamario2/s*p***8*11! --> ssxoaksfndPs!@ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.23(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.2. Registration: WorkFlow, module 산출물 분석) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.24(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말 
08:00 기상 
08:40 조식(식빵) 
09:10 집출발 
09:25 모태산부인과 진료(모태산부인과), 빈혈 주사(7만원)[빈혈 수치: 9.4(9.6은 되어야 함)]  ==> 총 10.*00원 사용 
11:10 귀가 
13:00 중식 
16:30 집출발(지하철, 장모님 모시고 감) 
17:00 구로디지털단지역 
17:20 이마트 구로점 
18:10 애기 용품 구매(ASB 출산준비물(30% DC)) 
18:40 몰랑 빙수기(GM-IS4433)[신세계 상품권 3만원을 주고 구입(9,800원만 납입)]: 이마트 
18:50 치킨 바베큐 피자(지하 1층에서 앉아서 먹음): 이마트 
19:20 이마트(박스로 가지고 옴) 
20:20 귀가(피곤함) 
24:00 취침(신부가 깨물어서 짜증을 냄) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.25(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

▦조기축구 
05:45 기상 
06:00 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:20 숏게임(2:0 패) 
08:30 게임(2:0 패) ==> 40대 선수팀이 패배 함 
10:50 종료 
11:30 중식(문경세재: 갈비탕): 회비 만원 
12:50 귀가 
13:10 샤워 
14:20 루옌이 울어서 달램  
15:30 낮잠 
18:00 기상 
18:40 석식(루옌이 김밥 만듬)  
22:00 TV 시청(개그콘서트) 
23:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.26(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.3 Multi Device Management: WorkFlow, module 산출물 분석) 
==============================================================================================================

- 장애 관련 회의 
1. DB 장애(CN)(25일 19시) 
 1) DB1 다운 --> HA Proxy 설정 변경(request DB2로 가도록 변경) --> DB2(Stand by 설정) 
2. 미주 가입 불가(US)(26일 5시) 
 1) log 분석(pue1bd001, pue1bd002) 
(pkr1sv001)chaton@ip-10.*8-111-93:/mnt/log$  grep 'Exception' web.log  less 
==> Exception 조회(페이지 다음: f, 페이지 전: b, 조회: /, 중지: q) @@@ ===> 로그 분석  
(pkr1sv001)chaton@ip-10.*8-111-93:/mnt/log$  grep '20:' web.log.2013-08-25 less 
==============================================================================================================

- 1차 대응 매뉴얼 작성(Service 서버 기준) 
1. Nagios 확인(pue1sv002) 
http://14.63.222.84/nagiosxi/index.php 
> All Service Problems: 장애가 나는 Host와 Status Information 확인 
2. 로그 확인 
(pkr1sv001)chaton@ip-10.*8-111-93:/mnt/log$  cd /mnt/log 
(pkr1sv001)chaton@ip-10.*8-111-93:/mnt/log$  grep 'Exception' web.log  less ==> Exception 조회 
3. AWS 확인 
https://nagios.signin.aws.amazon.com/console, ID/PW 개인계정/ ==> EC2 > nstances 
NETWORK & SECURITY > Load Balance 
4. 제니퍼 확인 
http://54.235.97.142:9900/login.do?action=login 
==============================================================================================================

- java J2SE 1.6 재 설정 
1. 제어판\모든 제어판 항목\ java\ java 제어판(새창) > java TAB > 보기(V): java Runtime Environment 설정(새창):  
사용자 > 사용[1.6(J2SE)만 체크] 확인(클릭) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.27(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.3 Multi Device Management: WorkFlow, module 산출물 분석) 
==============================================================================================================

- W35 정기 배포 관련 회의(13시)  
1. Service, Social Analytics 서버 담당  
2. 사후 점검 강화 
 1) Deploy후 체크리스트 작성 ==> 1차 점검(본인), 1차 점검(다음 조) 
 2) 사후 TC(상황실 업무)  
==============================================================================================================

- W36 비정기 배포 관련 회의(16시)  
1. CN 지역 배포 일자(29일 0시) 확정(서버 담당자 미정) 
==============================================================================================================

- back up war 폴더(backUp_war) 생성 
$ cd /home/chaton/war 
$ mkdir backUp_war ==> backUp_war 폴더 생성 @@@ 
$ chmod 755 backUp_war ==> 파일 권한 부여 @@@ 
$ cp -p ChatON*.war  backUp_war ==> ChatON*.war 파일을 backUp_war 폴더에 복사 @@@ 
$ cp -p service-*.war  backUp_war ==> ChatON*.war 파일을 backUp_war 폴더에 복사 @@@ 
$ cp -p img.war  backUp_war ==> ChatON*.war 파일을 backUp_war 폴더에 복사 @@@ 
$ cd /home/chaton/war/backUp_war   ==> 파일 확인 @@@ 
$ cd /home/chaton/war 
$ rm ChatON*.war ==> ChatON*.war 파일 삭제 @@@ 
$ rm service-*.war ==> ChatON*.war 파일 삭제 @@@ 
$ rm img.war ==> ChatON*.war 파일 삭제 @@@ 
$  mv service-dsv-v3.0.0-rc08090.war  /home/chaton/war/service-dsv-v3.0.0-rc08090.war    
==> service-dsv-v3.0.0-rc08090.war 파일을 /home/chaton/war/service-dsv-v3.0.0-rc08090.war로 옮김 @@@  
==============================================================================================================

- Version Check(sa) 
- 해당 서버 접속 후 netstat으로 10080 open 된 url 검색후, 아래 두 명령  중 하나 입력  
$ alias  grep pue1sa001 
$ netstat -an  grep LISTEN 
● curl 설치 된 서버(UE, SG, EU) 
$ curl http://localhost:10080/VersionTracking/version/getversion ==> pue1sa001 버전 조회 @@@ 
$ curl {ec2-50-17-94-229.compute-1.amazonaws.com}:10080/VersionTracking/version/getversion ==> pue1sa001 버전 조회 @@@ 
<?xml version="1.0" encoding="UTF-8" standalone="yes"?><buildVersion><buildDate>2013.08.08 09:59:50</buildDate>
<revision>v1.13.1-rc0808</revision></buildVersion>[chaton@pue1sa001-US-~] 
--------------------------------------------------------------------------------------------------------------------------- 

$ alias  grep pkr1sa001  
$ netstat -an  grep LISTEN 
● wget 설치된 서버(CN, KR) 
- wget {ip address}:10080/VersionTracking/version/getversion  
$ wget http://localhost:10080/VersionTracking/version/getversion ==> pkr1sa001 버전 조회 @@@ 
$ cat getversion 
<?xml version="1.0" encoding="UTF-8" standalone="yes"?><buildVersion><buildDate>2013.08.08 09:59:50</buildDate>
<revision>v1.13.1-rc0808</revision></buildVersion>[chaton@pkr1sa001-KR-~] 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.28(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> 당직, W35 정기 배포 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.3 Multi Device Management: WorkFlow, module 산출물 분석) 
==============================================================================================================

- W36 비정기 배포 관련 회의(09:30)  
1. CN 지역 배포 일자(29일 23시) 확정(서버 담당자: 인호진 과장, 나영철 과장) 
2. 작업계획서 수정 
 1) /mnt directory를 사용하는 process 확인   
1. social Analysis(pcn1sa001) 서버  
$ fuser -vm /mnt            --> $  fuser -cu /mnt 유사 
                     USER        PID ACCESS COMMAND 
/mnt:                root     kernel mount /mnt 
                     chaton    14787 F.... java 
                     chaton    20910 f.... java 

$ ps -ef  grep 14787 
chaton    8546.*4787 
chaton   14787     1  1 Aug19 ?        02:03:34 /usr/bin/java -Djava.util.logging.config.file=/home/chaton/service/tomcat/conf/logging.properties -  
$ ps -ef  grep 20910 
chaton   20910.*3:21 /usr/lib/jvm/bin/java -Ddms=logagent -Xms100m -Xmx500m  
-Duser.timezone=UTC -Dcom.sec.migaloo.javax.net.ssl.trustStore=./conf/prd-di-trust.jks 
----------------------------------------------------------------------------------------------------------------------- 

- heap 사이즈 조정 
chaton@ec2-54.*:~$  cd /home/chaton/service/tomcat/bin 
chaton@ec2-54.*:~/service/tomcat/bin$  vi catalina.sh 
JAVA_OPTS="  -Xms16g -Xmx16g -XX:MaxPermSize=512m -XX:+HeapDumpOnOutOfMemoryError -verbose:gc ..." 
as-is 
JAVA_OPTS=" -Xms16g -Xmx16g -XX:MaxPermSize=512m" 
to-be 
JAVA_OPTS=" -Xms16g -Xmx8g -XX:MaxPermSize=512m"  
==============================================================================================================

- Deploy 후 체크리스트 작성 
1. 점검 사항 작성 
==============================================================================================================

- properties[batch] 
BuddyRecommendation/    ==> 친구 추천(없음) 
interaction-plan-b/   ==> interaction 
$ cd /home/chaton/interaction-plan-b -->  vi interaction.properties ===> 작업 대상 
interaction-promotion/    ==> promotion 
$ cd /home/chaton/interaction-promotion -->  vi interaction.properties  
==============================================================================================================

- netstat -an 으로 CLOSE_WAIT 체크 
root@pew1lm001m:~#  netstat -an  grep 2080  grep CLOSE  wc -l 
1536 
==============================================================================================================

- W35 정기 배포 
18:00 당직 
18:10 석식(최인택 책임이 배포 1조 조원들에게 사줌) 
19:00 친구추천 Batch 서버 배포 업무 숙지  
22:30 배포 사전 회의 
00:00 준비 ==> 013.08.29(목)  
01:00 Live MobileWeb 서버 장애로 지연됨 
02:45 시작(JP(GLD) -> US -> EU -> SG -> KR -> CN) 
04:10 배포 종료 
04:40 상황 종료 
04:45 W35 디플로이 사후 점검 리스트 작성 
05:00 CN 작업 에러 발생으로 배포 지연됨 
07:30 종료 
08:00 퇴근 
08:30 귀가 
08:40 조식(빵) 
08:50 취침 
11:50 기상 
12:10 중식 
12:30 집출발 
12:40 택배(우체국: 장인 물건(허우씨집)) 
13:00 산모.신생아도우미지원 신청(관악구 보건소) 
13:50 서울대입구역 
14:20 서울중앙지원 민사과 
14:30 무료법률상담(조남권 사건 주소 보정 신청 하라고 함, 아내는 따로 소송 걸어야 함) 
14:50 13층 민사2과 방문(재판으로 직원 없음) 
15:00 조남권 사건 주소 보정 신청 
15:30 종료 
16:00 귀가 
18:30 석식 
23:10 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.30(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 09:00 ~ 18:00 --> W35 정기 배포 Batch(promotion Batch 환경 변경 안했다고 함) 

- ChatON 운영 Prj
- Buddy로 업무 숙지 
1. buddy 문서 분석(2.3 Multi Device Management: WorkFlow, module 산출물 분석) 
==============================================================================================================

- SGMP 등록 
1. http://sgmp.samsungosp.com --> tamario@n*.com /t***3*9 
http://sgmp.samsungosp.com/sgmp-ui-web/home/auth/SignupReview?globalUserId=5gxisqeskr 
==============================================================================================================

- 줄 바꾸기(editPlus에서) 
1. 바꾸기(새창) --> 정규식(X)[체크], 찾을 말(I): ;, 바꿀 말(E): Wn, 바꾸기(R)[클릭] 
==============================================================================================================

- 2013년 산모.신생아 도우미 지원사업 안내(관악구 보건소) 
http://www.gwanak.go.kr/servlets/rnl/gwanak/user/servlet/ContentServlet?cmd=CONTENT&seq=708&menu_no=000580 
1. 구비서류 : 사회복지서비스신청서(관악 보건소: 평일만 업무함)  
   ① 건강보험카드 사본 (맞벌이 부부일 경우 모두의 카드사본 첨부)  
   ② 건강보험료 납부확인서 (맞벌이 부부일 경우 모두의 확인서 첨부)  
       (* 납부확인서 발급방법 : 국민건강보험공단 홈페이지 발급 또는 전화 후 팩스 발급)  
   ③ 산모수첩 또는 진단서 또는 소견서(출산전) / 출생증명서(출산후)  
   ④ 산모신분증 (대리인 신청시, 대리인 신분증 포함)  
2. 연락처: 관악 보건소 5층 지역 보건과 ☎ 879-7153~4 
------------------------------------------------------------------------------------------------------ 

- 2013년 산모.신생아 도우미 지원사업 이용방법 안내 
1. 자격: A-나형(http://www.socialservice.or.kr/user/htmlEditor/view2.do?p_sn=7) 
 1) 서비스 가격: 792,000원(원가) ==> 바우처 제도 본인부담금: 87,000원(A-나형 --> 정부지원금: 613,000원) 
2. 방법 
  1. 보건소 접수(10.*. 서비스 이용  
  --> 5. 결제(휴대폰 인증번호) 
3. 제공기관 
 1) 친정맘(관악구 http://www.mom10.*.com) 신청: ☎ 858-0087 ==> 본인부담금: 8만 7천원 
4. 본인부담금 입금 
 0) 입금 계좌: 국민은행 524502 04 017225, 예금주: 임선영, 87,000원 송금 
 1) 입금 방법: 서비스 제공기관에 직접 납부[본인부담금] --> 계좌입금 원칙 
 2) 입금액: 제공기관에서 책정한 가격(6~10만원 예상) ==> 원래 2주 7~80만원 
5. 서비스 이용 
 1) 서비스 기간: 단태아 12일(평일: 9~17시, 토요일: 9~13시) 
 2) 서비스 내용: 산모 식사, 유방관리, 산모.신생아 세탁물, 산모.신생아 방청소, 신생아 돌보기 보조, 산보조리 
                        관련 산모 요청사항 등 
6. 서비스 결제 
 0) 가상카드번호: 94000094 
 1) 가상ID카드번호(8자리)전송 --> 휴대폰인증번호(SMS)전송 --> 결제 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.08.31(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 주말  
05:30 기상 
06:30 국민은행 봉천동지점 앞(버스, 태훈이형 속초 휴가) 
06:30 신구초등학교 
06:40 숏게임(0:2 패) 
07:30 종료 
08:10 조식(화정식당, 김치찌게) 
09:20 종료 
09:10 집출발 
10:25 모태산부인과: 빈혈주사[7만원]  
11:10 귀가 
13:00 중식 
14:00 새문빌라 401호 이사 옴 
15:00 낮잠 
18:10 기상 
18:30 석식(소고기덮밥(2개), 설렁탕, 짜장면): 포마토 
19:30 귀가 
23:00 취침 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■