

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.03) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.03.01(금) 작업 ■■■■■■■■■■■■■■■
---> 10:30 ~ 18:00 --> 새문빌라 확정일자 받기(행운동 주민센터) 

- 이사하기 

06:00 기상 
06:20 짐 정리(거실 세탁기 행거 철거, 컴퓨터 책상 철거) 
07:30 새문빌라로 감(자전거: 노트북): 501호 주인 만남 
       ==> 주소: 서울시 관악구 봉천동 28-22 새문빌라 301호(서울시 관악구 행운1바길 19) 
07:40 새문빌라로 다시 감(자전거: 밥솥을 처음 가지고 들어감) 
       ==> 현관문: 방범(image) > 열쇠(image) > 1237 > 종(image) , 301호: 전자키 올리기 > 0508 > 전자키 내리기 
08:40 서울용달 이사짐 센터 사장님 만남(관악중학교): 이제실(010-3745-0, 010-2697-0) 
08:50 짐 싣기(1톤 트럭에 겨우 다 실음): 냉장고, 세탁기, 침대 매트리스 ==> 박스 17개, 노끈 3개(50m) 
09:30 봉천동 집 출발 
09:50 봉천동 새문빌라 도착 
10:00 짐 내리기 
11:50 종료(이사비 12만원 계산(2만원 팀)) 
13:00 봉천동 106-23집 재방문(청소: 주인 아주머니에게 열쇠 전달) 
12:20 짐 정리(컴퓨터 책상 나사 없어서 고생 함 ==> 이사시 모든 나사는 여행용 캐리어 앞쪽에 보관할 것) 
14:00 식탁 설치([썬퍼니처] 럭스 대리석 4인 식탁세트, 설치비 3만원) 
15:00 화장대 도착(리센트 정품 놀라운 수납 샌시화장대) 
14:20 빨래해서 거실에서 말림(햇볕 잘 들어옴) 
20:00 석식(도시가스 안됨) 
23:20 취침 
==> 이사짐 역경매(www.2424.net): 조대형 과장이 소개시켜 줌 
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.03.02(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구  

06:00 기상 
06:15 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교  
07:00 숏게임(4:3 승) 
08:10 종료 
08:20 조식(화정식당: 닭곰탕): 형들이 쏨 
09:00 종료 
09:10 귀가  
10:30 에어컨 설치(LG 휘센 에어컨 2in 1(F-Q165DMPWQW)): 실외기가 옥상에 있고 안방을 설치하려면 벽 뚤고 
        배관을 옥상에 올려야 한다고 해서 거실만 설치(설치비: 20만원) 
14:00 침대 설치([에이스침대] LUCE-II LQ CA (퀸침대) 
11:30 김치냉장고 주문(이종민씨, 롯데마트: 신한카드 10개월 무이자): 3월 9일(토) 배송 예정 
13:00 안방 정리 
15:00 가운데 방 정리 
20:00 석식(도시가스 안됨) 
23:00 컴퓨터 책상 조립(나사 찾음) 
22:40 종료 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.03(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:30 기상  
07:07 국민은행 봉천동지점 앞(태훈이형 차) 
07:20 신구초등학교 
08:50 숏게임(3:1 패) 
08:45 월례회의(유니폼 때문에 회장하고 상권이형이 싸움) ==> 분홍색 줄무니 까만 운동복: 105 사이즈로 결정 
09:30 게임(6;3 패): 내기 시합 
10:50 종료 
11:20 중식(문경세재: 삼겹살 파티 ==> 한상봉 회장님이 쏨(축구 내기에서 짐))  
13:00 종료 
13:20 귀가 
14:00 도시가스 설치(서울도시가스: 4만 2천원): 은행가서 돈 찾아 옴(수수료: 150원) 
15:00 짐정리(보일러실 정리)
15:20 빨래해서 거실에서 말림 
17:00 낮잠 
20:00 석식  
21:20 종료 
21:30 TV 시청(개그콘서트) 
23:00 커텐 달기(안방, 중간방) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.04(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 19:00 --> 새문빌라 전입신고(행운동 주민센터), 이필용(*), 윤대배(*) 과장 투입 

- ChatON 운영 Prj
- ChatON_1차 대응 매뉴얼 숙지 확인 
1. 16시~17시 : 담당 모듈 외 나머지 전체 1차대응 숙지 테스트(최인택 책임) 
==============================================================================================================

- '13년 정보보호서약서 및 Compliance 전자서명을 위한 인증서버 접속 확인 
telnet 211.118.38.179 4502 
telnet 70.20.10.160 8093 
telnet 70.2.140.140 8096 
==============================================================================================================

- 전세금 수수료(3월 1일 송금할 것) 
1. 국민은행: 075601 04 161218, 박동재(태화 부동산): 윤실장, 585,000원 송금 
--------------------------------------------------------------------------- 
- 에어컨 설치비, 추가 비용 송금 
1. 국민은행: 015401-04-195138, 예금주: 장명수, 25만원 송금(설치비: 20만원, 가격 인상: 5만원), H: * 
--------------------------------------------------------------------------- 
- 식탁 배송비 송금 
1. 국민은행: 42660201 084559, 예금주: 김광현, 3만원 송금, H: * 
==============================================================================================================

- 관리비 자동이체 설정 
1. 신한은행: 110 371 408160, 예금주: 권경옥(*), 2만원 
--------------------------------------------------------------------------- 
- 서울 도시가스(이사시 전화할 것) 
1. 설치 요청: T: 876-0903 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.05(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 18:00 --> KT 인터넷, 전화 신청, 야구 WBC 탈락(네덜란드 전 패배, 대만 전 승리) 

- ChatON 운영 Prj
- ChatON_1차 대응 매뉴얼 숙지 확인(2번째) 
1. 16시~17시 : 담당 모듈 외 나머지 전체 1차대응 숙지 테스트(최인택 책임)  
==============================================================================================================

- SPCS 점검 
1. trunk 에러 체크 ==> File 서버 에러로 추정됨 
==============================================================================================================

- Work Flow 분석 문서 작성 계획서 
1. 작성 후 메일로 최책임에게 전송 
==============================================================================================================

- 김은아 졸업, 입학 용돈 송금 
1. 농협: 356-0325-4509-13, 예금주: 김은아, 20만원 송금 
==============================================================================================================

- KT 인터넷, TV 신청 
1. 인터넷 + 쿡티비, 스카이라이프: 34,100원(상품권11~12만 + 현금21~21만원), T: 1644-8979, 070-8248-8979 
http://cafe.naver.com/ilzocom/325 
https://my.olleh.com:444/charge/FarRealtimePayInfo.action 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.06(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:20 ~ 19:00 --> 당직 

- ChatON 운영 Prj
- 모듈별 ChatON 분석 문서 작성 발표(PM) 
1. 13시~15시: buddy 
2. 15시 15분 ~15시 30분: SMS G/W 
---------------------------------------------------------------------------------------------------------------------------- 

- Message 교육 
1. ChatON_1차 대응 매뉴얼 관련 교육(강동훈 과장 발표) 
2. message 서버 로그 분석@@@  
(connect)chaton@ip-10-132-5-204:~$ alias  grep message  ===> 서버 검색(message)   @@@ 
(connect)chaton@ip-10-132-5-204:~$ prod-eu-west-1-message2 ===> alias 빼고 바로 집어 넣음: 아일랜드 message2번 서버(pue1ms002)  
(connect)chaton@ip-10-132-5-204:~$ pew1ms001m  ===> pew1ms001m, pew1ms001m  
chaton@ip-10-252-223-50:~$ tail -f  /mnt/log/Chaton_message_server 
chaton@ip-10-252-223-50:~$ vi /mnt/log/Chaton_message_server  grep Exception  ==> Exception 만 조회(message 서버는 log 너무 많음)  
chaton@ip-10-252-223-50:~$ grep '2013-03-05 12:00:00' /mnt/log/Chaton_message_server  more  ==> 12시 데이타 찾기 (페이지 다음: f, 페이지 전: b) 
chaton@ip-10-252-223-50:~$ grep '2013-03-05 12:00:00' /mnt/log/Chaton_message_server.20130305.log  more  ==> 12시 데이타 찾기 
chaton@ip-10-252-223-50:~$ grep '2013-03-05 12:' /mnt/log/Chaton_message_server.20130305.log  more  ==> 12시 데이타 찾기 
==============================================================================================================

- SVN 서버 IP가 변경   
3. 2.5  SVN Repositories ==> 현재 사용 
SVN Repositories = > 오른쪽 클릭 > New > New Repository Location  
URL : svn://70.4.78.107/Development ==> tamario2.jin/dev123 ==> new 
URL : svn://70.4.102.46/CHATON ==> tamario2.jin/sds2012 
URL : svn://70.4.102.46/SSM_EV ==> tamario2.jin/sds2012  
==============================================================================================================

- 삼성 갤럭시 S2 휴대폰 정보 
1. S/N: R18B458049, 2. 일련번호: 016902 
3. 제조년월일: 20110427 
4. IMEI(International Mobile Equipment Identity): 이동전화 단말기를 출고할 때 제조사가 부여하는 단말기 국제고유 식별번호. 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.07(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 --> 21시경에 ollehEgg 설치 후 신부랑 화상통화 함 

- ChatON 운영 Prj
- trunk 에러(/TrunkDao.java 파일에서) 
1. getTrunkListOrg() 함수 처리 DB에서 필드 스키마 dault 값을 임의대로 설정(Stage DB 서버와 같게 설정해야 함) 
sql.append("SELECT t.sessionid, t.regdttm, t.lastupdttm, t.lastcmtdttm, t.totitemcnt, t.totcmtcnt, m.unreaditemcnt"); 
sql.append(" FROM (trunk as t INNER JOIN chatlist c ON c.sessionid = t.sessionid AND c.uid = ? AND c.status = 'activated')"); 
sql.append(" LEFT OUTER JOIN mytrunk as m ON m.uid = c.uid AND m.sessionid = t.sessionid AND m.vldenddttm = t.vldenddttm"); 
sql.append(" WHERE t.vldenddttm = '2038-01-19 03:14:07' AND (t.lastupdttm > ? OR t.lastcmtdttm > ?)"); 
sql.append(" ORDER BY lastupdttm DESC LIMIT 100;"); 
==============================================================================================================

- Windows7에서 무선 애드혹(Ad-Hoc, 컴퓨터 대 컴퓨터 네트워크) 설정하기 
http://lambada.co.kr/80097069638 
==============================================================================================================

- 무선 네트워크 연결(Ad-Hoc) 
0. 먼저 무선 네트워크가 잡혀 있어야 함( Fn + F10 ==> 안되면 WLAN 드라이버 삭제 후 다시 설치할 것) 
http://lambada.co.kr/80097069638 
1. 제어판\네트워크 및 인터넷\네트워크 및 공유 센터 : 어댑터 설정 변경(왼쪽) 메뉴(클릭) 
  > 네트워크 연결(화면) 
 1) 로컬 영역 연결(우 클릭) > 로컬 역역 연결 속성(새 창) 
  - "다른 네트워크 사용자가 이 컴퓨터의 인터넷 연결을 통해 연결할 수 있도록 허용" 체크 
  - "무선 네트워크 연결" 선택 
  - "다른 네트워크 사용자가 공유 인터넷 연결을 제어하거나 중지시킬 수 있도록 허용" 체크 
 2) 무선 네트워크 연결 
 3) 무선 네트워크 연결 2 ==> 사용 안함을 한 후 다시 사용으로 설정(에러가 날 때) 
2. 제어판\네트워크 및 인터넷\네트워크 연결  ==> "네트워크 공유됨" 확인 
3. 제어판\네트워크 및 인터넷\네트워크 및 공유 센터: "새 연결 또는 네트워크 설정" 클릭 
 1) 무선 애드혹(컴퓨터 대 컴퓨터) 네트워크를 설정합니다." 클릭 
 2) "무선 네트워크에 수동으로 연결" 
  - 네트워크 이름 : 01. TAMA_Ad hoc 
  - 보안 종류 : WEB  
  - 보안 키 : 33900 
  ==> ad hoc을 설정할 수 없습니다. ==>  안되면 WLAN 드라이버 삭제 후 다시 설치할 것 
4. Fn + F8: 네트워크 켜기(빨간 불이 옴) 
5. IE Tab + X ==> 모바일 센터[무선 테트워크 끄기(T)로 보임]] 
6. MSI MSI GT638DX-i7 노트북(업무용으로 사용하는 노트북) 무선 확인 
 1) Intel® Centrino® Wireless-N 130 ==> http://www.intel.com/p/ko_KR/support/detect/wireless 
==============================================================================================================

- Windows7에서 무선 애드혹(Ad-Hoc, 컴퓨터 대 컴퓨터 네트워크) 설정하기 
1. http://lambada.co.kr/80097069638 
==============================================================================================================

- VN 
svn://70.4.102.46/CHATON/NewDocument/9999.SDS_Analysis/module/mobileB/Service 
이 경로로 모아 놓으셨다는 말씀이죠? 
==============================================================================================================

- ollehEgg 가입(안산 중앙역 근처 매장에 직접 방문) 
0. 가입상품: olleh 4G WiBro 
1. 조건: 신표준 10G, 12개월 약정(만료일: 2014/03/06), 월 만 천원, 위약금: 88,000원 
2. 단말기 모델명: KM-MR100S, 가입비 무료 
3. 판매처: (주)안산프라자/백서영(경기 안산시 단원구 고잔동 534-3, T: 031-402-4711, 이병하 
4. ollehEgg 정보: SSID: ollehEgg_384/KEY ktt39284 
5. 제조년월일: 2012.08.09, 일련번호:039284 
http://www.gmarket.co.kr/challenge/neo_search/search_myshopping.asp?group_no=1&sViewGubun=&toLoc=favorite  
6. http://www.olleh.com, tamario/s*p**m8**1 
http://item.gmarket.co.kr/detailview/item.asp?goodscode=276444363 
==============================================================================================================

- ollehEgg 환경 설정 
1. 브라이저에서 http://192.168.1.1, user/0000 
2. ollehEgg 정보 
 1) 단말기 모델명: KM-MR100 
 2) 와이브로 하드웨어 주소(MAC): 00:17:C3:92:79:34 
 3) SSID: 02_ollehEgg_TAMA 
 4) 보안 모드: WPA-PSK 
 5) WPA: TKIP/AES 
 6) 네트워크 인증키: 339000339(비밀키) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.08(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 

- ChatON 운영 Prj
- 모듈별 hatON 분석 문서 작성 발표(PM) 
1. 11시 10분 ~ 12시 10분: Service 
==============================================================================================================

- Casandra 교육 
1. 13시 30분 ~ 16시 30분 
==============================================================================================================

- Speed 안전결제(ISP) 
*@*.*/s*p**8*1*, 결제비밀번호: 339000  
==============================================================================================================

- [사비나]화이티아 600 3단 서랍장(침대용), 51,450원 
http://www.hyundaihmall.com/front/shItemDetailR.do?ReferCode=250&ItemCode=2010063086&DTS_AID= 
==============================================================================================================

- 타이벡 커버 퀸(침대 메트리스 커버), 48,800원 
http://itempage3.auction.co.kr/DetailView.aspx?ItemNo=A682287323&frm3=V2 
------------------------------------------------------------------------------------------------------- 

- 에이스 퀸 침대 규격 
1. 침대: 1580 * 2179 * 1158, 매트리스: 1500 * 2000 * 230 
==============================================================================================================

- 액자(사진) 주문(인화) 
http://www.smilecat.com/mall/info_calendar.jsp?code1=85&code2=10&code3=5&cate=500 

- 사진(배경화면) 
http://500px.com/popular 
==============================================================================================================

- 갤럭시 S2 맥 어드레스(MAC address) 확인 방법 
1. 환경설정 > 디바이스 정보 > 상태 - 맨아래쪽에 WIFI MAC 주소 ==> 54:9B:12:F6:DC:CD 
==============================================================================================================
  
- LG U+ WIFI 신청(지하철에서 이용 가능) 
U+zone: tamario@upl 
- KT WIFI 신청(지하철에서 이용 가능): 010-000-1472 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.09(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구
06:00 기상 
06:20 국민은행 봉천동지점 앞(태훈이형 차) 
06:40 신구초등학교  
07:00 숏게임(4:3 패) 
08:10 종료 
08:20 조식(화정식당: 닭곰탕): 형들이 쏨 
09:00 종료 
09:10 귀가  
11:00 물소 쇼파 배송(쇼파가 너무 커서 반송 처리: 배송비(5만원) 주고 보냄) 
        쇼파(2900mm) ==> 거실(2400mm): 옥션에서 배송비 만원으로 반품 신청(4만원 더 송금할 것)  
	==> 10만원 손해 봄(이현가구 최고급 물소 가죽소파 4인용) 
12:00 김치냉장고 배송(사다리 차, 전시 상품이라 문 높이가 안 맞아서 설치 기사가 고생함) 
        (이종민씨, 롯데마트: 신한카드 10개월 무이자)  
14:00 낮잠 
19:00 기상 
19:10 장보기(원당시장: 파이, 라면 ==> 신한카드 한도 초과(700만원 --> 910만원 한도 증가) 
20:00 석식 
21:30 루옌(부인)과 화상통화 
22:30 종료 
23:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.10(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:30 기상  
06:20 국민은행 봉천동지점 앞(태훈이형 차) 
06:40 신구초등학교(추움: 영하 -1도, 바람 많이 붐) 
08:50 숏게임(3:1 패) 
09:30 게임(6;3 패) 
10:20 종료 
11:20 중식(문경세재: 갈비탕: 만원)  
12:30 종료 
13:00 귀가 
14:00 집 정리(못 질하기: 시계, 액자 걸기) 
17:00 낮잠 
19:00 기상 
20:00 석식  
20:40 루옌(부인)과 화상통화 
21:20 종료 
21:30 TV 시청(개그콘서트) 
23:00 청소(공부방 정리) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.11(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 19:00 --> 서영우(*) 차장 투입, 중식(금문도: 김팀장, 서과장, 장과장) 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.5.1. Get Trunk List 
1.5.2. Get Trunk List(based timestamp) 
1.5.3. Get Trunk 
1.6.1. Mark As Read 
1.6.2. Get Item List 
==============================================================================================================

- 테이블명 찾기(Erwin에서) 
1. Ctrl + g 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.12(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:45 ~ 19:00 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.6.3. Get My Item List 
1.6.4. Get Item 
1.6.5. Get Item(based Item-info) 
1.6.6. Get Item ID 
1.6.7. Delete Item 
1.6.8. Delete Items 
1.6.9. Delete All Items 
==============================================================================================================

- SPCS 점검 
1. trunk 에러 체크 ==> 아이템의 썸네일 이미지가 깨지는 현상 
==============================================================================================================

- 내일 회식 장소 공지 합니다. 
1. 장소: 흑돈가 강남 직영점(02-3471-9700), 강남역 8번출구, 주소: 서울 서초구 서초동 1322-12 
           http://place.map.daum.net/14931936 
2. 일시: 03.13(수) 18시 30분 
==============================================================================================================

- 4대문 관람(상환)  
1. 종묘, 창덕궁, 창경궁, 비원 관람 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.13(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:15 ~ 18:10 --> ChatON Proj 회식(아이엘포유) 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성  
1.6.5. Get Item(based Item-info) 
1.6.6. Get Item ID 
1.6.7. Delete Item 
==============================================================================================================

- 업무 흐릅 
1. ItemDao에서 invalidateItem(): 유효기간을 utc timestamp로 변경 
UPDATE item SET vldenddttm = utc_timestamp() WHERE itemid = ? AND sessionid = ? AND senderuid = ? AND vldenddttm = '2038-01-19 03:14:07' 
VLDENDDTTM: 유효기간, REGDTTM: Chatroom 생성 시각, LASTUPDTTM: 최종 upload 시각  
LASTCMTDTTM: 최종 comment's post 시각 
------------------------------------------------------------------------------------------------------- 

- UTC_TIMESTAMP(mysql에서): YYYY-MM-DD HH:MM:SS(또는 YYYYMMDDHHMMSS.uuuuuu) 형식의 현재 
UTC 날짜, 시간을 반환합니다. 
mysql> SELECT UTC_TIMESTAMP(); --> 2011-11-09 13:15:05  
mysql> SELECT UTC_TIMESTAMP()+0; --> 20111109131505.000000 
==============================================================================================================

- 2013년도 삼성SDS 전자서명 등록 
1. 회사명: (주)아이엘포유, 2. 삼성SDS 사번: WA967 
3. 아이디: tamario.jin, 4, 인증서 비밀번호: s*pe*m8*11 
http://70.2.140.140:9043/iSSP/security/IsspInit.jsp 
http://70.2.140.140:9043/iSSP/security/IsspInit.jsp?menuId=00 
4. SDS 서비스 데스크에 전화(3429-2000)해서 신규로 발급 신청 ==> 삼성 SDS 고지환 선임이 mysingle 문자로 
처리 확인 함 
==============================================================================================================

- ChatON Proj 회식(아이엘포유) 
1. 일시: 2013년 3월 13일 (수) 18시 30분 
2. 장소: 흑돈가 강남 직영점(02-3471-0), 강남역 8번출구, 주소: 서울 서초구 서초동 1322-12 
           http://place.map.daum.net/14931936  
3. 참석: (주)아이엘포유 김팀장님, SDS PL, 프리랜서, 김향록 전무 등 
==============================================================================================================

- 청첩장 
0. BH2075 ==> 장당: 374원, 200장: 74,800원 
http://www.thecard.co.kr/product/product_detail.asp?card_seq=33853 
1. HO205 ==> 장당: 374원, 200장: 74,800원 
http://www.thecard.co.kr/product/product_detail.asp?card_seq=30695 
2. BH2024 ==> 장당: 374원, 200장: 74,800원 
http://www.thecard.co.kr/product/product_detail.asp?card_seq=33868 
3. B0036 ==> 장당: 495원, 200장: 121,000원 
http://www.thecard.co.kr/product/product_detail.asp?card_seq=30619&cardkind_seq= 
==============================================================================================================

- 4대문 관람(상환)  
1. 창덕궁 매표소(돈화문: 13시 30분) 
2. 종묘, 창덕궁, 창경궁, 비원 관람 
==============================================================================================================

- 토요일 나눔 동기 모임 장소 공지 
1. 장소: 착한고기 서울대입구점(서울대입구역 4번 출구, 서울 관악구 봉천동 883-17번지, T: 02-888-0501) 
http://place.map.daum.net/1731768 
2. 일시: 3월 16일 18시 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.14(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:15 ~ 18:30 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.6.8. Delete Items 
1.6.9. Delete All Items 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.15(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> 이정재 과장 강남빌딩으로 이동 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.7.1. Add Comment 
1.7.2. Remove Comment 
1.7.3. Get Comment List  
==============================================================================================================

- 이현 물소쇼파 반품 배송비 송금  
1. 농협 1091 02 012540  예금주 김선덕  
2. 반품 왕복 배송비 입금하셔야 반품 처리 ==> 반품 처리 완료 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.16(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구
06:00 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:00 숏게임(4:3 패): 운동장에 신입회원 모집 현수막 담(3개) 
08:10 종료 
08:20 조식(수정식당: 부대찌게): 회장님이 쏨 
09:00 종료 
09:30 귀가  
09:40 KT 인터넷 설치, Sky Life 설치 
       - 상품권: 11만원, 현금: 21만원 ==> 총 33만원 
10:20 종료 
11:20 집 청소 
12:20 집출발 
13:20 창덕궁 돈화문(후남, 상환 만남) 
13:30 중식(부대찌게): 후남이가 쏨 
14:10 창덕궁 매표(후남이가 쏨) 
14:20 창덕궁 후원 관람(단체 관람) 
       1. 함양문(창덕궁, 창경궁 연결문) --> 2. 부용정(연못 정자, 규장각) --> 3. 의두합(순조, 효명세자, 소박한 건물)  
       --> 4. 불로문(돌문, 무병장수)  --> 5. 애련치권역(숙종, 장희빈) --> 6. 연경당(4대부집) 
       --> 7. 존덕정권역(2층 육각정자) --> 8. 옥류천(개울) --> 9. 돈화문(창덕궁 정문) 
       http://www.cdg.go.kr/guide/guide_course_02.htm 
16:00 종료 
16:10 창덕궁 관람(인정전) 
17:20 종료 
17:40 버스(종로 2가 출발) 
18:30 관악구청앞 도착 
18:40 착한고기(현용, 호수 만남): 현용이 쏨 
20:00 당구(3구: 상환이랑 편 먹고 참패 함): 당구비 만워 냄 
21:20 루옌(부인)과 화상통화 못함 
22:20 술집(내가 쏨: 3만 4천원) 
24:00 종료 
24:10 귀가(보일러 틈: 상환이 자고 일욜 아침에 감) 
24:50 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.17(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:00 기상  
06:20 국민은행 봉천동지점 앞(태훈이형 차) 
06:40 신구초등학교 
08:10 숏게임(목이 아퍼서 회장님이 수지침 놓아줌: 약간 호전 됨) 
08:00 아디다스 체육복 받음(병춘이형이 5월 결혼 부주로 5만원으로 체육복비 내줌) 
09:30 게임(4;3 패) 
10:20 종료(상요형 병춘이형이 싸워서 중단됨) 
11:00 중식(문경세재: 갈비탕): 회장님이 쏨 
12:30 종료 
13:00 귀가 
14:00 낮잠 
16:00 기상 
16:10 침대 커버 매트 구입(2만 4천원) 
16:40 관악프라자 사우나(6천원) 
18:20 종료 
20:00 석식 
21:30 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.18(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 07:15 ~ 21:00 --> 하민규 과장 외조모상, 당직 

- ChatON 운영 Prj
- Service_Contents_API별 서비스흐름_v0.1 작성 
==============================================================================================================

- 공유기 웹 설정 (2013년 3월 17일) 
1. http://192.168.123.254/html/index.asp, ssp**88*(기본: admin) 
2. 무선 보안 설정  
 1) SSID(네트워크 이름): 51_myLG070_TAMA, WEP 키 입력 Key1: aa11221122(기본: 123456789a) 
==============================================================================================================

- 신한카드 교체 
1. olleh 신한 빅플러스 카드 카드발급 
==============================================================================================================

- 휴대폰 충전기 
1. 만능 듀얼 어댑터(케이블 2개 포함), 9,300원  
http://itempage3.auction.co.kr/DetailView.aspx?itemno=A566968761&frm3=V2 
2. 애니모드 듀얼 USB 가정용 충전기, 18,900원 
http://itempage3.auction.co.kr/DetailView.aspx?itemno=A566968761&frm3=V2  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.19(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 -->  

- ChatON 운영 Prj
- Service_Contents_API별 서비스흐름_v0.1 작성 
==============================================================================================================

- ChatON 분석 추가 문서 작성 
1.8.1. Set Compatibility 
1.8.2. Get Compatibility Buddy  
1.9.1. Get SNS ID  
1.9.2. Post SNS ID 
1.9.3. Poist SNS friend List 
==============================================================================================================

- W12 정기 배포 참관(22시) 
1. 장소: 삼성전자 수원 사업장 
2. 일시: 3월 19일(화) 22시 
---------------------------------------------------------------------------------------------------------------------------- 

- 삼성전자 수원사업장 방문예약(https://www.sdigitalcity.com/security/visit/login.do)  
1. 방문 시각: 금일 오후 20시부터 내일 오전 10시까지 
2. 접견자: jin12.lim (임형진 수석, Social개발그룹(MSC)) 
3. 방문사업부: Media Solution 센터 
4. 건물: CS환경센터 
5. 접견장소: 사무실 
6. 기타: 출입 등록을 위해서 신분증 지참할 것 
7. 버스: 1) 강남역(M5422번, 5414번 줄) => 삼성전자 중앙문(첫차: 5시, 막차: 23시, 배차간격: 15분)(1시간 걸림) 
2) 삼성전자 중앙(M5422번) => 뱅뱅사거리(641번) => 서울대입구역(641번)(2시간 걸림) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.20(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 --> W12 정기 배포 참관 휴무(07시 30분 퇴근) 

- ChatON 운영 Prj
- W12 정기 배포 참관 
1. Incorrect 에러 
원인: 특수 문자를 사용해서 나는 에러 
 exception is java.sql.SQLException: Incorrect string value: '\xF0\x9F\x90\xA3' for column 'content' at row 1  
2. 파일 temp 폴더로 이동 
(pue1sv001)chaton@ec2-50-19-49-170:~$ mv error.txt ./temp/ 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.21(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 --> 7층 자리 이동(옆자리로 이동) 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.8.1. Set Compatibility 
1.8.2. Get Compatibility Buddy  
1.9.1. Get SNS ID  
1.9.2. Post SNS ID 
1.9.3. Poist SNS friend List 
------------------------------------------------------------------------------------------------------------------------ 

1.8.1. Set Compatibility: 휴대폰 호환성을 위해 휴대폰이 새로 켜질 때 휴대폰 사양을 등록하여 나중에 휴대폰 
업데이트가 있을 경우 저장된 사양 정보를 조회하여 호환이 되는 지 확인 함 
1.9.1. Get SNS ID: 개인 SNS을 로그인하여 내가 사용하고 있는 사용자가 ChatON에 가입이 되어 있지 않으면 
추천을 할 수 있게 설정을 해줌 
==============================================================================================================

- Deploy 절차 작성 및 공유 사항 작성 
==============================================================================================================

- super putty 다운로드(설치: 최신형) 
http://code.google.com/p/superputty/downloads/detail?name=SuperPutty-1.4.0.2.zip&can=2&q= 
- putty connection manager 다운로드 ==> (주)삼성전자 김용욱 선임(Service 모듈 당직자)이 사용 
http://dppong.tistory.com/52  
- kitty 
http://www.downloadbestsoft.com/KiTTY.html 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.22(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 

- ChatON 운영 Prj
- ChatON 분석 추가 문서 작성 
1.8.1. Set Compatibility 
1.8.2. Get Compatibility Buddy  
1.9.1. Get SNS ID  
1.9.2. Post SNS ID 
1.9.3. Poist SNS friend List 
==============================================================================================================

- Theme(테마) 설정(eclipse에서) 
1. Help > Eclips Marketplace(클릭) 
Find: theme(Go: 클릭) > Eclipse Color Theme: Instal(클릭) ==> 설치 완료 
2. Window >  Preferences > Genaral > Appearance > Color Theme ==> Mr(Apply: 클릭), 
Sunburst(Apply: 클릭), Retta(Apply: 클릭) 
3. Window > Preferences > Run/Debug > Console(클릭):  
Background color: 배경색(녹색: 86, 78, 194) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.23(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:00 ~ 18:00 

▦조기축구
06:00 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:00 숏게임(4:3 패): 1골, 1 A/S 
08:00 종료 
08:20 조식(화정식당: 닭곰탕): 영석이형이 쏨 
09:00 종료 
09:30 귀가   
13:50 [노송가구] 아브라 천연면피 라텍스 3인용 소파 배송(기사가 길 못 찾아 헤냄): 설치비 3만원 
14:20 종료 
17:00 장보기(베트남 모임) 
18:00 종민씨 도착(삽겹살 사옴) 
19:50 원석씨 도착 
20:00 삽겹살 파티(회비 3만원 씩 냄) 
21;20 종민씨 일찍 감(롯데 마트 지점 점검) 
24:00 취침(맥주 많이 먹음, 기억 없음) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.24(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:00 기상  
06:20 국민은행 봉천동지점 앞(태훈이형 차): 기름 넣고 늦게 옴, 술이 안깨서 고생함 
07:10 신구초등학교 
07:20 신구초등학교 출발(버스) 
07:30 만남의 광장(상요형 택시 타고 와서 만남) 
09:00 당진종합운동장 도착 
09:30 게임(7:0 패): 대전팀 
11:30 게임(2:1 승): 도봉팀(골키퍼 봄) 
12:20 식사  
14:00 종료 
14:50 횟집(당진 팔각정 횟집): 서해대교 맞은 편 
16:10 노래방(고문님들이 아줌마들 꼬셔서 감) 
18:00 당진 출발 
20:00 신구초등학교 도착(너무 늦게 도착함) 
20:40 귀가 
20:50 루옌(부인)과 화상통화(아버지 선물 남방 사오라고 함) 
21:30 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.25(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 

- ChatON 운영 Prj
- 1.5. Trunk 소스 분석(로직, DB 테이블 연관성 분석) 
==============================================================================================================

- 베트남 마트넷 
http://www.vnmart.net/shop/main/index.php 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.26(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 --> 뚜언에게 전화(신부 4월 6일 입국할 예정이라고 통보 함) ==> 매니저님 확인 

- ChatON 운영 Prj
- 1.5. Trunk 소스 분석(로직, DB 테이블 연관성 분석) 
==============================================================================================================

- 모듈 통합 
1. Service, Buddy, SMS G/W 
==============================================================================================================

- Service Server API Work Flow 공유(양정훈, 문수현) 
- Web Client <-> Server API 이용 정합성 도출 회의 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.27(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 21:00 --> 당직 

- ChatON 운영 Prj
- 1.5. Trunk 소스 분석(로직, DB 테이블 연관성 분석) 
==============================================================================================================

- pkr1ms002m 서버가 작업 후 LB 문제로 로그가 안 찍힌 것으로 판단됨 
CHATON-pkr1ms002m  
CRITICAL - Process is not running!. Daemon_Check-Bootstrap 
------------------------------------------------------------------------------------------------------------------------- 

- Daemon_Check-Bootstrap 서버 확인  
(connect)chatonop@ip-10-132-5-204:~$ pkr1ms002m 
chaton@i-3850-19819-VM:~$ ps -ef  grep Daemon_Check-Bootstrap  ===> Daemon_Check-Bootstrap 살아 있는지 확인 
chaton    5763  4379  0 11:00 pts/1    00:00:00 grep --color=auto Daemon_Check-Bootstrap 
chaton@i-3850-19819-VM:~$ ps -ef  grep Bootstrap 

chaton@i-3850-19819-VM:~$ tail -f /home/chaton/msg/log/Chaton_message_server  grep ‘Summary’   ===> 안됨 
chaton@i-3850-19819-VM:~$ tail -f /mnt/log/Chaton_message_server  grep Exception  
------------------------------------------------------------------------------------------------------------------------- 

chaton@i-3850-19819-VM:/mnt/log$ ps -ef  grep Bootstrap 
chaton    8755  3543  0 11:07 pts/3    00:00:00 grep --color=auto \[Bootstrap\] summary 
chaton   10031  9930  0 11:13 pts/0    00:00:00 grep --color=auto \[Daemon_Check-Bootstrap\] summary 
chaton   14720  9930  0 11:36 pts/0    00:00:00 grep --color=auto Bootstrap 
==============================================================================================================

- pkr1ms002m 서버 KST 19시 37분부터 로그 저장이 멈춰진 것 추정됨 
chaton@i-3850-19819-VM:~$ tail -f /mnt/log/Chaton_message_server 
Aggregation: 2 (ms), 2 (ms) for block-check. 
Inbox(IN): 4 (ms) 
        <<Delivery>> #receiver = { chatonId = 821099101265, uid = 125e675b-44a7-4a7e-8f03-0e52a246c253, channelId = 424205790 } 
        <<Push>> #receiver = { chatonId = 045001007659049, uid = c5246cb7-c00f-4d7b-afa9-6e41b03b2810 } 
        <<Push>> Push-Request was successful: 8 (ms) 
Delivery-To-Device: 8 (ms) 
Reply write(): 0 (ms) 
------------------------------------------------------------------------------------------------------------------------- 

[INFO]  2013-03-27 10:37:07,631  [CONNECTIONMANAGER_CLOSER] Thread-30  com.sec.ssm.cm.netty.NettyServer   
- [CM] [-] Channel disconnected. { Total = 508, channelId = 835366821, Peer = 223.62.172.83:52944 } 
[INFO]  2013-03-27 10:37:07,640  [CONNECTIONMANAGER_CLOSER] Thread-23  com.sec.ssm.cm.netty.NettyServer   
- [CM] [-] Channel disconnected. { Total = 507, channelId = 1734806430, Peer = 223.62.172.2:27840 } 
==============================================================================================================

- IP Time 공유기 설정(2013.03.27(수)): 새문빌라 301호 
1) IP주소: 192.168.0.2, GW: 192.168.0.1 
2) SM: 255.255.255.0, DNS: 168.126.62.1, 168.126.62.2 
------------------------------------------------------------------------------------------------------------------------- 

- 공유기(IP Time) 환경 설정 
1. http://192.168.0.1/login/login.cgi?search=1 
2. 무선 설정 
 1) SSID(네트워크 이름): 01_iptiime_TAMA 
 2) 무선 보안 설정 
  가. 암호화 알고리즘: WPA(AES) 
  나. WEP 키 입력 방법(수동 입력): 339000339(비밀키) 
==============================================================================================================

- 덕은 조명(명식이 아제) 
1. 주소: 경기도 고양시 일산동구 사리현동 827-2, T) 031-962-4605  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.28(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:50 ~ 18:00 

- ChatON 운영 Prj
- 1.7. Trunk Item Comment 소스 분석(로직, DB 테이블 연관성 분석) 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.29(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:55 ~ 18:00 

- ChatON 운영 Prj
- 1.7. Trunk Item Comment 소스 분석(로직, DB 테이블 연관성 분석) 
==============================================================================================================

- 1.9. SNS Friend management  
1.9.1. Get SNS ID ==> 더보기 > 설정 > 계정 관리 
1.9.3. Post SNS friend List ==> 친구 > 친구에게 알리기 > Twitter > chatON을 사용하는 친구 
==============================================================================================================

- 이불  ==> 11번가 구매 @@@@@  
1. [이브앤by이브자리] 캠프 차렵이불 S(160*210), 55,200원 --> 구매 
http://www.11st.co.kr/product/SellerProductDetail.tmall?method=getSellerProductDetail&prdNo=576008262&xzone=cart^list&xfrom=cart^list&bcktType=01  
==============================================================================================================

- 카페트 ==> 신세계몰 구매 예정 @@@@@ 
1. 늘푸른산업 레온 NEW 앨리스 번아웃 카페트 (200x250cm), 색깔: 베이지, 49,305원(신한카드 7% 할인), 50,862원 
http://mall.shinsegae.com/item/item/itemDetail.do?item_id=13372630&sale_shop_id=0&sale_shop_gubun_code=05 
http://prod.danawa.com/info/?pcode=1524073&cate1=1826&cate2=11545&cate3=37682&cate4=&keyword=#bookmark_product_information 

1. 레온 앨리스 번 아웃 카페트, 크기: 200*250, 색깔: 베이지, 58,310원 
http://item.gmarket.co.kr/detailview/item.asp?goodscode=153902857 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.30(토) 작업 ■■■■■■■■■■■■■■■■■■

▦조기축구
06:00 기상 
06:10 국민은행 봉천동지점 앞(태훈이형 차) 
06:30 신구초등학교 
07:00 숏게임(3:3 무) 
08:00 종료 
08:20 조식(화정식당: 닭곰탕): 영석이형이 PK 내기 져서 쏨(신입 회원: 오태훈) 
09:00 종료 
09:30 귀가 
10:30 이마트 장보기(KT 인터넷 사은품(신세세 상품권 11만원 사용)) 
       -  이불(베개), 뚫어  뻥(휴지통), 식기 건조대, 삼겹살 구이판 
13:00 귀가 
14:00 KT Skylife TV 설정 방문(비밀번호: 3399로 세팅되어 있었음) 
14:00 TV 시청(2013년 프로야구 개막전)  
19:00 석식 
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.03.31(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 06:30 ~ 18:00 

▦조기축구
06:00 기상  
06:20 국민은행 봉천동지점 앞(태훈이형 차) 
07:10 신구초등학교 
07:30 숏게임(3:3 무) 
09:30 게임(1:0 승) 
10:00 게임(1:1 무) 
10:20 게임(1:0 승): 골기퍼 
10:30 종료  
11:10 중식(문경세재: 갈비탕): 오세림 고문님이 쏨 
12:30 종료 
13:00 귀가 
13:10 이발(봉천동: 빅맨) 
13:50 관악프라자 사우나(6천원) 
16:00 귀가 
16:20 TV 시청 
20:00 석식(돼지 갈비살(11.8kg) 구입해서 삼겹살 구이판으로 구워 먹기) 
21:30 TV 시청(개그콘서트) 
24:20 취침 
==============================================================================================================

- 비밀번호(2013.04.01(월)) 
1. 현관문: 1237 
2. 301호: 0508 
3. Skylife TV: 3399 
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■