

■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+---------------------------------------------// Memo(2013.06) //----------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■


■■■■■■■■■■■■■■■■■■ 2013.06.01(토) 작업 ■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말
08:00 기상
08:30 조식(식빵)
09:10 집출발
11:40 1호선 오산역 도착(1시간 30분 소요)
11:50 오산 컨벤션웨딩홀 부페 4층 컨벤션홀 도착
12:00 응아 부부 도착
12:10 중식(부페 2층)
13:00 결혼식(공종현, 딘티프엉)
13:30 결혼식 종료
14:30 폐백 종료
15:30 서울대입구역
16:30 롯데리아(팥빙수, 와풀)
18:50 귀가
18:30 석식(오징어덮밥, 카페덮밥, 우동): 김밥친구
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.02(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

▦조기축구
06:00 기상
06:30 국민은행 봉천동지점 앞(태훈이형 차)
07:00 신구초등학교
07:20 숏게임(3:2 패) ==> 새 유니폼 지급 받음(하복, 상하 빨간색)
08:30 게임(5:4 승) 
09:50 종료 
10:20 중식(문경세재: 갈비탕): 회장님이 쏨, 돌솥 포장해서 옴(루옌)
12:00 종료
12:40 귀가
13:10 낮잠
18:00 석식
19:00 중앙 마트
20:00 귀가
22:00 TV 시청(개그콘서트)
24:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.03(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- ChatON 운영 Prj
- 2차 대응 교육
1. 일시:
 1) 오전: sv(MSC 김영국 선임, 최상락 선임): 전자 서비스 담당자
 2) 오후: mc(MSC 신규현 책임, 주효진 사원)
==============================================================================================================
 
- Log file backup 구성 분석 및 설정 작업
1. WinSCP를 실행(00. ChatON 중계(21번)_chatonop[메인])해서
로컬에 있는 bklog-v0.1-20130603.tgz 파일을 GLD의 /home/chatonop/war/sv 폴더에 복사
2. 터미널 연결(GLD에서)
(connect)chatonop@ip-10-132-5-204:~$ alias  grep rue1sv001
alias rue1sv001='ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 chaton@*.com'
(connect)chatonop@ip-10-132-5-204:~/war/sv$ scp -i /home/chatonop/keys/pprd/rue1sv.pem -P 2022 ./bklog-v0.1-20130603.tgz chaton@*.com:/home/chaton
$ scp -옵션 [옮길파일] [서버계정@서버아이피:/저장공간] ===> $ scp -r /home/search/test search@10.1.51.168:/home/solution
$ scp -P 복사된 포트번호 -r /원본 데이터 경로/ username@200.200.200.200:복사된 데이터 경로  
 
3. AWS 설정(Prerequisite)
(connect)chatonop@ip-10-132-5-204:~$ ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 ubuntu@*.com
==> ubuntu로 로그인 할 것 @@@
ubuntu@ec2-54-242-77-56:~$ sudo su
root@ec2-54-242-77-56:/home/ubuntu# apt-get install s3cmd
4. bklog 설정(rue1sv001 연결)
(connect)chatonop@ip-10-132-5-204:~$ rue1sv001
chaton@ec2-54-242-77-56:~$ cd /home/chaton  
chaton@ec2-54-242-77-56:~$  ll
drwxr-xr-x 3 chaton chaton    4096 2013-06-03 10:43 bklog/
-rw-r--r-- 1 chaton chaton    2460 2013-06-03 23:58 bklog-v0.1-20130603.tgz ==> 파일 복사 됨 @@@
-rw-r--r-- 1 chaton chaton    2412 2013-06-03 07:57 bklog-v0.1.tgz
chaton@ec2-54-242-77-56:~$ rm -rf bklog  ==> 디렉토리tmp와 하위 모든것을 강제로 지움(절대 사용 금지) @@@
chaton@ec2-54-242-77-56:~$ tar xvfz /home/chaton/bklog-v0.1-20130603.tgz  ==> 압축을 해제 @@@
chaton@ec2-54-242-77-56:~$ cd /home/chaton/bklog ==> .plog.s3cfg” directory와 bklog scripts가 존재하는지 확인 @@@
chaton@ec2-54-242-77-56:~$ chmod a+x /home/chaton/bklog/bklog ==> 실행 권한을 부여 @@@
chaton@ec2-54-242-77-56:~$ vi /home/chaton/bklog/bklog ==> 수정작업 @@@ 
chaton@ec2-54-242-77-56:~$ ./bklog ==> 실행 @@@
5. crontab 설정
chaton@ec2-54-242-77-56:~$ echo "0 2 * * * /home/chaton/bklog/bklog"  crontab -u chaton - 
chaton@ec2-54-242-77-56:~$ crontab -l 
6. AWS TEST: https://console.aws.amazon.com/s3/home?region=us-east-1
 ==> 매시간 1분마다 서버시간 대비 30일 이상 경과한 logfile들이 S3에 upload
 ex) 운용 buddy서버 1번의 경우 ->  prd/bd/pue1bd001m/[source file name].gz
chaton@ec2-54-242-77-56:~$ touch -t 04110111 web.log.2013-04-0*   ===> 파일 생성일자 변경 @@@
-rw-r--r-- 1 chaton chaton       5 2013-04-11 01:11 web.log.2013-04-01
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.04(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 비정기 디플로이(buddy: 임정현 과장), 민정현 선임 투입

- ChatON 운영 Prj
- 2차 대응 교육
1. 일시:
 1) 오전: sa(MSC 전승일 선임), ba(MSC 배종규 선임)
 2) 오후: cs(MSC 서영준  선임), co(MSC 이인수 선임)
==============================================================================================================

- App log preproductin 환경 수정 및 테스트
1. 테스트 파일 생성 및 AWS upload 확인
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.05(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 모태산부인과(19시, 임신 의사 소견서), 김홍원과장이 김방현 책임과 싸움

- ChatON 운영 Prj
- 2차 대응 교육
1. 일시:
 1) 오전: wf, am,l m, wm(MSC 서애선 책임, 임은희 선임)
 2) 오후: os, ob, ws, wb(MSC 이지연 선임, 홍영택 선임)
==============================================================================================================

- 표준 쉘 교육(18시, 권영오 수석)
6.5 18:00  표준 쉘 교육
~ 6.5 App log preproductin 적용 완료(기능확인 필수)
~ 6.12 표준쉘 작성/검증 완료
6.13  App log production 적용/기능 확인
6.14  App log production 기능 정상작동 여부 확인, 표준쉘 production 에 설치(기능 점검은 deploy시)
- Shell 프로그래밍의 기본: http://wiki.kldp.org/Translations//html/Shell_Programming-KLDP/index.html
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.06(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 

- 현충일 휴무
08:00 기상
09:30 기상
10:00 조식(식빵)
15:00 석식(된장국 + 쌰브쌰브): 2만 3천원
15:30 장보기(중앙 마트)
17:00 귀가
20:00 석식(빵)
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.07(금) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 당직

- ChatON 운영 Prj
- web 중복가입자 최근 거래 시간 파악
1. rue1bd001(pkr1bd002m) 서버의 1월~6월 로그중 해당 UID건 이어서 검색(1 ~227번까지)
$ grep -c "22841b09-e844-4e9c-a732-dc070fd10901" /home/chaton/buddy/log/pkr1bd002m/web.log.2013-05*  sort -r 
===> count 조회 후 sort 처리 @@@
$ cat /home/chaton/buddy/log/pkr1bd002m/web.log.2013-06-03  grep -E "22841b09-e844-4e9c-a732-dc070fd10901" 
===> 조회 처리 @@@
------------------------------------------------------------------------------------------------------------

(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ pkr1bd002m
chaton@i-5925-32288-VM:~$ cd /mnt/log
chaton@i-5925-32288-VM:/mnt/log$ tar zcvf weblog-04.tgz web.log.2013-04-*  ===> web.log.2013-04 파일들을 tar 파일로 묶기 @@@
chaton@i-5925-32288-VM:/mnt/log$ scp -P 2042 -i /home/chatonop/keys/ucloud.pem chaton@14.63.224.156:buddy/log
/weblog-04.tgz ===> pkr1bd002m에서 GLD로 tar 파일 복사 @@@
--> $ scp -옵션 [옮길파일] [서버계정@서버아이피:/저장공간] 
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ alias  grep pkr1bd002m
alias pkr1bd002m='ssh -p 2042 -i /home/chatonop/keys/ucloud.pem chaton@14.63.224.156'
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ alias  grep rue1bd001
alias rue1bd001='ssh -i /home/chatonop/keys/pprd/rue1bd.pem -o StrictHostKeyChecking=no -p 
2022 chaton@ec2-184-72-137-203.compute-1.amazonaws.com'
chaton@i-5925-32288-VM:/mnt/log$ scp -P 2022 -i /home/chatonop/keys/pprd/rue1bd.pem ./weblog-04.tgz 
chaton@ec2-184-72-137-203.compute-1.amazonaws.com:buddy/log/weblog-04.tgz ===>  GLD에서 rue1bd001로 tar 파일 복사 @@@
 
chaton@i-5925-32288-VM:/mnt/log$ tar xvf weblog-04.tgz   ===> web.log.2013-04 파일들을 tar 파일로 풀기 @@@
==============================================================================================================

- [우리금융저축은행] 생계형(비과세) 정기예금복리 예금[만기해지] @@@@@@
1. 계좌번호: 062-01-24-3447468
2. 예금주: 진덕근
 1) 원금: 30,000,000원, 실수령액: 31,315,729원
 2) 이자율: 연4.38%, 예치기간: 12개월, 만기일자: 2013/06/08
 URL: http://www.woorifgsb.com
---------------------------------------------------------------------------------------------

- [우리금융저축은행] 세금우대 정기예금복리 예금 ==> 2012년 6월 07일[만기해지]  @@@@@@
1. 계좌번호: 062-01-24-3447476
2. 예금주: 진덕근
 1) 원금: 15,000,000원, 실수령액: 15,595,384원
 2) 이자율: 연4.38%, 예치기간: 12개월
 ==> 총 입금액: 45,000,000원, 총 출금 예상액: 46,911,113원
==============================================================================================================
 
- 한화생명 보험 약관 대출 완전 상환
1. 보험 약관 담보 대출(한화생명): 9,000,000원[한화생명 콜센터에 전화(1688-6353)로 요청] 
2. 전체 상환: 9,000,000원(이자 16,646원 납부) ==> 총 9,016,646원 납부 완료
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.08(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말
09:00 기상
08:30 조식
09:10 모태산부인과(임신 진단서): 예약하고 갔는데도 40분 기다리게 해서 싸움
12:00 시장(다이소, 중앙 마트)
15:00 중식
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.09(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

▦조기축구
05:40 기상
06:10 국민은행 봉천동지점 앞(태훈이형 차)
06:30 신구초등학교
07:20 숏게임(4:1 승)
08:30 게임(7:1 패) ==> 수박 2통(김영배 고문이 쏨)
09:50 종료  
10:40 귀가
12:00 중식
13:00 낮잠
18:30 석식(짜장면, 갈비탕, 순두부): 포마토
19:00 시장(중앙 마트)
20:00 귀가
22:00 TV 시청(개그콘서트)
24:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.10(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 본 클리닉 예약(12:40): 콘트락 투벡스(관악종로약국): 눈 흉터 연고 처방(2만원), 김홍원 과장 철수

- ChatON 운영 Prj
- 제니퍼 교육(10시)
1. 1차 기본교육: 6월 10일 월요일 10:00 ~ 12:00
2. 장소: 7층 1회의실
==============================================================================================================

- 표준 디렉토리 생성 및 관련 tool 설치 작업 수행
    1) G/W Server /home/chatonop/pprd-file/pre-work 안에 shell_install.tar 파일 존재
    2) Deploy 대상 서버에 shell_install.tar 파일 copy
    3) 압축 풀기
    4) root 계정으로 전환
    5) Deploy file 저장/Backup 디렉토리 생성
        ./1.mkdir.sh 실행
        : 실행 후 디렉토리 생성 및 chaton 권한 확인
        : /mnt/deploy/file, /mnt/deploy/backup
        : home/chaton/deploy 링크 및 chaton 권한 확인
    6) s3cmd 설치
        ./2.s3cmd.sh 실행 (pre-production 실행 안 해도 됨)
    7) ELB-JAR 설치 (ELB 사용하는 서버만 실행) 
(connect)chatonop@ip-10-132-5-204:~$ cd /home/chatonop/pprd-file/pre-work
(connect)chatonop@ip-10-132-5-204:~/war/sv$ scp -i /home/chatonop/keys/pprd/rue1sv.pem -P 2022 ./shell_install.tar chaton@*.com:/home/chaton
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.11(화) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 중식(중국집: 셀 중식(남선임이 쏨)), W24 정기 배포(23:30)[2조]

- ChatON 운영 Prj
- mysql plan 교육(10시)
==============================================================================================================

- 표준 Shell 작성
1. 표준 shell 작성 경로: cd /home/chaton/service/shell  ==> cd /home/chaton/buddy/shell
2. ELB 작업 관련 파일 경로:  /home/chaton/elb_tool
3. home 경로에서 deploy 경로 링크: home/chaton/deploy --> /mnt/deploy
4. G/W Server에서 copy된 파일 경로: /mnt/deploy/file
5. Deploy shell 실행 시 기존 파일 백업 경로: /mnt/deploy/file
6. Deploy shell 실행 시 기존 파일 백업 명: ROOT.war.201306012005
51. 파일 전송 shell(GLD에서)
$ ./send_file.sh rue1bd001 /home/chatonop/deploy/pre/sv/buddy-dbd-v2.2.1-rc06010.war
------------------------------------------------------------------------------------------------------

kill.sh ==> 생성
run.sh ==> 생성
re.sh ==> 생성
de.sh ==> ./de.sh buddy-dbd-v2.2.1-rc06010.war lb-rue1sv ==> 생성
autorun.sh ==> 생성
status.sh ==> 생성
elb_op.sh ==> ./elb_op.sh lb-rue1sv on[on/off] ==> ELB-JAR 설치하면 자동 생성됨
==============================================================================================================

- /status.sh 파일에서
_LAUNCHER=Bootstrap
_LOGLAUNCHER=tomcat
_LAUNCHERPort=5223
_LOGLAUNCHERPort=11002
#cassCheck=`netstat -na  grep 11160  grep -v grep  wc -l`
mysqlCheck=`netstat -na  grep 5306  grep -v grep  wc -l`
 
#echo "[status_t.sh] [mysqlCheck]"$mysqlCheck    ====> 로그 분석 @@@
echo "[status_t.sh] [test_00]=======>" 
ps -ef  grep $_LAUNCHER  grep -v grep > /dev/null
echo "[status_t.sh] [chek...NO1] [$?] "$? "[...]"
if [ $? = 0 ]; then
    if [ $mysqlCheck != 0 ]; then
      echo "It's running!"
      ps -ef  grep $_LAUNCHER  grep -v grep
      netstat -na  grep $_LAUNCHERPort  grep LISTEN
      echo "Mysql DB : " $mysqlCheck "Connections"
      echo "Cassandra DB : " $cassCheck "Connections"
      echo
      ps -ef  grep $_LOGLAUNCHER  grep -v grep > /dev/null
     echo "[status_t.sh] [chek...NO2] [$?] "$? "[...]"
      if [ $? = 0 ]; then
        echo "logcollect's running!"
        ps -ef  grep $_LOGLAUNCHER  grep -v grep
        netstat -na  grep $_LOGLAUNCHERPort  grep LISTEN
      elif [ $? != 0 ]; then
        echo "logcollect problem!!!"
      fi
    elif [ $mysqlCheck = 0 ]; then
      echo "Mysql DB Connection problem!!!"
    fi
 
elif [ $? != 0 ]; then
  echo "Service Server is dead"
fi
==============================================================================================================
 
- prd, pre-prd 연결 방법 교육
1. 민정현 과장
==============================================================================================================

- USD-CNH 환율 예금(SC은행)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.12(수) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:30 --> 주간회의(PM 참석): 핵심 업무 보고(개인별), 운영일지 분석, 2차대응 교육 정량화

- ChatON 운영 Prj
- ChatON Jumphost 접권권한 강화(개인 계정 사용)
tamario2.jin / !tama339(ssm2011) ==> -pw !tama339
(connect)tamario2.jin@ip-10-132-5-204:~$ su chatonop
Password: cotdhs2013!@#
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ rue1sv001  ==> pue1sv001
--------------------------------------------------------------------------------------------------------------

- .bashrc 파일 변경
접속한 root 폴더에 보시면 .bashrc 라는 파일이 있는데.. 
vi로 여신 다음에 맨 아래에 다음을 입력하고 저장하시고 재 접속하시면 됩니다. 
(connect)tamario2.jin@ip-10-132-5-204:~$ ll 
drwxr-xr-x  3 tamario2.jin osdssup   87 2013-06-12 00:14 ./
drwxr-xr-x 97 chaton       chaton  4096 2013-06-11 10:59 ../
-rw-------  1 tamario2.jin osdssup  257 2013-06-12 01:29 .bash_history
-rw-r--r--  1 tamario2.jin osdssup  220 2010-04-19 02:15 .bash_logout
-rw-r--r--  1 tamario2.jin osdssup 3103 2010-04-19 02:15 .bashrc
drwx------  2 tamario2.jin osdssup   33 2013-06-12 00:02 .cache/
-rw-r--r--  1 tamario2.jin osdssup  675 2010-04-19 02:15 .profile
(connect)tamario2.jin@ip-10-132-5-204:~$ vi .bashrc  ==> .bashr 파일에 아래 내용 추가하고 재시작할 것 @@@@
# alias info 추가
. /home/chatonop/alias/pue_alias.txt
. /home/chatonop/alias/pew_alias.txt
. /home/chatonop/alias/pas_alias.txt
. /home/chatonop/alias/pan_alias.txt
. /home/chatonop/alias/pkr_alias.txt
. /home/chatonop/alias/rue_alias.txt
. /home/chatonop/alias/nonfunction_alias.txt
(connect)tamario2.jin@ip-10-132-5-204:~$ alias  grep sv001
(connect)tamario2.jin@ip-10-132-5-204:~$ pue1sv001
Enter passphrase for key '/home/chatonop/keys/fa-pue1app-chaton-pue1cs.pem':
==============================================================================================================
 
- 비밀번호 변경(리눅스): password
(connect)tamario2.jin@ip-10-132-5-204:~$ passwd
Changing password for tamario2.jin.
(current) UNIX password:
Changing password for tamario2.jin.
(current) UNIX password:
Enter new UNIX password: !tama339
(connect)tamario2.jin@ip-10-132-5-204:~$ cd /home/chaton
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.13(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- ChatON 운영 Prj
- bklog 테스트
1. bklog-v0.21 수정 후 crontab 처리 여부 테스트 완료(6.13)
-----------------------------------------------------------------------------------------------------------------------------

- 파일 삭제(유닉스, unix)
chaton@ec2-54-242-77-56:~$ rm bashrc  ==> 파일 삭제 @@@
chaton@ec2-54-242-77-56:~$ rm -rf bklog  ==> 디렉토리tmp와 하위 모든것을 강제로 지움 @@@ 
- 폴더명 변경(유닉스, unix)
chaton@ec2-54-242-77-56:~$ mv .plog.s3cfg/ .rlog.s3cfg/    ==> plog.as1.s3cfg 폴더를 rlog.as1.s3cfg 폴더로 변경 @@@
- 파일명 변경(유닉스, unix)
chaton@ec2-54-242-77-56:~$ mv plog.an1.s3cfg rog.an1.s3cfg    ==> log.an1.s3cfg 파일을 rog.an1.s3cfg 파일로 변경 @@@
- 파일명 복사(유닉스, unix)
chaton@ec2-54-242-77-56:/mnt/log$  cp -p web.log.2013-06-11  web.log.2013-05-05    ==> web.log.2013-06-11 파일을 복사 @@@ --> cp 원본파일 새로운파일
- 파일 생성일자 변경
chaton@ec2-54-242-77-56:~$ touch -t 05060111 web.log.2013-05-05  ===> 파일 생성일자 변경 @@@
==============================================================================================================
 
- 방화벽Map 작성
1. pre-prd: lb-rue1sv
- instance 접속하여 ip 확인
-- public DNS
curl --url http://169.254.169.254/latest/meta-data/public-hostname
-- public IP
curl --url http://169.254.169.254/latest/meta-data/public-ipv4
-- private DNS
curl --url http://169.254.169.254/latest/meta-data/local-hostname
-- private IP
curl --url http://169.254.169.254/latest/meta-data/local-ipv4 
==============================================================================================================

- Shell script 교육
http://blog.naver.com/akrthwn?Redirect=Log&logNo=140017739530
==============================================================================================================

- 공증 집행
1. 공증을 하였다면 우선 공증을 한 사무실에 가셔서 집행문을 부여받아야 합니다.  
그후에 집행문을 가지고 채무자의 재산에 따라 강제집행을 하여야 합니다.  
구체적으로 채무자의 재산이 채권이라면(예컨대, 월급, 전세보증금, 예금 등) 채권압류 및 추심명령을 신청
하여야 하고, 채무자의 재산이 부동산이라면 부동산 경매신청을 하여야 합니다. 
2. 공증 상 지급기일이 경과되었다면 공정증서에 집행문을 부여 받아 바로 강제집행이 가능하신 상황입니다. 
그러나 집행을 하고자 하실때 상대방의 어떠한 재산을 집행할지를 먼저 확정하셔야 하겠지요. 
즉, 통상 집행할 수 있는 상대방의 재산에는 부동산, 예적금, 보험금, 보증금, 자동차, 유체동산, 급여, 사업자 
매출 등이 해당하는데 이러한 상대방의 재산을 정확히 파악하는 절차가 선행 되어야 할 것입니다. 
그 후 가장 적절한 재산에 대하여 강제집행을 실시하여야 실익을 보실 수 있을 것입니다. 
따라서 상대방의 재산을 정확히 파악하여 보시기를 권유 드립니다.
http://www.lawofficekorea.com/index.htm
==============================================================================================================

- 노트북 구입(베트남 할아버지댁)
1. MSI  A610-i5 FHD Vegas (500GB), 582,000원, http://prod.danawa.com/info/?pcode=1733427&cate1=860&cate2=869&cate3=12734&cate4=&keyword=MSI#bookmark_product_information
2. 하이엔드: 서울 용산구 원효로3가 원효전자상가 6동 3층 112호 하이엔드, T) 714-6579, http://highendcnc.co.kr/product/productView.php?nProdCode=1733427
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.06.14(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 김성채 팀장 방문(회식 공고)
- ChatON 운영 Prj
- 방화벽Map 작성
1. eu(pew1sv001) 작업
1) lb-pew1sv, service
==============================================================================================================

- ISMS 교육(15시)
일시 : 2013.06.14(금), 15:00 ~ 15:30
장소 : 823빌딩 7층 1회의실 
강사 : 김원기 수석
==============================================================================================================

- 회식 공고
1) 일시: 6월 19일(수) 18시 30분
2) 장소: 마키노차야(서울 강남구 역삼동 824-24번지 지하1층, ☎565-1116): http://www.makinochaya.co.kr 
==============================================================================================================

- [국민은행] KB Smart폰 예금 가입 ==> 2013.06.14(금) @@@@@@
1. 계좌번호: 349415-2365569
2. 예금주: 진태만
 1) 원금: 30,000,000원, 실수령액: 30,761,400원
 2) 이자율: 연3.0%, 예치기간: 12개월, 만기일자: 2014/06/14
 URL: http://www.woorifgsb.com
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.15(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말
09:00 기상
08:30 조식(식빵)
10:50 연세에이플러스치과 ==> 앞 잇몸 레이저 절제, 윗니 2개(연세에이플러스 치과): 루옌
	 1. 연세에이플러스치과(서울 관악구 봉천6동 858-7번지), ☎888-7976 
	 2. 진료시간 --> 평일: 10 ~19시 목욜: 15 ~ 21시, 토욜: 10 ~14시
12:40 다이소(마스크)
14:00 시청역
14:20 시청 광장
14:40 광화문 광장
15:00 중식(짜장면:곱, 마파 두부밥): 청빈(영민이형 막내 아들)
16:00 청계천(발 담그기)
18:00 시청역
19:00 귀가
22:00 샤워(같이 함)
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.16(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

▦조기축구
05:00 기상
05:10 2013 FIFA 컨페더레이션스컵 개막전(브라질 3:0 일본)
06:10 집출발(버스)
06:50 신구초등학교
07:20 숏게임(1:1 무)
08:30 게임(7:5 승)
09:50 종료  
10:40 귀가
12:00 중식(짜장면, 갈비탕, 오므라이스 --> 포마토): 루옌
15:00 낮잠
19:00 산책
20:00 석식(집에서 삼겹살 구워 먹음)
22:00 TV 시청(개그콘서트)
24:20 취침
==============================================================================================================
  
■■■■■■■■■■■■■■■■■■ 2013.06.17(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- ChatON 운영 Prj
- 표준 Shell 작업(US, SG)
1.1  AWS 설정(Prerequisite)
2. 터미널 연결(GLD에서): rue1sv001 에서
(connect)chatonop@ip-10-132-5-204:~/war/sv$ alias  grep rue1sv001
alias rue1sv001='ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 chaton@*.com' 
(connect)chatonop@ip-10-132-5-204:~$ ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 ubuntu@*.com
==> ubuntu로 로그인
ubuntu@ec2-54-242-77-56:~$ sudo su
root@ec2-54-242-77-56:/home/ubuntu# apt-get install s3cmd
==============================================================================================================

- log 경로
(pue1sv001)chaton@ec2-50-19-49-170:$ cd /mnt/log
- big data log 경로
(pue1sv001)chaton@ec2-50-19-49-170:$ cd /mnt/ssm/logs 
==============================================================================================================

- 제니퍼 교육(10시)
1. 2차 기본교육: 6월 17일 월요일 10:00 ~ 12:00
2. 장소: 7층 1회의실
==============================================================================================================

- 변기 막힘 처리
1. 거실 변기를 뻥뚜(비닐로 변기통 주면을 테이프로 감싸고 세게 누름) 방식으로 막힌 것 해결
http://kin.naver.com/qna/detail.nhn?d1id=8&dirId=80901&docId=174136742&qb=67OA6riwIOunie2emA==&enc=utf8
&section=kin&rank=1&search_sort=0&spq=0&pid=RkHfDU5Y7vRsscw9ZeCssssssso-124277&sid=f7ib4AtouVEAABiDdAEAAABF
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.18(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 당직

- ChatON 운영 Prj
- 표준 Shell 작업(미국, 싱가폴, 중국)
1. 중국 
 1) vi 작업 중 Backpace 안 먹음
 가. root 계정으로 접속해서 sudo apt-get install vim 하시면 됩니다. 
------------------------------------------------------------------------------------------------------------------------

- tar 파일 생성
tar zcvf weblog-05.tgz web.log.2013-05*    ===> tar 파일 생성 @@@ 
--> web.log.2013년 5월달 파일을 web.log.2013-05.tgz 파일로 생성할 것 @@@
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.19(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 회식(마키노차야), 장인, 장모 비자 발급(하노이 대사관)

- ChatON 운영 Prj
- 로그 백업 작업(미국, 싱가폴, 중국) 
==============================================================================================================

■ 표준 쉘 작업(~6.18, 운영담당자)
   - 표준 쉘 복사 AWS 대상 (6.17) 
   - 표준 쉘 복사 KR, CN 대상 (6.18)  <-- 화요일날 KR, CN 대상으로 진행예정
■ 로그 백업 작업(~6.25, 운영담당자)
   - AWS, KR 대상 (~6.21): cron 등록은 19일 또는 20일에 등록 예정 ==> (미국, 싱가폴)
   - CN 대상 (6.24~6.25) ==> (중국)
==============================================================================================================

- pkr1sv002 ==> GLD(pkr1sv002에서 tar 파일 만들어서 rue1sv001 파일 복사 방법)
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ pkr1sv002
chaton@i-5925-32288-VM:~$ cd /mnt/log
chaton@i-5925-32288-VM:/mnt/log$ tar zcvf weblog-05.tgz web.log.2013-05-3*  ===> web.log.2013-04 파일들을 tar 파일로 묶기 @@@
chaton@i-5925-32288-VM:/mnt/log$ tar tvf weblog-05.tgz   ===> 압축된 tar 파일 확인  @@@
1) pkr1sv002  서버에서 GLD로 복사
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$  alias  grep pkr1sv002
alias pkr1sv002='ssh -p10206 -o StrictHostKeyChecking=no -i /home/chatonop/keys/ucloud.pem chaton@14.63.218.169'
 가.(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$  scp -P10206 -i /home/chatonop/keys/ucloud.pem 
 chaton@14.63.218.169:/mnt/log /home/chatonop/war/sv/weblog-05.tgz   
 ===> pkr1sv002에서 GLD로 tar 파일 복사 (pkr1sv002 이용) @@@
   ===> GLD에서 rue1sv001로 tar 파일 복사 @@@  --> $  scp -옵션[서버계정@서버아이피:/저장공간(/mnt/log)] [옮길파일
   (/home/chatonop/war/sv/weblog-05.tgz)] 
 나. (pkr1sv002)chaton@i-3852-28423-VM:~$ scp -P 22 /mnt/log/weblog-05.tgz chatonop@46.51.247.21:/home/chatonop/war/sv
 ===> pkr1sv002에서 GLD로 tar 파일 복사(GLD 서버 이용) @@@
 ===> GLD에서 rue1sv001로 tar 파일 복사 @@@  --> $  scp -옵션 [옮길파일(/home/chatonop/war/sv/weblog-05.tgz)] 
 [서버계정@서버아이피:/저장공간(/mnt/log)] 
 
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ cd /home/chatonop/war/sv
2) GLD로에서 rue1sv001로 복사
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ alias grep rue1sv001
alias rue1sv001='ssh -i /home/chatonop/keys/pprd/rue1sv.pem -o StrictHostKeyChecking=no -p 2022 chaton@*.com'
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ scp -i /home/chatonop/keys/pprd/rue1sv.pem -o 
StrictHostKeyChecking=no -P 2022 /home/chatonop/war/sv/weblog-05.tgz chaton@*.com:/mnt/log
 ===> GLD에서 rue1sv001로 tar 파일 복사 @@@  --> $ scp -옵션 [옮길파일(/home/chatonop/war/sv/weblog-05.tgz)] 
 [서버계정@서버아이피:/저장공간(/mnt/log)] 
 
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$ rue1sv001
chaton@ec2-54-242-77-56:~$ cd /mnt/log
chaton@ec2-54-242-77-56:~$ tar tvf weblog-05.tgz   ===> 압축된 tar 파일 확인  @@@ 
chaton@ec2-54-242-77-56:~$ tar xvf weblog-05.tgz   ===> web.log.2013-05 파일들을 tar 파일로 풀기 @@@
==============================================================================================================

- 외국인 등록증 신청시 
1. 여권사진 크기: 3.5 * 4.5cm
http://www.immigration.go.kr/HP/TIMM/images/images/hunet_pop_img.gif
==============================================================================================================

- 송금
1. 우체국 해외 송금: 100만원에 만원, 100만원 미만 8천원 --> 우체국에 방문해서 수령
2. 웨스턴유니온: 200불에 15,000원정도 1000불에 38,000원정도 수수료는 제일 비쌉
3. 계좌 이체(인터넷 뱅킹)
 1) 2천불(220만원) 이하 수수료: 만 5천, 중계 은행 수수료, 수취은행 수수료 별도 지불해야 함  
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.20(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- ChatON 운영 Prj
- 로그 백업 작업(중국)
==============================================================================================================

- SMS G/W Deploy 전달 교육
1. 강사: 이종진 과장
svn://70.4.78.107/Development/CHATON/NewDocument/04.Deploy/ChatON SMSG Server Deployment Manual_20130601.pptx
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.21(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- ChatON 운영 Prj
- 로그 백업 작업(중국)
==============================================================================================================

- 민정현 선임 OJT 계획
6.19: 서비스 서버 소개 　 　 　 　 　 　 　 　 　  　 　 　 　 
6.19: 서비스 기본 설계 
6.20: 세부 API 설명 (1/2)
6.20: 세부 API 설명 (2/2)
6.21: 서버 구성 및 디플로이
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.22(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말
09:00 기상
08:30 조식(식빵)
09:30 수도 자가 검침(대문 앞 수도 계량기에서 측정)
	 1. 고객번호: 3696446, 수용가명: 추연대외1인
	 2. 주소: 관악구 행운동 28-22 301호
	 3. 검침 등록 URL: http://i121.seoul.go.kr/egoji/jsp/front/selfcheck/selfcheckInput.jsp
	 4. 검침 결과: 2013년 6월: 0022 ==> 만 3천원 예상(자가 검침: 600원 할인)
10:10 연세에이플러스치과 ==> 윗니 3개, 스켈링(연세에이플러스 치과): 루옌  
11:50 모태산부인과 방문(당뇨 검사): 고운맘카드 사용(50,800원 사용,  404,000원 남음)
12:20 감기약, 세균 제거약, 배 연고(관악종로약국): 루옌
13:10 중식(쟁반짜장, 짬뽕, 밥: 홍매중국요리): 루옌
14:10 영화(은밀하게 화려하게, 롯데시네마서울대입구): 루옌
16:00 종료
19:00 귀가
24:00 취침 
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.23(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

▦조기축구
06:00 기상(비 약하게 옴)
06:30 국민은행 봉천동지점 앞(태훈이형 차)
07:00 신구초등학교
07:40 게임(0:2 패) ==> 삼성 조기회 초청, 비 그침
10:00 게임(5:4 승): 자체 게임
11:00 게임(1:0 승): 전패 후 마지막 게임 승
11:30 종료 
11:50 중식(문경세재: 갈비탕): 회비로 해결
12:30 종료
13:10 귀가
14:00 낮잠
18:00 기상
18:30 석식(짜장면, 떡갈비, 뚝불, 포마토): 루옌
19:00 중앙 마트
20:00 귀가
22:00 TV 시청(개그콘서트)
24:20 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.24(월) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 안미현 선임 투입

- ChatON 운영 Prj
- 업무 진행상황 공유 회의(13:30)
1) 타 시스템과 interface 내용 확인 및 정리
==> 08.SW 아키텍처 정의서_v10.docx 참고
 가. 연계 대상 서버
- SPP
- Account
- 3rd party
- SureM, Netsize
- Translation
- ChatonV
- CDN (아카마이)
2) ERD review 후 의견, ERD 확인 후 통계항목 List up (~28): 남선임
==> DB샤딩_산출물.zip 
3) 제니퍼 활용 방안 고민
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.25(화) 작업 ■■■■■■■■■■■■■■■■■■ 
---> 08:00 ~ 18:00 --> 선릉역에서 강과장 자전거 찾아옴, 생일

- ChatON 운영 Prj
- 타 시스템과 interface 내용 확인 및 정리
1. 어떤 region, 어떤 서비스 영향있는지 영향도 파악 (~27): 배책임 
 가. 연계 대상 서버  ===> Service 서버
- SPP  --> 영향 없음
- Account  --> 영향 없음
- 3rd party(제3의 App) --> 영향 없음
- SureM, Netsize  --> 영향 없음
- Translation --> 영향 없음
- ChatonV(Voice) --> 영향 없음
- CDN[Contents Delivery Network](아카마이) --> 영향 없음
==============================================================================================================

- ERD review 후 의견, ERD 확인 후 통계항목 List up (~28): 남선임
1. ERD review 통계항목 도출
 1) Profile, Trunk, PostON
==============================================================================================================

[VOC W24] ChatON Pin 이 바르지 않음 이슈 처리(~6.25):  SMS S/W VOC
pue1sm001, pue1sm002 서버에서
chaton@ec2-50-16-143-226:~$  cd /sms/log
chaton@ec2-50-16-143-226:~/sms/log$  grep '6474590324' chaton_sms.2013060*  ===> 번호가 16474590324 이고 날짜가 2013060* 인 정보 조회  @@@
chaton@ec2-50-16-143-226:~/sms/log$  grep '1370572718804' chaton_sms.20130608.log -A4  ===> Cash 방지 번호가 1370572718804 이고 날짜가 20130608 인 정보 조회  @@@
chaton@ec2-50-16-143-226:~/sms/log$  grep --color=auto --color=auto -i 'error' chaton_sms.20130610.log  more  ===> error 출력  @@@
==============================================================================================================

- SV 분석
http://lb-rue1sv-426939131.us-east-1.elb.amazonaws.com/compatibility?r=1372123535804 
com.samsungchaton.common.jaxrs.interceptor.LoginInterceptor.validateUser
http://lb-rue1sv-426939131.us-east-1.elb.amazonaws.com/compatibility?uid=1372123535804
 Fault - [54.242.77.56][2013-06-25 02:31:43.070][CCS-00010] [1372123535804]Authentication failed.
==============================================================================================================
 
- 휴대폰 구입[2013.06.25(화)]
1. 갤럭시 S3 ==> 디스플레이: 4.8인치, 배터리: 2,100 mAh, 카메라: 800만 화소, CPU: 1.4Hz 쿼드코어, RAM: 2GB, 외장메모리: 최대 64GB 지원
http://cafe.naver.com/theguildz/1205844
--> 할부원금: 3만원, 약정기간: 24개월, 위약금: 할인반환제도
가입비: 면제, 유심비: 면제, 요금제: T끼리 35(개통일 기준 93일 이후 스페셜할인내 하위요금제 변경가능), 
부가서비스: 없음, 색상: 블루, 최소유지기간: 183일
----------------------------------------------------------------------------------------------------------------------------

판매 인증 대리점: 강서블루골드, 연락처: 010-4344-4646
주소: 서울시 중구 남대문로5가 267번지 SK남산빌딩 5층 
==============================================================================================================

1. 갤럭시 S2 ==> 디스플레이: 4.3인치, 1,650mAh (표준형), 카메라: 800만 화소, CPU: 1.2Hz 쿼드코어, RAM: 1GB, 외장메모리: 최대 32GB 지원
2. 갤럭시 S4 ==> 디스플레이: 5인치, 2,600 mAh (표준형), 카메라: 1,300만 화소, CPU: 2.3GHz쿼드코어, RAM: 2GB, 외장메모리: 최대 64GB 지원
3. 갤럭시 R   ==> 디스플레이: 4.8인치, 2,000 mAh (표준형), 카메라: 500만 화소, CPU: 1.5Hz 쿼드코어, RAM: 1GB, 외장메모리: 최대 64GB 지원 
4. 베가 R3 ==> 디스플레이: 5.3인치, 배터리: 2,600 mAh, 카메라:1300만 화소, CPU: 1.5H 쿼드코어
5. 옵티머스 G ==> 디스플레이: 4.7인치, 배터리: 2,100 mAh, 카메라: 1300만 화소, CPU: 1.5H 쿼드코어 
==============================================================================================================

- 공증 집행(한중 방문)(13시): 강과장 자전거로 감
 1) 강제집행 ==> 한중(이문재 변호사), 588-8538
  가. 공증 원본 남권이형이 바꿔 치기한 것으로 추정됨
  나. 원본 분실 신고: 2~30만원 소요됨
  다. 재산조회 착수금: 22만원 ==> 김문호 실장(011-9022-7731): 의뢰서, 신분증, 초본, 공증서류, 차용증
  라. 추심하면 원금에 20%(600만원)
  마. 법무법인 한중 김영도 실장(010-3221-3345, FAX:588-1181)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.26(수) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 환급금(2013년 종합소득세 신고): 금천세무서(1,279,210원)

- ChatON 운영 Prj
- 타 시스템과 interface 내용 확인 및 정리
1. 어떤 region, 어떤 서비스 영향있는지 영향도 파악 (~27): 배책임 
 가. 연계 대상 서버  ===> Service 서버
- SPP  --> 영향 없음
- Account  --> 영향 없음
- 3rd party(제3의 App) --> 영향 없음
- SureM, Netsize  --> 영향 없음
- Translation --> 영향 없음
- ChatonV(Voice) --> 영향 없음
- CDN[Contents Delivery Network](아카마이) --> 영향 없음
==============================================================================================================

- ERD review 후 의견, ERD 확인 후 통계항목 List up (~28): 남선임
1. ERD review 통계항목 도출
 1) Profile, Trunk, PostON
 2) Profile에서 프로파일 이미지를 등록한 사용자 통계
 2) PostON에 달린 프로파일 이미지 통계
 2) Trunk에 달린 코멘트 통계
==============================================================================================================

- 채무변제 민사 소송
1) 강제집행 ==> 한중(이문재 변호사), 588-8538
법무법인 한중(http://www.hjlaw.co.kr) [서울시 서초구 서초동 1572-1 서보빌딩 3층]: 하나은행 건물
  가. 공증 원본, 신분증, 도장 지참 --> 수수료: 만원
2) 민사소송(국선 변호사 --> 승소 판결 --> 신용불량자): 법률구조공단(http://www.klac.or.kr/cyber/cyber02.do?code=18) 
3) 조남권 주소(초본): 경기도 성남시 중원구 황송로 77, 107동 2406호(금광동, 래미안 금광)
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.27(목) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 당직, 식권 30장 구매(특허층 빌딩 지하 식당)

- ChatON 운영 Prj
- 타 시스템과 interface 내용 확인 및 정리
1. 어떤 region, 어떤 서비스 영향있는지 영향도 파악 (~27): 배책임 
 가. 연계 대상 서버  ===> Service 서버
- SPP  --> 영향 없음
- Account  --> 영향 없음
- 3rd party(제3의 App) --> 영향 없음
- SureM, Netsize  --> 영향 없음
- Translation --> 영향 없음
- ChatonV(Voice) --> 영향 없음
- CDN[Contents Delivery Network](아카마이) --> 영향 없음
==============================================================================================================

- ERD review 후 의견, ERD 확인 후 통계항목 List up (~28): 남선임
1. ERD review 통계항목 도출
 1) Profile, Trunk, PostON
 2) Profile에서 프로파일 이미지를 등록한 사용자 통계
 2) PostON에 달린 프로파일 이미지 통계
 2) Trunk에 달린 코멘트 통계
==============================================================================================================

- ELB 작업 sh 수정 
02. US(미국): pue1sv001, pue1sv002 
04. SG(싱가포르): pas1sv003, pas1sv006
05. CN(중국): pcn1sv001, pcn1sv002  ==> elb 작업 없음
--------------------------------------------------------------------------------------------------------------------------

* pre-production
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$  cd /home/chaton/elb_tool
chaton@ec2-54-242-77-56:~/elb_tool$  s3cmd --force --config=/home/chaton/s3dpl.s3cfg get --force s3://chaton-ue1-repo/pre/al/install/conf/elb_op.sh
ERROR: Parameter problem: File ./elb_op.sh already exists. Use either of --force / --continue / --skip-existing or give it a new name. 
--------------------------------------------------------------------------------------------------------------------------

* production
(connect)chatonop@ip-10-132-5-204:/chaton/users/tamario2.jin$  cd /home/chaton/elb_tool
(pue1sv001)chaton@ec2-50-19-49-170:~/elb_tool$  s3cmd --config=/home/chaton/s3dpl.s3cfg get s3://chaton-ue1-repo/prd/al/install/conf/elb_op.sh
===> S3에서 elb_op.sh 파일 새로 받아와서 덮어쓰기(elb_op.sh 파일 존재해서 에러 발생) @@@
ERROR: Parameter problem: File ./elb_op.sh already exists. Use either of --force / --continue / --skip-existing or give it a new name.
(pue1sv001)chaton@ec2-50-19-49-170:~/elb_tool$  s3cmd --force --config=/home/chaton/s3dpl.s3cfg get s3://chaton-ue1-repo/prd/al/install/conf/elb_op.sh
===> S3에서 elb_op.sh 파일 새로 받아와서 강제로 덮어쓰기 @@@
ls3://chaton-ue1-repo/pre/al/install/conf/elb_op.sh -> ./elb_op.sh  [1 of 1]
 2101 of 2101   100% in    0s    10.08 kB/s  done
(pue1sv001)chaton@ec2-50-19-49-170:~/elb_tool$  ./elb_op.sh  ===> ./elb_op.sh 실행 @@@ 
==============================================================================================================
 
- SMS S/W countryRule 파일 수정 작업
chaton@ec2-175-41-156-190:~f$ cd sms/conf
chaton@ec2-175-41-156-190:~/sms/conf$ cp countryRule.txt countryRule_20130626111030.txt
chaton@ec2-175-41-156-190:~/sms/conf$ vi countryRule.txt 
chaton@ec2-175-41-156-190:~/sms/conf$ ./cntryCheck.sh
==============================================================================================================
 
- 2013년도 my Single 비밀번호 변경
1. 회사명: (주)아이엘포유, 2. 삼성SDS 사번: WA967
3. 아이디: tamario2.jin, 4. 비밀번호: sspeim883 ==> ssjtm887
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.28(금) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00 --> 노트북 시건장치 수령(7층 8D, 삼성 SDS 구자우 사원)

- ChatON 운영 Prj
- ERD review 후 의견, ERD 확인 후 통계항목 List up (~28): 남선임
1. ERD review 통계항목 도출
 1) Profile, Trunk, PostON
 2) Profile에서 프로파일 이미지를 등록한 사용자 통계
 2) PostON에 달린 프로파일 이미지 통계
 2) Trunk에 달린 코멘트 통계
==============================================================================================================

- 양집 방문
18:00 퇴근기상
18:30 귀가
18:40 석식
19:10 서울대입구역
20:30 망우역
20:40 양집(서울시 중랑구 망우동 492-31, 등나무공원 뒷편): ☎ 010-3615-3608  
20:50 양부모님에게 장모님 선물 전달 받음
21:20 망우역
22:30 서울대입구역
22:50 귀가
24:00 취침
==============================================================================================================

■■■■■■■■■■■■■■■■■■ 2013.06.29(토) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

- 주말
09:00 기상
08:30 조식(식빵)
10:00 연세에이플러스치과 ==> 윗니 1개, 윗니 1개, 잇몸(연세에이플러스 치과): 18만원
11:20 귀가
13:00 중식(보신탕, 삼계탕: 장수삼계탕): 루옌
14:00 서울대입구역
15:00 안산역
15:05 안산 다문화거리
15:30 제과점(팥빙수, 빵)
16:30 종료
17:50 귀가
24:00 취침
==============================================================================================================
 
■■■■■■■■■■■■■■■■■■ 2013.06.30(일) 작업 ■■■■■■■■■■■■■■■■■■
---> 08:00 ~ 18:00

▦조기축구
05:40 기상
06:10 국민은행 봉천동지점 앞(태훈이형 차)
06:30 신구초등학교
07:20 숏게임(2:2 무): 2골
08:30 게임(4:3 승)
09:40 종료  
10:10 중식(문경세재: 갈비탕): 회비로 해결
11:30 귀가(태훈이형 우리집 방문)
12:00 이발( 봉천동 빅맨): 스킨, 로션 구입(총 8천원)
14:00 낮잠 
17:00 기상
19:00 석식(짜장면, 설렁탕, 함박스테이크 --> 포마토): 루옌
22:00 TV 시청(개그콘서트)
23:00 염색(루옌) 
24:20 취침
==============================================================================================================
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
+--------------------------------------------------------// End //--------------------------------------------------------+
■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■